{
  "id": 7221,
  "origin_website": "Bio",
  "title": "Intracellular IRF5 Dimerization Assay",
  "procedures": [
    "Buffer and Solution PreparationPrepare fresh Foxp3 Fixation/Permeabilization working solution by mixing 1 part of Foxp3 Fixation/Permeabilization concentrate with 3 parts of PBS containing 2% BSA. For 3-5 million cells, 1 ml of the working solution is required for each sample.Prepare 1× working solution of Permeabilization Buffer by mixing 1 part of 10× Permeabilization Buffer with 9 parts of deionized distilled water. 1 ml of the working solution is required for each sample.Detection of endogenous IRF5 interaction with FITC-IRF5-CPP inhibitors in THP-1Plate 2 × 105-4 × 105/ml THP-1 cells in complete RPMI-1640 media in a 96-well plate (in triplicate per condition/treatment) and keep in the incubator (37°C, 5% CO2) for 24 h.Prepare 1 and 10 µM of FITC-IRF5-CPP conjugated inhibitors in complete RPMI-1640 medium. Aspirate medium and incubate THP-1 cells with or without FITC-IRF5-CPP in 37°C, 5% CO2 for 1 h.NOTE: Keep the samples protected from light.Transfer the FITC-IRF5-CPP treated cells in to a 5 ml tube.Centrifuge at 400 × g, 4°C for 5 min. Aspirate supernatant without disturbing the cell pellet.Wash cells with 3 ml PBS and centrifuge at 400 × g, 4°C for 5 min. Aspirate PBS without disturbing the cell pellet.Add 1 ml of Foxp3 Fixation/Permeabilization working solution to each tube and pulse vortex.Incubate for 30-60 min at room temperature or for up 18 h at 2-8°C.Cells should have settled in the bottom after 18 h. Carefully aspirate supernatant. For short incubation (30-60 min at room temperature), spin at 400 × g, 4°C for 5 min.Add 1 ml of 1× Permeabilization Buffer to each tube and incubate for 30 min at room temperature.Spin at 400 × g for 5 min.Resuspend pellet in 50 µl residual volume of 1× Permeabilization Buffer.[Optional] Block with 10% BSA by adding 5 µl directly to each tube.",
    "Incubate for 15 min at room temperature.Without washing, add the recommended amount of primary (anti-IRF5) antibody for detection of intracellular antigen and incubate for at least 30 min at room temperature. Protect from the light.Wash with 3 ml of PBS.Repeat Steps B9-B12 and add the recommended amount of secondary (TRITC) antibody (to bind to anti-IRF5 antibody).Spin at 400 × g for 5 min. Aspirate supernatant leaving 30 µl residual volume.Add 30 µl of 4% PFA and resuspend stained cells. Protect from the light.Transfer samples to a 96-well plate. Prior to reading, add PBS to a final volume of 150-200 µl.NOTE: Make sure you have the same number of cells per well. Counting the cells is highly recommended. Measure intracellular fluorescence on Biotek Synergy Neo2 (Bioteck, VT, USA) or any similar plate reader at 525 nm upon excitation at 488 nm (E1), at 600 nm after excitation at 540 nm (E2), and 600 nm after excitation at 488 nm (E3).Set up the machine with 3 spectra:FITC    488 excitation 525 emissionTRITC   540 excitation 600 emissionFRET    488 excitation 600 emissionThe transfer of fluorescence was calculated as FRET units as follows: FRET unit = (E3c − E3none) − ([E3TRITC − E3none) × (E2none/E2TRITC]) − ([E3 FITC −E3none] × [E1both/E1TRITC ]). The different fluorescence values (E) were measured on unlabeled cells (Enone) or cells labeled with FITC (EFITC) and TRITC (ETRITC).The resulting bar graph (Figure 4) shows an increase in FRET signal (unit) between endogenous IRF5 and FITC-IRF5-CPP2 or FITC-IRF5-CPP5 but not FITC-IRF5-CPP8 or –CPP9.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4021/bioprotoc-11-10-4021-g004.jpgFigure 4. Binding of IRF5-CPPs to IRF5. THP-1 cells were incubated with FITC-IRF5-CPP2, FITC-IRF5-CPP5, FITC-IRF5-CPP8, or FITC-IRF5-CPP9 for 1 h, followed by permeabilization and staining for intracellular IRF5 with anti-IRF5 and tetramethyl rhodamine isothiocyanate (TRITC) antibodies. FRET units were calculated from fluorescence emissions."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}