{
  "id": 7230,
  "origin_website": "Bio",
  "title": "Surface Engineering and Multimodal Imaging of Multistage Delivery Vectors in Metastatic Breast Cancer",
  "procedures": [
    "Animal models for pulmonary metastasis of triple-negative breast cancerGrow and expand the cells according to the recommended conditions. Typically, 4T1-GFP-Luc cells are cultured in RPMI-1640 medium supplemented with 10% FBS and 1% Pencillin-streptomycin.Harvest cells while in the exponential growth phase (approximately 80-90% confluence) using trypsin or an appropriate enzyme for the specific cell line. Resuspend cells in medium containing serum.Count cells.Centrifuge cells at 225 × g, 4°C for 5 min. Resuspend cells in 1× PBS to a concentration of 1 × 105 cells/200 µl.Place cells on ice and transport to the vivarium.Restrain the mouse in a restrainer and position the tail such that the vein is facing upwards.Draw 200 μl cells into a 28 G disposable insulin syringe and gently inject into the tail vein. The contents of the needle should inject easily without resistance.Monitor tumor development regularly via bioluminescence imaging. Typically, 4T1-Luc cells take 10 days to develop lung metastases.Surface modification of iNPG-pDox or other amine-modified nano/microparticlesFor details of the structure of iNPG-pDox vectors and chemistry, readers are referred to the following references (Goel et al., 2020; Xu et al., 2016).Dissolve 3 × 109 amine-modified iNPG (or other nanoparticles of choice) in 0.5 ml DMF in a 1.5-ml EppendorfTM tube. Shake gently.Dissolve 0.8 mg p-SCN-Bn-NOTA in 0.5 ml DMSO and add to the iNPG solution.Sonicate the mixture until a homogenous solution is formed.Add 20 µl diisopropylethylamine and incubate the reaction mixture at 25°C for 4 h under vigorous shaking at 700 rpm. This step can be performed on a hot plate stirrer or in a thermal cycler.After the 4-h incubation, wash the iNPG-NOTA conjugates by centrifugation at 5,000 rpm for 5 min with DMSO as the solvent. Briefly, spin the conjugates down, carefully discard the supernatant and resuspend the pelleted nanoparticles in 0.5 ml DMSO by sonication.",
    "Repeat the wash step with DMSO (for a total of 2 times), followed by 0.5 ml isopropanol (one time) and 0.5 ml DI water (one time). The speed and time of the centrifugation can be adjusted according to the nanoparticles used.After the final wash step, resuspend the iNPG-NOTA pellet in DI water and freeze at -80°C or freeze-dry (depending on the nanoparticle used) for further use (for up to 1 week).Use the same process to obtain iNPG-AF647 by conjugating fluorescent dyes (e.g., AlexaFluorTM 647 NHS ester) for optical imaging.Radiolabeling of iNPG-NOTAResuspend iNPG-NOTA in 0.5 ml 0.1 M sodium acetate solution.Adjust the pH of the solution to 5.5 using 0.1 M HCl.Add 37 MBq 64CuCl2 to the nanoparticle solution. All handling of radioisotopes and radiolabeled solutions should be performed behind a lead shield in a fume hood, in accordance with institutional radiosafety guidelines.Carefully wrap parafilm around the cap and incubate the tube at 37°C for 1 h with gentle shaking. This step should be performed in a thermal cycler or on a hot plate stirrer behind a protective lead shield.Remove the excess unchelated 64Cu by centrifugation at ~1,610 × g for 5 min. Wash twice with DI water to obtain the final radiolabeled constructs ([64Cu]NOTA-iNPG). All radioactive waste should be appropriately discarded.To calculate radiolabeling yield, radio thin-layer chromatography (radio TLC) is performed (Figure 1). Briefly, drop 2 µl [64Cu]NOTA-iNPG on one end (origin) of a silica gel TLC plate. Dip the strip vertically in 2 ml 50 mM EDTA solution in a 50-ml conical tube.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4030/bioprotoc-11-10-4030-g001.jpgFigure 1. Schematic of the radio TLC procedure to calculate radiolabeling yield The solution will slowly travel upward by capillary action.",
    "Once the solution has moved 2–4 cm upward (or 1 cm from the top of the strip; solvent front), remove the strip from the EDTA solution and allow to dry.Scan the strip on a Bioscan AR-2000 RadiobTLC Imaging Scanner according to the vendor’s instructions.Typical radiolabeling yields using with this procedure range from 50% to 70%, with >99% radiochemical purity.Loading pDox into [64Cu]NOTA-iNPG or iNPG-AF647Suspend 3 mg polymeric pDox monomers in DMSO (70 mg/ml) and add the solution to the [64Cu]NOTA-iNPG or iNPG-AF647 conjugates.Incubate the mixture for 3 h at room temperature with vigorous shaking. This step can be performed in a thermal cycler.Remove unloaded pDox polymers by washing twice with DI water using centrifugation, as described in B above, to obtain the final constructs: [64Cu]NOTA-iNPG-pDox for PET/CT imaging and iNPG-AF647-pDox for optical imaging and confocal microscopy. Resuspend the final conjugates in 1 ml PBS.Draw 200 μl [64Cu]NOTA-iNPG-pDox (~60-80 µCi per mouse) solution into a 1-ml syringe for injections in the next step.Small animal PET/CT imagingAnesthetize 4T1 tumor-bearing mice under 2% isoflurane (in 100% O2 gas).Transfer each mouse to a mouse restrainer, carefully placing the nose cone to maintain anesthesia.Insert the micro-catheter into the tail vein and flush with 50 μl PBS. Leave the syringe with PBS attached to the catheter.Secure the mouse onto the microPET/CT scanner bed under 2% isoflurane anesthesia administered via the nose cone manifold. To minimize movement, the limbs can be secured to the side of the bed with tape.Switch the PBS syringe in the catheter with the syringe containing [64Cu]NOTA-iNPG-pDox.Acquire a whole-body CT calibration image of the mouse.The PET/CT acquisition protocol will depend on the particular experiment and the requirements of the researcher.",
    "For dynamic PET scans, a 30-min dynamic PET mode, data are acquired using the 3D-OSEM iterative algorithm with a 256 × 256 × 256 voxel volume.Immediately after the dynamic PET scan is started, slowly inject the radiolabeled nanoparticle solution as a single bolus dose over 30 s.Continue the dynamic PET acquisition.If PET images are required at more time points, data are acquired using the standard 3D PET acquisition protocol. To account for radioactive decay, longer scan times may be necessary.Datasets are acquired as: standard static 3D PET reconstruction and dynamic 3D PET reconstruction with 6 × 300 s frames. CT attenuation correction is applied to all PET images.Ex vivo gamma countingWhen the PET/CT scans are at the final time point, euthanize the animal according to institutional protocols.Harvest and weigh the major organs including the tumor-bearing lungs.Radioactivity in the organs is measured using a gamma counter per the manufacturer’s instructions.Ex vivo whole-organ optical imagingIn a separate cohort of 4T1-tumor bearing mice, inject 200 μl iNPG-AF647-pDox prepared in section D via the tail vein (described in section A).At the desired time point post-injection, euthanize the mouse according to institutional protocols.Harvest the lungs and place on a black sheet in the IVIS Spectrum Scanner.Acquire multiplexed ex vivo fluorescence images using the vendor’s preset filter sets encompassing the excitation and emission spectra for GFP (tumor), doxorubicin (pDox), and AF647. For this combination of fluorophores, 18 filter sets are automatically selected when using the IVIS Spectrum system.Set the field of view, acquisition time, and binning number. Data acquisition settings will vary from user to user but should be kept constant throughout the experimental study.After image acquisition, rinse the tissues in PBS, preserve in OCT compound in cryomolds, and store at -80°C for sectioning.Immunofluorescence microscopyCryo-section the frozen tissues into 6-µm-thick sections using a cryotome.",
    "Incubate the sectioned tissues in cold acetone for 10 min. All steps for staining and incubation in this section should be performed in a staining tray or similarly fashioned light-blocking device.Prepare the blocking solution as follows: Mix horse and goat serum at a 1:1 v/v ratio and add 0.1% (by volume) Triton X-100.Note: The choice (species) of blocking serum depends on the host of the primary and secondary antibodies used for staining. Add 100 μl blocking solution per tissue section. Incubate at 4°C for 1 h.Prepare the solution of primary antibody for a total volume of 100 μl per tissue section. The anti-CD31 antibody can be used at a 1:200 dilution. For other primary antibodies, refer to the vendor’s instructions for the suggested dilution.After 1 h, gently tap the slide on its side to discard the blocking solution.Add 100 μl primary antibody cocktail to each tissue section and incubate overnight at 4°C.After overnight incubation, wash the tissue sections gently in PBS. For each wash, incubate the tissue section in PBS for 3 min, tap the slide on its side to drain the solution, and add fresh PBS. Repeat the wash step 3 times.Prepare the secondary antibody in blocking solution at the vendor’s recommended dilution. For the goat anti-rabbit-FITC secondary antibody, a 1:50 dilution is recommended.Incubate the sections in secondary antibody solution for 1 h at 4°C.Wash the secondary antibody with PBS as described in Step H8.Add 50 μl DAPI solution to the tissue sections and incubate for 10 min.Wash twice with PBS as outlined in Step H8.Clean and dry the portions of the slide adjacent to the tissue, taking care not to disturb or dislodge the tissue.Add a drop (or 5 μl) Gold Anti-fade Mounting Medium and gently place a coverslip on the tissue sections.",
    "Care must be taken to prevent the introduction of bubbles.Dry the slide by tapping gently with Kimwipes and keep protected from light in a black box or slide cassette covered with aluminum foil. It is recommended to perform confocal microscopy within a day of staining.Observe and photograph immunofluorescent slides by mounting on the stage of a confocal microscope according to the vendor’s instructions, using the appropriate objectives. Typically, 10× and 40× objectives are sufficient for nanoparticle uptake studies. Take images of 5-10 fields of view per tissue section distributed over the entire section.Prevent overexposure or stain bleaching of the samples. All images are acquired under identical conditions.FITC and DAPI can be observed with their dedicated filter sets. To oberve iNPG-AF647, use the cy5 common filter set. To observe fluorescence from pDox nanoparticles, the RFP common filter can be used."
  ],
  "subjectAreas": [
    "Biophysics",
    "Molecular Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}