{
  "id": 11988,
  "origin_website": "Jove",
  "title": "Assessment of Social Transmission of Food Preferences Behaviors",
  "procedures": [
    "All protocols have been reviewed and approved by the animal experiments committee of the University of Leuven, Belgium, and were carried out in accordance with the European Community Council Directive (86/609/EEC).\n1. Equipment, Apparatus, and Room Set Up:\nPrepare a Crawley's three-chamber box23 which consists of three chambers (19 x 45 cm, height 30 cm) with transparent dividing walls allowing free access to each chamber.\nUtilize two food cups made from transparent plastic (diameter of 3.8 cm, height of 3.2 cm) and place them inside fitting food cup holders consisting of a metal ramp (10x10 cm, height 7 cm), with a center hole fitting the food cups.\nUse a wire cup-like container large enough to hold a mouse (diameter of 12 cm, height 10 cm). Place it in the middle chamber for the demonstrator in phase 6.\nClean the apparatus after each trial with 70% ethanol to prevent olfactory traces between mice and let it dry out.\n\tNOTE: Behavioral testing is preferably done between 9:00 am and 6:00 pm. General room lighting in the apparatus and experimental room is 650 lux. Use a video-tracking software program to record mouse activity.\n2. Flavored Food Preparation:\nTake regular food chow pellets and add 2% of celery or paprika. Mix the food well and put it in food containers for further use.\n3. Motivational Phase (day 1-2):\nPut all rodents on a 23-h, food-deprivation schedule, receiving their regular chow for 1 h/day for two consecutive days in a room with a 12 h light/dark cycle with ad libitum access to water. Turn the light on 8 am.",
    "NOTE: In the original protocol, during the priming phase, each demonstrator was provided, for 1 h, with food containing a novel flavor. We gave the demonstrators the flavored-food already during their 1 h feeding time, so in total 2 h instead of the original 1 h is used.\nFor the demonstrator mouse, use a mouse of the same background, age, gender and weight, without any prior contact (not littermates) with the subject / observer mouse.\n\tNOTE: The same demonstrator mice may be used between social transmission trials.\n4. Buried Cookie Test (day 3):\nBefore starting the STFP procedure, evaluate the olfactory function of the subjects using the buried cookie test20. Bury a chocolate chip cookie approximately 1 cm beneath the surface in a random corner of a clean individual housing cage.\nNext, place the observer mouse into the cage and record the latency to find the cookie with a 15 min cut-off. Do not let the mouse eat the cookie.\n\tNOTE: This simple test can rule out olfaction detection deficits and prevent time-consuming unnecessary STFP testing.\n5. Habituation Phase (day 3):\nSeparate the right and left compartments by lowering the walls.\nPut two food containers, filled with food pellets (regular food chow) in each corner of the three-chamber-apparatus.\nGently place the observer mouse in the center chamber.\nLet the subject mouse habituate to the apparatus for 10 min.\nAfter 10 min, open the sliding doors and let the subject mouse freely explore the whole apparatus for 10 min.\n\tNOTE: Mice should remain on a food-deprived schedule during this phase.\n6. Social Transmission Phase (day 4):\nSeparate the right and left compartments by lowering the walls.",
    "Put a demonstrator mouse inside a wire containment cup, and place it in the center chamber. On the lid of the wire cup facing the mounted camera, write the abbreviation of the food which the demonstrator has been cued with.\nGently put the subject mouse in the center chamber and let it freely explore the demonstrator for 30 min, while recording the duration (s) and number of contacts between the subject mouse and the containment cup housing the demonstrator mouse (within an area of 5 cm around the cup).\n7. Food Preference Test Phase:\nPrepare two food pots for each mouse. Weigh each mouse and label it with observer ID and flavor.\nRemove the wall dividers and place the two food containers, filled with either chow containing the cued or a novel (uncued) food, in each corner of the three-chamber- apparatus (Figure 2).\nGently place the subject mouse in the middle chamber and let it freely explore the whole arena for 120 min, while recording the duration (s) and number of contacts between the subject mouse and both the food cups (within an area of 5 cm around the cups).\nMeasure the food preference by weighing the remaining food (g).\nIf spillage occurs, put all food back into the food cup and weigh it together with the remaining food in the food cup. Spillage inside the middle chamber should be disregarded.\n8. Statistical Analysis:\nUse a video-tracking program to evaluate the mouse behavior including the number of approaches, duration of approaches between subject and demonstrator mouse during phase 6 and the time that the observer mouse spent with both food cups during phase 7.\nCalculate the percentage of time spent within the proximity of the cued and uncued food, and the percentage of the eaten cued and uncued food.",
    "Analyze the data by one-way analysis of variance (ANOVA).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}