{
  "id": 8841,
  "origin_website": "Jove",
  "title": "Neuroimaging Field Methods Using Functional Near Infrared Spectroscopy (NIRS) Neuroimaging to Study Global Child Development: Rural Sub-Saharan Africa",
  "procedures": [
    "All methods described here have been approved by the Institutional Review Board (IRB) of the University of Delaware.\n1. Mobile Laboratory Transport and Setup\nTraveling with the fNIRS equipment\nTransport fNIRS equipment.\n\t\tNOTE: fNIRS equipment can be transported as checked-luggage on a major international airline, but it is imperative to confirm with the given airline. Equipment restrictions may vary by origin or destination country. Alternatively, fNIRS equipment can be shipped.\nKnow the procedures for importing or traveling with fNIRS equipment for the destination country, and if applicable, obtain appropriate import approval documentation.\nPrepare for inspections.\n\t\tNOTE: Authorities (e.g., Transportation Security Administration) reserve the right to inspect checked-baggage. Fragile fNIRS fiber optics may be damaged during inspections. Arrange for appropriate documentation to accompany all equipment.\nEssential laboratory equipment in the field\nPrepare for climate conditions in the field.\n\t\tNOTE: Temperature and humidity conditions in the field can vary significantly from laboratory setting and may affect equipment function and longevity, as well as participant comfort during experimentation. Electronics operating in high humidity conditions, generally above 60%, are more susceptible to corrosion as excessive moisture can settle on parts and react with metal components. Humidity levels in an indoor lab (e.g., inside a university building) are generally between 30-50%. Humidity in southern Côte d'Ivoire can be 80-95%. Set up a portable air conditioning unit with low wattage demands.\nEnsure adequate electrical supply. Since electrical supply may not be available in rural settings, or may function only intermittently or with insufficient wattage, use portable solar generators to power small to medium sized electronics. Make available a diesel generator as backup power. Employ a local electrician who is familiar with electrical supply challenges in rural contexts.",
    "Prepare a suitable laboratory structure with minimal setup time such as a large customized tent with opaque and waterproof roof and walls.\n\t\tNOTE: Facilities (e.g., classroom at local school) are unlikely to be available, or provide waterproof and quiet testing space.\nSetting up the portable laboratory (Figure 1)\n\t\nAssemble the mobile laboratory (e.g., customized tent). Ensure that the laboratory is large enough to accommodate seating for the participant at a desk, seating for two experimenters, stimulus presentation computer, fNIRS data collection computer, fNIRS portable unit, three-dimensional (3D) digitizer, and portable air conditioner.\nimgsrc://cloudfront.jove.com/files/ftp_upload/57165/57165fig1.jpg\nFigure 1. Schematics. (A) Schematic of laboratory setup. (B) Preparing the participant for data collection. Please click here to view a larger version of this figure.[href=https://www.jove.com//cloudfront.jove.com/files/ftp_upload/57165/57165fig1large.jpg]\n2. Local Research Teams and Science Partners\nInvest into formation of scientific collaborations and provide opportunities within the research framework to local researchers.\nEstablish partnership with local scientific institutions for the purpose of inclusivity. Gaining recognition from peers at the local level is important to communicating eventual research finding in the region.\nConsult relevant local authorities before any research activities to receive authorization and license to operate. Familiarize with ethical review procedures in the target country, and make appropriate accommodations if no formal scientific review procedure is in place.\n\tNOTE: For example, direct communication with and approval from representatives in the Ministry of Higher Education and Research (or comparable government body) may be done in lieu of an ethical review procedure.\n3. Informed Consent and Child Assent\nDevelop a consent procedure that is culturally appropriate and ensures that participants, their families, and communities are informed about research and their decision to participate in the study.\nReview local customs and history in typical protocol development and include members of the group with whom research needs to be conducted.",
    "Make sure to obtain a clear consent from local leader(s) (e.g., village chief, community elders, etc.) before proceeding with research.\n\t\tNOTE: This may be expressed by an ancestral benediction or by any other means typical to the community. After consent from the village chief, cultural customs may include the pouring of wine onto the earth and asking the ancestors to approve and bless the research activities.\nAt a more formal level, seek the consent of parent and educator groups which are responsible for making decision concerning children's participation in school approved activities. For example, the parent-teacher group ('Comité de Gestion d'Ecoles - COGES' in Cote d'Ivoire) is a key stakeholder in the national primary educational system consisting of members appointed by student's parents to defend their interests in decision making and in all other aspects related to the education of their children.\nApprove all research activities by local authorities, for example, the Ivorian Ministry of Education or the Ministry of Higher Education and Research. The country that the project will take place in may not have a formal procedure for ethical approval through an IRB. Check regulations to ensure that the correct protocols for obtaining ethical approval for research are being followed.",
    "NOTE: At the time of obtaining approval, Côte d'Ivoire did not have a formal IRB review process. In lieu of this, the research team proceeded by preparing documentation akin to an IRB application to submit to the Ministry of Education. Multiple meetings were arranged with the Ministry of Education, Ministry of Higher Education, and research officials where the research team presented the proposed research plan to all officials, followed by group discussion and question and answer sessions. Ethical approval was obtained directly from the Ministry of Education in the form of a signed document granting authorization to conduct research with children at specific schools. This study received ethical approval from the University of Delaware IRB.\nExplain the research purpose in simple words to participating children in a child assent procedure. The local community may highly value a child's obedience, in which case a child may assent to participate or continue participating in a study despite their unwillingness to do so because of cultural expectations. Ensure that the assent procedure carefully communicates voluntary participation in the research.\nClearly define how the research will benefit the participants and if they will receive compensation for their participation in the research. Ensure the compensation is appropriate both culturally and for the participants.\nConduct all consent and assent procedures in the local or preferred language of the participant by a trained member of the research team who is also a member of the language and cultural group.\n4. fNIRS Scalp Placement and Measurement\nCollecting head measurements\nDirect the participant to sit on a chair, and explain the process to be expected during head measurement.",
    "Using a standard tape measure, measure the distances between: (1) the nasion and inion around the head, (2) the nasion and inion over top of the head through the midline central (Cz)11, and (3) the distance between the left and right ear tragus over the top of the head through Cz.\nPlacement of the fNIRS cap and optodes on the participant's head 3,8,9,12\nPlace the fNIRS optode holder cap onto the participant's head, aligning the cap to the international 10-20 system for scalp locations11. Ensure that the cap position is identical for all participants. Align points on the cap (e.g., probe holder) with scalp positions.\n\t\tNOTE: For example, center the front of the cap on the head to the frontopolar (FP) position. This position corresponds to 10% of the nasion-inion over top distance dorsal to nasion position.\nSecure the cap with a strap and ensure the participant is comfortable.\n3D digitizer measurement\nOnce the cap is in position, instruct the participant to sit still in the position for obtaining a 3D digitizer measurement of the key 10-20 system scalp positions11 and each optode place holder.\nArrange the 3D digitizer equipment. Place one sensor on the participant's head at Cz and affixed securely (i.e., using an elastic or hair accessory), and place the second block sensor behind the participant. Let the participant be seated in a chair with their back to a table. Place the second sensor on the table directly behind the participant's head. Ensure that neither sensor move during the course of obtaining the 3D digitizer measurement.\nOpen the Brainstorm software13 on the data collection computer. Make sure the 3D digitizer system is in communication with the Brainstorm software through the appropriate COM port.",
    "Move the 3D digitizer stylus to each probe location and across the key 10-20 system positions (nasion, inion, left ear, right ear, Cz). At each location, obtain position data through the Brainstorm function on the data collection computer.\nPlacing light emitting optodes and detectors on the scalp\nAfter the 3D digitizer data are collected, direct the participant to be seated comfortably in front of the stimulus presentation computer.\nUsing the fNIRS built-in software, select the probe arrangement that corresponds to the experiment design. fNIRS probes can be placed to cover the entire head (i.e., full head coverage), or alternatively, an array can be placed over general regions of interest. For example, this protocol used a 10 x 3 probe array (30 probes arranged in 3 rows of 10 probes each). This probe arrangement was placed to maximally overlay left hemisphere language areas and their right hemisphere homologues, as well as the frontal lobe (Figure 2).\nEnsure that each probe (emitter and detector) is numbered and the numbering system corresponds to the probe arrangement map.\nUsing the optode map in the fNIRS inbuilt software as a guide, place each optode in the appropriate optode opening on the cap. The optode map indicates the location of each optode in the array (e.g., 10 x 3).\nMove any hair out of the way to ensure direct contact between the tip of the optode and participant's scalp.\nAfter all optodes are in position, check for signal quality using the fNIRS system built-in software.\nAdjust individual probes as necessary until sufficient signal quality is achieved. Once all optodes' signal quality checks have passed, proceed with experimental tasks.\n5. Experimental Tasks",
    "Design each neuroimaging task with the appropriate number of trials and conditions in line with the research goals. Understand that the neuroimaging tasks will vary depending on the research aims. For example, three tasks were used in this protocol: (1) a language processing and reading task, (2) a rhyme judgment task, and (3) a cognitive flexibility task.\n\tNOTE: The procedure (and representative results) of the rhyme judgment task are highlighted.\nPlace noise-cancelling headphones on the participant's head, being mindful not to interfere with fNIRS probe placement. Ensure that the headphones will deliver auditory speech stimuli to the participant, as well as block any ambient noise.\n\tNOTE: Laboratory testing typically takes place in a sound attenuated room. Field laboratory testing does not provide the same degree of noise control, and noise-cancelling headphones can ensure quiet testing conditions for all participants.\nInstruct the participant to face the computer monitor and fixate on the cross in the middle of the screen, and to remain still during the experiment. Present all experimental tasks on a computer screen.\nRhyme judgment task\nInstruct the participant to listen to the word pairs presented aurally through headphones. Ask the participant to indicate whether word pairs rhymed or not (e.g., 'cat'-'hat' or 'cat'-'log') with a button press on the keyboard.\nIn this example, use an event related design. Let participants complete 12 non-rhyming and 12 rhyming trials separated by jittered inter-stimulus intervals of between 8 and 17 s.",
    "NOTE: Tasks should be created in a manner suitable for the participant. In the study referenced here, researchers were investigating language, cognitive, and reading development in children who were very poor readers. The reading neuroimaging task developed with words that would be appropriate for a child with minimal literacy skills. As well, children were selected for the neuroimaging paradigm based on scores obtained on a reading assessment.\nDim lights and begin recording the participant on the built-in video camera.\nBegin fNIRS data recording on the fNIRS command computer, and commence tasks on the stimulus presentation computer.\nMonitor participant performance throughout all tasks. Provide breaks between tasks and runs.\nEnsure that triggering from the experimental stimuli presentation computer is received by the fNIRS command computer.\nAt the end of all tasks, stop collecting video and fNIRS data.\n6. Post-experimental Task Measurements\nRemove each optode from the optode holder cap.\nWithout disrupting the position of the optode holder cap on the participant's head, direct the participant to sit in a position to obtain a second 3D digitizer measurement.\nRepeat the 3D digitizer measurement as in the fNIRS Scalp Placement and Measurement Section 4 to ensure that any disruptions to the scalp probe position during the experiment can be detected by comparing the two position files.\nRemove the optode holder cap from the participant's head.\nAt the end of the experiment, provide participants with a small gift (e.g., books and school supplies) and the acknowledgements of the research team for their participation.\n7. Plan for Disseminating Data\nShare the research findings with community members and relevant local authorities for their eventual translation into policy addressing the investigated issue.\n\tNOTE: Participants may not benefit directly from the experiment.",
    "Make plans for follow-up visits to the participating communities. Prepare reports and tools that local educators can use. For example, any assessments created in local languages should be made available to school officials in the region. Prepare the members of the research team who speak the local language to meet with community leaders to communicate study findings.\nMake plans to publish study findings in regional academic journals and in the language of the region, if applicable. For example, study findings should be disseminated in French if research was conducted in Francophone countries.\nMake plans to meet with and deliver reports of the study findings to the government branch that granted approval for the research program.\n8. Backup Data\nEnsure that data are exported and backed up to multiple portable hard drives, as internet access for online data storage is unlikely to be available. Transfer the data to online data storage as sufficient internet connectivity is available.\n9. Data Analysis\nNOTE: Multiple data analysis packages exist for fNIRS14. Statistical Parametric Mapping for Near-Infrared Spectroscopy (NIRS-SPM)15 , Homer216 (widely used), and the fNIRS toolbox 17,18 (new and gaining popularity) are used for fNIRS data analysis. This protocol reviews data analysis methods using NIRS-SPM, but it is to the discretion of the researcher to select preferred method of analysis.\nAnalyze data from the fNIRS system using NIRS-SPM, Version 415,19. This toolbox for the neuroimaging suite SPM8 (http://www.fil.ion.ucl.ac.uk/spm) analyzes NIRS data with a general linear model based analysis approach and allows for the creation of activation maps with super-resolution localization.\nData conversion to HbO and HbR\nUse the modified Beer-Lambert equation (with NIRS-SPM) to convert optical density values into concentration changes in HbO and HbR response.\nData preprocessing\nUse one of the multiple options which exist for preprocessing fNIRS data.",
    "NOTE: Huppert et al.17 propose very rigorous methods for different sources of noise16. These include eigenvector-based reduction of motion artifacts, bandpass filtering techniques, and eigenvector-based reduction of spatial covariance for physiological interference in data (e.g., respiration, blood pressure, heart rate). They also share a thorough commentary on sources of noise in fNIRS research and implications for statistical analysis. The fNIRS researcher must investigate preprocessing applications that are most appropriate for a given study. Below, an analysis approach modeled after Worsely and Friston20 and Jang et al.19 is presented.\nDecompose changes in HbO and HbR concentrations using a Wavelet-Minimum Description Length (MDL) detrending algorithm in order to remove global trends resulting from breathing, blood pressure variation, vasomotion, or participant movement artifacts and to improve the signal-to-noise ratio19.\nApply a low-pass filter with the shape of the hemodynamic response function to the data and use the Worsely and Friston20 precoloring method to remove temporal correlations.\nModel generation and statistical analysis\nGenerate models for HbO and HbR containing experimental regressors convolved with the corresponding hemodynamic response function with time derivatives21.\n\t\tNOTE: The hemodynamic response function can have greater variability in higher cortical regions and across participants. These types of variability can be accommodated in analysis models by expanding the HRF to include temporal derivatives. Use a temporal derivative to model differences in the time to peak hemodynamic response21.\nUse NIRS-SPM to create the models for HbO and HbR with opposing polarity so that a significant model fit for HbO indicates increased concentration and for HbR decreased concentration5,18.\nSet up experimentally relevant t-test or F-test contrasts to test for the effect of one (or several) regressors (given the design matrix) on modulation of the fNIRS time series data.\nVisualizing results",
    "Perform spatial registration of NIRS channels to the Montreal Neurological Institute (MNI) space using data from a 3D digitizer.\nUse registered fNIRS data to create activation maps of HbO, HbR, and total hemoglobin (THb) based on the general linear model and Sun's tube formula correction22,23.\nLoad activation maps onto an appropriate brain template. For example, the recent Haskins Pediatric Brain Atlas provides a standardized template for children between 6-12 years of age24.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}