{
  "id": 17771,
  "origin_website": "Jove",
  "title": "Cooling or Warming the Esophagus to Reduce Esophageal Injury During Left Atrial Ablation in the Treatment of Atrial Fibrillation",
  "procedures": [
    "This protocol follows the guidelines of local institution's human research ethics committee where applicable.\n1. Assessment Prior to Placement\nNOTE: Under current U.S. labeling, there are no formal contraindications listed. In the case of esophageal pathology, such as deformity, trauma, or recent ingestion of caustics or acidic material, caution is advised.\nEnsure that necessary equipment, such as the heat exchanger, the esophageal temperature management device, and water-based lubrication, is available.\nAttach the esophageal temperature management device to the heat exchanger via the device connectors, and power on the unit, placing it in manual mode. Ensure that the water is flowing through the esophageal temperature management device and confirm the absence of leaks.\n2. Placement\nDetermine the appropriate insertion depth for the esophageal temperature management device in similar manner to standard orogastric tube. Measure from the patient's lips to the earlobe and from the earlobe to xiphoid process and note this depth on the device (Figure 2).\nUse water-soluble lubricant to lubricate the esophageal temperature management device generously, at least 15 cm, and up to 25 cm of the distal end (Figure 3).\n\tNOTE: Patients are typically under general inhalational anesthesia (for example, using sevoflurane), but may also be under intravenous anesthesia (for example, using propofol), or in some cases under conscious sedation (for example, using meperidine or midazolam).\nIf possible, extend the patient's head to further facilitate insertion of the esophageal temperature management device using gentle pressure applied posteriorly and downwards, past the oropharynx and into the esophagus. Lifting the mandible anteriorly may assist passage of the device, as might a reduction of pressure in the ETT cuff if overinflated. Apply light pressure on the device as needed to reach the desired depth of placement. (Figure 4).",
    "Determine placement location by fluoroscopy to check if the tip of the device is below the diaphragm (Figure 5).\nSecure the water hoses and device to avoid accidental dislodgement; a common method is to place the connecting hose under the patient's left foam armrest.\nIf stomach decompression is desired, connect the central lumen to low-intermittent suction using standard suction tubing.\n3. Temperature Modulation — RF Ablation\nEnsure that the heat exchanger is set to manual mode and the appropriate water temperature is set. For example, on one typical heat exchanger, press the Temp Control button, then use the up/down arrows to select the target water temperature. Once the digital display shows the target temperature desired, initiate water flow by pressing the Manual Control button. A typical target is 4 °C water temperature when performing radiofrequency ablation at the posterior left atrial wall.\nIn order to anticipate the time needed for the heat exchanger to reduce temperature, use a water temperature setpoint of roughly 14 °C for initial insertion in RF cases while awaiting transseptal puncture. After transseptal puncture, and approximately 15–20 min before application of RF energy to the posterior atrial wall, change the water temperature setpoint to 4 °C (in manual mode).\n\tNOTE: For additional anti-inflammatory effects of cooling which may reduce gastroparesis or chest pain post-procedure, operators may maintain the water temperature setpoint at 4 °C for 20 min after the completion of posterior wall ablation, at which point the machine can be turned off.\n4. Temperature Modulation — Cryoablation\nFor cryoablation, use a water temperature setpoint of 42 °C (typical).\nSet this water temperature shortly after placement (placing while cold is generally easier due to increased device stiffness), and continue throughout the case, providing additional patient warming to counter the systemic cooling effect of the cryoablation.",
    "5. Patient Temperature Monitoring\nNOTE: Because the temperature in the esophagus is modulated by the presence of an esophageal heat transfer device, a different location is necessary for patient temperature measurement. Options for patient temperature measurement include nasopharyngeal thermometer (ensure that the depth is less than 10 cm), Foley temperature sensor, rectal temperature sensor, tympanic membrane thermometer, or forehead thermometer (including zero-flux thermometry).\nTo maintain patient temperature when using esophageal cooling, use supplemental warming modalities, such as warming blankets or head covers if needed. During esophageal warming when performing cryoablation, the patient temperature will usually stay in a normothermic range.\n6. Troubleshooting\nEnsure that no blockage of water flow occurs, and that the water paddle wheel, if present, is continuously spinning, or the low-flow alarm is not activated.\nBlockage of water flow in the system will cause the paddle wheel to stop spinning and an occlusion alert on the external heat exchanger Stop treatment and determine the location and cause of obstruction. If necessary, remove and replace the esophageal temperature management device.\nConfirm water flow at correct temperature by checking setpoint and touching device to ensure adequate pressure (device will be firm) and appropriate temperature.\n7. Removal of Device\nPress the appropriate button to pause water flow; this may be labelled \"Monitor\" or \"Temp Set\", but may vary by model.\nIf present, close clamps on the hose set and/or device tubing, and withdraw the device from the patient by gently pulling anteriorly in a similar manner to standard orogastric tube removal.\nPower down the heat exchange unit via the power switch prior to unplugging from wall power.\nDisconnect the water hose connectors from the device and dispose as per institutional policy (typically via contaminated waste container)."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}