{
  "id": 19024,
  "origin_website": "Jove",
  "title": "Angiogenesis in the Ischemic Rat Lung",
  "procedures": [
    "All protocols performed on rats have been approved by the Johns Hopkins University Animal Care and Use Committee and in accordance with NIH guidelines. Whenever possible, the animal should be surgically prepped in an area separate from the surgical area to minimize contamination of the surgical site.\n1. Anesthesia/analgesia\nPlace rat (Sprague Dawley male rats, 125-150 g; Harlan, Indianapolis, IN) in an induction chamber infused with 3% isoflurane.\nPlace anesthetized rat on surgery board attached to nose cone and ventilator with 3% isoflurane anesthetic. Use sterile technique for all procedures. Drape rat to ensure sterile operating field.\n2. Intubation\nImmobilize appendages in supine position using surgical tape.\nRemove rat from nose cone, extend tongue with padded forceps.\nUse 14 gauge intracath with blunted metal stilet as guide. Slide behind tongue, into trachea.\nRemove metal stilet leaving white plastic intracath in trachea. Ensure the rat is breathing and air is flowing through the tube.\nReplace nose cone with direct adapter to catheter, connect rat to ventilator (90 breaths/min; 8 ml/kg tidal volume; Rodent Ventilator Model 683, Harvard Apparatus, Holliston, Massachusetts).\nApply Puralube (Butler Schein, Dublin, OH) veterinary ointment on eyes.\n3. Thoracotomy\nPlace rat right side down, immobilize appendages using surgical tape.\nShave left side ribcage area.\nRemove excess fur with small vacuum.\nMake sterile field by wiping down with alcohol followed by Povidone-Iodine swabstick (Dynarex Corporation, Orangebur, NY). Repeat this process two more times (for a total of three scrubs).\nMake transverse incision with sterile dissecting scissors or sterile scalpel in center of field.\nBlunt dissect through layers of tissue and fat down to ribs (last layer is thin membrane covering ribs).\nCount ribs to determine 3rd intercostal space.\nUsing sterile 45 ° Graefe forceps, make blunt incision between 3rd and 4th rib.",
    "Insert rib separators, pull gently creating open void with full visualization of lung, place tape on sutures to keep open.\n4. Left Pulmonary Artery Ligation\nWith 90 ° Graefe forceps, move left lung back with right hand.\nUsing Dumont pattern #5 straight forceps, grab left pulmonary artery and airway with left hand. Left pulmonary artery will lay on top of airway. Ensure that forceps are directly perpendicular to the table. Additionally, it is most effective to pick up the left pulmonary artery/ left mainstem bronchus at the most distal position (closest to parenchyma). Push the ventilating left lung aside with this left hand maneuver.\nUse Dumont pattern #5 45 ° curved forceps to separate the left pulmonary artery from the left mainstem bronchus at their natural borders. This separation line appears thin and white between the two individual structures.\nSeparate directly under artery without going through the vessel; smoothly slide the forceps tips held together along the separation.\nContinue until tips of forceps have visibly separated the left pulmonary artery and the left mainstem bronchus. Only a small point of tip needs to be fully through. If blood can be visualized on the tip of the forceps, then it is not fully through and ligation should not be attempted. Once through the space, the left pulmonary artery will lay on the curve of the forceps. Hold in this position.\nGently release straight blunt forceps grip (left hand) and grab piece of a pre-cut suture (~2-3 inches; polypropylene suture size 6-0; Myco Medical, Cary, NC).\nOpen curved forceps cradling left pulmonary artery and grab suture. Gently pull suture through space between left pulmonary artery and left mainstem bronchus in an upward motion relative to the curve of the forceps.",
    "Tie down occluding the left pulmonary with a square knot, carefully snip remainder of suture.\nClose ribs using blunt forceps to hold rib and suture twice with polypropylene (blue monofilament) size 4-0 attached to a 19 mm, 3/8 circle reverse cutting needle (Myco Medical, Cary, NC ) in a hemostat, being careful not to suture skin (only ribs).\nComplete a loose square knot, inflate the lung, place on positive end-expiratory pressure (PEEP; 2-5 cmH2O), hyperinflate lung then secure knot tightly, and make another full knot before snipping remainder of suture. Remove from PEEP and visualize for 30 sec to ensure that the lung does not collapse. Apply 5 drops Bupivicaine (APP Pharmaceuticals, Schaumbur, IL).\nClose skin by placing tissue glue on wound and push skin together using back end of cotton tip applicator. Give Bupivicaine (2.0 mg/kg subcutaneous) at the site of incision subsequently every 8 hr for 24 hr or until the animal resumes normal activity. As the subcutaneous layer in this area is very thin, it is not easy to suture on its own. When the tissue glue is applied and the skin is pushed together it also closes the subcutaneous layer.\nTurn off isoflurane gas but continue to ventilate the rat for 1-2 min on room air until voluntary movement returns. Disconnect the tracheal tube from the ventilator and ensure that the rat is breathing spontaneously before removing it.\nWipe off Puralube from eyes with cotton swab and monitor movement and recovery. Inject buprenorphine hydrochloride (0.05 mg/kg intraperitoneal, Butler Schein, Dublin OH). Continue delivery of analgesic every 12 hr for 48 hr after surgery.\n5. Left Carotid Artery Cannulation",
    "To assess the magnitude of bronchial perfusion of the ischemic left lung at desired time points after left pulmonary artery ligation, inject labeled microspheres through the left carotid artery into the aortic arch. Prepare rats as above 1-2.\nCut midline along neck, blunt dissect to reveal trachea and left carotid artery (microsphere injection site).\nInsert catheter filled with heparinized saline, blunt tip of PE20 tubing (Becton Dickinson, Sparks MD) into vessel connected to 25 g needle, 4-way stopcock, 1 ml syringe.\nPlace bottle of microspheres (15 μm crimson polystyrene fluorescent microspheres, 1 x 106 spheres/ml; Invitrogen, Eugene, OR) in water sonicator for 30 sec.\nRemove bottle, vortex and draw up 0.5 ml (500,000 microspheres) into a 1 ml Hamilton glass syringe (Hamilton Company, Reno, NV) through a 20 g needle.\nAttach Hamilton syringe to 4-way stopcock and infuse microspheres with syringe pump (rate: 500 μl/min; Genie Plus, Kent Scientific, Torrington, CT).\nRemove Hamilton syringe and flush apparatus with 1 ml of heparized saline at 500 μl/min.\nPerform full chest thoracotomy and exsanguinate the rat by severing the inferior vena cava.\nRemove the left lung and other tissues of interest.\nTo extract microspheres from tissue, take the entire left lung of the rat after exsanguination and place it in 2M KOH (4-6 ml). Place in a 55 °C water bath and leave overnight for tissue digestion. Add Tween 80 (0.25%) to wash the beads, vortex (10 sec) and centrifuge (2,000 rpm; 20 °C for 10 min). Remove the supernatant, add 2-ethoxyethyl acetate (1 ml), vortex and let stand for 1 hr. Vortex the suspension and centrifuge (2,000 rpm; (20 °C for 10 min). Remove the 2-ethoxyethyl acetate aqueous layer containing the fluorescence, place in a cuvette and measure using a Hitachi F-2500 fluorescence spectrophotometer (excitation 612/emission 618; Digilab, Holliston, MA).",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}