{
  "id": 6005,
  "origin_website": "Bio",
  "title": "Mouse Phrenic Nerve Hemidiaphragm Assay (MPN)",
  "procedures": [
    "Solutions and setup preparation   Prepare Ringer’s solution (Recipe 1) and saturate it by aeration with 95% O2, 5% CO2, for at least 15 min to buffer pH at 7.4. During aeration, add 1 mg/ml of glucose (complete Ringer’s solution).  Note: About 50 ml of solution is needed for one standard experiment.   Switch on all the components of the setup and run Labscribe software (see Figure 1).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180228/20180228024828_6896.jpg Figure 1. Electrophysiological setup components. A. Setup overview. 1) Muscle chamber; 2) Stimulator; 3) Tension transducer; 4) Data acquisition system; 5) Computer system with Labscribe software. B. Muscle chamber details. 6) Support system; 7) Static stimulation chamber; 8) Muscle support with oxygen cannula; 9) Micromanipulator; 10) Platinum electrodes; 11) Screw Positioner; 12) Transducer sensor.      Dissection   Euthanize the mice, preferably by cervical dislocation.  Notes:    All procedures were performed in accordance with the Italian laws and policies (D.L. no 26 14th March 2014), with the guidelines established by the European Community Council Directive no 2010/63/UE and approved by the veterinary services of the University of Padova (O.P.B.A.-Organismo Preposto al Benessere degli Animali) (protocol 359/2015). All the procedures should be utilized according to the ethical standards of the Institution where experiments are carried out.   Exsanguination with decapitation can be carried out to avoid the presence of bleeding and clot formations within the rib cage.     Pin the mouse on a support in a supine position, remove the skin over the chest and the abdomen, and open the peritoneum under the rib cage.   Remove pectoral muscles to expose the rib cage.   Hold firmly the lower extremity of the sternum with a clamp, and make a central cut on it, approximately at the level of the second rib; keep on cutting the right and left side of the rib cage to get the diaphragm exposed (see Figure 2A).",
    "Note: While cutting, do not follow the course of the ribs, but chop them.   Completely remove the superior part of the rib cage (see Figure 2B).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180228/20180228024957_1575.jpg Figure 2. Rib cage opening for diaphragm explantation    Gently, move away the heart and the pulmonary lobes to spot the left phrenic nerve (it forms a white arch, see Figure 3A). Using forceps, insert the cotton thread under the nerve, in the upper part and make two knots. Carefully, cut the nerve behind the knots; holding the thread (avoid excessive stretching which may cause nerve damage), isolate the nerve removing adherent tissue as much as possibile; it is advisable to start from the knots and gently proceed toward the diaphragm muscle. A cleared nerve is easier to mount and stimolate, yet this requires carefull handling to avoid nerve stretching or damage, particularly close to the nerve insertion point into the muscle. Gently depose the isolated nerve on the muscle (see Figures 3B and 3C). Repeat these operations for the right phrenic nerve. Be careful: the right nerve is very close to blood vessels whose damage may lead to annoying hemorrhages (see Figures 3D and 3E). The result of these steps is shown in Figure 3F.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180228/20180228025026_3844.jpg Figure 3. Procedure for isolation and ligation of the two phrenic nerves. D: diaphragm; P: phrenic nerve. White arrows: knots position. White dotted lines: position of the phrenic nerves. Red dotted line: blood vessel running along the right phrenic nerve. Yellow dotted line in A: whole diaphragmatic muscle area.    Hold the diaphragm using the lower part of the sternum, to avoid damage of muscle fibers; remove the connective tissue adhering the abdominal side of the diaphragm (arrow in Figure 4A). Explant the diaphragm by cutting the dorsal part of the muscle (arrow in Figure 4B).",
    "Note: Pay close attention to spot nerve insertion point and avoid their cleavage.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180228/20180228025055_7010.jpg Figure 4. Diaphragm explantation    Transfer the preparation into a Petri dish (10 cm diameter), bottomed with sylgard and filled with 5-10 ml of complete Ringer’s solution; pin the muscle as shown in Figure 5A.   Split the whole muscle into two hemidiaphragms, each innervated by its own phrenic nerve, by cutting along the dotted lines shown in Figure 5A and discarding the central wedge with the sternum attachment. The result of this processing is two triangles, one of which is shown in Figure 5B. Note: With the present dissection procedure, two hemidiaphragms are obtained allowing two parallel but independent analyses, which is a remarkable advantage.   Tie a cotton thread at the apex of the triangle to connect the preparation to the transducer, making double knots without drilling the tissue. Use the ribs at the base of the triangle to secure the preparation to the support: drill the tissue between the ribs, pass a cotton thread and make a double knot around the lower rib (Figure 5B). Position the support and tie the base of the triangle via a double knot around the holder (Figure 5C).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180228/20180228025136_4180.jpg Figure 5. Hemidiaphragms separation and mounting on the tissue holder      Nerve stimulation and acquisition   Very carefully, transfer the preparation into the stimulation chamber (filled with 4 ml of complete Ringer’s solution, at 37 °C). Set O2 pressure to have a continuous but gentle bubbling of gas. Fix the thread knotted at the triangle apex to the transducer sensor with a double knot (Figure 6A).",
    "Notes:   For a complete force transduction, the muscle must be perpendicular to the axis of the transducer sensor (thread vertical as much as possible); thread contact with other parts of the setup may alter the measurement and must be avoided (Figure 6B). Muscle twitching is recorded by an isometric transducer that translates the mechanical force in electrical signal and commutated into a digital signal displayed by the Labscribe software.   A calibration curve can be built by applying weights of known value to the transducer and recording the corresponding Volt values; this procedure allows to express the force of muscle contraction in Newton (or in grams). The unit of measurement is irrelevant when results are provided as normalized values (see below).     Stretch the muscles, using the lead screw positioner (Figure 6A), until its tension reaches about 0.2 V (resting tension).   Pass the cotton wire connected to the phrenic nerve through the two platinum rings of the stimulating electrode (arrow in Figure 6C). Using the micromanipulator, carefully move the electrode inside the stimulation chamber. Pull the cotton thread until the phrenic nerve gets in contact with the rings (Figure 6C). Note: The nerve must be completely immersed into the solution and ideally perpendicular to the muscle, avoiding excessive tension. The electrode must not be in contact with the muscle, to prevent direct stimulation of muscle fibers.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180228/20180228025312_8607.jpg Figure 6. Details of the experimental setup. A. Transducer sensor with the cotton thread knotted. The asterisk indicates the screw positioner. B. Connection between the cotton thread (parallel to the white dotted line) and the hemidiaphragm. C. Final positioning of the phrenic nerve in the chamber. Black arrow: electrode rings with the nerve passing through and contacting it.    Set the standard parameters for phrenic nerve stimulation. Amplitude: 5 V (supramaximal stimulus); pulse width: 0.",
    "1 msec; frequency: 0.1 Hz. Start the stimulation and test for muscle twitching.  Note: In these conditions, a hemidiaphragm muscle preparation can twitch at least 4 h.   If the muscle contracts properly, adjust the optimal tension for twitch response using the screw positioner. Slowly increase the muscle tension repeated times, alternating with 10-15 min periods of muscle stabilization, until, incrementing the resting tension, twitch amplitude does not increase any more. An optimal resting tension is around 0.3 V.   Let muscle twitch stabilize for further 20 min at 37 °C before starting the experiment or before adding a treatment.  Note: The mean twitch amplitude measured at the end of this period is used to normalize twitch values upon treatment.   Add the treatment directly into the stimulation chamber.    Using i-WORX 118 system with Labscribe software, record muscle twitch for the desired time or until muscle force completely drops."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}