{
  "id": 12239,
  "origin_website": "Jove",
  "title": "Using the Dot Assay to Analyze Migration of Cell Sheets",
  "procedures": [
    "1. Coating of Dishes (Day 1)\nNOTE: Make sure not to leave fingerprints or dirt on the bottom of the plate when handling it.\nThaw mouse collagen IV on ice, and dilute it with 50 mM HCl (pH 1.3) to prepare 3 mL of a 10 µg/mL collagen IV solution.\n\tNOTE: Collagen will precipitate at 37 °C. It is therefore important to keep the collagen solution at a low temperature while thawing and working with it. Avoid repeated freeze-thaw cycles by preparing appropriately sized aliquots and storing them at -80 °C.\nAdd 250 µL collagen IV solution to each well of 12-well glass bottom plates and place them into an appropriately sized, tight-closing plastic box. Place wet paper towel over and around the plates to manufacture a humid chamber and close the box. Incubate the plates overnight at room temperature.\n\tNote: As only the growth area needs to be coated, it is sufficient to only cover the cover slip, which is attached to the bottom of the plate, with collagen solution (see Figure 1A, B for a schematic of plate).\nNext morning, rinse plates with deionized H2O twice to remove non-absorbed collagen and buffer. Direct the water to the edge of the plate well, not to the edge formed by the plate bottom and the coverslip (if water is pipetted into this area it will splash). Air-dry the plates in the laminar flow hood. Use plates immediately or store at 4 °C for up to 5 days.\n\tNote: Different cell lines might require different coating, such as fibronectin or collagen I.\n2. Plating the Dot Assay (Day 2)\nPreparing the cell suspension\nTo prepare cell suspension, use cells that have been grown in a 60-mm tissue culture dish in DMEM/F12 medium supplemented with 5% horse serum to 80% confluence",
    "Rinse the cells with calcium- and magnesium-free Dulbecco's phosphate buffered saline (DPBS) once, add 500 µL trypsin-EDTA (room temperature), and incubate the cells for 3 - 5 min in an incubator at 37 °C, 5% CO2, humidified atmosphere.\nSuspend the detached cells in 4.5 mL culture medium to stop trypsin activity and count a 20 µL aliquot of the cell suspension in a hemocytometer.\nPellet the remaining cells in a 15 mL conical tube by centrifugation at 200 x g for 3 min, aspirate the supernatant, and resuspend the cells in culture medium to 3 x 106 cells/mL.\n\t\tNOTE: For other coating substrates and/or cell lines, the optimal cell density must be established in a dilution series. 3 x 106 cell/mL is recommended as a starting point.\nPlating cells\nPlace a 10 µL drop of cell suspension at the center of each cover slip of the collagen IV coated 12-well glass bottom plate without touching or scratching the coating (Figure 1A, B). Incubate the plate for 30 min at 37 °C, humidified atmosphere, to allow the cells to attach. Check in an inverted microscope that the cells are attached.\n\t\tNOTE: This can be best seen at the edge of the drop, where formation of a monolayer can be observed (Figure 1C). If necessary, incubate the plate up to 3 h. Be sure that the humidity in the incubator is high enough as the drops can dry out quickly. If a reduction of the drop volume during this step is observed, add PBS to the spaces between the wells to increase humidity.",
    "Gently wash the wells with 1 mL of culture medium twice to remove non-attached cells. Add 1 mL culture medium to each well. Check in an inverted microscope that no floating cells remain, otherwise wash the wells again. Incubate cells overnight at 37 °C, 5% CO2, humidified atmosphere, to obtain well-defined cell sheets.\n\t\tNote: Floating cells are likely to re-attach to the plate and to form undesired cell colonies.\n3. Stimulating Cells (Day 3)\nCheck all wells using an inverse microscope to ensure that cell colonies have grown properly. If necessary, mark unsuitable wells and do not use them.\nLabel each well of the plate appropriately for each condition investigated. Run each condition in duplicate or triplicate.\nChange the medium to starve the cells in DMEM/F12 containing 0.1% horse serum (starving medium) 3 h before cells are stimulated.\nStimulate the cells by addition of EGF (5 ng/mL final concentration) or other desired mediators and gently mix the medium using a 1 mL micropipettor or by swirling the plate.\nIncubate the plate for 1 - 4 days to observe edge displacement and edge contour as described in section 4.1 or perform time-lapse imaging as described in section 4.2.\n4. Visualization of Cell Colonies and Cell Migration\nHematoxylin-eosin (HE) staining to measure colony growth (Day 4 - 7)\nFix cells in 70% ethanol (1 mL/well) for ~2 min.\nStain nuclei with hematoxylin (1 mL/well), ~2 min.\nWash cells with tap water (1 mL/well) until nuclei are blue, 5 - 10 min.\nStain cytoplasm with eosin (1 mL/well), ~2 min.\nRinse with deionized water (1 mL/well).\n\t\tNote: Hematoxylin and eosin solutions can be collected and used multiple times until the staining becomes faint.\nAir-dry plate.",
    "Flip the plate and measure the dot diameter with a ruler. Alternatively, take pictures of the plate with a camera, and analyze the dot diameter in ImageJ.\nTime-lapse microscopy (Day 3)\nSwitch on the incubator microscope and adjust the temperature to 37 °C. Fill the humidifier with dH2O. Adjust the CO2 to 5%. Ensure that the incubator chamber is humidified and that the motorized stage can move freely. Close the incubator chamber and allow the microscope to adjust to 37 °C.\n\t\tNOTE: The microscope (see the Table of Materials) used here should be heated to 37 °C for at least 3 h before the cells are imaged to avoid drifting of the focus.\nPlace the plate on the stage of the incubator microscope and set up the stage list. Image two opposing edges and the center of each cell dot (Figure 1A).\nTake images every 3 min, for 15 - 24 h using the 10X objective. Download the data and proceed with image analysis in a program of choice, e.g., ImageJ or Matlab.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}