{
  "id": 17911,
  "origin_website": "Jove",
  "title": "Radiation Treatment of Organotypic Cultures from Submandibular and Parotid Salivary Glands Models Key In Vivo Characteristics",
  "procedures": [
    "1. Preparation of vibratome\nSpray detachable components of the vibratome including the buffer tray, blade attachment, agarose block mold, and laboratory film with 70% ethanol, then UV-sterilize for at least 30 min.\nPlace and secure an additional sheet of laboratory film over the buffer tray to prevent ice from falling in.\nFill the ice chamber with crushed ice, remove the laboratory film from the buffer tray, and fill the buffer tray with 100 mL of ice-cold 1x phosphate buffered saline (PBS) solution supplemented with 1% penicillin-streptomycin-ampicillin (PSA).\nPlace a stainless steel razor blade into the blade holder. Use the screwdriver to tighten/loosen and change the angle of the blade.\n2. Preparation of tissue sample in agarose block and sectioning using the vibratome\nAutoclave all necessary dissection and sectioning tools including forceps, scissors, and paintbrushes.\nPrepare 3% low melting point agarose in sterile 1x PBS and microwave until the agarose dissolves into solution. Ensure that the solution does not boil over and swirl the bottle periodically to mix.\n\tNOTE: Prevent the low-melting agarose from solidifying by keeping it in a warm water bath. The low-melt agarose is fluid at 37 °C and sets at 25 °C. However, the water bath should be below 40 °C in order to pour the agarose around the tissue at physiological temperature.\nIsolate salivary glands and place dissected tissue into 2 mL ice-cold 1x PBS supplemented with 1% PSA in a sterile, 30 mm culture dish.\nUsing autoclaved forceps, remove salivary glands from 1x PBS + 1% PSA solution and position at the bottom of an embedding mold. Fill the mold with liquid 3% low melting point agarose to cover the tissue.",
    "Using the forceps, adjust the tissue to the middle of the block and position the salivary gland in the appropriate plane. The best cross sections for the submandibular and parotid glands are in the vertical plane.\nPlace agarose block on ice for 10 min to harden.\nCarefully run a razor blade around the outer edge of the agarose to loosen and let the block slide out onto the UV-sterilized laboratory film from step 1.1.\nUse a razor blade to cut out an agarose box containing the salivary gland. Ensure that the plane of section is straight and parallel to the opposite side of the block (the surface that will be glued down). Since the agarose does not infiltrate the tissue, do not trim off too much agarose around the tissue so the tissue will be well supported.\nUse superglue to attach the block to the cutting surface.\nSection at 50 µm or 90 µm thickness by vibratome at a speed of 0.075 mm/s and frequency of 100 Hz.\n\tNOTE: Setting the vibratome at the highest frequency and lowest blade speed provides the most optimal slices.\nCollect sections in a 24-well tissue culture dish containing ~1 mL ice-cold PBS per well using an autoclaved, natural hair paintbrush, placing the brush in 70% ethanol between slice collections to maintain sterility.\n3. Culturing sections\nAutoclave a micro-spatula and forceps.\nMake stock vibratome culture media with or without fetal bovine serum (FBS): DMEM/F12 media supplemented with 1% PSA, 5 µg/mL transferrin, 1.1 µM hydrocortisone, 0.1 µM retinoic acid, 5 µg/mL insulin, 80 ng/mL epidermal growth factor, 5 mM L-glutamine, 50 µg/mL gentamicin sulfate, and 10 µL/mL trace element mixture. Add an appropriate amount of FBS to make 0%, 2.5%, 5.0%, or 10% solutions.",
    "Prior to sectioning, add 300 μL of pre-warmed media and place a 12 mm diameter, 0.4 µm pore-size membrane insert into each well of a 24-well tissue culture plate. The media should reach the membrane bottom to create a liquid-air interface for culture.\nGently lay the salivary sections on top of the membrane insert using the micro spatula and culture at 37 °C in humidified 5% CO2 and 95% air atmosphere incubator.\n\t\nAdd approximately 300 μL primary culture media into the well and a few drops into the membrane inserts (approximately 40 μL) every other day or as needed. Proper culturing showed that the cells are able to survive and be maintained for up to 30 days ex vivo.\n4. Irradiation of salivary gland sections\nTreat sections with a single dose of radiation (5 Gy) using cobalt-60 (or equivalent) irradiator.\n\t\nTransport sections to irradiator facility using a covered styrofoam container to avoid fluctuations in temperature. In addition, care needs to be taken during transport back to the laboratory incubator to ensure that media does not splash onto culture lid and induce contamination.\nPlace the 24-well plate containing salivary gland sections 80 cm from the radiation source, in the center of a 32” x 32” radiation field. Radiation dose calculations and corresponding time in irradiator will vary by instrument and cobalt-60 decay.\nContinue monitoring and culturing these sections as described in section 3.\n5. Viability staining\nAspirate old media and wash slices twice with sterile, pre-warmed 1x PBS.\nStain sections with trypan blue dye.\n\t\nUse a micro-spatula to move the slice from the culture to a glass slide.\nAdd 0.4% trypan blue solution to the vibratome slice with enough volume to cover the tissue (10–20 µL).",
    "Incubate slices at room temperature (RT) in the trypan blue for 1–2 min for the dye to penetrate the tissue. Nonviable cells will be stained blue, and viable cells will be unstained.\nStain sections with calcein, AM live-cell dye.\n\t\nAdd enough volume of stain to cover the section in one well of a 24 well-plate (200–300 µL).\nIncubate slices at RT for 15 min to allow dye penetration.\nCarefully remove the section from the well and place on a glass slide. Mount slices with 1 drop of mounting media.\nImage sections on a fluorescent microscope at excitation/emission wavelengths of 488 nm and 515 nm.\n6. Antibody staining vibratome sections\nNOTE: The following provides a general antibody staining protocol specific for Ki-67; however, this protocol can be used with any antibody. All washes are conducted at RT unless otherwise noted.\nIn the multi-well tissue culture dish, aspirate off media and wash at least 2x with sterile 1x PBS.\nFix sections using 4% paraformaldehyde (PFA) overnight at 4 °C.\nAspirate off 4% PFA and wash 3x with PBT [1x PBS, 1% bovine serum albumin (BSA), 0.1% Triton X-100].\n\tNOTE: Sections can be stored in 1x PBS at 4 °C and stained at a later time. Maximum storage time tested in this manuscript was 3 weeks. Longer storage time will need to be optimized by the individual user if that is desired.\nPermeabilize sections using 0.3% Triton X-100 in 1x PBS for 30 min.\n\tNOTE: This step can be modified and optimized for specific antibody staining and permeabilization.\nPipet off permeabilization solution.\nWash slices 3x for 5 min with 1x PBS, 1% BSA, and 0.1% Triton X-100 (PBT).\nBlock the slices with blocking agent with 1% normal goat serum for 1 h.\nWash the slices 3x for 5 min with PBT.",
    "Incubate the slices overnight at 4 °C with 500 µL anti-Ki67 rabbit monoclonal antibody diluted in 1% BSA in 1x PBS.\n\tNOTE: For phalloidin staining, skip step 6.9 and proceed using the protocol for the specific phalloidin used. For DNA counterstain, skip to step 6.15.\nAspirate anti-Ki67 rabbit monoclonal antibody.\nWash the slices 6x for 5 min in 1x PBS.\nIncubate the slices in 500 µL of fluorescently conjugated secondary antibody compatible with the anti-Ki67 antibody diluted in 1% BSA in 1x PBS at RT for 1.5 h covered from light.\n\tNOTE: Based on secondary antibody used, incubation time with the secondary antibody can be further optimized by the individual user. In addition, the secondary antibody is light-sensitive. All subsequent washes must be performed in the dark.\nAspirate secondary antibody.\nWash slices for 3x for 5 min with 1x PBS.\nWash slices for 5 min in deionized water.\nCounterstain slices with DAPI (1µg/mL) for 20 min at RT.\nWash slices (once) for 5 min in deionized water.\nMount slices with one drop (~40 µL) of mounting media. To avoid excess bubbles, slowly place the coverslip onto the mounting media on the slide, starting with a 45° angle.\n\t\nTo prevent crushing the thick sections with the coverslip, mount each slice with a spacer. A spacer can be created by placing a rim of vacuum grease in a square around the tissue section.\nWhen laying the coverslip, the edges of the coverslip can be sealed with vacuum grease. Press down on the edges of the coverslip with your thumb to firmly adhere it onto the slide. Alternatively, seal the coverslip onto the microscope slide using clear nail polish.\n7. Imaging vibratome sections\nImage the stained slides within 5 days of staining.",
    "Obtain optical sections of the stained vibratome slices using a confocal microscope. With a confocal microscope, obtain a z-stack at a defined step size or take individual images depending on the user’s experimental design. Images can be examined on any computer screen after confocal collection.\n\tNOTE: Due to the thickness of the vibratome slices, it is recommended that a confocal microscope or a scope with z-stack capability is used to visualize details within the samples. For the images used in this manuscript, a 63x oil objective was used; however, this can be tailored and further modified by the individual user and the specific scope used. Recommended pixel resolution for each objective and zoom factor with the assumed Nyquist sampling of 2.5 pixels in X and Y for the smallest optically resolvable structure was used. However, some commentators suggest 2.3 pixels, while others suggest 2.8 pixels. Please refer to the Handbook of Biological Confocal Microscopy22 for further details on how to make these calculations.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}