{
  "id": 18436,
  "origin_website": "Jove",
  "title": "Cutaneous Surgical Denervation:  A Method for Testing the Requirement for Nerves in Mouse Models of Skin Disease",
  "procedures": [
    "All procedures described in this protocol were performed in accordance with regulations established by the University of Michigan Unit for Laboratory Animal Medicine.\n1. Induce Genetic Recombination in Mice\nNote: The Gli1tm3(cre/ERT2)Alj/J mouse strain (Gli1-CreERT2)13 enables targeting of tamoxifen-induced genetic recombination to TD epithelia. Cross this strain with B6.129S4-Gt(ROSA)26Sortm1Sor/J reporter mice (LacZ)22 to generate Gli1;LacZ animals to visualize TD cells by whole-mount staining below.\nPrepare tamoxifen solution to a concentration of 12.5 mg/ml in corn oil.\n\t\nIn a 1.5 ml tube, add up to 20 mg of crystalline tamoxifen, and then 1 ml of corn oil. Firmly tape the tube to a vortex mixer, and vortex continuously at the highest setting at RT until the tamoxifen has fully dissolved (2-4 hr), as confirmed by examining the tube under a dissecting microscope for the absence of tamoxifen particulates.\nTransfer the solution to a 15 ml tube and dilute the tamoxifen to a final concentration of 12.5 mg/ml with additional corn oil. Mix by vortexing the viscous solution for an additional 30 sec. Store this solution for up to 1 week at 4 °C in the dark.\nInject the tamoxifen solution intraperitoneally into Gli1;LacZ mice, at a volume of 200 µl per 20 g of mouse body weight, for an effective tamoxifen dose of 2.5 mg per 20 g mouse weight.\n2. Harvest Skin Biopsies\nNote: Depending on the experiment, harvest skin biopsies several days to weeks after tamoxifen induction. For all surgeries, follow standard protocols for rodent surgery, including using sterile gloves, wearing a surgical mask or hair net, and covering the animal with a sterile surgical drape during the procedure.",
    "Prepare 10x stock anesthetic solution by mixing 90 mg/ml ketamine and 6.5 mg/ml xylazine in water. Dilute this stock solution 1:10 into sterile PBS just prior to use, and store at RT in the dark for up to 8 months.\n\t\nAlternatively, anesthetize mice by isoflurane inhalation, beginning with a gas concentration of 4% with oxygen to fully anesthetize the animal, and then subsequently lowering this to 1-2% for the duration of the procedure.\nInject the anesthetic solution intraperitoneally at a dose of 200 µl per 20 g mouse body weight. Check that the animal has reached the proper plane of sedation by toe pinch assay, and confirm that heart and respiratory rates are normal (approximately 600 beats and 160 breaths per min, respectively).\nUse an electric clipper to remove the hair from the site of biopsy on the dorsal back skin, being careful not to nick or damage the underlying skin.\nPrepare the surgical site by wiping the shaved area in an anterior-to-posterior direction using Betadine and alcohol wipes. Ensure all hair clippings are removed from the site.\nOutline the biopsy site using a black marker,  place the animal on a warming pad in an aseptic surgical area, and cover with a sterile surgical drape (for demonstration purposes, sterile drape was omitted to increase visibility).   \n\tNote: To obtain longitudinal sections of hair follicles, the longer edge of the biopsy (the edge to be sectioned for histology, ~1 cm) should run in an anterior-posterior direction (parallel to the direction of the hair follicles), parasagital to the dorsal midline (Figure 1A).\nUse a sterile #11 scalpel to make a full thickness excision along the marked area without damaging the underlying muscular fascia.\n\tNote: The excised skin tissue includes the epidermis, dermis, subcutaneous fat and panniculus carnosus. Bleeding is typically minimal.",
    "Flatten the excised skin sample on a dry paper towel, dermis side down, trim away the excess paper towel, and store the sample in cold PBS for up to 1 hr if other samples need to be collected. When ready, proceed to Steps 3.1 or 3.2 to process samples for histology, or Step 4 for whole-mount β-galactosidase (LacZ) staining.\nSuture close the biopsy site using 6-0 nylon sutures, in a simple interrupted pattern spaced roughly 3 mm apart.\nDo not return mice that have undergone surgery into the same cage as other animals until after full recovery.\nMonitor animals immediately after surgery until they regain consciousness, and also daily until the surgical area has healed, typically within 1 week. Use analgesics in accordance with designated institutional animal care and use guidelines if mice exhibit signs of pain or distress. Remove sutures within 7-10 days after surgery.\n\tNote: If needed, prepare analgesic solution by diluting carprofen (50 mg/ml stock solution) 1:100 in sterile water.  Inject the solution subcutaneously between the shoulder blades near the scruff of the neck, at a dose of 200 µl per 20 g body weight (5 mg/kg mouse body weight).\n3. Process Samples for Histology\nNote: To fix and process the excised tissue, use either method below depending on application.\nTo generate paraffin-embedded histological samples, fix the skin in 3.7% formalin in PBS O/N at RT and store in 70% ethanol for up to 2 weeks. Remove the paper towel before embedding into paraffin.\nFor generating frozen histological samples, submerge the tissue in cold 4% paraformaldehyde in PBS and gently shake for 1 hr. Remove the solution and wash the sample with 3 changes of PBS, roughly 5 min each. Next, submerge the sample in 30% sucrose in PBS to cryoprotect the tissue (\"sucrose sinking\").",
    "Incubate with gentle shaking O/N at 4 °C. The next day, remove the paper towel and trim away excess adipose tissue from the dermal side of the skin. Embed the tissue directly into OCT and store the frozen block at -80 °C.\n\tNote: After sectioning, either paraffin or frozen samples can be stained by immunohistochemistry to identify TDs, Merkel cells and nerves using antibodies against Keratin 17, Keratin 8 and Neurofilament, respectively, as previously described5,19.\n4. Visualize Samples by Whole-mount LacZ Staining\nPrepare X-gal staining solution.\n\t\nCombine 0.94 g sodium phosphate monobasic, and 2.6 g sodium phosphate dibasic in 250 ml of sterile water. Adjust pH to 7.3. To this, add 0.5 ml of 1 M magnesium chloride, 0.528 g of potassium ferrocyanide, and 0.412 g of potassium ferricyanide. Add 250 µl of octylphenyl-polyethylene glycol and 125 mg of deoxycholate. The base solution can be stored at 4 °C for up to 6 months in the dark.\nPrepare 50x stock X-gal solution by adding dimethylformamide to the X-gal stock bottle to generate a 50 mg/ml solution. Store this solution at -20 °C in the dark.\nJust prior to use, dilute stock X-gal solution 1:50 into X-gal base solution to generate staining solution. For smaller biopsies (<1 cm2), aliquot 1-2 ml of staining solution per sample.\nFix the skin sample collected in Step 2.7 in a solution containing 2% paraformaldehyde/0.2% glutaraldehyde in cold PBS for 30 min, gently shaking on ice. For smaller biopsies (<1 cm2), use 1-2 ml of fixative solution per sample.\n\tNote: Alternatively, fix samples in 2-4% paraformaldehyde only, or in 0.5% glutaraldehyde only. Optimal fixation conditions depend on the tissue, degree of LacZ expression and application.\nRemove the fixative solution, and rinse samples with 3 changes of PBS, 5 min each, on a shaker at RT.",
    "Remove the paper towel underneath the sample and cut away excess adipose tissue from the dermal side of the skin by gripping the fat with blunt forceps and trimming with dissecting scissors.\nSubmerge the sample in X-gal staining solution, and incubate at 37 °C O/N. LacZ expression will be visible as a blue stain under a dissecting microscope (Figure 1B).\n\tNote: If the signal intensity is weak, replace the staining solution the next day and repeat the O/N incubation. If the background staining is too intense, reduce the time of staining, or incubate the sample at RT instead of 37 °C.\nRemove the staining solution and wash the samples in 3 changes of PBS containing 3% DMSO for approximately 5 min, gently shaking at RT.\nWash samples in 2-3 changes of 70% ethanol for 5 min each. Store samples in 70% ethanol.\n5. Surgical Denervation\nAnesthetize the animal as in Step 2.2 and shave the entire dorsal skin.\nPrepare the surgical area of the back skin using Betadine and alcohol wipes, and cover the animal with a sterile surgical drape (for demonstration purposes, sterile drape was omitted to increase visibility).  Keep the animal warm using a heating pad while operating in an aseptic surgical area.\nMake an incision using a sterile #11 scalpel along the dorsal midline from the base of the neck to roughly 0.5 cm above the tail.\nUsing blunt forceps, gently reflect the skin on the left side away from the flank to visualize the underlying tissue from the scapular fat pads near the neck to just above the hind limb.\n\tNote: Dorsal cutaneous nerves appear as white strands that travel caudally through the translucent fascia of the trunk wall before making sharp bends and entering the loose connective tissue underneath the skin (Figure 2).",
    "Using ultra-fine forceps under a dissecting light microscope, remove the nerves exclusively from the left side of the animal located at anatomical sites T3-12 by plucking from where the segments bend at the trunk wall to their entry sites into the skin (Figure 2).\n\t\nOrient forceps vertically and remove the nerves by grasping approximately 0.5 cm below their bend sites and pulling upwards, causing the nerve to stretch and separate from the surrounding tissue (Figure 2C-E). Be careful to avoid rupturing adjacent blood vessels.\nContinue until all nerves extending from the trunk wall to the skin are removed. Do not disrupt the nerves within the dense fascia of the trunk wall. Keep the tissue moist throughout the procedure by periodically applying drops of sterile 0.9% saline solution.\nAlternatively, remove nerves by grasping their proximal ends near the trunk wall with forceps and snipping with fine scissors. Afterwards, sever the distal ends near the skin (Figures 2F-H). Finally, remove the intervening nerve segments (Figure 2I).\nRemove any nerves from the skin flap exposed in Step 5.4. These fibers comprise the distal branches of the dorsal cutaneous nerves and appear as white branching strands located sporadically within the connective tissue on the dermal side of the skin flap (Figures 2J-K).\n\t\nTo remove these fine branches, position the fine forceps roughly parallel to the dermal surface, grasp the nerves and pluck upwards to avoid disrupting blood vessels and puncturing the skin. Continue until all visible nerves have been removed.\nUsing blunt dissection, reflect the skin on the right side of the dorsal midline incision, but do not remove the nerves. This will serve as the contralateral sham-operated control.",
    "Suture along the dorsal midline in a simple interrupted pattern  to close the incision. Monitor the animal during recovery and post-operatively as previously demonstrated (Steps 2.8-10). Remove sutures within 7-10 days after surgery.\nTo functionally assess stable denervation up to several weeks after surgery, remove the hair from the dorsal skin using an electric clipper.\nGently prick the denervated skin area using a hypodermic needle, and note whether the animal responds, typically by shuddering or turning its head. If the skin area has been stably denervated, the animal will exhibit little or no response.\nUsing a black marker, outline the area of no response, as well as an area of similar size and location on the contralateral sham side.\nCollect biopsies from these sites as in Steps 2.1-2.9 for analysis.\n\tNote: Alternatively, the entire dorsal back skin, including denervated and sham-operated regions, can be removed as a single sheet for whole-mount staining, similar to as described in Step 4.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}