{
  "id": 8327,
  "origin_website": "Jove",
  "title": "Pre-Chiasmatic, Single Injection of Autologous Blood to Induce Experimental Subarachnoid Hemorrhage in a Rat Model",
  "procedures": [
    "This procedure is done in accordance with the European Union's Directive 2010/63/EU regarding the protection of animals used for scientific purposes and approved by the Danish Animal Experiments Inspectorate (license no. 2016-15-0201-00940). Surgery is performed using aseptic technique to the widest extent possible, including sterile instruments, gloves, catheters, and sutures. The study used male and female Sprague-Dawley rats weighing 230-350 g, group housed in 12-h light/dark cycle, with constant temperature of 22 °C (± 2 °C), and humidity of 55% (± 10%). The animals are provided with standard chow and water ad libitum. The animals are housed in single cages following surgery but can be returned to group caging when the ICP-probe has been removed. The anesthetic in this protocol is isoflurane gas but a 1.5 mL/kg of 3:2 intraperitoneal mixture of ketamine (100 mg/mL) and xylazine (20 mg/mL) is also effectful21.\n1. Preparations\nModify a 16 G peripheral vein catheter for intubation. To modify, shorten the needle by 1 cm and bend the remaining distal 1 cm by 30° toward the injection valve. Remove the catheter wings (multiple use).\nTo make an ICP probe, cut a 20 mm piece of polythene tubing (inner diameter (ID): 0.58 mm, outer diameter (OD): 0.96 mm) and burn one end to make a circular plate, keeping an open lumen. Circumvent the polythene tubing with 1 mm of silicone tubing (ID: 1.0 mm, OD: 3.0 mm) before connecting 10 mm of silicone tubing (ID: 0.76 mm, OD: 2.4 mm) to the end of the polythene tubing.\nPower on the laptop and open the data acquisition software. Calibrate the blood pressure (BP) and intra cerebral pressure (ICP) transducers, and the Laser-Doppler according to the manufacturer's instructions.\nPrepare the blood gas analyzer apparatus.\n\tCAUTION: Make sure there is enough isoflurane in the vaporizer.",
    "Turn on the O2 and atmospheric air flow. Set the flow of O2 at 30% and atmospheric air at 70%.\nPlace the heating pad and set the temperature to 37 °C.\n2. Anesthesia\nPlace the rat in the anesthesia chamber with a flow of 30% of O2 and 70% of atmospheric air. Administer 5% of isoflurane gas into the chamber. Adequate anesthesia will take around 4 min. Control the breathing carefully.\nWhen anesthetized, place the rat in supine position on a heavy plate circumvented by a rubber band. Place the front teeth of the rat below the rubber band.\nDraw the tongue out carefully with curved forceps. Clean the larynx with a cotton tip. Place an external light in the midline of the throat to visualize the vocal cords.\nIntubate during inspiration using the modified 16 G peripheral vein catheter. When correctly inserted, remove the stiletto. Connect the catheter to the ventilator.\n\tNOTE: Correct placement of the tube is confirmed by chest movements in sync with respiration rate. If movements of the abdomen are seen, extubate and reintroduce the rat into the anesthesia bell. Do not repeat the procedure more than three times due to the risk of damaging the airways.\nWhen intubated, keep the animal on artificial respiration with 30% of O2 and 70% of atmospheric air. Maintain the anesthesia at 1.5%-3% of isoflurane. Adjust the isoflurane to keep the blood pressure between 80-100 mmHg.\nKeep the inspiratory volume of the respirator at 3 mL and the frequency at 40-45 inspirations/min. Adjust the inspiratory volume according to the blood gas analysis.\nMake a stitch through the inner soft tissue of the cheek with a 2-0 suture. Tie the suture around the injection tube and the injection valve of the peripheral vein catheter to fasten the catheter.",
    "Move the rat to the operating field and place it in supine position with the tail facing toward the surgeon.\nApply the eye gel when needed to counter dry eyes.\nPerform a toe pinch to confirm an adequate depth of anesthesia. Assess and maintain anesthesia depth during surgery.\n3. Tail catheter\nDisinfect the proximal 3-4 cm of the tail with 0.5% of chlorhexidine ethanol.\n\tNOTE: From now on, use the surgical microscope upon the surgeon's discretion.\nMake a 15-20 mm skin incision in the proximal end of the tail on the ventral side. Be careful not to incise the artery.\nLoosen the skin from the underlying connective tissue using a curved forceps.\nCarefully penetrate the fascia exposing the artery.\nCarefully release the tail artery from the underlying tissue using a curved forceps.\nSlip three black silk threads under the vessel. Place one thread as distally as possible and tie a surgical knot tightly around the artery. Hold the loose ends of the thread with a hemostat.\nTie the two remaining threads loosely around the artery.\nPush the proximal thread as proximally as possible. Apply a hemostat to hold the ends of the proximal thread. Pull the hemostat lightly, but enough to restrict and block the blood flow. Place the hemostat on the abdomen.\nCut the tip of the catheter at a 45° angle. Cut the sharp point to prevent arterial wall penetration.\nUsing a Vannas scissor, make an artery incision 1/3 of the artery's diameter at a 30° angle, 3-5 mm from the distal knot.\nInsert the catheter into the artery using two straight forceps. Use one forceps to hold the catheter and the other to carefully pull the artery over the catheter.",
    "Insert the catheter up the vessel to the proximal knot and loosen the knot from the hemostat. Visualize the blood flow in the catheter. Fasten the middle thread loosely to the catheter.\nContinue insertion to, and if possible, just beyond, the point where the artery is covered again by fascia.\nControl the catheter placement and possible leak by flushing with saline.\nFasten the two proximal threads using surgical knots.\n\tNOTE: The blood pressure measurement needs to be pulsatile; if not, the catheter is not properly placed.\nFasten the catheter at the end of the incision by tying a surgical knot using the distal thread.\nStitch the skin incision loosely together with two non-resorbable monofilament 4-0 suture. Be careful not to penetrate the catheter.\n\tNOTE: Throughout the surgery be aware of the amplitude of pulsation. If this is low, flush the catheter with saline.\nLoosen the arterial catheter from the pressure transducer to allow blood flow for blood gas sampling. Place a micro capillary tube at the end of the catheter. Let the blood flow into the tube. Re-attach the catheter to the transducer after blood collection and flush the catheter.\nInsert the capillary tube in the blood gas analyzer. Measure the pH, pCO2, and pO2 and note them down\n\t​NOTE: Depending on the blood gas and blood pressure values, change the ventilation rate. If the mean arterial pressure (MAP) is too low, try to turn down the flowrate of isoflurane. Test the reflexes to ensure proper depth of anesthesia.\n4. ICP probe\nPlace the rat in the stereotaxic frame. It is important to position the rat symmetrically.\nPlace a cylindrical pillow under the stereotaxic frame to create anterior flexion of the neck.\nShave the rat's scalp, neck, and the area behind the ears. Remove the superfluous hair.",
    "Disinfect the area with 0.5% of chlorhexidine ethanol.\nAnesthetize locally with 0.7 mL of 10 mg/5 µg/mL lidocaine with adrenaline, insert the needle at the caudal end of the skull in the midline. Inject into the musculature of the neck with 0.3-0.4 mL. Inject the rest subcutaneously around and anterior to the bregma.\nMake a skin incision from the needle puncture ~8 mm caudally in the midline.\nDissect all the muscles bluntly in layers to identify the atlantooccipital membrane (marble colored triangle caudally to the skull in the midline).\nUse the Alm retractor to restrain the neck musculature. Place the pronged retractor caudally if needed.\nCheck whether the sterile ICP-probe is connected to the ICP transducer. Flush the ICP probe with saline. Ensure no air bubbles are present in the ICP probe.\nIncise the atlantooccipital membrane using a 23 G needle. Make a hole to coax the ICP probe through the membrane.\nCoax the probe through the atlantooccipital membrane gently. Pull the probe lightly and ensure that it shows a pulsating curve ranging between 0-5 mmHg. If not, remove the probe, check the connection to the transducer, and confirm the flow through the lumen.\nApply two drops of the tissue glue. Move the 1 mm silicone tubing forward to the membrane and apply additional glue to minimize the risk of ICP-probe displacement.\nRemove the retractor(s).\nMake one horizontal mattress suture to the cephalic end of the incision and one simple interrupted suture to the caudal end using a non-resorbable monofilament 4-0 suture.\n5. Placement of the needle and the Laser-Doppler probe\nMake an incision in the midline just anterior to the eyes, 15 mm caudally.",
    "Remove the connective tissue and the muscles with forceps. Use the end of a sterile cotton swab as a rougine making it possible to identify the bregma and the coronal sutures.\nPlace the Alm retractor.\nPlace a 25 G spinal needle in the stereotaxic frame. Place the needle exactly on the bregma and note the position.\n\tNOTE: Place the midline joint of the stereotaxic frame at 30° toward the animal in the vertical plane.\nRemove the needle from the bregma, move the frame 65 mm anteriorly and then replace the needle in the midline to mark the site of drilling.\nDrill until the dura mater is identified below the bone. Gently remove the bone fragments using straight forceps and fill the cavity with bone wax.\nDrill another hole 3-4 mm lateral to the right of the bregma and just anterior to the coronal suture for the Laser-Doppler. It is not necessary to drill all the way through the bone. Be careful not to penetrate the dura mater.\nLook for the vessels where the laser-doppler can measure the blood flow. Place the laser-doppler and check the values. A minimum value of 100 FU is required. Remove the microscope (artificial light).\nIf the values are still acceptable, add one drop of glue to fix the probe.\nRecheck to confirm whether the value is above 80 FU. If the value is below 80 FU, remove and reposition the probe to reach a value above 80 FU.\n\t​NOTE: The value, FU, is an arbitrary unit showing cerebral blood flow (CBF).\n6. Induction of SAH\nInsert the needle gently through the skull in the midline between the hemispheres until resistance of the base of the skull is felt. Retract the needle by 1 mm to ensure correct placement just anteriorly to the optic chiasm.",
    "Turn the needle 90° clockwise so that the needle tip points to the right to ensure the most homogenous result when injecting the blood. Remove the stiletto (Figure 3).\nEquilibrate for 15 min and adjust the level of anesthesia to obtain a mean arterial blood pressure in the range 80-100 mmHg.\nPerform a blood gas analysis. Adjust the level of anesthesia accordingly.\nWithdraw 500 µL of blood from the tail catheter using a 1 mL syringe with a blunt 23 G needle.\nFill the dead space of spinal needle chamber with blood to avoid injection of air. Remove the 23 G needle from the blood-filled syringe and confirm that the syringe contains 300 µL of blood.\nConnect the syringe to the spinal needle. Grasp firmly and inject the blood manually to surpass MAP.\nObserve a steep rise in ICP and a steep fall in CBF on the laptop.\n\t​NOTE: CBF should be 50% or lower compared to the baseline score for at least 5 min for the surgery to be successful, see Figure 4. Sham rats do not undergo the steps 6.1-6.7, thereby omitting the introduction of the spinal needle into the cerebrum, minimizing possible spontaneous hemorrhage, and iatrogenic brain damage.\n7. Recovery and awakening\nAdminister 0.1 mL/100 g of animal weight of 5.0 mg/mL of carprofen and 1 mL/100 g of animal weight of isotonic saline subcutaneously. Make sure the liquids are at least at room temperature before administering.\nSubsequently keep the rat under anesthesia for 30 min following the SAH.\nRemove the needle, the laser doppler probe, and then fill the cavities with bone wax. Close the incision using two horizontal mattress sutures with non-resorbable monofilament 4-0 suture.",
    "To use the ICP probe for injections into the cisterna magna, remove the silicone tubing and insert a pinpoint adapter to the polythene tubing.\nIf no intervention is planned, cut the simple, interrupted suture. Shorten the ICP probe as much as possible using a scissor and then glue the end to prevent leak of cerebrospinal fluid (CSF). Close the incision with a non-absorbable monofilament 4-0 suture.\nRemove the rat from the stereotaxic frame and place in a supine position. Remove the loose sutures from the tail incision.\nPlace a single suture proximal and deep to the arterial catheter. Remove the catheter and tie the suture to prevent bleeding. Suture the tail-incision with a non-absorbable monofilament 4-0 suture.\nTurn off the isoflurane.\nClean the rat and its fur as much as possible.\nWhen the pedal withdrawal reflex is regained and the rat has spontaneous respiration when decoupled from the ventilator, extubate it.\nPlace the rat in a single cage with food and water ad libitum. Place one half of the cage under a heating plate and place the rat in this area of the cage.\nPerform intrathecal administration by adapting the pinport injector to a precision syringe and administer the treatment through the pinport adapter. This intervention is feasible in animals that are awake. See Figure 5.\n8. ICP-probe removal (if not removed during surgery)\nNOTE: Use a surgical microscope upon the surgeon's discretion.\nPlace the rat in the anesthesia chamber as described earlier.\nWhen anesthetized, place the rat in supine position in the operation field with heating pad.\nPlace the nose in the anesthesia mask. Set the levels of O2 to 30%, atmospheric air to 70%, and isoflurane to 2%.\nContinuously apply the eye gel to counter dry eyes.",
    "Cut the caudal simple interrupted suture. Open the incision and remove the possible necrotic tissue or blood clots.\nShorten the ICP probe as much as possible using a scissor and glue the end to prevent the leak of cerebrospinal fluid (CSF). Close the incision with a non-absorbable monofilament 4-0 suture.\nTurn off the isoflurane.\nWhen the rat starts to move, place it in a single cage with food and water ad libitum. Place one half of the cage over a heating plate and place the rat in this area.\nWhen returned to habitual state, reintroduce the animals to each other in a joint cage under supervision for the first 15 min.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}