{
  "id": 9099,
  "origin_website": "Jove",
  "title": "Experimental Strategies to Bridge Large Tissue Gaps in the Injured Spinal Cord after Acute and Chronic Lesion",
  "procedures": [
    "Institutional guidelines for animal safety and comfort were adhered to, and all surgical interventions and pre- and post-surgical animal care were provided in compliance with the German Animal Protection law (State Office, Environmental and Consumer Protection of North Rhine- Westphalia, LANUV NRW).\n1. Complete Transection of the Thoracic Spinal Cord of Female Wistar Rats (220 - 250 g)\nPreparation of the Spinal Cord\nUse isoflurane inhalation anesthesia (2 - 3% of isoflurane in O2/NO2 at a ratio of 1:2) and bolus injection of Carprofen (subcutaneously [s.c.] 5 mg/kg). The combination of carprofen and the opioid buprenorphine (0.02 mg/kg s.c.) is recommended. Start surgery when eye lid reflex to light touch with a cotton bud and paw withdrawal reflex to pinching stimulus with forceps are no longer observed.\nPlace the animal on a heating blanket at 37 °C to maintain body temperature during surgery and put eye ointment on eyes to avoid dryness while under anaesthesia.\nShave the animal's back and prepare the skin with a skin disinfectant.\nCut the skin at the midline along the thoracic vertebrae for 4 cm with a surgical blade and open it. From this step on, use sterilized surgical instruments for all procedures (autoclaved or immersion-sterilized).\nRetract the muscles above the thoracic vertebrae using a small muscles clamp.\nRemove the spinous processes at thoracic level 8 (Th8) and Th9 with a bone rongeur by cautiously clipping small pieces of bone until the vertebral bones are flat.\nUse anatomical forceps to lift the vertebral column at spinous process Th7 and use a rongeur to clip small pieces of vertebral bone from caudal to rostral until a laminectomy is performed at Th8 and Th9. Expose the dura mater without damaging it by carefully removing only few and very small pieces of vertebral bone at a time.",
    "Clamp the backbone by 2 stabilization clamps at spinous processes Th7 and Th10, lift the animal to uncouple breathing movements from the vertebrae.\nComplete Spinal Cord Transection at Thoracic Level 8/9\nLift the dura mater with fine forceps, cut the dura mater with fine eye scissors in transversal direction.\nHold the lateral cut end of the dura mater with fine forceps and insert a spinal hook into the subarachnoidic space between dura mater and arachnoidea. Avoid damage of the meninges by not pricking into the pia or dura mater with either forceps or spinal cord hook.\nSlowly rotate the hook to place it all along the spinal cord tissue, taking care not to prick into the dura (pia is still intact).\nLift the spinal cord for approximately 1 - 2 mm upwards, until a gap is seen at the ventral side between spinal cord tissue and dura.\nInsert fine eye scissors into the space between dura and pia and cut the spinal cord while the spinal hook is left in place.\nLift the two stumps of the spinal cord with two forceps and visually ensure complete transection.\nFor control-lesioned animals and animals with a chronic injury, close the dura by interrupted sutures with monofilament non-adsorbable 9.0 threads.\nFor chronic lesions follow part 1.6.\nmMS Implantation\nPlace mMS above the injury site with the two tubes lying on each lateral side of the vertebra and lower it into lesion cavity.\nSuture tubes to the muscles at the side of the vertebra with non-resorbable 4-0 thread to ensure stabilization of the mMS. Ensure a fixation of the mMS using forceps during this step.\nRemove the mMS connector pin by cutting with a pair of fine scissors.\nClose the dura above the mMS and suture it with 9.0 threads.",
    "Attach one tube to the vacuum pump, and seal the other by clamping.\nApply gentle negative pressure to the mMS by a vacuum pump via the open tube, sucking the spinal cord stumps into the mMS lumen. Apply the negative pressure for several minutes (at maximum for 10 min) and monitor by sensors (250 - 350 mbar).\nCut the tubes close to the mMS and remove the tubes. Continue with Step 1.6.\nResection of Spinal Cord Tissue Including the Chronic Lesion Scar at Week 5 after Initial Injury\nFollow steps 1.1.1 - 1.1.5.\nIdentify scar tissue by brown-yellow appearance and stiff tissue on top of the spinal cord. Gently remove superficial layers of scar tissue by holding with fine forceps and cutting with fine scissors. With this method, re-open the site of laminectomy to expose the tissue containing the spinal cord injury area. Stop preparation when the dura suture is visually identified.\nClamp the backbone by 2 stabilization clamps at spinous processes Th7 and Th10, and then elevate the animal to uncouple breathing movements from the vertebrae.\nWith a small paperboard ruler measure the spinal cord area which is to be resected (length: 4 mm) and mark the edges of this respective tissue area with transverse incisions to allow the subsequent removal of tissue.\nRemove scar tissue via a combination of cutting and aspiration. Take out the tissue that has been separated from the spinal cord with the transverse incisions. Use gentle aspiration whenever it is sufficient to allow the removal of the tissue. In addition, whenever the stiff texture of the scar tissue makes tissue aspiration too difficult, use fine scissors to cut and remove this tissue.",
    "Insert a piece (approximately 5 mm x 5 mm x 5 mm cube) of hemostatic gelatin sponge into the tissue gap until bleeding subsides. The gelatin sponge will shrink in size as soon as it is soaked with liquid.\nImplantation of PEG 600\nPrepare 1 ml of pure undiluted PEG 600 for injection by heating to 37 °C.\nRemove gelatin sponge.\nInsert sufficient amount (approximately 5 - 7 µl) of PEG into the gap using a 10 µl syringe or a 10 µl pipette.\nCarefully cover the area with a piece (approximately 5 mm x 4 mm) of sealant/dura replacement.\nFix the sealant to surrounding muscle tissue with a few drops of tissue glue. Place the sealant on top of the PEG-filled resection gap. To prevent slippage of the sealant, use small drops of tissue glue to fix the corners of the sealant to the surrounding muscle tissue. Note: Avoid leakage of the tissue glue onto the spinal cord tissue!\nClosing of Tissue and Postoperative Care\nSuture muscles and skin layer for layer with interrupted sutures with braided adsorbable 4-0 threads\nInject 2 × 2.5 ml of sodium chloride (NaCl [0.9%]) at 36 °C s.c. for rehydration after the surgery. A single injection of 5 ml NaCl would stretch the animal’s skin and might cause unnecessary harm to the animal. Do not leave animal unattended until full consciousness is regained.\nInject daily carprofen (s.c. 5 mg/kg) for at least 2 days after the surgery. House animal in single cage during the first 2 days, afterwards in groups of 2 - 3.\nApply antibiotic treatment (daily oral administration of enrofloxacin) for the first post-operative week.",
    "Do manual bladder voiding at two to three times per day by gently stroking over the belly of the animal from rostral to caudal. Be careful not to move the vertebral column of the animal and don't lift the animal at the tail. Manually void the completely spinalized animal’s bladder daily during the whole survival time. Care must be taken to place food pellets and water bottles in a height which can be reached by the animals without standing on their hindpaws. Although being impaired in hind quarter function, the animals move and explore the cages actively immediately after surgery. It is recommended to keep the rats in sociable groups.\nFor chronic lesions leave a survival time of the animals of five weeks before scar resection. Follow steps 1.4.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}