{
  "id": 19606,
  "origin_website": "Jove",
  "title": "Combined Mechanical and Enzymatic Dissociation of Mouse Brain Hippocampal Tissue",
  "procedures": [
    "Experiments were conducted in accordance with the ethical standards approved by the Institutional Animal Care and Use Committee at UAMS. 6-month-old female C57Bl6/J wild-type mice were purchased and group-housed (4 mice per cage) under a constant 12 h light/dark cycle.\n1. Preparation of reagents\nPrepare fixable live/dead stain stock solution. Reconstitute the fluorescent stain with 20 µL of dimethyl sulfoxide (DMSO).\nWrap the vial in foil, label it as \"Reconstituted\", and store it at -20 °C for up to six months.\nPrepare a 0.9% saline solution with heparin. Dilute the contents of one vial of heparin sodium (10,000 USP units per 10 mL) in 1 L of double-distilled water (ddH2O).\nPrepare enough for approximately 45 mL per animal and store at 4 °C for up to one week.\nMake 1% paraformaldehyde (PFA).\n\t\nIn a fume hood, heat a hot plate to 50 °C. In a Microwave, heat 100 mL of ddH2O in a glass beaker to approximately 60 °C. Add a magnetic stir bar and transfer to the hot plate.\nIn the fume hood, weigh out 1 g of PFA and add to the beaker of ddH2O. Add 0.1125 g of NaOH crystals and mix until dissolved (5-10 min).\nAdd 0.4 g of NaPO4- monobasic and mix until dissolved (2-5 min). Vacuum filter the solution and adjust pH to 7.4 with HCl and NaOH.\nCool on ice or at 4°C for 30 min before storing.\n\t\tNOTE: Aliquots of 1.5 mL can be stored at -20 °C for one year. Avoid freeze-thaw cycles. If, after thawing, the solution becomes cloudy or a precipitate has formed, the solution should not be used.\n\t\tCAUTION: Toxic, flammable. Always work with PFA under a ventilated hood wearing proper personal protective equipment.",
    "Resuspend lyophilized Enzyme A with 1 mL of Buffer A. Do not vortex the solution.\n\tNOTE: Enzyme A and Buffer A as well as Buffers A, Y, and Z are reagents in the commercial Adult Brain Dissociation Kit17.\nDivide Enzyme P into aliquots of 50 µL and resuspend Enzyme A into 10 µL aliquots. Per kit instructions, store at -20 °C for up to six months. Avoid freeze-thaw cycles.\n2. Day of experiment\nCool the tabletop centrifuge to 4 °C.\nPlace aliquot(s) of PFA in the fridge for gradual thawing.\nPlace the reconstituted live/dead stain in the dark (e.g., a drawer) to thaw at room temperature.\nPrepare the bovine serum albumin (BSA) Buffer. Add 0.5 g of BSA to 100 mL of 1x Dulbecco's phosphate-buffered solution without calcium and magnesium (D-PBS), pH 7.2.\nAdd a stir bar and mix on a stir plate for 30 min. Transfer to 50 mL conical tubes and store at 4 °C.\n\tNOTE: Always use freshly prepared BSA buffer.\nPrepare live/dead stain working dilution. Add 1 µL of the reconstituted live/dead stain stock solution to 360 µL D-PBS and store it in the dark (e.g., a drawer or box) at room temperature. Prepare 50 µL of the working dilution per sample.\n3. Perfusion\nPlace the saline solution with heparin on ice.\nTurn on oxygen, set the flowmeter indicator ball on the small animal anesthesia vaporizer system to 1 L/min. Ensure there is adequate oxygen pressure and isoflurane.\nAdjust the vaporizer dial to 3.5% (for induction and maintenance).\nPrime the perfusion pump lines with the saline/heparin solution. Set the speed to 6 mL/min.",
    "Place the mouse in the induction chamber, turn on the breather, and wait several minutes until the mouse is unresponsive. Confirm sufficient depth of anesthesia through the absence of pedal withdrawal to noxious pinch.\nPlace the mouse on its back on the dissection tray with its nose in the nose cone. Perform a secondary confirmation of full anesthetization through the absence of pedal withdrawal to noxious pinch. Pin all four paws to the tray.\nSpray the animal's abdomen with 20% ethanol.\nUsing forceps, pinch the lower abdomen and lift the skin. Use scissors to cut through fur and skin to the bottom of the ribcage.\nMake two diagonal incisions from below the ribcage toward each shoulder.\nCarefully resect the diaphragm (avoiding the lungs and heart). Resect the ribcage to expose the heart.\nCarefully sever any connective tissue around the heart.\n\tNOTE: Steps 3.10-3.11 are critical; perform with proficiency and dexterity.\nUse the scissors to clip the right atrium (dark lobe on the upper left of the heart). Turn off the flow of isoflurane to the breather.\nHold the heart steady with forceps. With the bevel of the butterfly needle facing up, pierce the left ventricle while keeping the needle level and parallel to the animal.\nHold the needle in place, turn on the pump, and perfuse at least 30 mL of the saline/heparin solution until the fluid leaving the heart is opaque and the liver and lungs pale in color.\n\tNOTE: Steps 3.13-3.14 are critical; perform with proficiency and dexterity.\nTurn off the pump, remove the needle, and transfer the mouse to the dissection area.\n4. Dissection\nUsing large surgical scissors, decapitate the head.\nCut the fur from the back of the head up to the eyes. Peel the skin back to expose the skull.",
    "Clip the skull between the eyes. Make two cuts at the back of the skull, at the 10 and 2 o'clock positions, then make one long cut (keep tips up to avoid damaging the brain) along the midsagittal line of the skull to the original cut between the eyes.\nUse forceps to peel the two halves of the skull away to the sides. Use a spatula to remove the brain and place it into a 60 mm glass Petri dish on ice filled with cold D-PBS (Figure 1).\nUse a scalpel or razor to separate each hemisphere. Then remove the olfactory bulbs and cerebellum.\nUse forceps to remove the midbrain until the hippocampus is exposed.\nSecure the brain with forceps. Using a second set of forceps, gently tease the hippocampus out of each hemisphere, and transfer both hippocampi to a labeled 1.5 mL tube containing cold D-PBS.\nPlace the sample tube containing the two hippocampi from the mouse on ice.\n5. Prepare Enzyme Mix 1 and 2 for each sample\nNOTE: For volumes greater than 2 mL, use a 10 mL serologic pipette; for volumes, 200 µL-2 mL, use a 1000 µL pipette; for volumes, 21-199 µL, use a 200 µL pipette; for volumes, 2-20 µL, use a 20 µL pipette; for volumes under 2 µL, use a 0-2 µL pipette.\nFor each sample, thaw one aliquot each of Enzyme P and Enzyme A at room temperature.\nFor Enzyme mix 1, combine 50 µL of Enzyme P and 1900 µL of Buffer Z in a labeled C Tube (Table of Materials).\nFor Enzyme mix 2, add 20 µL of Buffer Y to the thawed 10 µL aliquot of Enzyme A.\n6. Adult brain dissociation protocol17",
    "NOTE: When working with samples, tubes should be placed in a tube rack at room temperature while BSA and D-PBS remain on ice unless otherwise noted.\nSwitch on the dissociator.\nUse forceps to transfer the hippocampi tissue pieces to the C Tube.\nTransfer 30 µL of Enzyme mix 2 into the C Tube. Twist the cap until tension is felt, then tighten until it clicks.\nPlace the C Tube upside down into a position of the dissociator; the sample will be assigned the Selected status (Figure 2). Secure the heater over the C Tube.\nPress the folder icon, select Favorites folder, scroll to and select the 37C_ABDK_02 program. Click on OK to apply the program to all selected C tubes, then tap on Start (Figure 2).\nLabel one 50 mL conical tube per sample.\nPlace a 70 µm cell strainer on each 50 mL conical tube and wet with 2 mL of BSA buffer.\nUpon completion of the program, remove the heater and the C tube from the dissociator.\nAdd 4 mL of BSA buffer to the sample and apply the mixture to the cell strainer on the 50 mL conical tube.\nAdd 10 mL of D-PBS to the C Tube, close it, and swirl the solution gently. Apply it to the cell strainer on the 50 mL conical tube.\nDiscard the cell strainer and the C Tube. Centrifuge the suspension at 300 x g for 10 min at 4 °C. Then, aspirate and discard the supernatant.\n7. Debris removal\nResuspend the pellet with 1550 µL of cold D-PBS and transfer the suspension to a labeled 15 mL conical tube.\nAdd 450 µL of cold Debris Removal Solution and pipette up and down (do not vortex).\n\tNOTE: Debris Removal Solution is a reagent in the commercial Adult Brian Dissociation Kit17.",
    "Gently overlay 1 mL of cold D-PBS on top of the cell suspension, keeping the tip against the wall of the conical tube. Repeat until the total overlay is 2 mL.\n\tNOTE: This step is critical; perform with proficiency and dexterity.\nCentrifuge at 3000 x g for 10 min at 4 °C with full acceleration and full brake.\n\tNOTE: If the phases are not clearly separated, repeat steps 7.2-7.3. Centrifuge a final time at 1000 x g for 10 min at 4 °C.\nThe suspension should now consist of three distinct layers (Figure 3). Aspirate the topmost layer. Sweep the pipette tip back and forth to aspirate the white middle layer. Remove as much of the middle layer as possible without disturbing the bottommost layer.\n\tNOTE: This step is critical; perform with proficiency and dexterity.\nAdd 2 mL of cold D-PBS and pipette up and down to mix.\nCentrifuge at 1000 x g for 10 min at 4 °C with full acceleration and full brake. Aspirate and discard the supernatant. Resuspend the pellet in 1 mL of BSA buffer.\n\t​NOTE: Cells can be resuspended in the appropriate buffer then magnetically labeled and isolated in preparation for single-cell sequencing at this point.\n8. Cell count\nPerform cell counting as per the manufacturer's protocol of available cell counter (one option is noted in the Table of Materials)\n9. Live/dead stain\nCentrifuge the remaining 900 µL (from 7.7) at 1000 x g for 10 min at 4 °C with full acceleration and full brake.\nWhile the sample is spinning, label one flow tube per sample and wrap it in foil to limit light exposure.\nAspirate and discard the supernatant.\nResuspend the pellet in 50 µL of diluted live/dead stain (previously prepared).",
    "NOTE: This step should be performed in a low-light setting. Turn off overhead room lights to achieve this.\nTransfer each sample to the corresponding labeled flow tube and incubate at room temperature for 8-10 min in the dark (e.g., a drawer or box).\nAdd 500 µL of BSA buffer and centrifuge at 1000 x g for 10 min at 4 °C with full acceleration and full brake.\nAspirate and discard the supernatant.\n\t​NOTE: The pellet may not be visible; leave a small amount of buffer behind so as not to unintentionally aspirate the pellet. Cells can be resuspended in the appropriate buffer, blocked, and stained with cell-specific antibodies at this point. See Supplemental File 1 for sample protocol18.\n10. Fixation (optional)\nResuspend the pellet in 200 µL of 1% PFA (previously prepared). Incubate for 15 min at 4 °C.\nWash by adding 500 µL of D-PBS and centrifuge at 300 x g for 10 min at 4 °C.\nAspirate the supernatant.\n\tNOTE: The pellet may not be visible; leave a small amount of buffer behind so as not to unintentionally aspirate the pellet.\nResuspend the pellet in 200 µL of D-PBS and store at 4 °C for up to 3 days.\n11. Flow cytometry\nLabel the filter caps on the new tubes.\nUsing a 1 mL pipette, pipette each sample onto the filter cap.\nCentrifuge briefly at 200 x g at 4 °C, only allowing the centrifuge to reach 200 x g before stopping the run.\nProceed to flow cytometry core for downstream analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}