{
  "id": 5128,
  "origin_website": "Bio",
  "title": "Adoptive Transfer of Tumor Expanded Regulatory T Cells (Tregs)",
  "procedures": [
    "Induction of regulatory T cells4T1 or E0771 cells were grown in RPM media, supplemented with 10% FCS and 1% Pen-Strep. Inject subcutaneously 1-5 x 104 4T1 or 0.5-1 x 106 E0771 cells resuspended in PBS (90% or greater viability) into either Balb/c or C57BL6 mice, respectively (an average of 3-5 mice are needed to obtain around 1-5 x 106 Tregs, if more Tregs are needed inject more mice).Sample preparation for Treg purificationAfter 12-16 days, euthanize the mice by cervical dislocation (AVMA Guidelines for the Euthanasia of Animals: 2013 Edition) and remove lymph nodes (inguinal and axillary) (Mathieu et al., 2012) and/or spleens. Prepare single-cell suspension by mechanical disruption of the tumor (make sure to work with single cell suspension, by passing through a 70 μm cell strainer). Optional: If red blood cells are present, lyse with ACK buffer, although it is not necessary as the kit contains anti Ter-119 antibody to positively deplete red blood cells.Note: Work fast, keep cells cold and use pre-cooled solutions. This will prevent capping of antibodies on the cell surface and will reduce non-specific cell labeling.Magnetic labeling of non-CD4+ cells and fluorescent labeling of CD25+ cellsWe follow exactly the protocol provided by the manufacturer to purify CD4+CD25+ Regulatory T cells. Volumes for magnetic labeling given below are for starting cell number of 107 leukocytes. When working with fewer than 107 leukocytes use the same volumes as indicated. When working with higher cell numbers, scale up all reagent volumes and total volumes accordingly.Determine the number of leukocytes.Centrifuge cells at 300 x g for 10 min at room temperature (RT). Aspirate supernatant completely.Resuspend cell pellet in 40 μl of MACS buffer per 107 total cells.Add 10 μl of Biotin-Antibody cocktail per 107 total cells (this cocktail contains anti-mouse antibodies against: CD8a, CD11b, CD45R, CD49b and Ter-119).",
    "Mix well by pipetting up and down, and refrigerate for 10 min (4-8 °C).Add 30 μl of MACS buffer, 20 μl of anti-biotin Microbeads and 10 μl of CD25-PE antibody per 107 total cells.Mix well and refrigerate for an additional 15 min in the dark (4-8 °C).Wash cells by adding 1-2 ml of buffer per 107 total cells and centrifuge at 300 x g for 10 min RT. Aspirate supernatant completely.Resuspend cell pellet in 500 μl of MACS buffer (up to 1.25 x 108 cells can be suspended in this volume according to the manufacturer).Proceed to magnetic separation.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160810/20160810235510_2971.jpgFigure 1. MACS midi system for cell purificationDepletion with LD columnPlace LD column in the magnetic field of a midi MACS separator (Figure 1).Prepare column by rinsing with 2 ml of MACS buffer.Apply cell suspension to the column.Collect unlabeled cells which pass through and wash column 2 times by pipetting 1 ml of MACS buffer. Perform washing steps by adding MACS buffer successively once the column reservoir is empty. Collect total effluent. This is the unlabeled CD4+ T cell fraction.Proceed for the enrichment of CD4+CD25+ T cells.Magnetic labeling of CD25+ cellsVolumes for magnetic labeling given below are for up to 107 initial starting cell number. For larger initial cell numbers, scale up accordingly.Centrifuge isolated CD4+ T cells at 300 x g for 10 min. Aspirate supernatant completely.Resuspend cell pellet in 90 μl of MACS buffer.Add 10 μl of anti-PE Microbeads.Mix well and refrigerate for 15 min in the dark (4-8 °C).Wash cells by adding 1-2 ml of MACS buffer and centrifuge at 300 x g for 10 min. Aspirate supernatant completely.Resuspend up to 108 cells in 500 μl of MACS buffer.Proceed to magnetic separation.",
    "Magnetic separation: Positive selection of CD4+CD25+ regulatory T cellsPlace MS column in the magnetic field of a suitable MACS separator.Prepare column by rinsing with 500 μl of MACS buffer.Apply cell suspension onto the column.Let cells pass through and wash column 3 times with 500 μl of MACS buffer. Perform washing steps by adding MACS buffer three times, once the column reservoir is empty.Remove column from the separator and place it on a suitable collection tube.Pipette 1 ml of MACS buffer on to the column. Immediately flush out the magnetically labeled cells (CD4+CD25+) by firmly pushing the plunger into the column.Optional: To achieve highest purities, repeat magnetic separation with a consecutive column run.Co-injection of Tregs with 4T1 or E0771 tumor cellsDetermine the cell number of Tregs and tumor cells needed for injection.Inject approximately 100-200 μl of PBS containing a mixture purified Tregs with tumor cells subcutaneously close to the mammary fat pad. Follow tumor growth by caliper measurements."
  ],
  "subjectAreas": [
    "Immunology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}