{
  "id": 19194,
  "origin_website": "Jove",
  "title": "Probing the Brain in Autism Using fMRI and Diffusion Tensor Imaging",
  "procedures": [
    "1. Special Techniques for Scanning Individuals with Developmental Disabilities:\nWhile neuroimaging itself is a complex technique, using MRI to scan the pediatric population and people with developmental disorders can be extremely challenging.The main problems are: 1) Head motion: people with disorders, especially children, may find it difficult to keep still in the fMRI scanner throughout a scanning session. This might result in head motion which in turn may affect the quality of the data; 2) Children with autism have extreme sensory sensitivities and may be bothered by factors, such as scanner noise, being in closed space, temperature and so on; and 3) Anxiety and getting adjusted to a new environment can be difficult for people with autism. A change in their routine can pose problems if not prepared well. Therefore, innovative procedures with careful preparations are needed to achieve good yield, and to improve the quality of the data collected. We incorporate valuable insights gained from theory and practice to prepare a participant for an MRI scan, to make the experiment and scanning process enjoyable for the participant, and to process the collected data, some of which are:\nSocial Stories.  Social stories are short, direct stories often used for explaining novel and confusing situations to children with autism8. We use social stories, written from the perspective of the individual with autism, to illustrate and verbally describe each step of our study process. At each item in the story, both verbal and pictorial descriptionsare provided. Titled \"about my MRI session\", we provide the story to the participant ahead of their scan day so that they can become familiar with the scanning process. The goal of the story is to increase the individual's understanding of the procedure, and to make him/her more comfortable in a new situation.",
    "CD Recording of Scanner Sounds. During a scanning session, the MRI scanner produces loud noises constantly and this may be aversive to some individuals with autism. In order to acclimatize the participantsto the scanner noise, we send the participants (prior to the scan day) a recording of the sounds made by the scanner.\nMock MRI Scanner. We simulate an MRI scanning session with the participant using a mock scanner, constructed out of a discarded Phillips MRI scanner. This provides a realistic approximation of the actual scanning session. Use of this mock scanner, located at the Department of Optometry, UAB, allows the participant to become accustomed to the scanner environment.\nTour of the MRI Scanner Prior to Scanning. Prior to beginning the MRI scan, the participant is provided with an opportunity to see the scanner and even get on the scanner bed briefly. Usually, this helps to alleviate fear and anxiety, as well as provide the researchers with behavioral information regarding the participant's reaction to the scanner.  Such reactions often provide valuable, though intuitive and qualitative, information of whether the participant may likely complete the whole scan.Before the participant goes into the scanner, he/she leaves all his belongings in a locker room and is also checked for metal using a metal detector.",
    "Making the MRI Scanner child-friendly. For all our scans, we use the Siemens 3.0 Tesla Allegra MRI Scanner located at the UAB Civitan International Research Center. This is a head-only scanner making it less intimidating for participants. In order to make the scanner environment as child-friendly as possible (for the pediatric population), the scanner may be decorated with easily removable stickers of animals, cartoon characters, etc. In addition, we provide colorful blankets to the participants to keep them warm in the scanner. For children with autism who often have special interests (e.g., trains), such interests may be taken into account while decorating the scanner.\nUse of Movies or Cartoons: The anatomical and DTI image acquisition do not require the participant to perform a task in the scanner. During these scans, participants are given the option of watching a few minutes of their favorite movie or cartoon series. In addition to providing a welcome break from the tasks, this helps make the scanning process more enjoyable for the participant.\n2. Use of Stimulus Presentation Software and Button Response Devices to Communicate with the Scanner:\nThe experimental tasks are programmed using E-Prime (Psychology Software Tools, Pittsburgh, PA) stimulus presentation software. Before the scanning session, the participant practices shorter versions of the tasks on a laptop computer so that they are familiar with what they will see in the scanner and what buttons they will be required to press.\nThe tasks are loaded onto the Integrated Functional Imaging System (IFIS, Invivo Corporation, Orlando, FL), and are synchronized with the scanning paradigm. The IFIS system helps project the visual stimuli onto a screen behind the participant while in the scanner, which the participant views through a mirror attached to the head coil.",
    "Dual monitors in the control room allow the researchers to select the experimental tasks or movies presented during the scan, and monitor participant responses (including response time and performance accuracy).\nThe participants wear MRI compatible headphones that allow them to hear audio, listen to the researchers' instructions, as well as reduce the obtrusive noise of the scanner.  In addition to the headphones, earplugs are provided to further reduce the noise of the scanner.\nA fiber optic button response device attached to each hand allows the participant to respond to task questions. The IFIS system records these responses, as well as the timing of each response in conjunction with the scan timing.\nAn emergency \"squeeze ball\" is given to the participant in case he/she does not want to continue the scan. Pressing this ball will set off an alarm in the control room prompting the researchers to get to the participant immediately. \n3. Use of Static and Dynamic Visual Stimuli to Elicit Brain Responses in Participants with Autism:\nWhile an excellent experimental design is critical to any scientific study, striking a chord with the participants can have a significant impact on the data acquired, especially in neuroimaging. The stimuli should be at the level of comprehension of the participant, and the experiment should be short, precise, and enjoyable. If adequate attention is not given to these elements, the quality of the data can be negatively affected. Special care is taken to try to make the experimental tasks challenging and enjoyable by creating innovative stimuli.",
    "Dynamic visual stimuli, such as videos depicting social interaction are used to elicit participant responses on mental state attribution. In addition to being short and enjoyable, these stimuli are slices of the real social world and provide an appropriate arena for investigating the brain responses associated with social cognition.\nStatic visual stimuli, such as stick figure characters displaying different body postures are also used to study social cognition. These stimuli are helpful in studying emotions by encouraging the participants to infer feelings from body language.\nStatic visual stimuli like comic strip vignettes that involve multiple characters depicting social situations are also used. These stimuli involve attributions based on folk physics and folk psychology.\nFor studies examining language processing, we mainly use tasks that involve sentence comprehension, lexical decision-making, and discourse processing.\nAlthough the length of each experiment differs from another, we try to keep every experiment less than 10 minutes. In addition, we also try to sandwich our DTI scan and Anatomical scans in between experiments to give the participant some free/resting time. We found reasonable success with this strategy. In one scanning session, we try to include 2-3 tasks taking the total time spent in the magnet to about 30-40 minutes.      See Figure 1 for a flow-chart depicting the study protocol.\n4. Data Acquisition, Storage, Analysis, & Quality Control:  \nData Acquisition:\nFunctional MRI and DTI data are collected in a single session per participant using a Siemens 3.0 Tesla Allegra head-only Scanner (Siemens Medical Inc., Erlangen, Germany) housed in the Civitan International Research Center, University of Alabama at Birmingham.",
    "The scanning session starts with high resolution T1-weighted scans for structural imaging. These are acquired using a 160-slice 3D MPRAGE (Magnetization Prepared Rapid Gradient Echo) volume scan with TR (Repetition Time) = 200 ms, TE (Echo Time) = 3.34 ms, flip angle = 12 degree, FOV (Field of View) = 25.6 cm, 256 X 256 matrix size, and 1 mm slice thickness. This acquisition lasts approximately 8 minutes and the data acquired provide anatomical information about each participant's brain.\nThe anatomical scans are followed by functional scans. To acquire functional images, we use a single-shot gradient-recalled echo-planar pulse sequence with TR= 1000 ms, TE = 30ms, flip angle = 60 degrees, FOV = 24 cm, and matrix =64 x 64. We acquire seventeen adjacent oblique axial slices in an interleaved sequence with 5 mm slice thickness, 1 mm slice gap, a 24 cm FOV, and a 64 X 64 matrix, resulting in an in-plane resolution of 3.75 X 3.75 X 5 mm.\nDepending on the length of a functional MRI experiment, two or three experiments are included in a 60-75 minutes scanning session.\nThe DTI images are acquired using a single-shot, spin-echo, EPI (Echoplanar Imaging) sequence with 46 orthogonal directions.  A diffusion weighted, single-shot, spin-echo, echo-planar imaging sequence is used with TR = 7000 ms, TE = 90 ms, bandwidth = 2790 Hz/voxel, FOV = 220mm, and matrix size = 128x 128. Twenty-seven 3-mm thick slices are imaged (no slice gap) with no diffusion-weighting (b = 0s/mm2) and with diffusion-weighting (b = 1000s/mm2) gradients applied in 46 orthogonal directions.\nData Storage and Data Analysis: \nThe acquired neuroimaging data from an MRI session are transferred to a pass wall protected computer network at the University Hospital in line with the Health Insurance Portability and Accountability Act (HIPAA).",
    "The MRI and DTI data from this server are transferred to the lab's centralized computer server (neuron), and anonymized before it is made available for data analyses. The neuron server houses all the image analysis programs, as well as the in-house scripts generated to do the computations specific to our experiments.\nThe computer cluster employs 3 nodes, each with a quad-core processor, enabling faster and parallel processing of multiple datasets. In addition, since the data from different studies reside at a common location, it makes it easier to organize the data for meta-analyses and to make overarching inferences.\nThe fMRI data are pre- and post-processed, and statistically analyzed using SPM8 (Statistical Parametric Mapping; Wellcome Department of Cognitive Neurology, London, UK). In addition, other software programs, such as Analysis of Functional NeuroImages (AFNI), fMRIB Software Library (FSL), and MRICron are also used for other analyses.\nThe DTI images are pre- and post-processed, and statistically analyzed using FSL.\nQuality Control:\nTemporal and spatial adjustments are done to the fMRI data using preprocessing steps, such as slice timing correction, motion correction, realignment, spatial normalization, and spatial smoothing.\nSignal to noise ratio (SNR) is calculated by taking the ratio between the task-related variability and the non-task related variability. Noise (non-task related variability) can include anything from thermal noise to head motion effects. By both calculating the SNR to gain a relatively higher ratio (> .8) and by controlling for artifacts, we can make sure that the images meet strict quality standards.",
    "Temporal signal to noise ratio (tSNR) is the SNR over the entire course of the experiment and is mathematically defined by the ratio of mean signal intensity to the variation of the signal over time. The mean and standard deviation are taken at each voxel and if the ratio within the brain is at an acceptable threshold, the images can be used for further analyses.\nIt is always a good idea to examine the data for artifacts at every preprocessing and analysis step. For example, examining the raw images for Radio Frequency(RF) artifacts or assessing motion artifacts in the preprocessed data. One preventative measure for controlling for artifacts is to screen subjects for metal in or around the head, such as braces or a permanent retainer, to limit the amount of signal drop out.\nIf a dataset has too much noise, even after motion correction procedures, and does not meet our data quality standards, that dataset is usually excluded from further analyses.\n5. Examining the Brain in Autism at a Network Level: fMRI-based Investigation of Functional Connectivity and DTI-based Examination of Anatomical Connectivity:\nFunctional Connectivity:\nFunctional connectivity refers to the synchronization of brain activation across different regions in the brain. The correlation of the time course of activation across brain areas is taken as evidence of the communication or connectivity between those regions. The steps involved in this analysis are as follows:\nRegions of interest (ROIs) are identified, either functionally (based on activation response to tasks) or anatomically (based on standardized brain atlases). These ROIs are defined either spherically with a radius that would encompass the activation OR they are defined in their original shape.",
    "The specified radius or actual shape, along with the MNI coordinates, is incorporated to create an ROI file for all ROIs using an in-house script.The presence of overlap among the locations of these ROIs is investigated and corrected. \nFor each ROI, the signal is extracted from the time course of the experiment from each individual participant's data.\nFor each participant, the average signal time course for each ROI is correlated with all other ROIs resulting in a correlation matrix. The correlation values are then converted to Fisher's z' scores for further statistical analyses to make individual, group, and between group level inferences.\nAnatomical Connectivity (DTI):\nIn order to examine the white matter integrity across the brain, the diffusion tensor images are analyzed using fMRIB Software Library (FSL)9. Below are the main steps involved: \nThe first step in this analysis involves preprocessing, including skull stripping and eddy current correction. Skull stripping is done using Brain Extraction Tool (BET) to remove any non-parenchymal tissue. When high intensity diffusion gradients are rapidly switched, shear and stretch artifacts are produced which are different for each gradient direction. These distortions are corrected using FSL's eddy current correction which registers the diffusion images to a reference image with no applied diffusion gradient.\nDiffusion tensors and fractional anisotropy (FA) values, an index of water diffusion along axons, are then calculated at the voxel level by using FSL's Diffusion Toolbox.\nGroup differences on a voxel-by-voxel level are examined using Tract-Based Spatial Statistics (TBSS)10. In this technique, all diffusion images are first aligned into a common space using nonlinear registration.\nA FA skeleton of all the major white matter tracts from all participants is created. Individual diffusion images of all participants are then registered to this FA tract skeleton.",
    "Areas along this skeleton from the images of participants with autism are compared voxel-by-voxel to the same areas from the control participants using t-tests. Voxels with varying FA values are then isolated as a large ROI and the mean FA values calculated.\n6. Representative Results:\nThe primary results emerging from our studies pertain to weakened neural response in participants with autism (in terms of activation, change in signal intensity, and in functional connectivity) and the possible use of altered cortical route in accomplishing cognitive and social tasks. For instance, the core regions found to be mediating a function (for e.g. posterior superior temporal sulcus at the temporoparietal junction in inferring intentions of others; see Figure 2) seem to under-respond in autism, relative to typical control participants. In addition, the core region seems underconnected functionally with other nodes, especially the spatially distant ones (figure 3). With DTI, we also find some anatomical basis to these findings (see Figure 4), providing a comprehensive, network-level picture of brain organization in autism. \nimgsrc://cloudfront.jove.com/files/ftp_upload/3178/3178fig1.jpgFigure 1. Flow-chart depicting the methods and procedures.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3178/3178fig2.jpgFigure 2: A) Increased activation in a typical language task, such as sentence comprehension (left inferior frontal gyrus, and left posterior superior temporal sulcus); B) Increased bilateral posterior superior temporal sulci activation in neurotypical participants during attribution of mental states to others (FWE corrected threshold of p< 0.05).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3178/3178fig3.jpgFigure 3. Significantly reduced functional connectivity (synchronization of brain activation) between frontal and temporal regions in a social cognition task in participants with autism (p< 0.05). LSTG: left superior temporal gyrus, RSTG: right superior temporal gyrus, RIFG: right inferior frontal gyrus, ROI: Region of Interest, FCA: functional connectivity.",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/3178/3178fig4.jpgFigure 4. DTI Tractography results showing a white matter fiber bundle proceeding from the temporal lobe to the temporoparietal junction. The initial starting point for tractography was an ROI identified by TBSS as having a significantly smaller FA value in young adults with autism when compared to age matched typical control participants.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}