{
  "id": 18119,
  "origin_website": "Jove",
  "title": "Re-Arterialized Rat Partial Liver Transplantation with an in vivo Vessel-Oriented 70% Hepatectomy",
  "procedures": [
    "All of the procedures followed the guidelines of rodent surgery approved by the Wenzhou Medical University Animal Policy and Welfare Committee 15.\n1. Animals\nUse male Lewis rats weighing 250-350 g as donors and recipients.\n2. Operative Environment\nPerform all microsurgical procedures under a surgical microscope with a magnification ranging from 7X to 20X. Sterilize all surgical instruments before use in operation.\n\tNOTE: The operating room and operating table are clean but not sterile.\n3. Basic Microsurgical Maneuvers\nFree, dissect, and mobilize the vessel.\n\t\nFirst, use straight micro-forceps to lift the surrounding tissue on the vessel.\nSecond, repeatedly and gently open and close the tips of the curved micro-forceps such that the fine tips can cut open and peel the surrounding tissue on the anterior wall of the vessel.\nThird, use straight micro-forceps to clamp and lift the vessel to expose the posterior space. Then, use the tips of the curved micro-forceps to peel the surrounding tissue on the posterior wall of the vessel. Finally, a bald vessel without any surrounding tissue connected should be presented.\nDivide or double ligate and divide a vessel or tissue.\n\t\nFirst, tie two square knots on the vessel or tissue using two micro-forceps16. Second, cut off the vessel or tissue between the two square knots using micro-scissors.\n4. Preparation of the Cuff and Biliary Stent\nMake the cuffs of the portal vein and infrahepatic vena cava using 12-gauge and 14-gauge intravenous catheters, respectively, while the biliary stent used is a 22-gauge intravenous catheter. The cuffs consist of a body part and handle part. Use a fillister on the body part to secure the vessel wall onto the cuff (Figure 1).\n5. Anesthesia and Fixation of the Rats",
    "Gently place the Lewis rat in an induction box with 5% isoflurane mixed with 0.5 L/min oxygen to induce inhalation anesthesia. Monitor the respiratory frequency of the rat to prevent unexpected death caused by an overdose of isoflurane. Reduce the concentration of isoflurane to 2% to maintain anesthesia when the rat does not respond to pain stimulation.\nMove the rat to a 30 cm x 30 cm oak plank covered by a sterilized surgical mat towel, and place the rat in a supine position. Tie the four limbs of the rat using medial tape, and subsequently fix the tape with four thumbtacks. Disinfect the skin using 70% alcohol one time and iodophors three times.\n6. Donor Operation\nExposing the operative field\n\t\nCut a small transverse incision on the upper abdomen to transect the bilateral inferior epigastric vessels using an electric coagulator.\nExtend the transverse incision close to the costal margin on the upper abdomen using surgical scissors.\nReverse and fix the upper abdomen wall and xiphoid process, respectively, to the cranial side.\nMove the intestine out of the abdominal cavity with two wet cotton sticks. Cover the intestine using a wet piece of gauze.\nCutting off the ligaments and trimming the suprahepatic vena cava (SHVC)\n\t\nCut off the falciformal ligament, coronary ligament and triangular ligament in sequence.\nFree the left diaphragmatic vein from the diaphragm using micro-forceps. Then, double ligate it using 6-0 silk sutures.\n\t\tNOTE: Do not divide this vein in this step.\nCut off the gastrohepatic ligament using micro-scissors to free the inferior caudate lobe and the hepatoesophageal ligament and artery.\nOccluding the blood supply of the LLL and ML before resection (Figure 2)",
    "First, use curved forceps to carefully dissect the posterior wall of the common trunk of the PV that supplies the LLL and left median lobe (LML) from the parenchyma. Second, double ligate and divide it with the corresponding bile duct and hepatic artery together.\nDissect and divide the PV of the RML gently because this vein adheres closely to the liver parenchyma.\n\t\tNOTE: 14X magnification is recommended. Do not injure the PV of the right superior lobe, which is close to the PV of the RML.\nIdentify the hepatic artery and bile duct of the RML located between the PVs of the RML and LML. Double ligate and divide the hepatic artery and bile duct of the RML using 6-0 silk sutures.\n\t\tNOTE: A change in the color of the LLL and ML from red to dark red is an indicator of successful occlusion of the blood supply. Thorough knowledge of the vascular anatomy is essential to identifying and dissecting the corresponding vessels. A previous study in rat clearly illustrated the hepatic anatomy by corrosion casts10.\nResecting the LLL\n\t\nLigate the pedicle of the LLL using a circumferential 3-0 silk suture to occlude the blood flow of the left lateral hepatic vein. Using micro-scissors, cut the liver immediately above the ligation to remove the liver mass.\nResecting the LML\n\t\nClamp the left median hepatic vein by mosquito hemostatic forceps placed along the median fissure (Figure 3A). Remove all of the liver parenchyma of the LML immediately above the forceps using micro-scissors.\nPlace a piercing suture that penetrates the liver parenchyma immediately under the forceps surrounding the left median hepatic vein. Then, tie a square knot to ligate it before releasing the forceps.",
    "Place another two piercing sutures under the forceps to surround the rest of the open incision of the LML. Then, tie two square knots to close the rest of the incision. Release the mosquito hemostatic forceps to check for bleeding.\nResecting RML (Figure 4)\n\t\nPlace mosquito hemostatic forceps to surround the base of the RML at a distance of 0.5 cm to the SHVC (Figure 4B). Then, cross-clamp the base using the mosquito hemostatic forceps to occlude the right median hepatic vein.\nUsing micro-scissors, remove all of the liver parenchyma of the RML along the upper surface of the forceps. Be sure to work very close to the surface of the forceps, leaving a plain and thin stump of the ML.\nPlace the first piercing suture penetrating the liver parenchyma under the forceps to surround the middle median hepatic vein. Then, tie a square knot to ligate the middle median hepatic vein. Place the second piercing suture to ligate the right median hepatic vein using the same method. Place another two piercing sutures close to the rest of the incision following the description in 6.5.2.\nTrimming the infrahepatic vena cava (IHVC)\n\t\nCut open the retroperitoneum to expose the IHVC. Use curved micro-forceps to free the IHVC and right renal vein from the surrounding tissue. Dissect and ligate the right adrenal vein, which drains into the IHVC from the rear.\nPerform a right nephrectomy after ligating the right renal vein and right renal artery to save enough vascular length to install the cuff onto the IHVC in a later step.\nInstalling the biliary stent\n\t\nMobilize the common bile duct (CBD) from the first hepatic hilum using micro-forceps. Ligate the CBD at the cross-point of the pyloric vein and CBD using a 6-0 silk suture.",
    "Cut a transverse incision on the anterior wall of the CBD on the proximal side of the ligation. Insert a biliary stent, made of a 22-gauge intravenous catheter, into the lumen of the CBD via the incision. Secure the biliary stent with a circumferential 6-0 silk suture. Transect the CBD between the two 6-0 silk sutures.\nTrimming the PV\n\t\nLigate the pyloric vein using a 6-0 silk suture distal to the PV. Next, ligate the pyloric vein using a 7-0 polypropylene suture close to the PV. Transect the pyloric vein between these two ligations. Double ligate and divide the splenic vein in the same way.\n\t\tNOTE: Use a 7-0 polypropylene suture to ligate the vessel to make a smaller ligation knot compared with that of the 6-0 silk suture. A large knot may interfere with the cuff installation in the last step. The vascular wall of the pyloric vein and splenic vein is thin, so gentle manipulations are essential during the dissection. A previously published article with more technical descriptions and illustrations about dissecting and dividing the pyloric vein and splenic vein should be read before operation17.\nTrimming the common hepatic artery (CHA)\n\t\nCarefully free the CHA and its two bifurcations, the PHA and the gastroduodenal artery (GDA), from the surrounding tissue using two micro-forceps. Double ligate the GDA using 6-0 silk sutures at the bifurcation of the CHA to GDA.\nHeparinizing and perfusing the liver graft\n\t\nInject 50 IU of heparin in 1 mL of saline via the penile vein. Wait for 5 min to achieve systemic heparinization.",
    "Cross-clamp the PV, IHVC and CHA using three curved micro-serrefines to occlude hepatic blood flow. Perform a small incision on the anterior wall of the PV to insert a 22-gauge catheter. Perfuse the partial liver graft with saline at 4 °C via the catheter under a pressure of 20 cmH2O.\nRapidly cut open the thoracic cavity and intrathoracic vena cava using surgical scissors to drain out the blood and perfusate. Do not stop the perfusion until the color of the entire partial liver graft becomes uniformly yellow.\nExplanting the partial liver graft\n\t\nTransect the left diaphragmatic vein between the two ligations (described in 6.2.2) using micro-scissors.\nNext, transect the SHVC close to the diaphragm to keep the vascular length as long as possible. Transect the PV at the level of the splenic vein using micro-scissors. Divide the GDA between the double ligations, and transect the CHA close to the celiac trunk.\nTransect the adrenal vessels on the distal side of the 6-0 silk ligation placed in 6.7.2. Transect the IHVC at the level of the left renal vein using surgical scissors.\nExcise and transfer the partial liver to a back-table dish (30 mm culture dish) filled with saline at 4 °C.\n7. Back-Table Operation (Graft Preparation)\nInstalling the vascular cuffs (Figure 5)\n\t\nPull the PV through the lumen of a cuff made with a 12-gauge intravenous catheter using micro-forceps. Temporarily fix the cuff handle and PV together using a vessel clamp. Evert the PV vessel wall to cover the outside surface of the cuff. Secure the vessel wall and cuff in position with a circumferential 6-0 silk suture.\n\t\tNOTE: Do not twist the vessel. The cuff handle should be kept in the 12 o'clock direction.\nInstall the IHVC cuff following the descriptions in 7.1.1.",
    "Presetting the two stay sutures onto the SHVC\n\t\nPenetrate the vessel wall of the SHVC from outside to inside using two 7-0 polypropylene sutures along the 3 o'clock and 9 o'clock directions, respectively.\n\t\tNOTE: Do not tie a knot.\nPreserving the graft\n\t\nImmerse the partial liver graft in saline at 4 °C for preservation after the back-table operation.\n8. Recipient Operation\nRepeat the procedures in 6.1-6.2 and 6.7, except for the right nephrectomy, in the recipient to expose the operative field, transect the ligaments and trim the vessels.\nPreparing the IHVC, bile duct, hepatic artery and portal vein in the recipient\n\t\nFirst, mobilize the section of the IHVC down to the right renal vein. Second, ligate the right adrenal vessels using a 6-0 silk suture. Third, mobilize the CBD from the first hepatic hilum using micro-forceps.\n\t\tNOTE: Do not trim off the fatty tissue around the CBD.\nTransect the CBD at the first bifurcation in the hepatic hilum after double ligation using a 6-0 silk suture. Then, transect the PHA using micro-scissors subsequent to the double ligation using a 6-0 silk suture. Mobilize the section of the PV from the hepatic hilum to the pyloric vein.\nMobilizing the rear of the liver\n\t\nRetract the recipient liver to the left side using two cotton sticks. Then, cut off the ligament in the rear of the liver from the SHVC to the right adrenal vein as described in a previous visualized article18. After this, introduce a rubber band through the back space of the SHVC.\nPreparing the instruments and materials during the anhepatic phase",
    "Recheck the availability of all of the instruments and materials required in the anhepatic phase, such as a 5 mL syringe with a curved needle, micro-scissors, micro-needle holder, micro-forceps, two micro-hemostatic forceps, two 7-0 polypropylene sutures and 6-0 silk suture material.\n\t\tNOTE: Searching for materials or instruments may prolong the anhepatic phase.\nExcising the liver in the recipient\n\t\nCross-clamp the IHVC immediately above the renal vein using a vessel clamp and the PV immediately above the pyloric vein. Record the duration of the anhepatic phase from this moment until the clamp on the PV is released.\nReduce the concentration of isoflurane to 0.5% immediately.\nPull the SHVC and diaphragm down by the preset rubber band. Clamp the parts of the diaphragm together with the intrathoracic vena cava using a Bulldog clamp, maintaining a distance of 0.5 cm to the SHVC.\n\t\tNOTE: Do not clamp the lung of the rat.\nUsing micro-scissors, cut the vessel wall of the SHVC carefully along the upper edge of the liver parenchyma to keep the vascular wall as long as possible.\nTransect the PV at the first bifurcation in the hepatic hilum using micro-scissors. Then, transect the inferior vena cava in the parenchyma of the right inferior lobe, rather than in the vessel wall, leaving the circumferential liver parenchyma around the vena cava. Keep the cutting edge in the right inferior lobe at a distance of 4 mm to the IHVC. After transecting the vessels, move the whole liver out of the abdominal cavity.\nReconstructing the SHVC",
    "Place the partial liver graft in the abdominal cavity orthotopically. Pierce the vessel wall of the SHVC from inside to outside along the 3 o'clock and 9 o'clock directions using two preset stay sutures. Pull the two stay sutures to the right and left after they are tied into a knot with their own ends.\nPierce the SHVC vessel wall from outside to inside close to the knot in the 3 o'clock direction to introduce the needle of the right stay suture into the vascular lumen.\nAnastomose the posterior wall of the SHVC by a running suture inside the vascular lumen from the 3 o'clock direction to the 9 o'clock direction.\nAt the corner of the 9 o'clock direction, pierce the vessel wall from inside to outside close to the knot to introduce the needle out of the vascular lumen.\nUse this suture to anastomose the anterior wall using a running suture outside of the vascular lumen from the 9 o'clock direction to 3 the o'clock direction. Finally, tie the suture with its own end 3 times (Figure 6).\n\t\tNOTE: Inject 3-5 mL of saline into the lumen of the reconstructed SHVC to force out air bubbles before the last 2-3 stitches. A more detailed description of SHVC anastomosis can be found in the article by Delriviere et al.19.\nReconstructing the PV\n\t\nPlace two 7-0 polypropylene stay sutures at the end of the PV of the recipient following the description in 7.2. Pull two stay sutures in the opposite direction to extend the vessel wall. Fix two stay sutures using two micro-mosquito hemostatic forceps.",
    "Inject approximately 1 mL of saline into the vascular lumen of the PV in the recipient to force out air bubbles. Quickly insert the portal vein cuff into the vascular lumen of the PV in the recipient to force when it is opened using micro-forceps. Secure the cuff anastomosis using a circumferential 6-0 silk suture. Cross-clamp the CHA.\nReperfusion to liver graft\n\t\nRelease the clamps on the SHVC and PV in sequence to reperfuse the liver graft. Record the time of the anhepatic phase. Check for bleeding of the anastomosis. Increase the concentration of isoflurane to 1-2% according to the reaction of the rat to the pain stimulation.\nReconstructing the IHVC\n\t\nInject 1 mL of saline into the vascular lumen of the IHVC in the recipient to force out the air bubbles. Insert the cuff into the cylindrical vascular lumen of the IHVC, which is supported by the circumferential liver parenchyma (Figure 7). Introduce a 6-0 silk suture through the back space of the IHVC. Quickly secure the cuff anastomosis using a 6-0 silk suture.\nRelease the two vessel clamps in the IHVC to restart the perfusion. Trim off the surrounding liver parenchyma carefully above the circumferential silk suture using micro-scissors.\nReconstructing the hepatic artery\n\t\nPenetrate the vessel wall of the CHA in the liver graft from outside to inside using two 11-0 polypropylene sutures in the 3 o'clock and 9 o'clock directions, respectively. Occlude the blood flow of the CHA and GDA in the recipient using two curved micro-serrefines.\nTransect the PHA of the recipient at its root to expose the vascular lumen using micro-scissors. Enlarge the vascular lumen of the PHA in the recipient by cutting part of the vessel wall longitudinally to accommodate the diameter of the CHA in the liver graft.",
    "Anastomose the CHA of the liver graft to the enlarged PHA in an end-to-side manner using the running suture technique described for the SHVC anastomosis (8.6.2-8.6.7).\n\t\tNote: Detailed illustrations can be found in the article by Huang et al14.\nReconstructing the CBD\n\t\nMove the intestine back into the abdominal cavity to reduce the distance between the two ends of the bile duct. Perform a transverse incision on the anterior wall of the bile duct in the recipient.\nPull the biliary stent in the partial liver graft down to insert it into the lumen of the bile duct in the recipient via the transverse incision. Secure the stent using a 6-0 circumferential silk suture.\nTie the two 6-0 circumferential silk sutures in the bile duct to each other to reduce the tension of the anastomosis.\nClosing the abdomen\n\t\nClose the abdomen in two layers using 3-0 silk suture in the running suture pattern.\n9. Postoperative Treatments (Analgesia and Antibiotics)\nTreat all recipients with 0.1 mg/kg buprenorphine subcutaneously. Administer cefuroxime (16 mg/kg) subcutaneously in addition to the analgesic drug. Offer tap water and standard laboratory animal chow to the rats ad libitum.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}