{
  "id": 1769,
  "origin_website": "Cell",
  "title": "A protocol for macrophage depletion and reconstitution in a mouse model of sepsis",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation of L929 conditioned medium\nTiming: 7 days\nL929 is a mouse fibroblast line that secretes macrophage colony stimulating factor (M-CSF), which is required for the differentiation of BMDMs from hematopoietic stem cells. Thus, L929 cell conditioned media are used to differentiate BMDMs (see BMDM differentiation[href=https://www.wicell.org#sec2.4] step).\nCulture L929 cells in complete DMEM (Table 1[href=https://www.wicell.org#tbl1]) in 10-cm cell culture dishes at 37°C and 5% CO2. At about 80% confluency, replace the culture medium with fresh complete DMEM.\ntable:files/protocols_protocol_1221_1.csv\nStore at 4°C for up to 1 month\nNote: If cells are seeded at 20% confluency initially, it usually takes 3 days to reach 80% confluency.\nThree days after complete confluency, harvest the medium and then filtrate the medium through a 0.22 μm filter. The conditioned media can be aliquoted and stored at −80°C.\nNote: Some cell death may occur at this time, but dead cells do not affect the quality of the conditioned medium. All cells and cell debris will be removed through filtration. The conditioned medium is yellowish at this time.\nThe concentration of M-CSF in the conditioned medium is critical for the successful differentiation of BMDMs in the following steps. Therefore, it is recommended that the quality of each batch of conditioned media to support BMDM differentiation[href=https://www.wicell.org#sec2.4] be tested by pilot experiments.\nThe L929 conditioned medium can be substituted with recombinant M-CSF.\nBone marrow isolation\nTiming: 6 h\nSacrifice the mouse using a CO2 chamber followed by cervical dislocation.\nImmediately spray the mouse with 70% EtOH before dissection.\nUse surgical scissors and forceps and dissect out the whole leg, from hip to ankle, and immediately soak the leg in 70% EtOH for 5 min in a 10-cm petri dish.\nNote: Dissection and isolation should be performed in a sterile environment.",
    "Use forceps and scissors to remove the skin and skeletal muscle tissue from the bone and wash the bone with cold PBS in a 10 cm petri dish.\nPlace the bone in a new 10 cm petri dish containing PBS, and separate femur and tibia by cutting at the knee joint.\nClean away any remaining tissue, and wash again with PBS in a new dish.\nNote: Bones must be thoroughly cleaned of skeletal muscle to avoid contamination from the tissue cells.\nFill up a 3-mL syringe with cold PBS containing 2% FBS.\nCut off the ends of the bone, gently insert a 28-gauge needle attached to the syringe into the marrow cavity, and flush out the bone marrow into an empty 10-cm petri dish by expelling the PBS solution through the cavity.\nRefill the syringe with PBS/FBS solution and repeat this step until all bone marrow materials have been flushed out into the dish.\nNote: The PBS/FBS solution is made fresh each time before bone marrow isolation.\nThe color of the bone changes from dark red to white when the bone marrow is completely flushed out (see Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1221-Fig1.jpg\nFigure 1. Preparation of bone marrow derived macrophages (BMDMs)\n(A) Mouse long bones before and after the marrow is flushed out.\n(B) Representative cell images at several critical time points.\nThe amount of bone marrow cells to be obtained is dependent on age and genetic background of the mouse. Usually 6–8 week-old mice are ideal BM donors.\nGently pipette the PBS/FBS/BM mixture up and down several time using a 5 mL serological pipette to disburse the bone marrow. Then transfer the solution into a 15 mL conical tube and continue to pipette up and down several times. Place the tube on ice.\nLyse red blood cells.",
    "Centrifuge (1400 rpm) for 5 min at 25°C to pellet cells.\nAspirate the supernatant. Add 5 mL Red Blood Cell Lysis Buffer and 1 mL FBS. Resuspend the cells and incubate for 5 min at room temperature to lyse red blood cells.\nNote: Red Blood Cell Lysis Buffer is toxic to bone marrow cells. Including FBS can reduce cytotoxicity and increase cell viability.\nWash the cells with cold PBS.\nCentrifuge (1400 rpm) for 5 min at 4°C to pellet the cells.\nResuspend the cells in 10 mL cold PBS, and centrifuge again (1400 rpm) for 5 min to pellet cells.\nRepeat the wash two more times.\nResuspend the cells in 1 mL of complete RPMI 1640 medium pre-warmed at 37°C (Table 2[href=https://www.wicell.org#tbl2]) before adding to a 10-cm cell culture dish containing 6 mL of warm complete RPMI 1640 medium.\ntable:files/protocols_protocol_1221_2.csv\nStore at 4°C for up to 1 month\nIncubate 5 h at 37°C and 5% CO2 to remove stromal cells.\nNote: After 5 h, the stromal cells will attach to the dish surface whereas the bone marrow stem cells and precursor cells remain unattached or suspended (Figure 1[href=https://www.wicell.org#fig1]B).\nCritical: This step is required to remove the stromal cells, which attach to the dish and are indistinguishable from differentiated BMDMs if allowed to grow. This step is crucial for the purity of BMDMs.\nAfter 5 h, carefully collect the media that contain unattached cells in 15 mL falcon tubes. Take care not to disturb the adhered cells.\nCentrifuge (1400 rpm) at 4°C for 5 min to pellet the cells, and resuspend the cells in 1 mL of complete RPMI 1640 media.\nCount the cell number using a hemocytometer.\nLentiviral transduction\nTiming: 2 days",
    "In this protocol, we use lentivirus-mediated DNA transfer to modify the BM cells before they are differentiated to BMDMs (Miller and Blystone, 2015[href=https://www.wicell.org#bib3]). In our experiment, we transduced the BM cells with lentivirus that carries SOCS1 cDNA (SOCS1-Lentivirus), using GFP-lentivirus as control (Du et al., 2020[href=https://www.wicell.org#bib1]). We found that transducing BM precursor cells is more effective to deliver the gene into BMDMs than directly transducing fully differentiated BMDMs.\nAdd the 1 mL BM cells (up to 2 × 106 cells) into a new 10-cm cell culture dish containing 6 mL of complete RPMI 1640.\nNote: Usually 1–5 × 106 bone marrow cells can be obtained from one mouse, depending on the age and size of the mouse.\nThaw lentivirus stock solutions. To the lentivirus solution (0.1–0.2 mL) add polybrene to a final concentration of 6 μg/mL. Incubate at 25°C for 5 min.\nCritical: Polybrene is required to increase lentiviral transduction efficiency. The underlying principle is that Polybrene can neutralize the charge repulsion between the cell surface and virions.\nAdd the lentivirus-polybrene complex to the BM cells in the dish at a M.O.I. of 10. Incubate the cells at 37°C and 5% CO2 for 48 h.\nBMDM differentiation\nTiming: 7 days\nThe transduced BM cells are differentiated into BMDMs using the differentiation medium (Table 3[href=https://www.wicell.org#tbl3]).\ntable:files/protocols_protocol_1221_3.csv\nStore at 4°C for up to 1 month\nAfter 48 h of culture, carefully aspirate the medium containing lentivirus and replace with the differentiation medium.\nNote: Most of the BM cells become attached to the plate at this time.\nContinue the culture for 7 days at 37°C and 5% CO2. Change fresh differentiation media every 2 days.\nNote: After 7 days the shape of the cultured cells (BMDMs) appears longer and more oval-like (Figure 1[href=https://www.wicell.org#fig1]B).",
    "Transduced BMDMs are GFP positive. The transduction efficiency can be estimated by observing the cells under a fluorescent microscope.\nThe expression of the delivered gene (such as SOCS1) can be assessed by Western blotting.\nLiposome injection\nTiming: 30 min to 1 h\nTo deplete macrophages, the clodronate-containing liposomes need to be delivered to the mice intravenously. We injected these liposomes through the retro-orbital venous sinus (Yardeni et al., 2011[href=https://www.wicell.org#bib7]).\nTwo hours prior to injection, take out clodronate liposomes and control liposomes to equilibrate to 25°C.\nNote: Clodronate liposomes and PBS liposomes (control liposomes) are stored at 4°C\nInvert the liposome tube several times (8–10 times) until the liquid becomes homogenized.\nUse a 1-mL syringe with a 28-gauge needle to take 0.2 mL of clodronate liposomes or control liposomes.\nCritical: Make sure to remove any air bubbles before injecting the mouse. Injecting air into the vein can lead to death.\nAnesthetize the mouse with isoflurane using a precision vaporizer in a Class II Type B2 Biological Safety Cabinet.\nPlace the mouse inside the chamber and tightly close the lid.\nAdjust oxygen flowmeter and isoflurane vaporizer setting to 1 L and 0.05–4%, respectively.\nWait until the mouse becomes deeply unconscious and then remove the mouse from the chamber. Complete anesthesia can be confirmed by loss of pedal reflex.\nNote: When the mouse is appropriately anesthetized, its breathing becomes rhythmic when it is lying on its side. Do not overexpose the mouse to the isoflurane as excessive exposure can lead to death. As the anesthetized mouse can wake up within 15 seconds, the injection should be completed within 6–7 s.\nImmediately before injection, resuspend the liposome solution by inverting the syringe containing liposomes 6 times to homogenize the liposome liquid.\nSlowly inject 0.2 mL liposomes into the retro-orbital sinus.",
    "For injection, position the anesthetized mouse onto one side and pull back skin above and below the eye such that the eye slightly protrudes.\nAt the base of the eye, insert the needle at the medial canthus at about a 30° angle into the retro-orbital sinus (see Figure 2[href=https://www.wicell.org#fig2]). For more detailed information about retro-orbital injection, please see this reference (Yardeni et al., 2011[href=https://www.wicell.org#bib7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1221-Fig2.jpg\nFigure 2. Mouse retro-orbital injection with 1 mL syringe.\nNote: There should be no resistance felt if the needle is inserted into the correct position and little to no bleeding should occur post-injection.\nLiposome solution can also be injected from the tail vein.\nOnce injection is completed, place the mouse back into its cage.\nNote: Observe the mouse to make sure it has fully recovered from anesthesia before leaving it unattended. It usually takes 15–20 s for the mouse to recover.\nValidation of macrophage depletion\nTiming: 2 days\nElimination of macrophages can be confirmed by analyzing F4/80+ resident macrophages in the spleen using fluorescence-activated cell sorting (FACS) assays after 48 h. This validation step is needed to establish the experimental condition. Once an optimal experimental condition is established, this step is not always necessary.\nAt 48 h following liposome injection, kill the mouse using a CO2 chamber followed by cervical dislocation.\nImmediately sanitize the skin with 70% ethanol, and open the peritoneal cavity with surgical scissors and harvest the spleen.\nPlace the spleen into a 10-cm petri dish filled with cold RPMI1640 containing 10% FBS.\nPlace the spleen onto a 70-μm cell strainer and use the end of a 1-mL syringe to smash the spleen through the cell strainer. Collect the filtered cell suspension into a 15 mL tube.",
    "Spin down the cells (1400 rpm for 5 min at 4°C). Resuspend the cells in 5 mL of Red Blood Cell Lysis Buffer and incubate at 25°C for 5 min to lyse the red blood cells.\nAdd 10 mL of cold PBS. Centrifugation at 1400 rpm for 5 min to collect the cells.\nWash the cells again with cold PBS by repeating this step. Keep the cells on ice.\nFACS analysis.\nIncubate the cells in 0.1 mL of the Live and Dead Violet Viability solution on ice for 30 min. Wash the cells with cold PBS once and spin down the cells (1400 rpm for 5 min at 4°C).\nStain the cells with anti-mouse MHCII FITC (1:200 dilution, clone M5/114.15.2, BioLegend) and anti-mouse F4/80 APC (1:200 dilution, clone BM8, BioLegend) on ice for 30 min in the dark. Wash the cells with cold PBS once.\nPerform FACS analyses using a BD LSRFortessa unit (BD Biosciences).\nAnalyze the FACS data using FlowJo software (V10) (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1221-Fig3.jpg\nFigure 3. Validation of macrophage depletion by FACS\n(A) Representative FACS plots of mouse spleen macrophage analyses at 48 h after treatment with control liposomes, one dose and two doses of clodronate liposomes. ∗∗∗p<0.001, by one-way ANOVA.\n(B) Quantitative data of the FACS analyses (adapted from Du et al., 2020[href=https://www.wicell.org#bib1], with permission from Elsevier).\nNote: Successful depletion of resident macrophages (>90% reduction) can usually be observed after 48 h following one dose of liposome injection. Figure 3[href=https://www.wicell.org#fig3] shows an example of spleen macrophage depletion following one or two doses of clodronate liposome delivery at 48 h (Du et al., 2020[href=https://www.wicell.org#bib1]).\nMacrophage reconstitution\nTiming: 1–2 h",
    "Two days after clodronate-liposome treatment, the macrophage-depleted mouse can be reconstituted with new macrophages. In this protocol, we used lentivirus-transduced BMDMs. These BMDMs are delivered by intravenous injection through the retro-orbital sinus. Because endogenous macrophages will repopulate the depleted mouse within 1–2 weeks (van Rooijen et al., 1989[href=https://www.wicell.org#bib5]), there is a window of only 4–5 days in which the exogenous macrophages can be assayed in the mouse. Therefore, it is crucial that the experiment is planned so that the in vitro differentiation of BMDMs is completed and ready for use within this window.\nAspirate the culture media of BMDMs and wash the cells with 10 mL PBS. Add 5 mL of Trypsin-EDTA and incubate at 37°C for 5 min to dissociate cells from the plate.\nNote: BMDMs are usually ready for use by day 7 of culture in the conditioned medium.\nAn example of fully differentiated BMDMs is shown in Figure 1[href=https://www.wicell.org#fig1]B.\nUse a sterile cell scraper to scrape the cells off the plate.\nTransfer the cells into a 50 mL conical tube. Rinse the culture dish with 5 mL of PBS (pH 7.0) 2–3 times and transfer rinse solution into the tube containing the harvested cells.\nGently pipette the cell solution several times to disburse cell clumps.\nCentrifuge (1400 rpm) for 5 min at 25°C to pellet cells. Wash the cells with sterile PBS (pH 7.0) 2–3 times.\nResuspend the cells with 5 mL of sterile PBS. Count cells with a hemocytometer.\nCentrifuge (1400 rpm) for 5 min at 25°C to pellet cells. Remove the supernatant, and resuspend the cells in sterile PBS at a concentration of 107 cells/mL.\nAnesthetize the recipient mouse (macrophage-depleted) using isoflurane as described above.",
    "Fill a 1 mL syringe with 0.2 mL cell solution. Use a 28-gauge needle to slowly inject this 0.2 mL of BMDM solution through the retro-orbital venous sinus.\nNote: Each mouse receives 2 × 106 BMDMs. 0.2 mL of PBS can be injected as a control. The BMDM solution can also be injected through the tail vein.\nAfter injection is complete, place the mouse back into its cage.\nNote: Observe the mouse to make sure it has fully recovered from anesthesia before leaving it unattended.\nLPS-induced sepsis and analysis\nTiming: 3–4 days\nThe reconstituted mouse is an in vivo platform to study the exogenous macrophages. Thirty-six hours after BMDM injection, the mouse is ready to use for experiment. In this protocol, we used the LPS-induced sepsis model to study the in vivo function of the reconstituted BMDMs (Du et al., 2020[href=https://www.wicell.org#bib1]).\nDissolve LPS in sterile PBS (pH 7.0) at 10 mg/mL.\nWeigh the mouse. Based on the weight, calculate the volume of the LPS solution to be injected to the mouse at 20 mg/kg body weight.\nNote: For the LPS model, the ideal body weight of the mouse should be >18 grams.\nLoad a 1-mL syringe with appropriate LPS solution, and inject the mouse intraperitoneally using a 28-gauge needle.\nNote: For injection, insert the needle at a 30°–40° angle with the mouse’s abdomen in the lower right quadrant. Once the needle has pierced through skin and peritoneal lining, angle parallel with the stomach to avoid puncturing organs. PBS can be used as control for injection.\nAnalyze the mice.",
    "Note: The mice will develop hypothermia within a few hours following LPS injection, and up to 50% of C57BL/6 mice may die within 72 h at this LPS dose. LPS injection causes severe systemic inflammation and multi-organ injury. The mice can be euthanized at different time points for analysis."
  ],
  "subjectAreas": [
    "Immunology",
    "Flow Cytometry",
    "Cell Biology",
    "Cell Differentiation",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}