{
  "id": 1745,
  "origin_website": "Cell",
  "title": "An Optimized Protocol for Proximity Biotinylation in Confluent Epithelial Cell Cultures Using the Peroxidase APEX2",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nFigure 3[href=https://www.wicell.org#fig3] summarizes the general sample preparation workflows for APEX2-mediated proximity biotinylation and electron microscopy imaging. Biotinylated proteins can be affinity purified from whole cell lysates using streptavidin Sepharose or visualized in fixed cells using fluorescently labeled streptavidin and light microscopy. For a detailed protocol on how to prepare APEX2 samples for EM see (Martell et al., 2017[href=https://www.wicell.org#bib15]; Ludwig et al., 2017[href=https://www.wicell.org#bib11]; Ludwig et al., 2016[href=https://www.wicell.org#bib12]; Ludwig, 2020[href=https://www.wicell.org#bib10]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/120-Fig3.jpg\nFigure 3. Overall Workflow for APEX2-Mediated Proximity Biotinylation and Electron Microscopy Imaging\nBiotinylated proteins can be visualized in fixed cells by fluorescently labeled streptavidin or affinity purified using streptavidin Sepharose. Eluted proteins can be analyzed by LC-MS/MS. See (Martell et al., 2017[href=https://www.wicell.org#bib15]; Ludwig et al., 2017[href=https://www.wicell.org#bib11]; Ludwig et al., 2016[href=https://www.wicell.org#bib12]; Ludwig, 2020[href=https://www.wicell.org#bib10]) for detailed protocols on APEX2-EM.\nPre-incubation of Cells with Biotin Phenol and Proximity Biotinylation\nTiming: 45 min\nThe purpose of this 30 min pre-incubation step is to allow biotin phenol to enter the cells. Pre-incubation for up to 2 h can slightly increase the cellular biotin phenol availability.\nAdd BP to warm growth medium in a Falcon tube to a final concentration of 2.5 mM and mix well. Use minimal volume of medium to save on BP (see Table 1[href=https://www.wicell.org#tbl1])\ntable:files/protocols_protocol_120_10.csv\nReplace medium in tissue culture dish/filters with medium supplemented with 2.5 mM BP\nPlace cells back into the incubator set to 37°C/5% CO2 for 30 min\nIn the meantime, dissolve the pre-weighed quenchers and mix them into the lysis buffer and STOP/Wash buffers\nCritical: Handle at most 2 dishes at a time and work quickly!\nNote: Just before use, add 200× H2O2 to PBS++ to make up the Biotinylation buffer",
    "Note: If working with Transwell filters, transfer filters between dishes. If working with plastic dishes, decant or aspirate old solution and add fresh.\nWash 3 times with PBS++\nDecant or aspirate and add biotinylation buffer for 20 s to 1 min (maximum 2 min). See Table 1[href=https://www.wicell.org#tbl1] for appropriate volumes.\nDecant biotinylation buffer and immediately wash three times with STOP/Wash buffer. See Table 1[href=https://www.wicell.org#tbl1] for appropriate volumes.\nCritical: Work quickly and time the reaction accurately\nNote: Direct comparison of different APEX2 fusion proteins requires the overall levels of biotinylation be matched. This can theoretically be achieved by adjusting the biotinylation time within the first 1–2 minutes. Although this offers some degree of control over the labeling reaction, we recommend adjusting different samples by a) matching the expression levels of the APEX2 fusion proteins to be compared, and b) by varying the H2O2 concentration across the samples. In MDCK-II cells H2O2 concentrations of 0.1–0.5 mM resulted in optimal proximity labeling in the presence of 2.5 mM BP, with H2O2 concentrations below and above these values resulting in less efficient labeling (Figure 2[href=https://www.wicell.org#fig2]).\nPreparation of Cell Lysate\nTiming: 1 h\nThe purpose of this step is to prepare a whole cell lysate using RIPA buffer\nAspirate STOP/Wash buffer thoroughly, and add Lysis Buffer. See Table 1[href=https://www.wicell.org#tbl1] for appropriate volumes.\nScrape cells with lysis buffer into microfuge tube. If working with filters, rest filter on the inside surface of the dish cover as a hard backing for scraping.\nIncubate lysate on ice for 30 min.\nPause Point: At this point lysates can be snap-frozen in liquid nitrogen and stored at −80°C\nCritical: Addition of Trolox, sodium ascorbate, and sodium azide to the lysis buffer is critical in order to inactivate the APEX2 enzyme and therefore to prevent non-specific biotinylation in the cell lysate.",
    "Sonicate lysate on Medium intensity for 30 s, pause 30 s, and repeat once.\nClear lysate by centrifugation at 20,000 × g for 30 min at 4°C.\nCollect supernatant and dispose pellet.\nMeasure and Equalize Protein Concentrations of Cell Lysates\nTiming: 1 h\nThe purpose of this step is to determine the protein concentrations of the cell lysates and, if required, equalize their concentration, which is critical for SILAC-LC-MS/MS.\nThe protein concentration of a cell lysate from a 75 mm filter dish is ~3.5 mg/mL\nDilute a small volume of lysate in MQ for measurement. Typically, a 1:10 and 1:20 dilution are prepared and the average measured concentration of the two is taken\nIncubate with Bradford’s dye 1:50 5 min RT. Measure A595\nEqualize the protein concentrations of the lysates with RIPA buffer and use equal volumes for the subsequent streptavidin purification\nSave 5% of the lysate for SDS-PAGE and Western blotting with streptavidin-HRP\nStreptavidin Purification\nTiming: 4 h\nThe purpose of this step is to isolate biotinylated proteins from whole cell lysates using streptavidin beads. Captured proteins are washed extensively and eluted for subsequent in-gel digestion with trypsin and LC-MS/MS analysis.\nAdd 1 mL RIPA buffer to streptavidin Sepharose beads, spin at 500 × g for 2 min. See Table 1[href=https://www.wicell.org#tbl1] for appropriate volumes of streptavidin beads.\nWash with 1 mL RIPA twice.\nRemove all RIPA, and add clarified cell lysate to Sepharose beads.\nRotate sample for 1–2 h at 4°C.\nSpin, wash with 1 mL RIPA. 2 times.\nSpin, wash with 1 mL 1 M KCl.\nSpin, wash with 1 mL 0.1 M Na2CO3.\nSpin, wash with 1 mL 2 M Urea in 10 mM Tris-HCl pH 8.\nSpin, wash with 1 mL RIPA.\nTo produce individual eluates for Western blotting with streptavidin-HRP, proceed as follows:",
    "Spin, wash with 1 mL RIPA without detergents\nSpin, aspirate supernatant, spin again, and remove as much supernatant as possible using a 20 μL tip, leaving behind as little buffer as possible. Avoid aspiration of beads!\nAdd 50% of final elution buffer volume to beads, e.g., 2 × 75 mm filter inserts correspond to a final elution volume of 100 μL, so add 50 μL elution buffer at this step\nIncubate at 95°C for 15 min\nSpin while hot, transfer supernatant to fresh tube\nAdd second half of elution buffer, incubate at 95°C for 15 min, spin while hot and pool supernatants\nNote: To combine two eluates for subsequent SILAC-LC-MS/MS, proceed after step 27 as follows:\nSpin, aspirate supernatant, and add 400 μL RIPA without detergents to resuspend beads\nCombine resuspended beads of the [H] and [L] samples into a fresh microfuge tube\nAdd 300 μL RIPA without detergents to previous tubes to collect remaining beads left on the walls of the tubes. Add this to the tube in step 35\nSpin, aspirate, leaving a meniscus. Spin again and remove as much supernatant as possible using a 20 μL tip. Avoid aspiration of beads!\nAdd half of elution buffer volume to beads, i.e. 2 × 75 mm filter inserts correspond to a final elution volume of 100 μL, so add 50 μL elution buffer at this step\nIncubate at 95°C for 15 min\nSpin while hot, transfer supernatant to fresh tube\nAdd second half of elution buffer, incubate at 95°C for 15 min, spin while hot and pool supernatants",
    "Note: In our experience a 1–2 h incubation with streptavidin beads is sufficient to capture most (up to 90%) biotinylated proteins from the cell lysate. While incubation times of up to 4 h may facilitate binding and therefore identification of low abundant proteins, extended incubation times should be avoided, as this may result in the non-specific binding or retention of non-biotinylated proteins.\nNote: This protocol describes the use of streptavidin Sepharose beads and subsequent elution of the captured proteins using LDS-based sample buffer supplemented with biotin. This is followed by SDS-PAGE of the eluted proteins and in-gel digestion with trypsin.\nAlternatives: Use magnetic streptavidin beads, which are compatible with on bead digestion protocols.\nCritical: The washing steps 24–26 are critical and should not be omitted. These stringent washing steps remove non-biotinylated proteins from the streptavidin beads, but do not affect the streptavidin-biotin interaction.\nFluorescence Streptavidin Labeling\nTiming: 5 h\nThe purpose of this step is to assess the spatial specificity of the proximity biotinylation reaction in fixed cells using fluorescently labeled streptavidin and light microscopy. Cells can be grown on glass coverslips or Transwell filters. The protocol below describes the processing of cells grown on Transwell filters.\nCritical: Cell fixation, permeabilization and blocking (steps 43–47) should be performed immediately following the biotinylation reaction described in steps 6–7.\nDecant STOP/Wash buffer from the Transwell insert and quickly but gently wash cells once with PBS++\nFix cells with either 1% or 4% PFA in PBS++ for 20 or 10 min at RT, respectively\nWash 3 times with PBS++\nPermeabilize cells with 0.5% Triton X-100 in PBS for 10 min at RT\nWash 3 times with PBS\nBlock cells with 10% FBS in PBS (+0.1 mM sodium azide) for 1–12 h at 4°C",
    "Pause Point: At this point cells can be stored for up to 3 days at 4°C in the dark.\nNote: Steps 48–63 describe antibody and fluorescent streptavidin staining.\nOptional: Prepare primary and secondary antibody solutions (if desired) (at least 25 μL of solution is required per sample) in antibody incubation buffer (0.1% BSA, 0.01% Tween in PBS).\nPrepare a humidified dark chamber with a piece of parafilm for the incubation of filter pieces with antibody solution.\nPipette the primary antibody solutions onto the parafilm just prior to cutting the filters.\nCut out filter from the Transwell insert using a sharp razor blade.\nEach 24-well filter piece can be cut into a maximum of 6 small pieces.\nEnsure filter pieces are kept wet with blocking buffer during this time.\nWith sharp forceps, place the small filter pieces into the droplets of primary antibody solution, with the monolayer facing up.\nIncubate filter pieces with primary antibody for 1–4 h.\nWash 3 times 5 min with antibody incubation buffer by aspirating droplets and adding at least 25 μL of fresh buffer.\nIncubate filter pieces with appropriate secondary antibodies for 1 h. AlexaFluor 568 streptavidin (SA-AF-568) is used at 1:1000 (1 μg/mL stock) together with the secondary antibody.\nWash 3 times with PBS.\nStain with DAPI at 1:100 (~1 μg/mL) for 5 min at RT.\nWash 3 times with PBS.\nPlace up to 3 small filter pieces on a glass slide in ~6 μL of Vectashield mounting media, with the monolayer facing up.\nCover the filter pieces with a glass coverslip. Avoid bubbles.\nLet settle for 1 h at RT in the dark.\nSeal glass coverslip with transparent nail polish."
  ],
  "subjectAreas": [
    "Proteomics",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}