{
  "id": 4526,
  "origin_website": "Bio",
  "title": "Extraction of Total Proteins from Rice Plant",
  "procedures": [
    "Preparation of protein samples from rice leavesCut 0.5 g fresh or -80 °C frozen leaf samples into small pieces, add little sea sand (Figure 2A) and freeze the tissue by pouring liquid nitrogen on the cut leaves in the mortar (Video 1).Grind the tissue to a fine powder, using a mortar and pestle (Figure 2B, Video 1).Add 5 ml extraction buffer and immediately grind the sample until foaming (Figure 2C, Video 1).Add 0.5 g PVPP and grind completely. Then add 5 ml extraction buffer and grind the sample until foaming (Video 1).Add 250 μl 40 mM PMSF and 5 ml extraction buffer, and then grind the mixture until foaming (Video 1).Transfer the homogenate into a sterilized 50 ml centrifuge tube (Video 1). The remaining plant material sticking on mortar and pestle is rescued by carefully rinsing mortar and pestle with 5 ml extraction buffer, and poured into the tube and mixed well with the homogenate (Video 1).Centrifuge 20 min at 15,000 rpm (in No. 46 Rotor), 4 °C. Filter the supernatant through 2 layers of Miracloth into another fresh tube (Figure 2F). Extract the filtrate with an equal volume of buffer saturated phenol (about 16 ml). Mix well by inversion. Centrifuge 20 min at 15,000 rpm, 4 °C.Transfer the top layer (phenol phase) into another fresh tube (Figure 2G and 2H).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20141103/20141103230358_8653.jpgFigure 2. Preparation of protein sample. A-E. Leaves were ground and extracted by extraction buffer. F-H. Protein sample was purified by phenol extraction.Extract the phenol phase with an equal volume of cold extraction buffer twice (1st 14 ml and 2nd 12 ml, respectively). Mix well by inversion. Centrifuge 20 min at 15,000 rpm, 4 °C. Recover the top layer (phenol phase).Add 3x volume of cooled precipitation buffer to the recovered phenol phase and mix well by inversion.",
    "Incubate at -20 °C for 4 h (or even overnight) to precipitate the proteins. Then centrifuge 20 min at 15,000 rpm, 4 °C and discard the supernatant.Wash the pellet with 1.8 ml precipitation buffer twice. Recover the pellet by centrifugation at 8,000 rpm for 5 min.Wash the pellet with 1 ml of cold 100% acetone containing with 0.7 μl 2-mercaptoethanol (14.3 M). Recover the pellet by centrifugation at 8,000 rpm for 5 min.Dry the pellet by SpeedVac for about 2-3 min (less than 5 min) and resuspend in an appropriate volume of lysis buffer.The protein samples can be quantified by Bradford method (Bradford, 1976) and stored at -20 °C.The obtained protein samples can be used for proteomic analysis (Lin et al., 2014; Liu et al., 2012) or Western blot (Lin and Jeang, 2005) (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20141103/20141103230031_7593.jpgFigure 3. Proteomic analysis and Western blot analysis. A. Proteomic analysis of leaf proteins from various rice varieties. B. Proteomic analysis of taro leaf proteins and western blotting probed with anti-SSSI (Lin and Jeang, 2005).Preparation of the protein samples from rice grainsFreeze 0.5 g dehulled grains (rice grains without glumes) by liquid nitrogen.Place the frozen tissue in a mortar containing little seasand and liquid nitrogen. Grind the tissue to a powder with the mortar and pestle.Add 10 ml extraction buffer, contains with 140 μl 40 mM PMSF. Grind sample for 2 min or to a homogenate and then transfer into a sterilized 50 ml centrifuge tube.Centrifuge 20 min at 15,000 rpm (in No. 46 Rotor), 4 °C. Transfer the supernatant into another fresh tube.Add 3x volume of cold 0.1 M NH4OAc/Methanol/10 mM 2-mercaptoethanol to the recovered phenol phase and mix well by inversion.Incubate at -20 °C for 4 h (or overnight) to precipitate the proteins.",
    "Then centrifuge 20 min at 15,000 rpm, 4 °C and discard the supernatant.Wash the pellet with 1.8 ml 0.1 M NH4OAc/ Methanol/ 10 mM 2-mercaptoethanol twice. Recover the pellet by centrifugation at 8,000 rpm for 5 min.Wash the pellet with 1 ml of cold 100% acetone containing with 0.7 μl 2-mercaptoethanol (14.3 M). Recover the pellet by centrifugation at 8,000 rpm for 5 min.Dry the pellet by the SpeedVac system for about 2-3 min (less than 5 min) and resuspend in an appropriate volume of lysis buffer.The protein samples can be quantified by Bradford method (Bradford, 1976) and stored at -20 °C.The obtained protein samples can be used for proteomic analysis or Western blot."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}