{
  "id": 19906,
  "origin_website": "Wiley",
  "title": "Automated Quantification of Mitochondrial Fragmentation in an In Vitro Parkinson's Disease Model",
  "procedures": [
    "This protocol details wet-lab sample preparation and subsequent image-acquisition procedures. The images acquired in this protocol are saved onto a physical or cloud storage platform. A step-by-step guide to building and executing an automated CellProfiler (https://cellprofiler.org/[href=https://cellprofiler.org/]) analysis pipeline for the extraction of mitochondrial measurements will be detailed in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-prot-0002].\nIn Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-prot-0001], we acquire images for subsequent data measurements related to mitochondrial health and fragmentation status. We utilize an in vitro rotenone-based PD model the use of which which results in increased cytotoxicity coupled with decreased neuron viability and neuron loss (see Figure 10[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-fig-0010] in Understanding Results). At the experimental endpoint, MitoTracker Orange (HCS Mitochondrial Health Kit, Invitrogen, cat. no. H10295) is used to label mitochondria with polarized membranes. In this assay, signal intensity in the orange channel is proportional to membrane potential and mitochondrial health. The experimental setup was designed for testing the effects of a range of putative anti-PD compounds on mitochondrial structure and function.",
    "Membrane potential is a central feature of healthy mitochondria, and membrane depolarization is a good indicator of mitochondrial dysfunction and a measure of cytotoxicity (Jayaraj et al., 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-bib-0010]; Reddy, 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-bib-0024]). This protocol uses Invitrogen MitoTracker Orange as an indicator of mitochondrial function, because its accumulation in the mitochondria of live cells is proportional to the mitochondrial membrane potential (Scorrano, Petronilli, Colonna, Di Lisa, & Bernardi, 1999[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-bib-0028]), to provide a relative assessment of mitochondrial membrane potential. Several other fluorescent lipophilic cationic dyes [e.g., MitoTracker, tetramethylrhodamine methyl (TMRM) and ethyl (TMRE)] have also become important tools for making a relative assessment of mitochondrial membrane potential in live cells (Perry, Norman, Barbieri, Brown, & Gelbard, 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-bib-0019]). Cationic probes such as TMRM are readily sequestered in the matrix space of polarized mitochondria, and are released once mitochondria experience a loss in membrane potential (Kholmukhamedov, Schwartz, & Lemasters, 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-bib-0013]). MitoTracker dyes possess a reactive chloromethyl group that forms a covalent bond with thiols on proteins and peptides, which traps MitoTracker dyes within mitochondria. As a result, mitochondria retain MitoTracker dyes after loss of their membrane potential, e.g., upon aldehyde fixation. Although the relationship between mitochondrial membrane potential and fluorescence signal intensity is less linear with MitoTracker dyes, for relative assessment of mitochondrial membrane potential, these dyes possess the advantage of being aldehyde fixable (Elmore, Nishimura, Qian, Herman, & Lemasters, 2004[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-bib-0005]; Perry et al., 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-bib-0019]; Poot et al., 1996[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-bib-0022]). Invitrogen Hoechst 33342 is used as a segmentation tool to identify cells. Hoechst 33342 nucleic acid stain is a popular cell-permeant nuclear counterstain that emits blue fluorescence when bound to dsDNA. Hoechst 33342 binds preferentially to adenine-thymine (A-T) regions of DNA. This stain binds into the minor groove of DNA (Sandhu, Warters, & Dethlefsen, 1985[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-bib-0026]).",
    "A viability stain, such as the Invitrogen Image-iT DEAD Green Viability Stain, can be easily incorporated to further multiplex the assay; however, it is omitted from this protocol. These dyes have sufficient retention of fluorescence signal intensity upon formaldehyde fixation and detergent permeabilization to be useful in fixed endpoint assays, as well as in applications involving immunocytochemistry for specific protein detection.",
    "In this protocol, we use the SN4741 mouse midbrain neuronal cell line, which are substantia nigra dopaminergic cells derived from transgenic mouse embryos (Son et al., 1999[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-bib-0031]). The SN4741 cell line is a transformed cell line, and the procedure undertaken for the establishment of the SN4741 line at Cornell University Medical College and Laboratory of Molecular Neurobiology is described in detail in Son et al. (1999[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-bib-0031]). The use of these cells for neurodegenerative models is reported in many in vitro experiments (Fishman-Jacob, Reznichenko, Youdim, & Mandel, 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-bib-0006]; Rodriguez-Losada, Romero, Estivill-Torrús, Guzmán de Villoria, & Aguirre, 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-bib-0025]; Son et al., 1999[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-bib-0031]; Wang et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-bib-0033]). The SN4741 cells were gifted to our lab and can be sourced from the founding laboratory.\nBriefly, SN4741 neurons, an immortalized midbrain-derived dopaminergic mouse cell line (Son et al., 1999[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-bib-0031]), were treated 24 hr with rotenone, then incubated with MitoTracker Orange, as described in the manufacturer's user manual, prior to formaldehyde fixation and Hoechst 33342 nuclear counterstaining. We subsequently use a CellProfiler image analysis pipeline to quantify intracellular mitochondrial fragmentation and fluorescence intensity of mitochondria in the peri-nuclear area of SN4741 neurons (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-prot-0002]).\nIn this article, MitoTracker Orange will be referred to as “MitoHealth.”\nMaterials\nSN4741 mouse midbrain derived neuronal cell line, cryopreserved in liquid N2 (Cornell University Medical College and Laboratory of Molecular Neurobiology; see Son et al. (1999[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-bib-0031]))\nComplete SN4741 cell culture medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-rec-0001])\nPhosphate-buffered saline (PBS), pH 7.4, (Gibco, cat. no. 10010023)\nTrypsin/EDTA (Gibco, cat. no. 15400054)\n0.4% trypan blue stain (ThermoFisher, cat. no. 15250061)\nRotenone (Tocris, cat. no. 3616)\nDimethyl sulfoxide (DMSO; Sigma-Aldrich, cat. no. D2650)\nMitoTracker Orange and Hoechst 33342 from the Invitrogens HCS Mitochondrial Health Kit (Invitrogen, cat. no. H10295)\nParaformaldehyde (PFA), 16% (w/v) aq. soln. (Fisher Scientific, Product Code.11490570)",
    "T-75 cell culture flasks (Thermo Fisher, cat. no. 156499)\nWater bath set to 37.5°C for pre-warming cell culture medium prior to application\n37°C, 5% CO2 cell culture incubator\nBenchtop vortex\n25-, 10-, and 5-ml sterile pipettes, individually wrapped [Fisherbrand™ Product codes 12559546 (25 ml), 11809660 (10 ml), and 11899650 (5 ml)]\n15-ml conical tubes (e.g., BD Falcon)\nCountess™ Automated Cell Counter (Invitrogen Cat no. C10227) or manual hemocytometer\nP-1000, P-200, and P-20 pipettes and filtered LTS pipette tips [VWR, 613-4774 (1000 µl), RAIN30389239 (200 µl), and 732-0273 (20 µl)]\n37°C, 5% CO2 incubator\nCorning® 96-well clear flat-bottom polystyrene TC-treated microplates, individually wrapped, with lids, sterile (Corning, Product no. 3596)\nMicroscope system: HCA wide-field fluorescence (GE Healthcare InCell 2000/6000), 40× objective lens, able to acquire 52 fields of view per well\nToshiba HDTB320EK3AA 2 TB Canvio Basics USB 3.0 Portable External Hard Drive (Toshiba)\nAdditional reagents and equipment for basic cell culture techniques including trypsinization and counting viable cells by trypan blue exclusion (see Current Protocols article: Phelan, 2001[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-bib-0020])\nSeeding SN4741 cells for in vitro rotenone PD model\n1. Retrieve cryovial of SN4741 cells (approximately 1 × 106 cells) from liquid nitrogen storage.\n2. Thaw cryovial of SN4741 cells in a 37°C water bath and pipette contents into 20 ml of pre-warmed complete cell culture medium to expand culture for experimental procedure.\nCulture SN4741 cells in complete medium in a T-75 cell culture vessel under standard and sterile conditions (see Current Protocols article: Phelan, 2001[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-bib-0020]) until flask is 80%-90% confluent. SN4741 cells require approximately 16 hr to settle and adhere. Cell culture medium is replaced the day after revival (16 hr) following one wash with 10 ml PBS. Cell culture medium should be replenished every 2-3 days. SN4741 neurons in T-75 flasks should reach 80%-90% confluency in 3-4 days.",
    "3. Remove medium from cells in T-75 flask and wash once with 10 ml PBS. Swirl flask and use pipette to remove excess.\n4. Apply 3-4 ml of trypsin/EDTA solution to the surface of the T-75 flask; swirl to ensure coverage, and return flask to incubator for 3-5 min until SN4741 cells become detached from surface of culture vessel. Check flask every few minutes to gauge cell detachment. Gently tap flask to detach residual cells from the surface of the T-75 flask.\nAdditional details for trypsinization of cells can be found in Current Protocols article Phelan (2001[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-bib-0020]).\n5. Neutralize the trypsin by the addition of 4 ml complete cell culture medium.\n6. Using a sterile pipette, pipette cell suspension up and down against surface of flask (∼10 times) to ensure single cell suspension and removal of the remaining adhering cells.\n7. Transfer cell suspension to a 15-ml tube and count viable cells using trypan blue exclusion and scoring via a Countess cell counter (automated) or hemocytometer (manual).\nAdditional details on cell counting can be found in Current Protocols article Phelan (2001[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-bib-0020]).\n8. Prepare a cell suspension with a concentration of 30,000 cells/ml (i.e., 3000 cells/100 µl) in complete culture medium.\n9. Using a P-200 pipette and pipette tip, pipette 100 µl (∼3000 cells) of the cell suspension into each experimental well of a 96-well plate.\n10. Place plate in incubator overnight (16-24 hr) for cells to adhere and proliferate.\n11. Add 100 µl of culture medium to each well following 24-hr incubation, and incubate for a further 24 hr.\nPreparation and addition of 10 nM rotenone in in vitro PD model",
    "Concentrated (3×) rotenone stock is prepared by the addition of DMSO to a concentration of 100 mM. Aliquots are prepared and sealed in a 50-ml conical tube (BD Falcon), protected from light, and stored at −20°C.\n12. Dilute 50 mg of powdered rotenone in 1.267 ml DMSO to prepare 100 mM rotenone stock.\nStock is aliquotted into microcentrifuge tubes, protected from light, and stored at 20°C.\n13. Thoroughly mix (vortex) 3 µl of 100 mM rotenone stock diluted in DMSO into 10 ml of complete culture medium, producing a 30,000 nM rotenone solution.\n14. Sequentially prepare 3000, 300, and 30 nM rotenone solutions by performing serial 1:10 dilutions—i.e., 100 µl of 30,000 nM rotenone solution mixed into 900 µl of cell medium to produce 1 ml of 3000 nM rotenone solution, etc.\n15. Prepare vehicle controls from DMSO using the same dilution method. Use 100 µl of a 50:50 solution of DMSO in PBS as a positive control for analysis of cell death.\n16. Add 100 µl of the 3× concentrated rotenone solution (30 nM) to appropriate wells [this is a 1:3 dilution, resulting in final well concentration of 10 nM (1×)].\n17. Incubate cells for 24 hr under standard conditions (5% CO2, 37°C).\nApplication of MitoHealth dye\nMitoHealth solution is prepared according to the kit developers’ instructional protocol. The MitoHealth kit contains Hoechst (Blue) and MitoHealth stain (red/orange).\n18. Remove 175 µl of culture medium from appropriate wells of the plate from step 17, leaving 125 µl remaining.\n19. Add 1.75 µl MitoHealth staining solution to 1 ml of complete medium. Protect from light.\n20. Add 50 µl of staining solution prepared in step 19 to each well.\nThere should now be 175 µl of solution in each well.",
    "21. Incubate cells under normal cell culture conditions for 30 min.\n22. Prepare fixation-counterstaining solution by adding 16% PFA stock solution and the Hoechst 33342 solution supplied with the Mitochondrial Health Kit to PBS in the ratio 3 ml: 6 µl: 9 ml. This makes a total of 14 ml of fixation-staining solution containing 4% PFA and 1:2000 Hoechst 33342.\nExample: 300 µl 16% PFA: 0.6 µl Hoechst 33324: 900 µl PBS yields 1200 µl of fixation-staining medium.\n23. Remove cell culture medium.\n24. Add 100 µl of fixation-staining solution to each well. Protect from light and incubate at room temperature for 15 min.\n25. Remove fixation-staining solution and gently wash cells once with 100 µl PBS to remove excess staining solution.\n26. Add 200 µl PBS to each well.\nImage acquisition at experimental endpoint\n27. Acquire 52 2D-deconvoluted .tif format images per well at 40× magnification.\nTable 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-tbl-0001] summarizes excitation and emission filters required for image acquisition.\nTable 1.\n                Summary of Dyes and Filters Required for Image Acquisition\ntable:\n﻿HCS Mitochondrial Health Kit stain,Approximate FI excitation wavelength,Approximate FI emission wavelength,Location of cellular stain,InCell 40× objective filter\nMitoHealth stain,550 nm,580 nm,Perinuclear/cytoplasmic,Cy3\nImage-iT® DEAD Green™ Viability Stain,488 nm,515 nm,Nucleus,FITC\nHoechst 33342,350 nm,461 nm,Nucleus,DAPI\n28. Store image files on an external hard drive for downstream image analysis with CellProfiler image-analysis pipeline (described in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-prot-0002]).\nAlthough the Materials section above states that a Toshiba hard drive is used to store the image dataset, we would like to highlight that any data storage device (e.g., an external hard drive) with sufficient memory space to hold approximately 416 MB of image data/well is required, and that this specific make and model of product is not essential. Cloud storage is an additional possibility.",
    "CellProfilerTM software is a flexible, user-friendly platform on which to conduct image analysis. The software and corresponding website—http://www.cellprofiler.org[href=http://www.cellprofiler.org] (RRID:SCR_007358)—contain pre-made computer algorithms (modules) and example analysis pipelines, respectively. CellProfiler is not an out-of-the-box, plug-and-play image-analysis software. Rather, these pre-made modules and example pipelines are used to teach researchers, with little computer programming or macro script writing experience, how to design and assemble an image-analysis pipeline to fit the specific needs of their experimental question. Interestingly, CellProfiler also allows for ImageJ (NIH) software input of macro scripts to aid image analysis.\nThe protocol below describes the step-by-step CellProfiler pipeline for the identification of nuclei, measurement of MitoHealth staining intensity, and quantification of the mitochondrial fragmentation protocol used for SN4741 cell mitochondrial measurements from 40× magnification digital images. This protocol was developed by optimizing a range of modules and example protocols. Each step includes a description, CellProfiler-derived notes, and rationale, followed by instructions on how to execute the step in CellProfiler software (in italic font). “Notes” are referenced from http://cellprofiler.org/manuals[href=http://cellprofiler.org/manuals]. The CellProfiler pipeline and modules described here are transferable between CellProfiler software versions 2.0 and 3.0 (Kamentsky et al., 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-bib-0012]; McQuin et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-bib-0015]).\nMaterials\nCellProfiler software: version 2.1.0 or newer; versions 2.2.0 or newer will require Java 8; available at https://cellprofiler.org/releases/[href=https://cellprofiler.org/releases/]\nDigital images: on internal/external hard drive or cloud storage (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-prot-0001])\nLaptop or desktop PC: macOS, Windows (32-bit) or Windows (64-bit).\nMS Excel software\nGraphPad Prism or other relevant graphing or statistical analysis programs (e.g., MS Excel or SPSS) for graphs and statistical analysis\nHard Drive for data storage: we use Toshiba HDTB320EK3AA 2 TB Canvio Basics USB 3.0 Portable External Hard Drive\nUpload image set and perform image sorting, image pre-processing, and illumination correction\n1. Open CellProfiler software.",
    "2. Select ‘Images’ in the ‘Input Module’ window. Click inside the empty ‘File list’ window, then Browse and select the experimental image set.\nHere, our image set is composed of two channels, Cy3 and DAPI, which account for 40× magnification images of MitoHealth-stained mitochondria and Hoechst-stained nuclei of SN4741 cells, respectively (see Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-fig-0002] for illustration).\n3. To filter the image according to filename, select ‘Names and Types’ in the pipeline Input modules. Select ‘Images Matching Rules’, then select ‘File’, ‘Does’, ‘Contain’ from the drop-down box selections. Type ‘DAPI’ into the input box to group DAPI channel images.\n4. Select ‘Add another image’ and repeat the process with the exception of entering ‘Cy3’ into the input box to group Cy3 channel images. Assign a (user-defined) name for grouped files, then Select ‘Update’.\nCare must be taken when filtering image sets by common phrases in filenames (see Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-fig-0001]), such as ‘DAPI’ and ‘Cy3’, as phrases are case-sensitive. Inconsistency in spelling or case-sensitivity results in failure to identify files and sub-group images. The experimental image set should now be grouped in two file lists under user-defined group titles, e.g., DAPI and Cy3, and ranked in numerical order.\nFor the analysis of images taken with a fluorescence microscope, it is common for the images to be pre-processed prior to analysis. The most common reason for this is uneven illumination across a field of view, as the light source does not evenly illuminate across the entire area. This results in areas with greater illumination than other areas, usually the corners of the image.\n5. Calculate correct illumination function:\n         \nSelect Correct Illumination Calculate module, then select input image (name assigned from Names and Types).\nInsert a (user-defined) Name for the Output Image, e.g., ‘IllumCy3’.",
    "Select the ’Regular’ option in ‘How the illumination function is calculated’.\nThe option ‘Regular’ is selected if stained objects (e.g., cell bodies, nuclei) are evenly dispersed across your image(s) and cover most of the image. This is true in the case of Cy3- and DAPI-channel images. ‘Regular’ intensities create the illumination function based on the intensity at each pixel of the image (or group of images if you are in ‘All’ mode) and are applied by division using the Correct Illumination Apply module.\nSelect ‘Median Filter’, Select ‘Manual’ method to calculate filter size, then input smoothing filter size ‘325’.\nIllumination function is calculated across the entire image set prior to initiation of object identification and subsequent data measurements.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/3b356c78-041f-482e-9f79-d8eb0487480d/cpns105-fig-0001-m.jpg</p>\nFigure 1\nImages are filtered into groups by file names. This figure illustrates an image set containing DAPI and Cy3 images being separated into groups (DAPI and Cy3) based on their file names. The cropped image tile labeled DAPI/Cy3 at the top represents a pseudo-colored composite of both channels. Blue arrows illustrate the separation of DAPI and Cy3 channels based on contents of their file names. Example image filenames are given on pseudo-colored DAPI and Cy3 images. Each pseudo-colored image has a representative enlarged image for graphical purposes (dotted white box). Scale bar = 40 µm.\n6. To apply the illumination function calculated by Correct Illumination Calculate:\n         \nSelect the Correct Illumination Apply module.\nInput a user-defined name into the ‘Name the output image’ box e.g., ‘CorrCy3’.\nSelect illumination function from drop-down box (as defined in the Correct Illumination Calculate module, e.g., IllumCy3).\nSelect ‘Divide’ as method for how the illumination function is applied.\n‘Divide’ is the recommended method for applying illumination function if the illumination correction function was created using ‘Regular’ in the Correct Illumination Calculate module.",
    "Figure 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-fig-0002] illustrates the shading seen on edges of Cy3- and DAPI-channel-acquired images before and after application of illumination function as described above.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/ed1f1634-0061-400b-bb52-8a92cb3015c9/cpns105-fig-0002-m.jpg</p>\nFigure 2\nCy3 image and DAPI channel images before and after illumination correction. (A and C) show representative 40× magnification grayscale images acquired using In Cell 2000 Cy3 filters before (OrigCy3) and after (CorrCy3) illumination correction, respectively. (B) Illustrates the illumination function (IllumCy3) produced from the entire Cy3 image set. Figure 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-fig-0003] (D and F) show representative 40× magnification grayscale images acquired using In Cell 2000 DAPI filters before (OrigBlue) and after (CorrBlue) illumination correction, respectively. (E) (IllumBlue) illustrates the illumination function produced from the entire image set. This illumination correction is carried out by CellProfiler modules Correct Illumination Calculate and Correct Illumination Apply. Images (A-F) are micro pictograms acquired and saved from the CellProfiler Software.\nIdentification of nuclei\nHere, we identify cell nuclei (a feature) based on their high-contrast background-to-foreground staining intensity. In CellProfiler software, a primary object is defined as an object or feature (usually a cellular sub-compartment, e.g., nucleus) which can be used as the basis upon which the subsequent image analysis steps can be built.\nNuclei are commonly selected as the primary object of an image-analysis pipeline due to their relatively uniform morphology and high background-to-foreground staining intensity ratio, which make them easily identifiable.\nText in italic below represents instructions on how to execute the step in CellProfiler software.\n7. Select > ‘Identify Primary Objects’ module.\n8. Input > (user-named illumination-corrected) DAPI image(s).\n9. Input > Typical Nucleus diameter range (pixels). Min: 50 and Max: 135.\n10. Discard objects outside the diameter range > Yes.\n11. Discard objects touching the border of the image > Yes.",
    "Estimate nucleus diameter using CellProfiler by selecting a DAPI image by right clicking, selecting ‘Show Selected Image’, and selecting ‘Tools > Measure length’.\n12. For thresholding, select ‘Global’ Thresholding Strategy with ‘Otsu’ method and ‘Two Classes’ thresholding. Set threshold correction factor of ‘1.0’, and lower and upper bounds to ‘0.0’ and ‘1.0’, respectively.\nThe ‘Global’ thresholding strategy uses the pixel intensities in each un-masked image to calculate a single threshold value to classify pixels as foreground (intensity above the threshold value) or background (intensity below the threshold value). This thresholding strategy is fast and robust, and is commonly applied to images that have a uniformly illuminated background. Foreground-to-background pixels are easily distinguishable using Hoechst-counterstained SN4741 cell nuclei. Foreground and background pixels of Hoechst-counterstained nuclei are easily identifiable in DAPI-channel images; thus, we use the ’Global’ thresholding strategy for primary object (nuclei) identification. Otsu is a method of automatically finding thresholds by splitting image pixels into two (foreground and background) or three classes (foreground, mid-level, and background) by minimizing the variance within each class. Lower bounds on threshold can be set at 0.0, as there is an object (Nucleus) in each image. Otherwise, an empirically determined lower threshold bound should be applied, as automatic methods of thresholding may mis-assign pixels in a blank image to the foreground class, potentially yielding false-positive results.\n13. Select > ‘Shape’ for de-clumping of primary object which are touching or in close proximity and ‘Shape’ for drawing dividing lines between objects.\n14. Select > ‘Yes’ to ‘Automatically calculate size of smoothing filter for de-clumping’.\n15. Select > ‘Yes’ to ‘Automatically calculate minimum allowed distance between local maxima’.\n16. Select > ‘No’ to ‘Retain outlines of the identified objects.\n17. Fill in identified objects > ‘After both thresholding and de-clumping’.",
    "By selecting ‘shape’ in the CellProfiler pipeline as the de-clumping method, a line will be drawn between the areas of the two nuclei whose boundaries intercept. An intersecting line will be drawn between the two (or more) clumped nuclei, and these will then be identified as distinct nuclei. Examples of this are highlighted by white arrows in Figure 3D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-fig-0003].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/1348d319-be35-4212-87a9-d3ef0633c3a9/cpns105-fig-0003-m.jpg</p>\nFigure 3\nIdentify nuclei as primary objects. (A) shows a representative illumination-corrected 40× magnification image of Hoechst counter-stained nuclei acquired using In Cell Analyzer 2000 DAPI channel filters. (B) Illustrates identified primary objects using object-colored masks. (C) Shows nuclei fitting protocol input criteria (outlined in green); nuclei are filtered out by size criteria (outlined in magenta) and for touching the image border (outlined in yellow). Dashed white box shows enlarged area. (D) Shows the enlarged area with white arrows indicating indentations used to de-clump objects (nuclei). Images (A-D) are micro pictograms acquired and saved from CellProfiler.\nIdentify secondary objects: ring-shaped cell body\nThe next module in CellProfiler pipeline is Identify Secondary Objects. This module identifies objects by using the object identified by another module as a starting point. In this example, the primary objects (nuclei) identified in Identify Primary Objects will act as the basis for the identification of the SN4741 peri-nuclear area (doughnut-shaped ring around the nucleus) in the corresponding Cy3 images. This will be executed by dilation of the previously identified nuclei—this dilated nucleus area is named ‘Full Doughnut’ in Figure 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-fig-0004]. A subsequent module in this pipeline will remove the nucleus, and a ring-like object will remain (a doughnut shaped-perinuclear region). This is referred to as ‘True Doughnut’ in Figure 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-fig-0005]. Other modules will collect measurements such as area and intensity of peri-nuclear regions.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/caed12a4-b67b-427d-b053-34c1818bdfae/cpns105-fig-0004-m.jpg</p>\nFigure 4",
    "Identification of secondary object: Full Doughnut. This figure shows the illumination-corrected Cy3 image (A), the result of a 25-pixel distance dilation in nucleus size with respect to Cy3 image staining intensity thresholding. Identified secondary objects/Full Doughnuts are illustrated in the form of colored masked objects. Dashed white line boxes in (A), (C), and (E) highlight the enlarged areas illustrated in (B), (D) and (F), respectively. These zoomed images show the image segmentation more clearly. Image (G) is a larger version of (F), illustrating the nuclear area/primary object with a green outline and the edges of the Full Doughnut/secondary object with a magenta outline. Images (A-G) are micro pictograms acquired and saved from the CellProfiler Software.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/11e9b16d-20f5-4044-b6e4-f6a1903a48a6/cpns105-fig-0005-m.jpg</p>\nFigure 5\nIdentify tertiary objects. Images (A), (C), and (F) illustrate the masked image result of sequential steps/modules from identification of primary object (Nuclei), identification of secondary object (Full Doughnut), and identification of tertiary object (true doughnut), respectively. The ring-shaped true doughnut is the result of removing the Nuclei areas from the Full Doughnuts. Micro-pictograph (G) highlights the outlines of the resulting true doughnut. The dashed white box in images (A), (C), (E), and (G) indicate the areas that have been enlarged for illustrative purposes and are represented by images (B), (D), (F), and (H), respectively. Images (A-H) are micro pictograms acquired and saved from the CellProfiler software.\nTo expand nucleus and create ‘Full Doughnut’ shape:\n18. Select > ‘Identify Secondary Object’ module.\n19. Input > Illumination function corrected Cy3 image ‘’CorrCy3’.\n20. Input (primary) objects > Select ‘Nuclei’. These were identified by Identify Primary Object module.\n21. Insert the name of objects to be identified > ‘FullDoughnut’.\n22. Select > ‘Distance- B’ as method to identify the secondary objects.",
    "By selecting Distance as the method to identify the secondary objects (‘Full Doughnut’), the primary object (nucleus) is expanded to identify a ‘doughnut’ (or ‘annulus’)−shaped region in the cell, usually in the cytoplasm. CellProfiler provides two methods of identifying the secondary object. The first, ‘Distance-N’, does not utilize staining intensity in the image of the second stain, in this instance Cy3. This entails expanding the nucleus a set distance. However, this may include areas of image background as well as cell cytoplasm. Our protocol, on the other hand, utilizes the ‘Distance- B’ method. This second ‘Distance’ method expands the nucleus a set distance; however, this method uses the thresholding of the secondary staining image to eliminate background regions. Thus, the nucleus is only expanded into areas of foreground staining intensity to identify the ‘Full Doughnut’ secondary object without including background image regions.\n23. Select > ‘Automatic’ threshold method.\n24. Input > ‘25’ as number of pixels to expand the primary object (nucleus).\n25. Fill holes > Select ‘Yes’.\n26. Discard Objects touching the border of the image > Select ‘Yes’.\n27. Retain outlines of the identified secondary objects > Select ‘No’.",
    "The ‘Automatic’ thresholding method is the default setting in CellProfiler, and is robust. As this strategy is automatic, it does not allow users to select the threshold algorithm or to apply additional corrections to the threshold. The ‘Automatic’ strategy calculates the threshold using maximum correlation thresholding (MCT) for the whole image. The threshold is then applied to the image and smoothed using a Gaussian filter with a sigma of 1. The Gaussian filter method convolves the image with a Gaussian whose full width at half maximum is the artifact diameter entered. The effect of this is to blur features smaller than the entered artifact diameter and spread bright or dim features larger than the entered artifact diameter. The MCT method is described by Padmanabhan, Eddy, and Crowley (2010[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-bib-0018]) as computationally efficient and accurate without relying on assumptions of the statistics of the image. This algorithm has been tried and tested on neuroscience images in the presence and absence of illumination correction to accurately aid in automated image analysis (Padmanabhan et al., 2010[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-bib-0018]).\nIdentify tertiary objects: cell cytoplasm or true doughnut\nFollowing the identification of the ‘Full Doughnuts’ (secondary objects), the Identify Tertiary Objects module is then used to remove the smaller objects (nuclei) from the larger secondary objects (Full Doughnuts) to leave a ring shape around the nucleus, referred to here as ‘True Doughnut’.\nTo identify tertiary objects (ring-shaped ‘True Doughnuts’):\n28. Select > ‘Identify Tertiary Objects’ module.\n29. Select > ‘FullDoughnut’ as larger identified objects (Output from Identify Secondary Object module).\n30. Select > ‘Nuclei’ as smaller identified objects (Output from Identify Primary Object).\n31. Select > ‘Yes’ to shrink smaller objects prior to subtraction.",
    "Nuclei will now be subtracted from Full Doughnut area to produce a ring-shaped ‘True Doughnut’ in the peri-nuclear region of the identified SN4741 cells. By selecting ‘Yes’ to shrink the smaller object, the nucleus is shrunk by 1 pixel before subtracting the objects. This ensures that a tertiary object is produced. Measurements such as area and fluorescence intensity of the segmented area can be acquired subsequently.\nIdentify secondary objects: SN4741 cell body\nFollowing the identification of SN4741 nuclei using Identify Primary Object module, the Identify Secondary Object module is used again. However, this time the module and method must find the edge of SN4741 cell bodies as secondary objects using cell body−specific Cy3 staining intensity. Again, this module involves a thresholding step that assigns pixels in the input image to foreground and background. To identify cell body:\n32. Select > ‘Identify Secondary Objects’ module.\n33. Input Image > Selects ‘CorrCy3’.\n34. Select > Input Objects ‘nuclei’ (identified in Identify Primary Object module).\n35. Input > 'CellBody’ as name for identified objects.\n36. Select > ‘Propagation’ as method to identify secondary objects.\n37. Select > ‘Automatic’ as threshold method.\n38. Input > ‘0.00’ as regularization factor.\n39. Select > ‘No’ to fill holes in identified objects.\n40. Select > ‘Yes’ to discard objects touching the image border.\n41. Select > ‘Yes’ to discard associated primary objects.\n42. Select > ‘No’ to retain the outlines of the identified secondary objects.\nIdentify tertiary objects: SN4741 cytoplasm\nThe Identify Tertiary Objects module subtracts the shape of the smaller object (nucleus) from that of the larger identified object (i.e., cell body). Once removed, the segmented area identified is the cell cytoplasm. See Figure 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-fig-0006].\nTo identify MitoHealth-stained SN4741 cytoplasm using CellProfiler modules:\n43. Select > Identify Tertiary Objects module.",
    "44. Select > ‘Cell Body’ as input for larger identified objects.\n45. Select > ‘Nuclei’ as input for smaller identified objects.\n46. Input > ‘Cytoplasm’ as name for tertiary objects to be identified.\n47. Select > ‘Yes’ to shrink smaller object. This ensures that a cytoplasm is outlined around each nucleus.\n48. Select > ‘No’ to retain outlines of tertiary objects, as these will not be utilized downstream.\nSee Figure 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-fig-0007].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/69711254-8239-4292-85c3-e158d4a111c6/cpns105-fig-0006-m.jpg</p>\nFigure 6\nIdentify SN4741 cell body as secondary object. (A) Shows the input illumination-corrected 40× magnification Cy3 channel image. (C) Illustrates the result of propagation method of identifying cell (body) edge with respect to Cy3 image staining intensity thresholding. Identified secondary objects/cell bodies are illustrated in the form of colored masked objects. Image (E) shows the input Cy3 channel image with identified cell body outlines in magenta and nuclei outlines in green. Dashed white line box in (E) highlights the area enlarged to produce image (F). White box in image (F) indicates enlarged area to produce image (G). Images (F) and (G) were generated to illustrate image segmentation. Dashed white line boxes in (A) and (C) highlight areas that are enlarged and illustrated in (B) and (D), respectively. Images (A-G) are micro pictograms acquired and saved from the CellProfiler software.\nEnhance mitochondrial speckles\nThe Enhance or Suppress Feature module is a CellProfiler module that suppresses or enhances selected image features such as speckles, ring shapes, and neurites to improve the subsequent object identification by an ‘Identify’ module. In this case, it is used to enhance the punctate mitochondrial staining by applying image processing filters to the input image and giving a grayscale image output. Following the execution of this module, the ‘Identify Primary Object’ module is used again to identify mitochondrial puncta.",
    "49. Select > ‘CorrCy3’ as input image (image is illumination function corrected).\n50. Input > ‘FilteredRed’ (or other user-defined name) for output grayscale image.\n51. Select > ‘Enhance’ as operation type.\n52. Select > ‘Speckles’ as feature type to be ‘Enhanced’.\n53. Input > ‘20’ as feature size.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/de582ff4-bafd-416e-b739-4ee3e8bae89f/cpns105-fig-0007-m.jpg</p>\nFigure 7\nIdentify SN4741 cytoplasm as tertiary object. Images (A), (C), and (F) illustrate the masked image result of sequential steps/modules from identification of primary object (Nuclei), identification of secondary object (cell body), and identification of tertiary object (cell cytoplasm), respectively. SN4741 cytoplasm is the result of removing the Nuclei areas from the areas of entire cell bodies. Micro pictograph (G) highlights the outlines of the resulting SN4741 cell cytoplasm. Dashed white boxed-in images (A), (C), (E), and (G) indicate the areas that have been enlarged for illustrative purposes and are represented by images (B), (D), (F), and (H), respectively. Images (A-H) are micro pictograms acquired and saved from the CellProfiler software.\nIdentify primary objects: mitochondrial fragments (also see Fig. 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-fig-0008])\nThis step utilizes the Identify Primary Objects module to identify the mitochondrial puncta in the images enhanced in steps 49 to 53. To identify mitochondrial puncta in enhanced 40× objective Cy3-channel images of MitoHealth-stained SN4741 cells:\n54. Select > Identify Primary Objects module.\n55. Select > FilteredImage (output image from previous module) as input image.\n56. Input > ‘Puncta’ (or other user-defined name) to assign to identified objects.\n57. Select object diameter range > Min = 2; Max = 35.\n58. Select > ‘Yes’ to discard objects outside the diameter range.\n59. Select > ‘Yes’ to discard objects touching the border of the image.\n60. Select > ‘Per Object’ as Thresholding strategy and ‘Otsu’ as thresholding method.\n61. Select > ‘Cytoplasm’ (previously identified tertiary objects) as masking objects.",
    "62. Select > ‘Three classes’ thresholding and minimize the ‘weight variance’.\n63. Assign> Middle intensity pixels to ‘Foreground’.\n64. Select > ‘Automatic’ smoothing method for thresholding.\n65. Input > ‘1.0’ as Threshold correction factor with ‘0.001’ lower and ‘0.005’ as upper bounds on threshold.\n66. Select > ‘No’ to automatically calculate size of smoothing filter for object de-clumping.\n67. Input > ‘5’ as size of smoothing filter.\n68. Select > ‘No’ to automatically calculate allowed distance between local intensity maxima.\n69. Input > ‘5’ to suppress local maxima that are closer than this minimum allowed distance.\n70. Select > ‘No’ to retain outlines of identified puncta.\n71. Select > ‘Never’ to fill holes in identified objects.\n72. Select > ‘Continue’ for handling of an excessive number of identified objects, as puncta are small, and therefore the number of puncta identified per image is usually high.\nSee Fig. 9[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-fig-0009]. At this stage in the construction of the CellProfiler analysis pipeline, we have identified nuclei, cell body, mitochondrial fragments, cytoplasmic areas, and peri-nuclear regions. Now that these cellular compartments have been identified using this CellProfiler pipeline, we must select which measurements and data to extract from our digital images using a set of measurement modules.\nMeasure object size and shape\nAlthough the Measure Object Size and Shape module can measure a vast array of shape and area features, we use this module to measure object size (area in pixels) of each cells’ mitochondrial puncta, cytoplasm, and true doughnut with respect to the CellProfiler pipeline.\nTo measure size and shape of object using Measure Object Size and Shape:\n73. Select > Measure Object Size and Shape module.\n74. Select > ‘Cytoplasm’, ‘Puncta’, or ‘True Doughnut’, or any combination of identified objects.",
    "Specific shape or size measurements (e.g., area) to output into a spreadsheet are defined in a later module. This module simply selects which objects the measurements should be taken from.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/7a28d067-f843-4537-8bc8-006e48c4d637/cpns105-fig-0008-m.jpg</p>\nFigure 8\nEnhance mitochondrial fragments and identification. (A) Shows an input ‘CorrCy3’ image prior to speckle enhancement. (B) Shows image (A) post-enhancement module. Dashed white line boxes in (A) and (B) highlight the area displayed in (C) and (D), which are pre− and post−enhancement module, respectively. (E) illustrates enlarged input image outlined in solid white box in (D); these illustrate outlined mitochondrial puncta (F); and marks of identified objects (G) seen in the enhanced image (E).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/5e271386-53a7-44fd-9fe7-1aa50e8e7635/cpns105-fig-0009-m.jpg</p>\nFigure 9\nIdentification of mitochondrial puncta Images illustrating mitochondrial puncta identified with automated image analysis CellProfiler pipeline. Image (A) is an example input image to the Identify Primary Objects module. (B) Illustrates the outlines of identified mitochondrial puncta, and (C) shows object masks of identified mitochondrial puncta. Dashed boxes on (A), (B), and (C) indicate where the CellProfiler zoom function has been utilized to generate images (D), (E), and (F), respectively, for illustrative purposes.\nMeasure object intensity: true doughnut or cytoplasm\nTo measure the intensity of identified objects, we use the Measure Object Intensity CellProfiler module. To do so:\n75. Select > ‘CorrCy3’ illumination corrected image as image to measure.\n76. Select > ‘True Doughnut’ or ‘Cytoplasm’ (or other object) identified in previous modules to measure.\nA CorrCy3 image, as opposed to a Raw Image, is selected to acquire intensity measurements, as this image previously undergoes illumination correction during the pre-processing stage. Specific object intensity measurements (e.g., mean, median, minimum, maximum intensity) to output into a spreadsheet are defined in a later module. This module simply selects which objects the measurements should be taken from.",
    "Relate objects: assign mitochondrial fragments to cell cytoplasm\nThe Relate Objects CellProfiler module is used here to assign a relationship between ‘child’ objects (e.g., puncta) and ‘parent’ objects (e.g., cytoplasm). This module can be utilized in order to count the number of puncta per SN4741 cell cytoplasm and calculate a mean measurement value for all ‘child’ objects that are associated with each ‘parent’ object. Objects (e.g., mitochondrial puncta) are considered ‘children’ of a ‘parent’ object (e.g., a cell cytoplasm) if the ‘child’ object is found within or at the edge of a ‘parent’ object. To assign the relationship between mitochondrial puncta and a cell cytoplasm:\n77. Select > ‘Puncta’ as input child objects (identified in second Identify Primary Objects module).\n78. Select > ‘Cytoplasm’ as input parent objects (Identified in Identify Tertiary Objects module).\nMask objects to relate puncta to cytoplasm of origin\nThe Mask Objects module hides regions of the input that are not regions of interest. This aids in the assignment of puncta to a cell cytoplasm of interest and allows for cell-by-cell puncta counts. In this example, only SN4741 cell cytoplasm is selected as a region of interest, and subsequently aids in exporting the Parent-Child (Cytoplasm- Puncta) data in the Export to Spreadsheet module that follows. To create a mask from previously identified objects (i.e., cytoplasm):\n79. Select > ‘Filtered Red’ (the output of Enhance or Suppress Features module) as input image.\n80. Input > ‘Mask Red’ as (user defined) name for output image.\n81. Select > ‘Objects’ and ‘Cytoplasm’ to select object (cytoplasm) for mask.\n82. Select > ‘No’ to invert mask to ensure mask is produced from the foreground area within the masking objects (cytoplasm).\nExport to spreadsheet: output data into MS Excel spreadsheet",
    "The final module in these CellProfiler protocols is the Export to Spreadsheet. Here, we assign a folder/file destination and name for the output data.\n83. Select > ‘Elsewhere’ and then ‘browse’ for desired output file location.\n84. Select > ‘Yes’ to add prefix to file output file name.\n85. Input > ‘Name’ (user-defined) prefix for output filename (e.g., MitoMMP or MitoPuncta).\n86. Select > ‘No’ to overwrite without warning (does not affect protocol—decided by end user).\n87. Select > ‘No’ to add metadata columns to object data file (does not affect protocol).\n88. Select > ‘Yes’ to limit output to a size that allowed in Excel. If ‘No’ is selected, then upon exceeding the limit on the Excel spreadsheet, the pipeline will be terminated without data outputted.\n89. Select > ‘NaN’ to represent data points that are numerical values as ‘infinite’ or ‘undefined’ in the output spreadsheet.\n90. Select > ‘Yes’ to select the measurements to export. The user can define which data are outputted to spreadsheet. By selecting ‘No’, all data types will be outputted.\n91. Select the following data outputs from the ‘select measurement to export’ drop-down box.\n92. To export number of nuclei (cell count) and puncta per image:\n         \nImage > Count > Nuclei\nImage > Count > puncta.\n93. To export area of the objects true doughnut and cytoplasm:\n         \nTrue Doughnut > Area Shape > Area\nCytoplasm > Area Shape > Area.\n94. To export intensity of MitoHealth staining intensity in SN4741 peri-nuclear area:\n         \nTrue Doughnut > Intensity > Mean Intensity.\n95. To export cell-by-cell puncta counts:\n         \nCytoplasm > Children > Puncta > Count.",
    "Select > ‘Yes’ to calculate the per-image mean values for object measurement. CellProfiler will calculate mean intensity, mean area, mean number of puncta per cell, etc., for each image, which will then be exported into the spreadsheet. Median and standard deviation measurements per image can also be calculated if desired.\nFile > Save Project As > input user defined project name. This saves the CellProfiler image-analysis pipeline for future use.\nThe CellProfiler protocol can now be opened and used on image set.\n96. To allow modules to run in sequence in an automated fashion, select:\nFile > Analyze Images. A spreadsheet will be populated and saved as an output upon termination of all executable algorithms/modules in the CellProfiler pipeline. This pipeline can be applied to experimental repeats.\nOnce these CellProfiler pipelines (CellProfiler Pipeline: Measuring Mitochondrial Membrane Potential; and CellProfiler Pipeline: Measure SN4741 Mitochondrial Fragmentation) have been constructed, it is then possible to automate image analysis for hundreds or thousands of image\nTable 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpns.105#cpns105-tbl-0002] contains the names and functions of the CellProfiler algorithm modules used in the above protocol(s).\nTable 2.\n                CellProfiler Modules and Functions\ntable:\n﻿CellProfiler module,Function\nCorrect illumination calculate,\"Calculates an illumination function that is used to correct uneven illumination/lighting/shading, or to reduce uneven background in images\"\nCorrect illumination apply,\"Applies an illumination function, usually created by Correct Illumination Calculate, to an image to correct for uneven illumination (uneven shading)\"\nIdentify primary objects,\"Identifies biological components of interest in grayscale images containing bright objects on a dark background (e.g., nuclei or speckles)\"\nIdentify secondary objects,\"Identifies objects (e.g., cell body) using objects identified by another module (e.g., nuclei) as a starting point, or seed\"\nIdentify tertiary objects,\"Identifies tertiary objects (e.g., cytoplasm) by removing smaller primary objects (e.g., nuclei) from larger secondary objects (e.g., cell body), leaving a ring shape\"",
    "Enhance or suppress features,\"Enhances or suppresses certain image features (e.g., speckles, ring shapes, and neurites), which can improve subsequent identification of objects (such as mitochondrial fragments)\"\nMeasure object size and shape,Measures several area and shape features of identified objects\nMeasure object intensity,Measures several intensity features for identified objects\nRelate objects,\"Assigns relationships; all objects (e.g., speckles) within a parent object (e.g., nucleus) become its children\"\nExport to spreadsheet,Exports measurements into one or more files that can be opened in Excel or other spreadsheet programs"
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}