{
  "id": 18191,
  "origin_website": "Jove",
  "title": "Novel Diagnostics in Revision Arthroplasty: Implant Sonication and Multiplex Polymerase Chain Reaction",
  "procedures": [
    "This study was approved by the local ethics committee (046/09, Rev. 3). Informed consent and data privacy statement were obtained from all patients included.\n1. Joint Aspiration\nNOTE: The procedure should be performed in a surgical theater or an intervention room with comparable aseptic conditions. Assistance by a nurse or doctor's assistance is helpful but not mandatory.\nPosition the patient in supine position on an examination bed. Ensure that the joint of interest is free of clothing. Shorten dense or long body hair using electric clippers. Do not remove body hair with a razor. Position a fluoroscope in anteroposterior direction if the hip joint is to be punctured. If the knee is to be punctured, place a knee roll under the patient's knee such that the knee rests in a slightly flexed position13.\nPrepare an instrument table with the following sterile equipment: sterile swabs, a fenestrated sterile cover drape, a disposable sterile scalpel, pointed surgical blade (type #11), and sterile 10 mL syringe with sterile cannula (20 gauge, 80 mm). Set out alcoholic skin disinfectant, blood collection tubes and a pediatric blood culture flask separately.\nDress in a surgical gown, hood and mask, and put on sterile gloves.\nThoroughly wash the patient's skin at the puncture site (e.g. superior recessus14 for the knee and anterolateral portal area for the hip) with a skin disinfectant.\n\tNOTE: Mind the required exposure time for the disinfectant used (usually 90 s at the knee, 120 s at the hip for alcoholic disinfectants).\nCover the puncture site with a fenestrated sterile cover drape. Identify the puncture site.",
    "NOTE: For the knee, the correct site is 2 cm above the upper patella pole and 2 cm lateral to the lateral facet. For the hip, find the anterior superior iliac spine and move caudally until in line with the upper symphysis. Ensure that the site is lateral to the femoral artery (approximately 4 cm), which can always be palpated15.\n\t\nMake a small stab incision through the skin (3 - 4 mm wide and deep) with the pointed scalpel blade at the puncture site. Do not apply local anesthetics as they may cause false negatives in the microbiological culture, due to their bacteriostatic effect.\nAttach the cannula to the Luer slip of the syringe. Insert the cannula through the stab incision. At the superior recess of the knee joint, aim at a 45° angle dorsal and medial, towards the recess below the top pole of the patella, and insert the needle to a depth of approximately 5 cm. Aspirate the joint fluid by drawing out the syringe's piston.\nUse fluoroscope guidance when puncturing a hip joint. Insert the needle at the puncture site, aiming medially at a 60° angle. In the fluoroscope, ensure that the tip of the needle is pointed at the prosthesis neck. Advance the cannula to a depth of approximately 8 cm (deeper in adipose patients) while aspirating, until joint fluid is attained. Hold the needle in position while aspirating, to avoid scraping of the prosthesis surface.\n\t\tNOTE: Contact of the needle tip with the prosthesis ensures intraarticular positioning. Usually, no more than 5 mL of fluid can be aspirated form a hip joint, a knee joint will yield more than 10 mL.",
    "After removal of the cannula, apply a sterile wound dressing to the stab incision. To prevent hematoma formation, apply a bandage to the leg with slight compression. \nTransfer the collected joint aspirate into the sample containers. Ensure sterile working techniques throughout.\nFor inoculation of the pediatric blood culture flask with the aspirated joint fluid, disinfect the membrane of the pediatric blood culture flask with alcoholic disinfectant. Put a fresh cannula onto the syringe and inject 1 to 3 mL of aspirated joint fluid into the blood culture flask. Mix by gentle agitation or rotation16.\nFor preparation of a native joint aspirate specimen, remove the cannula from the syringe. Open a blood collection tube without additives and inject 1 mL of aspirate into this collection tube. Replace and fasten the lid for PCR analysis.\n\t\tNOTE: Ship the sample to the microbiology lab without delay for PCR analysis. From the same sample, conventional microbiological aerobic and anaerobic cultures can also be set up17.\nTransfer 1 to 4 mL of the joint aspirate into a blood collection tube containing EDTA for cell count and differentiation2. Ship the sample to a biochemistry lab without any delay.\n2. PCR Diagnostics\nMake sure all three devices (the lysator, the analyzer, and the cockpit; see the Table of Materials) are up and running correctly. Set out all supplies needed for performing the test (the PCR cartridge, a master mix tube, the sample tube and sample tube cap, a 0 - 200 µL micropipette, and sterile pipette tips) on the working bench.\nDefrost the master mix tube before starting the procedure, by setting it out at room temperature. All consumables (master mix tube, cartridge, and sample tube) are already prelabeled with a barcode.",
    "Remove the cap of the sample tube. Take 180 µL of the collected specimen (either joint aspirate, see section 1; or sonication fluid, see section 4) with a pipette and transfer it into the sample tube. Close the sample tube with the sample tube cap containing protein kinase K and an internal control gene for the quality control of the entire workflow.\nAt the cockpit, open the operating software by touching the \"new test\" button in the lower left corner. Enter the patient's data or a sample ID via the touchscreen. To select the specimen, first choose \"ITI-Cartridge\" from the dropdown, then \"Orthopedics\" as application mode, and finally select \"synovial fluid\" or \"sonication fluid\" as sample type. Press the start button.\nScan the barcode on the bottom of the sample tube. Insert the sample tube into the lysator.\n\tNOTE: The lysis process will start automatically and take approximately 30 min to finish. Countdown of the timer on the lysator screen will indicate when the lysis is finished.\nSelect the sample on the cockpit screen to unlock the sample tube from the lysator. Remove the sample tube from the lysator and close the lysator's top cover. Transfer the sample tube into the sample tube slot of the PCR cartridge. Insert the defrosted mastermix tube into the mastermix slot of the PCR cartridge.\nFollow the instructions on the cockpit monitor, scanning the PCR cartridge with mastermix and sample tube.\nInsert the PCR cartridge into the indicated cartridge slot of the analyzer. When done, the analyzer releases the cartridge.\n\tNOTE: The PCR conditions are preset by the manufacturer and cannot be changed by the user. For further information see the manufacturer's application guide. The PCR process will start automatically and take approximately 4 h 10 min.",
    "Remove and discard the cartridge. At the cockpit touchscreen, choose \"current tests\" in the lower left corner, then pick the correct sample ID to display the test results. Save the results on the machine's memory, and print or export (via USB drive) for further reference.\n\tNOTE: Report the result of the PCR, including pathogen identification and detection of resistance markers, to the surgeon without delay. A panel with 114 deoxyribonucleic acid (DNA) targets of bacterial and fungal pathogens typically found in implant infections and soft tissue infections, along with the most common antibiotic resistance markers is analyzed.\n3. Surgical Procedure: Intraoperative Sample Collection\nNOTE: Revision arthroplasty surgery requires an expert level of skill and expertise; for a comprehensive overview of the surgical procedures, please refer to surgeon's textbooks18. A full and detailed description of the surgical procedure would be well beyond the scope of this article. Here the focus is on the details of the sample collection and pre-analytics. In revision arthroplasty surgery, refrain from administration of a single shot antibiotic prophylaxis, as not to compromise the results of the microbiological samples obtained during surgery. Adhering to this rule is recommended, though this practice is controversial19,20. Use the existing surgical approach to the joint whenever possible. Additional surgical approaches will compromise soft tissues and increase scar formation.\nDissect tissue until the joint capsule is well exposed. Perform the arthrotomy with a syringe at the ready, so further joint fluid can be collected into the sterile syringe for further analysis as stated above (steps 1.7.1-1.7.3).\n\tNOTE: No antiseptic lavage fluids must be used until the implant is removed and tissue samples have been taken.\nRemove the joint implants. Immediately after removal, transfer the implant parts into a sterile plastic container with an air- and water-tight lid.",
    "NOTE: Detailed instructions for implant removal can be found in the textbook literature (Knee, e.g.: Wirtz et al., Chapter 16.421; Hip, e.g.: Claes et al., Chapter 14.5.122). Specific instruments may be necessary, as stated by the manufacturers' instructions. The implant removal technique varies considerably between different implant types and fixation methods. A set of chisels and drills, a sliding hammer and a universal intramedullary nail removal set are helpful in removing bony integrated implants23,24.\nUse a sterile sharp curette, forceps and rongeur to remove the membrane tissue from the bone-implant interface. Transfer a representative sample of the tissue into a sterile plastic container with a screw-on lid, as specimens for microbiology and histology.\n\tNOTE: A reamer can be used to clear the medullary canal of all soft tissues. Also, take synovial tissue and articular capsule samples for examination and store them in sterile containers. At least four specimens in total must be gathered.\nSend all samples and explanted parts to the microbiology lab instantly.\n\tNOTE: Antibiotics can then be given. The choice of the correct antibiotics is essential and must be an individualized decision25,26. Therapeutic concepts must be decided on by an interdisciplinary panel of surgeons and microbiologists beforehand.\nComplete the debridement of the former implant site by removing any tissue that shows signs of debris (such as polyethylene wear, metal or cement particles) or infection and necrosis (purulent, avascular, fibrin-coated, membranous or \"sludgy\" tissues). Remove any dead or osteitic bone. Remove all foreign material such as screws, wires, cerclages, bone cement debris or non-resorbable sutures (see Claes et al., Chapter 14.5.322).",
    "Irrigate the surgical site using a wound disinfectant of choice using a 50-mL syringe. Irrigate with ample amounts (at least 3 L) of ringer solution with a pulsed lavage system. A spacer may be necessary to stabilize the joint27.\nClose the wound using antimicrobial-coated resorbable deep sutures for the capsule or fascia (braided polyglactin sutures, triclosan-coated, USP 2), and subcutaneous tissue (braided polyglactin sutures, triclosan-coated, USP 0). Close the skin using non-resorbing interrupted sutures (monofilic polypropylene, USP 0 or USP 2-0).\n4. Sonication\nNOTE: Be careful to work strictly aseptically. Use a Class II biosafety bench with laminar air-flow for further processing of the explanted material.\nOpen the plastic container holding the explanted prosthesis from the operating room (see step 3.2) under a laminar air-flow working bench, and add sterile 0.9% sodium chloride solution until the explanted foreign body is covered at least 80% (approx. 500-800 mL).\nClose the plastic container. Shake thoroughly or agitate the plastic container using a vortex mixer on high intensity for 30 s. Transfer the plastic container into the sonication bath. Check the fluid level in the sonication bath.\n\tNOTE: The sonication bath fluid level must be the same as inside the plastic container. Ensure that the plastic container cannot be flooded and if necessary add or remove liquid from the sonication bath.\nSonicate the specimen for 5 min with a frequency of 40 ± 2 kHz and power density 0.22 ± 0.04 W/cm2. Shake or vortex the specimen thoroughly for 30 s.\n\tNOTE: Sonication times between 1-5 min are best for dissolving biofilms, without any influence on bacterial viability28.\nInside the laminar flow bench, collect 50 mL of the sonication fluid and transfer it to a sterile, tightly-sealed tube.",
    "To create a concentrated sonication fluid, centrifuge the tube for 10 min at 4,200 x g. Leaving a residual volume of 10 mL, discard the remaining supernatant with a pipette. Resuspend the pellet by pipetting and vortexing.\nInoculate suitable culture media (e.g. blood agar, chocolate agar, Sabouraud agar, Schaedler's agar, Kanamycin-Vancomycin agar, or thioglycolate broth) with 0.5 mL of concentrated sonication fluid each. Inoculate the pediatric blood culture flask with 2 mL as described above (see step 1.7.1). Transfer 1 mL of concentrated sonication fluid into a blood collection tube without additives for PCR analysis.\nTransfer the inoculated culture media to the incubator (35 °C, 5% CO2). Incubate the cultures for 14 days, and check for growth daily.\nAfter 14 days, discard the cultures with no growth and report as negative. If growth is detected, carry out pathogen identification using standard identification techniques and susceptibility testing. Report the result to the surgeon without delay.\n\tNOTE: Here, identification of pathogens was carried out using Matrix-assisted LASER desorbtion/ionization - time of flight (MALDI-TOF) spectroscopy. Antimicrobial susceptibility testing was performed with a semiautomated analyzer29,30,31."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}