{
  "id": 12149,
  "origin_website": "Jove",
  "title": "Analysis of Cancer Cell Invasion and Anti-metastatic Drug Screening Using Hydrogel Micro-chamber Array (HMCA)-based Plates",
  "procedures": [
    "1. HMCA Plate Embossing\nNOTE: The complete process for the design and fabrication of polydimethylsiloxane (PDMS) stamp and HMCA imaging plate used in this protocol is described in detail in our previous articles15,16. The PDMS stamp (negative shape) is used to emboss the HMCA (positive shape) which consists of approximately 450 MCs per well (Figure 1A). As demonstrated in Figure 1B, each of the MCs has a shape of a truncated upside-down square-shaped pyramid (height: 190 µm, small base area: 90 µm x 90 µm, and large base area: 370 µm x 370 µm). The HMCA plate is used for the preparation and culturing of 3D tumor spheroids and thereafter, for invasion assay. Alternatively, a commercial stamp could be used for HMCA production.\nPrepare a solution of 6% low melting agarose (LMA). Insert the LMA powder and sterile phosphate buffered saline (PBS) (0.6 g of LMA per 10 mL of PBS) into a glass bottle with a magnetic stirrer. Place the bottle on a heating plate and stir the solution while heating to 80 °C for a few hours until a uniform solution is achieved. Keep the solution at 70 °C until use.\nPre-heat the PDMS stamp to 70 °C in the oven. Keep it warm until use. Alternatively, use a commercial stamp and follow the instruction.\nPlace the commercial 6-well glass-bottom plates on a dry bath pre-heated to 75 °C. Wait a few minutes until the plate is totally warm.",
    "Pour a drop (400 µL) of pre-heated LMA onto the glass bottom of each one of the wells in the plate. Gently place the pre-heated PDMS stamp over the agarose drop. Incubate at room temperature (RT) for 5–10 min for pre-gelling and pre-cooling. Incubate at 4 °C for 20 min to achieve full agarose gelation. Then, gently peel off the PDMS, leaving the agarose gel patterned with MCs.\n\tNOTE: This step is done simultaneously in all the wells.\nPlace the embossed plate in a light curing system equipped with ultraviolet (UV) lamp, and incubate for 3 min.\n\tNOTE: Now the HMCA plate is UV sterilized.\nFill the macro-wells with sterile PBS to ensure that they are kept humid, then cover the plate, wrap it with parafilm and store it at 4 °C until use.\nBefore use, empty PBS residuals from the HMCA plate. Place it in the biological hood.\n2. Loading Cells and Spheroid Formation\nCollect the cells as follows: remove all medium from a 10 cm culture plate cell monolayer, wash twice with 10 mL of PBS to dispose of serum residuals, add 5 mL of trypsin (pre-warmed to 37 °C) and incubate for 3 min in the incubator at 37 °C. Then, shake the plate gently to ensure monolayer detachment, add 10 mL of complete medium (pre-warmed to 37 °C) and pipette up and down until homogenous cell suspension is achieved. Centrifuge and wash the cell suspension with 15 mL of fresh medium, then, suspend at appropriate concentrations in fresh complete medium.\nGently load the cell suspension (50 µL, 150–360 x 103 cells/mL in medium, ~16–40 cells per MC) on top of the HMCA and allow the cells to settle by gravity for 15 min.",
    "Gently add 6–8 aliquots of 500 µL fresh medium (total 3–4 mL) to the rim of the macro-well plastic bottom outside the ring and hydrogel array.\nIncubate HeLa cells for 72 h and MCF7 cells for 48 h at 37 °C and 5% CO2, in a humidified atmosphere for the formation of spheroids.\n3. Viability Detection by Propidium Iodide (PI) Staining\nPrepare a stock solution of PI (500 µg of PI per 1 mL of PBS). Keep it at 4 °C for about 6 months. Freshly prepare a dilution of 1:2,000 (0.25 µg/mL), by the addition of 6 µL of stock to 12 mL of complete medium without phenol red, for the 6-well HMCA plate (2 mL per well).\nTransfer the HMCA plate with 48-72 h spheroids, from the incubator to the biological hood. Remove all medium from the HMCA by leaning the tip end on the edge of the macro-well plastic bottom beside the hydrogel array, leaving the array tank filled with medium.\nGently add 2 mL of PI dilution from Step 3.1 to each well, by leaning the tip end on the edge of the macro-well plastic bottom. Incubate the HMCA plate for 1 h at 37 °C and 5% CO2, in a humidified atmosphere. Continue to Step 7.\n\tNOTE: Other dyes could be used here as well, for example, Hoechst for nucleus staining, tetramethylrhodamine methyl ester (TMRM) for mitochondrial membrane potential staining, fluorescein diacetate (FDA) for live cells detection, Annexin V for apoptosis detection and others.\n4. Collagen Mixture Preparation\nPrepare sterile double distilled water (DDW) by autoclave and a stock of 100 mL of 1 M NaOH filter-sterilized solution. Maintain the materials at RT, and the tips used for collagen mixture preparation frozen at -20 °C, until use.",
    "10–20 min before use, place all intergrades including: sterile DDW, 1 M NaOH sterile solution, sterile 10x PBS, type I collagen from rat tail (stored at 4 °C for 3– months) and a sterile tube into the ice bucket until totally cooled. Place the ice bucket inside the biological hood.\nPrepare 1,800 µL of collagen mixture at a final concentration of 3 mg/mL, for 6-well HMCA invasion assay plate (300 µL per well) as follows. Add the intergrades into the cooled tube in the following order: 515 µL of DDW, 24.8 µL of 1 M NaOH and 180 µL of 10x PBS. Mix well by vortex and place back into the ice. Finally, add 1080 µL of collagen to the mixture, vortex again and put back into ice.\n5. HA and Collagen Mixture Preparation\nDissolve 10 mg of HA in 2 mL of sterile DDW. Incubate the mixture at RT for a few minutes and vortex gently until the powder is totally dissolved. Store the stock solution at 4 °C for up to two years.\nRight before use, place the HA stock solution in the ice bucket inside the biological hood.\nPrepare a 3 mg/mL collagen mixture as described in Step 4. Add 36 µg (7.2 µL) of HA into 1,800 μL of ready to use collagen mixture, for a final concentration of 20 µg/mL. Then, vortex again briefly and put back into ice.\n6. ECM Mixture Addition\nTransfer the HMCA plate, with 48–72 h spheroids, from the incubator into the biological hood and place it on the ice. Incubate for 10 min until the plate is cooled. Pre-heat a solution of 1% LMA to 37 °C in a water bath.",
    "Remove all medium from around the HMCA, by leaning the tip end on the edge of the macro-well plastic bottom beside the hydrogel array. Then, very carefully, remove all medium from the array tank with a fine tip/gel loading tip, by leaning the tip end on the array edge, gently and slowly sucking all medium out.\n\tNOTE: After removing all medium from around the hydrogel array, the array tank is still filled with medium. This medium has to be removed very gently in order to avoid destruction of the hydrogel MC and dislocation of spheroids.\nTake 150 µL of the collagen mixture or HA and collagen mixture (ECM mixture) with the pre-frozen fine tip and add into the array tank by attaching the tip to the array edge. Release the mixture slowly to avoid spheroid dislocation. Repeat this step with another aliquot of 150 µL, for a total 300 µL per well. Follow the same procedure for each well until all wells are filled. Then place the plate into the incubator for 1 h for the full gelation of the ECM.\nAfter the full gelation of ECM has been achieved, pipette 400 µL of pre-warmed 1% LMA on top of the ECM gel. Cover the plate with its lid, incubate the plate at RT for 5–7 min and then for 2 min at 4 °C, for agarose gelation. Finally, gently add 2 mL of complete medium by leaning the tip end on the edge of the macro-well plastic bottom.\n\tNOTE: The agarose layer prevents the detachment of the collagen-gel matrix from the HMCA.\n7. Invasion Assay Acquisition and Analysis\nLoad the HMCA plate onto a motorized inverted microscope stage equipped with an incubator, pre-adjusted to 37 °C, 5% CO2 and humidified atmosphere.",
    "Pre-determine the positions for image acquisition in each well so as to cover the whole array area, and use 10X or 4X objectives (this step is required for the image acquisition software used here, see the Materials Table below for details). Alternatively, use any image acquisition software to facilitate automatic scan of the entire required area, by choosing the \"Stich\" option.\nAcquire bright field (BF) images every 2–4 h for a total period of 24–72 h in order to follow the invasion of cells from the spheroid body into the surrounding ECM.\nAcquire fluorescent images for PI detection by using a dedicated fluorescent cube (excitation filter 530–550 nm, dichroic mirror 565 nm long pass and emission filter 600–660 nm).\nExport time-lapse BF/fluorescent images from the image acquisition software and save them in tagged image file format (TIFF) to a dedicated folder by using the \"Database\" tab in the toolbar and then the \"Export record files\" button.",
    "NOTE: We developed a special in-house analysis code in MATLAB software that includes a designed graphic user interface (GUI) in which invasion analysis could be executed faster and easier. In this analysis code, the segmentation of the spheroids and invasion area is done semi-automatically using Sobel filter followed by the morphological operators Erosion and Dilation. After automatic segmentation of the areas, manual corrections were made where needed for better accuracy. After the segmentation completion, a set of parameters were automatically calculated by the software and exported to an excel file for further manipulation. The list of parameters are: basic spheroid sectional area at time = 0, invasion area of cells connected to spheroid body = main invasion area, area of cells separated from main invasion area, number of cells separated from main invasion area, average distance of invasion from the basic spheroid center of mass to the circumference of the main invasion area and separated cells and collective invasion distance parameter = d (d = √ ((X2 - X1)2 + (Y2 - Y1)2) out of the X and Y spheroid center of mass coordinates, before (X1, Y1) and after (X2, Y2) collective invasion process). Alternatively, image analysis could be done with any other specialized software.\nOpen the GUI and push the \"Load BF\" button. After the image is open, adjust the segmentation parameters (minimum size: >1 and radius close: >1) to achieve a precise segmentation of spheroid and its invasion area, then, press \"Region of interest (ROI) segmentation\" button for execution and a border will appear around each spheroid. If the automatic segmentation is incorrect, press the \"Delete\" or \"Add\" button and make the requested corrections manually. Repeat the same steps for subsequent images.",
    "Press the \"Tracking\" button to number the spheroids and the software will assign the same number for each spheroid in each of the time lapse images. Then, press the \"Measurement\" button, which will generate a spreadsheet with all parameters. Save this spreadsheet as an excel file for further use in results processing and statistics in excel software.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}