{
  "id": 13082,
  "origin_website": "Jove",
  "title": "Generation of Airway Epithelial Cell Air-Liquid Interface Cultures from Human Pluripotent Stem Cells",
  "procedures": [
    "Each of the following steps should be performed using sterile technique in a biosafety level 2 laminar flow hood. All media should be warmed to room temperature (22 °C) prior to being added to cells, except when specifically mentioned otherwise. Each centrifugation step should be performed at room temperature (approximately 22 °C). Figure 1 outlines the schematics of the protocol.\n1. Preparation of required media\nNOTE: See Supplementary File 1 for details.\nBasal Cell Medium\n\t\nPrepare base medium according to the manufacturer's instructions.\nTo every 50 mL of the base medium, add 5 µL of A83-01 (10 mM), 5 µL of DMH1 (10 mM), 50 µL of Y-27632 (10mM), and 100 µL of Primocin (50 mg/mL). Hereafter, this media is termed basal cell medium.\nStore at 4 °C for up to 1 month.\nALI Differentiation Medium\n\t\nPrepare the medium according to the manufacturer's instructions.\nTo every 50 mL of ALI Differentiation Medium, add 100 µL of Primocin (50 mg/mL).\nStore protected from light at 4 °C for up to 1 month.\nSort Buffer\n\t\nFor every 50 mL of Sort Buffer, combine 47.5 mL of Hanks' Balanced Salt Solution, 1 mL of FBS, 200 µL of EDTA (500 mM), 1.25 mL of HEPES Buffer (1 M), 50 µL of Y-27632 (10 mM), and 100 µL of Primocin (50 mg/mL).\nFilter sterilize using a 0.4 µm pore size.\nStore at 4 °C for up to 1 month.\nCryopreservation Medium\n\t\nFor every 50 mL of Cryopreservation Medium, combine 45 mL of Basal Cell Medium and 5 mL of dimethyl sulfoxide (DMSO).\nFilter sterilize using a 0.4 µm pore size.\nStore at 4 °C for up to 1 month.\n2. Thawing of cryopreserved iBCs",
    "Thaw (on ice) a sufficient volume of 3-D growth factor reduced extracellular matrix (hereafter 3-D matrix). Keep on ice until ready for use.\n\t​NOTE: When thawing one vial (containing 250,000 cells), thaw 100-200 µL of 3-D matrix.\nThaw a vial of previously cryopreserved single-cell suspensions of iBCs by incubating in a 37 °C water or bead bath just until there is no visible frozen media (1-2 min).\nUsing a 5 mL serological pipette, add cell suspension to a 15 mL conical tube.\nAdd 6-10 mL of DMEM/F12 dropwise to the cell suspension, gently mix, and centrifuge at 300 x g for 5 min to pellet the cells.\nAspirate the supernatant and resuspend the cell pellet in 1 mL of Basal Cell Medium with a P1000 micropipette. Remove a 10 µL aliquot and perform a cell count.\nCentrifuge the cells at 300 x g for 5 min. Aspirate the supernatant and resuspend the cells at a density of 4,000 cells/µL in previously thawed 3-D matrix with a P1000 micropipette.\n\tNOTE: It is critical to avoid adding bubbles to 3-D matrix. Pipette the matrix slowly and carefully.\nWith a P200 micropipette, add one droplet (25 or 50 µL) to the base of each well of a 12-well tissue culture treated plate. If starting with 250,000 frozen cells, expected number of droplets at this step is between 3-4 (25 µL droplets), depending on the cell viability.\nIncubate the plate at 37 °C for approximately 15 min, and then add enough Basal Cell Medium to each well to fully submerge the droplet (1.5 mL for 50 µL; 1 mL for 25 µL), using a 5 mL serological pipette. Return the plate to a humidified incubator.",
    "Feed cells every 2 days using fresh Basal Cell Medium. Add fresh medium to the side of the well with 5 mL serological pipette, taking care not to disturb the droplet of cells.\n\t​NOTE: The density of cells plated in this stage is 10-fold higher than routine passaging of iBCs in section 3.\n3. Dissociation of spheroids and expansion of iBCs in 3-D culture\nThaw (on ice) a sufficient volume of 3-D matrix. Keep on ice until ready for use.\n\t​NOTE: The volume of 3-D matrix required will vary on how many cells the user will require.\nApproximately 5-7 days later, aspirate the medium from each well and with a P1000 micropipette, add 1 mL of Dispase II (1 U/mL) directly onto the spheroids to dissociate from the droplet of the matrix.\n\t\nPlace the plate in 37 °C incubator for 10-15 min.\nUsing a P1000 micropipette, pipette the Dispase up and down 1-2 times, breaking up large clumps of 3-D matrix. Return the plate to 37 °C for an additional 30-40 min, allowing the matrix to dissolve completely.\n\t\nWhen the droplet of 3-D matrix is no longer visible under the light microscope, add the freely floating spheroids to a 15 mL conical using a 5 mL serological pipette tip. Add DMEM/F12 for a final volume of 10 mL per conical and centrifuge at 200 x g for 3 min to pellet the spheroids.\nAspirate the supernatant and add 1 mL of 0.05% trypsin (37 °C) for every initial droplet dissociated (e.g., if starting with four droplets, add 4 mL trypsin to the conical flask).\n\t\nIncubate at 37 °C, triturating frequently (every 2-3 min).",
    "Evaluate with the light microscope every few minutes. Once the majority (>90%) of spheroids have been dissociated to single cells, add 10% Fetal Bovine Serum (in DMEM/F12) at a 1:1 volume ratio to the trypsin.\nFilter the cells through a 40 µm cell strainer and centrifuge at 300 x g for 5 min.\nPerform a cell count and evenly resuspend the cells at a density of 400 cells/µL of thawed 3-D matrix. Avoid introducing air bubbles. Resuspend as many droplets as needed for downstream application. Repeat step 2.6-2.9 for each well.\n4. Evaluation and purification of NGFR+ iBCs\nAfter 10-14 days of the most recent passage, dissociate the spheroids to a single cell suspension as in steps 3.2-3.5 and perform a cell count.\n\tNOTE: Different iPSC lines behave differently; therefore, the range of 10-14 days may vary for different iBCs. Please refer to Figure 2 for typical appearances of 3-D iBCs after 1, 4, 8, and 14 days, when they are adequate for NGFR+ cell sorting. Sorting earlier than recommended (e.g., day 8 as in Figure 2C), results in an overall lower cell number with less frequent NGFR expression. Sorting later than recommended (e.g., greater than 14 days after the most recent passage) leads to poor post-sort cell survival.\nResuspend the cells at a density of 1 x 106 cells/100 µL in Sort Buffer (main population). Transfer a small aliquot (25-50 µL) to a separate tube (minor population).\n\t\nAdd conjugated anti-NGFR antibody (1:100 dilution) to the main cell population.\nAdd isotype control antibody (1:200 dilution) to the minor cell population.\nProtect the cells from light and keep on ice for 30 min, intermittently (every 5-10 min) triturating the cells to prevent pelleting.",
    "After 30 min, add the Sort Buffer in a 1:1 ratio to each tube of cells. Centrifuge cells at 300 x g for 5 min.\nAspirate the supernatant, resuspend the pelleted cells in the Sort Buffer at a density of 10 x 106 cells/mL, and add live or dead cell stain.\nUsing appropriate NGFR+ gating strategy (based on isotype control, see Figure 3), sort enough live NGFR+ cells for necessary downstream applications.\n\tNOTE: If using iBCs with fluorescent reporters (i.e., NKX2-1GFP TP63tdTomato), it is recommended to sort for \"triple positive\" cells (i.e., NKX2-1GFP+, TP63tdTomato+, NGFR+), with appropriate gate selection and compensation (Figure 3). During this expansion of iBCs, a proportion of cells differentiate into secretory cells and very small proportion of multiciliated cells may also be detected. Both of these populations are NGFR-.\n5. Generation of mucociliary ALI cultures\nPrepare 6.5 mm porous membrane inserts by adding a 200 µL matrix to the apical chamber (human embryonic stem cell-qualified matrix or recombinant human laminin-521) per the manufacturer's instruction.\n\t\nPlace at 37 °C for at least 2 h before needed.\nAspirate the coating matrix from the apical chamber of the insert. Add 500 µL of the Basal Cell Medium to the basolateral chamber.\nResuspend at least 30,000 sorted NGFR+ cells (from step 4.5) in 100-200 µL Basal Cell Medium and transfer to the apical chamber using a P200 micropipette. Repeat for as many wells as desired (and cells available). Place the plate in humidified 37 °C incubator.\nIn 2-3 days, aspirate apical and basolateral chambers and feed with fresh Basal Cell Medium (500 µL to apical, 100 µL to basolateral).",
    "Monitor the apical chamber daily with light microscopy. When cells are >80% confluent (typically 3-7 days), replace Basal Cell Medium with ALI Differentiation Medium (not pre-warmed) in both apical and basolateral chambers. When working with ALI Differentiation Medium, protect from light by keeping media containers wrapped in foil and by turning off overhead lights when able.\nThe next day, aspirate the medium from the apical chamber, thus exposing the apical surface to air.\nReplace the ALI Differentiation Medium media in the basolateral chamber every 2-3 days.\n\t\nMonitor the culture appearance every 1-2 days. Carefully aspirate any accumulated liquid from the apical chamber, without disturbing the cell layer.\nAssess the transepithelial electrical resistance (TEER) for epithelial integrity.\n\t\tNOTE: TEER can be assessed in the days following air exposure to give a readout of epithelial layer integrity. The ideal time to measure TEER has not been established, though values consistent with high quality mucociliary differentiation are typically >500 x cm2.\nIf it is necessary to remove debris or mucus, gently add 100 µL PBS (without Ca2+ or Mg2+) to the apical chamber. Incubate at 37 °C for 10 min, and then carefully aspirate PBS.\nAfter 7-10 days of air exposure, motile cilia typically appear and can be seen using light microscopy. Depending on the planned experiment and readout, cells can be analyzed after 14-28 days of air exposure.\n\t\t​NOTE: If fluorescent reporter cells have been used, and if a live-cell fluorescent microscope is available, cells can be tracked with light microscopy as well as reporter fluorescence.\n6. Optional (but recommended) cryopreservation of iBCs\nAfter 10-14 days of the most recent 3-D culture passage, dissociate the spheroids to single-cell suspension as in steps 3.2-3.5. Perform a cell count.\nResuspend in Cryopreservation Medium at a density of 250,000 cells/500 µL in a cryovial.",
    "Place cryovial(s) in a container to ensure a steady drop in temperature (1 °C/min) and transfer to -80 °C for 24-48 h, followed by transfer to -150 °C for long term storage.\n\tNOTE: Repeat cryopreservation as well as cryopreservation of previously NGFR+ sorted cells have been performed, but these have not been adequately assessed for cell viability and the ability to form functional ALI cultures. Especially with extended cell passaging, it is recommended to assess for the karyotype as this has been noted to vary in iPSCs and iPSC-derived cells."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}