{
  "id": 5206,
  "origin_website": "Bio",
  "title": "Quantification of Tumor Material Uptake",
  "procedures": [
    "Tumor injectionCollect LLC-RFP tumor cells at about 70-80% confluency grown in a cell culture flask. Wash with DPBS two times and then gently trypsinize cells for approximately 3-5 min. We find that the greatest amount of reproducibility with tumors that are 70-80% confluent and highly viable (> 95%) when collected for injection.Note: If there is any question of tumor cell viability, test for viability by trypan blue staining or other methods after tumor collection.Resuspend cells in DPBS and centrifuge for 5 min at 300 x g. Repeat DPBS wash.Wash tumor cell with DPBS two times and then gently trypsinize cells. Bring up cells in DPBS and centrifuge for 5 min at 300 x g. Repeat DPBS wash.Count cells and bring up at 3 x 106 cells/ml.Intravenously inject (in tail vein) 3 x 105 Lewis lung carcinoma cells expressing red fluorescent protein (LLC-RFP) or other fluorescent-tagged tumor cell line resuspended in 100 μl of DPBS into the tail vein using a 30 gauge syringe. Recipient mice should be syngeneic for the tumor cell line (C57BL/6J mice for LLC and B16F10 tumors). Optimal internalization of tumor material in circulating myeloid cells is observed between 4 and 72 h after intravenous injection of tumor, but tumor material observer can be observed in lung tissue for at least 3 weeks after injection. Isolation of immune cellsCollect samples in 15 ml tubes filled with DPBS (with 2 mM EDTA).Collect 200 μl-1 ml of blood, whole spleen, or whole lung.Centrifuge 300 x g for 10 min for blood, and then lyse RBC with 10 ml of RBC buffer for 5 min. Place a 70 μm filter in a 15 mm Petri dish and mechanical dissociate spleen or lung through filter using a 5 ml syringe plunger.",
    "Pour cell solution into 15 ml tube and then lyse with 2 ml of RBC buffer for 2-5 min.Wash 1x with 10 ml DPBS and centrifuge 300 x g for 10 min (repeat lysis for blood if necessary).Resuspend cells around 1 x 107 cells/ml in flow buffer (FB).Staining of immune cellsPlace ~2 x 106 cells/well in a 96-well v-bottom plate.Wash cells in 200 μl in FB, centrifuge for 5 min at 300 x g, flick out wash (swing plate over sink to remove liquid).Resuspend cells in 100 μl Fc Block (CD16/32) at a dilution of 1:200 (Make a master mix and add to cells using a multichannel pipettor).Let sit on ice for 5 min.Make a master mix of fluorochrome conjugated antibodies and viability dye to stain immune cell population of interest in FB. Avoid other red channels (PE, PE-Cy7 and Percp5.5) if assaying for LLC-RFP uptake and avoid green channels (FITC/A488/GFP) if assaying for B16F10-GFP. For example, to label myeloid cell populations after LLC-RFP injection we use CD11b-FITC, CD115-APC, Ly6C-APC-Cy7, CD45-BV421, and Live/Dead Blue, but this panel can vary depending on your cell of interest and tumor injected. Wash cells in 200 μl FB, centrifuge for 5 min at 300 x g, flick out wash.Resuspend cells in 100 μl of fluorochrome conjugated antibody master mix. Stain compensation controls/beads with single antibodies.Incubate on ice for 30 min.Wash cells 2 x with 200 μl FB, centrifuge for 5 min at 300 x g, flick out wash.Resuspend in 200 μl of FBTransfer 200 μl to analysis tubes and run samples on the flow cytometer or Amnis imaging cytometer.",
    "Gate on live cells, then CD45+ immune cell population of interest, and then RFP+ or GFP+ tumor material found in the immune cell population by flow cytometry (Figure 1) or image tumor material localization using imaging cytometer (Figure 2). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161012/20161012021553_1107.jpgFigure 1. Gating of LLC-RFP+ tumor material in CD11b+ myeloid cells isolated from blood and analyzed by flow cytometry. Cells were gated on Live, CD45+ immune cells before this analysis.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161012/20161012021640_7376.jpgFigure 2. Imaging of B16F10-GFP tumor material uptake (Green) by CD11b+ myeloid cells (Orange) isolated from blood and analyzed by imaging cytometry. Cells were gated on Live, CD45+ immune cells before this analysis. Scale bar in lower right corner is 10 μm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}