{
  "id": 19051,
  "origin_website": "Jove",
  "title": "Imaging Glioma Initiation In Vivo Through a Polished and Reinforced Thin-skull Cranial Window",
  "procedures": [
    "1. Protocol\nAnesthetize the mouse with ketamine and xylazine at a dose of 0.1 mg ketamine and 0.01 mg of xylazine per 1 g of body weight. Carprofen (0.005 mg per 1 g of body weight) is used for analgesia and is administered preoperatively.\nAll of the surgical tools, including the dental drill bit, are steam sterilized in an autoclave. If batch surgeries are to be performed, the tips of surgical instruments must be re-sterilized with a glass bead sterilizer (Fine Science Tools FST 250) before each subsequent surgery.\nOnce the mouse has reached a surgical plane of anesthesia, assessed by absence of a response to a toe pinch, it is placed on a cotton pad that is then placed on a heated pad to maintain a body temperature of ~37 °C. The depth of anesthesia is monitored frequently during the surgery.\nFur is removed from the dorsal head in a roughly triangular area ~ 3 mm caudal to the nares and extending caudally to the cervical vertebrae. Ophthalmic ointment is applied to eyes to protect them from dehydration and irritation.\nThe mouse is placed in ventral recumbancy and the skin is disinfected with surgical iodine, 70% ethanol, and sterile swabs. A 0.8 x 1.0 cm flap of skin covering the dorsal aspect of the frontal and parietal bones of the skull is removed using fine scissors.\nA topical analgesic, 0.5% lidocaine, is applied locally to the periosteum and the exposed tissues at the periphery of the wound. The periosteum is removed by gently scraping the skull with a scalpel blade; this will help the cyanoacrylate glue to adhere to the bone.",
    "The cortical area of interest is outlined on the skull with a marker. The area of interest should not be located over skull suture lines, to avoid damage to underlying large vessels.\nA thin layer of cyanoacrylate adhesive is applied to the wound margins, to prevent the seepage of serosanguinous fluid, and to the skull except in the area of interest.\nLight-activated dental cement is used in our protocol for sealing the skull. Before application of dental cement, all exposed skull except for the area intended for thinning is treated with the primers and subsequently with the bonding agent from the light-activated dental cement kit. Once the bonding agent is dried, the light-activated dental cement is applied to cover the skull. To stabilize the head of the mouse for subsequent surgery and imaging, a sterile #00-90 hex nut is embedded into the dental cement at a distance from the area to be thinned. The use of light- activated dental cement allows us to prepare the skull without having to rush to finish the entire procedure. Once the dental cement preparation on the skull is completed, the dental cement is cured with visible light.\nAfter the dental cement is cured, a headpiece holder from the stereotactic device is mounted to the hex nut on the mouse head using a #00-90 screw.\nA drop of room-temperature, 0.9% sterile saline is applied to the skull area to be thinned. With the aid of a stereomicroscope, a high-speed micro-drill is used to thin a circular area of the skull (typically ~4-5 mm in diameter) over the region of interest. Drilling and the application of saline to the drilled area are performed intermittently during the thinning procedure to avoid thermal injury to the underlying cerebral tissue. Saline absorbs heat and also helps soften the bone.",
    "The mouse skull comprises two thin layers of compact bone, sandwiching a thick layer of spongy bone. The external layer of compact bone and most of the spongy bone are removed using the drill.\nAfter the majority of the spongy bone is removed, the remaining cavities within the spongy bone can be seen under a dissecting microscope, indicating that drilling is approaching the internal compact bone layer. At this stage, skull thickness should still be more than 50 μm. Skull thinning should be continued carefully to obtain a very thin (~20 μm) and smooth preparation.\nOnce the desired thickness of skull is achieved (~20 μm), the skull is first polished using a custom-made silicone whip with diamond paste (6-15 μm) for approximately 10 min. The diamond-paste polishing serves two purposes. First, it further thins the skull without applying pressure on the thinned skull, thereby avoiding accidental damage to the underlying brain tissue. Second, it serves as an initial polishing step for the thinned skull before the fine-grained tin oxide is used for further skull polishing.\nFollowing the diamond-paste polishing, the thinned skull is polished with tin oxide for approximately 10 min. Once the skull is polished, the tin oxide is flushed away with saline until the thinned skull appears clean.\nAt this step, if the cranial window is to be used for longitudinal in vivo imaging, the cleaned thin skull area is dried. A small drop of clear cyanoacrylate glue is applied to seal the cranial window. The layer of cyanoacrylate glue between the thinned skull and the coverslip should be as thin as possible.",
    "If an injection is to be performed after creation of a PoRTS cranial window, at this step, a 26-gauge syringe needle is used to create a small opening on one side of the polished thin-skull window. This opening is used for GBM cell injection.\nA sterile glass pipette with a tip opening approximately 50 μm in diameter is pulled using a pipette puller. This pipette will be used for GBM cell injection, and is loaded onto a micromanipulator. The pipette is loaded at a 30-degree angle so that the GBM cell injection site will be away from the final imaging site. The tip of the pipette is removed under a dissection microscope. The GBM cell suspension is front-loaded into the pipette by suction using a syringe pump.\nOnce the injection pipette is loaded with GBM cells, the mouse is moved back under the microscope. The injection pipette is lowered towards the small opening in the cranial window and finally inserted into the brain through the opening using a micromanipulator. 1 μl of a GBM cell suspension is injected into the brain 100-200 μm from the brain surface (speed: 0.1 μl/min, duration: 10 min).\nThe skull is dried, a small drop of clear cyanoacrylate glue is applied to the dried skull, and a piece of 3-mm size #1 coverslip is adhered to the thin and polished skull area. The space between the coverslip and adjacent dental cement is sealed with cyanoacrylate glue.\nAfter surgery, the mouse is injected subcutaneously with 1 ml warm sterile saline and provided with supplemental heat to maintain body temperature until fully recovered from anesthesia.",
    "For imaging, mice are anesthetized with ketamine and xylazine at a dosage of 0.1 mg ketamine and 0.01 mg of xylazine per 1 g of body weight. Mice are immobilized using a custom stereotactic frame under the microscope. If repetitive in vivo imaging is performed on daily basis, isofluorane will be a better option, as mice will show signs of dependence with repetitive use of ketamine.\n2. Representative Results",
    "A successful PoRTS cranial window surgery allows the cranial window to remain clear for weeks to months. Figure 1 shows the vasculature beneath a PoRTS cranial window as visualized using backscattered light. These vasculature images were used as landmarks for locating the same brain areas for repetitive imaging. To visualize both the vasculature endothelial cells and GBM cells, we crossed the B6.Cg-Tg(Tek-cre)1Ywa/J mouse, which labels vascular endothelial cells with the B6.Cg-Gt(ROSA)26Sortm9(CAG-tdTomato)Hze/J mouse, and generated mice with vascular endothelial cells labeled with the red fluorescent protein tdTomato. We then performed the PoRTS craniotomy procedure on these mice, and injected GFP-labeled GBM cells into their brains through a small opening on the side of a cranial window. We then performed in vivo two-photon imaging longitudinally on the injected mice. The laser excitation wavelength was set at 910 nm, which resulted in excitation of both GFP and tdTomato. Two-photon imaging was performed on a custom-built two-photon laser-scanning microscope with two detectors for simultaneous green/red fluorescence detection capability. Figure 2 shows an in vivo example of glioma initiation from injected GBM cells near the vasculature. The PoRTS cranial window is also an excellent choice for chronic time-lapse in vivo imaging. Figure 3 shows GFAP staining of cortical sections from a mouse without PoRTS surgery, a mouse 7 days following PoRTS surgery, and a mouse 7 days following PoRTS surgery and saline injection. It is evident from the images that the mouse without surgery and the mouse with PoRTS surgery do not have gliosis, whereas following saline injection, gliosis is observed in the brain tissue of the mouse, due to pipette penetration and saline injection in the brain.",
    "This result demonstrates that gliosis does not occur under the PoRTS cranial window, providing independent validation that the PoRTS cranial window described here does not lead to the gliosis that is typically associated with an \"open skull\" chronic cranial window. Figure 4 shows high-resolution imaging of dendritic spines from the same mouse on the day of surgery (Day 0) and 32 days after the PoRTS window creation (Day 32), demonstrating that the PoRTS window is also an excellent choice for high-resolution in vivo imaging.",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/4201/4201fig1.jpg\nFigure 1.  Visualization of vasculature under a polished and reinforced thinned skull cranial window using backscattered light. Days represent the number of days after surgery; images were taken starting on the day of surgery immediately after completion of GBM cell injection. Scale bar: 0.5 mm.  Click here to view larger figure[href=http://www.jove.com/files/ftp_upload/4201/4201fig1large.jpg].\nimgsrc://cloudfront.jove.com/files/ftp_upload/4201/4201fig2.jpg\nFigure 2.  Visualization of injected GBM cells and vasculature in vivo. Mice carrying both Tek-Cre and ROSA26 CAG-tdTomato were used for GBM cell injection. Vascular endothelial cells were labeled with tdTomato (red), and GBM cells were labeled with GFP (green). Images were acquired starting 24 hr after GBM cell injection. A total of 10-12 adjacent fields of view were taken and were assembled adjacent to one another, with the identified injected GBM cells in the center of the total field, to produce the final images. Days represent the number of days after surgery. Scale bar: 100 μm.  Click here to view larger figure[href=http://www.jove.com/files/ftp_upload/4201/4201fig2large.jpg].\nimgsrc://cloudfront.jove.com/files/ftp_upload/4201/4201fig3.jpg\nFigure 3.  Gliosis does not occur following PoRTS cranial window surgery. Upper panels: Mouse brain coronal section under lower magnification. Left panel: a mouse without any cranial window surgery; no GFAP activation is observed in the brain tissue. Middle panel: a mouse with a PoRTS cranial window generated on the right side of the brain; no GFAP activation is observed in the brain tissue. Right panel: a mouse with a PoRTS cranial window and saline injection from the side of the PoRTS window. GFAP activation is observed on the side of the PoRTS window, but not on the side of intact brain tissue. Scale bar: 1 mm. Lower panel: higher-power images of brain tissues in areas as indicated in the white box of the upper-panel images. Scale bar: 100 μm.  Click here to view larger figure[href=http://www.jove.com/files/ftp_upload/4201/4201fig3large.jpg].\nimgsrc://cloudfront.jove.com/files/ftp_upload/4201/4201fig4.jpg",
    "Figure 4.  High-resolution imaging of dendritic spines from Thy-1 YFPH mice. Images were acquired on the day of PoRTS surgery, and 32 days after PoRTS surgery. It is apparent from the images that most spines present on day 0 are clearly visible 32 days following PoRTS surgery. Scale bar: 2 μm.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}