{
  "id": 13202,
  "origin_website": "Jove",
  "title": "Whole-Mount In Situ Hybridization in Zebrafish Embryos and Tube Formation Assay in iPSC-ECs to Study the Role of Endoglin in Vascular Development",
  "procedures": [
    "All animal experiments described were approved by the Research Ethics Committee of Zhejiang University school of medicine.\n1. Whole-mount in situ hybridization\nZebrafish line husbandry and reproduction\n\t\nFeed and raise all adult zebrafish at 26-28 °C in a recirculating aquaculture system with 14 h light/10 h dark cycle for each day. Use AB (wild-type) zebrafish lines for the following procedures.\nPut a layer of pebbles in the bottom of the breeding box as a shelter for eggs. Group parental fish in the ratio of 2:1 (i.e., two females and one male) into each box. Let the female fish spawn for 1 day. At the end of spawning, remove the parent fish immediately to prevent them from eating the eggs.\nInject the 2 ng of morpholinos and 500 pg of mRNA into one-cell stage embryos using the Femto Jet injection system under a microscope (endoglin-MOs sequence: 5'-GATGAACTCAACACTCGTGTCTGAT-3'; 5-mispair control MOs sequence: 5'-AAACAGACCACATCCTCTTCATCTC-3').\nIncubate the zygotes in acidic sea water at 27 °C for approximately 48 h.\nCollection and fixation of zebrafish embryos\n\t\nUse a plastic transfer pipette to collect 20-40 zebrafish embryos from the circulating system water (pH = 5.0) in a 1.5 mL tube when they are dechorionated and reach a specific period of development. Add 1 mL of freshly prepared 4% PFA solution at room temperature (RT).\nNOTE: The period at which the embryo chosen is based on the purpose of the experiment. Table 1 shows the fixation time required for different embryonic periods.\nRemove the fixation solution, wash embryos with phosphate-buffered solution with Tween-20 (PBST, dilute 1 mL of Tween into 1000 mL of PBS solution) 3x for 5 min each at RT.",
    "Dehydrate the embryos through incubation in a series of 25%, 50% and 75% methanol (diluted in PBST) for 5 min each. Transfer embryos to 100% methanol for 5 min and replace with fresh methanol. Store the embryos at -20 °C for overnight or longer.\nHydration and digestion\n\t\nHydrate embryos that were preserved in 100% methanol using a sieve with nylon mesh at the bottom to sequentially wash embryos in the wells of 12 well plates with a series of 75%, 50%, and 25% methanol (diluted in PBST) for 5 min each. Wash the embryos with PBST 3x for 5 min each at RT.\nAdd 50 µL of proteinase K (10 mg/mL) into the tube with embryos and follow the digestion time in the Table 2 at RT.\nRemove the proteinase K and wash embryos with PBST 3x for 5 min each at RT.\nProbe hybridization and post-fixation\n\t\nPut the probes designed according to each gene's mRNA sequences in a 40 °C hybridizatin system until the precipitate is dissolved, which should take ~10 min. Mix the target probes of eg (XM_007116.7) and an additional two important genes involve in the early mesoderm endotheial progenitor formation(here, aplnr [NM_001075105.1] and nrp1a [NM_001040326.1]) in a 1.5 mL tube at a 50:1:1 ratio.\nAdd 50-100 µL of mixed target probes into each tube with embryos, then incubate overnight at 40 °C.\nNOTE: Pre-mixed probes must be pre-warmed to 40 °C and cooled to RT before use.\nPrepare a 0.2x saline sodium citrate solution with Tween-20 (SSCT): dissolve 175.3 g of NaCl and 88 g of sodium citrate into 1 L of dH2O to obtain a 20x SSC solution. Then, dilute the solution 1:100 in dH2O to obtain a 0.2 x SSCT solution. Dilute Tween-20 1:1000 in the 0.2x SSCT solution.",
    "Transfer the recycled probes to a new tube. Wash the embryos in 0.2x SSCT solution 3x for 15 min each at RT. The recycled probes can be reused 5x-10x.\nUse 4% paraformaldehyde (PFA) to fix the embryos for 30 min at RT. Wash the embryos in 0.2x SSCT solution 3x for 15 min each at RT.\nNOTE: The work of Gross-Thebing et al. suggests a post-fixation period of 10 min14, but the actual amount must be adjusted accordingly. Here, we tested 10 min post-fixation 3x, and the sensitivity of DAB dying is significantly influenced. After investigating, ensure that 0.5-1.0 h of fixation is the optimal condition (a shorter fixation period cannot produce a clear signal from the target RNA, and the appropriate extension of fixation time helps strengthen the signal and provide less background noise).\nSequential amplifier and label probe hybridization\n\t\nRemove the SSCT solution and replace with 50 µL of Amp 1. Allow the embryos to settle in Amp 1 at 40 °C for 30 min. Then, wash the embryos in 0.2x SSCT solution 3x for 15 min each at RT.\nRemove the SSCT solution and add 50 µL of Amp 2. Allow the embryos to settle at 40 °C for 15 min. Then, wash the embryos in 0.2x SSCT solution 3x for 15 min each at RT.\nRemove the SSCT solution, add 50 µL of Amp 3 and tap the tube mildly. Then, incubate the embryos at 40 °C for 30 min. Wash the embryos in 0.2x SSCT solution 3x for 15 min each at RT.\nRemove the SSCT solution, add 50 µL of Amp 4 dropwise, and carefully tap the tube. Then, incubate the embryos at 40 °C for 15 min. Wash the embryos in 0.2x SSCT 3x for 15 min each at RT.\nCounterstaining and microscopy",
    "Remove the SSCT solution and add 50 µL of DAPI to each tube. Incubate the embryos overnight at 4 °C.\nWash the embryos with PBST and prepare them for imaging using a 1% low melting point agarose (LMP) solution (1 g of LMP dissolved in 100 mL of dH2O) in a Petri dish filled with PBST.\nUse a DAB peroxidase substrate kit to stain the specimen. Add color reagents A, B, and C (50 µL each) to 1 mL of distilled water and mix well to obtain a complete DAB working fluid. Add the fluid to the specimen and cover for 10 min.\nWash the specimen thoroughly with PBST after staining.\nUse an optical microscope with a photographic function for imaging the samples.\nNOTE: If taking images later, tubes should be wrapped in aluminum foil and stored at 4 °C.\n2. Tube formation assay\nNOTE: The eng mutant and wildtype ECs (control) were differentiated from iPSCs derived from an HHT patient (here, a 62 year-old female patient with recurrent epistaxis since 22 years old, gastrointestinal bleeding, pulmonary arteriovenous malformations, carrying a missense eng mutation in position c.88T>C of exon 2) and a healthy donor (without eng mutation), which were provided by Peking Union Medical College Hospital with approval from the college research ethics committee.\nControl and HHT iPSC cell cultures\n\t\nAdd a certain volume of basement membrane matrix (e.g., Matrigel) to a 6 well cell culture plate to cover the bottom of the well and incubate the plates for 1 h at 37 °C.",
    "NOTE: When first using the basement membrane matrix stored at -20 °C, incubate on ice or in a frost-free 4 °C refrigerator until thawed. Then, dilute at 1:100 in DMEM/F12, then distribute the diluent into 200 µL tubes containing 100 µL each. Store the tubes at -20 °C and avoid repeated freezing and thawing. When adding the diluted basement membrane matrix, do not create bubbles. After adding the diluted basement membrane matrix, shake the 6 well plate gently by hand so that it evenly covers the bottom.\nAfter coating the plate, remove the used basement membrane matrix solution from the wells. Then, add 2 mL of mTeSR1 medium into each well, and plate the iPSCs harvested from the last passage at approximately 1 x 106 per well.\nGeneration and expansion of ECs from iPSCs\n\t\nAfter approximately 4 days of iPSC culture, exchange the culture medium with BEL medium supplemented with activin A (25 ng/mL), BMP4 (30 ng/mL), VEGF165 (50 ng/mL), and CHIR99021 (1.5 µM). Grow the cells for 3 days to generate mesoderm cells.\nReplace the medium described in step 2.2.1 with BEL medium supplemented with VEGF (50 ng/mL) and SB431542 (10 µM) for 4 days to expand vascular ECs. Treat the cells with the same medium and culture for another 3-4 days.\nUse CD31-dynabeads to purify the mature vascular ECs: refer to the instructions in the CD31-dynabeads kit, which links human CD31 antibody with magnetic beads to combine CD31 molecules expressed on ECs, then collect the CD31-positive cells by elution buffer. Maintain and expand the purified ECs in EC-SFM medium containing VEGF165 (30 ng/mL), bFGF (30 ng/mL), and FBS (1%).\nPlating endothelial cells on Matrigel-coated plates and microscopy",
    "Add 10 µL of basement membrane matrix per well to coat the angiogenesis plates (see Table of Materials) and incubate at 30 min at 37 °C.\nHarvest endothelial cells after checking endothelial markers CD31 and VE-cadherin with immunofluorescence staining and resuspend them in endothelial growth medium 2 by pipetting repeatedly. Add 50 µL of cell suspension (2 x 105 cells/mL) per well onto the solidified matrix and incubate the cells for 3-5 h at 37 °C.\nNOTE: Before the tube formation experiment, endothelial markers should be checked to make sure the proper phenotype of functional endothelial cells. 1 x 104 cell per well is an ideal number for tube formation. Too many or too few cells are not conducive to tube formation. Add cells from the side of the dish and do not touch the basement membrane matrix. Use light microscope in high magnification field to check the cells and take photos.\nQuantitative results of tube formation\n\t\nObserve the results with a microscope with high resolution and take pictures of at least 10 areas for each group to obtain reliable data statistics.\nExamine endothelial tube formation: estimate the extent of tube formation by inspecting the overall tube length, tube number, and branch points. Assess and count the number and length of branches using ImageJ software.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}