{
  "id": 11836,
  "origin_website": "Jove",
  "title": "Digital Spatial Profiling for Characterization of the Microenvironment in Adult-Type Diffusely Infiltrating Glioma",
  "procedures": [
    "The protocol outlined below follows the guidelines of the Dartmouth-Hitchcock Human Research Ethics Committee. Informed consent was obtained from the patients whose tissue samples were included in this study. See the Table of Materials section for details related to all materials, reagents, equipment, and software used in this protocol.\n1. Slide preparation17\nRetrieve or prepare formalin-fixed, paraffin-embedded tissue from human adult-type diffusely infiltrating gliomas.\n\tNOTE: In this experiment, paraffin-embedded blocks of biopsies from three patients with glioblastoma were used.\nCreate a tissue microarray (TMA) block. Take several 2 mm cores from each biopsy and put them in a single TMA block (Figure 1, top). Cut sections from the TMA block at 4 µm and mount on to glass slides. Place each slide inside the slide holder gasket. Incubate the slide at 60 °C for 30 min.\n2. Semi-automated IHC system preparation and software configuration (for loading and running of slides)17\nSet up the reagents. Click on the Reagent Setup button. Click on Add in the Setup tab.\n\t\nRegister a wash buffer by typing a name for it in the Name field. Select Ancillary in the Type field. Click on Save.\nRegister a blocking solution by repeating the same steps as above (modified as applicable, e.g., in the Name field), but selecting Primary Antibody in the Type field. Select the desired protocols in the drop-down boxes for Default Staining Protocol and Default HIER Protocol. Select a Default Enzyme Protocol option if desired (this box was left blank in the current protocol). Click on Save.\nRegister the Detection System, consisting of a barcoded Reagent Container Tray. Scan the barcode.\n\t\nBegin entering reagent system details in the Add Research Reagent System window. Type a Name for the detection system.",
    "Type an Expiration Date. Highlight the first row of the Reagents chart and Scan the Barcode of a new 30 mL Reagent Container, at which time the barcode will populate row 1.\nPlace the container in position 1 of the Detection System. Select the name of the wash buffer in the drop-down box of the Reagent column and click on Add. Repeat these steps to add any additional reagents in subsequent rows, including the blocking solution.\nSet up the Protein Protocol for IHC. Click on Protocol Setup. Highlight the row corresponding to the desired protocol and click on Copy. Enter the Name and fill out any other relevant fields in the Edit Protocol Properties window.\n\t\nSelect the box for Show Wash Steps. Confirm that Inc (min) and DispenseType fields are correct for each reagent (10 min for the Blocking Solution, 0 min for the Wash Buffer, and 150 µL for each DispenseType). Click on Save.\nPrepare the study. Fill the container in position 1 with a Wash Buffer. Fill 150 µL per slide and 5 mL of dead volume; leave the lid open. Repeat these steps for the container in position 2, which should be filled with a Blocking Solution. This container should have 150 µL per slide and 350 µL of dead volume.\n\t\nLoad the Reagent Container Tray onto the machine. Allow the system to perform container recognition and volume confirmation measures. Click on Slide Setup | Add Study. Enter the Study ID and Study Name and select 150 µL under Dispense Volume | the desired protocol in the Preparation Protocol dropdown (Bake and Dewax is suggested). Highlight the study and click on Add Slide.",
    "Select Test Tissue under Tissue Type | 150 µL under Dispense Volume | Single and Routine from the Staining Mode dropdown boxes. Select a Process (IHC for the current study) | the Blocking Solution Name in the dropdown box of the Marker field | IHC DSP Protocol in the Staining field of the Protocols tab | *Bake and Dewax for Preparation | *HIER 20 min with ER1 for HIER. Leave the Enzyme field blank.\nRepeat this process for every slide. Click on Close once finished, and then click on Print Labels. Check All Slide Labels Not Yet Printed for Current Study and click on Print. Affix labels to the tops of the slides.\nLoad and run slides. Load the slides onto the slide tray, ensuring the sample and label face upward. Place the cover tiles over the slides, ensuring the slides are oriented with tabs at the bottom. Load the slide trays onto the instrument.\n\t\nPress the LED button to lower the tray and allow the instrument to begin the scanning and recognition of slides. Click on the Start button to begin the experiment.\nFinish the experiment. Press the LED button when it blinks green, indicating run completion. Remove the tray from the instrument, and carefully lift the cover tiles from each slide. Place the slides in 1x phosphate-buffered saline (PBS), remove excess buffer, and outline each tissue section with a hydrophobic pen to create a hydrophobic barrier.\n3. Antibody incubation and nuclei staining17\nSelect a panel of antibodies to localize the antigens of interest (see Table 1 for antibodies used in this experiment).\n\tNOTE: Each antibody has already been conjugated to a DNA oligonucleotide with a UV-photocleavable segment (PC-oligo) that uniquely identifies it (indexing oligos, Figure 2).",
    "Make a working antibody-PC-oligo solution by adding, for each slide, 8 µL of each antibody (diluted 1:40) in the panel. Use the blocking reagent as the diluent to reach the final volume of 200 µL for each slide. Incubate overnight at 4 °C (Figure 3, Step 1).\n\tNOTE: Morphology markers, biological dyes, or fluorescently labeled antibodies can also be added to the solution at this step.\nThe next day, place the slide in a Coplin jar and wash 3 x 10 min in 1x TBS-T. Postfix in 4% paraformaldehyde for 30 min at room temperature, followed by 2 x 5 min in 1x TBS-T.\nAdd SYTO13 nuclear stain (diluted 1:10 in 1x TBS) for 15 min at room temperature. Wash 2x with 1x TBS-T, and then store the slide in 1x TBS-T.\n4. Fluorescence visualization, ROI identification, and UV photocleavage on the DSP instrument17\nAfter hovering the mouse over Data Collection in the Control Center, select New/Continue Run.\nPlace the slide in the slide holder, with the label toward the user. Lower the slide tray clamp, ensuring that the tissue is visible in the elongated window.  Add 6 mL of Buffer S.\nFollow the prompts in the Control Center. Zoom between different axes with the X- and Y-sliders to delineate a region for scanning. Select Scan. Allow the scan to proceed until the entire defined target area has been imaged.\nGenerate a 20x image. Define the ROIs either automatically or manually (Figure 3, Step 2). To follow this protocol, select three equally sized, circular ROIs (diameter of 250 µm) for each tissue core (Figure 4, bottom).\n\tNOTE: ROIs are customizable in size and shape. Several ROIs can be selected within each section. In this experiment, circular ROIs are defined manually.",
    "Approve the ROIs by clicking on the Exit Scan Workspace button. Wait for UV light to cleave the oligos from the antibodies.\nWhen the Cleaning Instrument process has been completed, select New Data Collection to continue with the current slides or plate. Otherwise, select Remove Slides and Microplate.\nOpen the Finalize Plate window by double-clicking on the plate icon area at the lower right of the Control Center. If the Hybridization (Hyb) Code Pack lot number (#) is known, enter the number and click on Update (optional during this step). Click on Finalize.\nDetach the slide holder and collection plate by following the prompts. Store the slides in TBS-T. If the slides will not be used for a long time, cover them with an aqueous medium and coverslip.\n5. Protein readout17\nUse a permeable seal and dry the aspirates at 65 °C in a thermal cycler with the top open. Add 7 µL of diethyl pyrocarbonate-treated water and mix. Incubate at RT for 10 min, and then spin down quickly.\nChoose the appropriate Probe R and Probe U equations from Table 2 to guide the creation of the probe/buffer mix. Based on the number of Hyb Codes necessary for hybridization in the present experiment, apply equation (1) as below. Mix and spin down quickly.\n\t# Hyb Codes Probe R Working Pool Probe U Working Pool Hybridization Buffer n = _______ (n × 8 µL) = _____ µL + (n × 8 µL) = ______ µL + (n × 80 µL) = _____ µL (1)\nAdd 84 µL of Probe/Buffer Mix to each Hyb Code Pack to be used. Flick to mix and spin down. In a fresh 96-well Hybridization plate, add 8 µL of each Hyb Code Master Mix into all the 12 wells of the indicated row.",
    "Transfer 7 µL from the DSP collection plate to the corresponding well in the Hybridization plate. Mix gently. Heat-seal and perform a quick spin. Then, incubate overnight at 67 °C. Cool the plate on ice and perform a quick spin.\nPool the hyb products from each well into a strip tube, gently pipeting each well 5x to mix. Cap the strip tube and spin down. Freeze any remaining unpooled hyb products at -80 °C. Load the strip tubes into the analysis system.\nSave the CDF file onto a USB drive, and then transfer the data from the DSP instrument to the Digital Analyzer. Complete the setup by performing the following steps.\n\t\nLoad consumables and pooled samples onto the prep station. On screen, press Start Processing. Select High Sensitivity, followed by Next. Press Select All for the number of wells with samples | Finish | Next on email notification | Start.\nOnce prep station is done, seal the cartridge and transfer to the digital analyzer. Press Start Counting, select Stage Position, press Load Existing CDF file and select previously uploaded file. Press Done, select stage position again, press Done | Start to run the program.\nSave the zipped file of the reporter count conversion files from the analysis system to a USB drive, and then insert the drive into the DSP machine. In the DSP Control Center, hover over Data Collection, and then click on Upload Counts. Select the relevant zipped file.\n6. Data analysis17\nClick on Records in the DSP Control Center. To view scans in the queue, select Add Selected Scans to Queue | My Analysis Queue. Select New Study from Queue after hovering over the Data Analysis option in the Control Center.",
    "Choose QC from the Task Bar Options. Continue with the default values or adjust if desired. Select Run QC and review the Results Grid. Click on Run QC to proceed and create a new dataset, normalizing the values to the positive hybridization controls.\nImport the new tags into an XLSX file. Select Manage Annotations in the Scans pane, and then download a template, insert the tags, and import the file.\nOPTIONAL: After running QC, adjust the data further using other toolbar options. Use tools in the Visualizations pane to plot the transformed data.\nNavigate the gray dropdown box of parameters to compose each plot in the Visualizations pane. Select a particular region within a plot to visualize the corresponding highlighted segments in the Scans pane and right-click to generate tags or groups. Within Dataset Summary, review plots from Normalization, Scaling, and other options for analysis and display.\nSave a visualization by selecting the icon to Save; review visualizations already saved under Summary. Select the Export (.svg) button to export a visualization in .svg format. Export data on which a visualization is based by clicking on the Export (.xlsx) button. Export all the data contained within a specific dataset by hovering the cursor over the dataset name in the second pane and clicking on the export icon.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}