{
  "id": 6688,
  "origin_website": "Bio",
  "title": "Preparation of Red Palm Weevil <em>Rhynchophorus Ferrugineus</em> (Olivier) (Coleoptera: Dryophthoridae) Germ-free Larvae for Host-gut Microbes Interaction Studies",
  "procedures": [
    "Insect rearing and maintainingRPW lab population was established and maintained by the adults which were trapped in Pingtan District (119°32′ E, 25°31′ N) of Fuzhou City, Fujian Province and Jinshan campus of Fujian Agriculture and Forestry University (119°30′ E, 26°08′ N). RPW individuals were fed with sugarcane stems in the incubator (Saifu ZRX-260, Ninbo Experimental Instrument Co. Ltd., China) at the condition of 27 ± 1 °C, 75 ± 5% relative humidity, and a photoperiod of 24 h dark for larvae and 12 h light/12 h dark for adults (35 mm x 10 mm, length x width, Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191217/20191217002828_7476.jpgFigure 1. The four different life stages of red palm weevil, Rhynchophorus ferrugineusA female and male RPW adult were kept in the perforated plastic bottle. Provide them with sugarcane stem slices (30 mm x 15 mm, length x width) for feeding and oviposition. The food was changed every three days.The fresh eggs within 12 h after being laid were collected by cutting the sugarcane stem slices into much thinner ones, for dechorionation to generate RPW GF larvae.Preparation of artificial food and antibiotic stock solutionsMake RPW artificial food (see Recipe 1) and prepare antibiotics stock solutions (see Recipe 2).Syringe filter (0.22 µm) the antibiotics stock solution and store in aliquots.Prepare the artificial food in an autoclavable 1 L conical flask and sterilize it using an autoclave for 20 min at 121 °C.Add the antibiotic cocktail (600 mg/kg, 150 mg/kg each) and 1 g ascorbic acid to the autoclaved artificial food when the temperature drops to about 55 °C.After solidification, prepare a parallel batch of the artificial diet without antibiotics, replaced by the same volume of sterile distilled water.",
    "After solidification, prepare aliquots of the artificial food in Petri dishes and seal it with parafilm to avoid the potential microbial contamination during changing food for RPW individuals.Note: Carry out this step in the biosafety cabinet. Diet can be stored at 4 °C for later use.Generating RPW GF individuals via egg dechorionationSterilize all the tools, containing paintbrush, metal sieve, spatula (20 cm x 4 cm, length x width), tweezers and forceps, with 75% ethanol.Turn on the UV light for 30 min to sterilize the surface of laminar hood and other materials inside.Divide the eggs into two groups: a) non-dechorionated (control group) and b) dechorionated eggs. Use 30 eggs in each group.For eggs dechorionation, process the dechorionated eggs with the following steps as Koyle et al. (2016):Wash the freshly laid eggs with 10% sodium hypochlorite solution (NaClO) for 3-5 min and then filter them through the metal sieve.Rinse these eggs two times with 75% ethanol and filter through the metal sieve.Wash these eggs twice with sterilized distilled water to wash off the bleach (NaClO) and ethanol and filter the water carrying dechorionated eggs through the metal sieve. For the eggs in control group, they are only washed with the autoclaved distilled water and then filter the water carrying eggs through a metal sieve.Observe the dechorionated eggs under a stereomicroscope and we found that the dechorionated eggs became white as compared to the controls (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191217/20191217002848_1332.jpgFigure 2. Non-dechorionated and dechorionated eggs of red palm weevil, Rhynchophorus ferrugineus. (A) Non-dechorionated eggs are only washed with autoclaved distilled water only and (B) dechorionated eggs were washed with 10% sodium hypochlorite solution (NaClO), 75% ethanol and sterilized distilled water.Transfer the dechorionated eggs to the sterilized Petri dishes (90 mm Ø) with some UV sterilized moist absorbent cotton inside the laminar hood (Heal Force Safe-1200LC).",
    "The eggs are allowed to hatch inside the laminar hood at the condition of 27 ± 1 °C and 75 ± 5% relative humidity in the dark.Observe the eggs for hatching every 24 h. Two to three days later, they will hatch.Transfer the neonatal larvae to the new sterilized Petri dishes with 3 g solid artificial diet (Step C6), with or without antibiotics. Refresh the food every two days.Maintain the RPW larvae at 27 ± 1 °C, 75 ± 5% relative humidity, and 24 h dark photoperiod.Change the artificial food every three days.To verify the efficiency of our protocol, four groups are designated here: 1) dechorionated eggs + food with antibiotics, 2) dechorionated eggs + food without antibiotics (DNA), 3) non-dechorionated eggs + food with antibiotics (NDA), and 4) non-dechorionated eggs + food without antibiotics (CR conventionally reared). The larvae in Groups 1 and 3 are maintained in the laminar hood, while two other groups, be served as the positive and negative control, are kept in the incubator (Ninbo Experimental Instrument).Verification of germfree RPW individuals with culture-dependent and -independent assaysGut dissection and homogenizationTo validate the GF status of RPW, randomly select three larvae (the 5th instar larvae, Figure 3) from each treatment as a replicate for dissection, each group compromised at least three replicates.To remove the potential effect of associated microbes on the body surface of RPW larvae, submerge the specimens in 10% NaClO for 30 s, 75% ethanol for 90 s and two rinses with sterile distilled water. This step is completed inside the laminar hood.Dissect the guts under a stereomicroscope using sterilized scissors and forceps in a clean Petri dish with sterile PBS.Homogenize the collected guts in 1.5 ml microcentrifuge tube containing 1 ml sterile PBS, using a tissue lyser (48 tissue lyser Ningbo Scientz BioTech. Co.",
    "Ltd, China).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191217/20191217002917_4526.jpgFigure 3. The gut from the fifth RPW larvaeVerification of germfree RPW individuals with culture-dependent assaysSerially dilute (10-1-10-4 fold) the gut homogenate with sterile PBS.Plate 100 µl diluted homogenate on the LB agar plate in triplicate.Incubate the plates aerobically at 37 °C for 24 h and then check for the bacterial growth.As expected, no bacterial colonies appear on the plates containing gut homogenates from the dechorionated eggs provided with food supplemented with antibiotics (Dechorionated eggs + food with antibiotics, Figure 4). However, bacterial colonies grow up on the plates containing gut homogenates from other three groups (Figure 4). Consequently, the evidence suggests that RPW GF larvae were generated successfully.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191217/20191217002948_2017.jpgFigure 4. Culture-dependent verification of bacterial growth in the guts of RPW larvae from different treatment cohorts. No bacterial colony is observed in the larvae guts from germ-free (GF) group: dechorionated eggs reared on antibiotic treated food (Dechorionated + food with antibiotic). However, bacterial colonies were found in other three treatment cohorts: DNA (dechorionated eggs + food without antibiotics), NDA (non-dechorionated eggs + food with antibiotics) and CR conventionally reared (non-dechorionated eggs + food without antibiotics).Confirmation of germfree RPW individuals with culture-independent assaysThe lysed guts in Step D4 (gut dissection and homogenization) were employed to extract the total gut bacteria DNA with DNeasy blood and tissue Kit (Qiagen) following the manufacturer guidelines.Repeat the final elution twice in 80 µl buffer AE for improving DNA yield.Quantify the purity and concentration of the extracted DNA by running on 1% gel stained with ethidium bromide and using Nanodrop 1000 (Thermo Scientific, USA).Prepare the 25 µl PCR reaction system:50 ng template DNA1 µl of each forward (27F: 5ʹ-AGAGTTTGATCATGGCTCAG-3ʹ) and reverse primer (1492R: 5ʹ-TACGGYTACCTTGTTACGACTT-3ʹ)12.",
    "5 µl of 2x Taq PCR Mastermix (Tiangen Biotechnology Beijing, China)Up to 25 µl with PCR grade ddH2OSet up a negative control for PCR by adding 1 µl PCR grade ddH2O as a template while other reagents remain the same.Run PCR reactions with the thermal conditions as in Table 1.Table 1. The thermal conditions of Bacterial 16R rRNA-based PCR assaysimgsrc:https://en-cdn.bio-protocol.org/attached/image/20191217/20191217003209_9835.pngDetect the PCR products with electrophoresis on 1% agarose gel. Prepare a 1% agarose gel by dissolving 1.0 g agarose in 100 ml 0.5x TAE buffer and microwave the solution until it has completely dissolved.Carefully pour the gel solution in an agarose gel cast tray to avoid bubbles formation and let it polymerize for at least 30 min.Place the gel in the electrophoresis unit filled with 0.5x TAE buffer.Mix 4 µl of PCR products with 1 µl loading buffer and add to the wells of the gel.Load 5 µl 2,000 bp DNA marker and run the gel for 30 min at 90 V.Visualize the gel under the UV light to detect the target band with the expected size of 1,500 bp.No target PCR band is observed in RPW GF larvae, it presents in other three groups (Figure 5). This result is line with that of culture-dependent method.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191217/20191217003007_8511.jpgFigure 5. Verification of gut bacteria-derived PCR products with bacterial 16S rRNA-based PCR assays. GF (Dechorionated eggs + food with antibiotics), DNA (dechorionated eggs + food without antibiotics) NDA (non-dechorionated eggs + food with antibiotics) and CR conventionally reared (non-dechorionated eggs + food without antibiotics).ConclusionHere, we developed a protocol to generate RPW germ-free larvae for further investigation on the interplays between RPW larvae and their associated gut bacteria. This method requires strict sterile conditions, in other words, each step in our protocol should be completed inside the laminar hood.",
    "Taken together, following our reported protocol here, RPW GF larvae can be generated from dechorionated eggs which are reared on sterilized artificial food under axenic conditions."
  ],
  "subjectAreas": [
    "Microbiology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}