{
  "id": 13027,
  "origin_website": "Jove",
  "title": "Live-Cell Imaging of Drosophila melanogaster Third Instar Larval Brains",
  "procedures": [
    "NOTE: Figure 1 shows the materials required to perform this study.\n1. Considerations and preparations for the experiment\nPrevent the larvae from overcrowding.\n\tNOTE: The quality of explant larval brains is directly related to the health and quality of the larvae prior to dissection. Larvae that are malnourished from overcrowding will generally yield lower-quality brains30.\n\t\nEnsure that no more than 20-30 larvae are present per meal cap dish to avoid malnutrition. Examples of these can be seen in Figure 2.\nFilter and aliquot Schneider's medium before use.\n\t\nFor each dissection, prepare fresh imaging and dissection medium by supplementing aliquoted Schneider's insect medium with 1% bovine growth serum (BGS). A volume of 5 mL of dissection and imaging medium is usually sufficient for an imaging experiment.\nWarm the supplemented medium to room temperature (RT) before use.\nConsider the length of the movie to be collected, and use that to factor the supplementation of the imaging medium, the mounting approach, and the acquisition settings of the microscope.\n\tNOTE: Under optimal conditions, NBs in brains supplemented with only BGS will robustly divide for upward of 3 h.\n\t\nSupplement the imaging medium by adding larval fat body tissues to the imaging medium to support divisions past 4 h when conducting experiments that require longer movies.\n\t\t​NOTE: Fat bodies secrete mitogens that support NB proliferation31, and whole fat bodies from 10 larvae are sufficient to support four to five brains. Further, samples imaged with a membrane-bound slide have been shown to divide for over 10 h13,32, while samples imaged with a multi-well slide usually divide less often (unpublished observations).\nAlternatively, implement a more complex imaging medium for longer movies, as described previously33. Minimize photodamage by adjusting the exposure time, laser power, and sampling frequency for best results.\n2. Larvae staging and collection (Figure 2)",
    "Cross 1-5 day old female virgin flies with 1-7 day old adult male flies to produce progeny with the desired genotype. For optimal yield, cross 10-15 female virgins with 5-10 males. Deposit these flies into a fly cage with a meal cap (Figure 2A-C), and incubate at 25 °C.\nSwap the meal cap daily. This prevents the meal caps from becoming overcrowded with larvae, which reduces the quality of the dissected brains.\nIf the meal cap is significantly covered in larvae (i.e., >30), split this meal cap in half, and replace one half with a fresh meal cap that has also been cut in half. Alternatively, swap the meal caps on a more frequent basis (i.e., every 12 h instead of every 24 h). Examples of overpopulated meal caps can be seen in Figure 2E, F.\nIncubate the meal cap with larvae at 25 °C until the larvae reach the desired age.\n3. Larval fat body dissection (Figure 3)\nNOTE: This protocol describes dissections using a 3-well dissection dish.\nPipette ~400 µL of dissection and imaging medium into each well of a 3-well dissection dish.\nWash ten 72-96-h old well-fed wild-type larvae by gently holding them with dissection forceps and dipping them in and out of dissection solution in the bottom-most well until all food particulates have been washed off. After rinsing, move the clean larvae to the middle well.\nUsing one set of tweezers, hold the larva by the mouth hooks. With the other set of tweezers, rupture one side of the larva's cuticle.",
    "This rupture will cause the fat bodies to spill out of the larva. The fat bodies are off-white and semi-translucent and will have a lattice-like structure (Figure 3I). The fat bodies will also tend to stick to themselves and the dissection tweezers. Once identified, collect as much fat body from each larva as possible, and transfer it with the forceps to the top-most well with 400 µL of RT dissection medium.\n4. Larval brain dissection (Figure 3)\nWash the experimental larvae in dissection and imaging medium as above to free them of food residues. For best results, avoid storing undissected larvae in the dissection solution. This will cause the larvae to \"drown\" and will negatively impact the quality of the dissected brains.\nUsing one set of tweezers, hold the larva by the mouth hooks. Using another set of tweezers, gently cut/rip off approximately 1/3 of the larva from the posterior side (Figure 3A). This will cause elements of the digestive tract, fat bodies, connective tissue, and nervous system to \"burst\" out of the ruptured side of the larva (Figure 3B).\nUsing one set of tweezers, hold the larva by the mouth hooks. With the other set of tweezers, gently brush the cuticle toward the mouth hooks while \"pushing\" inward with the tweezers holding the mouth hooks until the entire larva is turned inside out. This motion is similar to turning a sock \"inside out\" (Figure 3C, D).\nInvert the larva so that the central nervous system and other tissues face outward while still being connected to the cuticle. At this step, locate the central nervous system (CNS) to avoid accidental removal. Using tweezers, gently remove all the non-CNS tissue, leaving only the CNS and brain attached to the cuticle (Figure 3E).",
    "The brain will be attached to the cuticle via axonal connections. Using microdissection scissors, cut these axonal connections to release the brain from the cuticle. To do this, first gently cut underneath the brain lobes (Figure 3F). Repeat with the connections under the ventral nerve cord.\n\tNOTE: This step may be done with tweezers if microdissection scissors are not available. Take special care when using tweezers to ensure that the brain tissue is not over-stretched during removal from the cuticle because mechanical stress will negatively affect the brain health.\nTransfer the dissected brain into a well with dissection and imaging medium. For imaging experiments longer than 3 h, use dissection and imaging medium supplemented with fat bodies as described above. Dissect the larvae in batches to keep the dissection time under 20 min.\n5. Mounting and imaging (Figure 4)\nFor imaging with a membrane-bound slide34:\n\t\nCollect both dissected brains and isolated fat bodies in the last well of the dissection dish.\nAssemble half of the slide by placing a gas-permeable membrane over the back of the slide, and press the split ring into the center, holding it in place (Figure 4A-C).\nUsing a 200 µL micropipette, transfer up to 10 dissected brains and as much fat body as possible (see above) in ~130-140 µL of dissection and imaging medium to the membrane. Make sure to deposit the medium with the samples in the center of the gas-permeable membrane (Figure 4D, E).\nOrient the brains for the population of NBs to be imaged and for the type of microscope being used (Figure 4E). Position the sample as close to the microscope's objective as possible. For example, to image NBs in the central brain lobes, orient the brains such that the brain lobes are closest to the objective (Figure 4H).",
    "Once the brains are oriented, gently place a glass coverslip on top of the solution on the membrane. This will cause the solution containing the brains and fat bodies to spread over the entirety of the membrane (Figure 4F).\nBlot excessive solution by holding a laboratory tissue close to the coverslip edge. The optimal amount of solution is achieved when the brains touch the coverslip without being squashed. If reorientation is required at this step, carefully move the coverslip to move the brains.\nImmobilize the coverslip by applying melted petroleum jelly along the edges of the coverslip with a paintbrush. Allow the jelly to solidify (Figure 4G).\nFor imaging with a multi-well imaging slide (Figure 4):\n\t\nAdd 400 µL of imaging medium to a well of a multi-well slide (in the experiment performed here, a chambered 8-well micro[µ]-slide was used; Figure 4I). Transfer the previously dissected fat bodies to this well (see step 3.4).\nDeposit up to 10 brains in a cluster near the center of the well (Figure 4J).\nOrient the brains for the population of NBs to be imaged and for the type of microscope being used, as described in step 5.1.4 (Figure 4K). Arrange the samples so they are close to each other. This will minimize the distance the stage must move between samples, which reduces sample drift during acquisition.\nOnce the brains have been oriented in the well, allow the brains to settle for 2-5 min. This increases their stability during transport/imaging. Prepare the microscope for acquisition during this time.\nCover the µ-slide with the slide cover, and transfer it to the microscope. Begin acquisition with the lowest laser power and exposure time possible to minimize photobleaching.\n6. Data processing and management best practices\nProcess the data as needed according to the available analysis software.",
    "For the example shown here, save the acquired data with SlideBook software as a SlideBook Image File (.sld).\nTo convert into Imaris' proprietary file type (.ims) using the Imaris File Converter, open the Imaris File Converter in a separate window. Click on and drag the .sld files into the \" input\" section of the Imaris File Converter.\nDetermine the desired output location for the converted files, and click on \"Start all.\"\nAfter conversion, view and annotate the data in the Imaris software.\n\t\tNOTE: Alternatives for image analysis can be used in place of Imaris, such as Fiji (https://hpc.nih.gov/apps/Fiji.html), Aivia (https://www.aivia-software.com/), Volocity (https://www.volocity4d.com/), or others.\nRetain as much of the original data as possible for proper record-keeping. For example, if the acquisition software is saved in one file format but is converted to a different format for analysis, retain the acquired version of the data.\nFor data analysis, maintain a record of as many details as possible about the sample and acquisition settings. Key information to retain includes the genotype of the dissected larvae, the age of the larvae prior to dissection, the state of the meal cap they were reared in, the laser power used during imaging, the exposure time, the length of acquisition, and the temporal resolution.\n7. Example quantification of cell cycle length (Figure 5)\nNOTE: in this example, larvae expressing the polarity marker Pins (Pins::EGFP16) and the microtubule-binding protein Jupiter25 (cherry::Jupiter13) were imaged. The subsequent analysis was performed using Imaris software.\nOpen the movie using the image analysis software of choice. Scroll through the length of the movie to identify dividing NBs, and label them for future reference. Identify the dividing NBs by their distinct mitotic spindles (Figure 5C-E).",
    "Identify a reference cell cycle stage to determine the cell cycle length. In this example, metaphase is used as a reference.\nManually determine the number of frames between successive metaphases, and convert it to minutes or hours to determine the time taken to complete one cell cycle.\n\t\nDo this by taking the temporal resolution of the movie and multiplying it by the number of frames between metaphases. For example, if the temporal resolution of the movie is one frame every 5 min, and metaphases are observed in frame 13 and frame 35, the time between these metaphases would be 110 min ([35 − 13] × 5).\nPlot the data with any appropriate software. The data shown here were plotted using PRISM software.\n8. Example quantification of cell spindle alignment (Figure 5)\nNOTE: In this example, the analysis is performed using Imaris software.\nOpen the movie file in Imaris or another software of choice. Scroll through the length of the movie to identify dividing NBs, and label them for future reference.\nDetermine the vector formed by the spindle poles using the apical and basal centrosomes (represented by m), as follows:\nimgsrc://cloudfront.jove.com/files/ftp_upload/65538/65538eq01.jpg\n\twhere Ax, Ay, and Az are the coordinates of the apical centrosome, and Bx, By, and Bz are the coordinates of the basal centrosome. Similarly, the axis of the division vector (represented by n) is formed by the midpoint of the apical Pins::EGFP crescent and the basal cortex:\nimgsrc://cloudfront.jove.com/files/ftp_upload/65538/65538eq02.jpg\n\twhere Ax, Ay, and Az are the coordinates of the midpoint of the Pins::EGFP crescent, and Bx, By, and Bz are the coordinates of the midpoint of the basal cortex.\nDetermine the magnitude of the vectors m and n:\n\tMagnitude of m: imgsrc://cloudfront.jove.com/files/ftp_upload/65538/65538eq03.jpg\n\tMagnitude of n: imgsrc://cloudfront.jove.com/files/ftp_upload/65538/65538eq04.jpg\nDetermine the dot product (represented by k) of m and n:\nimgsrc://cloudfront.jove.com/files/ftp_upload/65538/65538eq05.jpg",
    "Using the dot product k and vector magnitudes m and n, determine the angle between the vectors:\nimgsrc://cloudfront.jove.com/files/ftp_upload/65538/65538eq06.jpg\nPlot the data in the software of choice. The data shown here were prepared in Microsoft Excel and visualized in PRISM.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}