{
  "id": 1830,
  "origin_website": "Cell",
  "title": "Multiplexed single-cell RNA-sequencing of mouse thymic and splenic samples",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nHarvesting T cells from thymus and spleen\nTiming: 2 h\nThis section describes how to obtain mouse T cells from thymus and spleen.\nDecontaminate working spaces with 70% ethanol before beginning.\nEuthanize mice with carbon dioxide.\nNote: Use this method instead of cervical dislocation to preserve the thymus.\nSterilize the skin with 70% ethanol.\nDissect the mice, collect thymus and spleens, and place each organ in 5 mL of PBS1×/2%FBS.\nPlace a 70 μm cell strainer on the top of a 50 mL conical tube, then moisten the strainer by adding 2 mL of PBS1×/2%FBS. Grab the organ with tweezers and transfer it onto the cell strainer.\nWith the flat end of a syringe piston, dilacerate the organ and add around 10 mL of PBS1×/2%FBS with a pipette to help the dilaceration and to wash the strainer.\nRemove the cell strainer and centrifuge (7 min, 450 rcf, 15°C) the 50 mL conical tube containing the filtered cell suspension.\nRemove the supernatant.\nResuspend splenic cell pellet in 2 mL of Red Blood Cell (RBC) lysis buffer, and incubate at room temperature (RT; 20°C–25°C) for 10 min. Then, add 10 mL of PBS1×/2%FBS and centrifuge (7 min, 450 rcf, 4°C). Remove the supernatant and resuspend cell pellet in 10 mL of PBS1×/2%FBS.\nIn parallel to the RBC treatment of splenic samples, resuspend the thymic cell pellet in 10 mL of PBS1×/2%FBS.\nNote: RBC lysis is optional for thymic cells, as thymus usually contains low numbers of erythrocytes.\nTake 5 μL of cells and mix them with 45 μL of trypan blue (previously diluted at 1:1 ratio with PBS1×).\nLoad cell mixture onto a hemocytometer. Using a microscope, count viable cells which correspond to bright cells that are not stained in blue.",
    "Centrifuge 50 mL conical tubes containing 10 mL of cell suspension (7 min, 450 rcf, 4°C).\nResuspend the pellet in PBS1×/2%FBS at 10 × 106 cells/mL or 100 × 106 cells/mL when a purification step is required (see note below).\nNote: To avoid the sequencing of unwanted cells, a cell purification step might be required to enrich the sample for a cell population of interest, or to remove dead cells. We use EasySep™ Mouse T Cell Isolation Kit to purify T lymphocytes from the spleen. Moreover, if more than 20% dead cells are observed, EasySep™ Dead Cell Removal-Annexin V Kit can be applied to remove dead cells. As an alternative, the autoMACS® Pro Separator (Miltenyi Biotec technology; cat#: 130-092-545) with Dead cell removal kit (Miltenyi Biotec technology; Cat#: 130-090-101) can be used.\nSample labelling with Ab-HTO\nTiming: 2 h\nIn this procedure, we utilized antibodies tagged with hashtag oligonucleotides (Ab-HTO) from BioLegend. These antibodies are a mix of anti-CD45 and anti-MHC-I antibodies. TotalSeq™-A anti-mouse Hashtag reagents are used with Chromium™ Single Cell 3′ kit, while TotalSeq™-C with Single Cell 5′ kit.\nTransfer approximately 500,000 cells (50 μL of 10 × 106 cells/mL suspension) of each sample into a 1.5 mL microcentrifuge tube.\nNote: We advise to perform the assay with more than 50,000 cells. With a small number of cells (less than 50,000 cells) we noticed a tendency to lose cells during washing steps.\nCompared to 5 mL polystyrene tubes (FACS tubes), we observed better outcomes with microcentrifuge tubes. Indeed in the latter, cell pellet is clearly visible and the supernatant can be thoroughly and safely removed.\nDilute Fc block (CD16/CD32 antibody) to 1/100 in PBS1×/2%FBS, take 5 μL and add it to the cell suspension.\nIncubate 10 min at 4°C.",
    "Add 1 μL of a distinct Ab-HTO (0.5 μg) to each sample and record their assignment.\nIncubate 30 min at 4°C.\nTransfer 1/10 of your cell volume to a FACS tube and proceed with quality control of Ab-HTO labelling (steps 26 to 32). For the remainder of the sample proceed to step 21.\nAdd 1 mL of PBS1×/2%FBS and centrifuge (5 min, 700 rcf, 4°C).\nRemove the supernatant and resuspend in 1 mL of PBS1×/2%FBS. Centrifuge (5 min, 700 rcf, 4°C).\nRepeat the washes (step 22) three more times. The last wash is performed in 1 mL PBS1×/0.04%BSA.\nNote: Thorough washing steps are necessary to remove free Ab-HTO (see troubleshooting 1[href=https://www.wicell.org#sec6.1]).\nAfter the last wash, resuspend cell pellet in 100 μL of PBS1×/0.04%BSA.\nCount cells as described in steps 11 & 12. (We advise to perform cell counting in duplicate).\nCritical: Follow the washing procedure in order to eliminate free Ab-HTO.\nValidation of Ab-HTO labelling\nTiming: 1H30\nThis section can be skipped; however it is highly recommended (see troubleshooting 2[href=https://www.wicell.org#sec6.3]). Indeed, if cells are not properly labeled with Ab-HTO, samples will not be accurately demultiplexed and the full scRNA-seq experiment is at stake. This section is carried out in parallel to ‘sample labelling with ab-HTO’.\nNote: Sequence of biotinylated oligonucleotides differs according to the Ab-HTO used: TotalSeq™-A, B or C (see Key Resources Table[href=https://www.wicell.org#krt]).\nAdd 5 μL of biotinylated oligo (previously diluted to 1 μM in PBS 1×) to the cell suspension from step 20.\nIncubate 30 min at RT.\nAdd 1 mL of PBS1×/2%FBS and centrifuge (5 min, 700 rcf, 4°C). Remove the supernatant.\nResuspend cell pellet in 50 μL PBS/2%FBS and add 0.1 μg of fluorescent Streptavidin (herein we used 5 μL of Streptavidin-BV421 previously diluted at 1/100).\nIncubate 15 min at 4°C in the dark.",
    "Add 1 mL of PBS1× and centrifuge (5 min, 700 rcf, 4°C).\nUse flow cytometry to check the percentage of Streptavidin-BV421 positive cells (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1309-Fig1.jpg\nFigure 1. Quality control of cell labelling with antibodies coupled to HTO (Ab-HTO)\n(A) Scheme of the Ab-HTO labelling validation workflow. Cells labelled with Ab-HTO are incubated with complementary biotinylated oligonucleotides. After a wash in PBS1×/2%FBS, streptavidin coupled to BV421 was added.\n(B–D) FACS analysis. (B) Negative control corresponds to cell incubated only with biotinylated oligonucleotides and streptavidin-BV421 (without Ab-HTO). (C and D) Cells incubated with an Ab-HTO, biotinylated oligonucleotides and streptavidin-BV421. (C) Cells are properly labelled with Ab-HTO. (D) 40% of cells are unlabelled. We consider that this sample does not pass the quality control of the ‘Ab-HTO labelling’ step and thus should not be used for multiplexed scRNA-seq experiment.\nNote: We expect all cells to be labelled with Ab-HTO. Do not proceed to scRNA-seq assay if less than 90% of cells of interest are labelled.\nPooling\nTiming: 15 min\nPool the different samples at your chosen ratio. In Nozais et al. (2021)[href=https://www.wicell.org#bib3] up to 8 samples were mixed in PBS1×/0.04%BSA for a total of 25 000 cells.\nProceed to single-cell emulsion (step 34) as soon as possible because keeping cells for extended time may increase cell death. To save time, we recommend that two investigators carry out sample preparation up to step 33 (samples pooling), especially if many samples are processed.\nLibraries preparation\nTiming: 2.5 days\nProceed with single-cell emulsion using the 10× Genomics Chromium Controller according to manufacturer instructions (CG000185 Rev B user guide).\nCritical: As described in 10× Genomics user guide, you should obtain a uniform emulsion. The presence of a large ‘clear’ phase indicates a problem in gel beads-in-emulsion (GEM) generation, putting at stake the success of the assay.",
    "Prepare libraries for scRNA-Seq using Chromium™ Single Cell 3′ Library & Gel Bead Kit v3 (ref: PN 1000075). Follow 10× Genomics CG000185 Rev B user guide, except for cDNA amplification mix and for HTO library construction (see below).\ncDNA amplification (step 2.2.a. from CG000185 Rev B user guide). Proceed with the following change (in order to amplify the HTO along with the cDNA):\ntable:files/protocols_protocol_1309_5.csv\nCell surface protein (or HTO) Library construction (step 4.1 from CG000185 Rev B). Proceed with the following changes:\nPrepare sample Index PCR mix (we used KAPA HiFi PCR master mix as it gives rise to the same quality results as the 10× Genomics Amp Mix. KAPA HiFi has the advantage of being available independently of the 10× library kit).\ntable:files/protocols_protocol_1309_6.csv\nIncubate in a thermal cycler with the following parameters (adapted to the use of KAPA HiFi).\ntable:files/protocols_protocol_1309_7.csv\nNote: When using 10× Genomics 5′ kit we use the protocol CG000186 Rev A[href=https://assets.ctfassets.net/an68im79xiti/qK5OD1PkukyaGakaui8yC/665db7617ec8de13b40f8c84b25e9366/CG000186_ChromiumSingleCellV_D_J_ReagentKit_FeatureBarcodingtechnology_RevA.pdf].\nQuality control of library\nTiming: 1 h\nAfter preparation of the libraries, size verification is required (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1309-Fig2.jpg\nFigure 2. Quality control of cDNA and HTO libraries\nAfter library construction, 1 μL of each library is loaded onto Agilent Bioanalyzer High Sensitivity DNA chip.\n(A and B) Typical examples of Bioanalyzer electropherogram traces of cDNA (A) and HTO (B) libraries are shown. From these traces we define average library size: 200 bp for HTO and usually around 400 bp for cDNA.\n(C) These sizes are used to calculate the molar concentration of libraries. The two libraries are pooled and reanalyzed on the Bioanalyzer (C) and then sequenced.\nMeasure the concentration of the libraries with Qubit dsDNA HS™ Assay Kit as described by the manufacturer’s instructions.",
    "Load 1 μL of your libraries onto a High Sensitivity DNA chip (Agilent™) (concentration should not exceed 10 ng/μL – otherwise dilute in nuclease free water before loading).\nCheck the quality of HTO and cDNA libraries (see Figure 2[href=https://www.wicell.org#fig2] that displays good quality library profiles, and troubleshooting 3[href=https://www.wicell.org#sec6.5]) and determine the average fragment size.\nLibrary pooling\nTiming: 30 min\nThis section details the method used for the pooling of libraries.\nDilute both HTO and cDNA libraries to a final concentration of 4 nM.\nNote: We use this formula to calculate molar concentration:\n    Q u b i t  c o n c e n t r a t i o n   ( n g / μ L )    660 × A v e r a g e  l i b r a r y  s i z e   ( b p )     ×  10 6   \nIn the example in Figure 2[href=https://www.wicell.org#fig2], the average size of the cDNA library is 396 bp and the Qubit concentration is 30.6 ng/μL, thus molar concentration of the cDNA library is 117 nM. Dilute 3.42 μL of the library up to 100 μL with nuclease-free water to obtain a solution of 4 nM. Check the concentration of the diluted library with Qubit dsDNA HS™ Assay Kit.\nPool the 4 nM libraries. We usually use a ratio of 8% HTO and 92% of cDNA, thus in our example 92 μL of cDNA library are mixed with 8 μL of HTO library. Then quantify DNA concentration of the final pool with Qubit dsDNA HS™ Assay Kit as described at step 38.\nSequencing and demultiplexing\nTiming: 2–3 days",
    "This section addresses the main steps of sequencing data processing in order to demultiplex the different samples. For more details on all the pre-processing steps, please refer to the GitHub repository (see data and code availability[href=https://www.wicell.org#da0010]). This process requires the use of UNIX-based tools and R.\nNote: We obtain FASTQ files from the sequencing facility however one can start from BCL requiring an extra step for FASTQ generation.\nSequence the pool. We used Illumina Next-seq 500 system and the following parameters: Read 1: 26 cycles, i7: 8 cycles & Read 2: 57 cycles.\nReads from cDNA library are aligned to the mm10 version of the mouse genome and quantified using Cell Ranger count function (Zheng et al., 2017[href=https://www.wicell.org#bib7]).\nNote: The summary of reads assembly and quantification process from Cell Ranger can be found on the web_summary.html file after the run. Based on our experience, the expected number of cells is approximately one third of the number of loaded cells and the number of median genes per cell is 1000-1 500 (these numbers are cell type specific). A lower number of captured cells may be caused by the inclusion of too many dead/damaged cells.\nReads from HTO library are quantified using CITE-seq-count (Roelli et al., 2019[href=https://www.wicell.org#bib5]). We utilized -cbf 1, -cbl 16, -umif 17, -umil 26 and -max-error 2 as parameters (see CITE-seq-count documentation for more information about the parameters).\nLoad HTO and cDNA matrices in Seurat (Stoeckius and Zheng, 2018[href=https://www.wicell.org#bib6]) and keep only cell-barcodes that are found in both matrices. To create a Seurat object, we use these parameters:\nRemove low quality cells expressing less than 200 genes and/or more than 10% mitochondrial genes.\nRemove genes that are expressed in less than 3 cells.",
    "Note: The detailed code to setup a Seurat object comprising cDNA and HTO data can be found on Seurat website “Demultiplexing with hashtag oligos (HTO)[href=https://satijalab.org/seurat/articles/hashing_vignette.html]”.\nNote: These thresholds can be modified according to the cell type present in a given experiment. Mitochondrial fractions can also vary experiment-to-experiment, so thresholds should be based on the observed distributions.\nNormalize HTO matrices using the Centered Log Ratio (CLR) transformation across cells.\nDemultiplex your sample to identify the droplet samples of origins.\nNote: For demultiplexing we use MULTIseqDemux function (McGinnis et al., 2019[href=https://www.wicell.org#bib2]). An alternative is HTODemux which is used in Seurat.\nRemove from the Seurat object cell-barcodes identified as negative or doublet.\nNote: The use of Ab-HTO facilitates inter-sample doublet removal. Indeed, two different HTO harboring the same 10× barcode indicates that two cells were simultaneously encapsulated in one droplet (Figure 3[href=https://www.wicell.org#fig3]). Yet there is still the possibility to have intra-sample doublets.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1309-Fig3.jpg\nFigure 3. Labelling of samples with different Ab-HTO facilitates the removal of cell doublets\n(A) tSNE plot highlighting the position of cells identified as doublet after demultiplexing.\n(B) Example of the co-occurence of two HTO. Upper panels are tSNE plot showing the normalized counts of \"Spleen HTO#1\" in red (on the left) and \" Thymus HTO#2’ in green (on the right) in each cells. The bottom panel shows the tSNE colored according to the normalized counts for the two HTO of interest. The arrows are pointing a group of doublet cells from \"Spleen HTO#1\" and \"Thymus HTO#2 \" samples. The color code is indicated.\nQuality control of sequencing data\nIn this section, we describe some critical metrics from Cell Ranger report. The parameters given below are for T cells and might differ for other cell types.",
    "We expect a minimum of 400,000,000 reads to be sequenced yielding approximately 1000 median genes per cell and 100,000 read per cell. To identify a meaningful number of genes, we attempt to reach around 80% of saturation (see troubleshooting 4[href=https://www.wicell.org#sec6.7]).\nAmong other important parameters, we check the sequencing read and mapping quality. The percentage of reads (barcode, UMI and RNA reads) having a Q-score > 30 should be > 80%, and the percentage of reads mapped confidently to the genome should be higher than 80%.\nMoreover, the fraction of reads that contains a valid cell barcode should be higher than 70%. Lower percentage suggests that a high fraction of reads (coming from ambient RNA) are not associated with a detected cell (empty droplets), leading to a noisier dataset.\nNote: Depending on the cell type, those parameters may vary. Typically, cells expressing many genes such as tumoral cells may require to sequence more reads or to load less cells (see troubleshooting 4[href=https://www.wicell.org#sec6.7])."
  ],
  "subjectAreas": [
    "Rnaseq",
    "Sequence Analysis",
    "Immunology",
    "Bioinformatics",
    "Antibody",
    "Flow Cytometry",
    "Sequencing",
    "Single Cell"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology"
  ]
}