{
  "id": 18853,
  "origin_website": "Jove",
  "title": "An Affordable HIV-1 Drug Resistance Monitoring Method for Resource Limited Settings",
  "procedures": [
    "1. Ethylenediaminetetraacetic Acid (EDTA) Whole Blood Processing\nNote: Blood can be processed immediately after collection of can be stored at 4 °C for no more than 24 hr.\nWorking in a biosafety cabinet, allow the EDTA whole blood sample to reach room temperature.\nFor each sample, label enough cryovials with the sample identification (ID), storage material (plasma), and date.\nCentrifuge the samples for 10 min at 1,000 x g. Do not use brakes to stop centrifuge. This will yield three layers (from top to bottom): plasma, leucocytes (buffy coat) - a very thin layer - and erythrocytes, including platelets.\nCarefully aspirate the supernatant (plasma) and aliquot 500 ml into each cryovial. Take care not to disrupt the cell layer (buffy coat) or transfer any cells.\nStore at -80 °C until needed for RNA extraction or proceed to RNA extraction immediately.\n2. RNA Extraction\nPrepare an extraction worksheet with the IDs of the samples to be extracted including positive and negative plasma controls.\nFor each sample to be extracted, label a 1.5 ml sterile microcentrifuge tube with the sample ID, extraction date and “RNA”. Also label an assembled column and collection tube as well as a 2 ml microcentrifuge tube containing working lysis solution with corresponding numbers from the extraction worksheet.\nWorking in the Bio-Safety Cabinet, add 200 µl sample to the corresponding 2 ml microcentrifuge tube of working lysis solution.\nVortex well and incubate for 10 min at room temperature.\nAfter 10 min, centrifuge the tube briefly.\nAdd 800 ml of absolute ethanol to each of the tubes.\nMix by pulse vortexing and briefly centrifuge.\nTransfer 600 µl of this solution to the corresponding column/collection tube assembly. Centrifuge at 6,000 x g for 1 min.",
    "Transfer column to a new collection tube and discard the old collection tube containing the filtrate. Repeat the above step 2.8 (above) twice more.\nAdd 500 µl wash buffer AW1 to each column and centrifuge at 6,000 x g for 1 min.\nDiscard the filtrate and collection tube and transfer the column to a new collection tube.\nAdd 500 µl was buffer AW2 and centrifuge at 20,000 x g for 3 min. Repeat step 2.11.\nCentrifuge in a new collection tube at 20,000 x g for an additional 2 min.\nDiscard filtrate and place column in 1.5 ml microcentrifuge tube.\nAdd 60 µl Buffer AVE (RNase free water) to the middle of the column ensuring that you do not dispense the liquid on the side of the column.\nIncubate at room temperature for 1 min.\nCentrifuge at 6,000 x g for 2 min.\nDiscard the column and cap the 1.5 ml microcentrifuge tubes.\nThe samples are now ready for reverse transcription.\nIf testing is to be performed immediately, store at 4 °C for up to 6 hr. However, if testing is to be delayed then place at -80 °C immediately. NB: do not freeze/thaw the samples more than 3x.\n3. Reagent Preparation for Reverse Transcription\nBefore starting, calculate the volumes of each of the reagents required for the number of samples being processed including, the positive and negative plasma controls. Also add a reagent control.\nUsing the calculated volumes from step 3.1 (above), prepare the deoxyribonucleotide triphosphate (dNTP)-primer mix in a clean, sterile 200 µl PCR tube followed by briefly pulse vortexing. Each sample should have 0.5 µl of the reverse primer RT21 and 0.5 µl of the dNTP, see Table 2.\nAliquot 1.0 µl of the dNTP-primer mix to 200 µl PCR tubes.",
    "Prepare reverse transcriptase (RT) enzyme mix by adding 1 µl of the 10x reverse transcription buffer, 1 µl of 0.1M DTT and 2 µl of 25mM MgCl2 to a sterile tube followed by vortexing and briefly centrifuging, see Table 3.\nAdd 0.5 µl each of the enzymes RNAseOUT and Superscript III reverse transcriptase to the enzyme mix tube then tap the tube gently to mix.\nKeep the tubes with the dNTP-primer mixes and enzyme mix on a cold block and move to the RNA station.\n4. Reverse Transcription\nAdd 6 µl of the RNA sample to the dNTP-primer mix tube followed by briefly vortexing to mix.\nAfter the addition of the RNA, move to the PCR room with both dNTP/primer/RNA mix and RT Enzyme mix tubes on a cold block or ice.\nBriefly centrifuge the dNTP/primer/RNA mix tubes (from step 4.2) and place them into a thermocycler.\nHeat at 65 °C for 5 min to denature the RNA.\nRapidly cool to 4 °C, hold for 2 min.\nPause the thermocycler while still at 4 °C; take out the tubes.\nQuickly add 5 µl of the enzyme mix while keeping the tubes on a cold block.\nMix gently by tapping the tube then briefly centrifuge the tubes and return to the thermocycler.\nHold the tubes at 50 °C for 60 min to reverse transcribe the RNA followed by enzyme denaturation at 85 °C for 5 min to stop the reverse transcription.\nCool to 37 °C. As soon the temperature gets to 37 °C, pause and take the tube out of the thermocycler.\nQuickly add 0.5 µl of RNAse H to the tubes and return to the thermocycler.\nHold at 37 °C for 20 min and then cool to 4 °C.",
    "The complementary DNA (cDNA) can be used immediately or can be stored at -20 °C or colder until needed. However, the long term storage of cDNA should be at -80 °C.\n5. Reagent Preparation for PCR\nBefore starting, calculate the volumes of each of the reagents required for the number of samples being processed and the controls. In addition to the three controls (Positive, Negative, and Reagent), you can also add a PCR control (HIV DNA). The first and second round PCR mixes can be prepared simultaneously and the second master mix stored at -20 °C until needed. Mixes can be stored for approximately 8 hr.\nAdd 18.4 µl water, 2.5 µl 10x buffer, 1.0 µl MgCl2, 0.5 µl dNTPs, and 0.25 µl of each of the primers as shown on Table 4 and vortex.\nAdd 0.1 µl of Platinum Taq polymerase (5U/µl) and gently mix the tube by tapping it.\nAliquot 23 μl of the master mix to 200 μl PCR tubes.\nWith the master mix tubes on a cold block or ice move to the PCR room.\n6. Nested PCR\nAdd 2 µl of the cDNA to 23 µl of the 1st round PCR master mix.\nClose the tubes, put the samples in the thermocycler and use the following PCR cycling conditions: 94 °C for 2 min, 30 cycles of 95 °C for 30 sec, 58 °C for 20 sec, and 72 °C for 2 min, followed by a final extention at 72 °C for 10 min as shown on Figure 1.\nimgsrc://cloudfront.jove.com/files/ftp_upload/51242/51242fig1.jpg\nFigure 1. Nested PCR cycling conditions. Click here to view larger image.[href=https://www.jove.com/files/ftp_upload/51242/51242fig1highres.jpg]\nContinue to the 2nd round PCR stage or store the 1st round PCR products at -20 °C or colder until required at a later stage.",
    "For 2nd round PCR, add 2 µl of the 1st round PCR product to 23 µl of the 2nd round PCR master mix and use the same PCR program on Figure 1.\n7. Gel Electrophoresis\nGel preparation\n\t\nAdd a 0.5 g of agarose tablet to a 250 ml glass flask and add 50 ml of 1x TBE buffer to the flask.\nHeat in microwave to boiling; swirl frequently (approximately every 30 sec) until completely solubilized. Use a silicone grip or silicone oven glove to grasp the hot flask. The agarose solution can boil out of the flask very easily so closely monitor this process.\nCool at room temperature for approximately 10 min.\nPour agarose into a gel casting tray containing appropriate size comb; gel is ready to use in approximately 20-30 min.\nPlace gel in electrophoresis chamber and run as recommended by the manufacturer.\nGel electrophoresis and visualization.\n\t\nVortex Novel Juice for 10 sec prior to use.\nDilute 1 µl of Novel Juice with 5 µl of DNA sample and mix.\nDilute 3 µl of Novel Juice with 3 µl of molecular weight marker and mix.\nLoad the mixes from sections 7.2.2 and 7.2.3 (above) and run the gel at 100 V and 400 mA for 40 min to evaluate the PCR amplification.\nPositive amplification can be visualized under UV light as 1,315 bp fragment, Figure 2.imgsrc://cloudfront.jove.com/files/ftp_upload/51242/51242fig2.jpg\nFigure 2. Gel confirmation of PCR amplification using 1% agarose gel electrophoresis and a 200 bp ladder. Click here to view larger image.[href=https://www.jove.com/files/ftp_upload/51242/51242fig2highres.jpg]\nThere should be no amplification in the Negative and reagent controls, thus indicating absence of contamination.\n8. PCR Product Cleanup\nIn preparation for the sequencing reaction, the positive second round PCR products are cleaned up using the PureLink PCR purification kit.",
    "Add 80 μl of working Binding buffer High-Cutoff (B3) to 20 µl of PCR product and pipette mix.\nAdd the sample mixed with the binding buffer to a spin column in a collection tube.\nCentrifuge the column at 10,000 x g for 1 min. Transfer the column into a new collection tube.\nWash the column with 650 µl of Wash Buffer with ethanol.\nCentrifuge the column at 10,000 x g for 1 min. Transfer the column into a new collection tube.\nCentrifuge the column at maximum speed for 2-3 min to remove any residual wash buffer.\nPlace the spin column in a clean 1.7 ml elution tube supplied with the kit.\nAdd 40 µl of elution buffer to the center of the column and incubate the column at room temperature for 1 min.\nCentrifuge the column at maximum speed for 2 min (>10,000 x g).\nThe elution tube contains your purified PCR product ready for sequencing. Discard the column.\nDetermine the concentration and quality of the DNA using a Nanodrop.\nIf no in-house sequencing facilities are available, the purified PCR products can be sent to a commercial sequencing lab at this stage.\n9. Sequencing Reactions\nThe PCR products are sequenced using the big dye terminator kit version 3.1 and 4 primers for each sample (two forward and two reverse). The primer sequences are shown in Table 2. Therefore, after the sequencing run, each sample will have four sequences to be assembled into a contig.\nSet up the sequencing reactions as indicated in Table 5 for each of the four primers.\nMix the sequencing buffer and the primers by vortexing before use.\nMix the water, buffer and primer before the addition of the big dye sequencing. Mix by vortexing.",
    "Gently mix the master mix after adding the big dye sequencing mix by inverting the tube or tapping it gently.\nAliquot 9 µl of the master mix into a 96-well optical plate.\nIn order to run 24 samples/plate, set up the plate as indicated below Figure 3.\nimgsrc://cloudfront.jove.com/files/ftp_upload/51242/51242fig3.jpg\nFigure 3. Scheme representation of a 96-well plate with 12 patient samples being sequenced with 4 primers each (RTC1F, RTC2R, RTC3F, and RTC4R). Click here to view larger image.[href=https://www.jove.com/files/ftp_upload/51242/51242fig3highres.jpg]\nAdd 1.0 µl of the DNA sample (~20-40 ng), cover the plate with an adhesive aluminum cover and then gently mix it.\nCentrifuge at 3,000 x g for 1 min. Remove the aluminum cover and add a rubber sealing mat.\nPlace the plate on the thermocycler and run the following cycling program shown in Figure 4.\nimgsrc://cloudfront.jove.com/files/ftp_upload/51242/51242fig4.jpg\nFigure 4. PCR cycling conditions for sequencing. Click here to view larger image.[href=https://www.jove.com/files/ftp_upload/51242/51242fig4highres.jpg]\nWhen the PCR finishes, clean up the sequencing product immediately.\n10. Sequencing Cleanup\nFor each sequencing reaction, mix 50 μl absolute ethanol and 5 μl 3 M sodium acetate.\nUsing a multichannel pipette, add 55 μl of the sodium acetate/EtOH solution to each well.\nSeal wells with adhesive aluminum cover, ensuring that each well is sealed properly.\nCentrifuge at 3,000 x g for 20 min.\nAfter 20 min, remove cover and invert the plate, in one smooth motion, onto a folded lab tissue (DO NOT bang to get rid of supernatant as this will dislodge the pellet!).\nCentrifuge the inverted plate on the same tissue at 150 x g for 2 min.\nImmediately add 150 μl cold 70% EtOH. DO NOT delay addition of ethanol at this step.\nSeal with the same adhesive aluminum cover and vortex.\nCentrifuge at 3,000 x g for 5 min.",
    "Invert plate onto a new folded tissue and centrifuge inverted at 150 x g for 1 min.\nAfter the centrifugation, place uncovered in thermocycler and dry it at 50 °C for 2 min.\nOnce the plates is dry, seal it with adhesive foil covers, wrap in foil and store at -20 ˚C until ready to proceed with the sequencing electrophoresis.\nWhen ready to sequence, dissolve cleaned sequencing products in 10 ml Hi-Di formamide, denature and load for electrophoresis.\n11. Bioinformatics\nSequence Assembly\n\t\nLaunch the program Geneious.\nCreate a working folder to store the sequences.\nImport the ABI files generated by the sequencing machine to the working folder using the import tool. Geneious will allocate percentage quality score for each sequence imported.\nOpen sequences with quality scores >70% by double clicking on them.\nEach file should open in a new window. The software will indicate the quality at each nucleotide position of the chromatogram of the sequence quality using light blue bars. The higher the bar, the better the quality of the base call.\nUsing the cursor, select the mid section of the sequence leaving out the ends, which are usually of poor quality.\nClick on the extract button to extract the region with good quality sequence.\nSelect all four extracted sequences for each sample and assemble them against a reference sequence.\nInspect the assembled sequence to ensure that you are in the correct reading frame. If you are in the correct reading frame, the beginning of Protease should start with the following amino acids: PQITLW. The beginning of RT will start with PISPIE.\nExtract the contig region covering the beginning of PR to the 300th RT codon. During this process, also check for insertions or deletions.",
    "Go through the consensus sequence of the extracted contig, identifying any ambiguities and verify positions with mixed bases by inspecting quality (symmetry, height, background and shoulders of flanking regions) of the base calls.\nSelect the consensus sequence and click the extract button to create a separate file of the consensus sequence from the four primers and label it appropriately.\nExport the sequence to a backup storage folder on the computer or a network folder.\nSequence Quality Assessment (HIVDB)\n\t\nAnalyze the sequence using the HIVDB program at http://hivdb.stanford.edu[href=http://hivdb.stanford.edu].\nCheck for deletions and insertions in the summary data and ensure that the sequence covers all the 99 protease (PR) codons and the 1st 300 RT codons.\nCheck for any highlighted quality assurance (QA) issues in both the PR and RT regions, such as stop codons, frame shifts, ambiguous positions and unusual residues.\nSequencing Quality Control\n\t\nBlast the new sequence against a local sequence database from previous run.\nIf the new sequence is >97% similar to any sequence in the database, all the stages of the protocol should be reviewed, starting with the sequence analysis and going back to the RNA extraction to ensure that there were no mix ups (sample switching, mislabeling) or contamination.\nIf no problems are identified, repeat the analysis of both the old and new samples from the RNA extraction stage.\nIf the sequences are still >97% similar, review the patient history to assess for any epidemiologic linkage between the individuals.\nPhylogenetic Analysis\n\t\nAlign all the sequences from the database using ClustalW program in Geneious.\nManually check the alignment for misaligned sequences, deletions and insertions and edit accordingly.\nConstruct a phylogenetic tree using PHYML, Geneious tree builder or other tree builders in Geneious.\nExamine the tree for samples with short branch lengths.",
    "Review the samples with short branch lengths for possible contamination.\n12. REGA DB Informatics\nSequence Upload\n\t\nLog into the RegaDB using a unique username and password.\nOn the drop down menu, under Patient ID, select “Begins with”.\nAdd the patient ID and select the individual whose genotype is to be uploaded.\nOn the menu to the left, select “viral isolate”.\nFrom the options under viral isolate select “add”.\nEnter the Sample date, Sample I.D, Sequence I.D and Sequence date.\nSelect “choose file” and then navigate to the fasta file of the sequence to be uploaded.\nAfter selecting the fasta file to be uploaded, click on upload.\nOnce the uploaded sequence appears in the nucleotide box under the sequence identifies and dates, click the ok button at the bottom right of the window.\nCheck for PR and RT protein alignment by clicking the button protein and selecting either PR or RT.\nCheck for the drug resistance mutation by clicking on the resistance button. This gives you the resistance profiles from three algorithms: ANRS, Stanford HIVDB and RegaDB.\nReport generation using REGA\n\t\nLog into the RegaDB using your unique username and password.\nOn the drop down menu, under Patient ID, select “Begins with”.\nAdd the patient ID and select the individual whose report is to be generated.\nOn the menu to the right, select viral isolate.\nFrom the options under viral isolate click on “view”.\nDouble click on the viral isolate for which you want to create a report.\nOn the viral isolate window, click on the viral isolate report tab.\nSelect the algorithms for the interpretation of the genotype from the drop down menu and then select report template to use.\nOnce the algorithm and the template are selected, click on the button “generate”.\nDownload the rtf document generated.",
    "Open the rtf document as a word document.\nResize the treatment history chart.\nAfter the chart, add the section “Clinical chart and resistance interpretation”.\nUsing the data on the resistance table and the clinical chart, add a description of the patient’s resistance profile starting with the patient’s treatment history, and the drugs to which the viral isolate is resistant. Also add a description of the patient’s viral load and CD4+ cell count profiles from the chart.\nSend the report to the Infectious Diseases (ID) specialist for review and recommendations on future patient management. This process is also a very important quality assurance stage. Any errors in the genotype or inconsistences in the treatment history, virological and immunological profiles can be identified and reviewed before a final report is sent, with all the recommendations, to the clinician managing the patient."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}