{
  "id": 3825,
  "origin_website": "Cell",
  "title": "Dissociation of chick embryonic tissue for FACS and preparation of isolated cells for genome-wide downstream assays",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDissociate dissected embryonic tissue\nTiming: 1 h to process four samples in parallel\nThese steps describe the enzymatic treatment and physical homogenization procedures to dissociate dissected tissue pieces into single-cell solution ready for FACS isolation of targeted cells.\nDissect tissue of interest (e.g., cranial region of HH8-10 embryos (Williams et al., 2019[href=https://www.wicell.org#bib8]), in Ringers at 18°C–22°C, pipette into 1.7 mL low-bind microcentrifuge tube.\nBriefly spin the tissue in a table top mini-centrifuge and remove as much Ringers as possible.\nAdd 500 μL of the pre-warmed Dispase solution and pipette up and down gently 10 times using 1000 μL ART low-bind tip.\nIncubate for 15 min at 37°C, homogenizing every 5 min with a 1000 μL ART low-bind tip. Pipette 10–20 times against the wall of the tube to disrupt the tissue.\nCritical: Monitor dissociation by eye and adjust timing accordingly. Prolonged enzymatic digestion can affect cell integrity.\nAdd an equal volume (500 μL) of Trypsin solution, pipette up and down slowly to mix and incubate at 37°C for 3 min.\nStop the reaction by transferring the dissociated cells to 4 mL of Hank’s solution in a 50 mL falcon tube.\nCritical: Ensure cell solution goes directly into Hanks solution; do not run down the side of the tube. The large volume of Hanks solution is necessary to allow thorough homogenization of cells, regardless of how little tissue is included. These washes are also important to remove phenol red (from Dispase and Trypsin solutions) which auto-fluoresces and may interfere with gating.\nRinse the microcentrifuge tube with 1 mL of Hank’s solution and add to the cells in the 50 mL falcon tube.",
    "Prepare a 5 mL glass serological pipette, coat the inside with Hank’s solution by pipetting solution up and down several times. This minimizes loss of cells due to adhesion to the inside of pipette.\nHomogenize the dissociated cells by pipetting up and down 10–15 times against the bottom of the tube, avoiding cavitation.\nCentrifuge the dissociated cells at 500 g for 10 min at 18°C–22°C.\nDuring this spin place a 40 μm cell strainer into a new 50 mL tube and apply 1 mL Hanks to moisten the strainer before cells are applied.\nCritical: Be at the centrifuge as soon as it stops and move 50 mL tubes very carefully to avoid disturbing the fragile pellet, ideally work at the centrifuge. Remove the supernatant slowly using a 10 mL pipette (do not pour off) ensuring no pellet is aspirated.\nRe-suspend cells in 4 mL of Hanks solution using a pre-coated serological pipette as in step 8.\nTransfer the dissociated cells to the prepared 50 mL tube, by applying them to the moistened 40 μm cell strainer. Rinse the 50 mL tube from which resuspended cells were removed with 1 mL of Hanks solution and add to cell strainer.\nCentrifuge the 50 mL tube with cell strainer in place, at 750 g for 10 min at 18°C–22°C",
    "Remove the supernatant, as in step 11, leaving approximately 300–500 μL solution at the bottom of the tube to re-suspend the cells by gentle pipetting. Transfer to a 5 mL polystyrene round bottom tube used in the FACS sorter and keep on ice. Optional: Add 200 μL Hanks to the 50 mL tube. After main sample has been FAC-sorted, this sample can be processed as well. Optional: The integrity and number of dissociated cells can be checked using a hemocytometer. Mix 10 μL cells with 10 μL of trypan blue solution and load onto a hemocytometer.\nAdd 1 μL 7-AAD, or other compatible live-dead cell marker (7-AAD has broad excitation spectra, but emits at 647 nm and therefore cannot be used when detecting red fluorescent proteins).\nAlternatives: For sorting in the red fluorescence range (mCherry, tdTomato), Hoechst 33258 solution can be used.\nPrepare a few 1.7 mL low-bind tubes with ∼20 μL Hanks solution to collect cells into.\nCollect target cells by FACS\nTiming: Approximately 1 h\nDissociated tissue is now ready for FACS, target cells are collected and processed according to the downstream application.\nProceed to FACS. The FACS machine should be set to maintain the sample at 4°C throughout sorting. If multiple samples are being processed keep these on ice.\nUse control samples to establish gating parameters (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/547-Fig1.jpg\nFigure 1. Gating plots for collecting GFP-positive and -negative cells\n(A) Control sample, GFP-negative, derived from non-electroporated chick embryos.\n(B) Experimental sample, GFP positive (green) and negative (magenta) cells isolated from chick embryos electroporated with neural crest enhancer, NC1, driving GFP.\nCollect negative (non-fluorescent) cells from the same sample as positive cells to use as controls in downstream assays.",
    "Following FACS isolation of cells, proceed immediately to the downstream experiment or freeze using appropriate preservation method. Avoid leaving sorted cells on ice for excessive periods of time.\nDownstream applications: ATAC-seq\nTiming: total 3–3.5 h (hands on = 2–2.5 h)\nThis section describes how to wash and lyse FACS sorted cells before performing Assay for Transposase Accessible Chromatin (ATAC), subsequent library preparation, clean-up steps and quality checks. This protocol has been modified from (Buenrostro et al., 2013[href=https://www.wicell.org#bib1]). See this publication for full details of methodology.\nPrepare ATAC lysis buffer on ice. Allow 50 μL per sample.\ntable:files/protocols_protocol_547_5.csv\nPlace an aliquot of PBS on ice (50 μL per sample) and allow to chill for approximately 15 min.\nCentrifuge cells collected by FACS at 500 g for 5 min at 4°C.\nRemove the supernatant by careful pipetting and wash the cell pellet with 50 μL of ice-cold PBS and centrifuge as step in 24.\nRemove the supernatant (PBS) and gently resuspend cells by pipetting 3–5 times in 50 μL of ATAC lysis buffer, centrifuge at 500 g for 10 min at 4°C.\nPrepare the transposition mix. The reaction detailed below is appropriate for 10,000 cells, scale up or down accordingly for different cell numbers.\nNote: For less than 10,000 cells keep final volume at 10 μL but adjust the amount of enzyme to avoid over-tagmentation (Figure 1[href=https://www.wicell.org#fig1]D). The minimum number of cells we have successfully performed ATAC-seq with is ∼250.\ntable:files/protocols_protocol_547_6.csv\naWe have found new aliquots of enzyme can be “hyper active” and tend to over-tagment (Figure 2[href=https://www.wicell.org#fig2]D). Optimization may be required. Enzyme activity may reduce over time and re-optimization will be required.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/547-Fig2.jpg\nFigure 2. Examples of ATAC profiles from Agilent TapeStation\n(A) TapeStation HS D1000 ladder.\n(B) Appropriate tagmentation yields multiple peaks of accessible chromatin at approximately 150 bp intervals.",
    "(C) Under-tagmentation results in predominantly large (>1 kb) fragments of chromatin.\n(D) Conversely, over-tagmentation results in predominantly small (~200 bp) pieces of chromatin.\nRemove lysis buffer and resuspend the cells in transposition mix.\nIncubate the cells at 37°C for 30 min to tagment the DNA.\nIf working with cell numbers >2000, proceed directly to step 31. If working with cell numbers <2000 cells, it is recommended to add 1.1 μL 0.5 mM EDTA to the reaction volume at the end of step 29 and incubate the tube for further 30 min at 50°C to stop the transposition reaction. This will promptly remove the transposase enzyme from the chromatin and prevent over-tagmentation of the chromatin. After 30 min at 50°C add 1.1 μL of 0.5 mM MgCl2 to the reaction, as EDTA chelates magnesium, which is essential for DNA polymerase activity. Proceed directly to step 32 as purification of low input samples can result in significant loss of material.\nImmediately purify the reaction using Qiagen PCR purification MinElute kit. Elute transposed DNA in 10 μL of elution buffer.\nSetup the PCR amplification reaction as listed below.\ntable:files/protocols_protocol_547_7.csv\naUse different indices for samples that will be pooled together for sequencing.\nAmplify the transposed DNA fragments using the following cycling protocol.\ntable:files/protocols_protocol_547_8.csv\naMore cycles can be added to unpurified reaction if insufficient material is obtained from 11 cycles.",
    "Assess tagmentation of samples on Agilent Tapestation or Bioanalyzer (Figure 2[href=https://www.wicell.org#fig2]). Profiles should contain multiple peaks with maxima distributed roughly 150 bp apart (Figure 2[href=https://www.wicell.org#fig2]B). The presence of majority of material in single peak, with sizes centered around the maximum of ∼200 bp indicates over-tagmentation (Figure 2[href=https://www.wicell.org#fig2]D) of the sample, whereas presence of majority of tagmented material at ∼1 kb mark indicates under-tagmentation (Figure 2[href=https://www.wicell.org#fig2]C). In such cases timing of transposition reaction and concentration of Tn5 enzyme should be optimized. It is not uncommon to detect a large peak at ∼40 bp pre-bead clean-up, as this represents the excess/abundance of primer dimers.\nIf samples cannot be detected by Tapestation or Bioanalyzer additional PCR cycles can be performed. During this assessment, the PCR reaction should be kept on ice.\nPurify samples using Agencourt Ampure XP beads (A63880) to remove excess primers/primer dimers. We followed the manufacturers protocol which we describe below.\nVortex beads thoroughly for ∼1 min to resuspend them.\nAdd 20 μL of beads to the sample, mix thoroughly by pipetting up and down the solution 10 times using ART low-binding tips.\nIncubate the sample with beads at 18°C–22°C for 5 min.\nPulse spin to collect the solution off the tube walls and place the tube in magnetic stand. Leave for 5 min for magnetic beads to separate out and for the solution to become clear.\nWhile keeping the tube in the magnetic stand, remove and discard the supernatant. Proceed carefully not to remove/disturb the beads; if this happens, allow for beads to separate again.\nAdd 200 μL freshly prepared 80% ethanol to the tube still in the magnetic stand to wash the pellet, leave for 30 s and remove. Repeat the wash step.",
    "Air dry beads in the magnetic stand with lids open for ∼5–10 min, until the pelleted beads change from shiny/glossy in appearance to a dull matt finish. Cracks should not be seen in the pelleted beads.\nCritical: Over-drying causes problems in resuspending and subsequent loss of material.\nRemove tubes from the magnetic stand and elute DNA with 20 μL of 0.1× TE, resuspend by pipetting up and down at least 10 times. Keep at 18°C–22°C for 5 min.\nPulse spin, place in magnetic stand for 5 min.\nCarefully remove ∼18 μL of supernatant containing DNA and transfer to a new tube.\nRepeat Tapestation/Bioanalyzer analysis.\nDetermine the concentration of the eluted sample using Qubit assay (Life Technologies #Q32854). Following the manufacturers protocol.\nUse Kapa Library quantification kit (Kapa Biosystems #KK4903) to quantify transposed DNA before sequencing. When sequencing multiple samples in the same lane/run, samples should be pooled such that they have equal molar amounts (4 nM each) before the Kapa quantification reaction and the pooled sample concentration should be assessed and adjusted.\nDetermine pooled library concentration using Kapa standards and dilute accordingly to either 4 nM, 2 nM, 1 nM or 0.5 nM, depending on the determined library concentration for sequencing on the Illumina NextSeq 500/550 platform, using 75 cycle high-output kit (#20024906). Always dilute to highest concentration possible.\nDownstream applications: Preserve cells in lysis buffer for RNA extraction\nTiming: Washing, flash-freezing cells = 30 min",
    "Here we describe how to wash, lyse, and store cells collected in bulk by FACS ready for subsequent RNA extraction and ultimately library preparation for RNA-seq. For RNA-seq library preparation, numerous kits are available depending on the quantity of input material used. For low-input samples (100’s - 1000’s of cells) we have used SMART-seq® V4 Ultra® low-input RNA kit for sequencing (Takara Clontech #634889) following the manufacturers protocol. To prepare the RNA-seq libraries we used Nextera XT kit (Illumina #FC131-1096).\nFor single-cell RNA-seq using SmartSeq2 (Picelli et al., 2014[href=https://www.wicell.org#bib6]), cells should be collected individually in 96-well or 384-well plates (VWR #47743-996) containing cell lysis buffer (0.2% vol/vol Triton-X-100, 2U/μL RNase inhibitor) and the Oligo-dT30-VN primer (5′–AAGCAGTGGTATCAACGCAGAGTACT30VN-3). These can be stored at −80°C for up to 3 months before following the published protocol (Picelli et al., 2014[href=https://www.wicell.org#bib6]) for generating scRNA-seq libraries.\nFor sc-RNA-seq using the 10× Genomics Chromium platform, cells should be collected in bulk in a minimal volume of Hanks (0.25% BSA). Each cell collected from the FACS machine through a 100 μm nozzle comes in ∼0.02 μL droplet. Refer to the Chromium single-cell 3′ reagent kits v3 user guide (CG00183 RevC) to determine volume of cells to load on to the Chromium chip.\nFor sc-ATAC using the 10× Genomics Chromium platform, cells should be collected in bulk into Hanks buffer. Refer to Nuclei isolation for single-cell ATAC sequencing (CG000169 RevD) for downstream processing.\nCentrifuge FACS isolated cells at 2000 g for 5 min at 4°C.\nCarefully remove buffer by slowly pipetting and wash pelleted cells with 50 μL chilled (4°C) PBS. (depending on the number of cells the pellet may not be visible). Centrifuge as in step 41.",
    "Carefully remove PBS by slowly pipetting and resuspend cells on ice by gentle pipetting in 100 μL chilled lysis buffer from Ambion RNaqueous micro total RNA extraction kit (AM1931).\nLeave on ice 15 min with intermittent vortexing.\nBriefly centrifuge, snap freeze in liquid nitrogen (this is recommended even if proceeding directly to RNA extraction).\nCritical: Carefully place tube(s) vertically in liquid nitrogen using large metal forceps and appropriate PPE, such that lysis solution containing cells doesn’t spread over walls of the tube and remains at the bottom.\nStore at −80°C. For downstream RNA-seq, do not store samples at −80°C longer than 3 months.\nDownstream applications: Lyse and cross-link cells for ChIP\nTiming: 90 min\nHere we detail the initial steps of chromatin immunoprecipitation (ChIP), whereby cells are lysed and chromatin is cross-linked and snap-frozen ready for the subsequent ChIP procedure.\nPrepare Nuclei Extraction Buffer (NEB). 1 mL per sample.\ntable:files/protocols_protocol_547_9.csv\nCentrifuge FACS isolated cells at 2000 g for 5 min at 4°C.\nCarefully remove supernatant by pipetting and wash pellet with 500 μL of chilled PBS, (depending on the number of cells the pellet may not be visible). Centrifuge as in step 48.\nCarefully remove the PBS and gently resuspend cells in 1 mL of NEB.\nTransfer cells to a chilled Dounce homogenizer and lyse them with 20 strokes of pestle B, on ice, taking care to minimize cavitation.\nTransfer the homogenate to new 1.7 mL low-binding tube. Spin briefly and tap tube on bench to remove any bubbles.\nPipette 973 μL of homogenate into a new 1.7 mL low-binding tube and add 27 μL of 37% formaldehyde (to a final concentration of 1% formaldehyde).\nNutate the tube(s) at 18°C–22°C for precisely 10 min.\nAdd 143 μL of 1M glycine to quench the formaldehyde, nutate at 18°C–22°C for 5 min.",
    "Pellet cells at 2000g for 4 min at 4°C.\nPrepare ice cold PBS supplemented with protease inhibitors (PBS/PI) by dissolving 1 mini EDTA-free protease inhibitor tablet in 10 mL PBS and adding 10 μL 1M DTT and 10 μL 0.2M PMSF.\nAfter the spin (step 56), remove supernatant and gently resuspend pellet in 1 mL of PBS/PI by pipetting with 1000 μL low-binding tip ∼10 times. Centrifuge as step in 56 and repeat PBS/PI washes for a total of 3 washes. The pellet will become invisible as the fixative is rinsed out.\nAfter the final spin, remove supernatant and snap freeze crosslinked cells in liquid nitrogen and store at −80°C.\nCritical: Carefully place tube(s) vertically in liquid nitrogen using large metal forceps and appropriate PPE, such that cells remain pelleted and don’t spread over walls of the tube.\nCells can be stored at −80°C for several months before proceeding with the ChIP assay. We have generated a separate detailed protocol for ChIP-seq (Lukoseviciute, 2020[href=https://www.wicell.org#bib4]), but cells prepared following these instructions can be used in numerous protocols, including commercial kit based assays."
  ],
  "subjectAreas": [
    "Genomics",
    "Model Organisms",
    "Molecular Biology",
    "Sequencing",
    "Single Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}