{
  "id": 13729,
  "origin_website": "Jove",
  "title": "Assaying Blood Cell Populations of the Drosophila melanogaster Larva",
  "procedures": [
    "1. Hemocyte Bleed/Scrape Assay\nPreparation of slides:\n\t\nOption 1 for microscopes without tile scanning function: For each larva to be analyzed, prepare one glass slide with about 5 Pap-pen wells of 2 mm squares each, corresponding to the field viewing area of the microscope; add approximately 5 - 10 µl of S2 media to each (Figure 1A). Keep slides in moist chamber to prevent wells from drying out.\nOption 2 for microscopes with tile scanning function: For each larva to be analyzed, prepare one glass slide with 3 to 4 Pap-pen wells of ~3 - 4 mm squares each; add approximately 15 - 20 µl of S2 media to each well (Figure 1B). Keep slides in moist chamber to prevent wells from drying out.\n\t\tNOTE: The above recommended number of wells is sufficient for totals of up to 3,000 hemocytes per larva (late 2nd instar larvae, ~2.5 - 3 mm length, transgene labeling the majority of larval blood cells). When assessing larger blood cell numbers, more wells might be needed to avoid over-crowding.\nCollection of larvae:\n\t\nSquirt water into a fly vial containing larvae and flush larvae into a Petri dish, or scoop some food that contains larvae into a Petri dish and dilute with water using a squirt bottle.\nGently pick larvae out of the Petri dish using a paintbrush and place them in water in a cavity dish or on a slide on a cold block.\n\t\tNOTE: Larvae can be kept for a limited time in water or on a cold block; use specimens within 45 min or less to avoid larval death or unwanted effects on hemocytes.\nDissection:\n\t\nSelect larvae under a fluorescence microscope on a cold metal block. Measure sizes and image larvae if desired.\nIsolation of circulating hemocytes (“Bleed”):",
    "Once larvae are selected, place one larva in the first Pap-pen well (Figure 1C, 2A).\nUse 2 clean needles or dissecting scissors and forceps to make an incision at both the posterior and anterior ends of the larva. To avoid disturbing resident hemocytes, it is best to make these incisions on the ventral side of the larva. For consistent results, make the incisions in the same locations for every larva. For 1st instar larvae, 1 incision (in the ventral anterior) is sufficient.\nAllow larva to bleed for a few seconds without any pressure or physical agitation (Figure 2A).\n\t\t\tNOTE: If working on multiple larvae it is better to make these incisions for each one before proceeding to the next step to avoid keeping larvae on ice too long which could affect the samples’ integrity.\nGently lift the larva with the needles or forceps and dip it into the second well to rinse any remaining circulating hemocytes. After that, follow with the release of resident hemocytes.\nIsolation of resident hemocytes (“Scrape”):\n\t\t\nGently transfer the larva to the next well (Figure 2C).\nIdentify the lymph gland of the larva, which typically is located approximately 1/3 from the anterior end of the larva, and which may fluoresce dorsally through the larval body wall. Avoid the lymph gland while releasing resident hemocytes by pinning down the larva with a needle as near as possible to the lymph gland to avoid puncturing (Figure 2C).\n\t\t\tNOTE: During normal development the maturation of lymph gland hemocytes is delayed compared to larval hemocytes, and fluorescent reporters of differentiated hemocytes may not show a signal in the lymph gland of young larvae. In these instances, less attention needs to be paid to the lymph gland as no contamination of differentiated fluorescently-labeled larval hemocytes by lymph gland hemocytes is expected.",
    "Release resident blood cells in a dissection process of scraping and/or jabbing. Use one needlepoint to effectively pin down the larva near the lymph gland (see above) or other body areas as needed. Use another needle to jab at the clusters of hemocytes that are visible through the larval body wall (Figure 2C,E), aiming to separate the hemocytes. Hemocytes can also be released in a scraping motion. However, tearing the epidermis early may release big clusters of blood cells, which could make automated counting more challenging.\n\t\t\tNOTE: Depending on the age and genotype of the larva, the number of total hemocytes will vary. Distribute the release process described above over several wells to avoid overcrowding of some wells with blood cells, which could make single cell image analysis more difficult.\nIf few hemocytes remain in the final carcass, count these hemocytes by observation through the microscope and use of a manual tally counter (Figure 2E). To facilitate counting, place the carcass on a clean area of the same slide and spread it as thinly as possible to reduce the number of optical planes.\nOnce the dissection is complete, wait between 5 - 10 min for the cells to settle (but not necessarily adhere) before imaging the wells. Incubate the slide in a moist chamber to avoid drying, and avoid rough handling of the slides, which could disturb the settled hemocytes.",
    "NOTE: When determining hemocyte counts, released cells are not fixed and the cells must be imaged shortly after dissection, preferably within 30 min after release from the larva. Depending on the volume of medium and cell properties, the vast majority of cells will have settled within 5 - 10 min, which should be confirmed by focusing through the optical planes of the medium in the well. However, only a fraction of blood cells will have adhered to the slide surface by this time, a fact that needs to be considered if modifying this protocol for cell fixation-based approaches.\nQuantification:\n\t\nTake images of the settled hemocytes under a fluorescent microscope (Figure 2B,D,F). Follow with quantification of hemocytes using ImageJ software.\nPrepare image for ImageJ cell counting algorithm:\n\t\t\nOpen image of well using ImageJ: File → Open → (locate file and select).\nEnsure that the image(s) is 8-bit or 16-bit. Adjust the threshold for the image by selecting Image then click Adjust and select Threshold. Observe the “Threshold window” (Figure 3A).\nCheck the “Dark Background” option. Select “Red” and increase the Lower Threshold Level (see black arrow) until each cell in the image is marked with a red dot (cells that are not being covered will be seen in grayscale; Figure 3B). As the Lower Threshold is increased some cells will become unmarked. This can be the indicator for how far to set the Lower Threshold.",
    "NOTE: Occasionally clusters of cells cannot be resolved and would be counted as one by the particle counter. In such cases, the number of cells in a cluster can be estimated by examining the image (zoom in if needed) and manual counting using a tally counter. Alternatively, the Lower Threshold can be increased to resolve clusters of cells; any unmarked cells resulting from this manipulation can then be counted using a tally counter.\nAnalyze cell number using ImageJ:\n\t\t\nLaunch the Particle Analyzer to count the cells (Figure 3C). Select Analyze and click on Analyze Particle.  Optionally select “Overlay Outlines” to see the particles the algorithm count (Figure 3D). Alternatively, set a limit to the size or pixel area of a unit (e.g., cell, clump of cells, etc.) for the algorithm to count.\nClick OK. Observe a summary window with the count (Figure 3E).\n2. Hemocyte Disturbance Assay\nTo disturb hemocytes, select larvae and place them in a 2 ml microcentrifuge tube with approximately 0.5 g of glass beads (212 - 600 µm) and add 0.5 ml water.\nVortex the tube, by hand, at speed 10 for 1 min.\nRetrieve the larvae from the glass beads by spilling the contents of the microcentrifuge tube into a Petri dish and picking out the larvae with a paintbrush.\nFor the recovery phase, place larvae in previously prepared Petri dishes with small amounts of fly food. Allow the larvae to re-establish their hemocyte pattern for a period of 45 min or as desired.\n\tNOTE: Discard any larvae that have stopped moving, as they have died in the process. However, we typically see little damage after 1 min of vortexing (see below and Supplemental Figure 1).\nAfter the recovery period, continue with the Bleed/Scrape Assay as described above in Section 1."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}