{
  "id": 776,
  "origin_website": "Nature",
  "title": "Protocol for rapid unsupervised cryo-EM structure determination using cryoSPARC software",
  "procedures": [
    "Step 1) \nStart cryoSPARC on the GPU computer. \nAfter installation and configuration, the cryosparc command should be available in your PATH. Simply type the following at the command line \\(Figure 1):\n$ cryosparc start\nThis will begin the cryosparc host processes and provide you with a web address where cryoSPARC can be used. Typically it will be http://localhost:38000\nStep 2) \nOn the GPU computer or any other computer connected to the same local network as the GPU computer, use the Google Chrome browser to navigate to the web address from step 1).\nYou will be presented with the cryoSPARC main dashboard \\(Figure 2).\nStep 3) \nClick on the ‘Datasets’ button in the top navigation bar to arrive at the datasets page \\(Figure 3). From here, click on ‘New Dataset’ to create a new particle dataset in cryoSPARC \\(Figure 4). Click on the Configure tab on the left, and click the ‘Add New File Set’ button to begin adding a new set of particle stack and meta data files to cryoSPARC.\nStep 4)\nClick on the ‘Browse Bulk Files’ button to browse for a meta data \\(.star, .par, .txt, .emx) file for your dataset. Repeat for the particle stack if necessary \\(.star files contain paths to corresponding .mrcs files). Enter microscope parameters if necessary \\(.star files contain microscope parameters). \nClick on the Visualize tab on the left, and click Launch to have cryoSPARC load your data and display it to verify the integrity of the provided files and the correctness of microscope parameters \\(Figure 5).\nStep 5)",
    "Click on the Experiment button in the main navigation bar. This will take you to the experiment management page \\(Figure 6). Click ‘New Experiment’ to start a new experiment. In the New experiment page, select your dataset, then select the task you wish to perform \\(in this case Ab-Initio Heterogeneous Reconstruction). Then click on the parameters page to see default parameters of the experiment \\(Figure 7). In this case, you can set the number of classes you wish to reconstruct but for this tutorial we will leave it as 1 class.\nStep 6) \nClick the Launch tab on the left and select ‘Enqueue’. This will queue your experiment for running in the cryoSPARC scheduler. When the job begins to run, you will see results streaming in real time on the Launch page. This includes plots and result files that are generated \\(Figure 8). You can directly download result maps and plot data from the interface. In this case, the single class ab-initio reconstruction will yield a medium-resolution structure of the TRPA1 ion channel in approximately one hour. When the job is finished, you may view the final result.\nStep 7) \nTo refine a structure that has been reconstructed by ab-initio reconstruction, return to the experiments page, click ‘New Experiment’ and select your dataset. This time, select Heterogeneous Refinement as the task. In the job parameters, use the ‘Browse previous results’ button to select the output from the previous ab-initio experiment as the starting reference for high-speed refinement \\(Figure 9). In refinement experiments, every parameter has default values and none need to be changed, except if you wish to enforce symmetry during refinement. In this case we can enforce C4 symmetry.\nStep 8)",
    "Once again, click on the Launch tab on the left for the refinement experiment, then click Enqueue. The job will begin to run and report results in real time. This refinement will take approximately one hour to reach 4.2A resolution \\(Figure 10). Results maps both sharpened and unsharpened, along with half-maps, masks, and FSC curves can be downloaded directly from the interface. The resulting structure can be viewed locally using UCSF Chimera \\(Figure 11)."
  ],
  "subjectAreas": [
    "Structural Biology",
    "Computational Biology And Bioinformatics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}