{
  "id": 13054,
  "origin_website": "Jove",
  "title": "Identification and Isolation of Burst-Forming Unit and Colony-Forming Unit Erythroid Progenitors from Mouse Tissue by Flow Cytometry",
  "procedures": [
    "All experiments were conducted in accordance with animal protocols A-1586 and 202200017 approved by the University of Massachusetts Chan Medical School Institutional Animal Care and Use Committee.\nNOTE: Two protocols are detailed here: first, flow cytometric analysis (section 1), followed by protocol adjustments for flow cytometric sorting (section 2). The protocol below uses a flow cytometer/sorter with 10 channels. An example setup is provided in Table 1, referred to in step 1.14.5. It is also possible to run this protocol with only nine channels; see the legend in Table 2.\n1. Flow cytometric analysis\nEuthanize adult (>6 weeks old) Balb/C or C57BL6 mice using an appropriate method approved by your Institutional Animal Care and Use Committee (e.g., CO2 inhalation followed by cervical dislocation). For flow cytometric analysis, bone marrow (BM) from a single mouse will be sufficient. For sorting, the number of mice depends on the downstream applications. The cell yield for each population is given below (step 2.3.3).\nTissue harvest:\n\t\nPrepare 5 mL fluorescence-activated cell sorting (FACS) tubes containing 3 mL of cold (4 °C) staining buffer (\"SB5\": phosphate-buffered saline (PBS), 0.2% bovine serum albumin (BSA), 0.08% glucose, 5 mM EDTA) on ice. Use this to place harvested tissues.\nPrepare separate tubes for each tissue dissected from each mouse. Do not pool tissues from multiple mice.\nHarvest both femurs and both tibias. Remove all the muscles from the bones before placing them in the tube with SB5.\nDissect the spleen through an incision on the left side of the abdomen.\nBone marrow cell extraction:",
    "Place the freshly dissected femurs and tibias directly into cold staining buffer (SB5) and keep the tubes on ice until ready to extract the bone marrow (BM). Place a clean sterilized mortar on ice in a bucket. Transfer the bones to the mortar along with the SB5 from the tube.\nSnip off approximately 1 mm of the ends of each bone with dissection scissors so that the orifice of the bone becomes just visible.\nUse a 26 G needle and a 3 mL syringe filled with SB5 to flush the marrow out of the bones and collect it into the mortar. Repeat the process 3-5 times using fresh buffer each time until the bones appear colorless.\nFilter the flushed marrow through a 100μm mesh filter and collect the cells in a 50 mL centrifuge tube placed on ice.\nUse the mortar and pestle to crush the flushed bones in 5-10 mL of SB5. Filter the mixture of crushed bones and buffer through the 100 µm cell strainer and pool with cells collected in step 1.3.4.\nSpleen cell extraction:\n\t\nSet up a 100 µm mesh filter on an empty 50 mL centrifuge tube placed on ice. Place a single spleen on the mesh filter.\nAdd 0.5-1 mL of SB5 to the spleen to ensure it does not dry.\nUsing the rubber side of a 3 mL or 5 mL syringe plunger, mash the spleen through the mesh. Add more SB5, 5 mL at a time, and continue to mash until all the cells have been collected in the tube.\nFrom this point onward, the bone marrow and splenic cells are treated in the same way.\nSpin the cells down at 900 x g, 4 °C for 10 min. Aspirate the supernatant using a vacuum aspiration setup.",
    "To make a single-cell suspension, resuspend the cells in 2 mL of SB5 and pipet up and down 50 times using a P1000 with a large orifice tip (see Table of Materials). These have wide tip openings to help prevent damage to fragile cells.\nTo count the cells, resuspend by pipetting up and down 20 times. Dilute the cells at a ratio of 1:100 in SB5. Mix 10 μL of the diluted cells with 10 μL of trypan blue and count on a hemocytometer and/or cell counter.\nSpin the cells down at 900 x g, 4 °C for 10 min. Aspirate the supernatant and resuspend the cells at 33 x 106 live cells/mL in SB5.\nPrepare the Lin-FITC cocktail by mixing equal volumes of each antibody in Table 3.\nPrepare the cells for single color controls and \"Fluorescence minus one\" (FMO) controls. Carry out steps 1.11-1.12 in parallel with the preparation and staining of the sample cells in step 1.14 (samples for flow cytometric analysis) and/or step 2.1 (flow cytometric sorting).\n\t\nPrepare the cells for an unstained cell control by transferring 50 µL (1.6 x 106 cells) of the cell suspension into a FACS tube on ice. Prepare the cells for each single color control (11 tubes) by transferring 50 µL (1.6 x 106 cells) of the cell suspension into a FACS tube on ice.\nPrepare FMO controls for the following colors (Kit, CD41, CD150, CD49f [four tubes]) by transferring 300 µL (10 x 106 cells) of the cell suspension into a separate FACS tube on ice.\nSpin down the cells at 900 x g, 4 °C for 10 min and aspirate the supernatant.\nAntibody staining of FMOs and single color controls",
    "Stain the FMOs at 33 x 106 cells/mL (in a total volume of 300 µL) in FACS tubes. For each control, add all of the antibodies except the FMO's namesake antibody. For example, for the Kit FMO, leave out the Kit antibody. For each antibody, use the dilution and final concentration as in Table 2.\nStain the single color controls at 20 x 106 cells/mL (in a total volume of 50 µL) in FACS tubes; for each control, add a single antibody at the concentration listed in Table 2.\nVortex each control tube for 2-3 s at 3,000 rpm (rotations per minute), and then incubate at 4 °C, rocking for 2.5 h in the dark, protected from light. Rock the tubes with an axis of rotation parallel to the length of the tube, between approximately a 10° and a 60° angle from the horizontal, so that the contents do not touch the cap.\nWash the cells with SB5: Make up the volume of the cell suspension to 4 mL with SB5. Spin the cells down at 900 x g, 4 °C for 10 min, and aspirate the supernatant.\nCell resuspension:\n\t\nResuspend the unstained and all the single color controls (except the DAPI control) in 300 µL of SB5 and filter through a 40 µm filter mesh into a new FACS tube.\nMake a DAPI/SB5 solution by diluting the DAPI stock (1 mg/mL in 100% ethanol) at 1:10,000 in SB5.\nResuspend the FMOs in 1.8 mL of DAPI/SB5 and filter through a 40 µm filter mesh into a new FACS tube\nResuspend the DAPI single color control in 300 µL of DAPI/SB5 and filter through a 40 µm filter mesh into a new 4 mL FACS tube.",
    "Sample preparation: If the cells are being prepared for flow cytometric analysis, go to step 1.14. If preparing the cells for sorting, skip to step 2.1.\nStain the flow cytometric analysis samples at 33 x 106 cell/mL in a total volume of 300 µL (10 x 106 cells) in FACS tubes:\n\t\nPrepare the antibody master mix. Determine the volume of the master mix by the number of samples, with 300 µL per sample. Make the master mix by diluting all of the antibodies listed in Table 2 at the indicated dilution in SB5. The Rabbit IgG in the master mix serves as an Fc block.\nVortex each tube for 2-3 s at 3,000 rpm, and then incubate at 4 °C, rocking for 2.5 h in the dark, protected from light.\nWash the cells with SB5: Make up the volume of the cell suspension to 4 mL with SB5. Spin the cells down at 900 x g, 4 °C for 10 min, and aspirate the supernatant.\nResuspend the samples for flow cytometric analysis in 1.8 mL of DAPI/SB5 as prepared in step 1.12.5.2 and filter through a 40 µm filter mesh into a FACS tube.\nAnalyze the samples on a cytometer with 10 channels to accommodate the antibody conjugates in Table 2 and the viability dye DAPI. An example channel setup is provided in Table 1. It is also possible to only use nine channels; see the Table 2 legend.\nDuring the analysis of the flow cytometry data, use standard spectral compensation approaches with the help of the single color controls and FMO controls as detailed in step 2.4.\n2. Protocol adjustments for flow cytometric sorting\nPreparation of Lin-",
    "Pool all the extracted cells from the same tissue (either BM or spleen) from 10 mice into a 50 mL tube. Resuspend each pooled sample by pipetting using a P1000 with a large orifice tip.\nSpin down the cells at 900 x g, 4 °C for 10 min and aspirate the supernatant.\nPrepare single color and FMO controls as described in section 1 using un-enriched cells.\nEnrich Lin- cells for sorting using magnetic bead enrichment of Lin- cells:\nResuspend the cells at 1 x 108 cells/mL with SB5 and transfer them to a 15 mL tube. Add normal rat serum and the biotinylated antibodies listed in Table 4 and incubate with rocking at 4 °C for 1 h.\nSpin the cells down at 900 x g, 4 °C for 10 min and aspirate the supernatant. Resuspend the cells in 15 mL of cold SB5.\nSpin the cells down at 900 x g, 4 °C for 10 min and aspirate the supernatant. Resuspend the cells at 1 x 108 cells/mL in cold SB5 and keep them on ice.\nVortex the magnetic nanobeads at 3,000 rpm for 5-10 s. Take 1 mL of magnetic nanobeads for every 10 mL of cells.\nWash the nanobeads in a 5 mL FACS tube. Make up the volume to 4 mL with SB5, spin at 900 x g, 4 °C for 5 min, and aspirate the supernatant.\nResuspend the nanobeads in 500 µL of SB5 and mix with the cells prepared in step 2.1.7. Incubate at 4 °C with rocking for 15 min.\nSpin the cells down at 900 x g, 4 °C for 10 min and aspirate the supernatant. Resuspend the cells at 1 x 108 cells/mL with SB5.\nPlace the tube on a magnet at 4 °C for 5 min.",
    "Carefully pour the supernatant into a new 15 mL tube.\nPlace the tube containing the supernatant from step 2.1.13 on a magnet at 4 °C for 5 min. Carefully pour the supernatant into a new 15 mL tube.\nSpin the cells from the supernatant in step 2.1.14 at 900 x g, 4 °C for 10 min, and aspirate the supernatant.\nResuspend the Lin--enriched cells in 1 mL of SB5.\nDilute 10 µL of the cells at 1:100 in SB5. Mix 10 μL of the diluted cells with 10 μL of trypan blue and count on a hemocytometer and/or cell counter.\nBased on the cell count in step 2.1.17, resuspend the Lin--enriched cells at 33 x 106 cells/mL.\nStaining of enriched cells:\n\t\nStain the enriched cell samples at 33 x 106 cells/mL in FACS tubes by adding all the antibodies listed in Table 2. Vortex each tube for 2-3 s at 3,000 rpm, and then incubate at 4 °C, rocking for 2.5 h in the dark, protected from light.\nWash the cells with SB5: Make up the volume of the FACS tubes to 4 mL with SB5. Spin the cells down at 900 x g, 4°C for 10 min, and remove the supernatant.\nResuspend the samples for flow cytometric analysis in 4-6 mL of DAPI/SB5 as prepared in step 1.12.5.2 and filter through a 40 µm filter mesh into a new 4 mL FACS tube.\nSample sorting:\n\t\nSort the samples with a large nozzle and low pressure to maximize the CFU-e yield since CFU-e cells are easily damaged under high pressure. For the flow cytometer used in this study, use 14 psi and a 100 μm nozzle or 12 psi with a 130 μm nozzle. Set up the sorting gates as described under step 2.4 below.",
    "Prepare the collection buffer: Add 20% fetal bovine serum to PBS.\nTo check the purities of the sorted populations, re-run a small aliquot from each sorted population in a buffer that contains DAPI, as described in step 1.12.5.2.\n\t\tNOTE: Typically, BM from a total of 10 mice (approximately 1 x 109 cells) yields at least 50,000-100,000 cells for each of the P1-hi, P1-low, and P2 populations with a viability of approximately 70%.\nUse the gating strategy shown in Figure 3 for analysis or setting up the sorting gates.\n\t\nUse the forward-scatter (FSC)parameter to remove the debris based on size. Use the FSC-height versus FSC-area histogram to exclude cell aggregates and select single cells; repeat with the side-scatter (SSC)-height versus SSC-area histogram.\nExclude the dead cells by gating out the cells that are positive for the DNA dye DAPI, to which viable cells are impermeable.\nSelect Lin-Ter119-Kit+ cells, and from these, select a subpopulation that expresses CD55.\nSubdivide the Lin- Ter119-Kit+CD55+ cells into two principal populations, P6 and P7, based on the expression of CD49f and CD105.\nBased on the expression of CD150 and CD41, subdivide P6 further into P3 (basophil or mast cell progenitors), P4 (megakaryocytic progenitors), and P5 (EBMP and erythroid-biased MPP).\nBased on the expression of CD150 and CD71, subdivide P7 further into P2 (BFU-e), early CFU-e (P1-low), and late CFU-e (P1-hi).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}