{
  "id": 2623,
  "origin_website": "Cell",
  "title": "In Vitro Derivation of Quiescent Mouse Embryonic Stem Cells Based on Distinct Mitochondrial Activity",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nESCs are heterogenous with regard to mitochondrial activity (Khoa et al., 2020[href=https://www.wicell.org#bib4]; Schieke et al., 2008[href=https://www.wicell.org#bib10]). However, a detailed protocol for determining the biological features of distinct mitochondrial activity is currently lacking. In this section, we list step-by-step procedures, timing as well as critical considerations that ensure success. Following this protocol would result in a successful isolation of quiescent ESCs with intact pluripotent features.\nESC Culture\nTiming: 2 days\nMouse E14 ESC line is maintained on Geltrex-coated 6-well plates at 37°C and 5% CO2 in 2 mL of N2B27/2i/LIF culture media per well.\nTo keep the cells growing at relatively stable density, we usually seed 1–2 x 105 cells per well onto 6-well plates after each split. Medium change is performed daily. Cells are passaged every two days as follows:\nPre-warm N2B27, N2B27/2i/LIF, Accutase and DPBS for 5 min at 37°C. All reagents are in 15 mL or 50 mL conical tubes.\nGently aspirate the old medium and wash the cells once with DPBS.\nIncubate the cells with 400 μL of Accutase at 37°C for 4 min.\nAdd 1.5 mL of N2B27 medium, gently pipette up and down for ten times and collect cells by centrifugation at 300 × g, RT for 3 min.\nResuspend the cells in 1 mL of N2B27/2i/LIF media.\nCount the cell numbers by hemocytometer and place cells at a density of 1–2 x 105 cells per well of 6-well plate. 2 mL of N2B27/2i/LIF culture media per well are used throughout the culture.\nReturn the cell plate to the incubator and gently shake the plate to distribute the cells evenly.",
    "Critical: Cell density plays critical roles in maintaining ESC identity as well as the metabolic status. In our experiences, plating ESCs at a density of 1–2 x 105 cells per well of 6-well plate often results in 70%–80% confluency after 2 days in culture (Figure 1[href=https://www.wicell.org#fig1]A). This can give rise to a consistent cell cycle profile (Figure 1[href=https://www.wicell.org#fig1]B) as well as fraction of cells with low mitochondrial membrane potential, which are determinant factors in our protocol. Researchers can use our seeding density as a starting point to scale up or down according to their plate formats.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/212-Fig1.jpg\nFigure 1. Routine Culture of Ground-State ESCs\n(A) Representative bright-field image of E14 ESCs at day 2 after passage. 70%–80% confluency is optimal for derivation of quiescent ESCs. Scale bar, 100 μm.\n(B) Representative plot of cell cycle analysis determined by double staining live cells with Hoechst 33342 and Pyronin Y. Percentages of each phase of cell cycles are shown. For detailed protocol of cell cycle analysis, see Khoa et al. (2020)[href=https://www.wicell.org#bib4].\nTMRM Staining of ESCs\nTiming: 1 h\nTMRM is a cell-permeable dye that can label functioning mitochondria. As such, cells with active mitochondrial membrane potential (ΔΨm) tend to accumulate more TMRM than those harboring lower ΔΨm. Here, we present a step-by-step procedure of TMRM staining at single-cell levels.\nPreparation of single-cell suspension and reagents for staining.\nInspect the cells under a microscope to confirm the cell density, and make sure the culture is not contaminated at the time of staining.\nGently aspirate the old medium and wash the cells once with DPBS.\nDissociate cells with 400 μL of Accutase at 37°C for 4 min. Tap the plate to facilitate the detachment of colonies.",
    "Cells are gently pipetted up and down ten times, resuspended in 37°C pre-warmed FACS running buffer and centrifuged at 300 × g, RT for 3 min.\nResuspend the cells in 1 mL of 37°C pre-warmed staining buffer.\nTake out an aliquot of 100 μM TMRM, and leave at RT.\nTMRM staining\nCount the cells by hemocytometer and adjust the cell numbers at a density of 1 x 106 cells/mL.\nAdd TMRM at a final concentration of 25 nM. Gently pipette up and down for ten times to mix the cells.\nIncubate cells at 37°C and 5% CO2 for 15 min.\nWash the cells twice in ice-cold FACS running buffer by centrifugation at 300 × g, 4°C for 3 min.\nResuspend the cells in ice-cold FACS running buffer containing SYTOXTM Blue (1:1,000 dilution). Cells are filtered through 40 μm sterile cell strainer, left on ice, and protected from light by aluminum foil until FACS.\nCritical: TMRM should be protected from lights. Each aliquot of TMRM is for a single use.\nNote: to set up the gating strategy, two additional samples are needed: unstained cells and SYTOXTM Blue-stained cells. Since there is always a small subpopulation of dead cells in culture that can be used for setting up the gating (Figure 2[href=https://www.wicell.org#fig2]), inducing cell death for a positive control is not necessary.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/212-Fig2.jpg\nFigure 2. A Representative Gating Strategy for FACS Sorting",
    "To set the boundaries, the unstained and SYTOXTM Blue-stained samples are used for gating. First, cell population is identified by SSC-A versus FSC-A plots (Gate 1). Doublets are then eliminated using FSC-A versus FSC-W and SSC-A versus SSC-W plots (Gate 2 and 3). Dead cells are removed by SYTOXTM Blue (Gate 4). Then, cell populations negative for SYTOXTM Blue are gated for TMRM (Gate 5). Finally, three cell populations are defined for sorting (Gate 6). They include cells of <5% low TMRM fluorescence intensity (1), <5% high TMRM fluorescence intensity (2) and the whole cell population (3).\nFACS-Based Isolation of Quiescent ESCs\nTiming: 30 min to 1 h\nWe recently reported that ground-sate ESCs with low ΔΨm (i.e., low TMRM) exhibit defined features of the quiescent state, such as reduced RNA content and extremely slow proliferation rate (Khoa et al., 2020[href=https://www.wicell.org#bib4]). Here we provide a detailed gating strategy for capturing quiescent ESCs after TMRM staining.\nCell sorting based on the intensity of TMRM signals is performed using the MoFlo Astrios Cell Sorter (BECKMAN COULTER life Sciences). TMRM can be detected by the RFP filter set with absorbance peak at 548 nm and emission peak at 574 nm. Excitation and emission of SYTOXTM Blue are at 444 nm and 480 nm, respectively, which are detectable with the 405 nm violet laser light.\nGating strategy is shown in Figure 2[href=https://www.wicell.org#fig2].\nCollect cells in 15 mL tubes containing FACS collection buffer.\nAfter sorting, gently invert the collection tubes in order to resuspend cells attached on the tube’s wall.\nCentrifuge the sorted cells at 300 × g for 5 min.\nCarefully remove the supernatant and resuspend the cells in 1 mL of N2B27/2i/LIF or EB differentiation media.",
    "Critical: To lessen potential cell death due to the time-consuming process of FACS sorting, the cell concentration needs to be optimized appropriately. We recommend quickly performing FACS within 1 h after TMRM staining and use SYTOXTM Blue dye for staining to exclude the dead cells.\nNote: TMRM and SYTOXTM Blue are light sensitive. All samples and FACS collection tubes should be protected from light and kept on ice during sorting operation.\nValidating Pluripotent Features of Quiescent ESCs: Measure Total RNA Amounts per Cell\nTiming: variable\nDiapaused embryos can resume their normal development in response to favorable environments (He et al., 2019[href=https://www.wicell.org#bib2]; Renfree and Fenelon, 2017[href=https://www.wicell.org#bib7]). To determine whether quiescent ESCs are capable of responding to distinct environmental cues, we analyze their behaviors under self-renewal and differentiation conditions.\nA canonical characteristic of quiescent stem cells is the drastic reduction in RNA content as a result of minimal metabolic activity, low DNA replication, and slow cell cycle progression.\nTotal amounts of RNAs in each cell are determined as previously described (Khoa et al., 2020[href=https://www.wicell.org#bib4]). Equal cell numbers of top and bottom <5% of TMRM fluorescence intensity are sorted as above (Figure 2[href=https://www.wicell.org#fig2]). We use the RNeasy mini kit (QIAGEN) to extract total RNAs. Extracted RNAs are stored at −80°C, and thawed on ice prior to further analyses. Quantifications of RNA amounts are performed using QubitTM RNA HS assay kit. Data are normalized against the cell numbers (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/212-Fig3.jpg\nFigure 3. Total RNA Amounts Per Cell",
    "Live cells of high and low ΔΨm are sorted and total RNAs are immediately isolated (see step 10). Data are shown as means ± SEM from five independent experiments. Data from Khoa et al., 2020[href=https://www.wicell.org#bib4]. Statistical analyses are determined by GraphPad Prism 7.0 software. p values are calculated by the two-tailed Student’s t test. ∗∗∗p < 0.001. SEM, standard error of the mean.\nValidating Pluripotent Features of Quiescent ESCs: Colony Formation\nTiming: 5 days\nTo examine the self-renewal capacity of low ΔΨm cells (i.e., quiescent ESCs) as compared to high ΔΨm cells, we seed sorted cells with distinct TMRM signals at clonal density for colony formation assay.\nSeed 500 sorted cells per well of Geltrex-coated 6-well plates in 2 mL of N2B27/2i/LIF culture media.\nCells are cultured for 5 days in N2B27/2i/LIF media. Medium change starts 2 days after initial seeding and is subsequently performed every other day.\nAt day 5, the old media are discarded. Cells are washed once with DPBS containing Calcium Chloride and Magnesium Chloride (i.e., DPBS (+)) and fixed with 1 mL of 4% paraformaldehyde (PFA)/DPBS (+) at RT for 10 min. Fixed cells are then washed once with UltraPureTM DNase/RNase-Free distilled H2O and subjected for alkaline phosphatase (AP) staining in accordance with manufacturer’s instructions (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/212-Fig4.jpg\nFigure 4. Colony Formation Assay\nLeft, AP staining in sorted high and low TMRM cells. Scale bar, 100 μm. Right, qualifications of AP-positive colonies from left. Data are shown as means ± SEM from three biological replicates. ∗∗∗p < 0.001.\nImages were captured by the color scanner (Epson) and the IX73 microscope system (Olympus).",
    "Critical: Medium change should be carefully implemented during the course of the experiment. Tilt the dish at a 45°C angle, wait 5 s, gently remove the old media and replenish with the fresh media. Because the colony is easy to detach from the dish, we recommend using the pipette tips to change the media.\nNote: At the step 13, we recommend washing the cells with DPBS (+) to help avoid the detachment of the colonies.\nValidating Pluripotent Features of Quiescent ESCs: Immunofluorescence for OCT3/4\nTiming: 2 days\nOCT3/4 is a canonical factor that plays an indispensable role in maintenance of ESC pluripotency. To investigate the expression levels of OCT3/4 in high and low ΔΨm cells, we perform immunofluorescence as follows:\nSeed sorted high and low TMRM cells onto Geltrex-coated Lab-Tek II Chamber cover glass. Cells are grown for 24 h prior to OCT3/4 immunofluorescence analysis using the standard protocol.\nFix cells in 4% PFA/DPBS (+) for 30 min at 4°C. Wash cells twice with DPBS (+).\nPermeabilize cells in 0.25% Triton X-100/DPBS (+) (PBST) for 30 min at 4°C.\nBlock cells in blocking solution containing 10% Goat serum in DPBS (+) for 1 h at 4°C.\nIncubate cells with anti-OCT3/4 antibody (1:50) diluted in blocking solution for 14 h at 4°C.\nWash cells with 0.25% PBST three times with gentle shaking for 5 min each, and incubate cells with Goat anti-Mouse IgG FITC-conjugated secondary antibody for 1 h at RT.\nWash cells with 0.25% PBST three times with gentle shaking for 5 min each and stain cells with DAPI diluted in 0.25% PBST for 10 min at RT.\nWash cells with DPBS (+) three times. Cells are ready for imaging (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/212-Fig5.jpg\nFigure 5. OCT3/4 Immunofluorescence",
    "Left, representative images of immunofluorescence of OCT3/4. Nuclei are co-stained with DAPI. Scale bar, 50 μm. Right, qualifications of fluorescence intensity in each cell from left by ImageJ. Data are shown as mean ± SEM. n.s. not significant. n, number of cells. MFI, mean fluorescence intensity.\nImages are captured using the Leica SP5 upright 2-photon confocal microscope (Leica Microsystems). Relative fluorescence intensities are quantified in each cell using ImageJ (Figure 5[href=https://www.wicell.org#fig5]).\nValidating Pluripotent Features of Quiescent ESCs: TMRM and PECAM-1 Co-staining\nTiming: 2.5 h\nThe purpose of this experiment is to provide evidence that low TMRM cells (i.e., quiescent ESCs) in bulk culture are still pluripotent using cell-surface marker PECAM-1 staining.\nTo additionally characterize the pluripotent features of quiescent ESCs in bulk culture, cells are stained for platelet endothelial cell adhesion molecule 1 (PECAM-1, also known as CD31). PECAM-1 protein is highly expressed in the inner cell mass of blastocysts and in ESCs (Robson et al., 2001[href=https://www.wicell.org#bib8]; Rugg-Gunn et al., 2012[href=https://www.wicell.org#bib9]). We develop a co-staining protocol for TMRM and PECAM-1 to determine the expression levels of PECAM-1 in distinct fractions of high and low TMRM cells.\nRepeat from step 3 to step 4d.\nResuspend the cells in 5 mL of the cell staining buffer, centrifuge at 300 × g, 4°C for 5 min and discard the supernatant.\nIn 1.5 mL Eppendorf tube, add 1 μg of TruStain FcXTM in 100 μL staining buffer (1:50) for blocking reaction, gently mix and incubate for 10 min on ice.\nAdd 1 μg of PECAM-1 antibody (1:50) and incubate for 20 min on ice.\nWash cells twice with 1 mL of the cell staining buffer and spin at 300 × g, 4°C for 5 min.",
    "Add 0.25 μg of APC/Fire™ 750 Goat anti-rat IgG diluted in 100 μL of the staining buffer (1:80) and incubate 20 min on ice in dark.\nWash cells twice with 1 mL of the cell staining buffer and spin at 300 × g, 4°C for 5 min.\nResuspend cells with 0.5 mL of the cell staining buffer containing SYTOXTM Blue (1:1,000) to exclude dead cells.\nSamples are ready for flow cytometry (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/212-Fig6.jpg\nFigure 6. Double Staining of TMRM and PECAM-1 in ESCs\n(A) Summary of gating strategy. Unstained, TMRM, SYTOXTM Blue, PECAM-1 or IgG-stained samples are used for setting the boundaries (see also Figure 2[href=https://www.wicell.org#fig2]). Cells of <5% low TMRM and <5% high TMRM signals are subjected for PECAM-1 analysis.\n(B and C) Quantifications of TMRM intensity (B) and PECAM-1 expression (C) from (A). Data are presented as mean ± SEM from four biological replicates. ∗∗∗p < 0.001; n.s. not significant. MFI, mean fluorescence intensity.\nCritical: We do not recommend staining PECAM-1 after TMRM sorting, because the time-consuming FACS sorting per se coupled with PECAM-1 staining afterward would cause profound cell death as well as drastic changes in the metabolic state of the cells. Instead, using the protocol and gating strategy described above would allow for integrative analyses of the pluripotent marker and ΔΨm in bulk ESCs.\nNote: In addition to single stained samples, including IgG sample is important for compensation and elimination of unspecific signals.\nValidating Pluripotent Features of Quiescent ESCs: Embryoid Body (EB) Differentiation\nTiming: 13 days\nTo explore whether quiescent ESCs (i.e., low TMRM cells) undergo normal differentiation in vitro, we perform EB formation using all three TMRM-sorted populations (see step 5 and Figure 2[href=https://www.wicell.org#fig2]).",
    "2000 FACS-sorted cells of high, low and whole TMRM signals are seeded onto each well of the NunclonTM SpheraTM 96U plate format consisting of 200 μL EB media.\nEBs are cultured in suspension at 37°C and 5% CO2. Half of medium is replaced every other day.\nEB formation is recorded at day 3 and 5 (Figure 7[href=https://www.wicell.org#fig7]A), whereas beating EBs are counted at day 9 (Figure 7[href=https://www.wicell.org#fig7]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/212-Fig7.jpg\nFigure 7. EB Differentiation\n(A) EB morphology at indicated conditions. Scale bar, 200 μm. EB, embryoid body.\n(B) Efficiency of beating EBs. Percentages are calculated by the number of beating EBs from total EBs.\n(C) Representative bright-field image of outgrowth EBs at day 8. Scale bar, 200 μm.\nAt day 5, EBs are transferred to gelatin-coated plates for additional 8-day differentiation (Figure 7[href=https://www.wicell.org#fig7]C).\nCritical: For EB formation of FACS-sorted cells, we recommend using the NunclonTM SpheraTM 96U plate format to reproducibly generate single EBs with uniform sizes."
  ],
  "subjectAreas": [
    "Metabolism",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}