{
  "id": 13270,
  "origin_website": "Jove",
  "title": "Performing Human Skeletal Muscle Xenografts in Immunodeficient Mice",
  "procedures": [
    "All use of research specimens from human subjects was approved by the Johns Hopkins Institutional Review Board (IRB) to protect the rights and welfare of the participants. All animal experiments were approved by the Johns Hopkins University Institutional Animal Care and Use Committee (IACUC) in accordance with the National Institutes of Health (NIH) Guide for the Care and Use of Laboratory Animals. Male NOD-Rag1null IL2rγnull (NRG) host mice (8-12 weeks old) are used to carry out xenograft experiments. These mice are housed in ventilated racks and are given HEPA-filtered, tempered, and humidified air as well as reverse osmosis filtered hyperchlorinated water. Mice are provided water and an irradiated antibiotic diet (Table of Materials) ad libitum, and the facility provides 14 h of light to 10 h of dark as controlled by central timer.\n1. Equipment Preparation\nAcquire NOD-Rag1null IL2r γnull (NRG) mice, 8-12 weeks of age.\nAutoclave surgical equipment: scissors, forceps, needle holder, surgical stapler (Table of Materials), wound clips, surgical wipes (Table of Materials), and beaker (Figure 1A).\nPrepare 50 mL of muscle media (20% fetal bovine serum, 2% chick embryo extract, 1% antibiotic/antimycotic in Hams F10 Medium). Keep all chemicals/drugs/solutions used for surgery at room temperature unless stated differently in the protocol.\nPrepare a 1 mL syringe with a 26 G needle that is 3/8 inches long containing 2 mg/mL analgesic (Table of Materials), and place on ice. The analgesic can be diluted to the proper concentration using sterile phosphate buffered saline (PBS).\n2. Surgical Preparation\nObtain a human muscle biopsy under an IRB-approved protocol from patients whose muscles display strength > 4-/5 on the MRC (Medical Research Council) scale12. Place the research specimen in a 100 mm x 15 mm Petri dish containing muscle media.",
    "NOTE: The MRC scale is used in clinical practice as an assessment of muscle strength with 0 showing no contraction, 5 showing normal power, and 4 (4- to 4+) showing movement against resistance12. We have found that muscles with mild to moderate weakness (MRC > 4-/5) typically show disease pathology but are not extensively replaced by fatty tissue or fibrosis, both of which impede xenograft regeneration. In the case of autopsy tissue where a recent MRC score is not available, muscle quality can be accessed via gross observation. Muscle biopsies that are pale pink in appearance or have large areas of fatty tissue are not likely to xenograft successfully.\nRemove any remaining fascia or fatty tissue from the specimen with surgical scissors using a stereo microscope and light source to assist visualization.\nDissect the muscle biopsy into approximately 7 mm x 3 mm x 3 mm pieces with surgical scissors using the stereo microscope and a light source. Ensure fibers are arranged longitudinally within the specimen.\nPlace the Petri dish containing dissected muscle on ice. On average, the xenografts are kept in media for 4 hours while surgeries are being performed. However, biopsies have been stored in media for 24 h prior to xenografting, and this delay did not appear to negatively impact transplantation or regeneration.\nPlace synthetic, non-absorbable sutures (Table of Materials) in a 100 mm x 15 mm Petri dish containing 70% ethanol.\nSet up a dual procedure anesthesia circuit: arrange the Mapleson E breathing circuit on the stereo microscope and place the induction chamber in a biosafety cabinet (Figure 1A,B).",
    "Obtain the weight of the NRG mouse by placing in an autoclaved beaker on a scale, and transfer to the induction chamber. Induce anesthesia under 3% isoflurane. Once the appropriate anesthetic depth is achieved—as assessed by observation of respiratory rate, muscle relaxation, and lack of voluntary movement—reduce the vaporizer setting to 1.5% for the remainder of the surgery.\nTransfer the mouse from the induction chamber to the Mapleson E breathing circuit and apply ophthalmic ointment to eyes.\nRemove hair overlying the tibialis anterior (TA) from ankle to knee with a trimmer, followed by a 1 min treatment with hair removal lotion (Table of Materials) (Figure 2A).\nDisinfect the surgical site by swabbing the leg with povidone-iodine solution. Then wash away the remaining povidone-iodine with 70% ethanol.\nInject the mouse subcutaneously with analgesic, such as carprofen, (Table of Materials) at a dose of 5 mg/kg.\n3. Xenograft Surgery\nTape down the leg and make a straight incision over the tibilalis anterior (TA) muscle with scissors and iris forceps originating at the distal tendons and terminating below the knee (Figure 2B).\nSeparate skin from muscle using blunt dissection with surgical scissors.\nCut through the epimysium of the TA muscle with scissors starting at the tendon and ending at the knee.\nNOTE: This is a very superficial cut (less than 0.5 mm; Figure 2B, black dashed line), and the underlying TA should not be damaged in the process as this would make removal more challenging. When performed correctly, the muscle fibers will visibly relax.\nCut the distal tendon of the TA with scissors, grab the tendon with iris forceps, and pull the TA up toward the knee (Figure 2C).",
    "Cut the distal tendon of the extensor digitorum longus (EDL) with scissors and pull the EDL up toward the knee (Figure 2D). Once the proximal tendon of the peroneus longus (PL) muscle is visible, remove the EDL with scissors (Figure 2D, green dashed line).\nRemove the TA with scissors (Figure 2D, blue dashed line) and use a surgical wipe wetted with PBS and slight pressure to achieve hemostasis (Figure 2E).\nThread a suture through proximal peroneus longus (PL) tendon and trim, leaving approximately 1.5 inch of thread on either side of the tendon (Figure 2F).\nPerform the first half of a two-hand surgical square knot, but do not tighten: this will form a circle. Place a xenograft in this circle and tighten the loop to secure the xenograft. Complete the other half of the square knot (Figure 2G,H). This will suture the xenograft to the proximal tendon of the PL.\nThread suture through distal PL tendon and repeat the square knot technique from step 3.8 to tie the xenograft to the distal tendon (Figure 2H,I).\nNOTE: The medial tarsal artery and vein can lie close to or on top of the distal tendon of the PL. Do not place sutures through or around these vessels. It is easy to tell if a suture has been improperly placed as vessels will blanch or bleed. If this occurs, remove the suture and place in a different location.\nPull skin over xenografted muscle, seal with surgical glue, and place 2-3 surgical staples over the incision (Figure 2J).\nPlace mouse in a clean cage on a heated pad to recover. Monitor mouse until fully conscious and periodically over the next few days for signs of local systemic infection and to ensure the surgical site is not reopened.",
    "NOTE: A single dose of analgesic as described in step 2.11 is typically sufficient for pain relief. However, the mice should also be monitored for persistent pain (e.g. lameness, ruffled coat, hunched posture), and, if necessary, re-dosed with analgesic at 24 h post-operatively.\n4. Xenograft Collection\nNOTE: Xenografts are typically collected between 4 to 6 months post-surgery. However, collections have been performed up to 12 months post-surgery.\nPlace a covered beaker containing 200 mL of 2-methylbutane in a box containing dry ice for a minimum of 30 min before xenograft collection.\nInduce anesthesia under 3% isoflurane in induction chamber. Once the appropriate anesthetic depth is achieved, reduce the vaporizer setting to 1.5% for the remainder of the surgery.\nTransfer the mouse from the induction chamber to the Mapleson E breathing circuit arranged on a stereo microscope.\nRemove hair overlying the tibialis anterior from ankle to knee with a trimmer and hair removal lotion. The sutures holding the xenograft in place can be seen through the skin (Figure 3A).\nTape down the leg and use scissors and iris forceps to open skin over the xenograft until both sutures are visible (Figure 3B). Skin overlying the xenograft can be removed as shown to make removal of the xenograft easier.\nUse a scalpel to cut between the xenograft and the tibia (Figure 3B, arrow denotes initial site and direction of incision). This will free one side of the xenograft.\nUse a scalpel to cut between the PL muscle and the gastrocnemius muscle (Figure 3C, incision along epimysium labeled with arrow). The PL will be removed with the xenograft.\nCut below the distal suture and through the distal tendon of the PL (Figure 3D, cut along dotted line).",
    "Remove the xenograft and PL by grabbing the suture with iris forceps and deflecting it toward the knee while using scissors to cut it away from the underlying muscle (Figure 3E).\nCut above the proximal suture with scissors to remove the xenograft and PL (Figure 3F, cut along dotted line in 3E).\nPlace the specimen on a small piece of cardboard or plastic, and pin as close to the sutures as possible. While pinning the specimen, gently stretch the muscle to ensure that the fiber orientation is maintained during the snap freezing process. After the pins are securely in place, slide the muscle up the pins so it rests just above the cardboard.\nNOTE: Alternatively, one end of the xenograft can be mounted in tragacanth on a cork, or it can be submerged entirely in optimal cutting temperature (O.C.T.) compound in a cryomold. With care, muscle conformation can be retained with both methods.\nSnap freeze the xenograft in pre-cooled 2-methylbutane.\nStore xenograft at -80 °C.\nImmediately following xenograft collection, euthanize mice in accordance with American Veterinary Medical Association guidelines:\nPlace mice in a sealed chamber with an appropriate waste gas scavenging system. Use isoflurane at a concentration of 3-4% to induce anesthesia.\nOnce the appropriate anesthetic depth is achieved—as assessed by observation of respiratory rate, muscle relaxation, and lack of voluntary movement—increase the vaporizer setting to 5% to induce death. Leave the mice in the chamber for an additional 2 min after breathing has ceased. Death is verified by observing that the mice fail to recover within 10 min after overdose of isoflurane.\nFinally, perform cervical dislocation on the mice.",
    "NOTE: In the case of bilaterally xenografted mice, the contralateral xenograft can be saved for a later collection. To perform a survival collection, open the skin overlying the xenograft with a single straight cut with surgical scissors, and remove the xenograft as described in steps 4.6 to 4.10. Then close the skin over the empty tibial compartment using surgical glue and staples. Treat the mouse with analgesic as described in step 2.11 and place the mouse in clean cage on heated pad to recover. Monitor the mouse until fully conscious and periodically over the next few days for signs of local systemic infection and to ensure the surgical site is not reopened.\n5. Xenograft Immunohistochemistry\nUse a cryostat to cut 10 to 12 μm sections from the collected xenograft onto positively charged slides (Table of Materials).\nFill staining jar with methanol and pre-cool at -20 °C for 30 min.\nPlace slides in ice cold methanol for 10 min to fix and permeabilize the xenograft sections.\nPlace slides in staining jar and wash 3x with phosphate buffered saline (PBS) for 5 min.\nBlock with anti-mouse IgG (Table of Materials) for 2 h at 4 °C.\nBlot with primary antibodies, such as spectrin, lamin A/C, and embryonic myosin (Table of Materials) in PBS supplemented with 2% goat serum overnight at 4 °C.\nPlace slides in a staining jar and wash 3x with phosphate buffered saline (PBS) for 5 min.\nBlot with fluorescent-dye conjugated secondary antibodies (Table of Materials) in PBS supplemented with 2% goat serum for 1 h at room temperature.\nPlace slides in staining jar and wash 3x with phosphate buffered saline (PBS) for 5 min.\nPlace mounting medium (Table of Materials) over xenografts sections, place coverslip on top, and use nail polish to seal the coverslip.\nimgsrc://cloudfront.jove.com/files/ftp_upload/59966/59966fig02.jpg",
    "Figure 2: Xenograft Surgery. (A) Hair is removed from surgical site. (B) An incision is made over the tibialis anterior (TA). The distal tendons of the TA and extensor digitorum longus (EDL) are marked with arrows. The black dashed line indicates where the epimysium will be cut in step 3.3. (C) The distal tendon of the TA is cut and the muscle is pulled up to the knee. (D) The tendon of the EDL is cut and the EDL is pulled up to the knee. This exposes the proximal tendon of the peroneus longus (PL) marked with an arrow. Dashed lines indicate where to cut with scissors to remove the EDL (green) and PL (blue). (E) The EDL and TA are removed. (F) A suture is placed through the proximal tendon of the PL. (G) The xenograft is placed in the empty tibial compartment and sutured to the proximal PL tendon using a two-hand surgical square knot. (H) A suture is placed through the distal tendon of the PL, marked with an arrow, and another two-hand surgical square knot is used to suture the xenograft to the distal tendon. (I) The xenograft is fully transplanted and sutured to the PL. (J) The skin is closed with surgical glue. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/59966/59966fig02large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/59966/59966fig03.jpg",
    "Figure 3: 4 Month Xenograft Collection. (A) Hair is removed from surgical site. Sutures are visible under skin. (B) The skin overlying the xenograft is removed. Then the xenograft is grabbed with the iris forceps at the distal suture and gently pulled upward. Starting at the ankle, a scalpel is used to cut along the tibia and free the xenograft. The arrow shows the beginning of the incision along the tibia. (C) By pulling the gastrocnemius muscle to the side, a faint white line of epimysium separating the peroneus longus (PL) muscle and the gastrocnemius (shown by the arrow) becomes visible. Use the scalpel to cut along this line to separate the PL from the other leg muscles. (D) The right side of the xenograft, and the PL are now free from the other muscles in the leg and are ready for removal. The dashed line indicates where to cut with surgical scissors to start removing the xenograft and PL. (E) After cutting below the distal suture, deflect the xenograft toward the knee. The dashed line indicates where to cut with surgical scissors to remove the xenograft and PL from the tibial compartment. (F) The empty tibial compartment with the xenograft and PL successfully removed. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/59966/59966fig03large.jpg]Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}