{
  "id": 3381,
  "origin_website": "Cell",
  "title": "Protocol to minimize the confounding effect of cold stress on socially isolated mice using thermoneutral housing",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nInitiating housing conditions\nTiming: 2 days (for steps 1 to 3)\nThis step outlines how to randomize and initiate social isolation experiments when using the thermoneutral cabinets. Refer to Figure 1[href=https://www.wicell.org#fig1].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2963-Fig1.jpg\nFigure 1. Housing conditions\n(A) Empty thermoneutral cabinet.\n(B) Group housed cage and socially isolated cage in cabinet.\n(C) Close-up of group and isolated cages.\nNote: The below protocol describes how our lab has been able to establish a murine model that recapitulates social isolation-induced propensity for obesity. Variations in the housing temperature, age/sex/line/vendor of mice, diet, and housing conditions may limit reproducibility. It remains likely that variations in other aspects of the protocol (e.g. brand and model of the thermoneutral chamber) are more amenable to substitutions. Please consider all the above when designing experiments.\nNote: This protocol has been validated to induce obesity in C57BL/6 and BALB/c male mice from Charles River Laboratories when initiated at 4 weeks of age, with the birth of a mouse defined as postnatal day 0.\nAllow the mice to acclimate to the animal facility for at least 2 days after arriving to your institution before moving the mice to the thermoneutral housing cabinets.\nNote: All our experiments in social isolation have used animals purchased at 4 weeks of age. No special cautions were taken to minimize shipping stress from the vendor. Though we have no data to advise, shipping mice at an earlier post-wean date would provide more time to habituate and could be considered.\nNote: Other researchers have used male C57BL/6 mice born to the facilities in social isolation initiated post-weaning and have noted behavioral deficiencies in isolated mice, though metabolic data was not presented.13[href=https://www.wicell.org#bib15]",
    "While the mice are habituating, set up the thermoneutral cabinet (Powers Scientific, Inc) to equilibrate temperature (29 ± 1°C) and humidity (30%–70%) levels.\nCabinets are static housing conditions, which means all mice can smell each other. We do not use physical or visual barriers between cages. Up to 24 cages (Allentown, 194 mm × 181 mm × 398 mm) can fit inside one cabinet.\nSet up the cabinet’s light timer such that the lights are on a 12 h light/12 h dark cycle such that the lights are on between beginning at 06:00. and 18:00.\nPlace a digital thermometer inside the cabinet to monitor the internal temperature and humidity. This thermometer should be capable of (1) continuous reporting of the cabinet temperature/humidity or (2) storing the maximum and minimum temperature/humidity levels of the cabinet.\nAfter 2 days of habituation and the equilibration of cabinet conditions, the mice can be randomized into groups, assigned experimental IDs, and placed in the proper housing conditions.\nPerform a body composition scan using an EchoMRI 3-in-1 analyzer (EchoMRI LLC, Houston, TX) to obtain fat and lean mass data for each mouse. Randomize the mice into a socially isolated housing condition and the group housing condition such that there are no significant differences in fat and lean mass between the two housing groups.\nAssign mouse IDs using ear tags, ear punches, or similar methods.\nPlace mice into housing according to their randomized experimental groups.\nGroup-housed mice should be placed into a cage with 5 total mice, corncob bedding, and a single nestlet.\nSocially isolated mice should be place into a cage with 1 total mouse, corncob bedding, and a single nestlet.",
    "Add 60% high-fat diet (Research Diets, Inc.) to the overhead food hopper of each cage. Aim to have around 300 g of food at the start of each week.\nFill water bottles with 400 mL of reverse osmosis water. Ensure that the bottles do not leak and place them inside each cage.\nWeekly maintenance\nTiming: 1 h\nNote: Minimize the amount of time the cabinet door is open and the amount of time each cage is outside of the cabinet. To do this, record body weight one cage at a time and close the cabinet door between each measurement. Cage locations should remain constant throughout the entirety of the experiment to avoid introducing confounding variables.\nRecord body weights for each mouse.\nDetermine cage-by-cage food consumption once per week.\nRecord the concluding week’s final food weight.\nAdd additional food to the food hopper, placing new food on top of older food.\nMeasure the coming week’s initial food weight.\nNote: 60% high-fat diet crumbles easily, especially at temperatures exceeding 22°C. Be gentle when refilling cages to minimize the amount of diet that falls on the bedding and to improve the accuracy of food intake measurements.\nChange water bottles weekly.\nOn a daily basis, monitor the temperature and humidity within the cabinet with a digital thermometer. This can be done by animal husbandry staff if permitted by the local institution. Record the maximum and minimum temperature and humidity. Reset the thermometer to wipe data and initiate recording for the coming day.\nIf target temperature and humidity ranges are not met, review the thermoneutral cabinet settings and inform the attending veterinarian as warranted.\nModel validation\nTiming: >5 weeks\nTiming: 16 h (for steps 8 to 10)\nTiming: 3 h (for steps 11 to 21)",
    "Body weights will diverge around 5–8 weeks post housing (strain-dependent; we have observed divergence by 5 weeks in C57BL/6 mice and 8 weeks in BALB/c mice). At this point, perform a measure of metabolic function to assess whether social isolation has promoted metabolic dysfunction. An EchoMRI can be performed to assess body composition, or a Glucose Tolerance Test (GTT) can be performed to assess glucose processing.\nNote: Mice tend to lose 1–2 g of body weight due to the GTT fasting period (described below). Recovery of this body weight can take up to one week. For this reason, it is recommended that the weekly body weight measurements needing to occur the same week as the GTT occur immediately before the fasting period.\nFast mice for 16 h overnight.\nUpon initiation of the fast, remove mice from their home cage and place them in a new cage that contains new bedding and lacks food.\nNote: Mice are coprophagic, hence the need to move them to a new cage during the fast. Coprophagic behavior can influence blood glucose levels.\nNote: We typically fast overnight from 17:30 to 09:30.\nEnsure water bottles are filled and remain accessible.\nOn the morning of the test, prepare a 10% w/v solution of glucose in pharmaceutical-grade saline.\nNote: The dose of glucose used depends on the diet or metabolic state of the mouse. For obese mice, a dose of 1g/kg body weight is used. For mice with normal weight, a higher dose of 2g/kg body weight is used. If wanting to make comparisons between two different food types in one experiment, a median dose should be used.\nRemove all mice from the thermoneutral cabinet. All mice will remain outside the thermoneutral cabinet for the entirety of the GTT.",
    "Weigh each mouse. Glucose doses will be normalized to this weight.\nTail mark each mouse with a marker to allow for easy identification within each cage.\nNote: If you keep group housed mice in their home cages and do not tail mark each mouse, it will be nearly impossible to keep on-pace during the upcoming sequence. If permitted by IACUC, we recommend keeping the mice in their home cages and using a sharpie to temporarily tail mark the mice.\nObtain baseline fasting blood glucose levels.\nRemove <1 mm of the mouse tail tip to elicit blood flow. Alternatively, use a small needle to pierce the tail vein to elicit blood flow.\nInsert a measurement strip (Contour Next Blood Glucose Test Strips, Ascensia Diabetic Care) into a portable glucometer (Contour Next EZ Blood Glucose Monitoring System, Bayer).\nElicit blood flow and measure the blood glucose level by placing a drop of blood on the measurement strip.\nRecord the blood glucose level as t = 0 min.\nDiscard the used measurement strip.\nNote: At this point, blood flow can be elicited as needed throughout the test. If blood flow remains limited, the tail can be massaged to elicit enough blood for measurement of blood glucose levels. In rare cases, the above steps can be repeated to continue blood flow.",
    "Note: Next, the experimenters will initiate the GTT. Keep in mind that only one mouse can be injected with a glucose bolus and measured at any given time. Accordingly, it will be necessary to stagger injections and blood glucose measurements in intervals to allow for assessments of multiple mice. The timing of each injection must be staggered such that every mouse is able to be injected within 15 min and each blood glucose measurement is able to be recorded at consistent intervals. 30 s is typically the smallest possible interval between injections. Large groups may necessitate multiple test dates. If this is done, ensure that animal representatives from each experimental group are present on each test day.\nFor each mouse, prepare a 0.5 mL syringe with a weight-normalized bolus of glucose solution at a total dose of 1.0 g glucose per kg body weight. Place each syringe in an easy-to-handle location.\nNote: Arrange the environment to your success. Place each syringe in order from left to right in the front of each corresponding cage. Physically space each cage across a countertop to allow for quick movement between cages and animals. Leave enough room to allow for cage lid removal and replacement.\nIntraperitoneally inject the weight-normalized glucose bolus. Start a timer with a count-up function. Stagger mouse injections by a previously-defined interval (see above notes). Continue intraperitoneal injections with each mouse’s corresponding pre-measured glucose bolus at the defined interval. All injections should occur within 15 min.\nAt t = 15 min, begin sequential measurements of the blood glucose levels. Measure the first mouse by performing the below steps. Wait the appropriate staggering interval and then continue with the next mouse in line until a t = 15 min measurement has been obtained from each mouse.",
    "Circulate blood to the bottom of the tail by massaging the tail from the proximal end to the distal end. Wipe the elicited blood onto a paper towel. Repeat this three times.\nInsert a measurement strip (Contour Next Blood Glucose Test Strips, Ascensia Diabetic Care) into a portable glucometer (Contour Next EZ Blood Glucose Monitoring System, Bayer).\nReturn the mouse to its cage.\nRecord the blood glucose level.\nNote: Since the glucose injections are staggered, the blood glucose measurements can be staggered and later synced during data analysis.\nRepeat the above steps to obtain blood glucose measurements at t = 0 min, 15 min, 30 min, 60 min, 90 min, and 120 min post glucose injection.\nAfter obtaining each measurement for every mouse, you must stop blood flow. Dip the snipped tails in Kwik-Stop powder (ARC Laboratories) to help clot the blood.\nReturn mice to their home cages with food and water in the thermoneutral cabinet.\nNote: The insulin tolerance test (ITT) and pyruvate tolerance test (PTT) are two variations of the above test that can be used to assess metabolic function. Refer to the literature to see how these tests differ in their fasting and administration protocols.\nNote: The GTT induces stress in mice, and isn’t recommended to be performed frequently. An EchoMRI body composition analysis can be used repeatedly as a non-invasive method to assess metabolic changes due to housing condition as a supplement to a GTT."
  ],
  "subjectAreas": [
    "Health Sciences",
    "Metabolism",
    "Model Organisms",
    "Systems Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}