{
  "id": 5355,
  "origin_website": "Bio",
  "title": "Synthetic Lethality Screens Using RNAi in Combination with  CRISPR-based Knockout in <em>Drosophila</em> Cells",
  "procedures": [
    "Preparation of conditioned mediaGrow S2R+ cells to 100% confluency in a 10 cm dish or T75 flask in complete media. Cells should be cultured under standard conditions: 25 °C, with ambient CO2 levels.Split cells 1:5 using complete media and culture for 3 days (or until almost 100% confluent but without overlapping cells).Remove all media and replace with 10 ml complete media. Immediately detach cells by gently pipetting the complete media using a 10 ml pipette to wash the cells off the bottom of the dish/flask, then transfer 5 ml of cell suspension to a new dish or flask and add an additional 5 ml complete media. Grow for 16 h (no longer). Check to ensure that the cells look healthy at this point.Collect media and sterilize using a 0.2 μm filter to remove all cells.Dilute media 1:1 using high-serum media. Store at 4 °C up to four weeks.Generation of mutant cell linesDesign and generate a sgRNA expression plasmid using the pl18 vector as described previously (Housden et al., 2016).Seed S2R+ cells in complete media into a 6-well plate such that cells will be 40-80% confluent upon attachment (2-8 x 105 cells per well in 1 ml complete media). Allow to attach for ~20 min at 25 °C.Transfect cells with 40 ng act-GFP plasmid and 360 ng of sgRNA expression plasmid from step B1 using 10 μl Effectene reagent according to the standard Effectene Transfection Reagent protocol.Incubate cells at 25 °C for 4 days.Place 100 μl conditioned media in each well of three clear-bottom 96-well tissue culture plates.Aspirate spent media from transfected cells and detach by gentle pipetting with 1 ml PBS/1% FBS. Filter cell suspension through a 40 μm filter to remove cell aggregates.",
    "Use FACS to isolate the top 10% of GFP expressing cells, excluding the top 1% of GFP cells (which are generally not viable). See Note 1 and Figure 1.Seed 100 cells into well A1 of each 96-well culture plate (this will be used to find the focal plane in step B10) and a single cell into the remaining 95 wells of each plate.Seal plate edges with Parafilm and place in a humidity chamber inside a 25 °C incubator.Incubate plates for 2 weeks and then examine each well under a microscope to identify those containing colonies, using well A1 to focus the microscope.For wells containing colonies that have grown to a sufficient size (see Figure 2 for examples of suitable colonies), resuspend the colony in the media already in the well by gentle pipetting with a 100 μl pipette. Mix 50 μl of the cell suspension with 75 μl conditioned media and transfer to a well of a new 96-well plate. Use the remaining 50 μl cell suspension for a genomic DNA preparation for analysis of mutations.Identify mutant colonies using the previously described genomic DNA and HRMA protocols (Housden and Perrimon, 2016).Confirm that mutations are homozygous frameshifts by sequencing TOPO-cloned PCR product from step B12 using M13F and M13R primers. We recommend sequencing at least 20 TOPO-cloned constructs for each sample to ensure that all allele sequences of the target gene are identified.Following identification of mutant clones, the relevant cell population can be expanded by serially transferring from the 96-well plate to a 24-well plate and then a 6-well plate and finally a 10 cm dish or T75 flask. Cells should be transferred using conditioned media until they reach a 6-well plate, at which point complete media can be used. Transfers should be performed when cells reach confluence at each stage.",
    "imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170124/20170124214923_0123.jpgFigure 1. FACS setup for isolation of single GFP positive cells. GFP positive cells are isolated by first selecting viable cells (A), then removing doublets (B), then identifying all GFP positive cells (C) and finally selecting the top 10% of GFP expressing cells for sorting (D). Gating hierarchy is shown in panel E.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170124/20170124215059_1864.jpgFigure 2. Examples of suitable colonies for expansion and sequence analysisdsRNA screenDefrost the 384-well dsRNA assay plates from -80 °C storage and centrifuge at 805 x g for 2 min before use.Remove media from cells cultured in T75 flasks or 10 cm dishes using a Pasteur pipette while taking care not to detach the cells. Note that S2R+ cells are adherent but will detach easily when disturbed.Add 10 ml serum-free media warmed to room temperature to each T75 flask or 10 cm dish. Use this media to detach the cells by gentle pipetting and transfer to a 15 ml conical tube.Count cells using a haemocytometer and dilute to 500,000 cells per ml with fresh serum-free media.Remove seals from each assay plate, holding the plate down while the seal is pulled away.Transfer diluted cell suspension to a multichannel reservoir and dispense 10 μl (5,000 cells) into each well of each 384-well dsRNA assay plate. Tips do not need to be changed between each well but cell suspension should be pipetted onto the well walls to avoid transferring dsRNA reagents between wells. Start a timer when the first cells are added to the first plate.Centrifuge plates briefly (130 x g for 5 sec) to move the cell suspension to the bottom of the wells, then place in a sterile hood at room temperature to incubate.At 45 min after adding the first set of cells, begin to add 35 μl complete media (10% FBS) to each well.",
    "Add the complete media to the plates in the same order as the cells were previously added.Seal plate edges with Parafilm and place into a humidity chamber.Incubate at 25 °C for 5 days.Add 30 μl of CellTiter-Glo reagent to each well of the assay plates and gently mix CellTiter-Glo reagent with cells (by placing on a rotator or with gentle shaking for 5 min at room temperature) to allow cells to lyse. Take care not to mix too vigorously to avoid splashing of samples between wells or creation of bubbles.Read luminescence using a suitable plate reader."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}