{
  "id": 19299,
  "origin_website": "Jove",
  "title": "Murine Bioluminescent Hepatic Tumour Model",
  "procedures": [
    "Introduction\nThe liver is often the first site of metastatic disease and may be the only site of spread in as many as 30 40% of patients with advanced disease. However options for treating metastatic liver tumours are few with a minority of patients suitable for resection and only 23% major responders to chemotherapeutics. Preclinical research in this field has been limited by the absence of a suitable mouse model to study isolated liver disease. We describe a split-spleen approach that can be used to reliably establish uniform, diffuse liver metastases. Resection of this half of the spleen avoids the consequences of splenic tumour growth and the other half of the spleen is returned with an intact portal circulation to maintain splenic immune protective properties. The model we describe is quite simple to perform and can be done quickly through a single incision. The bioluminescent properties of the tumour cell line allows accurate quantification of treatment response without sacrifice of animals.\nProtocol\nI. Cell Preparation\nLewis lung carcinoma cells are grown Dulbecco's Modified Essential Medium supplemented with 10% fetal calf serum at 37°C, 5 % CO2 and harvested by trypsinisation when sub-confluent.\nCells were counted using a Nucleocounter (Chemo-metec, Denmark) and a single cell suspension of 1 X 106 cells in 200 μl was prepared in serum free media.\nII. Mouse Preparation",
    "Note: All procedures were approved by the ethics committee of University College Cork. In our laboratory we use injectable anaesthetics to anesthetize the mouse; alternatively, one can use inhaled anaesthetics to achieve the same effect. The mouse strain we used is the hairless MF1 nu/nu strain obtained from Harlan Laboratories (Oxfordshire, England). Female MF1 nu/nu mice weighing 16-22 g and of 6-8 weeks of age were included in this experiment. Other strains such as the C57 and Balb/c may also be used with appropriate tumour cell lines. \nAnaesthesia was delivered by intraperitoneal injection of 100ul of 1.5 mg ketamine and 300 ug xylazine. \nThe depth of anaesthesia is assessed using toe pinch. There should be no withdrawal reflex with toe pinch.\nThe anesthetized mouse is properly positioned and taped over a heating pad.\nThe abdomen is prepped with a 10% betadine solution.\nThe abdomen and surgical site are draped in a sterile fashion.\nIII. Abdominal Incision\nA small subcostal incision is made in the skin.\nThe incision is extended to 2-3 cm.\nThe abdominal wall musculature were divided and peritoneal cavity entered.\nIV. Exposure and Division of Spleen\nThe spleen is mobilised and gently exteriorized on a pre-cut sterile gauze.\nTwo 4-0 vicryl ligatures are tied around the mid body of the spleen.\nSpleen is divided between the two ligatures creating two hemi-spleens.\nV. Injection of Cells into the Hemi-spleen\nA 27 G is used to inject a 100 μL volume of cells into one hemi-spleen.\nTumour cells are allowed to drain to the liver for ten minutes providing sufficient time for the majority of the injected cells to reach the liver.\nVI. Excision of Hemi-spleen, Abdominal closure and Recovery\nThe injected hemi-spleen is excised.\nThe other hemi-spleen is returned to the abdominal cavity.",
    "The muscle layer is closed with 4-0 PDS suture using a simple running stitch.\nThe abdominal skin is closed with 4-0 Prolene using interrupted stitches.\nFluid bolus is administered and post-operative analgesia, Carpofen (5 mg/kg) is administered by IP injection for 24 h post surgery.\nThe mouse is allowed to recover from anaesthesia\nVII. IVIS Whole Body Bioluminescent Imaging\nMouse is anaesthetised using injectable anaesthetic. \nLuciferin substrate is given by intra-peritoneal injection ten minutes before imaging\nMice are placed on the stage and imaged for 3 min using IVIS Whole body imaging system\nLuminescence from the liver can be measured using a region of interest tool\nVIII. Exposure of mouse liver\nMouse is anaesthetised using injectable anaesthetic.\nA rooftop abdominal incision allows visualisation of diffuse liver metastasis in vivo.\nThe mouse is euthanized by cervical dislocation and the liver may be excised for further analysis.\nimgsrc://cloudfront.jove.com/files/ftp_upload/1977/1977fig1.jpgFigure 1. Freshly excised murine untreated and tumour-infiltrated livers.\nimgsrc://cloudfront.jove.com/files/ftp_upload/1977/1977fig2.jpgFigure 2. Kinetics of hepatic tumour growth as evidenced by IVIS whole body imaging.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}