{
  "id": 13697,
  "origin_website": "Jove",
  "title": "Tracking Cells in GFP-transgenic Zebrafish Using the Photoconvertible PSmOrange System",
  "procedures": [
    "1. H2B-PSmOrange mRNA In Vitro Transcription and mRNA Purification\nLinearize the H2B-PSmOrange containing pCS2+ plasmid using the NotI restriction enzyme according to manufacturer's instructions.\n\tNote: Perform the next steps using appropriate protections such as gloves and lab coat to prevent mRNA contamination and degradation.\nPurify the linearized DNA using a PCR Purification kit or phenol-chloroform based methods according to manufacturers' protocols.\nUse 1 µg of linearized template DNA for Sp6-mRNA transcription according to manufacturer's instructions.\nRemove DNA by adding 1.0 U RNase free DNaseI for 10-20 min at 37 °C.\nClean up the mRNA using a RNA clean up kit according to manufacturer's protocol.\nTo increase mRNA purity and concentration, precipitate the mRNA by adding 6 µl sodium acetate (3.0 M, pH 5.2) and 150 µl 96% ethanol. Incubate the mixed solution at -20 °C for at least 30 min and up to 24 hr.\nCollect the mRNA by spinning the solution at 18.407 x g for 45 min at 4 °C. Discard the liquid and resuspend the mRNA in 150 µl 70% ethanol. Mix and centrifuge the solution for an additional 15 min at 4 °C. Discard the liquid, dry the pellet for 5 min on ice and resuspend the mRNA in 20 µl ultrapure RNase free water.\nAssess the concentration and purity of the mRNA by photometric measurement of a 1:100 mRNA dilution (1 µl mRNA in 99 µl ultrapure RNase free water).\nFor short-term storage, keep the mRNA solution at -20 °C. For long-term storage, keep the mRNA at -80 °C.\n2. H2B-PSmOrange mRNA Microinjection into Zebrafish Embryos\nSet up mating pairs the night before injection using tg(foxD3:GFP); tg(flh:GFP) double transgenic fish (or any other GFP transgenic fish). Leave the fish separated by placing a spacer between them to control the time of mating.",
    "Remove the spacer in the morning of injection and let the fish mate for 20 min.\nDuring mating time, dilute the H2B-PSmOrange mRNA to the final concentration of 130 pg/nl (in RNase free water) and transfer 6 µl injection solution into a microinjection capillary using a microloader tip. Check the injection volume with a calibrated glass slide. Adjust the injection pressure to inject 2 nl mRNA solution (260 pg).\nCollect the eggs into a sterilized plastic petri-dish containing 1x Embryo (E3) medium.\nTransfer 20 to 30 embryos to an injection dish using a plastic pasteur pipette.\nInject 2 nl mRNA containing solution into the cell or just below the cell into the yolk at the one-cell stage 11.\nTransfer injected embryos into a petri-dish containing 1x E3 medium, remove unfertilized or not normally developing embryos and grow them at 28 °C.\n\tNote: Light protection of the embryos is not required throughout the experiment.\nRaise zebrafish embryos in 1x E3 medium and add 0.2 mM PTU (1-phenyl-2 thiourea) after gastrulation to inhibit pigmentation. Change the medium twice per day to minimize the danger of bacterial contaminations.\n3. Embryo Embedding\nSelect the GFP (green) and PSmOrange (orange/red) co-expressing embryos using a binocular microscope equipped with a fluorescence lamp and appropriate emission filters. Transfer the positive embryos into a sterile petri-dish containing 1x E3 medium.\nDechorionate embryos under a stereomicroscope using forceps 12.\nTransfer one embryo in a 1.5 ml tube containing 1.0 ml of pre-warmed 1.0% low melting agarose (LMA) prepared in ultrapure water by using a cut-tip pipette (P200). Note: Warm the LMA to 80 °C and cool down for 3-5 min at RT before embedding the embryo.",
    "Transfer the embryo in 150 µl LMA into a chambered coverglass and adjust the embryo's orientation, e.g. dorsal side down in the experiment described for the inverted confocal laser scanning microscope A1R+ (or any other suitable microscope), using a fine plastic tip. When the LMA is polymerized, fill the chamber with fish water containing 0.2 mM PTU and 0.02% ethyl 3-aminobenzoate methansulfonate (Tricaine) for anesthesia.\nBefore imaging the sample, wait 15 min to ascertain the effect of Tricaine. The anesthesia prevents embryo movements, which can be monitored using a stereomicroscope equipped with brightfield illumination.\n\tNote: The chambers can be reused twice.\n4. PSmOrange Photoconversion\nPlace the sample under the confocal microscope and scan the specimen to identify the area to photoconvert using 488 nm and 561 nm lasers for imaging GFP and PSmOrange respectively.\n\tNote: Use the inverted confocal laser scanning microscope A1R+ on the inverted stage TiEcontrolled by the microscope imaging software and equipped with 488 nm, 561 nm and 640 nm lasers for photoconversion and imaging. However, the application is certainly not restricted to this microscope as long as the laser lines for conversion and imaging are available.\n\t\nPut the 20X air objective into place (NA: 0.75; WD: 1.0 mm; FOV: 0.64 x 0.64 mm).\nUse the following microscope settings to detect the PSmOrange protein before photoconversion: 561 nm laser, 0.74 mW measured at the focus plane above the objective.\n\t\tNote: This corresponds to 40% on this system (measuring in the focus plane is the only way to determine the effective power). Adjust the laser power according to experimental needs as the efficiency of H2B-PSmOrange injections can vary.\nAdd zoom factors to highlight the area of interest. Higher magnifications reduce image acquisition time and therefore phototoxicity.",
    "Acquire a z-stack covering the structures of interest using 488 nm and 561 nm lasers in sequential mode (line mode 1->4). Fix the z-step between 1.0 and 2.0 µm. Line average and scan frequency can be used to optimize image quality.\nScan the sample and select the region of interest (ROI) tool to highlight the area to photoconvert. Fix the ROI as stimulation area. Select the Photo Activation/Bleaching module, activate the 488 nm laser by checking the respective box and set the 488 nm laser to 80% (1 mW laser power measured at the objective). Set the scan speed to 0.5 sec/Frame.\nOpen the photoconversion utility (ND Stimulation) and specify the photoconversion settings.\n\t\nClick on the \"Add\" command to specify the photoconversion protocol.\nSet \"Phase\" 1 in the \"Acquisition/Stimulation\" menu to \"Acquisition\" and indicate the number of images to be acquired before photoconversion in the \"Loops\" menu.\nSet \"Phase\" 2 to \"Stimulation\" and enter the number of stimulation events to be performed.\nAdjust \"Phase\" 3 as described for \"Phase\" 1. Optionally, insert a waiting \"Phase\" after \"Phase\" 2 by entering the time to wait before the last round of image acquisition.\nOnce all the parameters are set, apply the stimulation setting and run the photoconversion.\n\t\tNote: Laser power, frequency of scanning and number of iterations for each round of photoconversion can vary and differ from embryo to embryo. A setting to start with is shown in Table 1.\nAcquire a final z-stack using 488 nm, 561 nm and 640 nm lasers applying the settings as above. Set the 640 nm laser to visualize the converted PSmOrange using high laser power (up to 4.5 mW).\n5. Dismount Embryo from LMA\nRemove the embryo containing chamber from the microscope. Carefully remove the embryo from the agarose using forceps.",
    "Transfer the embryo into a new sterilized plastic petri-dish or into a sterilized 6-well-plate containing 1x E3 and 0.2 mM PTU. Incubate the embryo at 28 °C until the desired stage of development.\n6. Analyzing the Fate of Photoconverted PSmOrange Protein Expressing Cells\nRe-embed the embryo as described under points 3.3 and 3.4.\nPlace the sample under the confocal microscope and scan the specimen to identify photoconverted cells (640 nm) in the GFP transgenic structure of interest (488 nm).\nAcquire a z-stack covering the structures of interest using 488 nm, 561 nm and 640 nm lasers in sequential mode (line mode 1->4). Fix the z-step between 1.0 and 2.0 µm. Line average and scan frequency can be used to optimize image quality.\nUse one of the following methods to identify cells, which co-express GFP and the photoconverted protein.\n\t\nCustom made automatic Fiji ImageJ Macro3\nConvolve the original stack using the \"GaussianBlur\" plugin ( → Process → Filters → GaussianBlur) and subtract the smooth stacks from the original using the \"Image Calculator\" plugin (→ Process → Image Calculator). Use this step to visualize the structures of interest and reduce the computational time for the analysis.\nApply specific thresholds to the green and far-red channels in order to highlight the photoconverted cells ( → Image → Adjust → Threshold). Use the \"Analyze Particles\" tool to detect the threshold areas with a suitable setting ( → Analyze → Analyze Particles).\nOpen the \"Image Calculator\" plugin and display the overlapping ROIs in the green and far-red channel in yellow ( → Process → Image Calculator).\nMicroscope imaging software for 3D data evaluation",
    "Display the stack in 3D using the show volume view option ( → 3D Visualization Menu → Show Volume View). Use the graphic interface to select the green, red and far-red channels, adjust the brightness and the contrast and crop the 3D stack to highlight the photoconverted area (Figure 1).\n\t\t\tNote: Similar methods to analyse the data are available in most of the common software for image analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}