{
  "id": 8595,
  "origin_website": "Jove",
  "title": "An Antibody Feeding Approach to Study Glutamate Receptor Trafficking in Dissociated Primary Hippocampal Cultures",
  "procedures": [
    "Work pertaining to hippocampal primary culture preparation was reviewed and approved by the Northwestern University Animal Care and Use Committee (protocol #IS00001151).\n1. Preparation Before Labeling\nPreparation and maintenance of primary hippocampal cultures\nPrepare primary hippocampal cultures at a density of 150,000 cells plated on poly-D-lysine-coated (0.1 mg/mL) 18 mm cover glasses. Excellent guides for dissociated neuronal culture preparation are available7,8.\nNOTE: If required, the cultures may be treated with cytosine arabinoside (Ara-C, 10 μM from DIV1) to avoid glial proliferation in the preparation.\nNOTE: Alternative coating reagents such as fibronectin (1 mg/mL) or laminin (5 μg/mL) may be used instead of poly-D-lysine.\nMaintain cultures in a cell incubator at 37 °C and 5% CO2 in 2 mL/well of neurobasal media supplemented with B27 and 2 mM L-glutamine.\nNOTE: Substitutes for L-glutamine (e.g., Glutamax) can be used, if desired.\nOn weekly-basis, remove half the volume of media and replace with the same volume of supplemented neurobasal media.\nOPTIONAL: Transfection of mutated and/or epitope-tagged receptors\n\tNOTE: Neurons should be transfected at least 3–4 days prior to the analysis time point to allow for receptor expression. The use of young neurons [Days in vitro 6–9 (DIV6–9)] results in better transfection efficiency than older (DIV15–20) neurons, but a sufficient number of transfected cells (>20) can be achieved regardless of the DIV employed.\n\t\nFor each well of a 12-well plate, dilute 1.5 μg of plasmid containing the construct of interest in 100 μL of fresh neurobasal media without B27 or glutamine supplementation in a microcentrifuge tube and mix by vortexing quickly.\nNOTE: For successful transfection, it is critical that the neurobasal media used is as fresh as possible, ideally less than 1 week after bottle opening.",
    "In a second microcentrifuge tube, mix 1 μL of an appropriate lipofection reagent in 100 μL of fresh neurobasal media and mix gently.\nNOTE: Do not vortex the lipofection reagent mixture. Use of fresh lipofection reagents can improve transfection efficiency.\nIncubate the tubes for 5 min at room temperature (RT).\nAdd the lipofection reagent mixture dropwise to the DNA mixture, mix gently, and incubate for 20 min at RT.\nAdjust the volume of media in each well to 1 mL of conditioned media.\nAdd the lipofection reagent -DNA mixture dropwise to the well.\nReturn cells to the incubator and allow at least 3–4 days for protein expression.\nNOTE: For the purposes of the internalization and recycling protocols outlined below, hippocampal neurons were transfected at DIV11–12 with constructs expressing GluN2B tagged with GFP in the extracellular domain (GFP-GluN2B) and imaged at DIV15–16.\nOPTIONAL: Incubation of cells with drugs (chronically or acutely) in the conditioned media until fixation.\n\tNOTE: For acute treatment, begin treating cells before labeling. Depending on the drug treatment protocol used, cells can be maintained in drug-containing media during section 2. In our example, DIV21 cells were subject to a cLTP protocol to increase surface-expressed AMPAR9.\n\t\nExchange conditioned media for extracellular solution (ECS).\nTreat cells with 300 μM glycine in ECS for 3 min at RT. As a control, treat a sister coverslip with ECS (without glycine).\nWash cells 3x with 37 °C ECS and return the cells in ECS (without glycine) to the cell incubator for 20 min prior to continuing with section 2.\nNOTE: ECS (in mM): 150 NaCl, 2 CaCl2, 5 KCl, 10 HEPES, 30 Glucose, 0.001 TTX, 0.01 strychnine, and 0.03 picrotoxin at pH 7.4.\n2. Live Labeling of Surface-expressed Receptors\nPrepare coverslips for labeling",
    "To save reagents and facilitate manipulation, transfer coverslips cell side up to a paraffin film-covered tray.\nNOTE: It is critical to never let the samples dry out.\nSave and maintain conditioned media at 37 °C for incubation and washing steps.\nNOTE: For an 18 mm coverslip, incubation with 75–100 μL of media for antibody labeling and 120–150 μL for internalization/recycling are recommended.\nLabeling of surface receptors with primary antibody\nIncubate cells with primary antibody diluted in conditioned media for 15 min at RT.\nNOTE: For GFP-tagged receptors, rabbit anti-GFP antibody at a dilution of 1:1000 was used. For endogenous GluA1, mouse anti-GluA1 at a 1:200 dilution was used.\nCarefully aspirate off the antibody-containing media using a vacuum pipette and wash cells three times with conditioned media.\nNOTE: If conditioned media is unavailable, all washing steps may be performed using PBS+ [phosphate buffered saline (PBS) containing 1 mM MgCl2 and 0.1 mM CaCl2]. Manual aspiration using a micropipette may be performed if gentle vacuum aspiration is not available.\n3. Surface Expression (Figure 2)\nSecondary antibody labeling of surface-expressed receptors\nWash once with PBS+.\nFix cells by incubating with 4% paraformaldehyde (PFA) and 4% sucrose in PBS for 7–8 min.\nNOTE: Unlike other fixation methods such as methanol incubation, PFA does not permeabilize the plasma membrane and is therefore suitable for surface-expression analysis. For optimal results, use freshly prepared PFA. Short-term storage of PFA at 4 °C or long-term (up 30 days) storage at -20 °C is permissive for adequate fixation.\nCAUTION: PFA is a known carcinogen. Use proper personal protective equipment and a safety hood when handling.\nWash cells three times with regular PBS.",
    "NOTE: Alternatively, 0.1 M glycine can be used for washing PFA instead of PBS, as glycine will quench any remaining fixative that may increase the background in the preparation.\nBlock nonspecific binding sites by incubating with 10% normal goat serum (NGS) in PBS for 30 min at RT.\nNOTE: Blocking time can be extended without adverse effects on labeling.\nIncubate with fluorescently-tagged secondary antibody diluted in 3% NGS in PBS for 1 h at RT to label primary antibody-labeled receptors (i.e., surface-expressed).\nNOTE: In these examples, a 1:500 dilution of Alexa 555-conjugated secondary antibodies:goat anti-rabbit for GFP-labeled receptors and goat anti-mouse for GluA1 was used.\nWash cells with PBS 3x.\nLabeling of intracellular receptors\nPermeabilize cells with 0.25% Triton X-100 in PBS for 5–10 min at RT.\nNOTE: To check that the initial round of antibody labeling occupies all surface epitopes, this permeabilization step can be skipped in a sister culture. In this case, no signal for intracellular receptors should be obtained. Additionally, to check that no internal receptors have been labeled in the previous section 2 (i.e., showing the integrity of the plasma membranes in culture), the permeabilization step can be skipped in a sister culture, and a primary antibody against an intracellular protein (e.g., PSD-95 or MAP2) can be utilized in step 2.2.1. No signal should be obtained from this primary under these conditions. In this case, a rabbit anti-PSD-95 antibody (1:500) was used.\nBlock with 10% NGS in PBS for 30 min at RT.\nLabel intracellular receptors by incubating permeabilized cells with the same primary antibody used in section 2.2 diluted in 3% NGS in PBS for 1 h at RT.",
    "NOTE: The antibody dilution for labeling intracellular receptors may be different than that required for labeling surface-expressed receptors. In the example of GluA1, the same antibody dilution (1:200) was used.\nWash cells 3x with PBS.\nLabel with second fluorescently-tagged secondary antibody diluted in 3% NGS in PBS for 1 h at RT.\nNOTE: In these examples, a 1:500 dilution of goat anti-mouse Alexa 647-conjugated secondary antibody (for GluA1) was used.\nWash cells 3x with PBS.\n4. Internalization (Figure 3)\nInternalization of antibody-labeled surface receptors\nAfter labeling of surface-expressed receptors and antibody washing (section 2.2), maintain cells in conditioned media without antibody and return them to the incubator (37 °C) to allow for internalization.\nNOTE: For NMDA receptors, 30 min for internalization is recommended. As a control, a sister culture may be maintained with conditioned media at 4 °C during the internalization process. Minimal receptor internalization should occur under these conditions.\nLabeling of surface receptors\nWash cells once with PBS+.\nFix cells with 4% PFA and 4% sucrose in PBS for 7–8 min.\nCAUTION: Use proper personal protective equipment and a safety hood when handling PFA.\nWash cells 3x with regular PBS.\nBlock with 10% NGS in PBS for 30 min at RT to prevent nonspecific binding.\nIncubate samples with fluorescently-tagged secondary antibody diluted in 3% NGS in PBS for 1 h at RT to label primary antibody-labeled receptors (i.e., surface-expressed receptors which were not internalized).\nNOTE: For this example, Alexa 555-conjugated goat anti-rabbit secondary antibody (1:500) was used for labeling.\nWash cells 3x with PBS.\nLabeling of internalized receptors\nPermeabilize cells with 0.25% Triton X-100 in PBS for 5–10 min.\nBlock nonspecific binding by incubation with 10% NGS in PBS for 30 min at RT.",
    "Incubate samples with fluorescently tagged secondary antibody diluted in 3% NGS in PBS for 1 h at RT to label internalized antibody-labeled receptors.\nNOTE: For this example, Alexa 647-conjugated goat anti-rabbit secondary antibody (1:500) is used for labeling.\nWash cells 3x with PBS.\n5. Recycling (Figure 4)\nInternalization of antibody-labeled surface receptors\nAfter labeling of surface-expressed receptors and antibody washing (section 2.2), maintain cells in conditioned media without antibody and return them to the incubator (37 °C) to allow for internalization.\nNOTE: For NMDA receptors, 30 min for internalization is recommended.\nBlocking of stable surface expressed receptors\nTo block the epitopes on the primary antibody attached to surface-expressed receptors that have not been internalized, incubate cells with unconjugated Fab anti-IgG (H+L) antibody fragments (against the primary used in section 2.2) diluted in conditioned media (20 μg/mL) for 20 min at RT. This treatment prevents future interaction with secondary antibodies.\nNOTE: For this example, Goat anti-rabbit Fab fragments were used.\nNOTE: Control experiment: to ensure that complete blocking of surface-expressed receptors has occurred, sister coverslips can be incubated with and without Fab. Cultures should be fixed immediately after Fab treatment, and both cultures are incubated with Alexa 555-conjugated secondary antibody. No Alexa 555 signal in the Fab-incubated cells indicates proper antibody blocking.\nWash cells 3x with conditioned media.\nIncubate cells with conditioned media containing 80 μM dynasore to prevent further internalization and return cells to the incubator (37 °C) to allow for recycling of internalized receptors. Dynasore is a GTPase inhibitor that inhibits dynamin and therefore prevents internalization.\nNOTE: 45 min for NMDAR recycling is recommended. Note that Dynasore exclusively blocks the dynamin-dependent internalization process (e.g., NMDARs internalization). However, internalization of other synaptic protein (dynamin-independent) can still occur in the presence of Dynasore.\nLabeling of recycled receptors",
    "Wash cells once with PBS+.\nFix cells with 4% PFA and 4% sucrose in PBS for 7–8 min.\nCAUTION: Use proper personal protective equipment and a safety hood when handling PFA.\nWash cells 3x with PBS.\nBlock with 10% NGS in PBS for 30 min at RT to prevent nonspecific binding.\nLabel cells with first fluorescently-tagged secondary antibody diluted in 3% NGS in PBS for 1 h at RT.\nNOTE: For this example, Alexa 555-conjugated goat anti-rabbit antibody (1:500) was used for labeling.\nWash cells 3x with PBS.\nNOTE: Longer washes with PBS (5–10 min) may help to reduce background in the preparation.\nLabeling of internalized receptors\nPermeabilize cells with 0.25% Triton X-100 in PBS for 5–10 min.\nBlock with 10% NGS in PBS for 30 min at RT.\nLabel with second fluorescently-tagged secondary antibody diluted in 3% NGS in PBS for 1 h at RT.\nNOTE: For this example, Alexa 647-conjugated goat anti-rabbit antibody (1:500) was used for labeling.\nWash cells 3x with PBS.\n6. Mounting and Imaging of Samples\nMount cells by gently placing the coverslips cell side down on 12–15 μL of the appropriate mounting media.\nNOTE: Aspiration of excess mounting media will improve the quality of images.\nImage cells on an appropriate confocal microscope.\nNOTE: It is recommended to image a z-stack at 60x magnification with 0.35 μm steps, encompassing the entire thickness of the neuron.\n7. Time Considerations\nThis is a long protocol that can be stopped at several points. If desired, perform blocking and primary antibody incubation steps overnight at 4 °C in a humid chamber.\nAlternatively, if desired, use a microwave tissue processor to vastly speed up post-fixation incubation times. For all steps, use 150 W at 30 °C for “On” settings.",
    "To block, run the processor at 2 min “On,” 1 min “Off,” and 2 min “On.”\nFor primary and secondary antibody incubation steps, run the processor at 3 min “On,” 2 min “Off,” and 3 min “On.”\nNOTE: We observe no difference in quality by making the above alterations to the protocol.\n8. Image Analysis\nIt is recommended to use FIJI <https://fiji.sc/> to conduct image analysis, as it is compatible with multiple file formats. For our data, images in the Nikon ND2 file format were acquired.\nA macro script is provided for easy batch quantification of different parameters pre-selected by FIJI. The following steps are included in the macro:\nNOTE: For these examples, “integrated intensity” was measured.\nOpen the image files in FIJI and separate channels.\nZ-project each channel stack as a maximum intensity projection.\nSet a lower threshold for each channel.\nNOTE: Thresholds should be empirically determined for each experimental data set. While each channel can have a separate lower threshold value, it crucial that channel threshold values are consistently maintained for all images of the same data set.\nSelect three to five secondary or tertiary dendrites and save them as regions of interest (ROIs).\nMeasure the integrated density of each ROI in surface and intracellular channels.\nNormalize the signal for each ROI by dividing the integrated density value of the surface channel by the intracellular channel.\nRepeat the measurements for all control and experimental images and normalize experimental values to control values (e.g., GluN2B WT or no-glycine conditions).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}