{
  "id": 2762,
  "origin_website": "Cell",
  "title": "Generation of single-cell and single-nuclei suspensions from embryonic and adult mouse brains",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nWe describe multiple strategies to generate single-cell or single-nuclei suspensions from either embryonic or juvenile/adult mouse brain tissue. If harvesting tissue from embryonic mouse brains: steps #1–21 describe the procedure to harvest specific regions of the embryonic brain, steps #32–37 describe generation of single-cell suspensions, and steps #46–57 describe generation of single-nuclei suspensions. If harvesting tissue from juvenile/adult mouse brain: steps #22–31 describe the procedure to harvest specific of the adult brain via either brain slices (#22–26) or whole-mount (#27–31), steps #38–45 describe generation of single-cell suspensions, and steps #46–61 describe generation of single-nuclei suspensions. If proceeding with single-cell sequencing reactions using the 10x Genomics platform: steps #62–63 describe how to prepare cell or nuclei suspensions for RNA-seq, ATAC-seq or Multiome analysis.\nHarvesting embryonic mouse brains\nTiming: 15 min\nEmbryos are removed from the dam and brains are collected in ACSF.\nAnesthetize timed pregnant dams with either isoflurane (4% for induction) or Euthasol (270 mg/kg, 50 μL/30 g mouse, intraperitoneal (IP) injection).\nAfter confirming no response to painful toe pinch stimuli, perform cervical dislocation and place dam on petri dish.\nUse sterilized scissors to cut an incision along the midline of lower abdominal to expose the uterus and embryos.\nCut through connective tissue under the embryonic chain to extract the uterus with embryos and transfer to carbogenated ACSF in Petri dish on ice.\nUsing Dumont #2 forceps, remove each embryo from the uterus and amniotic sac and transfer embryos to a new Petri dish with carbogenated ACSF on ice.\nDecapitate each embryo and transfer heads to a new Petri dish with carbogenated ACSF on ice.",
    "Select 1 head and under a dissecting microscope, use Dumont #5 forceps and/or curved micro forceps to remove the skin and skull and expose the brain using 1 of 2 strategies:\nWith the head dorsal side up, stabilize the head of embryo by holding the nasal and Maxillary region with forceps.\nUsing fine forceps in other hand, peel away skin to expose the skull.\nPierce the skull with forceps and peel away skull to expose the brain (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2273-Fig1.jpg\nFigure 1. Embryonic mouse brain dissection\n(A and B) Two different dissection strategies to remove skin and skull.\n(C) Brain exposed.\n(D) Remove midbrain and hindbrain.\n(E) MGE should be visible in lateral ventricles after hemisecting the brain.\n(F) MGE, LGE and CGE exposed after peeling back cortex, with MGE-LGE sulcus being clearly visible (black arrow).\n(G and H) Separating MGE by inserting forceps (dotted lines) through MGE-LGE sulcus.\n(I) Two incisions (black arrows) to separate the CGE and LGE.\n(J) Forceps used to pinch off LGE from surrounding brain tissue.\n(K) Removal of LGE, CGE and cortex (Ctx).\nWith head lying on its side, use forceps to grasp skin between brain and base of skull to minimize damaging the brain. Peel away skin and skull to expose brain, rotating head as needed to remove skin and skull (Figure 1[href=https://www.wicell.org#fig1]B).\nWhen skin and skull are removed from the top and sides of the brain (Figure 1[href=https://www.wicell.org#fig1]C), slide forceps underneath the brain (along the base of the skull) and ‘pinch’ off brain to remove it from head, then transfer brain to a new Petri dish with carbogenated ACSF on ice.\nCritical: Repeat steps 6–8 for all embryos before moving on to the next steps to ensure that brains are incubated in ACSF as fast as possible.\nMicrodissection of embryonic forebrain regions",
    "Timing: 1–2 h depending on litter size, number of regions being dissected, etc.\nSpecific forebrain regions are dissected out from the embryonic mouse brain. Here we describe how to harvest the MGE, LGE, CGE and cortex from an individual brain. Researchers can harvest the specific brain regions based on their experimental plans. All dissections performed in ice-cold carbogenated ACSF.\nTransfer 1 brain to a new Petri dish with carbogenated ACSF on ice.\nTo harvest specific forebrain regions, remove any midbrain and hindbrain by pinching off any tissue caudal to the cerebral hemispheres (Figure 1[href=https://www.wicell.org#fig1]D).\nNote: If uncertain about embryonic neuroanatomy, please consult a reference atlas15[href=https://www.wicell.org#bib15] or online resources such as the Allen Brain Developing Mouse Brain Atlas[href=https://developingmouse.brain-map.org/static/atlas].\nUsing forceps, pinch between the hemispheres to hemisect the forebrain.\nPosition one hemisphere medial side up and remove any diencephalon tissue medial to the lateral ventricle. The ganglionic eminences (GEs) should be visible through the lateral ventricle (Figure 1[href=https://www.wicell.org#fig1]E).\nGently pinch the dorsal cortex with forceps at 2–3 locations and peel it backwards to further expose the GEs (Figure 1[href=https://www.wicell.org#fig1]F).\nTo remove the MGE, place one prong of the forceps into the posterior portion of the MGE-LGE sulcus and the other prong ventro-caudal to the MGE. Pinch off the MGE to separate it from the CGE (Figure 1[href=https://www.wicell.org#fig1]G).\nContinue separating the MGE from the LGE and septum by gently pinching around the MGE. When fully separated (Figure 1[href=https://www.wicell.org#fig1]H), collect the MGE with either forceps or a pipette and transfer it to a ‘MGE’-labeled 5 mL round bottom tube with carbogenated ACSF on ice.\nNote: After removing MGE, the remaining LGE-CGE structure is symmetric and one can lose track of the orientation. Keep in mind which side of the brain is anterior (LGE) and posterior (CGE).",
    "To cleanly separate LGE from CGE, make two incisions through the LGE-CGE structure to roughly split the structure into thirds (Figure 1[href=https://www.wicell.org#fig1]I), with the anterior third being the LGE, the posterior third being the CGE, and the middle third being the LGE-CGE boundary region.\nUsing curved micro forceps, place the prongs dorsal and ventral to the LGE, then pinch off the LGE and transfer to a ‘LGE’-labeled 5 mL round bottom tube with carbogenated ACSF on ice (Figure 1[href=https://www.wicell.org#fig1]J).\nFollowing the same process, remove the CGE and transfer to a ‘CGE-labeled 5-mL round bottom tube with carbogenated ACSF on ice.\nCritical: Refrain from placing the forceps too deep when harvesting the LGE and CGE, as this will increase the likelihood of removing lateral cortex along with the LGE and/or CGE and contaminating the sample with glutamatergic cortical cells.\nRemove a chunk of the cortex (e.g., somatosensory) and transfer to a ‘Cortex’-labeled 5 mL round bottom tube with carbogenated ACSF on ice (Figure 1[href=https://www.wicell.org#fig1]J).\nRepeat steps 12–19 for the other hemisphere, noting that the anterior and posterior positions are flipped.\nRepeat steps 9–20 for all embryonic mouse brains.\nOptional: If harvesting nuclei, collected tissue can be transferred directly to a 1.5 mL conical tube, flash frozen on dry ice, and stored at −80°C. This allows for collection and storage of tissue from multiple animals for future processing. We do not recommend freezing tissue when collecting cells as cell membranes will fracture without using cryopreservation media.\nNote: If generating single-cell suspensions, prepare the Pronase Solution and Cell Reconstitution Solution at this point, after dissecting all embryonic brains.\nAdult mouse brain preparation – Brain sections\nTiming: ∼20–30 min/brain for brain matrix, ∼30–45 min/brain for vibratome\nHarvesting specific regions from the adult mouse brain by generating brain slices.",
    "P21 and older mice are deeply anesthetized with Euthasol (270 mg/kg, 50 μL/30 g mouse, intraperitoneal (IP) injection). After confirming no response to painful toe pinch stimuli, decapitate mouse.\nPeel skin forward and use forceps to pinch and remove skull starting from posterior end. When brain is fully exposed, remove and place into Petri dish with carbogenated NMDG High Mg2+ Solution on ice.\nTo generate brain sections using brain matrix:\nPlace brain in a pre-chilled stainless steel 0.5 mm mouse brain matrix on ice (or similar matrix based on desired orientation and tissue thickness).\nFirmly depress razor blades through all slots encompassing desired brain regions (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2273-Fig2.jpg\nFigure 2. Adult mouse brain dissection\n(A and B) Adult mouse brain in matrix with razor blades for coronal brain slices.\n(C and D) Vibratome setup to generate coronal brain slices.\n(E and F) Whole mount preparation to remove intact brain regions (e.g., hippocampus (Hippo), striatum (Str) and cortex (Ctx)).\nCarefully remove razorblades, noting that tissue often sticks to one of the blades. Transfer desired slices to a Petri dish with carbogenated NMDG Activity-blocking Solution on ice (Figure 2[href=https://www.wicell.org#fig2]B).\nTo generate brain sections using vibratome:\nIf desired, remove excess tissue from anterior or posterior brain to minimize cutting through unneeded tissue.\nGlue brain(s) to vibratome plate and allow glue to dry for 30–60 s. Then transfer plate into the vibratome chamber surrounded by ice and filled with NMDG High Mg2+ Solution that can be continuously carbogenated (Figure 2[href=https://www.wicell.org#fig2]C).\nCut 300–400 μm sections and transfer desired sections to a Petri dish with carbogenated NMDG Activity-blocking Solution (Figure 2[href=https://www.wicell.org#fig2]D).\nUse forceps to remove desired regions (striatum, cortex, hippocampus, etc.) from individual brain slices and transfer to properly labeled 5 mL round bottom tube or Petri dish.",
    "Optional: If using a transgenic fluorescent reporter mouse line, dissecting desired regions can be done under a fluorescent dissecting scope to harvest fluorescent brain region/cells of interest.\nOptional: If harvesting nuclei, tissue can be directly added to a 1.5 mL conical tube, flash frozen on dry ice, and stored at −80°C. This allows for collection and storage of tissue from multiple animals for future processing. We do not recommend freezing tissue when collecting cells as cell membranes will fracture without using cryopreservation media.\nAdult mouse brain preparation – Whole mount\nTiming: ∼10 min/brain, depending on number of brain regions being collected\nHarvesting specific regions from the adult mouse brain by removing whole intact structures.\nFollow steps 22 and 23 above to remove brains from juvenile/adult mice.\nPlace brain ventral side down in a Sylgard-coated petri dish containing NMDG High Mg2+ Solution and insert pins through cerebellum and anterior forebrain.\nUse curved forceps to peel cortex antero-lateral and lay flat onto petri dish to expose underlying hippocampus and ventral structures (Figure 2[href=https://www.wicell.org#fig2]E).\nIf collecting cortex and/or hippocampus, remove these structure and place into petri dish containing NMDG Activity-blocking Solution on ice (Figure 2[href=https://www.wicell.org#fig2]F).\nFor striatum and other ventral brain structures, scrape away unwanted tissue, remove desired structure and transfer to petri dish containing NMDG Activity-blocking Solution on ice (Figure 2[href=https://www.wicell.org#fig2]F).\nOptional: If using a transgenic fluorescent reporter mouse line, this dissection can be done under a fluorescent dissecting scope to harvest fluorescent brain region/cells of interest.",
    "Optional: If harvesting nuclei, tissue can be directly added to a 1.5 mL conical tube, flash frozen on dry ice, and stored at −80°C. This allows for collection and storage of tissue from multiple animals for future processing. We do not recommend freezing tissue when collecting cells as cell membranes will fracture without using cryopreservation media.\nGeneration of single-cell suspensions from embryonic brain tissue\nTiming: ∼45 min, depending on number of samples\nGeneration of single-cell suspensions from collected embryonic mouse brain regions.\nAfter collecting all tissue, remove ACSF from the 5 mL tube and replace with 1 mL of Pronase solution. Incubate samples at 20°C–22°C for 15 min, gently flicking the tube 1–2 times during incubation to mix the tissue.\nCarefully remove the Pronase solution without touching the intact tissue samples at the bottom of the tube and add 1–2 mL of Cell Reconstitution solution to each tube.\nMechanically dissociate tissue by carefully triturating samples with fire-polished glass pipettes, starting with 10–20 triturations with a large bore opening followed by 10–20 triturations with a smaller bore opening (Figure 3[href=https://www.wicell.org#fig3]A). Repeat trituration for all samples, using different pipettes for each sample.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2273-Fig3.jpg\nFigure 3. Preparing single-cell or nuclei solutions\n(A) Trituration of tissue with Pasteur pipette to generate single-cell suspensions.\n(B) Dounce homogenizer used to generate single-nuclei suspensions.\n(C and D) Cleanup of adult mouse tissue for single-nuclei suspension using Nuclei Pure Prep Isolation Kit, before (C) and after (D) centrifugation. Note the debris layer at the interface (arrowhead) while the nuclei precipitate at the bottom (arrow) after centrifugation.\nCritical: Do not introduce bubbles while triturating as this will damage cell membranes, leading to increased cell death and debris in the suspension.",
    "Optional: If performing flow cytometry to harvest fluorescent cells, add DAPI (1 μL) and DRAQ5 (5 μM) per mL prior to straining cells. Then process cells on a flow cytometer and collect the DRA5+/DAPI- live cell population.\nUse Pasteur pipette to transfer cell suspension through a pre-wetted Falcon 5 mL Tube w/ 35 μm Cell Strainer to remove debris, cell clumps, etc.\nIf not sorting cell suspension, transfer cells to a 2.0 mL low-bind tube and centrifuge at 500 g for 5 min at 4°C.\nRemove supernatant. Cells can be reconstituted at desired volume in Cell Reconstitution solution depending on downstream application and counted on a hemocytometer or an automated cell counting machine.\nGeneration of single-cell suspensions from adult brain tissue\nTiming: ∼90 min\nGeneration of single-cell suspensions from adult mouse brain regions.\nCell dissociations are performed with Worthington’s Papain Dissociation System[href=https://www.worthington-biochem.com/PDS/] following manufacturer’s instructions with minor modifications described below.\nCritical: Maximum size of tissue for 1 reaction is 100 mg. We observed significant decrease in efficiency with tissue weighing more than 100 mg. If tissue weighs more than 100 mg, split tissue into multiple pieces and process in separate reactions, combining samples at the end.\nSupplement the Papain dissociation solution with 1 μM TTX, 100 μM APV and 20 μM Actinomycin-D to minimize cell activity during tissue incubation.\nIncubate tissue for 60 min in the Papain solution at 37°C with constant agitation.\nTriturate tissue with fire-polished large and small bore Pasteur pipettes as described in step 34 above.\nCritical: Do not introduce bubbles while triturating as this will damage cell membranes, leading to increased cell death and debris in the suspension.\nCentrifuge cells at 500 g for 5 min and discard supernatant.",
    "Perform the density gradient as described in manufacturer’s instructions, then remove the supernatant and debris, with the dissociated cells pelleted at the bottom of the tube.\nReconstitute cells in desired volume of NMDG Activity-blocking Solution.\nDue to increased debris in adult brains (e.g., myelin and severed neurites), we strongly recommend sorting the suspension to obtain a clean single-nuclei suspension.\nResuspend cell pellet in a 50:50 mix of carbogenated Earle’s Balanced Salt Solutions (EBSS, from Papain kit):NMDG Activity-blocking Solution supplemented with 10% Fetal Bovine Serum (FBS), 10 U/mL DNase, DAPI (1 μL) and DRAQ5 (5 μL).\nPass suspension through a pre-wetted 35 μm filter on a 5 mL round bottom tube and proceed with FACS, collecting DRAQ5+/DAPI- live cells.\nGeneration of single-nuclei suspensions from embryonic and adult brain tissue\nTiming: ∼30–45 min, depending on number of samples\nGeneration of single-nuclei suspensions from embryonic and adult brain tissue.\nCritical: For analysis of mRNA-only (e.g., RNA-seq), use the ‘RNA-only’ solutions. For analysis of DNA-only (e.g., ATAC-seq, ChIP-seq, CUT&Tag, etc.), use the ‘DNA-only’ solutions. For analysis of mRNA and DNA (e.g., 10x Genomics Multiome), use the ‘Multiome’ solutions.\nCritical: If analysis includes chromatin accessibility (e.g., ATAC-seq or Multiome), total time from Douncing samples (step 46) to final nuclei dilution (step 63) should take no more than 60 min. Sample preparation intervals greater that 60 min produce a noticeable decrease in library quality.\nAdd 1 mL of Nuclei Lysis Buffer (RNA-only, DNA-only or Multiome depending on application) to a pre-chilled Dounce homogenizer on ice, 1 Dounce per tissue region/sample.\nIf using fresh tissue harvested as described above, transfer tissue pieces to Dounce.\nIf using frozen tissue stored at −80°C, thaw for 30–60 s at 20°C–22°C and transfer tissue to Dounce.",
    "Critical: Maximum size of tissue for 1 reaction is 100 mg. We observed significant decrease in efficiency with tissue weighing more than 100 mg. If tissue weighs more than 100 mg, split tissue into multiple Dounces and run as separate reactions, combining sample replicates at the end.\nSlowly dounce ∼10 times with A pestle and another ∼10 times with B pestle (1–2 s per up- or down-stroke), trying to minimize introduction of bubbles into the suspension (Figure 3[href=https://www.wicell.org#fig3]B).\nPlace a 40 μm filter into a pre-chilled 50 mL Falcon tube on ice and wet with 1 mL Nuclei Wash (RNA-only, DNA-only or Multiome depending on application).\nTransfer entire 1 mL lysed nuclei suspension through the pre-wetted filter.\nRinse the Dounce tube with 1 mL Nuclei Wash Buffer (RNA-only, DNA-only or Multiome depending on application). Transfer rinse solution through the pre-wetted filter.\nDivide the nuclei suspension evenly (∼1.5 mL) between 2 pre-chilled 2 mL LoBind tubes.\nSpin the tubes at 500 g for 5 min 4°C and remove supernatant.\nAdd 1 mL Nuclei Wash Buffer (RNA-only, DNA-only or Multiome depending on application) to each tube and gently triturate 3–5 times to dissociate pellet.\nRepeat steps 52 and 53 for a total of 2 nuclei washes.\nSpin the tubes at 500 g for 5 min 4°C and remove supernatant.\nAdd Nuclei Resuspension Buffer.\nFor single-nuclei 10x Genomics RNA-seq experiments: Add 250 μL of RNA-only Nuclei Resuspension Buffer (if analyzing mRNA only) or DNA-only Nuclei Wash Buffer (if analyzing DNA) or Multiome Nuclei Wash Buffer (if analyzing mRNA + DNA) to each tube, triturate and combine replicates into a single micro tube making the final volume 500 μL.\nFor low-input or bulk chromatin assays (e.g., CUT&Tag, ChIP-seq, etc.), add appropriate buffer and continue with assay-specific protocols.",
    "Note: Depending on tissue quantify and pellet size, it might be preferrable to use less than 250 μL Nuclei Resuspension or Nuclei Wash buffer per tube to resuspend the pellet after the last spin.\nTo remove debris for downstream applications, we strongly recommend sorting the nuclei suspensions.\nAdd 1 μL DAPI (or DRAQ5) to nuclei suspension and filter suspension through a pre-wetted 35 μm filter. Proceed to cell sorter, collecting DAPI+ nuclei (or fluorescent nuclei if using a reporter mouse line).\nNote: If performing 10x Genomics ATAC-seq or Multiome reactions, we recommend collecting > 50,000 nuclei if possible, as this will provide sufficient nuclei for these reactions after loss of nuclei from spinning and reconstitution.\nOptional: Some samples from adult tissue with high myelin content (e.g., adult spinal cord) contain a significant amount of debris and harvesting nuclei via FACS was extremely inefficient. In these instances, we recommend performing the following optional additional cleanup procedure using the Nuclei Pure Prep Isolation Kit[href=https://www.sigmaaldrich.com/deepweb/assets/sigmaaldrich/product/documents/210/075/nuc201bul.pdf] prior to FACS to remove excess myelin. Steps 58–61 are optional.\nCritical: Sucrose Gradient clean-up has only been tested for analyzing mRNA alone. It has NOT been validated for analyzing DNA alone or Multiome experiments and is not expected to work well in such cases. If debris or myelin removal is needed for DNA only or Multiome (mRNA + DNA) samples, we strongly recommend purifying the nuclei suspensions via flow cytometry.\nAdd 900 μL of 1.8 M Nuclei PURE Sucrose Cushion Solution to 2 mL LoBind tube and gently load nuclei suspension on top of Sucrose Cushion Solution (Figure 3[href=https://www.wicell.org#fig3]C).\nNote: Nuclei from different cell types may have different densities. Thus, different sucrose concentrations may be used by diluting 2 M Nuclei PURE Sucrose Cushion Solution with Nuclei PURE Sucrose Cushion Buffer.",
    "Critical: Do not mix nuclei suspension and Sucrose Cushion Solution, as this will lead to suboptimal cleanup and loss of nuclei.\nCentrifuge the sucrose gradient at 13,000 g for 45 min at 4°C (Figure 3[href=https://www.wicell.org#fig3]D).\nCarefully remove supernatant leaving ∼50 μL of bottom layer in each tube and add 450 μL RNA-only Nuclei Resuspension Buffer (if analyzing mRNA only) or DNA Nuclei Wash Buffer (if analyzing DNA) and triturate to resuspend the pellet.\nAdd DAPI (or DRAQ5) to the nuclei suspension and triturate, then pass suspension through a pre-wetted 35 μm filter on a 5 mL round bottom tube and proceed to flow cytometry.\nFor low-input or bulk chromatin assays (e.g., CUT&Tag, ChIP-seq, etc.), collect nuclei in appropriate buffer and continue with assay-specific protocols.\nNote: If performing 10x Genomics ATAC-seq or Multiome reactions, we recommend collecting > 50,000 nuclei if possible, as this will provide sufficient nuclei for these reactions after loss of nuclei from spinning and reconstitution.\nPreparation of samples for single-cell/nuclei sequencing with 10x genomics kits\nTiming: ∼10–20 min depending on number of samples\nBased on 10x Genomics recommendations and our own experience, we aim for ∼15,000 cells/nuclei per 10× reaction to minimize doublets and maximize recovery, which typically results in 5,000–8,000 good quality cells/nuclei per reaction. The current 10× RNA-seq protocol allows for cells in 43.2 μL whereas the ATAC-seq and Multiome reactions require nuclei in 5 μL, so we describe our procedure for both types of sequencing reactions. Please consult the 10x Genomics protocol for your specific assay for more details.\nFor 10x Genomics RNA-seq experiments:\nWith FACS:",
    "Collect ∼15,000 cells or nuclei in a 1.5 mL LoBind collection tube containing 10 μL RNA-only Nuclei Resuspension Buffer and use 43.2 μL of this cell/nuclei suspension to proceed with the 10x Genomics RNA-seq reaction based on manufacturer’s instructions.\nNote: This process results in a final volume of ∼45 μL with the Sony SH800 cell sorter (volume may vary with other sorters), thus nearly all this cell/nuclei suspension can be applied directly to the 10x Genomics RNA-seq kit with no need to spin the cells/nuclei suspension, thus eliminating excess loss of cells/nuclei after sorting.\nWithout FACS:\nCount the number of cells/nuclei on a hemocytometer or automated cell sorter to determine the concentration.\nPrepare cell/nuclei suspension at a concentration of 1,000 cells/nuclei per μL and use 15 μL of this cell/nuclei suspension to proceed with the 10x Genomics RNA-seq reaction based on manufacturer’s instructions.\nFor 10x Genomics ATAC-seq or Multiome sequencing experiments:\nFor both sorted and non-sorted nuclei, centrifuge nuclei suspensions at 500 g for 10 min at 4°C in a swinging-bucket rotor (since high nuclei densities and small solution volumes are desired, we recommend a swinging-bucker rotor at this step to ensure nuclei pellet collects at the bottom of the tube).\nCarefully remove the supernatant, leaving < 20 μL in the tube. Resuspend nuclei in this leftover solution\nCount the number of nuclei on a hemocytometer or automated cell sorter to determine the concentration. (e.g., we use 2 μL cell suspension + 8 μL PBS + 10 μL Trypan Blue solution, then adjust calculations accordingly).\nDilute sample to a concentration of 3,000 nuclei/μL using DNA Diluted Nuclei Buffer (ATAC-seq) or Multiome Diluted Nuclei Buffer (Multiome) and use 5 μL to proceed with the corresponding 10x Genomics ATAC-seq or Multiome reaction based on manufacturer’s instructions."
  ],
  "subjectAreas": [
    "Rnaseq",
    "Flow Cytometry",
    "Neuroscience",
    "Developmental Biology",
    "Cell Differentiation",
    "Sequencing",
    "Single Cell"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}