{
  "id": 19493,
  "origin_website": "Jove",
  "title": "Microtransplantation of Synaptic Membranes to Reactivate Human Synaptic Receptors for Functional Studies",
  "procedures": [
    "All research is performed in compliance with institutional guidelines and approved by the institutional Animal Care and Use Committee of the University of California Irvine (IACUC-1998-1388) and the University of Texas Medical Branch (IACUC-1803024). Temporal cortex from a non-Alzheimer's disease (AD) brain (female, 74 years old, postmortem interval 2.8 h) and an AD-brain (female, 74 years old, postmortem interval 4.5 h) were provided by the University of California Irvine Alzheimer's disease research center (UCI-ADRC). Informed consent for brain donation was obtained by UCI-ADRC.\nNOTE: Unfixed human brain tissue should be treated as a source of blood borne pathogens (BBP). Accordingly, BBP training is needed prior to start experiments. This protocol is performed in a biosafety level 2 (BSL2) laboratory under BSL2 requirements. Guidelines and precautions within the laboratory include: no food or drinks allowed in the laboratory, good laboratory practices must be followed, personal protection equipment (gloves, gown, no open-toed shoes) is required, and the door must be closed at all times.\n1. Xenopus oocyte microinjection preparation\nTo make injection needles, pull 3.5 inches borosilicate tubes using a micropipette puller. Once the microinjection needles are pulled, use a microscope and a razor blade to cut off enough of the tip of the needle so that microinjection can be performed (usually between 2-3 mm).\n\tNOTE: The length of the needle's tip to cut can vary.\nPrepare 1x Barth's solution by adding 200 mL of Barth's Stock Solution (5x) to 800 mL of distilled water. Fill a 24-well, flat bottom tissue culture plate with 18 °C 1x Barth's solution.",
    "Prepare 5x Barth's stock solution as follows. In 1 L of distilled water, add 25.71 g of NaCl (sodium chloride), 0.372 g of KCl (potassium chloride), 0.301 g of CaCl2 (calcium dichloride), 0.389 g of Ca(NO3)2(4H2O) (calcium nitrate tetrahydrate), 1.01 g of MgSO4(7H2O) (magnesium sulfate heptahydrate), 1.008 g of NaHCO3 (sodium bicarbonate), and 11.91 g HEPES (4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid).\nIsolate Xenopus oocytes using the protocols described in18,19 and using 2x magnified stereoscope, selecting healthy looking, stage V-VI oocytes. Place about 10 oocytes per well and use one of the wells to house non-injected oocytes to be used as control cells when performing recordings.\nRetrieve a small Petri dish, 1 cm tall and 6 cm in diameter, and place Nylon mesh inside so that it covers the bottom of the dish. Then, pour 15 mL of 1x Barth's solution to be used for performing microinjections of the oocytes.\nPlace a nanoinjector along the midline of the microscope platform. Turn the magnet to the Off position and slowly move the nanoinjector to the desired position while supporting it carefully. When the nanoinjector is properly positioned, turn the magnet back to the fully On position and make sure that it is secure.\nFor a sample size of 50.6 nL, use the following settings on the side of the nanoinjector: 1 is D (down), 2 is D, 3 is U (up), 4 is D, and 5 is U. Position a piece of self-sealing thermoplastic, or microcentrifuge tube cap, on the microscope stand, aligning it with the trajectory of the nanoinjector.\n\tNOTE: 50 nL is near the maximum amount of injected material that the cytoplasm can withstand21.",
    "Fill up an insulin syringe about half its volume with mineral oil (about 0.5 mL/cc). Using this syringe, fill the microinjection needle with mineral oil. Ensure that a visible bead of oil is seen at the tip of the needle.\nExpose the nanoinjector plunger to a minimum of 1-2 cm. Do this by holding down the EMPTY button until the plunger is visible at desired length. Once the plunger is exposed, slowly and carefully place the mineral oil filled microinjection glass needle onto the nanoinjector plunger, and make sure that it fits well through the black resistance O-ring and stops at the white resistance ring. Ensure not to bend the nanoinjector plunger in the process.\nOnce the microinjection glass needle is secure and in place, press EMPTY to void any potential air bubbles. Gently, with a paper tissue, clean off the excess mineral oil.\n2. Loading the sample\nPrepare synaptosomal enriched preparations (samples) from the human brain region of interest as described in10,11,12,13,14,15, and store them in aliquots of about 5 μL at -80 °C until the moment of injection.\nBefore injection, transfer the aliquot to wet ice and keep it on ice at all times except for sonication and retrieval. The number and types of samples will be determined by the experimental design.\nSonicate the selected samples 3x in a bath with floating wet ice to avoid warming up of the sample. Use 5 s cycles each time, waiting 1 min on wet ice in between cycles.\nPlace 1 μL of sample onto the thermoplastic. Make an indention in the surface, if needed, before sample placement to prevent movement of the sample.",
    "Use the knobs of the manipulator holding the nanoinjector to position the needle and move it toward the sample to be filled. Once the needle tip is in the sample, press and hold the FILL button until enough sample is taken up. About 0.5 μL is required for 10 oocytes. Using the knobs, move the nanoinjector's needle back to the highest position.\n3. Injecting the oocytes\nNOTE: Standardized rat cortex synaptosomal membranes are also injected in all experiments into a set of oocytes to measure changes in fusion capacity between different batches of oocytes.\nPlace selected oocytes onto the small Petri dish that has the fitted nylon mesh and Barth's solution (about 10 oocytes). Arrange oocytes so that they are not on top of each other; this will be helpful during the injection process.\nUsing the knobs on the manipulator holding the nanoinjector, move the needle toward the oocytes. Once the needle is submerged in the Barth's solution, use the foot pedal for the nanoinjector to make sure that the microinjection needle is releasing sample. If the sample is being released it will be visible from the microscope view.\nOnce it is confidently established that the sample is being released, move on to microinjecting the oocyte. If sample is not being released, repeat the process of filling the needle.\nPenetrate the oocyte just underneath the surface with the needle, no deeper, and use the foot pedal to inject the sample. The foot pedal will make a beep sound when the sample is released. Wait about 2-3 s. If the injection was successful, the cell will expand. Once this happens, use the knobs on the manipulator to exit the cell.",
    "NOTE: Fusion of membranes in the oocyte is a polarized process; therefore, the oocyte should be injected in the animal side of the cell, preferably above the equator, with the angle of the needle toward the animal side to maximize membrane fusion.\nMove the Petri dish so that the next oocyte is aligned with the needle and repeat the process until all oocytes in the dish have been injected. Repeat this process until the desired number of oocytes has been injected. Make sure that one well of oocytes is left non-injected to be used as control.\nOnce all oocytes have been injected, retract the nanoinjector to its original position and remove the needle.\n4. Recording of ion currents using a two electrode voltage clamp\nTo make two electrode voltage clamp (TEVC) electrode needles, pull 15 cm long fire polished borosilicate glass tubes by using the micropipette puller. Once pulling is complete, fill with 3 M KCl using long capillary needles, or alternatively, submerge and boil the needles in 3 M KCl solution for 15 min under a continuous vacuum. The high temperature helps in the filling of the electrodes and removal of air bubbles.\n\t\nPrepare a 3 M KCl electrode fill solution by using KCl in the crystalline form and deionized water, and following these steps carefully so that reference potential of electrodes is not changed. Dry the KCl carefully in an oven for 2-3 h. Using an analytical balance, carefully weigh 223.68 g of KCl. Transfer the KCl to a 1 L glass bottle. Use this solution to chlorinate silver electrode wires.\n\t\tNOTE: For pulling glass electrodes, the pipette cookbook can be downloaded here: https://www.sutter.com/PDFs/cookbook.pdf.",
    "Turn on all equipment used for the recording of ion currents: main systems, solution valves, microscope light, valve systems, oocyte clamp, and vacuum system. Turn on the desktop computer, log into WinEDR V3.9.1., and make sure that the program is running and that the setup values are correct as follows: record to disk, set recording duration, and clear out the simulator option.\n\t\nProvide the following initial setup values for the amplifier: for voltage electrode (Vm) section, turn off the negative capacity compensation (-C); for bath electrodes (Im) section, set the gain selector switch (range from 0.1 to 10) at 10, and the three-position toggle switch which selects the gain multiplier (x0.1, x1.0 and x10), at x1.0. The LED lights will indicate the gain multiplier selection; for clamp section, turn off the clamp mode selector, set the DC gain control to IN, and the gain control full-bandwidth open-loop (range 0 to 2000) to around 1200; for commands, set at 40mV and set the hold controls negative and scale multiplier to be in x2; for current electrode, use the Ve offset to establish a zero reference before impaling the oocyte.\nTo record, open the WinEDR V3.9.1 software, go to the top menu, and select File > Open New File. Create your own folder and save the file.\nNext, in the main menu select Record > Record to Disk. When the two electrodes are inside the ooctyte, turn on the ringer in the VC-8 valve controller, and turn the clamp to Slow in the OC-725C amplifier. Then, go back to the WinEDR software and select Record at the top left of the screen.",
    "In the mark chart at the bottom left, write down your initial membrane potential and press Enter. As the experiment keeps going, you can write down the name of the drugs being used. Once the experiment is over, select Stop at the top left of the screen.\n\t\tNOTE: We use WinEDR or WinWCP software to perform TEVC because these are free and well suited for experiments, but any other software that is available can be used.\nMake up all of the drug solutions needed to perform the experiment (e.g., GABA, Kainate) and confirm that the solution valves are working properly by switching them on and off and observing the displacement of the pinch valves.\nFill the tubes by pouring the corresponding solution on the syringe receptacle connected to the tube and label the valve controller to correlate with the solution tubes. Ensure that the flow of solution is steady, there are no bubbles and that the vacuum system is working properly.\nSet up the microscope and recording chamber area. Place the agar bridges (see below) in the respective circular holes behind the recording chamber (distal from handling area), connecting the wells for the electrodes used as ground reference and the recording chamber. Add Ringer's working solution (1x) to the recording chamber and the ground reference electrode wells.\n\t\nAgar bridges are U-shaped borosilicate tubes, 2-3 cm long, filled with 3% agar in Ringer's solution. Make U-shaped tubes by cutting 15 cm long tubes, bending them on the open flame, and then filling them with hot 3% agar using an insulin syringe. Store filled agar bridges in Ringer's solution in the fridge until use.",
    "Make 20x Ringer's stock solution as follows: In 1 L of distilled water, add 134.4 g of NaCl, 2.982 g of KCl, 5.29 g of CaCl2, and 23.83 g of HEPES (4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid). For 1x Ringer's working solution, in a volumetric flask, add 200 mL of Ringer's stock solution (20x) to 3,800 mL of distilled water.\nPrepare chlorinated silver electrodes prior to each experiment by electrolysis by placing silver wires in 3 M KCl solution and connecting the silver electrode to the positive terminal of a 9 V battery. After about 3 min a solid brown layer of AgCl is deposited into the electrode. Place the chlorinated silver electrode wires into the electrode housing.\n\tNOTE: Ground reference and recording chlorinated electrodes are silver/silver chloride (Ag/AgCl) electrodes.\nRemove the borosilicate needles from the KCl solution. Use a syringe to extract a small amount of KCl solution from the open end of the electrode needle and replace the KCl solution with mineral oil; this will avoid water evaporation and changes in KCl concentration within the needle. Slide the glass needle over the chlorinated silver electrode wire and tighten them in place.\nUsing the right and left manipulators holding the electrodes, guide the electrode needles into the recording chamber that is filled with Ringer's Solution.\nCheck the resistance of each electrode by zeroing out the Vm and Ve offset knobs and then pressing the Electrode Test buttons. The resistance should be between 0.5-3 MΩ (directly read as 5-30 mV in the screen). If the resistance is out of the range, replace using new microelectrodes.",
    "Fill the recording chamber with fresh Ringer's solution. Using a glass pipette, place a non-injected or a microtransplanted oocyte in the center of the recording chamber. Ensure that the oocyte is clearly visible under the microscope, with animal side up (see NOTE in step 3.4).\nGuide the electrode into the Ringer's solution until they touch the oocyte membrane. Gently pierce the oocyte membrane in the animal side (see NOTE in step 3.4) with both electrodes and record the resting membrane potential. Turn on the Ringer's solution flow.\nUsing the oocyte clamp amplifier, change the mode to Voltage Clamp and set the holding voltage of -80 mV. The current on the monitor should be negative, usually between 0 and 0.4 microamperes.\nCreate a new file to save the recording as File > New > Save the Recording on the software. Start recording, press Record > Record to Disk. Add relevant information to the file by using the mark box dialog (test name, drugs used, etc.).\nApply agonists (e.g., GABA, glutamate, or kainate) for chemical stimulation by opening the valves and perfusing them into the recording chamber for 15 s. Usually, use a gain of 10x to plot the maximum number of points and reconstruct the response. If currents are very small, increase the amplification, or gain, in order for them to be evaluated and visible. Always make note of these changes.\n\tNOTE: The duration of the perfusion depends on the experimental paradigm. If the major goal is to measure maximum amplitude, 15 s will be enough to reach the peak for GABA or the plateau for kainate.",
    "Always monitor solution levels. Ringer's solution will need to be refilled frequently as it is used between all solution uses. Once recording is completed, turn the voltage clamp to the OFF position and turn the Ringer's solution valve off. Remove the oocyte. Stop recording and save the file. Repeat these steps for all the injected oocytes.\n5. Analyzing TEVC recordings\nSave a copy of the recordings to a USB drive. From there, open the desired file to be analyzed. In the file that opens, the recording can be viewed, marked, and measured. Most common analysis includes measuring of maximum amplitude, activation time, desensitization, and rundown of repetitive applications.\nMeasure the AMPA maximum response and the GABA peak response. To acquire these measurements, first establish a zero level or baseline by finding the red line with the cursor and dragging it to the current generated by Ringer application or baseline.\nOnce the zero level is established, determine the response measurements by using the mouse to drag the green, vertical readout cursor to the desired part of the graph tracer. If wanted, export the traces to be analyzed in any other preferred software\n\tNOTE: If the zero level is unable to be defined or there is too much noise indicated on the tracer, export the WinEDR file to an offline analytical software, that will allow for modifications to provide a level baseline and the addition of filters in order to reduce noise.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}