{
  "id": 4461,
  "origin_website": "Bio",
  "title": "SGR-based Reporter to Assay Plant Transcription Factor-promoter Interactions",
  "procedures": [
    "Cloning of transcription factor of interest into SGR reporter vector   Amplify promoter fragments (1-2 kb) from plant genomic DNA by high-fidelity PCR, and clone them into Gateway entry vector (pDONR221 or pDONR207) using BP reaction according to manufacturer’s instruction. This will generate the entry vector containing the promoter fragments.   Transfer the promoter fragments into the destination vector SPDK2388 via LR reaction. The LR reaction should be set up as below: 100 ng   entry vector containing promoters 100 ng   destination vector SPDK2388 2 µl    LR enzyme buffer 2 µl    LR enzyme ddH2O to 10 µl Incubate at 25 °C overnight. Add 1 µl Proteinase K, incubate at 37 °C for 10 min. Transform the reaction mix into chemical competent cells of E. coli DH10B or similar cells, and select the transformants on 50 µg/ml spectinomycin (spectinomycin50) containing LB plates.      Prepare plants and Agrobacterium strains   Grow N. benthamiana plants with 12 h day light, 22 °C in the growth chamber. At 4 to 5 weeks, the plants should have three to four large healthy leaves suitable for infiltration.   Transform separately the destination vector SPDK2388 with the TF of interest and the control into A. tumefaciens GV2260 by using chemical or electro competent cells. Typically, 200-500 ng plasmids and 50 µl competent cells are used for the transformation. Plate all the transformed cells and select the transformants on spectinomycin100, streptomycin100, Rifampicin25, and Carbenicillin50 (SSRC) containing LB plates. More than 100 transformants should be expected.      Evaluate background expression of the promoter::SGR reporter constructs in N. benthamiana leaves   Grow Agrobacterium GV2260 strains harboring the promoter::SGR construct overnight in ~20 ml LB media with SSRC.   Spin down the Agrobacterium culture at 3,000 x g for 10 min, discard the supernatant, and suspend in infiltration media. Adjust the concentration of the culture to a series of OD600.",
    "For example, 0.05, 0.1, 0.3, and 0.6 OD. Incubate the culture at the room temperature for 3 h.   Infiltrate N. benthamiana leaves with different concentration of Agrobacterium culture prepared in step C2 above. Make a small cut on the abaxial side of the leaves, use 1 ml syringes without needle to infiltrate Agrobacterium culture into the leaves. The culture should cover a spot of ~1 cm in diameter (see Figure 1). Infiltrate 1-2 spots for each OD concentration and infiltrate all samples with different ODs onto a single leaf. Repeat the infiltration onto a second leaf within the same plant.    Keep infiltrated plants for 48 or 72 h in the same growth chamber and check the spots for signs of yellowing. Choose the highest OD concentration that shows no or slight yellowing for the following experiment.    imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140817/20140817060049_3801.jpg Figure 1. SGR reporter-based transcription factors and promoter interaction assay in Nicotiana benthamiana. The SUR1 promoter::SGR reporter construct was co-infiltrated with different MYB TFs (spots 1 to 7) or with a negative control Actin (spot 0). Only two MYBs (spot 1 and 2) showed severe yellowing signs indicating that these two MYBs activate SUR1 promoter.      Assay for TF-promoter interaction   Grow separately Agrobacterium GV2260 strains harboring the promoter::SGR construct, TF construct, and actin control overnight in LB liquid media with SSRC. Note: We have constructed an ATEC library in LIC6 binary vector for over-expression of 15,000 Arabidopsis genes, which include more than 700 transcription factors. All these clones are deposited to and can be ordered from ABRC. In ABRC, the ATEC clones are names as “DKL” plus AGI numbers. See Reference 3 for more details.    Spin down the cultures min and re-suspend them in infiltration media. Adjust the OD of the reporter culture to the concentration determined in step C4.",
    "Adjust the OD of TF and actin control to 1.0.   Mix Agrobacterium culture with the reporter and the TFs or control with equal volume (~ 1 ml each). Incubate at room temperature for 3 h.   Infiltrate N. benthamiana leaves with the mixed cultures from above onto 1-2 spots of ~1 cm onto the same leaf. Control and treatment samples should be present on the same leaf to overcome leaf-to-leaf variability.    Keep infiltrated plants for 48 to 96 h in the growth chamber. Record signs of yellowing of each spot at 24, 48, 72, and 96 h post infiltrations. The severity of yellowing indicates the strength of reporter gene expression by the corresponding TF. The spots containing TFs should be compared to the control spots to assess specificity of TF-promoter interactions. See example shown in Figure 1. Photograph the leaves to document the results.   Further validation of the observed results could be performed using luciferase-based reporter assay as described in Ma et al. (2013)."
  ],
  "subjectAreas": [
    "Plant Science",
    "Systems Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}