{
  "id": 10326,
  "origin_website": "Jove",
  "title": "Scalable Generation of Mature Cerebellar Organoids from Human Pluripotent Stem Cells and Characterization by Immunostaining",
  "procedures": [
    "1. Passaging and maintenance of human iPSCs in monolayer culture\nPreparation of plates\n\t\nThaw the basement membrane matrix (see Table of Materials) stock at 4 °C and prepare 60 μL aliquots. Freeze the aliquots at -20 °C.\nTo coat the wells of a 6 well plate, thaw one aliquot of the basement membrane matrix on ice. Once thawed add 60 µL to 6 mL of DMEM-F12. Gently resuspend by pipetting up and down.\nAdd 1 mL of diluted basement membrane matrix solution to each well of a 6 well plate and incubate at RT for at least 1 h before passaging or store at 4 °C for up to 1 week.\nPassaging of iPSC colonies with EDTA\n\t\nMaintain iPSCs in monolayer culture in 6 well plates in the incubator at 37 °C, 95% humidity, and 5% CO2.\n\t\tNOTE: In this protocol, three distinct human iPSC lines were used: F002.1A.1321, human episomal iPSC line (iPSC6.2)22, and commercially obtained iPS-DF6-9-9T.B (see Table of Materials).\nBefore passaging, incubate the stored plates (step 1.1) at room temperature (RT) for 15 min and prepare the mTesR1 medium (Table 1).\nAspirate the solution from the plate using a serological pipette and immediately add 0.5 mL of mTeSR1 medium to each well.\nAspirate the spent medium from the well containing iPSCs and wash once using 1 mL of 0.5 mM EDTA per well.\nAdd 1 mL of 0.5 mM EDTA to each well and incubate at RT for 5 min.\nAspirate EDTA and remove the cells from the wells by gently adding mTeSR1 medium and pipetting the colonies using a P1000 micropipette. Collect the cells in a conical tube.\n\t\tNOTE: Do not pipette cells up and down more than 3x.",
    "Add 1 mL of cell suspension (diluted 1:4) to each well so that each well contains 1.5 mL of medium after the cell suspension is added. Return cells to the incubator at 5% CO2, 37 °C.\nReplace the spent medium daily and passage every 3 days when 75%–80% confluence is achieved.\n2. Seeding of human iPSCs in the bioreactor\nIncubate iPSCs grown as monolayers in mTeSR1 supplemented with 10 µM of ROCK inhibitor Y-27632 (ROCKi). Add 1 mL of supplemented medium to each well from a 6 well tissue culture plate and incubate for 1 h at 37 °C, 95% humidity, and 5% CO2.\n\tNOTE: ROCKi is used to protect dissociated iPSCs from apoptosis23.\nAfter 1 h of incubation, aspirate the spent medium from each well and wash 1x with 1 mL of 1× PBS per well.\nAdd 1 mL of the cell detachment medium (see Table of Materials) to each well of a 6 well plate and incubate at 37 °C for 7 min until cells detach easily from the wells with gentle shaking.\nPipette the cell detachment medium up and down with a P1000 micropipette until the cells detach and dissociate into single cells. Add 2 mL of complete cell culture medium to each well to inactivate enzymatic digestion and pipette the cells gently into a sterile conical tube.\nCentrifuge at 210 × g for 3 min and remove the supernatant.\nResuspend the cell pellet in culture medium (i.e., mTeSR1 supplemented with 10 µM of ROCKi) and count the iPSCs with a hemocytometer using trypan blue dye.\nSeed 15 × 106 single cells in the bioreactor (maximum volume of 100 mL) with 60 mL of mTeSR1 supplemented with 10 µM of ROCKi at a final cell density of 250,000 cells/mL.",
    "Insert the vessel containing the iPSCs in the universal base unit placed in the incubator at 37 °C, 95% humidity, and 5% CO2.\n\tNOTE: The bioreactor stirring is maintained for 24 h by setting the universal base unit control to 27 rpm to promote iPSC aggregation.\n3. Differentiation and maturation of human iPSC-derived aggregates in cerebellar organoids\nDefine the day of single cell seeding as day 0.\nOn day 1, collect 1 mL of the iPSC aggregates sample using a serological pipette. Maintain the bioreactor under agitation as before by placing the universal base unit with the bioreactor containing the aggregates in a sterile flow prior to collecting the sample. Plate the cell suspension in an ultra-low attachment 24 well plate. Check that iPSC-derived aggregates are formed.\nAcquire images with an optical microscope using a total magnification of 40x or 100x to measure aggregate diameter.\nMeasure the area of the aggregates in each image using FIJI software.\n\t\nSelect “Analyze | Set Measurements” from the menu bar and click on “Area” and “OK”.\nSelect “File | Open” from the menu bar to open a stored image file. Select the line selection tool presented in the tool bar and create a straight line over the scale bar presented in the image. Select “Analyze | Set scale” from the menu bar.\nIn “Known distance” add the expanse of the image's scale bar in µm. Define the “Unit of length” as µm. Click on “Global” to maintain the settings and “OK”. Select Oval Selection in the tool bar.\nFor each aggregate delineate the area with the oval tool. Select “Analyze | Measure”. Calculate their diameter based on measured area, considering that aggregates are approximately spherical using\nimgsrc://cloudfront.jove.com/files/ftp_upload/61143/61143equ01.jpg\n\t\twith A as the area of the aggregate.",
    "When the average diameter of the aggregates is 100 µm, replace 80% of the spent medium with fresh mTeSR1 without ROCKi. When aggregates reach 200–250 μm in diameter, replace all the spent medium with gfCDM (Table 1), letting the organoids settle at the bottom of the bioreactor.\n\tNOTE: If the average aggregate diameter exceeds 350 μm do not start the differentiation protocol. Repeat the seeding of single cells. Generally, it takes around 1 day for the aggregate to reach an average diameter of 100 µm.\nInsert the bioreactor containing the aggregates in the universal base unit placed in the incubator at 37 °C, 95% humidity, and 5% CO2.\nDecrease the bioreactor agitation to 25 rpm.\nOn day 2, repeat steps 3.2, 3.3, and 3.4 to evaluate the aggregate diameter. Add 30 μL of FGF2 (final concentration, 50 ng/mL) and 60 μL of SB431542 (final concentration, 10 μM) to 60 mL of gfCDM differentiation medium (Table 1). Replace all spent medium from the bioreactor with the supplemented gfCDM. Repeat step 3.6.\n\tNOTE: SB431542 is crucial to inhibit mesendodermal differentiation, inducing neural differentiation24. FGF2 is used to promote the caudalization of the neuroepithelial tissue25.\nOn day 5, repeat steps 3.2, 3.3, 3.4, and 3.8.\n\tNOTE: Aggregate size should increase during the differentiation protocol. However, the diameter is only critical when the differentiation starts, because this parameter could influence the efficacy of differentiation.\nOn day 7, repeat steps 3.2, 3.3, and 3.4. Dilute FGF2 and SB431542 to 2/3: Add 20 μL of FGF2 and 40 μL of SB431542 to 60 mL of gfCDM differentiation medium. Replace all spent medium from the bioreactor with supplemented gfCDM. Repeat step 3.6 and increase bioreactor agitation to 30 rpm.",
    "On day 14, repeat steps 3.2, 3.3, and 3.4. Add 60 μL of FGF19 (final concentration, 100 ng/mL) to 60 mL of gfCDM differentiation medium. Replace all spent medium from the bioreactor with gfCDM supplemented with FGF19. Repeat step 3.6.\n\tNOTE: FGF19 is used to promote polarization of mid-hindbrain structures26.\nOn day 18, repeat steps 3.2, 3.3, 3.4, and 3.11.\nOn day 21, repeat steps 3.2, 3.3, and 3.4. Replace all spent medium from the bioreactor with complete neurobasal medium (Table 1). Repeat step 3.6.\n\tNOTE: Neurobasal medium is a basal medium used to maintain the neuronal cell population within the organoid7.\nOn day 28, repeat steps 3.2, 3.3, and 3.4. Add 180 μL of SDF1 (final concentration, 300 ng/mL) to 60 mL of complete neurobasal medium. Replace all spent medium from the bioreactor with complete neurobasal medium supplemented with SDF1. Repeat step 3.6.\n\tNOTE: SDF1 is used to facilitate the organization of distinct cell layers27.\nOn day 35, repeat steps 3.2, 3.3, and 3.4. Replace all spent medium from the bioreactor with complete BrainPhys medium (Table 1). Repeat step 3.6.\n\tNOTE: BrainPhys is a neuronal medium that supports synaptically active neurons28.\nReplace 1/3 of the total volume every 3 days with complete BrainPhys medium until day 90 of differentiation.\n4. Preparation of organoids for cryosectioning and immunohistochemistry\nCollection of organoids for immunostaining\n\t\nCollect 1 mL of sample of medium containing organoids with a serological pipette from the bioreactor to a 15 mL conical tube.\n\t\tNOTE: Organoids should be collected at different timepoints to evaluate the efficacy of differentiation, including days 7, 14, 21, 35, 56, 70, 80, and 90.\nRemove the supernatant and wash once with 1 mL of 1× PBS.\n\t\tNOTE: Do not centrifuge the organoids. Let the organoids settle at the bottom of the tube by gravity.",
    "Remove the supernatant and add 1 mL of 4% paraformaldehyde (PFA). Incubate at 4 °C for 30 min. Remove the spent PFA and add 1 mL of 1× PBS.\nStore the organoids in 1 mL of 1× PBS at 4 °C until processing for cryosectioning.\n\t\tNOTE: Store the organoids in 1x PBS for no more than 1 week after fixation.\nPreparation of organoids for cryosectioning\n\t\nRemove the supernatant from the stored organoids. Add 1 mL of 15% sucrose (w/v, diluted in 1× PBS), mix well by gentle swirling, and incubate overnight at 4 °C.\nPrepare a solution of 15% sucrose/7.5% gelatin (Table 2) and maintain at 37 °C during preparation to avoid gelatin to solidify.\nRemove the 15% sucrose solution, add 1 mL of 15% sucrose/7.5% gelatin to the organoids, and quickly mix by gentle swirling. Incubate at 37 °C for 1 h.\nAdd 15% sucrose/7.5% gelatin solution to a plastic container up to half of its volume. Wait for solidification at RT.\nAfter a 1 h incubation, carefully place a sucrose/gelatin drop containing the organoids on the solidified gelatin with a Pasteur pipette. Leave to solidify at RT for about 15 min. Make sure to avoid bubble formation.\nPlace 15% sucrose/7.5% gelatin on top of the organoids until the container is filled. Wait for complete solidification at RT.\nAfter solidification, incubate 20 min at 4 °C.\nCut the gelatin into a cube containing the organoids in the center and fix the gelatin cube on a piece of cardboard with a drop of O.C.T. compound.\nPlace 250 mL of isopentane in a 500 mL cup and fill an appropriate container with liquid nitrogen. Using forceps and thick gloves, carefully place the cup containing isopentane on the surface of liquid nitrogen and cool the isopentane to -80 °C.",
    "When -80 °C is reached, place the gelatin cube into the cup containing isopentane until it freezes, keeping the temperature at -80 °C. Depending on the size of the cube, it might take 1–2 min.\n\t\tNOTE: Avoid temperatures below -80 °C or excessive freezing time, because it might cause cracking of the cube.\nWhen frozen, quickly store the gelatin cube at -80 °C and store until cryosectioning.\nCryosectioning of organoids\n\t\nTurn on the cryostat and define both specimen (OT) and cryochamber (CT) temperatures at -25 °C.\nWhen both temperatures stabilize, fix the gelatin cube containing the organoids on the specimen by using O.C.T. compound.\nDefine section thickness at 12 µm.\nCut the cube and collect 3–4 slices on adhesion microscope slides (see Table of Materials).\nStore at -20 °C until use.\nImmunostaining of organoids slices\n\t\nPlace the microscope slides containing organoid sections in a copling jar with 50 mL of prewarmed 1x PBS, holding up to 10 slides back-to-back.\n\t\tNOTE: All organoid sections should be submerged with liquid.\nIncubate for 45 min at 37 °C to degelatinize slides.\nWash 1x with 50 mL of 1× PBS for 5 min at RT: Transfer the slides to a copling jar containing fresh 1× PBS.\nTransfer the slides to a copling jar containing 50 mL of freshly prepared glycine (Table 2) and incubate for 10 min at RT.\nTransfer the slides to a copling jar containing 50 mL of 0.1% triton (Table 2) and permeabilize for 10 min at RT.\nWash with 1× PBS for 5 min 2x.",
    "Prepare the immunostaining dish with 3 mm paper soaked in 1× PBS. Dry slides with a tissue all around the slices and place them onto 3 mm paper. With a Pasteur pipette, cover the whole surface of the slides with blocking solution (Table 2) with ~0.5 mL per slide. Incubate for 30 min at RT.\nRemove excess blocking solution and dry the slides with a tissue all around the slices. Place 50 µL of the primary antibody (Table 3) diluted in blocking solution over the sections and cover with the coverslips. Place the slices in a previously prepared immunostaining dish. Incubate overnight at 4 °C.\nTransfer the slides to a copling jar with 50 mL of TBST (Table 2), let the coverslips fall, and wash with TBST for 5 min 3x.\nPlace 50 µL of the secondary antibody diluted in blocking solution over the sections and cover with the coverslips. Place the slices in the previously prepared immunostaining dish. Incubate for 30 min at RT, protected from light.\nTransfer the slides to a copling jar again and wash with 50 mL of TBST for 5 min 3x.\nDry the slides with a tissue all around the slices and place the slices in a previously prepared immunostaining dish. Add 0.5 mL of DAPI solution over the whole surface of the slides with a Pasteur pipette. Incubate for 5 min at RT.\nRepeat step 4.4.9.\nCarefully dry the slides with a tissue. Add 50 µL of mounting medium drop by drop along the slide and then carefully lower a coverslip onto each slide, slightly bending it to avoid bubbles.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}