{
  "id": 9353,
  "origin_website": "Jove",
  "title": "Using an α-Bungarotoxin Binding Site Tag to Study GABA A Receptor Membrane Localization and Trafficking",
  "procedures": [
    "All protocols described below are in accordance with the IACUC and IRB institutional review boards of the University of Pittsburgh School of Medicine.\n1. Preparation of Hippocampal Neuronal Cultures in Tissue Culture Hood\nNote: Use sterile technique and reagents throughout Protocol 1.\nPrepare poly-D-lysine (0.1 mg/ml in H2O) coated glass coverslips as a substrate for the neuronal culture.\n\t\nPlace 4-5 round glass coverslips inside each 3.5 cm tissue culture dish.\nSpot 70 μl poly-D-lysine onto each 12 mm coverslip. Note: for live imaging, a glass bottomed 3.5-cm tissue culture dish can be used (spot 200 μl poly-D-lysine onto embedded 14 mm glass coverslip).\nLeave the prepared dishes in the tissue culture hood O/N. To minimize poly-D-lysine evaporation and keep surfaces sterile in the tissue culture hood, close down the window sash and turn off the blower O/N. Note: UV lights are not used during the O/N incubation.\nThe next morning, wash the dishes 3x with 2 ml of H2O.\nAfter removing the last H2O wash, add 2 ml of media to each 3.5 cm dish and leave dishes in incubator until ready to plate the neurons in step 1.4.\nHippocampal neurons are prepared from embryonic day 18-19 (E18-19) rats (modified from Goslin22).\nTransfect freshly dissociated neurons on the day of culturing with 1-4 μg of maxiprepped construct DNA.\n\tNote: typically 3 μg of DNA is transfected into 1-2 million neurons, with a viability of 50% and a transfection efficiency of 60% (e.g. starting with 2 million neurons: ((2 x 106 neurons x 0.5)0.6) provides approx. 1 million neurons; 600,000 of which are transfected1. Different amounts of construct DNA can be transfected when troubleshooting potential issues of over-expression, followed by appropriate characterization of construct localization and function.",
    "Plate the transfected neurons on the poly-D-lysine coated coverslips at a final density of approximately 200,000 neurons per 3.5 cm dish. Note: for a glass bottomed dish, plate 40,000-50,000 neurons on the 14 mm glass area.\nReplace the media 4-24 hr after preparation of neuronal cultures, then allow neurons to develop in the incubator until 14-17 days in vitro (DIV) or desired stage.\n2. Endocytosis Assay\nCAUTION: Note on α-bungarotoxin and tubocurarine waste and handling:\nHandling of all peptide neurotoxins is recommended within the guidelines of Biosafety Level-2 (BL-2) research protocols. All proper personal protective gear must be worn. Lyophilized toxin powders should be reconstituted according to manufacturer's instructions. Toxin waste should be disposed of in compliance with the governing institution's Environmental Health and Safety guidelines.\nTo remove potential peptide aggregates that may have formed during storage, α-bungarotoxin aliquots should be centrifuged briefly before use, and the supernatant should be used for the experiment.\nα-bungarotoxin (Bgt) stocks are resuspended to a concentration of 1 mg/ml in sterile H2O and stored in 10 μl aliquots at -20 °C. Fluorescently coupled Bgt stocks are used at 3 μg/ml. Tubocurarine is used at a final concentration of 150 μM.\nSet bench top heater block to 16 °C in cold room with thin aluminum or stainless steel plate on top. Alternatively, if available, a bench top cooling/heating device can be used for each step requiring 16 °C.\nCool extracellular Hepes-buffered saline (HBS containing in mM: 135 NaCl, 4.7 KCl, 10 HEPES, 11 glucose, 1.2 MgCl2, and 2.5 CaCl2, pH 7.4) to 16 °C in a water bath.\nTransfer neuron dishes to aluminum plate at 16 °C and cool for 5 min.",
    "Remove media (keep conditioned media and reserve in incubator for step 2.8, endocytosis assay time points) and replace with 1 ml of 16 °C HBS + tubocurarine (150 μM) for 2 min.\nRemove HBS + tubocurarine to labeled waste container and replace with 1 ml of 16 °C HBS + tubocurarine (150 μM) + α-bungarotoxin Alexa 594 [3 μg/ml], incubating at 16 °C for 15 min.\nRemove HBS + tubocurarine + α-bungarotoxin Alexa 594 to labeled waste container and wash dishes 3x with 2 ml of 16 °C HBS (the washes can be collected via aspiration in a vacuum flask containing 50 ml of 50 % bleach).\nFor live imaging time series experiments following receptor endocytosis using a glass bottomed 3.5 cm culture dish, perform steps 2.1-2.6, then transfer dish to heated stage (peltier device) on microscope, and begin imaging with a confocal or TIRF microscope setup.\nTransfer T = 0 time point coverslips into a dish of RT 4% paraformaldehyde /4% sucrose for 20 min, continuing with other coverslips to step 2.9.\nFor other time points, replace HBS with conditioned equilibrated 37 °C media (reserved in step 2.4) and return to incubator for endocytosis at 37 °C. Note: suggested additional time points of T = 15, 30, and 60.\nAt time points needed, take dishes from incubator, wash quickly twice with 2 ml of RT DPBS (DPBS no calcium, magnesium) then fix in 4% paraformaldehyde/4% sucrose for 20 min.\nAfter 20 min fixation, remove 4% paraformaldehyde /4% sucrose to waste container and wash dishes twice with 2 ml RT DPBS.",
    "Incubate coverslips at RT for 10 min in immunofluorescence block solution (block solution = 5% horse serum, 0.5% BSA in DPBS) containing 0.2% Triton X-100 to permeabilize the neurons and enable anti-GFP immunostaining of intracellular receptor pool and/or labeling of other proteins of interest.\nRemove block + 0.2% Triton X-100 and incubate coverslips in immunofluorescence block solution without Triton X-100 for 20-30 min.\nPerform primary antibody incubations of coverslips in block for several hours at RT or O/N at 4 °C. Note: incubation of coverslips with primaries at 4 °C O/N routinely produces improved immunofluorescence results.\nWash coverslips 3x with DPBS (5 min for each wash step).\nIncubate coverslips with secondary antibodies in block solution for 1 hr at RT.\nWash coverslips 3x with DPBS (5 min for each wash step).\nMount coverslips, handling each coverslip individually: remove excess liquid from back of coverslip with lab tissue, then invert coverslip onto 4 μl of mounting medium on a glass slide.\nAllow slides to dry at RT covered for 30 min then store at 4 °C until ready to perform microscopy.\nImage acquisition and analysis of experiment with confocal microscopy (blind to experimental condition). 60X oil NA 1.49 immersion objective with the following lasers: Argon gas 488 nm, 561 diode, 640 diode.\n\t\nUsing the same image acquisition settings, acquire single Z section images with the neuronal cell body and several dendritic processes in focus.\nQuantify α-bungarotoxin Alexa fluorescence signal and GFP immunostaining along 20 μm of 3-4 proximal dendrites per neuron, using the same threshold for analysis of all endocytosis data.\nAnalyze data from 10-12 neurons for each time point, repeating the experiment with several independent neuronal cultures.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}