{
  "id": 12122,
  "origin_website": "Jove",
  "title": "Application of MultiColor FlpOut Technique to Study High Resolution Single Cell Morphologies and Cell Interactions of Glia in Drosophila",
  "procedures": [
    "1. Preparing Flies for MultiColor FlpOut (MCFO) Experiments\nNOTE: The MCFO technique refers to a modified version of the so called Flp-mediated stop cassette excision (FlpOut). Transgenic MCFO flies carry a heat shock promoter (hsp)-Flp recombinase and different reporters under UAS control. Each reporter consists of a common backbone of a myristoylated (myr) super folder green fluorescent protein (sfGFP), in which 10 copies of an epitope tag (e.g., HA, FLAG or V5) have been inserted. The resulting non-fluorescent proteins are named \"spaghetti monster GFPs\" (smGFPs)14 and can be detected using specific antibodies against the different epitope tags.\nCross flies with the MCFO cassette and the hsp-Flp (hsp-Flp; 10XUAS-FRT-stop-FRT-myr-smGFP-HA,10XUAS-FRT-stop-FRT-myr-smGFP-FLAG, 10XUAS-FRT-stop-FRT-myr-smGFP-V5) to the appropriate glial GAL4 driver lines (see Table of Materials).\nAs the hsp is already active at 25 °C and few cells may undergo recombination leading to an unspecific labeling, set up crosses at 18 °C in order to avoid leakiness of the system. Wait around 20 days at 18 °C to obtain the F1 generation. After the heat shock (see step 2), maintain flies at 25 °C (Figure 3).\n2. Heat Shock\nNOTE: Depending on the insertion site, the efficiency of the hsp-Flp may differ; therefore, the optimal heat shock time has to be optimized. For this protocol, a MCFO fly stock in which the hsp-Flp was inserted on the X chromosome has been used (see Table of Materials).\nTransfer the progeny of the cross in step 1.1 (F1 generation flies, 3-4 days old) into new vials containing food and heat shock them at 37 °C in a water bath.",
    "NOTE: Young flies (1-2 days old) are very sensitive to heat shock. Wait 1 or 2 more days before performing the heat shock in order to reduce the mortality rate caused by the treatment. Use some of the F1 generation flies as a control, without heat shock.\nDuring the heat shock, maintain flies in normal vials with food in order to decrease the rate of stress-induced mortality. Put females and males in separate vials.\nMake sure to immerse the entire vial in the water to ensure a homogeneous heat shock. Use a 5-8 min shock as a suitable starting point for sparse labeling of glia cells with many GAL4 driver lines; the shock duration must be optimized for each driver and experiment (shorter or longer heat shock times may be necessary).\nAfter the heat shock, lay the vials horizontally on the bench for a few minutes in order to allow the flies to recover from the heat shock.\n\tNOTE: It is not necessary to change the vials.\nMaintain the flies at 25 °C and dissect (see step 3 and 4) them 2 or more days after the heat shock for optimal reporter expression.\n3. Dissection Preparation and Solutions\nThe day of the dissection, prepare fresh fixative solution in 200 µL PCR tubes by mixing 180 µL of S2 cell culture medium with 20 µL of 20% paraformaldehyde (PFA) to obtain a 2% PFA solution. Maintain the fixative solution on ice before and during the dissection.\n\tCaution: PFA is toxic and must be handled with care.\n\tNOTE: Mix 160 µL of S2 cell culture medium with 40 µL of 20% paraformaldehyde (PFA) in a 200 µL PCR tube to prepare a 4% PFA solution instead of a 2% solution.",
    "Use one PCR tube per genotype with a maximum of 8-10 brains per tube for optimal staining results.\nPrepare the adult brain washing solution: 0.5% bovine serum albumin, 0.5% Triton X-100 in PBS.\n\tNOTE: Depending on the staining, a solution containing 1% Triton X-100 may be needed. A higher concentration of Triton X-100 increases the penetration of the antibody into the tissue and it is necessary to stain regions that lie deep inside the tissue (e.g., synaptic regions in the adult Drosophila brain).\nPrepare the blocking solution: 3% normal goat serum, 3% normal donkey serum, and 0.5% Triton X-100 in PBS.\nThe adult brain washing solution and the blocking solution can be stored at 4 °C for a few weeks.\nPut deep depression wells glass plate on ice and fill each well with the following solutions: one with 70% ethanol, one with PBS, and one with S2 cell culture medium.\n4. Adult Brain Dissection\nPosition a 3 cm dissecting dish on the stage of a stereomicroscope and fill it with cold S2 cell culture medium. Conduct all the dissections in this medium to ensure that the tissue remains healthy during the dissection procedure.\n\tNOTE: Use a dissecting dish lined with several millimeters of black silicone which provides a good background contrast (in the images), and preserve the forceps during the dissection.\nAnesthetize the flies of the desired genotype with CO2.\nWith forceps, grab the fly by the wings and wash it in cold 70 % ethanol for 30 s, then with cold PBS for additional 30 s.\nTransfer the fly into the deep depression well that is filled with S2 cell culture medium.\nRepeat the same procedure for all flies of the same genotype and maintain them in cold S2 cell culture medium until dissection, which will preserve the tissue.",
    "NOTE: Anesthetize only the number of flies that can be dissected in a time period of about 30 min. Long incubation times in S2 cell culture medium may damage the tissue.\nGrab the fly with forceps and, under a stereomicroscope, submerge the fly in S2 cell culture medium.\nDetach the head from the rest of the body. Discard the body and keep the head submerged in S2 cell culture medium. It is extremely important to hold the head with forceps for the entire duration of the dissection. If the head starts to float, it will be difficult to retrieve it without damaging the tissue.\nBegin the dissection by pulling out one eye, while holding the head with at least one forceps at all times. Make sure that the tip of the forceps is just below the retina to avoid damaging the tissue underneath. Pull out the other eye and begin removing the cuticle until the brain appears.\nRemove all tracheal tissue and cuticle around the brain until the tissue appears clean. Make sure to remove all tracheal tissue around the brain for optimal staining results; the tissues are now ready to be fixed and stained.\nMaintain all the dissected brains in cold S2 cell culture medium before transferring them into the PFA solution in order to time the fixation step.\n5. Adult Brain Staining\nTransfer the isolated brain with a P10 pipette into the PFA solution at room temperature (RT). To avoid tissue damage, never use forceps for transferring the brains after the dissection. Perform all steps in 200 µL PCR tubes on a nutator.",
    "For all steps, before discarding the old solution with a P200 pipette, allow the brains to settle on the bottom of the tube. Try to remove the supernatant without aspirating the tissue. Protect the tissue from light exposure.\nFix the brains in 200 µL of 2% PFA in S2 cell culture medium for 1 h or in 4% PFA for 30 minutes. Keep fixation times identical between samples in order to increase reproducibility.\nAfter 3 (or more) washes of 15 minutes each in 200 µL of adult brain washing solution, block the tissues with 200 µL of blocking solution for 30 minutes. Longer incubation times in blocking solution are possible.\nIncubate the brains overnight at 4 °C with primary antibodies diluted in adult brain washing solution in a total volume of 200 µL.\n\tNOTE: The incubation times may vary depending on the type of antibody used. Longer incubations may be necessary.\n\t\nFor labeling of the three MCFO markers, incubate the brains with anti-HA (1:500), anti-FLAG (DYKDDDDK epitope) (1:100), and anti-V5 primary antibodies.\nPrimary directly-conjugated antibodies could be used instead of the normal primary + secondary combination (e.g., anti-V5:DyLight 549 (1:200)). In this case, treat the directly-conjugated antibodies as secondary antibodies.\n\t\tNOTE: For each genotype, keep some brains as controls to verify the specificity of the staining. Skip the primary antibody incubation and go directly to the next step.\nWash the tissues 3 times for 1 h in 200 µL of adult brain washing solution (step 3.3) and incubate them with secondary fluorophore-conjugates/primary directly-conjugated antibodies diluted in adult brain washing solution overnight at 4 °C or for 4 h at RT, in a total volume of 200 µL\n\tNOTE: Examples of appropriate antibodies: AlexaFluor 488 (1:250), anti-V5:DyLight 549 (1:200) and DyLight 647 (1:100)-conjugated antibodies.",
    "Wash the brains 3 times for 1 h in 200 µL of adult brain washing solution, followed by a final wash in 200 µL of PBS overnight at 4 °C or for 1-2 h at RT; the final washing step in PBS removes any traces of Triton X-100 and is necessary for optimal staining results. Mount the brains in mounting medium with an anti-fade agent on glass coverslips.\n6. Mounting of Brains for Imaging\nTrim an imaging spacer to the appropriate size using scissors. For high-resolution microscopy, sandwich the specimen and imaging spacer between two glass coverslips.\n\tNOTE: Imaging spacers are thin (0.12 mm thick) adhesive spacers that peel and stick to glass coverslips or microscope slides, allowing the mounting of specimens without compression.\nUsing forceps, remove the adhesive liner from one surface and apply the spacer, adhesive side down, on the surface of a glass coverslip (22 mm x 60 mm). Apply 10 µL of mounting medium to a new glass coverslip.\nWith a P10 pipette, transfer the brains from the 200 µL tube to the coverslip, next to the drop of mounting medium. Together with the tissues, transfer some PBS in order to maintain the brains in solution.\nWith a P10 pipette, move the brains from the PBS to the drop of mounting medium trying to limit the amount of PBS. Transfer the specimens in mounting medium on the coverslip with the imaging spacer. Use enough mounting media to cover the specimen.\nRemove the other adhesive liner from the upper side of the spacer and add a glass coverslip on top of the specimens. With the tip of a forceps, apply a gentle pressure over the adhesive area to seal. Image the mounted tissues immediately or store the slides at -20 °C for later analysis.\n7. Image Acquisition",
    "Acquire stacks of confocal fluorescence images using a confocal microscope with a 40X (NA = 1.2, water immersion) objective or 63X (NA =1.4, oil immersion) objective (pixel sizes = 1,024 x 1,024 in the xy plane; Distance between two confocal sections = 0.5 µm). Adjust detector gain and offset in each channel in such a way that no saturated pixels and zero pixel values are present in the images; this avoids information loss and ensures use of the full dynamic range of the detector.\n\tNOTE: Since 3D imaging is time consuming, the measurements can be automated by scanning multiple samples in parallel at different locations. To avoid evaporation with the water immersion objective, use special oil immersion medium with refractive index n = 1.33.\nProcess the confocal stacks for maximum density projections, changes in channel hue, and adjustment of brightness and contrast using any standard image analysis software (see Table of Materials).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}