{
  "id": 11639,
  "origin_website": "Jove",
  "title": "An Automated T-maze Based Apparatus and Protocol for Analyzing Delay- and Effort-based Decision Making in  Free Moving Rodents",
  "procedures": [
    "All experimental protocols were approved by the Animal Care and Use Committees of the RIKEN Brain Science Institute.\n1. Animal Preparation\nChoose the sex, age, genotype and pharmacological treatments of experimental mice (or rats) depending on the experimental purpose.\n\tNOTE: Here we demonstrated the performance of four male C57B/6 mice of 2 months old.\nHouse the mice in a room maintained under standard conditions (12 h light/12 h dark cycle, lights on between 8:00 A.M. and 8:00 P.M., 22 ± 1°C).\n\tNOTE: If the purpose is to compare the difference between two genotypes, group 4 mice per cage and include 2 mice of each genotype.\nHandle the mice for 2 min/day for 5 days to familiarize them with human contact. Feed them with measured rations so that their body weight is roughly maintained about 80–85% of the free feeding weight throughout the experiment. Provide water ad libitum.\nHabituate mice to the experimental room by transferring all mice from the mouse housing room to the experimental room 30 min before the experiment each day.\nStart experiments at the same time each day to avoid the effects of circadian rhythms on animal performance.\n2. Animal Habituation to the Maze\nStart habituation to the maze simultaneously with mouse handling (2 min/day). Keep all doors open at this stage. Perform habituation for a total of 5 days.\nOn day 1, scatter the food pellets throughout the maze.\nOn days 2 and 3, scatter the pellets along the two goal arms.\nOn days 4 and 5, put the pellets only at the two goal boxes.\nEveryday, after placing the pellets, place the mice in the start box of the T-maze in groups of four and allow the mice to explore the maze for 10 min.",
    "NOTE: Habituating the mice in groups of four will help them to learn from each other and speed up training.\n3. Animal Discrimination of HRA from LRA\nNOTE: This protocol includes both delay-based and effort-based decision-making tests. However, depending on the purpose, researchers can test only one of them, or both. Control software (Table of Material) is used to automatically control the T-maze setup for the following steps. If effort-based decision making will be tested, introduce barriers to both HRA and LRA in the forced arm entry phase. Then animals will be trained for both discrimination and barrier climbing simultaneously. The starving mice actively climb the barriers and after this phase, all of them can climb skillfully. Therefore, it is not necessary to start from a lower barrier with this protocol.\nForced arm entry phase\nOpen the parameter registration window of the control software and set up parameters as follows (Figure 3).\n\t\t\nChoose the \"phase option\". Set the \"trial number\" to 10, so that each animal will go through 10 trials per day for 5 continuous days.\n\t\t\tNote: One can choose a different trial number in his/her own experiments.\nSet the \"Duration\" to 900 s so that the training of one mouse per day will not exceed 900 s. Set the \"Default start delay time\" to 3 s, so that the start door will open 3 s after the animal is detected in the start area. \nSet the \"pellet number\" for the HRA and the LRA so that 4 pellets are always automatically dispensed in the HRA and 1 pellet is dispensed in the LRA.",
    "Note: In our experiments, we found that 1:4 is the best ratio when 10 mg sugar pellets are used. If we use 6 to 10 pellets, the mice cannot finish eating all of them and there will be omission happening.\nSet the \"Delay time\" to 0 s, so that there will be no delay for both HRA and LRA during this phase.\nOpen the \"ID registration\" window of control software. Register ID of each individual mouse to software according to the location of the HRA, either left side or right side. (Figure 4).\n\t\tNote: The location should be counterbalanced with respect to genotype groups. For 50% of each genotype group, the HRA is always on the left and the LRA is always on the right. For the other 50%, the HRA is always on the right and the LRA is always on the left.\nOpen the application window of the software, select \"Decision Making\" from the dropdown \"Task\" list. Input subject ID and select \"Phase 2\" from the \"Phase\" dropdown list. Select day number from the \"Day\" dropdown list. Press \"OK\" button to enter the experiment interface window. \nIn the experiment interface window, press \"GetBG\" to register the background information of the maze so that the animal will be accurately tracked regardless of the background of the environment. Press the \"SESSION START\" button (Figure 5). \nPlace the mouse in the start box and initiate the training by pressing the \"start\" button of the remote control.\n\t\t\nNote that the start door, one junction door (either left or right side) will automatically open after 3 s; once the mouse enters the junction area, the start door will automatically close.",
    "Observe that once the mouse enters the delay area (either left or right side), the junction door will automatically close and the goal door will automatically open.\nObserve that once the mouse takes the pellet, the back door and pre-start door will automatically open. Once the mouse enters the back area, the back door will automatically close.\nObserve that once the mouse enters the start box, the pre-start door will automatically close, and a new trial will start.\n\t\t\tNote: Within 10 trials of each day during this training phase, the software will automatically ensure that each mouse visits the HRA for 5 trials and the LRA for 5 trials.\nClean the maze thoroughly every day.\nFree arm entry phase\nRegister parameters and Subject ID in the same way as done in the forced entry phase (step 3.1.1 and 3.1.2). Choose the \"phase option\". Set the \"trial number\" to 20, so that each animal will go through 20 trials, per day for 7 continuous days.\nIn the application window, select \"Phase 3\" from the \"Phase\" dropdown list. Set other parameters as per step 3.1.3.\nIn the experiment interface window, set the value of \"Success Rate\" as 80% so that the training will automatically continue until the mouse selects the HRA in 80% of trials, or when the mouse finishes 20 trials per day (as is registered in parameters setup). Apply other operations as per step 3.1.4.\nAllow the mouse to freely choose one arm, either HRA or LRA. \n\t\t\nNote that the start door, two junction doors will automatically open after 3 s; once the mouse enters the junction area, the start door will automatically close.",
    "Observe that once the mouse chooses one arm and enters the delay area (either left or right side), the junction door will automatically close and the goal door will automatically open.\nObserve that once the mouse takes the pellet, the back door and pre-start door will automatically open. Once the mouse enters the back area, the back door will automatically close.\nObserve that once the mouse enters the start box, the pre-start door will automatically close, and a new trial will start. \n4. Delay-based Decision-making Test\nRegister parameters and Subject ID in the same way as done in the free arm entry phase (step 3.2.1). Set the \"Delay time\" to 5, 10,15 s on day 1, day 2 and day 3 respectively, so that there will 5 s delay for HRA on day 1, 10 s delay for HRA on day 2, and 15 s delay for HRA on day 3. \nIn the application window, select \"Phase 4\" from the \"Phase\" dropdown list. Set other parameters in the same way as in 3.2.2.\nIn the experiment interface window, apply all the operations as per step 3.2.3.\nAllow the mouse to freely choose one arm, either HRA or LRA. \nNote that the start door, two junction doors will automatically open after 3 s; once the mouse enters the junction area, the start door will automatically close.\nObserve that once the mouse chooses one arm and enters the delay area (either left or right side), the junction door will automatically close.\n\t\tNote: If the mouse chooses LRA, the goal door will automatically open immediately. However, if the mouse chooses HRA, the goal door will automatically open after 5 s, 10 s, and 15 s on days 1, 2, 3 respectively.",
    "Observe that once the mouse takes the pellet, the back door and pre-start door will automatically open. Once the mouse enters the back area, the back door will automatically close.\nObserve that once the mouse enters the start box, the pre-start door will automatically close, and a new trial will start. \n\t\tNote: Here, we trained the mice for 5–7 days with each delay condition. However, based on our experience on testing multiple lines of transgenic or mutated mice, 1 day (20 trials) is absolutely enough to see the difference between the mice of different genotypes and there is no meaning to extend the training time (See Figure 6 as an example). Therefore, currently we only apply 1 day for each delay time and it works well. There will be no problem if researchers want to elongate the training days depending on their own purpose.\nOptional: Perform the test with the HRA reversed. To test if the mouse’s choice is the result of an orientation preference, switch the left/ right position of the HRA and the LRA (which can be accomplished automatically by the software) and allow the mice to freely choose one arm as in 4.4. \nOptional: Perform a delay control test. To test whether any deficit observed is the result of altered spatial memory or reward sensitivity rather than the result of changes in decision making, introduce a 15 s delay to the LRA as well as the HRA, and allow the mice to freely choose one arm as in 4.4. \n5. Effort-based Decision-making Test\nIntroduce the barrier to the HRA as shown in the diagram (Figure 1).\nSet up all the parameters and apply all the operations as per step 3.2 — free arm entry phase and test the animals for 3 continuous days.",
    "Allow the mice to freely choose one arm, either HRA or LRA.\n\tNOTE: Here, we trained the mice for 14 days. However, based on our experience on testing multiple lines of transgenic or mutated mice, 3 days are absolutely enough to see the difference between the mice of different genotypes and there is no meaning to extend the training time (See Figure 6 as an example). Therefore currently we only apply 3 days for effort-based test and it works well. There will be no problem if researchers want to elongate the training days depending on their own purpose.\nOptional: Perform the test with the HRA reversed. To test if the mouse’s choice is the result of an orientation preference, switch the left/ right position of the HRA and the LRA (which can be accomplished automatically by the software) and allow the mice to freely choose one arm as in step 5.3.\nOptional: Perform effort control test. To test whether any deficit observed is the result of altered spatial memory or reward sensitivity rather than the result of changes in decision making, introduce a barrier to the LRA as well as the HRA, and allow the mice to freely choose one arm as in step 5.3. \n6. Data Analysis\nObtain data and results directly from the control software.\nNote that the software will automatically record experimental date, start and finish time, duration, trial number, the location of the HRA, pellet number in the HRA and the LRA, the position (X, Y), and the moving trace etc., of each mouse in the \"Data\" folder.",
    "Check that the software has automatically analyze the following items and record them in the \"Result\" folder under each animal ID: Duration, trial number, HRA choice number, LRA choice number, HRA choice percentage, LRA choice percentage, total moving distance, and total junction time.\nPerform statistical analysis on the data from all experiments by a mixed ANOVA (split-plot ANOVA), with day/session as within-subject factor and group factor (genotype group or groups with different experimental conditions) as between-subject factor.\nAnalyze the main effect of group factor if there is no interaction between day/session with group factor. Apply post hoc pairwise comparisons if there is a significant interaction between day/session with group factor."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}