{
  "id": 3860,
  "origin_website": "Cell",
  "title": "Pooled CRISPR-activation screening coupled with single-cell RNA-seq in mouse embryonic stem cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nLentiviral production of SAM activators and custom sgRNA library\nTiming: 1 week\nThree lentiviruses are produced in this step: (1) dCas9-VP64_Blast, (2) MS2-p65-HSF1_Hygro and (3) the custom CRISPRa sgRNA library. HEK293T cells are used for lentiviral packaging by co-transfecting the plasmid of interest with 2nd generation lentiviral packaging plasmids. These packaging plasmids are pMD2.G (Addgene #12259), which expresses a VSV-G envelope, and psPAX2 (Addgene #12260), which contains Gag, Pol, Rev, and Tat inserts. When these three lentiviral productions are complete, dCas9-VP64_Blast and MS2-p65-HSF1_Hygro lentiviruses will be first simultaneously transduced into mESCs in the next step to generate a constitutive cell line that enables CRISPRa (this cell line will be referred to as SAM mESCs). The custom sgRNA library will be then transduced into SAM mESCs at a low multiplicity-of-infection (MOI) to introduce the custom CRISPRa perturbations.\nNote: safety considerations need to be evaluated when working with lentiviruses and it may require additional lab biosafety procedures.\nPrepare HEK293T cells (ATCC CRL-3216) for transfection. Three transfections will be performed here: (1) dCas9-VP64_Blast, (2) MS2-p65-HSF1_Hygro and (3) the custom CRISPRa sgRNA library. Seed 3.5 million HEK293T cells per transfection in 100 mm tissue culture plates with 10 mL of pre-warmed D10 media, 16–20 h before transfection.\nCritical: use low-passage (<20 passages) HEK293T cells for optimal lentiviral production.\nNote: we recommend starting with one transfection per plasmid/library in a 100 mm plate and scale it up later if necessary.\nPlasmid co-transfection for lentiviral packaging:\n16–20 h after seeding HEK293T cells as described in previous step, cells should have reached 80%–90% confluency.\nPrepare a single-tube reaction mix for each transfection.\nObtain three sterile 1.5 mL tubes. Label 1–3.\nTo each tube, add 1.5 mL of opti-MEM (Gibco, 31985).",
    "To each tube containing opti-MEM, add plasmid/library of interest together with lentiviral packaging plasmids as follows:\nTube 1: 3.5 μg of pMD2.G (Addgene #12259), 6.5 μg of psPAX2 (Addgene #12260) and 10 μg of lenti dCas9-VP64_Blast (Addgene #61425).\nTube 2: 3.5 μg of pMD2.G (Addgene #12259), 6.5 μg of psPAX2 (Addgene #12260) and 10 μg of lenti MS2-p65-HSF1_Hygro (Addgene #61426).\nTube 3: 3.5 μg of pMD2.G (Addgene #12259), 6.5 μg of psPAX2 (Addgene #12260) and 10 μg of the custom sgRNA library cloned into CROP-sgRNA-MS2 (Addgene #153457).\nVortex briefly.\nAdd 60 μL of transIT-293 transfection reagent (Mirus Bio, 2700) to each tube.\nVortex briefly.\nIncubate 30 min at room-temperature.\nDuring the 30 min incubation time, aspirate the D10 media from the three plates of HEK293T cells and add 8.5 mL per plate of pre-warmed mESC media without LIF: DMEM (Gibco, 11995-040), 15% fetal bovine serum (Thermo Fisher Scientific, 10439024), 1 U/mL penicillin - 1 mg/mL streptomycin (Gibco, 15140-122), 0.1 mM nonessential amino acids (Gibco, 11140-050), 2 mM GlutaMAX (Gibco, 35050-061) and 50 μM β-mercaptoethanol (Gibco, 31350-010).\nAdd each transfection mix from step 2bvii drop-wise to one of the 100 mm plates of HEK293T cells prepared in step 2c.\nReturn plates to incubator and culture at 37°C in 5% CO2 for 48 h.\nFor each plate, collect 10 mL of lentiviral supernatant with a 20 mL syringe and filter into a 15 mL tube through a 0.45 μm PES filter (Sartorius, 16533). Prepare aliquots of 1 mL of the clarified supernatant for (1) dCas9-VP64_Blast (Addgene #61425) and (2) MS2-p65-HSF1_Hygro (Addgene #61426).",
    "Critical: use only cellulose acetate or polyethersulfone (PES) (low protein binding) filters. Do not use nitrocellulose filters as nitrocellulose binds surface proteins on the lentiviral envelope and destroys the virus. As an alternative to filtering the lentiviral supernatant, centrifuge at 500 × g for 10 min and discard pellet.\nPause Point: This step completes lentiviral production for (1) dCas9-VP64_Blast (Addgene #61425) and (2) MS2-p65-HSF1_Hygro (Addgene #61426). For these, store aliquoted supernatant at −70°C for long-term or proceed immediately with one aliquot of each to step 6. For the clarified supernatant of the custom sgRNA library (3), proceed immediately to step 5 for lentiviral concentration.\nConcentrate the lentiviral preparation of custom sgRNA library cloned into CROP-sgRNA-MS2 (Addgene #153457):\nCombine 1 volume of Lenti-X Concentrator (Takara, 631231) with 3 volumes of lentiviral supernatant (i.e., add 3.3 mL of Lenti-X Concentrator to 10 mL of lentiviral supernatant).\nMix by inversion.\nIncubate at 4°C for 4 h to 16 h.\nNote: manufacturer recommends incubation from 30 min to overnight, however, the shortest time we have tested is 4 h.\nCentrifuge mix at 1,500 × g for 45 min at 4°C. The resulting white pellet contains the concentrated lentivirus.\nRemove supernatant and resuspend pellet with fresh serum/LIF media to 1/10 to 1/20 of the original volume of clarified lentiviral supernatant (500 μL to 1 mL). Prepare 100 μL aliquots of the concentrated lentivirus and store at −70°C.\nPause Point: Store aliquots of the custom sgRNA library lentivirus at −70°C until step 19.\nGeneration and quality control of SAM mESCs\nTiming: 4–5 weeks",
    "A clonal mESC line constitutively expressing dCas9-VP64_Blast and MS2-p65-HSF1_Hygro is generated in this step via transduction of the lentiviral particles prepared in steps 1–4. This cell line will be used to perform CRISPRa via the SAM system (Konermann et al., 2015[href=https://www.wicell.org#bib4]) after lentiviral transduction of individual sgRNAs or a sgRNA library cloned into the backbone CROP-sgRNA-MS2 (Addgene #153457).\nTiter dCas9-VP64_Blast and MS2-p65-HSF1_Hygro lentiviral preparations in mESCs. Construct a lentiviral dilution curve for each lentivirus:\nTrypsinize a confluent plate of mESC and count the cell suspension.\nIn preparation for seeding 120,000 cells per well in 400 μl of serum/LIF culture media in 12 gelatinized wells of a 24-well plate (6 wells to be used for dCas9-VP64_Blast titration and 6 for MS2-p65-HSF1_Hygro titration), count 1.56 million cells (13× 120,000 cells, i.e., counting for an extra well to account for pipetting errors) and spin down 300 × g for 3 min at room temperature (20°C–25°C); discard supernatant and resuspend cell pellet in 5.2 mL of serum/LIF culture media (13× 400 μl).\nAdd polybrene (Millipore, TR-1003-G) to the 5.2 mL of cell suspension to a final concentration of 16 μg/mL.\nAdd 400 μl of cell suspension + polybrene per well to 12 gelatinized wells of a 24-well plate.\nIf dCas9-VP64_Blast and/or MS2-p65-HSF1_Hygro lentiviral preparations from step 4 had been stored at −70°C, thaw 1 aliquot of each on ice.\nAdd 103 U/mL LIF (Stem Cell Institute, Cambridge) to each lentiviral preparation.\nAdd lentivirus and/or additional serum/LIF culture media to individual wells of the 24-well plate of mESCs prepared in step 6d, as follows:\ndCas9-VP64_Blast lentivirus:\nWell 1: 400 μl lentivirus\nWell 2: 200 μl lentivirus + 200 μl serum/LIF media\nWell 3: 100 μl lentivirus + 300 μl serum/LIF media\nWell 4: 50 μl lentivirus + 350 μl serum/LIF media",
    "Well 5: 25 μl lentivirus + 375 μl serum/LIF media\nWell 6: 400 μl serum/LIF media. This non-transduced well will be used as a +antibiotic (blasticidin) selection or kill control.\nMS2-p65-HSF1_Hygro lentivirus:\nWell 1: 400 μl lentivirus\nWell 2: 200 μl lentivirus + 200 μl serum/LIF media\nWell 3: 100 μl lentivirus + 300 μl serum/LIF media\nWell 4: 50 μl lentivirus + 350 μl serum/LIF media\nWell 5: 25 μl lentivirus + 375 μl serum/LIF media\nWell 6: 400 μl serum/LIF media. This non-transduced well will be used as a +antibiotic (hygromycin) selection or kill control.\nNote: the final volume in each well is 800 μl, making the final concentration of polybrene 8 µg/mL.\nMix each well thoroughly by pipetting up and down and return plate to incubator (37°C in 5% CO2).\nAfter 24 h, remove media from each well, wash twice with PBS and add 800 μl of fresh serum/LIF culture media. Troubleshooting 1[href=https://www.wicell.org#sec6.1]\nApproximately 24 h later (approximately 48 h after transduction), trypsinize and split each well of cells into 2 gelatinized wells of a 24-well plate. For each condition of cells transduced with dCas9-VP64_Blast, culture one well of cells in 800 μl of serum/LIF media and the other well in 800 μl of serum/LIF media containing 20 μg/mL blasticidin (InvivoGen, ant-bl-1). Similarly, for each condition of cells transduced with MS2-p65-HSF1_Hygro, culture one well of cells in 800 μl of serum/LIF media and the other well in 800 μl serum/LIF media containing 200 μg/mL hygromycin (InvivoGen, ant-hg-1). Add also 20 μg/mL blasticidin to one well of non-transduced cells and 200 μg/mL hygromycin to another well of non-transduced cells; these will be used as non-transduced +antibiotic selection controls. Two wells will remain as non-transduced no-antibiotic controls in serum/LIF media.",
    "For the following 6–7 days, expand cells from individual wells when they reach 80% confluency. To calculate viral titer, this expansion should be done without discarding any cells, by transferring all cells to a gelatinized 6-well plate for the first passage and subsequently to gelatinized 100 mm plates for the later passages.\nThe transduced cells have been selected for dCas9-VP64 or MS2-p65-HSF1 expression when there are no viable cells in the respective non-transduced +antibiotic control condition (likely to occur 6–7 days after addition of blasticidin/hygromycin). When selection is complete, the viral titer can be calculated. Trypsinize, count and record the total number of cells in each well/plate. Troubleshooting 2[href=https://www.wicell.org#sec6.3]\nFor each lentivirus and for each transduction condition (as indicated in step 6 g), calculate MOI as the number of cells in the transduced +antibiotic condition divided by the number of cells in the transduced no-antibiotic condition. For example, if the number of cells in condition 3 (100 μl lentivirus + 300 μl serum/LIF media) of dCas9-VP64_Blast titration is 10 million in the +blasticidin condition and 20 million in the no-blasticidin condition, the resulting MOI is 0.5.\nTransduce dCas9-VP64_Blast and MS2-p65-HSF1_Hygro lentiviruses into mESCs at a MOI of 0.5–0.7:\nCalculate the volume of dCas9-VP64_Blast lentivirus and MS2-p65-HSF1_Hygro lentivirus to transduce 2.5 million cells at a MOI of 0.5–0.7 each, based on calculations in step 6 m.",
    "Note: for instance, if for the titration experiment described in step 6 with 120,000 mESCs, 50 μl of dCas9-VP64_Blast lentivirus resulted in a MOI of 0.5–0.7, and 100 μl of MS2-p65-HSF1 lentivirus resulted in a MOI of 0.5–0.7, scale up these volumes for 2.5 million cells. For dCas9-VP64_Blast this would result in (2.5 × 106 cells × 50 μl) / 1.2 × 105 cells in titration experiment = 1,042 μl; for MS2-p65-HSF1_Hygro, (2.5 × 106 cells × 100 μl) / 1.2 × 105 cells in titration experiment = 2,083 μl.\nThaw aliquots of the lentiviral preparations dCas9-VP64_Blast and MS2-p65-HSF1_Hygro from step 4 on ice.\nCombine the required volume of dCas9-VP64_Blast lentivirus with the required volume of MS2-p65-HSF1_Hygro lentivirus according to calculations in step 7a, and add 103 U/mL LIF (Stem Cell Institute, Cambridge) to the combined lentiviral mix. If lentiviral preparations were successful, the total combined volume should not exceed 15 mL. If required, top up to 15 mL with serum/LIF culture media.\nAdd 8 μg/mL polybrene (Millpore, TR-1003-G) to the 15 mL of combined lentivirus and mix gently by pipetting.\nTrypsinize a confluent plate of low-passage mESC (<10 passages) and count the cell suspension. Transfer a total of 2.5 million cells to a new tube and spin down 300 × g for 3 min at room temperature (20°C–25°C). Discard the supernatant and resuspend cell pellet in the ∼15 mL mix from step 7d containing the combined lentiviral preparation + LIF + polybrene.\nCritical: we recommend using low-passage mESCs (<10 passages) for clonal cell line generation, especially if differentiation protocols are to be applied during screening.\nSeed cells + lentiviral mix in a 100 mm gelatinized tissue culture plate and return plate to incubator (37°C in 5% CO2).\nCritical: when seeding cells, ensure an even distribution throughout the plate.",
    "Seed an additional 2.5 million mESCs in another 100 mm gelatinized tissue culture plate to be used as a non-transduced +antibiotic selection control. Add 8 μg/mL polybrene (Millpore, TR-1003-G), mix gently and return plate to incubator (37°C in 5% CO2).\nAfter 24 h, remove media for both plates, wash twice with PBS and add 10 mL of fresh serum/LIF culture media per plate.\nSelect cells for dCas9-VP64 and MS2-p65-HSF1 expression:\nApproximately 24 h after refreshing serum/LIF culture media (approximately 48 h after transduction), replace media with serum/LIF media containing 20 μg/mL blasticidin (InvivoGen, ant-bl-1) and 200 μg/mL hygromycin (InvivoGen, ant-hg-1), both to the plate of cells transduced with dCas9-VP64_Blast/MS2-p65-HSF1_Hygro and to the non-transduced +antibiotic selection control plate.\nGrow cells in blasticidin+hygromycin selection media for 10–14 days, until individual colonies (derived from single transduced cells) are observed in the plate of transduced cells and there are no viable cells in the non-transduced +antibiotic selection control plate.\nNote: 20 μg/mL blasticidin and 200 μg/mL hygromycin should kill all non-transduced cells within a week, the extra few days will allow resistant cells to form large independent colonies. Troubleshooting 2[href=https://www.wicell.org#sec6.3] and 3[href=https://www.wicell.org#sec6.5]\nManual picking of resistant colonies and clonal expansion:\nUse a bright-field microscope inside a tissue culture hood.\nPrepare a 96-well U-shaped-bottom plate with 25 μl of Trypsin-EDTA (Thermo Fisher Scientific, 25200056) in 30 wells. Additionally, coat all the wells of a 24-well plate with 0.1% gelatin.\nRemove media from plate of transduced and selected cells from step 8b and wash once with PBS.\nAdd 10 mL of PBS and inspect plate under a microscope with a 4× magnification.\nTo pick a desired colony, circle the colony with a 20 μL pipette tip and, with volume set of 15 μL, scrape the colony to dislodge it and then aspirate.",
    "Critical: Select colonies that are spaced well enough apart to avoid contamination from surrounding colonies.\nCritical: Select colonies that appear rounded or oval, with a phase contrast bright edge and often a dark necrotic center. Do not pick differentiated colonies that appear flat and surrounded by fibroblast-like cells.\nTransfer the picked colony to a single well of a 96-well U-shaped-bottom plate containing 25 μl of trypsin-EDTA and pipette up and down to help dissociate the colony.\nRepeat steps 9e–9f for 5–10 colonies or the maximum number of colonies that you can pick in approximately 5 min.\nAdd 175 μl of serum/LIF culture media to colonies in 96-well plate.\nCritical: do not leave colonies in trypsin-EDTA for longer than 5 min before neutralizing with serum/LIF media. If necessary, do fewer colonies at the time and check their dissociation in trypsin-EDTA under a microscope. Always check that colonies are dissociated before adding serum/LIF media.\nRepeat steps 9e–9 h until 20–30 colonies have been picked.\nTransfer each dissociated colony in the 96-well plate to a well in a gelatinized 24-well plate and add 600 μl of serum/LIF media to each well. Return plate to incubator and culture cells (37°C and 5% CO2).\n24–72 h later (at 70%–80% confluency), trypsinize and transfer clones to a gelatinized 6-well plate with 2 mL of serum/LIF media.\nWhen clones in the 6-well plate reach 70%–80% confluency, harvest cell pellets for genomic DNA and RNA extraction, and cryopreserve clonal cell lines:\nTrypsinize each well containing a clone and divide sample 1:1:1 into three 2 mL tubes. Also trypsinize a confluent plate of non-transduced mESCs.",
    "Use one of the tubes from each clone for genomic DNA/RNA extraction. To do that, spin down 300 × g for 3 min at 4°C, remove supernatant and immediately snap freeze pellet in dry ice or liquid nitrogen. In parallel, follow the same steps for non-transduced mESCs to be used as a negative control for downstream analysis of genomic DNA and RNA.\nUse another tube from each clone for cryopreservation, following step 5 of the “before you begin[href=https://www.wicell.org#before-you-begin]” section.\nUse the last tube from each clone for routine mESC maintenance by seeding cells in an individual gelatinized well from a 6-well plate in serum/LIF culture media. These cells can be used later for further cryopreservation or for further genomic DNA/RNA harvesting.\nPause Point: Store cell pellets from step 10b at −70°C long-term or proceed immediately to step 11. Cryopreserved clonal lines (step 10c) can be stored long-term in liquid nitrogen.\nExtract genomic DNA and RNA for each clone and for non-transduced mESCs. We recommend using the AllPrep DNA/RNA Mini Kit (Qiagen, 80204), following manufacturer’s instructions, for simultaneous purification of genomic DNA and RNA for each clone. Measure DNA and RNA concentration using a nanodrop or similar.\nPause Point: RNA can be stored long-term at −70°C. For DNA purifications, store at −20°C or proceed immediately to step 12.\nPerform a PCR on the genomic DNA from each clone to identify those containing dCas9-VP64_Blast and MS2-p65-HSF1_Hygro integrations:\nSamples to run:\nGenomic DNA from harvested clones (20–30 samples).\nGenomic DNA from non-transduced mESCs (negative control).\nLenti dCas9-VP64_Blast plasmid DNA (positive control).\nLenti MS2-p65-HSF1_Hygro plasmid DNA (positive control).\nSet up 2 PCR reactions for each clone, the negative control and the corresponding positive control. The first PCR reaction will test for integration of dCas9-VP64_Blast and the second for integration of MS2-p65-HSF1_Hygro.",
    "Note: We use DreamTaq DNA Polymerase (Thermo Fisher Scientific, EP0702). Alternative DNA polymerases for standard PCR applications on genomic DNA can be suitable following manufacturer’s instructions but may require optimization.\ntable:files/protocols_protocol_582_1.csv\n∗sequence of forward primer (Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/582-Mmc1.xlsx]): 5′-CATCGAGCAGATCAGCGAGT-3′\n∗∗sequence of reverse primer (Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/582-Mmc1.xlsx]): 5′-CGATCCGTGTCTCGTACAGG-3′\ntable:files/protocols_protocol_582_2.csv\n∗sequence of forward primer (Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/582-Mmc1.xlsx]): 5′-AAGCCTGAACTCACCGCTAC-3′\n∗∗sequence of reverse primer (Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/582-Mmc1.xlsx]): 5′-TTGGGAATCCCCGAACATGG-3′\nRun PCRs with the following conditions:\ntable:files/protocols_protocol_582_3.csv\nNote: if alternative DNA polymerases are used, follow manufacturer’s instructions for cycling conditions.\nAgarose gel analysis: run PCR products in a 1% agarose gel with HyperLadder IV (Biolane, BIO-33029). The expected band size for a clone expressing dCas9-VP64_Blast is 275 bp and for MS2-p65-HSF1_Hygro is 672 bp. No bands should be observed in the PCR product from genomic DNA of non-trasduced mESCs (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/582-Fig1.jpg\nFigure 1. Screening for genomic integrations of dCas9-VP64_Blast and MS2-p65-HSF1 by PCR and agarose gel electrophoresis (step 12d)",
    "Agarose gel electrophoresis (1% agarose) showing the products resulting from PCR on genomic DNA from selected clones using the primers and conditions described in step 12, designed to amplify a region within dCas9-VP64_Blast integration (top panel) and a region within MS2-p65-HSF1_Hygro integration (bottom panel). The ladder used is HyperLadder IV (Biolane, BIO-33029); the numbers reflect different clones; the PCR positive controls (+) were plasmid DNA of dCas9-VP64_Blast (top panel) or plasmid DNA of MS2-p65-HSF1_Hygro (bottom panel); the PCR negative controls (-) were genomic DNA from the parental line (non-transduced) E14 mESCs; non-clonal (NC) shows the PCR product from the respective polyclonal line. The expected band size for a clone containing dCas9-VP64_Blast integrations is 275 bp and for MS2-p65-HSF1_Hygro is 672 bp. Asterisks above numbers indicate that those clones show clear bands of the right size to be selected for both dCas9-VP64_Blast and MS2-p65-HSF1_Hygro integrations. See also Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/582-Mmc1.xlsx] for primer sequences.\nVerify dCas9-VP64 and MS2-p65-HSF1 mRNA expression by q-RT-PCR in clones containing both dCas9-VP64_Blast and MS2-p65-HSF1_Hygro genomic integrations, as identified in step 12d, using the RNA extracted in step 11. Include non-transduced mESCs as a negative control.\nTreat 2 μg of RNA from each sample with DNaseI (Thermo Fisher Scientific, EN0521), following manufacturer’s instructions, to remove any contaminating genomic DNA.\nPerform cDNA synthesis from 0.5 μg DNaseI-treated total RNA from each sample using RevertAid First-Strand cDNA synthesis kit (Thermo Fisher Scientific, K1622), following manufacturer’s instructions with the following specifications:\nTemplate RNA: 0.5 μg of DNaseI-treated total RNA.\nPrimer: random hexamer.\nDilute the cDNA from each sample by adding 180 μl of nuclease-free water to the 20 μl of cDNA obtained in step 13b, to a total volume of 200 μl.",
    "Perform a q-RT-PCR using Brilliant III SYBR master mix (Agilent Technologies, 600882), following manufacturer’s instructions. Set up four reactions for each cDNA with the following primers, in technical triplicates (Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/582-Mmc1.xlsx] for primer sequences):\nGapdh (house-keeping gene control):\nForward primer: 5′-GGTGGTGAAGCAGGCATCT-3′\nReverse primer: 5′-CGGCATCGAAGGTGGAAGA-3′\nCycloB1 (house-keeping gene control):\nForward primer: 5′-GACAGACAGCCGGGACAAGC-3′\nReverse primer: 5′-GGGGATTGACAGGACCCACA-3′\ndCas9-VP64:\nForward primer: 5′-AACCTATGCCCACCTGTTCG-3′\nReverse primer: 5′-AGGATTGTCTTGCCGGACTG-3′\nMS2-p65-HSF1:\nForward primer: 5′-CTGGGAGAGGGCTCCTACTT-3′\nReverse primer: 5′-TCATGGTTGGGCCAGGATTC-3′\nQuantify relative levels of dCas9-VP64 and MS2-p65-HSF1 by the comparative CT method with normalization to average Gapdh and CycloB1 levels. Clones with high expression of dCas9-VP64 and MS2-p65-HSF1 should have a fold change of >1000 in relative expression to non-transduced mESCs (Figure 2[href=https://www.wicell.org#fig2]). These are referred to as SAM mESC clonal lines.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/582-Fig2.jpg\nFigure 2. dCas9-VP64 and MS2-p65-HSF1 expression of two SAM mESC clones compared to the parental line E14, analyzed by q-RT-PCR (step 13e)\nAnalysis of dCas9-VP64 (green) and MS2-p65-HSF1 (pink) relative mRNA levels by q-RT-PCR in two different SAM mESC clones against its parental (non-transduced) cell line E14. Each clone was analyzed in three experimental replicates and the q-RT-PCR performed in two technical replicates. Data are shown as relative expression to the parental line E14 mESCs, after normalization of each transgene’s CT values to average CT values of the house-keeping genes Gapdh and CycloB1. Each dot represents the value for each experimental replicate, and bars represent mean plus and minus standard deviation. The dotted horizontal line at y=1000 indicates the minimum relative expression of both dCas9-VP64 and MS2-p65-HSF1 that a clone should have to be selected for further characterization and/or use in a screen. In this example, clone 22 was selected over clone 7. See also Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/582-Mmc1.xlsx] for primer sequences.",
    "Although not strictly necessary, we highly recommend performing RNA-seq on 2–3 clones selected as positive for genomic DNA integrations and mRNA expression of both dCas9-VP64 and MS2-p65-HSF1, as well as non-transduced mESCs as a control. This experiment will help ensuring that the selected SAM mESC clonal line to be used for screening is similar to the parental line and global gene expression has not been altered as a result of dCas9-VP64_Blast and MS2-p65-HSF1_Hygro lentiviral transduction and antibiotic selection.\nConstruct RNA-seq libraries using the TruSeq Stranded Total RNA Library Prep Human/Mouse/Rat Kit (Illumina, 20020596), starting with 1 μg of DNaseI-treated RNA and following manufacturer’s instructions.\nSequence at a coverage of 10–20 million reads per sample, 50 bp single-end reads.\nVerify dCas9-VP64 and MS2-p65-HSF1 expression in the positive clones, compared to non-transduced mESCs (Figure 3[href=https://www.wicell.org#fig3]).\nPerform differential gene expression analysis using DESeq2 and EdgeR for each clone, normalized to non-transduced mESCs.\nSelect a clone with none or few differentially expressed genes compared to non-transduced mESCs (Figure 3[href=https://www.wicell.org#fig3]). This clone will be used to perform the screen (referred to as SAM mESCs).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/582-Fig3.jpg\nFigure 3. Transcriptome of two SAM mESC clones compared to the parental line E14 (step 14)",
    "Scatterplots showing normalized gene expression in log2 reads per million (RPM) of two different SAM mESC clones against its parental (non-transduced) cell line E14 (top panels), as well as scatterplot between two replicates of non-transduced E14 (bottom panel), analyzed by RNA-sequencing, highlighting dCas9-VP64 and MS2-p65-HSF1 transcripts in black and differentially expressed endogenous genes (DEGs) in blue. The transcriptome analysis was done with two replicates of each SAM mESC clone and three replicates of E14. DEGs were determined using DESeq2 (FDR<5%), EdgeR (FDR<5%) and intensity difference filter (FDR<5%), with the high-confidence DEGs defined as the intersection between the three statistical tests and a log2 fold change >2. In this example, clone 22 was selected over clone 7 due to having less DEGs and, by q-RT-PCR, showing higher relative expression levels of dCas9-VP64 and MS2-p65-HSF1 (see also Figure 2[href=https://www.wicell.org#fig2]).",
    "Optional: before embarking on a screen, we highly recommend performing pilot studies by testing CRISPRa with individual sgRNAs targeting 2–5 genes of interest, as well as non-targeting controls, in 2–3 selected SAM mESC clones. After doing these experiments, the screen can be performed in the clone that shows the most robust and highest CRISPRa efficiencies. To do that, 1) design and clone individual sgRNAs into the lentiviral backbone CROP-sgRNA-MS2 (Addgene #153457), following the steps 69–80 described in Joung et al., 2017[href=https://www.wicell.org#bib3]; 2) generate sgRNA lentiviruses, following steps 1–5 of this protocol; 3) titer sgRNA lentiviruses in a clone of SAM mESCs, following steps 15–27 of this protocol; 4) transduce and select sgRNA lentiviruses targeting genes of interest as well as non-targeting controls at a MOI<0.3 into the different SAM mESC clones that are to be tested, following steps 28–33 of this protocol; 5) harvest RNA 7–10 days after sgRNA transduction, following steps 10b and 11 of this protocol; 6) perform q-RT-PCR with custom primers and/or RNA-seq, following steps 13 and 14 of this protocol, to compare levels of target gene activation across the different SAM mESC clones, normalized to respective non-targeting sgRNA samples. Here, we provide some positive control sgRNA sequences that induce high and robust target gene activation in SAM mESCs, as well as non-targeting control sgRNAs:\ntable:files/protocols_protocol_582_4.csv\nOptional: if special conditions are to be applied during the screen, such as differentiation protocols or drug treatments, it is recommended that these conditions are tested across different SAM mESC clones in comparison to parental mESCs, to verify that the selected clones behave as expected.\nLentiviral titration of custom sgRNA library in SAM mESCs\nTiming: 1–2 weeks",
    "After a clone of SAM mESCs is selected for the screen, the functional titer of the lentiviral custom sgRNA library needs to be calculated in the selected clone so that the screen is then performed at a low MOI.\nIf required, thaw the selected clone of SAM mESCs, passage at least twice and culture in serum/LIF media containing 20 μg/mL blasticidin (InvivoGen, ant-bl-1) and 200 μg/mL hygromycin (InvivoGen, ant-hg-1) for 5 days before proceeding to the next step, to ensure expression of dCas9-VP64 and MS2-p65-HSF1.\nTrypsinize a confluent plate of SAM mESCs and count the cell suspension. In preparation for seeding 120,000 cells per well in 780 μl of serum/LIF culture media in 8 gelatinized wells of a 24-well plate, count 1.08 million cells (9× 120,000 cells, i.e., counting for an extra well to account for pipetting errors) and spin down 300 × g for 3 min at room temperature (20°C–25°C). Discard supernatant and resuspend cell pellet in 7.02 mL of serum/LIF culture media (9× 780 μl).\nAdd polybrene (Millpore, TR-1003-G) to the 7.02 mL of cell suspension to a final concentration of 8.2 μl/mL.\nAdd 780 μl of cell suspension + polybrene per well to 8 gelatinized wells of a 24-well plate.\nThaw 1 aliquot of the lentiviral custom sgRNA library from step 5e on ice.\nAdd custom sgRNA library lentivirus and/or additional serum/LIF culture media to individual wells of the 24-well plate of SAM mESCs prepared in step 18, as follows:\nWell 1: 20 μl lentivirus\nWell 2: 10 μl lentivirus + 10 μl serum/LIF media\nWell 3: 5 μl lentivirus + 15 μl serum/LIF media\nWell 4: 2.5 μl lentivirus + 17.5 μl serum/LIF media\nWell 5: 1.25 μl lentivirus + 18.75 μl serum/LIF media\nWell 6: 0.625 μl lentivirus + 19.375 μl serum/LIF media",
    "Well 7: 20 μl serum/LIF media. This non-transduced well will be used as a +antibiotic (puromycin) selection or kill control.\nWell 8: 20 μl serum/LIF media. This well will be used as a non-transduced no-antibiotic control.\nNote: the final volume in each well is 800 μl, making the final concentration of polybrene 8 μl/mL.\nMix each well thoroughly by pipetting up and down and return plate to incubator (37°C in 5% CO2).\nAfter 24 h, remove media from each well, wash twice with PBS and add 800 μl of fresh serum/LIF culture media. Troubleshooting 1[href=https://www.wicell.org#sec6.1]\nApproximately 24 h later (approximately 48 h after transduction), trypsinize and expand cells from each individual well to a gelatinized well from a 6-well plate with 2 mL of serum/LIF media per well.\nApproximately 24 h later (approximately 72 h after transduction), prepare cells for mCherry flow cytometry analysis:\nPrepare ice-cold PBS containing 0.1% FBS.\nTrypsinize cells.\nRe-plate half of the cells per condition in a gelatinized well of a 6-well plate. These cells will be used to test antibiotic selection.\nWith the rest of the cells, count approximately 0.5 million cells per condition and spin them down at 300 × g for 3 min at room temperature (20°C–25°C). Resuspend pellet in 500 μl ice-cold PBS containing 0.1% FBS.\nPass cells through a 40 μm cell strainer (Falcon, 352340) into a 5 mL round bottom tube for flow cytometry analysis.\nAdd 1 μg/mL of DAPI and incubate for 15 min at room temperature (20°C–25°C).",
    "Perform flow cytometry analysis gating on live cells expressing the lentiviral custom sgRNA library (DAPI-/mCherry+). Set the mCherry+ gate using the non-transduced no-antibiotic control condition, calculate the percentage of mCherry+ cells and determine the MOI of each transduced condition (Figures 4[href=https://www.wicell.org#fig4] and 5[href=https://www.wicell.org#fig5]). For the purpose of this protocol, we calculate MOI of the custom sgRNA library as the percentage of mCherry+ cells at this step, i.e., 10% mCherry+ cells translates into an MOI of 0.1.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/582-Fig4.jpg\nFigure 4. Flow cytometry gating strategy (steps 25, 27, 31 g, and 32 b)\nFlow cytometry scatterplots and histograms showing a representative gating strategy for steps 25, 27, 31 g, and 32 b. After gating on single cells, DAPI- cells are selected (viable cells) and, within those, mCherry fluorescence is analyzed. mCherry+ gate should be set based on a control of non-transduced cells.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/582-Fig5.jpg\nFigure 5. mCherry histograms for lentiviral custom sgRNA library titration, analyzed by flow cytometry (step 25)\nFlow cytometry histograms showing expression of mCherry in SAM mESCs transduced with different volumes of a custom sgRNA library cloned into CROP-sgRNA-MS2 backbone, analyzed three days after transduction and prior to puromycin selection; percentages of cells transduced (expressing mCherry) are shown.\nTo verify selection of transduced cells, 4–5 h after step 24c (or once cells have settled down and attached to the plate), replace media with serum/LIF media containing 1 μg/mL puromycin (InvivoGen, ant-pr-1) to the wells with transduced cells and to the non-transduced +antibiotic control condition. Do not add puromycin to the non-transduced no-antibiotic control well.",
    "The transduced cells have been selected for expression of the custom sgRNA library when there are no viable cells in the non-transduced +antibiotic control condition (likely to occur 3–4 days after addition of puromycin). To verify selection, repeat the flow cytometry analysis following steps 24–25. At this point, all transduced conditions should have 95%–100% mCherry+ cells (Figure 6[href=https://www.wicell.org#fig6]). Troubleshooting 4[href=https://www.wicell.org#sec6.7]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/582-Fig6.jpg\nFigure 6. mCherry histograms for lentiviral custom sgRNA library titration and puromycin selection, analyzed by flow cytometry (step 27)\nFlow cytometry histograms showing expression of mCherry in SAM mESCs transduced with different volumes of a custom sgRNA lentiviral library cloned into CROP-sgRNA-MS2 backbone, and selected for 4 days with 1 μL/mL puromycin; percentages of cells transduced and selected (expressing mCherry) are shown.\nLentiviral transduction and screening\nTiming: 2 weeks to several weeks depending on screening conditions\nAfter titrating the lentiviral custom sgRNA library, the library is transduced into SAM mESCs at a MOI<0.3 and the screen is carried out in basal conditions (serum/LIF media) or applying specific screening conditions. These conditions should be optimized on a case-by-case basis. Here, we describe the steps to perform CRISPRa screens in basal conditions:\nIf required, thaw SAM mESCs, passage at least twice and culture in serum/LIF media containing 20 μg/mL blasticidin (InvivoGen, ant-bl-1) and 200 μg/mL hygromycin (InvivoGen, ant-hg-1) for 5 days prior to commencing screening to ensure expression of dCas9-VP64 and MS2-p65-HSF1.",
    "Calculate the number of cells needed for transduction to maintain a representation of 1000 cells per sgRNA at a MOI<0.3. For example: for a library of 500 sgRNAs, a total of 500,000 cells are needed to maintain library representation throughout the screen; considering a MOI of 0.1 (i.e., 10% mCherry+ cells after transduction and prior to puromycin selection), 5 million cells need to be transduced so that, after antibiotic selection, 500,000 cells remain.\nNote: while a final representation of 500 cells per sgRNA might suffice, an additional 0.4–1 million cells are required for the flow cytometry analyses described in steps 31 and 32b; therefore, we recommend, if possible, to aim for a representation of 1000 cells per sgRNA.\nTransduce the lentiviral custom sgRNA library at a MOI<0.3 into the number of SAM mESCs calculated in step 29. For a medium-scale screen (library of approximately 500 sgRNAs), we recommend using a 150 mm gelatinized cell culture plate with a total of 20 mL of serum/LIF culture media.\nCalculate the volume of lentivirus required to transduce the required number of cells at a MOI<0.3 (i.e., <30% mCherry+ cells after transduction and prior to puromycin selection), based on calculations performed in step 25.\nNote: for instance, if for the titration experiment described in steps 15–25 with 120,000 mESCs, 10 μl of lentivirus resulted in a MOI of 0.15 (i.e., 15% mCherry+ cells), and the number of cells calculated for transduction in step 29 was 5 million, the amount of lentivirus to use in this step would be (5 × 106 cells × 10 μl) / 1.2 × 105 cells in titration experiment = 416.67 μl.\nThaw the required number of aliquots of the lentiviral preparation of custom sgRNA library cloned into CROP-sgRNA-MS2, from step 5e, on ice.",
    "Trypsinize a confluent plate of SAM mESCs, count the cell suspension and obtain the number of cells calculated in step 29. Spin down 300 × g for 3 min at room temperature (20°C–25°C), discard supernatant and resuspend pellet in 1 mL of serum/LIF media.\nCritical: we recommend using low-passage SAM mESCs (<10 passages), especially if differentiation protocols are to be applied during screening.\nTo the resuspended cell pellet, add the volume of lentivirus calculated in step 30a. Mix thoroughly by pipetting up and down.\nTop up with serum/LIF media to the appropriate final volume to be used in the tissue culture plate (see step 4 of “before you begin” section for appropriate final volumes in different cell culture plates).\nAdd 8 μg/mL polybrene (Millpore, TR-1003-G) and mix gently by pipetting.\nSeed cells resuspended in the lentiviral mix + polybrene in the appropriate gelatinized cell culture plate. Return plate to incubator (37°C in 5% CO2).\nPlate two additional 100 mm plates with 2.5 million SAM mESCs to be used as 1) non-transduced +antibiotic selection control and 2) non-transduced no-antibiotic control. Add 8 μg/mL polybrene (Millpore, TR-1003-G) and mix gently.\n24 h after transduction, remove media, wash twice with PBS and add fresh serum/LIF culture media.\nAfter 48 h (72 h after transduction), verify low MOI. Prepare both the transduced cells and the non-transduced no-antibiotic control for mCherry flow cytometry analysis:\nPrepare ice-cold PBS containing 0.1% FBS.\nTrypsinize cells.\nCount 0.2–0.5 million cells to be used for flow cytometry analysis and re-plate the rest of the cells in an appropriate gelatinized cell culture plate in serum/LIF media.\nWith the cells to be used for flow cytometry analysis, spin them down at 300 × g for 3 min at room temperature (20°C–25°C). Resuspend pellet in 200–500 μl ice-cold PBS containing 0.1% FBS.",
    "Pass cells through a 40 μm cell strainer (Falcon, 352340) into a 5 mL round bottom tube for flow cytometry analysis.\nAdd 1 μg/mL of DAPI and incubate for 15 min at room temperature (20°C–25°C).\nPerform flow cytometry analysis gating on live cells expressing the lentiviral custom sgRNA library (DAPI-/mCherry+). Set the mCherry+ gate using the non-transduced control (Figure 4[href=https://www.wicell.org#fig4]). Verify MOI<0.3 based on the percentage of mCherry+ cells.\nSelect cells with puromycin for expression of the custom sgRNA library:\n4–5 h after step 31c (or once cells have settled down and attached to the plate) and after verifying cells were transduced at a MOI<0.3, replace media with serum/LIF media containing 1 μg/mL puromycin (InvivoGen, ant-pr-1) to the transduced cells and to non-transduced +antibiotic control condition. Do not add puromycin to the non-transduced no-antibiotic control.\nThe transduced cells have been selected for expression of the custom sgRNA library when there are no viable cells in the non-transduced +antibiotic control condition (likely to occur 3–4 days after addition of puromycin). To verify selection, repeat the flow cytometry analysis following step 31. At this point, 95%–100% of cells from the transduced condition should be mCherry+. Troubleshooting 4[href=https://www.wicell.org#sec6.7]\nAfter selection is complete, proceed to step 34. Alternatively, depending on screening conditions, cells can be cultured for longer, subjected to differentiation protocols, drug treatments, or similar.\nNote: We have tested efficient target gene activation by CRISPRa SAM as early as day 6 post-sgRNA transduction and up to 15 days post-sgRNA transduction. However, the optimal time point to harvest cells in the screen needs to be determined in pilot studies using sgRNAs targeting genes of interest with known biological function, by testing the optimal time point of target gene activation and expected downstream transcriptional changes.",
    "Harvest of perturbed cells and sample preparation for 10× Genomics scRNA-seq\nTiming: 1–1.5h\nCells are harvested and prepared to run in the 10× Genomics Chromium Controller. It is critical to ensure a clean and highly viable single-cell suspension for optimal formation of single-cell droplets or GEMs.\nPrepare ice-cold PBS containing 0.1% FBS, and cool-down a centrifuge with 15 and/or 50 mL tube buckets to 4°C.\nRemove media and wash cells twice with room temperature (20°C–25°C) PBS.\nTrypsinize cells very briefly (2–3 min) and then add serum/LIF media.\nFor a 100 mm plate, use 1 mL of trypsin and 3 mL of serum/LIF media.\nFor a 150 mm plate, use 3 mL of trypsin 9 mL of serum/LIF media.\nCritical: do not trypsinize cells for any longer than necessary as this can affect viability.\nGently mix cells by pipetting up and down to obtain a single-cell suspension. Check cells are properly detached and dissociated under a microscope.\nCritical: clumps of cells will lead to blockages in the 10× Genomics Chromium Controller run, therefore, it is critical to ensure colonies are well dissociated.\nFurther inactivate trypsin with extra serum/LIF media and gently mix by pipetting up and down.\nFor a 100 mm plate, use 6 mL of serum/LIF media to obtain a final single-cell suspension of 10 mL.\nFor a 150 mm plate, use 13 mL of serum/LIF media to obtain a final single-cell suspension of 25 mL.\nTransfer cell suspension to a 15 or 50 mL tube and spin down 300 × g for 3 min at 4°C.\nResuspend cell pellet in 1 mL of ice-cold PBS containing 0.1% FBS.\nPass cell suspension through a 40 μm cell strainer (Falcon, 352340) into a new 15 mL tube.\nRepeat step 41.",
    "Critical: steps 40 and 41 are critical to ensure a clean single-cell suspension.\nKeep cells on ice and count cell suspension using a viability dye. Make appropriate dilutions for counting if needed.\nNote: we recommend counting cells using an automated cell counter with a viability read-out.\nCritical: aim for very accurate cell counting. We recommend counting three different aliquots of each cell suspension/dilution, with two counts for each aliquot.\nCritical: do not proceed with cell suspensions that show <90% viability as this will result in poor scRNA-seq results. Troubleshooting 5[href=https://www.wicell.org#sec6.9]\nDilute counted cell suspension in PBS containing 0.1% FBS, or concentrate cells by centrifugation (300 × g for 3 min at 4°C) to obtain a cell suspension of 700–1200 cells /mL, in ice-cold PBS containing 0.1% FBS. Keep cells on ice. Immediately proceed to step 45.\nCritical: to maintain >90% viability, it is critical to work fast during sample counting and dilution and to not exceed 1.5h from cell trypsinization (step 36) to loading in the 10× Genomics Chromium Controller (step 45). It is also critical to keep cell suspensions on ice.\nConstruction of 10× Genomics scRNA-seq libraries and sgRNA amplicon libraries\nTiming: 2–4 days\n3′ scRNA-seq 10× Genomics libraries are constructed following manufacturer’s instructions. Additionally, a custom PCR enrichment is performed to amplify sgRNA-containing fragments and construct sgRNA amplicon libraries. Targeted amplification of sgRNAs is based on the strategy described in Hill et al., 2018[href=https://www.wicell.org#bib2], which improves the sgRNA-cell assignment rate.\nNote in Alda-Catalinas et al., 2020[href=https://www.wicell.org#bib1], 10× Genomics single cell 3′ v2 kits were used to build the scRNA-seq libraries. However, these kits are no longer available and so the latest version of 3′ kits (v3.1 at the time of publication) need to be used (https://support.10xgenomics.com/single-cell-gene-expression/library-prep/doc/user-guide-chromium-single-cell-3-reagent-kits-user-guide-v31-chemistry[href=https://support.10xgenomics.com/single-cell-gene-expression/library-prep/doc/user-guide-chromium-single-cell-3-reagent-kits-user-guide-v31-chemistry]).",
    "Run the single-cell suspension generated in step 44 in the 10× Genomics Chromium Controller using 3′ v3.1 kits and protocol (https://support.10xgenomics.com/single-cell-gene-expression/library-prep/doc/user-guide-chromium-single-cell-3-reagent-kits-user-guide-v31-chemistry[href=https://support.10xgenomics.com/single-cell-gene-expression/library-prep/doc/user-guide-chromium-single-cell-3-reagent-kits-user-guide-v31-chemistry]), following manufacturer’s instructions.\nCritical: the number of single cells that need to be sequenced and, consequently, the number of cells to load per lane in the 10× Genomics Chromium chip and total number of lanes/chips to run, depends on screening conditions and downstream transcriptional response to be captured. In Alda-Catalinas et al., 2020[href=https://www.wicell.org#bib1], we generated 10× Genomics scRNA-seq libraries for on average 437 cells per sgRNA. This number was calculated using pilot studies. We recommend performing similar pilot studies for the biological process of interest, or to use prior knowledge, to determine the number of cells that need to be sequenced per sgRNA to have sufficient coverage of the expected transcriptional response. This is crucial to determine the total number of perturbed cells that need to be loaded across one or multiple 10× Genomics Chromium chips.\nFollow the manufacturer’ s protocol (https://support.10xgenomics.com/single-cell-gene-expression/library-prep/doc/user-guide-chromium-single-cell-3-reagent-kits-user-guide-v31-chemistry[href=https://support.10xgenomics.com/single-cell-gene-expression/library-prep/doc/user-guide-chromium-single-cell-3-reagent-kits-user-guide-v31-chemistry]) up to step 2.4a (cDNA quality control and quantification).\nFollowing cDNA quantification, for each 10× Genomics sample/lane, set aside 10 ng of the full-length cDNA obtained after step 2.3m of the manufacturer’s protocol. These 10 ng cDNA samples will be used to construct sgRNA amplicon libraries, as described in step 49 of this protocol.\nContinue to build the 3′ gene expression libraries with 10 μL of the full-length cDNA , following steps 3.1–3.7 of the manufacturer’ s protocol (https://support.10xgenomics.com/single-cell-gene-expression/library-prep/doc/user-guide-chromium-single-cell-3-reagent-kits-user-guide-v31-chemistry[href=https://support.10xgenomics.com/single-cell-gene-expression/library-prep/doc/user-guide-chromium-single-cell-3-reagent-kits-user-guide-v31-chemistry]).\nConstruct a sgRNA amplicon library for each 10× Genomics sample/lane, using the 10 ng full-length cDNA sample(s) saved in step 47 of this protocol. These libraries are built using three rounds of semi-nested PCR amplification, monitored by KAPA SYBR.",
    "Note: the PCR reactions described below to build sgRNA amplicon libraries are compatible with full-length cDNA generated using 3′ scRNA-seq v2/v3/v3.1 10× Genomics kits, but might not be compatible with future versions of 3′ scRNA-seq kits if the chemistry is modified by 10× Genomics.\nPrepare a master-mix for PCR1 on ice using the following reagents and volumes. Prepare a PCR reaction for each cDNA sample in a 96-well or 384-well plate:\ntable:files/protocols_protocol_582_5.csv\n∗sequence of forward primer (Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/582-Mmc1.xlsx]): TTTCCCATGATTCCTTCATATTTGC (primes an outer part of the U6 promoter).\n∗∗sequence of reverse primer (Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/582-Mmc1.xlsx]): CTACACGACGCTCTTCCGATCT (partial TruSeq Read 1 primer).\nRun PCR in a q-RT-PCR-compatible instrument, with the following conditions:\ntable:files/protocols_protocol_582_6.csv\nPurify the resulting reactions using 1× AMPure XP beads (Beckman Coulter, A63881):\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/582-Fig7.jpg\nFigure 7. qPCR monitoring of sgRNA amplicon libraries (steps 49b, 49f, 49j)\nRelative fluorescent units (RFU, y axis) vs number of qPCR cycles (x axis) in each of the three semi-nested PCRs on barcoded sgRNAs using 10× Genomics full-length cDNA of SAM mESCs transduced with a custom CROP-sgRNA-MS2 lentiviral library. Each line represents a different 10× Genomics cDNA sample obtained from the same cell suspension. qPCRs were performed with KAPA SYBR in a CFX384 Touch Real-Time PCR Detection System machine. Following amplification at real-time on the instrument screen, the reactions were stopped before reaching a steady state of amplification. See also Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/582-Mmc1.xlsx] for primer sequences.\nObtain AMPure XP beads from 4°C storage and warm to room temperature (20°C–25°C) for 30 min.\nIf required, recover the PCR products from the q-RT-PCR plate into PCR tube strips or into a 96-well plate.\nTo each PCR product, add 10 μl of nuclease-free water.\nVortex to resuspend the AMPure XP beads.\nAdd 20 μl AMPure XP beads (1×) to each sample and mix by pipetting up and down 10 times.",
    "Incubate 15 min at room temperature (20°C–25°C) to allow DNA to bind the beads.\nPlace PCR tube strip or 96-well plate on an appropriate magnetic stand until the solution clears.\nRemove and discard supernatant(s).\nAdd 100 μl of 80% ethanol to each pellet. Wait 30 s.\nRemove the ethanol.\nRepeat ethanol wash (steps ix and x) for a total of 2 washes.\nCentrifuge PCR tube strip or 96-well plate briefly and place back on appropriate magnetic stand.\nRemove any remaining ethanol from each sample and air dry for 1–2 min.\nCritical: Do not air dry for longer than 2 min; an over-dried pellet can result in decreased elution efficiency.\nRemove PCR tube strip or 96-well plate from the magnet.\nAdd 21 μl of nuclease-free water to each sample and mix by pipetting up and down 10 times.\nIncubate 10 min at room temperature (20°C–25°C).\nPlace the PCR tube strip or 96-well plate on the magnet until the solution clears.\nFor each sample, transfer 20 μl of the supernatant containing the purified PCR product to a new PCR tube strip or well of 96-well.\nPrepare 1:25 dilutions for each purified PCR1 product by adding 1 μl of sample to 24 μl of nuclease-free water. The remaining PCR1 sample can be stored long-term at −20°C.\nPrepare a master-mix for PCR2 on ice using the following reagents and volumes. Prepare a PCR reaction for each sample in a 96-well or 384-well plate using as input 1 μl of the 1:25 dilution of purified PCR1 product from step 49d:\ntable:files/protocols_protocol_582_7.csv\n∗sequence of forward primer (Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/582-Mmc1.xlsx]): GTCTCGTGGGCTCGGAGATGTGTATAAGAGACAGCTTGTGGAAAGGACGAAACAC (primes on the U6 promoter adjacent to the sgRNA protospacer sequence and adds a standard Nextera Read 2 primer).\n∗∗sequence of reverse primer (Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/582-Mmc1.xlsx]): AATGATACGGCGACCACCGAGATCTACACTCTTTCCCTACACGACGCTC (adds the remainder of TruSeq Read 1 and the adapter P5).",
    "Run PCR in a q-RT-PCR-compatible instrument, with the following conditions:\ntable:files/protocols_protocol_582_8.csv\nPurify the resulting reactions using 1× AMPure XP beads (Beckman Coulter, A63881), following step 49c.\nPrepare 1:25 dilutions for each purified PCR2 product by adding 1 μl of sample to 24 μl of nuclease-free water. The remaining PCR2 sample can be stored long-term at −20°C.\nPrepare a master-mix for PCR3 on ice using the following reagents and volumes. Prepare a PCR reaction for each sample in a 96-well or 384-well plate using as input 1 μl of the 1:25 dilution of purified PCR2 product from step 49 h:\ntable:files/protocols_protocol_582_9.csv\n∗sequence of forward primer: Nextera XT P7 index in the form of: CAAGCAGAAGACGGCATACGAGAT-[8 bp Index]-GTCTCGTGGGCTCGG. These adaptors can be obtained from the Illumina kits “Nextera XT Index Kit” (Illumina, FC-131-2001, FC-131-2002, FC-131-2003, FC-131-2004 or FC-131-1001).\n∗∗sequence of reverse primer (Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/582-Mmc1.xlsx]): AATGATACGGCGACCACCGAGATCTACACTCTTTCCCTACACGACGCTC (same reverse primer from PCR2).\nCritical: to pool sgRNA amplicon libraries from different samples for multiplexed sequencing, follow Illumina’s index adapters pooling guide (https://support.illumina.com/content/dam/illumina-support/documents/documentation/chemistry_documentation/experiment-design/index-adapters-pooling-guide-1000000041074-10.pdf[href=https://support.illumina.com/content/dam/illumina-support/documents/documentation/chemistry_documentation/experiment-design/index-adapters-pooling-guide-1000000041074-10.pdf]). If sgRNA amplicon libraries are going to be sequenced together with 3′ scRNA-seq gene expression libraries, make sure appropriate index sets are used to ensure no index overlap in the multiplexed pool.\nRun PCR in a q-RT-PCR-compatible instrument, with the following conditions:\ntable:files/protocols_protocol_582_10.csv\nPurify the resulting reactions using 1× AMPure XP beads (Beckman Coulter, A63881), following step 49c. These are the final sgRNA amplicon libraries.\nRun 1 μL of each of the resulting sgRNA amplicon libraries at 1:10 dilution on an Agilent Bioanalyzer High Sensitivity chip (Agilent, #5067-4626), following manufacturer’s instructions. The expected size of the sgRNA amplicon is approximately 520 bp (Figure 8[href=https://www.wicell.org#fig8]). Troubleshooting 6[href=https://www.wicell.org#sec6.11]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/582-Fig8.jpg\nFigure 8. Bioanalyzer traces of final sgRNA amplicon libraries (step 49l)",
    "Bioanalyzer electropherogram showing fluorescence units (FU, y axis) vs fragment size in base pairs (bp, x axis) of a representative sgRNA amplicon library of SAM mESCs transduced with a custom CROP-sgRNA-MS2 lentiviral library. Numbers above electropherogram peaks indicate the size in bp of detected fragments, including a lower molecular weight marker of 35 bp (green) and a higher molecular weight marker of 10,380 bp (purple). sgRNA amplicon libraries derived from cells transduced with CROP-sgRNA-MS2 constructs generate amplicons of approximately 520 bp.\nSequencing\nTiming: 1–4 days\nThe resulting 10× Genomics 3′ scRNA-seq gene expression libraries and sgRNA amplicon libraries are Illumina paired-end constructs which contain P5 and P7 adaptors, an 8 bp sample index, a 16 bp 10× Genomics cell barcode and a 12 bp UMI. The 3′ gene expression libraries contain TruSeq Read 1 and TruSeq Read 2 adapters as primers sites for paired-end sequencing, whereas the sgRNA amplicon libraries contain TruSeq Read 1 and Nextera Read 2 as primer sites. TruSeq Read 1 is used to sequence the 10× Genomics cell barcode and UMI using 28 cycles, both in the 3′ gene expression and sgRNA amplicon libraries. TruSeq Read 2 is used to read the 3′ end of transcripts using 91 sequencing cycles in the 3′ gene expression libraries, whereas Nextera Read 2 is used to read the sgRNA protospacer in the sgRNA amplicon libraries. The i7 read is used to sequence the sample index in both library types.\nWe recommend following 10× Genomics guidance to sequence 3′ gene expression libraries on an Illumina sequencer (https://support.10xgenomics.com/single-cell-gene-expression/library-prep/doc/user-guide-chromium-single-cell-3-reagent-kits-user-guide-v31-chemistry[href=https://support.10xgenomics.com/single-cell-gene-expression/library-prep/doc/user-guide-chromium-single-cell-3-reagent-kits-user-guide-v31-chemistry]) with a minimum sequencing depth of 20,000 read pairs per cell (30,000 read pairs per cell is preferable) and 28 cycles for Read 1, 8 cycles for i7 index, 0 cycles for i5 index and 91 cycles for Read 2.",
    "sgRNA amplicon libraries can be pooled together with 3′ gene expression libraries for sequencing, providing no overlapping sample indexes were used (see step 49i of this protocol). Sequencing coverage for sgRNA amplicon libraries should be a minimum of 5,000 read pairs per cell. If sgRNA amplicon libraries are sequenced separately, use appropriate percentage of PhiX as these libraries have low complexity. The same sequencing parameters are used for sgRNA amplicon libraries: 28 cycles for Read 1, 8 cycles for i7 index, 0 cycles for i5 index and 91 cycles for Read 2."
  ],
  "subjectAreas": [
    "Rnaseq",
    "Stem Cells",
    "Crispr",
    "Cell Culture",
    "Gene Expression",
    "Sequencing",
    "Single Cell",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}