{
  "id": 17689,
  "origin_website": "Jove",
  "title": "Establishing In Situ Closed Circuit Perfusion of Lower Abdominal Organs and Hind Limbs in Mice",
  "procedures": [
    "All methods described here have been approved by the University of Colorado’s Institutional Animal Care and Use Committee (IACUC).\n1. Pre-heat the perfusion system\nPrepare the perfusion system before surgery by starting a 37 °C circulating water bath for all water-jacketed components (perfusate reservoir, moist chamber, and lid) as shown in a customized configuration in Figure 1A. Make sure the tubing is clean and replace if necessary. To limit perfusate volume, use a bubble trap within a moist chamber as the perfusate reservoir (Figure 1B-6).\n2. Vascular catheterization\nInduce anesthesia in an 8-10 week old BALB/c mouse using an isoflurane veterinary anesthesia machine with 3-5% isoflurane and oxygen flow rate at 0.3 L/min. As an alternative, use ketamine/xylazine or any other type of intraperitoneal anesthesia. Evaluate the depth of anesthesia by 2 methods: toe-pinch and corneal reflex.\nPrewet a 4-0 silk suture with needle in double distilled water.\nPlace the anesthetized mouse in a supine position on a Styrofoam board with the head facing the surgeon and immobilize forelimbs and hind limbs with tape. Wipe the abdomen with isopropyl alcohol and cut the abdomen along the midline in a \"T\" shape with scissors. Stop bleeding around the edge of the incision by electrocoagulation (cauterizing).\nPush the stomach, jejunum and colon to the right side of the abdomen to reveal the abdominal aorta, vena cava, and common iliac and iliolumbar arteries and veins.\nUnder a dissection microscope, find and ligate the iliolumbar artery/vein in the male, and ovarian artery/vein and the iliolumbar artery/vein in the female using 4-0 silk sutures (Figure 2 yellow lines).",
    "Under a dissection microscope, loop two 4-0 silk sutures underneath the abdominal aorta and inferior vena cava (about 1 cm above iliac artery and vein, 1 mm apart, Figure 2), and make a loose knot in the suture closest to the iliac vessels (Figure 2, white dotted line). Alternatively, a 6-0 silk suture can be used for this knot.\nUnder a dissection microscope, horizontally align and stretch both the inferior vena cava and the abdominal aorta with porte-aiguille. Use a 24 G winged shielded I.V. catheter to puncture the abdominal aorta, push the button to retract the needle core and insert the catheter about 5 mm into the vessel.\n\t\nRepeat the same procedure with the inferior vena cava and tie up knots of both sutures around the catheterized vessels.\n\t\tNOTE: The needle can easily puncture through the blood vessel; therefore, keep the vessels stretched and needle parallel with the vessel. Retract the needle core as soon as the needle penetrates about 1 mm into the vessel. The abdominal aorta is underneath the inferior vena cava and much thinner and more elastic due to being encased in connective tissue. Therefore, the aorta can “hold on” to the catheter, and should thus be catheterized before the vena cava to reduce the likelihood of the catheter slipping out.\nApply instant glue to immobilize the catheters to the erector spinae, replace the abdominal organs, and end the surgery while maintaining anesthesia.\n\tNOTE: Organs that cannot be completely replaced into the abdominal cavity will need to be periodically moistened with perfusion medium during the perfusion process.\n3. Set up the perfusion system\nTransfer the mouse into the water-jacketed moist chamber prewarmed to 37 °C on a silicon pad and immobilize the catheter wings to the pad with 19 G needles.",
    "Fill the arterial catheter’s end (inlet) with prewarmed perfusion buffer (Ringer’s lactate solution supplemented with 5% BSA), and then connect the catheter end with the inlet perfusion tubing using a screw-on connector (Figure 1B, red arrow).\n\tNOTE: Hold the connector with hemostatic forceps and immobilize the tubing with tape to avoid moving the catheters.\nAdjust the peristaltic flow rate to 0.6 mL/min and keep the perfusion outflow (Figure 1B, blue arrow) open-ended for 5-10 min to wash out the blood through the venous catheter. There will be some clots in the outlet catheter; flush out the clots with perfusate buffer before closing the perfusion circuit.\nConnect the venous catheter’s end with the outlet tubing using a screw-on connector to close the circuit (Figure 1B). At this point, perform CO2 gas euthanasia and verify by chest puncture or any other method.\nCover the moist chamber with the warmed lid. Check the level of perfusate periodically and add more if needed. Perfusion can be performed for up to 2 hours.\n\tNOTE: 5 mL of perfusate will be needed to set up the closed perfusion system. If there is no leaking or edema, the volume of perfusate will decrease by less than 1 mL and additional buffer will not be needed. To avoid edema induced by peripheral circulating thrombus, perfusion buffer containing 0.002% heparin can be used in the first 10 minutes of perfusion, but should be changed to buffer without heparin to avoid the leaking at the edge of the incisions.",
    "If needed, add a reagent of choice into the perfusion reservoir or to the injection port at any time (Figure 1B-5). For example, 10 µL of 10 mg/mL Hoechst33342 can be added into the perfusate to stain the cell nuclei 2 h before the end of perfusion, or 50 µL of 1 mg/mL DyLight 649-lectin to stain the vascular endothelial cells 30 min before the end of perfusion.\n\tNOTE: If attempting to stain bone marrow with Hoechst solution, mice will need to be pre-injected 30 minutes before surgery.\nAfter perfusion with fluorescent reagents, wash out with perfusion buffer for another 10 minutes to minimize the background fluorescence.\n4. Analysis of perfused organs\nCollect organs including testis, prostate, bladder, femur, muscle, and skin (e.g., feet). Excise a piece of organ about 1 mm3 and flatten between two glass slides.\n\t\nStudy under inverted fluorescent confocal microscope using DAPI/Cy5 excitation and emission filters (excitation lasers : DAPI, 405 nm; Cy5,640 nm). Use at least 200x magnification objective with a 0.45 numerical aperture.\nAlternatively, fix the organs with 4% formaldehyde solution for 24 h and perform hematoxylin-eosin staining19.\nTo create a bone window for intact bone marrow observation, immobilize both ends of the femur or tibia and scrape away the cortical bone with the lateral edge of a 19 G needle to expose the periosteum; take care to keep a thin layer of residual bone. Place bone on a cover slip with the window facing the glass and image with inverted fluorescent confocal microscope using DAPI and Cy5 channels as described above. The cells and vascular network in the bone marrow cavity can be readily observed.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}