{
  "id": 19155,
  "origin_website": "Jove",
  "title": "Real-time fMRI Biofeedback Targeting the Orbitofrontal Cortex for Contamination Anxiety",
  "procedures": [
    "1. Stimulus Development\nExtensive stimulus development is needed. Contamination-related and neutral images must be collected and piloted to ensure the anxiety induced by these stimuli is balanced across provocation conditions and significantly greater in the provocation conditions than in the neutral conditions. More specifically, the following four stimulus sets are needed:\nLocalizer stimuli: 300 contamination-related images and 300 neutral images are used to localize the region of the orbitofrontal cortex (OFC) involved in contamination anxiety. These must be piloted to assure that the contamination-related images provoke significantly more contamination anxiety than the neutral images (based on self-report). It is important that this is true for every pilot subject, not just across the group as a whole, as the target region of the OFC must be localized in each subject using these stimuli.\nBiofeedback stimuli: two matching sets of stimuli must be developed, each involving 3 types of stimuli. In each set 18 provocative stimuli are needed for increase blocks, 18 provocative stimuli are needed for decrease blocks, and 24 neutral stimuli are needed for neutral blocks. One set is for the first biofeedback session and the second set is for the second biofeedback session. Pilot data must be collected on the self-reported anxiety subjects experience when viewing these stimuli to ensure there is a main effect of type (related to the difference between the provocative and the neutral stimuli) but no main effect of set or type-by-set interaction.",
    "Control task stimuli: four matching stimulus sets must be developed, each including 6 provocative stimuli for the increase blocks, 6 provocative stimuli for the decrease blocks, and 8 neutral stimuli. These four sets are for the control task runs that are conducted at the beginning and ending of each of the two biofeedback sessions. Pilot data must be collected on the self-reported anxiety subjects experience when viewing these stimuli to ensure that there is a main effect of type (related to the difference between the provocative and the neutral stimuli) but no main effect of set or type-by-set interaction.\nAssessment session stimuli: 3 matching stimulus sets must be developed, each including 25 contamination images. Pilot data must be collected to ensure there is no effect of set on anxiety experienced in response to these images.\nThe stimuli used by our group include images from the Maudsley Obsessive Compulsive Symptom Set 23 and the International Affective Picture System 24, as well as photographs we took ourselves, acquired from Google images, and purchased from Bigstockphoto.com[href=http://Bigstockphoto.com], gettyimages.com[href=http://gettyimages.com], flickr.com[href=http://flickr.com], and iStockphoto.com[href=http://iStockphoto.com].\n2. Recruitment\nSubjects are screened to identify healthy individuals who can participate in magnetic resonance imaging and who report high levels of contamination anxiety and a desire to learn to control that anxiety. In particular, as part of the screening process, subjects complete the Padua Inventory-Washington Slate University Revision (PI-WSUR)25 and only those with a score of 8 or greater on the Obsessions and Washing Compulsions Subscale are included in the study. For each subject that receives true biofeedback, another subject matched in age and gender is recruited to receive sham biofeedback. Prior to participation, all subjects must give informed consent in accordance with a protocol approved by the institutional human protection program (at Yale University, this is the Human Research Protection Program).",
    "3. Protocol\nThe aim of the biofeedback protocol is to train subjects to develop greater control over the neural activity level in a region of their orbitofrontal cortex (OFC) related to contamination anxiety, so that, when they are exposed to contamination-related stimuli, they can increase or decrease neural activity in this region as they wish. We hypothesize that greater control over this brain area will give subjects greater control over their contamination-related anxiety. This ability, to consciously control the neural activity level in the OFC, is assessed based on whether subjects are able to increase and decrease the signal measured from this brain area when they are cued to increase and decrease that activity during a functional imaging session.\nSubjects come in on four separate days, scheduled at approximately half-week intervals, so that the entire study takes two weeks to complete. The flowchart for the protocol is shown in Figure 1.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3535/3535fig1.jpg\nFigure 1. Flowchart of protocol. Day 1 is shown blue, Day 2 in red, Day 3 in green and Day 4 in orange. Although not explicitly listed, each MR session also includes the collection of anatomical data in the same slice locations as the functional data and the biofeedback MR sessions include the collection of a \"functional reference scan\" used to register the target region to the functional space of that session.\n3.1 Day 1\nSubjects participate in a 1 hour magnetic resonance (MR) imaging session in a 1.5 T Seimens Sonata scanner. In every scanning session, before scanning begins, the visual display is checked to ensure that it falls entirely in the field of view of the subject and appears well focused to them.\nOn Day 1, the following data are collected:\n\t\nA high resolution structural image using a magnetization prepared rapid gradient echo (MPRAGE) sequence",
    "T1-weighted anatomical images at the same 31 slice locations as the functional data\nTwo runs of resting state functional data, each involving the collection of 152 volumes (first two discarded). A T2*-sensitive gradient-recalled single shot echo-planar pulse sequence is used for ALL functional data acquisition (TE= 30ms, FA = 80, TR = 2000ms, Bandwidth = 2604, 200mm field of view for 3.1*3.1*3.1mm3 isotropic voxels, 31 axial-oblique, AC-PC aligned slices covering all the OFC and most of the brain above). This sequence is optimized for signal in the orbitofrontal cortex by reducing the optimal TE from 45ms to 30ms and reducing slice thickness to 3.1mm both of which reduce intravoxel dephasing with only a slight decrease in BOLD sensitivity. A higher bandwidth is also used to reduce geometric distortion along the phase encode direction.\nThree localizer runs of functional data, each involving the collection of 202 volumes (first two discarded) in which the subject alternates between viewing intense contamination-related images and viewing neutral images at 40s intervals. These localizer runs are used to localize the region of the OFC activated by contamination anxiety",
    "Following the Day 1 MR imaging session, subjects meet with a clinical psychologist who has expertise in anxiety disorders for the Reappraisal Strategy Development Session. The aim of this session is to develop an individualized cognitive strategy for the subject that provides them with some initial control over activity in their orbitofrontal cortex. Scenarios that can elicit contamination anxiety are discussed and the psychologist helps the subject develop approaches for reducing their anxiety in such situations. This may involve reappraising the perceived risk of contamination, or, if they are predisposed to religious thoughts or meditative strategies, a faith based approach or one in which they \"let go\" of their anxiety may be discussed. The aim of this session is to identify one or more reappraisal strategies that the subject feels are likely to be effective in reducing their contamination anxiety across a variety of situations. Once they feel confident that effective reappraisal strategies have been identified, they will be instructed to try those strategies for lowering activity in their OFC during the biofeedback session. Conversely, for increasing activity in the OFC, they will be instructed to try to think about the possible consequences of coming into contact with the contaminated objects and to allow themselves to feel anxiety about this without engaging any reappraisal strategies. We should emphasize here that these strategies for raising/lowering OFC activity are intended only to provide some initial, limited ability to control the OFC. During the biofeedback sessions, subjects will have the chance to experiment with their cognitive strategies and receive direct feedback regarding what is more effective, thereby allowing them to develop increasing control over the OFC.",
    "During this session, the clinical psychologist also assesses whether the subject has sub-clinical contamination anxiety that affects them in everyday life- if not, they are removed from the study.",
    "The data collected in the localizer runs are analyzed after the Day 1 scanning session but prior to the Day 2 session using a GLM analysis with a task regressor computed using a vector that is one during time periods when the subject was viewing contamination pictures and zero during the remaining time periods convolved with a canonical hemodynamic response function. The t-statistic associated with the regression coefficient at each voxel is computed and the resulting tmap is smoothed using a 6mm full-width at half maximum Gaussian kernel. The resulting t-map shows which regions of the brain were more active when the subject viewed contamination-related images than when they viewed neutral images. The top 30 pixels in this t-map located within the OFC or adjacent frontal polar region (more specifically, in Brodmann's areas 10,11 or 47) are selected to represent that subject's target region of the OFC for their upcoming biofeedback scans. Thus, the laterality of the target region will vary depending on the subject's activation patterns. This region is then translated from functional space into the anatomical space via a rigid registration with nearest neighbor interpolation. A control region is also defined to include all the white matter in the brain and is translated into the same space from the MNI brain. These two regions will be used by the real-time analysis program during the Day 2 biofeedback session.\n3.2 Day 2",
    "Subjects first participate in an out-of-magnet Assessment Session. Before each Assessment Session, subjects are verbally instructed to attempt to minimize their anxiety while viewing the upcoming contamination-related images. Following, they are directed with detailed onscreen instructions to report the level of contamination-related anxiety they feel in response to the images on a scale of 1-5, with 1 corresponding to a low level of anxiety and 5 with the highest level. Galvanic skin response is simultaneously monitored.\nSubjects then participate in a 1.5 hour real-time fMRI biofeedback session.\n\t\nThe session begins with the collection of axial anatomical (T1-weighted) images in the same slice locations as the functional data.\nNext, a functional reference scan is collected. This short functional run of twelve volumes is collected, the fifth of which is kept and the remainder discarded.\nThe two regions of interest, the region of the subject's OFC activated when viewing contamination pictures as identified based from the localizer runs of Day 1 (see 3.1.3) and the white matter control region, are translated into the functional space of the current session via a concatenation of two rigid registrations. The first registration maps the regions from the anatomical space of Day 1 to the anatomical space of Day 2. The second registration maps the regions from the anatomical space of Day 2 to the space of the \"functional reference\" scan of Day 2. Once these two regions have been translated into the functional space of the current scanning session, the biofeedback can begin.",
    "While the regions are being registered, there are two functional runs collected (132 volumes collected for each run, first two discarded to allow the field to reach a steady state) that are referred to as control task runs. These runs do not involve biofeedback, but are used to assess the ability of subjects to control activity within their OFC region of interest when exposed to contamination-related images. On the left side of the display, subjects view a red arrow that points up, a blue arrow that points down, or a white arrow that points straight ahead to the right. To the right of this arrow is a large image, which is contamination-related when the arrow points up or down, and neutral when it points forward. Subjects are told to try to increase activity in their OFC when the arrow points up, to try to decrease activity in their OFC when it points down, and to simply relax when the arrow points to the right. The arrow and picture change every 26 seconds, alternating through the three conditions. Given our interest in examining brain-behavior correlations across subjects (such as correlations between changes in control over the brain area and changes in contamination anxiety during the Assessment sessions), we want all subjects to be exposed to the same block sequences. Therefore, the order of blocks is not counterbalanced across subjects in either the control runs or the biofeedback runs. Instead two run types are used in alternation for all subjects. In the first run, the block order is rest-up-down-rest-up-down-rest-up-down-rest. In the second run, it is rest-down-up-rest-down-up-rest-down-up-rest. Thus, in one run, up precedes down, and in the next, down precedes up.",
    "After the control task runs, and when the target region and control region have been registered to the current functional space, six biofeedback runs (or sham biofeedback runs, depending on the subject) are conducted (132 volumes collected for each run, first two and last two discarded).",
    "Biofeedback runs: These runs are used to train subjects to control activity in their OFC ROI. They are similar to the control task runs, except that subjects receive feedback at the bottom of the screen regarding their success in controlling the brain area. More specifically, at the bottom of the display, subjects are provided with a graphical plot of activity in their OFC region as it changes over time throughout the run. Subjects are instructed to try to increase activity in the OFC when the line color is red, and to decrease activity in this region when the line color turns blue, and to rest when it is white. The line plot is presented below an image that changes for each increase/decrease/resting block and is contamination-related during the increase and decrease blocks, and neutral during the resting blocks. As in the control task runs, there is also a color coded arrow to the left of the image indicating the current task (increase/decrease/rest). Subjects are instructed to try out the strategies discussed in their Strategy Reappraisal Development Session but also to feel free to experiment with others, and to use the biofeedback as a tool for evaluating what works best. In addition, to encourage experimentation with novel strategies, it is emphasized to all subjects that their performance in controlling the OFC will not be evaluated during the biofeedback runs, only during the control task runs in which no biofeedback is presented. Subjects are told that there is a six to eight second delay between changes in activity in their target brain area and changes in the line graph, due to the slow blood flow response and processing delays.",
    "It is also recommended to subjects that they should not change strategies within a block as the delay in the time-course makes evaluating success of each strategy difficult when strategies are changed too quickly.",
    "The real-time fMRI system used to provide feedback during the biofeedback runs is illustrated in Figure 2. A special reconstruction routine was written that saves a copy of each slice of data, as it is collected, to directory on the Image Reconstruction System that is accessible to the Image Processing Computer via the local area network connection. A module of BioImage Suite (www.bioimagesuite.org[href=http://www.bioimagesuite.org]) running on the Image Processing Computer polls that directory and reads in each slice as it appears. When a whole volume has arrived, it is registered the functional reference scan (to adjust for motion) and the average signal level in the target OFC region, as well as in the control white matter region, are computed and output via serial port to the Stimulus/Feedback computer. A Matlab program (www.mathworks.com[href=http://www.mathworks.com]) running on the Stimulus/Feedback Computer receives that data and normalizes the OFC activity level to adjust for drift and whole brain fluctuations using the formula introduced by deCharms and colleagues.8 More specifically, for each volume of data collected, the percent signal change from the running mean is computed for both the OFC and white matter ROIs and the difference in those two measures is computed. This value is plotted as a line graph over time at the bottom of the visual display.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3535/3535fig2.jpg",
    "Figure 2. Schematic of the real-time fMRI system. The Image Reconstruction System processes the MR data as it is collected, and creates an image of each slice that is written to a file. These slice images are retrieved by the Image Processing Computer via LAN and processed in real time using BioImage Suite. ROI activity level is then sent to the Stimulus/Feedback Computer where it is received by a Matlab program that creates the visual display, including a plot of normalized OFC activity over time for the subject.\nSham biofeedback: These runs provide a control condition with which to compare the biofeedback. Sham biofeedback runs will be identical to the biofeedback runs, except that subjects will view the time course of activity in the OFC from a previous, age- and gender-matched subject's biofeedback run. To the degree that the previous subject was able to control activity in the OFC during their biofeedback runs, the current subject will appear to be equally successful during their sham biofeedback runs, resulting in similar impressions of success experienced by subjects across the two conditions. Given that the experience of success (in controlling this region) may influence subject motivation, and thus indirectly influence the degree to which they learn control over the OFC, it is important to keep this as consistent as possible.\nFinally, two more control task runs are collected.\n3.3 Day 3: Identical to Day 2 but using separate (matched) sets of stimuli.\n3.4 Day 4\nSubjects participate in a final Assessment Session (as in 3.2.1).\nSubjects participate in a final 1 hour MR imaging session in which resting state functional connectivity data is collected.\n4. Debriefing of Sham Subjects",
    "Upon completion of the study, all sham participants are informed that they received sham feedback and debriefed to ensure they are not upset about the deception, and to check if they suspected that the feedback they were receiving was not veridical.\n5. Off-line Data Analyses\n5.1 Three primary outcome measures are computed for each subject:\nThe change in anxiety experienced when the subject views contamination related images in the last Assessment Session compared with the first Assessment Session. Note that the specific images shown are different across the Assessment sessions (to avoid habituation), but are matched (as confirmed with pilot testing) in the anxiety level they normally induce. The mean self-reported anxiety score from the first Assessment Session will be subtracted from the mean self-reported anxiety score from the final Assessment Session to yield an estimate of the change in anxiety of each subject. A within subject t-test comparing self-reported anxiety scores is used to determine whether any given subject showed a significant decrease in anxiety in the final Assessment Session relative to the initial Assessment Session.",
    "The change in control over the OFC target region that subject experienced during the intervention. Control over the region is computed based on the control task runs at the start and end of each biofeedback session. For each control task run, a GLM analysis is conducted using two regressors: one for the \"increase\" blocks and one for the \"decrease\" blocks, each of which is computed by taking a vector that is coded 1 during the appropriate task period and zero at all other time points convolved with a hemodynamic response function. The beta maps for each of these regressors are subtracted to yield a map representing the difference in signal in the increase versus decrease blocks. The mean value in this map is averaged across the subject specific OFC region to yield estimates of control over the target OFC region in each control task run. Control over the OFC at the start of the first biofeedback session will be subtracted from control over the OFC at the end of the last biofeedback session to yield a measure of the change in control over the region caused by the biofeedback intervention.\nThe change in resting state connectivity to the OFC region over the course of the study. This is computed for each subject by subtracting the seed region connectivity map of the Day 1 resting runs from the seed region connectivity map of the Day 4 resting runs.\n5.2 Group level analyses\nAt a minimum, the following are examined at the group level:",
    "Subjects who received real biofeedback are contrasted with subjects who received sham biofeedback to determine whether they developed greater control over their target region and whether that enabled them to exert greater control over their contamination anxiety. Paired t-test will be used to compare estimates of the changes in control and the changes in anxiety for the two groups.\nChanges in contamination anxiety in biofeedback subjects are related to changes in control over their target region and to changes in functional connectivity patterns. Across subjects who received true biofeedback, changes in control over the target region will be correlated with changes in anxiety using Pearson product-moment correlation. Significance will be assessed via a standard r-to-p conversion. The maps of changes in connectivity to the OFC for each subject will be correlated in a pixel-wise manner with the estimates of their change in anxiety.\nBoth the offline analyses and the real-time analyses described in this manuscript are conducted using BioImage Suite (www.bioimagesuite.org[href=http://www.bioimagesuite.org]). This software package is freely available and open source. The real-time analysis component, although not available on-line, is available upon request. It is designed to decouple the real-time data analysis from the display program, so the latter can be altered without requiring modification of the former. This allows for flexibility in experimental design, for example, the display program can be written using any of the standard software (e.g., E-prime, Matlab, Presentation). In addition, the real-time analysis employs graphics processing unit accelerated motion correction, which enables high quality motion correction with almost no processing delays. This system is described in more detail in Scheinost et al., 2011.26\n6. Representative Results",
    "A subject who gains control over their target brain area during the biofeedback should have an increase in control over the target brain area, as assessed during the control task runs, and this should translate into a reduction in contamination anxiety during the Assessment Sessions. Figure 3 shows a screen shot of the visual display from one of the final biofeedback runs of a subject who successfully gained control over their OFC. The success of this subject in controlling the region during this run is reflected by the fact that the line graph is higher during the red periods than the blue periods, particularly after adjusting for the expected six to eight second delay. This same subject showed increased control as assessed during his control task runs (from an average beta value of 0.003 to an average beta value of 0.23) as well as a significant decrease in anxiety in response to contamination images presented in the Assessment Sessions (p<0.005) as shown in Figure 4. This was a successful subject. In contrast, other subjects did not learn to control the target region, and did not show any decreases in contamination anxiety as assessed in the Assessment Sessions. In general, we find large variability across subjects in their ability to learn to control this region.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3535/3535fig3.jpg",
    "Figure 3. Screen shot of the visual display viewed during a biofeedback run, taken at the end of the run. Because the run ends with the neutral condition, the image viewed at the time of the screen dump (in this case, the picture of the books) is neutral, and the arrow is white and pointing forward. During increase and decrease blocks, contamination related images were shown. The arrow on the left was a red up arrow during the increase blocks and a blue down arrow during the decrease blocks. The line graph at the bottom of the display represents OFC activity during the run. The color of the line indicates which kind of block was occurring during that time period of the scan (red for increase, blue for decrease, and white for neutral). The graph covers the time frame from the moment the first volume is processed (approximately 3s after the start of the run) until the time the 128th volume is processed (approximately 257s after the start of the run). The y-axis indicates percent signal change from the running mean in the OFC minus the percent signal change from the running mean in the white matter control ROI (in this run, amplitudes ranged between 2.1 and -3.7). Note that after accounting for a 6-8s delay (corresponding to 3-4 time points), activity in this region was greater during red than blue periods, reflecting the success of this subject in controlling the region. The sham subject matched to this subject would see identical stimuli, however, in the case of the sham subject, the line graph would not be related to their true pattern of brain activity.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3535/3535fig4.jpg",
    "Figure 4.  Bar graph summarizing self-reported anxiety ratings in response to contamination images in (a) the first Assessment Session (before the biofeedback) and (b) the final Assessment Session (after the biofeedback) from the subject whose biofeedback time-course is shown in Figure 3. This subject reported significantly lower anxiety after the biofeedback as indicated by the asterisk.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}