{
  "id": 13718,
  "origin_website": "Jove",
  "title": "Assessment of Maternal Vascular Remodeling During Pregnancy in the Mouse Uterus",
  "procedures": [
    "All procedures discussed in this manuscript are in accordance with UK Home Office regulations and are approved by the Cambridge Ethical Review Panel.\n1. Specimen Collection\nSet up timed matings using 8-12 week old female C57BL/6 mice with adult males (up to 2 females per male) in the afternoon. Check for the presence of vaginal plugs as a sign of copulation early in the morning on the following days. The presence of a plug in the morning marks gd0.5.\nOn gd9.5, euthanize the animal by cervical dislocation and open the abdominal cavity. Note that euthanasia by CO2 may cause vasodilatation.\nUse dental floss to gently ligate the uterine arteries (Figure 1, dashed arrows). Tie the floss around the arteries at the tip of each uterine horn, proximal to the ovaries, as well as around the cervix.\n\tNote: Do not rupture the vessels as this may result in collapsed arteries.\nDissect the uterus quickly using dissection scissors, excising the whole uterus distally to the three ligation points at the tip of the uterine horns and the cervix.\nPlace the uterus on a prepared polystyrene piece so that both horns are aligned along the same long axis in opposite directions from the cervix. Gently stretch it and pin into place using 2-3 25 G needles.\nImmerse the polystyrene into a prepared 50 ml conical tube. Top up to 50 ml with 10% formalin. Fix for 5-6 hr at room temperature.\nDiscard the formalin solution and replace with 50 ml 1x phosphate buffered saline (PBS) for 5 min.\nExcise the two uterine horns proximally to the ligation point at each end and proximally to the cervix in the center, trim away any excess fat around the implantation sites and wash twice in PBS for 5 min to remove traces of formalin.",
    "Store the samples in 70% ethanol at 4 °C (for up to two weeks) until processing.\n\tCAUTION: Ethanol is highly flammable.\nUse an automated processing system using the parameters indicated in Table 1. Embed the horns individually in paraffin so that they can be cut along the plane perpendicular to the long axis of the uterus. This ensures that the maximum area of each implantation site will be exposed for analysis in the middle of the block (Figure 2A).\n\tOPTIONAL: This is a convenient time point for randomization of the blocks if desired.\nUsing a microtome, cut serial sections of 7 µm thickness from the blocks. Stain one section at every 49 µm interval with hematoxylin and eosin (H&E, see section 2.1). Store the remaining sections at room temperature for SMA staining and other downstream applications.\ntable:\n﻿0,1,2\nSolution,Time,Temperature\n70% Ethanol,1 hr,40 °C\n100% Ethanol,1 hr,40 °C\n100% Ethanol,1 hr,40 °C\n100% Ethanol,1 hr,40 °C\n100% Ethanol,1 hr,40 °C\n100% Ethanol,1 hr,40 °C\n100% Ethanol,1 hr,40 °C\nXylene,1 hr,40 °C\nXylene,1 hr,40 °C\nXylene,1 hr,40 °C\nParaffin,1 hr,63 °C\nParaffin,1 hr,63 °C\nParaffin,1 hr,63 °C\nParaffin,1 hr,63 °C\nTable 1: Settings for automated tissue processing. Overview of the setting used for the processing of uterine tissue\n2. Stereological Assessment\nH&E Staining\n\t\nDeparaffinize sections by immersing slides mounted in a slide rack into a 100% xylene bath for 10 min at room temperature.\n\t\tCAUTION: Xylene is flammable and a suspected carcinogen that is toxic through contact and inhalation. This work must be conducted in a fume hood, using personal protective equipment (PPE).\nImmerse slides in bath containing clean xylene for a further 10 min.\nSequentially immerse slides in baths containing 100% ethanol, 95% ethanol, 70% ethanol and purified water for 5 min each.",
    "Immerse slides in 50% Gill No 3 hematoxylin solution, diluted with purified water, for 5 min.\n\t\tCAUTION: Hematoxylin is harmful by ingestion and contact to eyes. Wear appropriate PPE when handling.\nWash slides in a staining trough under running tap water for 10 min.\nImmerse slides in 1% acid/alcohol solution (1% 10 M hydrochloric acid in 70% ethanol) for 10 sec and wash in a staining trough under running tap water.\nImmerse slides in eosin solution for 30 sec and wash in a staining trough under running tap water for 10 min.\nWithin a fume hood, sequentially immerse slides in baths containing 70% ethanol, 95% ethanol and 100% ethanol for 5 min each.\nImmerse slides in bath containing xylene for 10 min.\nMount coverslips using a xylene-based mounting medium. Dry horizontally and thoroughly in a fume hood prior to visualizing the slides under a microscope.\nStereological Assessment of Vessel Size and Remodeling Status\n\t\nFor each implantation site, determine which sections are close to the midsagittal point. The chorioallantoic attachment between the fetus and developing placenta serves as a good indicator of the midsagittal point.\nSelect 3 sections at 49 µm intervals close to the midsagittal point for the analysis. Scan selected slides. In order to avoid including veins, which have been shown to be more peripherally located in the implantation sites16, restrict the analysis on the central 2/4 of each implantation site (Figure 2A).\nTo assess lumen size, draw around the inside of the vessels and record the area of this shape. For the total vessel size, draw around the outer wall of the vessel, including endothelial cells, pericytes and intramural leukocytes.",
    "Note: The ratio of total vessel size to lumen is a proxy for the remodeling status of a vessel. As the vessels coil through the plane that the section was cut along, there may be multiple cross-sections of the same artery in one slide. Avoid measuring the same artery multiple times.\nRecord the measurements from the 5 vessels in each implantation site with the largest and roundest lumens. Measure each implantation site in triplicate (three sections spaced 49 µm apart from each other). The mean of these 15 measurements represents the mean diameter of the largest vessels.\nTo avoid overrepresentation of larger vessels in some samples, measure the same number of vessels in each implantation site.\n3. Qualitative Assessment Using Immunohistochemistry\nDeparaffinization and Rehydration\n\t\nDeparaffinize sections by immersing slides mounted in a heatproof slide rack into a 100% xylene bath for 10 min at room temperature.\nImmerse slides in bath containing clean xylene for a further 10 min.\nSequentially immerse slides in baths containing 100% ethanol, 95% ethanol and 70% and purified water for 5 min each.\nAntigen Retrieval\n\t\nPrepare a 10 mM sodium citrate buffer in purified water and adjust to pH 6 using 10 M hydrochloric acid.\nFill a heatproof container that can hold 600 ml with 400 ml sodium citrate buffer and place in a domestic pressure cooker containing sufficient water to submerge half of the container. Loosely attach the lid of the pressure cooker and heat until boiling.\nPlace slide rack into the sodium citrate buffer and tightly fix the lid of the pressure cooker. Once pressurized, allow to boil for 3 min.\nDepressurize the pressure cooker and remove the inner container. Allow slides to cool in the sodium citrate buffer for 10 min at room temperature.",
    "Wash slides in a bath containing purified water for 5 min.\nEncircle the sections using a hydrophobic barrier pen.\nWash slides by submerging in PBS for 5 min.\nBlocking Endogenous Peroxidase and Non-specific Binding\n\t\nIncubate sections with 3% hydrogen peroxide diluted in purified water in a humidified chamber for 30 min at room temperature.\n\t\tCAUTION: Hydrogen peroxide is highly irritant to eyes, skin and upon ingestion. Wear appropriate PPE.\nTap off excess hydrogen peroxide solution and wash slides twice by submerging in Tris buffered saline (TBS) for 2 min each.\nIncubate sections with mouse immunoglobulin blocking reagent from the mouse on mouse kit prepared according to manufacturer's instructions.\nWash slides twice in TBS for 2 min each.\nImmunodetection of Smooth Muscle Actin\n\t\nPrepare antibody diluent solution (provided in kit) and incubate with sections for 5 min at room temperature, or according to manufacturer's instructions.\nDilute 1:100 mouse anti-human smooth muscle actin (DAKO M0851) in antibody diluent solution. Dilute mouse IgG2a isotype control in antibody diluent solution, ensuring that the final immunoglobulin concentration is equivalent in both solutions.\nTap off excess antibody diluent solution and cover sections with either diluted antibody or isotype control solutions. Incubate in a humidified chamber for 30 min at room temperature.\nWash slides twice in TBS for 2 min each.\nDilute biotinylated anti-mouse secondary antibody and incubate sections for 10 min at room temperature, or according to manufacturers instructions.\nWash slides once each with TBS and PBS for 2 min, respectively.\nPrepare 3,3'-Diaminobenzidine (DAB) solution according to manufacturer's instructions. Cover sections with DAB solution and incubate for up to 4 min, ensuring to monitor sections to avoid excess color development.\n\t\tCAUTION: DAB is flammable and a suspected carcinogen that is toxic through contact and inhalation. Wear appropriate PPE when handling.",
    "Immerse slides in purified water once desired intensity of staining is reached.\nCounterstain with 50% Gill No. 3 hematoxylin for 20 sec and wash in a staining trough under running tap water until water runs clear.\nDehydration and Mounting\n\t\nWithin a fume hood, sequentially immerse slides in baths containing 70% ethanol, 95% ethanol and 100% ethanol for 5 min each.\nImmerse slides in bath containing xylene for 10 min.\nMount coverslips using a xylene-based mounting medium. Dry horizontally and thoroughly in a fume hood prior to visualizing the slides under a microscope"
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}