{
  "id": 8276,
  "origin_website": "Bio",
  "title": "Mapping and Analysis of Illumina Reads for Transcriptome of <em>Medicago Truncatula</em> During the Early Organogenesis of the Nodule",
  "procedures": [
    "Poly(A) mRNA was isolated from the extracted RNA to prepare a nondirectional Illumina RNA-Seq library with mRNA-Seq 8 sample prep kit. We modified the gel extraction step by dissolving excised gel slices in QG buffer of QIAquick Gel Extraction Kit at room temperature to avoid under representation of AT-rich sequences.    Quality control and quantification of each library of 200 bp was performed with a Bioanalyzer Chip DNA 1000 series II.   36 to 44 bp sequences were generated on an Illumina genome analyzer II. A total of 135 million of reads were obtained for the different conditions.   M. truncatula Genome and the Splice Database Sequence alignments were generated with Bowtie (http://bowtie-bio.sourceforge.net[href=http://bowtie-bio.sourceforge.net/]).    Alignment of the reads was made on the Mt3.0 version of the M. truncatula genome sequence (www.medicago.org[href=http://www.medicago.org/]). For our analysis we allowed up to 2 mismatches, and sequences that matched with more than 10 different loci were discarded. Genome index is built with command “bowtie-build –f medicago.fasta genome” where medicago.fasta is the complete Mt3.0 fasta file. Reads are then aligned with command “bowtie -v 2 –m 10 –k 11 -S genome reads.fastq output.sam”, where reads.fastq are the raw sequencing reads of a sample, and the output.sam was processed using the software suite BedTools (http://code.google.com/p/bedtools/[href=http://code.google.com/p/bedtools/]) in order to assign each read to an exon, intron, UTR, or intergenic region. Reads mapped onto external exons fell within a 3-kb catchment from both ends of a gene, promoting the investigation of putative undiscovered exons. Intergenic reads represented those sequence reads that fell outside this catchment. The program ERANGE defined potentially novel clusters of expression on the basis of their alignment; they were categorized as novel sections (exons/UTRs) of a known gene if they fell inside a radius of 3,000 bps from them (average gene density/2).",
    "The remaining expressed clusters were marked as potential new genes.   In order to identify potential new isoforms of known genes, we remapped all reads against the M. truncatula genome using TopHat (http://tophat.cbcb.umd.edu/[href=http://tophat.cbcb.umd.edu/]) with a segment length of 16 due to the short length of our reads, and defined the new isoforms of known genes performing a Cufflinks (http://cufflinks.cbcb.umd.edu/[href=http://cufflinks.cbcb.umd.edu/]) analysis on each sample, with standard parameters, followed by an analysis with Cuffcompare to merge transcripts identified on different samples. We used the latest genome sequence and annotations provided by the Medicago research community (Mt3.5, http://www.medicago.org/[href=http://www.medicago.org/]).    To identify novel transcribed regions, we used the reads which had not been mapped against the Mt3.0 sequence from every sample to assemble separately our contigs, using the Velvet program (http://www.ebi.ac.uk/~zerbino/velvet/[href=http://www.ebi.ac.uk/~zerbino/velvet/]), using a sensitive hash length of 29 for the reads with a length of 44 bps and of 21 for the rest. The contigs were subsequently clustered together using the software CAP3 (http://bioinformatics.ca/links_directory/tool/9319/cap3-sequence-assembly-program[href=http://bioinformatics.ca/links_directory/tool/9319/cap3-sequence-assembly-program]), with a minimum overlap of 90%, requiring an overlap identity of 80%. Contigs mapping against the reference genome with identity ≥ 90% and coverage ≥ 90% after BLAT alignment were discarded from further analysis. All the contigs were also mapped against the accompanying RNA-Seq data of the Mt3.5 version with GMAP (version 2012-04-21). The contigs, with an alignment coverage on the sequence length >= 90% and on the identity >= 90%, were merged together using the program mergeBed from the BEDTools suite (http://code.google.com/p/bedtools/[href=http://code.google.com/p/bedtools/]).   The evaluation of gene expression was performed with the ERANGE software (3.1), available at http://woldlab.caltech.edu/RNA-Seq[href=http://woldlab.caltech.edu/RNA-Seq]. ERANGE requires Cistematic 2.5 to execute RunStandardanalysis.sh. Therefore, a Python script (medicago3.py) was developed to import M. truncatula reference sequence (Mt3.0) and annotation in General Feature Format (GFF) into Cistematics Genomes sqlite database, and a Perl script (gff2knowngene.",
    "pl) was used to convert the GFF annotation file to the knowngene.txt file used by RunStandardanalysis.sh. ERANGE reports the number of mapped reads per kilobase of exon per million mapped reads, measuring the transcriptional activity for each gene. To obtain an accurate measure of gene expression not biased by reads mapping to splice junctions in genes with many introns, ERANGE considers both reads mapping to genome or to the custom splice junctions database. ERANGE was preferred over commercial packages such as CASAVA and GenomeStudio platform from Illumina because of its open nature. This allowed us to adapt and reuse code for our own analysis with greater flexibility than a comparable closed source commercial package.   Differential Gene Expression Statistic for RNA-Seq. ERANGE software computes the normalized gene locus expression level (named RPKM) by assigning reads to their site of origin and counting them. In the case of reads that match equally well to several sites, ERANGE assigns them proportionally to their most likely site(s) of origin (Mortazavi et al., 2008). The RPKM value for a given gene locus can be estimated as follows:  RPKM = N/(L * NTot) * 109 Where N = number of mapping reads at a given gene locus, L = estimated length (bp) of the gene locus, NTot = number of total mapping reads, and 109 is correspond to 1,000 bp transcript multiple 1 million reads. The null hypothesis of no differential gene expression for each gene was tested using the R package qvalue (Storey, 2002; Storey and Tibshirani, 2003; Dabney et al., 2010) on the R working environment. False Discovery Rates were calculated based on p-values obtained running a t test on the raw read counts using the basic R package stats.  Variance = (1/RPKM1) + (1/RPKM2) Stat = (log(RPKM1/NTot1) - log(RPKM2/NTot2))/√(Variance) p.",
    "value = (1-pnorm(abs(Stat))) * 2 The threshold value for the FDR was 0.001 and genes were first selected using this filter. Differentially expressed genes were then filtered again based on a Fold Change (FC) > 2."
  ],
  "subjectAreas": [
    "Plant Science",
    "Systems Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}