{
  "id": 8354,
  "origin_website": "Jove",
  "title": "Imaging and Quantification of Intact Neuronal Dendrites via CLARITY Tissue Clearing",
  "procedures": [
    "The following protocol follows all animal care guidelines for Baylor College of Medicine.\n1. Dissection and tissue preparation\nEuthanize the mouse with an overdose of isoflurane by placing the mouse in a closed container with a towel soaked in isoflurane (or by other IUCAC approved means).\nPerfuse the animal transcardially using a 25 G needle with 10 mL of ice cold PBS, followed by 10 mL of 4% PFA.\nDissect the brain region (or tissue) of interest.\nPlace the dissected tissue into 4% PFA overnight at 4 °C. Proper fixation is key for this protocol. Do not skip or shorten this step.\nAfter fixation in 4% PFA for at least 12 h, transfer the tissue to a 4% acrylamide hydrogel mixture for 24 h at 4 °C.\n\t​NOTE: When thawing the hydrogel, ensure that it has not polymerized, this can happen if the hydrogel becomes too warm. Thaw on ice to prevent premature polymerization.\n2. Tissue clearing\nPlace the brain tissue (still submerged in hydrogel) in a vacuum incubator for 3 h at 37 °C with a -90 kPa vacuum. Leave the tube top unscrewed to allow the vacuum to form properly.\nWash the tissue with PBS for 10 min at room temperature (25 °C) with gentle shaking.\nPlace the polymerized tissue sample in the electrophoresis chamber, keeping note of the orientation of the tissue within the chamber.\nFill the chamber and reservoir with the supplied electrophoresis SDS buffer.\nRun the sample at 70 V, 1 A, and 35 C, with constant current for about 2 h/mm of tissue.",
    "Check the sample periodically; it may require more time in the chamber to properly clear. A good starting point for clearing is 1-2 h per mm of brain tissue. A whole mouse brain requires 8-10 h for sufficient clearing. Remember the orientation of the sample before removing it from the chamber and be sure to replace it back into the chamber in the same orientation.\n\t\t​NOTE: Figure 3A shows what a fully cleared brain will look like. The brain will look opaque and not clear at this stage due to the presence of dissolved SDS, but there should be little to no yellow tissue colored hue after lipid extraction.\n3. Preparing and mounting the cleared tissue\nAfter the sample has finished clearing and looks sufficiently clear, wash in PBS overnight at room temperature. Replace the PBS with fresh PBS as often as possible. This step is critical to remove residual SDS that can form precipitates in later steps.\nFollowing the final wash in PBS, wash the tissue for 5 min in deionized water at room temperature three times. The tissue will become opaque at this step and may expand.\nIncubate the tissue in the refractive index matching solution (see Table 1) for at least 4 h at room temperature. Figure 3B shows a piece of cleared tissue after incubation in refractive index matching solution.\nDuring the incubation of tissue in refractive index matching solution, construct a suitable housing chamber to image the sample if necessary.\nConstructing an imaging chamber for small tissue samples/slices\n\t\nUsing a glass slide as a base for mounting, lay down either rubber or plastic spacers and secure with super glue. If premade spacers are not available, use plastic rings made from conical tube cross sections.",
    "Ensure to secure these pieces to the glass slide without any holes (Figure 3C).\nPlace the cleared tissue into the mounting chamber prefilled with refractive index matching solution.\nSecurely mount the tissue by placing a glass coverslip on top and sealing it with nail polish.\nImage this tissue by adding a drop of refractive index matching mounting solution directly on top of the glass.\nLarge tissue imaging chamber\n\t\nConstruct this chamber if the tissue is larger than 5 mm thick (suitable for whole brains or hemispheres).\nUsing a 10 cm glass dish with a high wall, place a 50 mL conical tube in the center, making sure that the diameter of conical is large enough to accept the barrel of the objective lens used.\nMake 3% agarose in water and pour it in the space between the glass dish and conical tube, allow to cool for 1 h (Figure 3D). This will form a ring of solid agarose (Figure 3E).\nSecurely adhere the tissue to the bottom of the chamber using super glue and fill the chamber with refractive index matching solution. Apply glue to adhere the tissue on a region that will not be imaged to allow reclamation of the tissue from the dish without damaging the regions of interest.\n\t\tNOTE: This preparation is time sensitive, as the refractive index media may start to polymerize unless preserved from air and stored at 4 °C.\n4. Imaging cleared tissue samples\nAcquire the image using a confocal microscope fit with a 25x/0.95 NA objective with a 4 mm working distance.\nTurn on all the relevant imaging equipment. Place the sample on the stage and place a drop of refractive index matching solution onto the top of the mounting chamber.",
    "Carefully approach the immersion media with the objective and form a continuous column of media.\nUsing epifluorescence, find an appropriate imaging field.\nBegin the image acquisition procedure by testing the appropriate settings.\n\t\nStart by setting the resolution and scan speed settings using Figure 4A as a guide. If imaging using a confocal microscope, fully close the pinhole to obtain the smallest optical section and thus best z-resolution.\nGradually increase the laser power/sensor gain until a suitable image is obtained with a high signal-to-noise ratio.\nIf utilizing standard EGFP/tdTomato two-color imaging, set the light collection settings using Figure 4B as a guide.\nSet the z-stack parameters based on the observed start and end points of the tissue. Set the step size based on the desired z-resolution using Figure 4C as a guide.\n\t\tNOTE: Smaller step sizes will yield a greater z-resolution but will also introduce more laser dwell time, potentially leading to sample bleaching.\nWhen satisfied with image acquisition settings, acquire the image.\nEnsure that the image has a high signal-to-noise ratio and shows distinct boundaries of structures (Figure 4D).\n5. Image processing and 3D quantification using microscopy analysis software\nNOTE: Microscopic image analysis software packages are powerful tools for three-dimensional image visualization and processing. Many of these programs are perfectly suited for the handling of large datasets that are generated from imaging cleared tissue samples. The following steps and associated figures correspond to the Imaris software workflow.\nOpen the image stack and import it into the selected analysis software.\nView the image in three-dimensional space and make any desired changes to the lookup tables using the display adjuster to better visualize the image.",
    "NOTE: Figure 5A demonstrates the possible extreme imaging depth accessible through 2-photon microscopy paired with CLARITY tissue clearing. Figure 5B shows distinct dendrite processes as well as clearly visible spine morphologies from the z-stack presented in Figure 5A.\nTo filter out any consistent background, click on the Image Processing button and select the background subtraction filter.\n\tNOTE: Figure 5C shows the image with a consistent hazy background signal before processing. Figure 5D shows the image after the background subtraction filter has been applied.\nObserve the 3D image and become familiar with it by looking at it from multiple angles and zoom levels.\nStart the dendrite tracing by first selecting the Filament tracer tool.\nClick on Edit the Filament Manually, Skip Automatic Creation.\nSet the mode to auto path and check Auto-center and Auto-diameter corrections.\nShift + right click on the cell body to set a starting point.\nTrace the neuron along the entire length of the dendrite; left click on the end of the dendrite to set the termination point to allow the software to automatically calculate the path in between the start and end points.\nRepeat this step for all the dendrites, and fully trace out the cell structure.\nVisualize the traced cell and confirm its accuracy. Make manual adjustments as needed.\nSelect the Creation tab.\nSelect the Recompute Dendrite Diameter option.\nFollow the wizard to completion for a more accurately traced dendrite.\nSelect the Draw tab.\nClick on the Spine radio button to start drawing spines.\nSet the approximate spine diameter as needed, and use the measurement tool to get an accurate representation of spine diameters.\nClick on the center of the spine heads to add a new spine.\nRepeat this for all spines on the dendrite.",
    "NOTE: It is important to observe the dendrite from all possible angles when manually adding spines.\nCheck the newly added spines for accuracy and make changes as needed.\nSelect the Creation tab.\nSelect the Recompute Spine Diameter option to allow the software to determine the proper head and neck diameters, which are crucial for downstream data analysis.\nFollow the spine diameter creation wizard to completion.\nObserve the result of the computation and make any manual adjustments as needed. Figure 5E shows a fully traced neuron complete with spines.\nTo create a classified list of spines, select the Tools tab.\n\tNOTE: The MATLAB extension must be installed for this to work.\n\t\nTo install the MATLAB extension, open the preferences window.\nSelect the Custom Tools option.\nAdd the appropriate MATLAB runtime MCR.\nClick on Classify Spines.\nEdit the desired parameters for spine classification.\nClick on Classify Spines on the MATLAB extension. Figure 5F shows the dendrite overlaid with color-coded classified spines.\nSelect the Statistics tab.\nConfigure the desired statistics to quantify the data by clicking on the Configure button in the bottom-left corner of this tab.\nOnce the method of statistics representation has been chosen, export the data using the Export Statistics on Tab Display to File button located on the bottom right of this window.\nGraph the statistics using a preferred graphing method.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}