{
  "id": 8487,
  "origin_website": "Jove",
  "title": "Induction of Diffuse Axonal Brain Injury in Rats Based on Rotational Acceleration",
  "procedures": [
    "The experiments were performed following the recommendations of the Declarations of Helsinki and Tokyo and to the Guidelines for the Use of Experimental Animals of the European Community. The experiments were approved by the Animal Care Committee of Ben-Gurion University of the Negev.\n1. Preparing rats for the experimental procedure\nNOTE: Select adult male Sprague-Dawley rats weighing 300-350 g.\nObtain approval for performing these experiments from the Institutional Animal Care and Use Committee.\nMaintain rats at a room temperature of 22 ± 1 °C, with 12 hour light and 12 hour dark cycles. Provide rat chow and water ad libitum.\nPerform all experiments between 6:00 a.m. and 12:00 p.m.\nUse a continuous isoflurane administration system to induce anesthesia. Make sure the vaporizer system is filled with isoflurane.\n\t\nAnesthetize the rats with 2% isoflurane.\nConfirm that the rat is fully anesthetized by observing a lack of movement or pedal reflex in response to an external stimuli.\n2. Induction of diffuse axonal injury\nNOTE: The device consists of the following components: 1) transparent plastic cylinder, 2) iron weight (1308 g), 3) rotation mechanism consisting of a cylindrical tube, two bearings upon which the axis rotate and a head fixation (for ear pins); 4) horizontal platform on which are fixed two bearings.\nPlace the device on a heavy, stable laboratory table.\nAttach the weight to a string that is elevated to a height of 120 cm.\nAllow the freely falling weight to hit the bolt, activating the rotational mechanism. Using the lateral head rotation device, the rodent’s head is turned rapidly from 0 to 90°.\nAfter induction of diffuse axonal brain injury, transfer the rat to a recovery room.\n3. Measurement of rotational Kinematics/Biomechanical parameters.\nMeasure rotational kinematics/biomechanical parameters as follows:\nimgsrc://cloudfront.jove.com/files/ftp_upload/61198/61198eq1.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/61198/61198eq2.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/61198/61198eq3.jpg",
    "where Fo - force applied to animal head (kg); M – moment of force; K – kinetic energy; m – mass of the falling weight; g - gravitational acceleration; h – height (cm); D – distance between the ear pins (cm).\n\tNOTE: To calculate the force applied to the animal’s head (Fo), it is necessary to know the mass of the falling weight, the height at which the weight falls, and the distance between the ear pins. The other parameters remain unchanged.\n4. Evaluation of Neurological Severity Score after 48 hours\nNOTE: Neurological deficits were assessed and graded using a Neurological Severity Score, as previously described17,18,19. Alterations in motor function and behavior are assessed by a point-system such that a maximum score of 24 represents severe neurological dysfunction. A score of 0 indicates intact neurological status. The following behavioral functions are assessed.\nAssess the rat’s inability to exit from a circle (50 cm in diameter) when left in its center. Perform this for three individual sessions lasting 30 min, 60 min, and more than 60 min.\nTest the rat for a loss of righting reflex in three sessions lasting 20 min, 40 min, and over 60 min.\nPerform the test for hemiplegia, the inability of the rat to resist forced changes in position.\nRaise the rat by its tail to test the flexion of the hindlimb.\nPlace the rat on the floor to test its ability to walk straight.\nTest for three separate reflexes: the pinna reflex, the corneal reflex, and the startle reflex.\nRate the rat with a clinical grade based on loss of seeking behavior and prostration.\nTest limb reflexes for placement. Perform the test on the left and right forelimbs, and then the left and right hindlimbs.",
    "Perform a functional test via the beam balancing task. Beam should measure 1.5 cm wide. Run the test for sessions of 20 s, 40 s, and more than 60 s.\nPerform beam walking test on the rat with beams of three different widths: 8.5 cm wide, 5 cm wide, and 2.5 cm wide.\n5. Brain collection for histological examination after 48 hours\nAt 48 hours post injury, euthanize the rats by replacing their inspired gas mixture with 20% O2/80% CO2. Ensure that CO2 is delivered at a predetermined rate in accordance with Institutional Animal Care and Use Committee guidelines.\n\t\nEnsure death confirmation in accordance with Institutional Animal Care and Use Committee guidelines.\nTranscardiacally perfuse the rat with 0.9% heparinized saline at temperature 4 °C, followed by 500 mL of 4% paraformaldehyde in 0.1 M phosphate buffer saline (pH 7.4).\nAfter perfusion, perform decapitation with a guillotine.\nPerform brain collection by removing the calvarias with bone-cutting forceps to avoid damaging brain tissue.\nRemove the brain immediately and fix in a 4% buffered formaldehyde solution for 48 h at 4 °C.\nBlock brains into 5 mm coronal sections from the olfactory bulb face to the visual cortex and bisect cerebellums and brain stems.\nFollowing paraffin embedding, cut coronal and sagittal sections (5 µm) away from the thalamus by microtome sectioning.\n6. Immunochemical staining and examination\nGently place the slices on glass slides with a soft brush, 1 slice per slide.\nProduce immunochemical staining of βAPP.\n\t\nDeparaffinize slices with xylene (3 times for 5 min each) and rehydrate with gradually-reduced concentrations of ethanol at room temperature: 3 min in 100% ethanol twice, 3 min in 95% ethanol twice, 3 min in 90% ethanol, 3 min in 70% ethanol, and 3 min in DDW.",
    "Treat deparaffinized and rehydrated brain sections with 3% H2O2 for 15 min at room temperature to block endogenous peroxidase activity.\nIncubate sections with 0.01 M sodium citrate (pH 6.0) at 98 °C for 5 min for antigen retrieval.\nKeep the slides in the buffer for 20 min at room temperature to cool.\nWash sections with phosphate-buffered saline (PBS) solution twice for 5 min.\nBlock the sections with 2.5% normal horse serum for 1 h at room temperature and incubate overnight at 4 °C in primary rabbit anti-APP (1:4000) diluted in the blocking serum.\nAfter incubation in primary antibody, wash sections in PBS at room temperature.\nIncubate sections in appropriately diluted biotinylated secondary antibody for 15 min and wash with PBS for 3 min twice at room temperature.\nIncubate in streptavidin–peroxidase for 15 min and wash again in PBS for 3 min twice at room temperature.\nIncubate sections with buffered substrate solution (pH 7.5) containing hydrogen peroxide and 3,3-diaminobenzidine chromogen solution and protect from light until the color is developed.\nIncubate the slides with DDW at room temperature for 5 min in order to stop the reaction.\nCounterstain sections with Hematoxylin for 3 min at room temperature and wash for 5 min with flowing tap water.\nDehydrate the slides with gradually increasing concentrations of ethanol at room temperature: 2 min in DDW, 2 min in 70% ethanol, 2 min in 90% ethanol, 2 min in ethanol 95%, 2 min in 100% ethanol, and 3 min in xylene three times.\nDry and mount with mounting medium.\nExamine the slices under microscope magnification of 200x with a 20 mm objective lens using a microscope.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}