{
  "id": 19638,
  "origin_website": "Jove",
  "title": "A Pilot Study on the Repetitive Transcranial Magnetic Stimulation of Aβ and Tau Levels in Rhesus Monkey Cerebrospinal Fluid",
  "procedures": [
    "All the experiments were performed under the Guidance for the Care and Use of Laboratory Animals, formulated by the Ministry of Science and Technology of the People's Republic of China, as well as the principles of the Basel Declaration. Approval was given by the Animal Care Committee of the Sichuan University West China Hospital (Chengdu, China). Figure 1 shows the single-blind, self-controlled study design used here.\n1. rTMS devices\nUse an 8-shaped magnetic field stimulator coil to perform the rTMS stimulation.\n2. Animal\nKeep the male rhesus monkey (Macaca mulatta, 5 kg, 5 years old) in an individual home cage with free access to tap water and standard chow. Ensure that environmental conditions are controlled to provide a relative humidity of 60-70%, a temperature of 24 ± 2 °C, and a 12:12 h light: dark cycle14,15. Perform all the experiments according to the Guidance for the Care and Use of Laboratory Animals.\n3. A serial cisterna magna CSF sampling method\nHave two trained experimenters perform a catheterization method to sample CSF from the cisterna magna (Figure 2).\nPositioning\n\t\nAnesthetize the monkey by an intramuscular injection of 5 mg/kg zolazepam-tiletamine (see the Table of Materials). To ensure successful anesthetization of the monkey, look for deep and slow breathing, dull or absent cornea reflex, and relaxation of the muscles of the extremities. Monitor its temperature, pulse, respiration, mucous membrane color, and capillary refill time during this stage.\nAdminister 2 mg/kg morphine via intramuscular injection every 4 hours. \nPlace the monkey on an operating table in the lateral decubitus position. Bend the monkey's neck, hunch the back of the monkey, and bring its knees toward the chest.\nPuncture",
    "For disinfection, prepare the area around the lower back using aseptic technique. Insert a spinal needle between the lumbar vertebrae L4/L5, push it in until there is a \"pop\" when it enters the lumbar cistern where the ligamentum flavum is housed.\nPush the needle again until there is a second \"pop\" where it enters the dura mater. Withdraw the stylet from the spinal needle and collect drops of CSF.\nCatheter insertion\n\t\nUnder fluoroscopic guidance, insert the epidural catheter through the puncture needle into the subarachnoid space until it is buoyant in the cisterna magna.\nPort implantation\n\t\nMake a 5 cm incision from the puncture site to the direction of the head and isolate the skin from subcutaneous tissue to place the sampling port. Connect the port to the end of the epidural catheter and implant the port under the skin; then, suture the incision. Disinfect the wound daily to prevent infection.\n\t\tNOTE: The monkey fully recovers on the day after surgery.\nCSF collection\n\t\nUse the bars of the cage to restrain the monkey and keep its back bent.\nInsert a syringe into the center of the sampling port to extract the CSF from the cisterna magna through the catheter. Discard the first 0.2 mL of CSF (the total volume of the catheter and port is 0.1 mL), and then collect 1 mL of CSF for analysis16.\n4. Monkey chair adaptive training\nFix the monkey on the monkey chair before the experiment to avoid interrupting the process of rTMS intervention (Figure 3A,B).\nCollect CSF for biomarker analysis in the awake state of the monkey to avoid the influence of anesthetic drugs.",
    "On the third day after the subarachnoid catheterization, 2 weeks before the start of the experiment, subject the monkey to adaptive training with the monkey chair, twice a day, for 30 min each time.\n5. rTMS adaptive training/sham stimulation\nConduct the rTMS adaptive training/sham stimulation one week after the adaptive training with the monkey chair, one week before the start of the formal experiment to avoid hindering the progress of the experiment because of vibrations and sounds during the stimulation process.\nUse a sham coil (which only produces vibration and sound and does not generate a magnetic field) to stimulate the monkey. Offer food to the monkey after stimulation to help it adapt to the process (Figure 3C).\nConduct rTMS adaptive training on a monkey chair twice a day, for 30 min each time for a total of 2 weeks.\n6. Treatment protocol\nUse three different frequencies (1 Hz/20 Hz/40 Hz) of rTMS to stimulate the bilateral-DLPFC (R-L-DLPFC) of the monkey, as described previously17. Localize the DLPFC according to the international 10-20 system.\n\t\nConduct three different sessions of rTMS with a washout period exceeding 24 h18,19.\n\t\t\nFor the first period, use the following parameters: a frequency of 1 Hz for rTMS, a pattern of rTMS composed of 20 burst trains, 20 pulses with 10 s inter-train intervals between trains, and an intensity of stimulation of 100% of the average resting motor threshold (RMT), twice a day for three consecutive days20,21.\nFor the second period, use the following parameters: trains of high frequency (20 Hz) rTMS with 100% RMT for 2 s duration with 28 s inter-train intervals, a total of 2,000 stimuli (40 stimuli/train, 50 trains) each session, twice a day for three consecutive days22.",
    "For the third period, use the following parameters: trains of gamma-frequency (40 Hz) rTMS with 100% RMT delivered in 1 s duration separated by 28 s inter-train intervals. Keep the total number of pulses for each session the same as with 20 Hz rTMS, twice a day for three consecutive days7,22.\n7. CSF biomarkers\nAnalyze four CSF biomarkers: Aβ42, Aβ42/Aβ40, tTau, and pTau.\n8. CSF collection and index detection method\nUse a minimally invasive catheterization method to sample the CSF.\nUse the bars of the cage to restrain the monkey and keep its back bent. Instruct the other operator to insert a syringe into the center of the sampling port, ensuring that CSF is extracted through the catheter.\nCollect CSF at 5 timepoints (4 samples each timepoint at 3 min intervals): pre-rTMS, 0 h/2 h/6 h/24 h post-rTMS23,24,25. Collect a total of 60 samples for 3 frequencies; number and store them in a -80 °C refrigerator for up to 1 month. After the experiment, subject all samples to liquid chip detection according to the manufacturer's instructions (see the Table of Materials).\n9. Statistical analysis\nPresent all data as mean ± standard deviation (SD).\nPerform the Shapiro-Wilk test to test normality in case of a small sample size. Perform two-way repeated-measures ANOVA and Tukey's multiple comparisons test.\n\tNOTE: A value (two-tailed) < 0.05 was considered statistically significant.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}