{
  "id": 17643,
  "origin_website": "Jove",
  "title": "Cell-Free Production of Proteoliposomes for Functional Analysis and Antibody Development Targeting Membrane Proteins",
  "procedures": [
    "1. Preparation of pEU expression plasmid\nNOTE: pEU expression plasmid should include start codon, open reading frame of target membrane protein, and stop codon in the fragment (see Figure 1). Add detection/purification tag sequence(s) at the appropriate position when required. Either restriction enzyme digestion or seamless cloning is applicable for subcloning. Here we describe a protocol using a seamless cloning method.\nPrepare insert DNA fragment.\n\t\nAmplify the gene of interest by PCR using the cDNA template, primer 1 and primer 2. Primer 1 and primer 2 contain 15 bp overlaps for seamless cloning, respectively (see the Table of Materials).\n\t\tNOTE: Do not include sequences to be processed and removed from mature protein in the cells (e.g., signal sequence). Processing of synthesized protein is not performed in wheat cell-free system. Do not add Kozak sequence. pEU-E01-MCS vector has E01 translation enhancer.\nAdd 1/25 volume of DpnI restriction enzyme to the PCR product to remove template plasmid DNA. Incubate for 30 min at 37 °C.\nUse a PCR purification kit to purify the PCR product and adjust concentration at 20–50 ng/µL.\nLinearize pEU-E01-MCS vector.\n\t\nConduct inverse PCR using pEU-E01-MCS, primer 3, and primer 4.\nAdd 1/25 volume of DpnI restriction enzyme to the inverse PCR product. Incubate for 30 min at 37 °C.\nUse a PCR purification kit to purify the PCR product as per the manufacturer’s recommendation. Adjust the concentration at 20–50 ng/µL.\nMix 2 µL of insert DNA fragment, 2 µL of linearized vector, and 4 µL of 2x seamless cloning enzyme mixture.\nTransform Escherichia coli strain JM109 with the seamless cloning product. Using a spreader, spread the bacterial suspension on a LB-ampicillin agar plate.\n\tNOTE: pEU vector has an ampicillin resistance marker.",
    "Confirm the sequence of the expression plasmid constructed using primer 5 and primer 6 from 5’ and 3’ side of MCS in pEU plasmid, respectively.\nAmplify and purify the expression plasmids.\n\t\nCulture the plasmid-transformed E. coli strain JM109 in 150 mL of LB-ampicillin medium at 37 ˚C and 125 strokes per minute shaking overnight.\nExtract and purify the plasmids using commercially available plasmid prep midi kit. Dissolve plasmids in 500 µL of TE buffer.\n\t\tCAUTION: Do not use a mini prep kit for plasmid extraction. It does not provide sufficient quality and quantity of plasmid.\nAdd 500 µL of phenol/chloroform/isoamyl alcohol (25:24:1). Mix vigorously for 5 min, and centrifuge for 5 min at 17,800 x g and room temperature. Transfer the upper plasmid solution to a new tube.\n\t\tCAUTION: Wear disposable gloves to protect the skin from phenol and chloroform.\n\t\tNOTE: In order to remove contamination of RNase from plasmid extraction kit, purify the plasmids using phenol-chloroform purification.\nAdd 500 µL of chloroform to remove phenol completely. Mix vigorously for 5 min, and centrifuge for 5 min at 17,800 x g and room temperature. Transfer the upper plasmid solution to a new tube.\nAdd 2.5 volume of ethanol and 1/8 volume of 7.5 M ammonium acetate, and store at -30 °C for 1 h.\nCentrifuge at 17,800 x g at 4 °C for 10 min. Wash the pellet with 500 µL of 70% ethanol. Remove the supernatant carefully and leave the pellet for 5 min to dry up.\nDissolve the expression plasmids in 100 µL of ultrapure water completely. Measure the concentration of plasmids with absorbance at 260 nm. Adjust the concentration to 1 mg/mL.\n2. In vitro transcription",
    "CAUTION: Use DNase and nuclease-free plastic tubes and tips in steps of transcription and translation. Avoid autoclaving plastic wares to prevent contamination.\nHarvest ultrapure water in a new plastic tube.\n\tCAUTION: Do not use DEPC-treated water because residual DEPC strongly inhibits the reaction. Use freshly purified ultrapure water for transcription and translation.\nPrepare transcription reaction mix by mixing 115.2 µL of ultrapure water, 40 µL of Transcription Buffer LM, 20 µL of NTP mix, 2.4 µL of 80 U/µL RNase inhibitor, 2.4 µL of 80 U/µL SP6 polymerase, and 20 µL of 1 mg/mL pEU expression plasmids. Mix the reagents gently by inverting. Perform a quick spin.\nIncubate the transcription reaction at 37 °C for 6 h.\nMix the reaction gently by inverting and quickly spin down. Use it immediately for translation, otherwise freeze and store at -80 °C.\nConfirm the transcription product by electrophoresis.\n\t\nMix 100 mL of 1x TAE buffer and 1 g of agarose. Heat the suspension in a microwave oven to prepare 1% agarose TAE gel.\nTake 1 µL of transcription reaction and mix with 3 µL of water and 4 µL of 2x loading dye.\n\t\tNOTE: Denaturing of RNA is not required.\nLoad 4 µL of the mixture and 2 µL of DNA ladder marker to the agarose TAE gel.\nElectrophorese at 100 V for 20 min.\nStain the gel in ethidium bromide for 30 min. Check the ladder band pattern of mRNA using UV transilluminator and gel imager.\n\t\tNOTE: When a smeared band of less than 500 bp is observed, mRNA degradation is suspected.\n3. Preparation of materials for translation\nPrepare the translation buffer.\n\t\nMix 27 mL of freshly prepared ultrapure water and 0.75 mL of each 40x stock solution for S1, S2, S3, and S4, respectively in a 50 mL tube.",
    "NOTE: Modulate the amounts of materials according to the final required amount of 1x translation buffer.\n\t\tCAUTION: Do not store or refreeze the excess 1x translation buffer after use.\nPrepare creatine kinase stock solution. Dissolve lyophilized creatine kinase in ultrapure water to a final concentration of 20 mg/mL. Dispense the solution in small amounts (10 to 50 µL each) in 0.2 mL 8-strip PCR tubes. Freeze the tubes in liquid nitrogen, and store at -80 °C.\n\tCAUTION: Do not re-freeze creatine kinase solution after thawing.\nWash dialysis cups (0.1 mL size) to remove glycerol from the dialysis membrane.\n\tNOTE: There are several different-sized dialysis cups. Small-sized cups (0.1 mL) are used for small-scale test (section 5.4), and large-sized cups (2 mL) for large-scale production (section 5.5), respectively. The washing step of dialysis membrane of large-size cups is avoidable.\n\t\nPut 1 mL of ultrapure water into a new 1.5 mL tube. Insert small-sized dialysis cup (0.1 mL) to the tube. Add 0.5 mL of ultrapure water into the cup.\nIncubate for more than 30 min at room temperature.\n4. Preparation of liposomes\nNOTE: Here we describe two protocols for preparation of liposomes. One uses ready-to-use lyophilized liposomes (section 4.1), while the other produces liposomes by hydrating a thin lipid film (section 4.2).\nPrepare liposomes using lyophilized liposomes.\n\tNOTE: An easier way to produce proteoliposome is to use commercially available Asolectin liposome. Asolectin is a kind of natural lipid extracted from soybeans.\n\t\nOpen the vial containing 10 mg of lyophilized Asolectin liposomes (see the Table of Materials) and add 200 µL of translation buffer (section 3.1) to the bottom of the vial. Seal the vial and incubate for 10 min.\nMix vigorously by putting the vial on the vortex-mixer for 1 min.",
    "Insert the vial into a 50 mL tube. Spin down the tube by centrifuging at 500 x g for 1 min.\nUsing a pipette, transfer the Asolectin liposome suspension (50 mg lipid/mL) to a new 1.5 mL tube. Use liposome immediately for translation, otherwise freeze in liquid nitrogen and store at -80 °C.\nPrepare liposomes by hydrating a thin lipid film.\n\t\nIf a lipid is sold in powder form, dissolve in chloroform or appropriate organic solvent to 10-100 mg/mL concentration.\n\t\tNOTE: A thin lipid film can be prepared using purified and/or synthesized amphiphilic lipids. The purification method of asolectin is previously described38. Functionally modified lipids, such as biotinylated lipids, fluorescent lipids, and adjuvant lipids, can be added to the basal lipids to produce functional liposomes.\nTransfer the lipid solution containing 50 mg of lipid(s) to an evaporation flask.\nUsing a rotary evaporator, evaporate solvent and evenly spread the lipid on the wall of the flask bottom to form a thin film of lipid.\nPut the flask in a vacuum desiccator and leave under negative pressure overnight to remove the solvent completely.\nAdd 1 mL of translation buffer to the evaporation flask. Rotate the flask to spread the buffer over the thin lipid film. Incubate for 5 min to hydrate the film.\nSonicate the flask with an ultrasonic homogenizer or ultrasonic cleaner. Change the angle of the flask occasionally to allow the solution to touch the film thoroughly. Ensure that the thin lipid film is peeled from the bottom and emulsified completely and homogenously.\n\t\tNOTE: Electron micrograph of biotinylated lipids containing liposomes is shown in Figure 1.\nTransfer the liposome suspension (50 mg lipids/mL) to a new 1.5 mL tube. If it is not to be used immediately, freeze the liposomes in liquid nitrogen, and store at -80 °C.",
    "5. In vitro translation\nThaw the wheat germ extract quickly by floating the tubes on water at room temperature for a few minutes. After thawing, immediately mix gently by inverting the tubes, spin down, and chill on ice until use.\n\tNOTE: Freeze wheat germ extract in liquid nitrogen after use, and store at -80 °C. It withstands several freeze/thaw cycles.\nThaw 20 mg/mL creatine kinase stock solution. Mix 5 µL of stock solution and 45 µL of translation buffer to prepare 2 mg/mL creatine kinase working solution.\n\tCAUTION: Refreezing creatine kinase is not recommended.\nThaw liposomes or mRNAs when required.\nConduct a small-scale protein translation.\n\t\nRemove water from both the tube and the dialysis cup (0.1 mL), as prepared in step 3.3.2.\nInject 1 mL and 300 µL of translation buffer in the tube and the dialysis cup, respectively.\n\t\tCAUTION: In case the bottom of the dialysis cup does not reach the surface of translation buffer in the 1.5 mL tube, inject an additional 50–100 µL of buffer to the tube.\nPrepare translation reaction mixture by mixing 15.6 µL of translation buffer, 2.4 µL of 2 mg/mL creatine kinase, 12 µL of 50 mg/mL liposomes, 15 µL of wheat germ extract, and 15 µL of mRNA. Mix gently by inverting the tubes, and spin down.\nAspirate 60 µL of the translation reaction mixture using a 200 µL pipette.\nInsert the pipette tip into the undersurface of translation buffer in the dialysis cup. Pipette out the reaction mixture slowly and gently. Cover the dialysis cup with a lid to prevent evaporation.\n\t\tNOTE: The reaction mixture sinks naturally to the bottom of the cup and forms a bilayer. Do not disturb the bilayer by mixing or shaking the cup.\nConduct a large-scale translation (Figure 1).",
    "Pour 22 mL of translation buffer into a 25 mL tube. Insert a large-sized dialysis cup (2 mL) into the tube and add 2 mL of translation buffer in the cup.\nPrepare a translation reaction mixture by mixing 130 µL of translation buffer, 20 µL of 2 mg/mL creatine kinase, 100 µL of 50 mg/mL liposome, 125 µL of wheat germ extract, and 125 µL of mRNA. Mix gently by pipetting.\nAspirate all the translation reaction mixture (500 µL) using a 1,000 µL pipette. Inject translation reaction mixture into the dialysis cup in the same way as described in step 5.4.5. Cover dialysis cup with a lid to prevent evaporation.\nIncubate the reactions at 15 °C for 24 h.\nMix the reaction well in the dialysis cup by pipetting. Transfer the crude proteoliposome suspension to a new tube.\n\tNOTE: A flat-bottomed 1.5 mL tube is recommended to collect the proteoliposome from the small-scale translation. After centrifugation, liposomes form compact and easily visible pellet on the bottom corner of the tube.\n6. Purification of proteoliposomes\nCentrifuge the tube containing crude proteoliposome suspension at 17,800 x g at 4 °C for 10 min.\nRemove the supernatant. Suspend the proteoliposome pellet in PBS (small scale: 1 mL, large scale: 10 mL) by pipetting.\nRepeat the centrifugation and washing of proteoliposomes for another two circles.\nAfter washing, add a small amount of PBS and re-suspend proteoliposome pellet well by pipetting. Measure the volume of suspension using a micro pipette. Add PBS to adjust the volume to 60 µL (small scale) or 500 µL (large scale). Transfer the suspension to a new 1.5 mL tube.",
    "Transfer 10 µL of proteoliposome suspension to a new PCR tube for SDS-PAGE. Divide the rest of the samples into smaller portions for use when necessary. Freeze in liquid nitrogen and store at -80 °C.\n7. SDS-PAGE and CBB staining\nAdd 70 µL of water and 40 µL of 3x SDS-PAGE sample buffer to 10 µL of proteoliposome suspension.\n\tCAUTION: Do not boil the SDS-PAGE sample, as membrane proteins aggregate, and hardly penetrate into acrylamide gel in electrophoresis. Also, add enough reducing agent to SDS-PAGE sample buffer (e.g., 2-mercaptoethanol at 3% final concentration) to prevent oxidation.\nSet a 5%–20% gradient SDS-PAGE gel in an electrophoresis chamber. Load 3 µL, 6 µL, 12 µL of proteoliposome samples, 2 µL of protein size marker, and BSA standard series as well.\nElectrophorese at 52 mA, 400 V for 30 min.\nStain the gel with CBB dye for 1 h. Decolorize in hot water and scan the gel image.\nUsing NIH Image J software (https://imagej.nih.gov/ij/), quantify the band intensity of membrane protein in each lane. Estimate the amount of synthesized membrane proteins with BSA standard series.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}