{
  "id": 18772,
  "origin_website": "Jove",
  "title": "Enrichment for Chemoresistant Ovarian Cancer Stem Cells from Human Cell Lines",
  "procedures": [
    "1. Cell Culture and Fluorescent Labeling of Ovarian Cancer Cell Lines\nPrepare SKOV3 media: McCoy media supplemented with 10% fetal bovine serum (FBS), 0.1 mM L-glutamine, 50 U/ml penicillin, and 50 μg/ml streptomycin. Maintain OVCA429 cells in minimal essential media (MEM) supplemented with 10% FBS, 1 mM sodium pyruvate, 0.1 mM L-glutamine, 50 U/ml penicillin, and 50 μg/ml streptomycin.\nPropagate SKOV3 and OVCA429 cell lines in a humidified incubator at 37 °C with 5% CO2. Grow cells to 40-50% confluency.\nGenerate cells expressing red fluorescent protein (RFP) in order to monitor viability in vitro and in vivo.\nTo generate SKOV3 cells expressing RFP, add lentiviral particles expressing RFP and 10 μg/ml polybrene to SKOV3 media in the absence of penicillin and streptomycin for 72 hr.\nAfter 72 hr, select for RFP positive cells by Fluorescence Activated Cell Sorting (FACS) as follows: Trypsinize RFP and non-RFP expressing cells, centrifuge at 125 x g for 5 min, resuspend cells at 107 cells/ml in PBS containing 0.1% BSA. On a cell sorter, use non-RFP cells to determine the sorting parameters. Then collect cells that express high RFP using a 561 nm laser.\nAlternatively, if the lentiviral plasmid expresses an antibiotic resistance cassette, select for RFP expressing cells by culturing in the appropriate antibiotic (such as 10 mg/ml blasticidin). NOTE: The amount of lentiviral particles that needs to be used can vary by batch and by cell type. Proper lentiviral titer should be determined for each cell type.\n2. Enrichment of Cancer Stem Cells\nTreat SKOV3, SKOV3-RFP, or OVCA429 cell lines with 20 μM of cisplatin for 72 hr. CAUTION: Cisplatin is toxic. Use protective clothing/gloves and avoid contact with skin and mucus membranes. Do not dispose of cisplatin in wastewater.",
    "Prepare CSC media: serum free DMEM/F12 media supplemented with 5 μg/ml insulin, 10 ng/ml human recombinant epidermal growth factor (EGF), 10 ng/ml basic fibroblast growth factor (bFGF), 12 ng/ml leukemia inhibitory factor, and 0.4% bovine serum albumin (BSA).\nTrypsinize cells. Culture surviving cells in CSC media.\n\tNOTE: After 2 days in culture non-adherent spheroids will form.\nChange media every 2 days by collecting media containing cells and centrifuging at 125 x g for 5 min. Then resuspend the pellet in fresh CSC media. Check cells for viability every 2 days by counting cells and performing trypan blue exclusion.\nThen collect CSCs for further experiments by centrifuging 129 x g for 5 min and resuspending the pellet in phenol containing guanidinium thiocynate (RNA), phosphate buffered saline (PBS: 137 mM NaCl, 2.7 mM KCl, and 11.9 mM phosphate buffer, pH 7.4) with 0.1% BSA (for flow cytometry), or CSC media to continue culturing the cells.\nMonitor CSC cell morphology using a light microscope at 20X and 40X magnifications.\n3. CSC Characterization via Gene Expression Analysis for Stem Cell Markers\nCollect 3 preparations of CSCs by collecting media containing cells, centrifuging at 129 x g for 5 min, and resuspending the pellet in a solution of phenol containing guanidinium thiocynate (other methods for RNA extraction may be used).\nPrepare total RNA using TRIzol according to the manufacturer’s protocol. Synthesize complementary DNA (cDNA) from 0.1-1 µg of RNA using a commercially available cDNA Reverse Transcription kit.\nPerform quantitative reverse transcribed polymerase chain reaction (QRT-PCR).",
    "Make up master mix for each set of primers containing QRT-PCR mix, primers, and water to total 8 µl per sample (primers with different fluorophores can be amplified in the same well). For example, generate one master mix for Oct4-FAM, Nanog-Hex, and GAPDH-CY5. Generate separate master mixes for Nestin and Prom1. Add 2 µl of cDNA template per sample.\n\t\tNOTE: For this study, QRT-PCR was performed using the primers listed in Table 1.\nPerform all QRT-PCR in duplicate for each sample using a real time PCR thermocycler capable of detecting multiple fluorophores. Include no template controls.\nNormalize stem cell gene expression to GAPDH expression for each sample using the ΔΔCT method.\ntable:\n﻿0,1\nOct-4-FAM,Primer 1: 5′-CCCAAGGAATAGTCTGTAGAAGTG-3′\nOct-4-FAM,Primer 2: 5′-TGCATGAGTCAGTGAACAGG-3′\nOct-4-FAM,FAM probe: 5′-CTTCCAAGC/ZEN/TGCCCACCTAACTTCT/3IABkFQ -3′\nNanog-HEX,Primer 1: 5′-CCTTCTGCGTCACACCATT-3′\nNanog-HEX,Primer 2: 5′-AACTCTCCAACATCCTGAACC-3′\nNanog-HEX,HEX probe: 5′-CTGCCACCT/ZEN.CTTAGATTTCATTCTCTGGT/3IABkFQ-3′\nGAPDH-CY5,Primer 1: 5′-TGTAGTTGAGGTCAATGAAGGG-3′\nGAPDH-CY5,Primer 2: 5′-ACATCGCTCAGACACCATG-3′\nGAPDH-CY5,CY5 probe: 5′-AAGGTCGGAGTCAACGGATTTGGTC/3IABRQSP-3′\nNESTIN-FAM,Primer 1: 5′-AGGACCTGAGCGATCTGG-3′\nNESTIN-FAM,Primer 2: 5′-CGTTGGAACAGAGGTTGGAG-3′\nNESTIN-FAM,FAM probe: 5′-AACTTTTCA/ZEN/GTAGCCCGCAGCC/3IABkFQ -3′\nCD133-HEX,Primer 1: 5′-ACTCTCTCCAACAATCCATTCC-3′\nCD133-HEX,Primer 2: 5′-AAACAATTCACCAGCAACGAG-3′\nCD133-HEX,HEX probe: 5′-ACAATCACT/ZEN/GAGCACTCTATACCAAAGCG/3IABkFQ-3\nTable 1. Primers used for CSC characterization by QRT-PCR.\n4. Analyzing CSCs for Cell Surface Markers CD117 and CD133\nHarvest CSCs by collecting media containing cells and centrifuging at 125 x g for 5 min. Add 500 µl of a non-proteolytic cell detachment solution to break-up cells. Centrifuge cells at 125 x g for 5 min to remove cell detachment solution. Then wash cells twice with cold PBS.\nIncubate in normal growth media for 1 hr prior to labeling cells. Spin down cells for 5 min at 129 x g. Resuspend cells in PBS with 0.1% BSA with anti-CD133-PE and anti-CD117-FITC.\nFix cells overnight in 1% paraformaldehyde. Caution: Paraformaldehyde is toxic (suspected carcinogen). Make in fume hood and use within a week.",
    "Perform flow cytometry to analyze CD117 (with an anti-CD117 conjugated to FITC) and CD133 (with anti-CD133 conjugated to PE) cell surface expression on a flow cytometer. Collect data on cells in the FL1 (for FITC) and FL3 (for PE) channels. Generate gates for cells expressing both FITC and PE. Generate a dot plot with 4 quadrants (FITC- and PE-, FITC+ PE-, FITC- PE+, and FITC+ and PE+) and determine the number of cells in each quadrant.\n5. Analyzing CSCs for Therapeutic Response\nPlate 5,000 cells per well (SKOV3, SKOV3-RFP, SKOV3 CSC and SKOV3-RFP CSCs) on 96-well plates overnight.\nTreat with cisplatin (0, 1, 10, 100, and 1,000 µM) or paclitaxel (0, 0.01, 0.1, 1, 10, and 100 µM) for 96 hr.\nPerform MTT (3-(4,5-Dimethylthiazol-2-yl)-2,5-diphenyltetrazolium bromide) cell viability assay.\n\t\nPlate 5,000 cells per 100 µl per well on a 96-well plate (plate cells in duplicate and include media only control wells).\nAfter 24 hr, add 10 µl of 10 mg/ml MTT. Incubate at 37 °C for 2-4 hr (until precipitate forms).\nAdd 100 µl of MTT solvent 4 mM HCl, 0.1% NP-40 in isopropanol. Incubate for 15 min in dark.\nRead plates at 570 nm on a plate reader.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}