{
  "id": 8489,
  "origin_website": "Jove",
  "title": "Induction of Leptomeningeal Cells Modification Via Intracisternal Injection",
  "procedures": [
    "The surgical procedures hereby presented were approved by Stockholms Norra Djurförsöksetiska Nämnd and carried out in agreement with specifications provided by the research institute (Karolinska Institute, Sweden).\nNOTE: Intracisternal injection can be flexibly adapted for multiple research purposes. We present below a procedure developed to efficiently label leptomeningeal cells for fate mapping based on injection of endoxifen in a transgenic mouse line carrying R26R-tdTomato12 and CreER, the latter under the Cx30 promoter13. Labelling of this population of cells may be achieved through injection of viral constructs using the same procedure outlined below. Finally, this approach can be employed for tracking cerebrospinal fluid flow, by infusion of fluorescent tracers.\n1. Preparation of the Injection System\nNOTE: We recommend carrying out the procedure in a suitable surgical room, and in aseptic conditions. Surgical tools can be sterilized using heat (autoclave, glass bead sterilizer) or sanitized using a high-level chemical disinfectant if they are heat-sensitive. Rinse the instruments before use when employing chemical disinfection or allow them to cool down when sanitized with heat.\nUsing forceps, bend the needle of the injection syringe to 30° at 3 mm from the tip.\nNOTE: Use Hamilton syringes with a 30 G beveled needle.\nPrepare 1 mg/mL of endoxifen solution, diluted in 10% DMSO and backfill the syringe with the bent needle.\n\tNOTE: Administer 5 μL of the compound to ensure widespread exposure of meningeal cells in the adult C57Bl/6j mouse (ca. 25-30 g), although pilot experiments that test different concentrations and injection volumes may be necessary when treating animals of different ages and strains.\nAdjust the mouse head holder so that the mouth piece is at approximately 30° from the surface of the surgical table.",
    "NOTE: A stereotactic frame with three-point fixation (i.e., ears and mouth) can also be used for this procedure. In this case, however, the animal will only be fixed with the mouth piece, whereas ear bars can be extended under the animal's forelimbs and be used to support the animal's body during the procedure.\n2. Induction of Anesthesia\nFor injectable anesthetics, use concentrations and modes of administration recommended by the veterinary unit at the local institution.\nFor inhalational anesthetics, such as isoflurane, prepare the administration unit according to the manufacturer's specifications.\nWith isoflurane, set concentration of the compound at 4% for induction of anesthesia.\nDeliver air at a rate of 400 mL/min.\nAllow the anesthesia unit to fill the chamber with the anesthetic for a few minutes and place the mouse in the chamber afterwards.\nNOTE: For the present experiments, we have used adult (>2 months old and approximately 30 g) male and female transgenic mice carrying Cx30-CreER and R26R-tdTomato, and bred on a C57Bl/6j background.\nMonitor the animal during induction of anesthesia. The breathing pattern should slow down when the mouse is under full anesthesia.\nRemove the animal from the chamber and check for suppression of the paw reflex by delicately pinching the hind paws.\nNOTE: The reflex may still be present but delayed a couple of seconds. If that is the case, place the animal back in the chamber until complete suppression of the paw reflex has been achieved.\nAdminister analgesic (e.g., Carprofen, 5 mg/kg through subcutaneous injection) to aid post-operative pain management.\n3. Positioning of the Animal for the Procedure",
    "Fix the animal's head onto the head holder. To improve accessibility to the cisterna magna, position the animal's body at approximately 30° from the surface of the table and the head titled downwards, to establish an angle of 120° with the rest of the body and extend the back of the neck to facilitate access to the cisterna magna (Figure 1A).\nAdd paper towels underneath the animal to support its body throughout the procedure.\nSecure anesthesia delivery through the mouth piece and reduce isoflurane concentration to 2.5% and air delivery to 200 ml/min.\nApply ophthalmic ointment.\n4. Exposure of the Cisterna Magna\nShave the back of the animal's neck and sanitize the area with 70% ethanol and Betadine.\nUsing surgical scissors, perform a midline incision (ca. 7 mm in length) starting at the level of the occipital bone and extending it posteriorly.\nGently separate superficial connective tissue and neck muscles pulling sidewise from the midline with fine tip tweezers. This will expose the dural membrane overlaying the cisterna magna, shaped as an inverted triangle.\nUse sterile absorption spears or cotton swabs to control any resultant bleeding.\nPosition a small surgical separator to maintain the neck muscles pulled aside and enable visualization of the cisterna magna throughout the procedure.\n5. Intracisternal Injection\nTo gain access to the cisterna magna, identify the caudal end of the occipital bone and insert the needle that was previously bent immediately underneath.\nNOTE: There will be a sudden drop in resistance as the dural membrane is punctured. However, the tip of the needle will only penetrate slightly underneath the meningeal surface, thanks to its hooked shape.",
    "Once the dura has been perforated, allow the bent tip of the needle to penetrate underneath the dural surface by gently pulling the syringe upwards and parallel to the animal's body, in order to \"hook\" the needle to the skull (see Figure 1B). This will ensure better stability and will prevent the needle from penetrating deeper, thus avoiding the risk of damaging the underlying cerebellum or medulla.\nInject the compound slowly to avoid interference with the cerebrospinal fluid's natural flow.\nNOTE: Depending on the purpose of the experiment, the infusion rate may vary. If slow and steady infusion rate is required (e.g., when using the procedure to trace cerebrospinal fluid movement), it may be advisable to use an automatized microinfusion system in combination with the syringe.\nAfter the injection, let the needle rest in site for 1 min and carefully remove it. Use fine tip forceps to aid retraction of the needle from its hooked position.\nNOTE: The use of a thin needle (e.g., 30 G) does not lead to substantial damage of the meningeal membrane, and consequent outflow of the cerebrospinal fluid. If larger needle sizes are required, we recommend stopping the leaking of fluid by applying pressure at the injection site using a sterile cotton tip.\n6. Concluding the Procedure and Post-operative Care\nRemove the separator and allow the muscles to go back to their original position overlaying the dural membrane.\nClose the skin incision using a few drops of cyanoacrylate adhesive.\nNOTE: Alternatively, use absorbable sutures (e.g., 5-0 vicryl sutures) and close the skin incision with interrupted stitches.\nApply local anesthetic (e.g., 100 μL of 5% lidocaine) at the incision site.\nRemove the animal from the holder and place in a clean cage positioned on a heating pad. Monitor the animal until it regains consciousness.",
    "NOTE: The procedure is not expected to cause long-lasting pain or distress in the animal. Nevertheless, the mouse should be monitored closely for the first postoperative days and pain relief measures may be undertaken whenever deemed necessary, and in accordance with recommendations provided by the veterinary unit at your institution.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}