{
  "id": 19522,
  "origin_website": "Jove",
  "title": "Systems Analysis of the Neuroinflammatory and Hemodynamic Response to Traumatic Brain Injury",
  "procedures": [
    "All animal procedures are approved by Emory University Institutional Animal Care and Use Committee (IACUC) and followed the NIH Guidelines for the Care and Use of Laboratory Animals.\n1. Weight-drop model of mild traumatic brain injury\nPrepare the weight-drop setup. Mount a vise on a flat surface with a 1 m guide tube (2.54 cm inner diameter) aligned vertically (check using a level). Use a 54 g bolt (0.95 cm basic body diameter, 2 cm head diameter, 10.2 cm length) for the impact.\nBriefly anesthetize mouse. Induce the mouse with 4.5% isoflurane in 100% oxygen for 45 seconds. Confirm sufficient depth of anesthesia by the lack of a toe pinch response.\nInduce injury.\n\t\nRapidly remove the mouse from anesthesia and place the mouse prone on the center of a thin membrane (11.2 cm x 21.3 cm tissue).\nUse both hands to hold the tissue taut with the mouse prone on the center. Secure the mouse’s tail under a thumb. Position the mouse head under the guide tube (Figure 2).\nDrop the bolt from the top of the guide tube onto the dorsal aspect of the mouse’s head, aiming for impact between the back of the eyes and the front of the ears. Upon impact, the mouse will penetrate the tissue, allowing for rapid acceleration of the head about the neck (Figure 2).\nRecovery\n\t\nAfter impact, place the mouse supine on a 37 °C warming pad in room air. Monitor recovery for 1 h post-injury. Within 1 h, mice should be able to ambulate normally, find food and water, and not exhibit gross motor deficits.",
    "NOTE: Analgesia is not used per approval of the Institutional Animal Care and Use Committee, which is justified due to the confounding influence of analgesia on the parameters of interest (i.e., cerebral blood flow, markers of inflammation). Loss of consciousness, defined as the time from removal from anesthesia to the time to regain righting reflex, is expected and typically lasts from 20 s to 3 minutes (Supplemental Table 1). Brief (<30 s) episodes of apnea and/or seizure-like activity may be observed, particularly after repetitive head injuries spaced once-daily.\nRepeat as needed. This injury may be repeated once-daily, weekly, or monthly. The number and spacing of injuries depend on desired injury severity. Typically, we employ five hits spaced once daily to induce robust deficits in spatial learning and memory.\n\tNOTE: Prior studies have shown that five hits spaced once-daily is sufficient to induce deficits in spatial learning and memory lasting over 1 year post-injury without edema, hemorrhage, or overt structural injury to the brain19. Mice are weighed daily and closely monitored for signs of dehydration, motor deficits, and loss of appetite. If dehydrated, mice are given moist chow and a subcutaneous injection of 1 mL of saline once daily. In order to prevent unnecessary suffering and to ensure a humane endpoint, mice are euthanized if: dehydration persists or worsens >24 h post-subcutaneous saline treatment, body weight decreases by more than 20% from pre-injury baseline, motor deficits such as circling or paw-dragging appear and persist >1 h after injury. \n2. Assessment of cerebral blood flow with diffuse correlation spectroscopy\nDCS data acquisition",
    "Remove hair on the scalp. Because DCS works best in the absence of hair, it is necessary to remove fur on the head prior to the start of experiments. Typically, hair removal is done 1-3 days prior to the start of the study.\n\t\t\nInduce mice with 4.5% isoflurane in 100% oxygen for 45 seconds and maintain with 1-2% isoflurane in 100% oxygen.\nShave the head between the eyes and the ears. Then, use depilatory cream to remove fur on the head as in Figure 3.\nAllow the animal to recover from anesthesia on a warming pad and then return to cage.\nMeasure cerebral blood flow with DCS. To minimize motion artifacts during measurement, study mice under brief isoflurane anesthesia.\n\t\tNOTE: Visually monitor respiration and toe pinch response throughout measurements and adjust isoflurane concentration as needed to ensure consistent depth of anesthesia. Significant variations in the depth of anesthesia could alter blood flow given the known vasomodulatory effects of isoflurane25.\n\t\t\nInduce with 4.5% isoflurane in 100% oxygen for 45 seconds, and then maintain with 1.0-1.75% isoflurane in 100% oxygen. Confirm sufficient depth of anesthesia by the absence of a toe pinch response and normal respiration (between ~60-80 breaths per minute).\nAfter a 2 min period of stabilization, gently rest the DCS sensor over the right hemisphere such that the top edge of the optical sensor lines up with the back of the eye and the side of the sensor lines up along the midline (Figure 3). Cup a hand over the sensor to shield from room light. Acquire 5 seconds of data (1 Hz acquisition).\nReposition the sensor over the left hemisphere, and acquire 5 seconds of data.\nRepeat 3 times/hemisphere to account for local heterogeneities under the tissue surface.\nRecovery",
    "Remove the mouse from anesthesia and place on a warming pad.\nAfter the mouse regains its righting reflex return it to the cage.\nDCS data analysis\n\t\nPerform initial quality control. Each frame of DCS data consists of a measured normalized intensity autocorrelation function, imgsrc://cloudfront.jove.com/files/ftp_upload/61504/61504eq110.png (Figure 4A), and photon count rate (kHz).\n\t\t\nTo remove data frames with significant motion artifact, discard data frames for which the mean value of the tail of the imgsrc://cloudfront.jove.com/files/ftp_upload/61504/61504eq110.png curve (i.e., imgsrc://cloudfront.jove.com/files/ftp_upload/61504/61504eq111.png) is > 1.005.\nTo remove data frames with poor signal-to-noise ratio, discard data frames if the detected photon count rate is < 20 kHz.\nExtract cerebral blood flow index. Using fminsearch in Matlab, fit each ith measured data frame imgsrc://cloudfront.jove.com/files/ftp_upload/61504/61504eq112.png for CBFi(i). Restrict fits to imgsrc://cloudfront.jove.com/files/ftp_upload/61504/61504eq113.png, and find the value of CBFi that minimizes the following cost function:\nimgsrc://cloudfront.jove.com/files/ftp_upload/61504/61504eq114.png\n\t\tWhere the sum is over all measured delay times,imgsrc://cloudfront.jove.com/files/ftp_upload/61504/61504eq115.png, and imgsrc://cloudfront.jove.com/files/ftp_upload/61504/61504eq116.png is the semi-infinite homogeneous solution of the correlation diffusion equation (Figure 4B):\nimgsrc://cloudfront.jove.com/files/ftp_upload/61504/61504eq117.png\n\t\tHere β is a coherence factor determined by the experimental set up, imgsrc://cloudfront.jove.com/files/ftp_upload/61504/61504equ07.jpg, imgsrc://cloudfront.jove.com/files/ftp_upload/61504/61504equ08.jpg, imgsrc://cloudfront.jove.com/files/ftp_upload/61504/61504equ09.jpg, imgsrc://cloudfront.jove.com/files/ftp_upload/61504/61504equ10.jpg, imgsrc://cloudfront.jove.com/files/ftp_upload/61504/61504equ11.jpg, Reff =0.493 for an assumed tissue index of refraction of 1.4, ρ is 6 mm, and μa and μ's are the absorption and reduced scattering coefficient of the tissue (assumed to be 0.25 and 9.4/cm, respectively10,26,27).\n\t\tNOTE: Because β can vary ~10% over time, fit each data frame for β and CBFi simultaneously.\nPerform secondary quality control. Within each repetition (which consists of 5 data frames), discard outliers. Outliers are defined as those CBFi values that fall outside 1.5 standard deviations of the mean CBFi for that repetition. If more than 1 data point is identified as an outlier, discard the entire repetition.",
    "Estimate average cerebral blood flow index: Estimate an average CBFi per hemisphere by taking the mean across all data frames for all repetitions (Figure 4C). If no significant hemispheric differences are observed, average across hemispheres to obtain an estimate of average global CBFi.\n3. Multiplexed quantification of cytokines and phospho-proteins using luminex assays\nTissue extraction\n\tNOTE: Quantification of brain cytokines and phospho-signaling proteins using Luminex requires tissue extraction.\n\t\nAnesthetize mouse using 4.5% isoflurane in 100% oxygen for 1-2 min. Check for deep plane of anesthesia via the lack of a toe pinch response. Euthanize via decapitation.\nHarvest the tissue.\n\t\t\nRemove the brain. Typically, fix the left hemisphere for histology and microdissect several regions from the right hemisphere within the cortex and hippocampus (Figure 5).\nPlace dissected samples in microcentrifuge tubes, flash freeze in liquid nitrogen. For analysis of freeze-sensitive proteins, it is optimal to sub-divide tissue sections prior to flash freezing to avoid later freeze-thaw.\n\t\t\tNOTE: The protocol can be paused, and tissue samples can be stored at -80 °C until ready to lyse samples. Alternatively, samples can be lysed, and then stored at -80 °C.\nLyse samples.\n\t\t\nPrepare the lysis buffer by adding protease inhibitor and 2 mM phenylmethylsulfonyl fluoride to the lysis buffer.\nAdd 150 µL of the mixed lysis buffer per approximately 3 µg of animal tissue. For reference, mouse visual cortex tissue samples are approximately 3 µg.\nTo homogenize the tissue, mechanically triturate the tissue by pipetting up and down ~15-20 times using a 1000 µL pipette. For optimal sample trituration, a homogenizer pestle can be used.\nPlace the sample tubes on a rotator for 30 min at 4°C.",
    "Centrifuge the samples at 4°C for 10 min at approximately 15,000 x g, and collect the supernatant. Samples may be processed immediately or stored at -80°C for further analysis.\n\t\t\tNOTE: Sample lysates prepared using this protocol are compatible with Western blot, from which the phagocyte/microglial marker Iba1 and/or the astrocyte activation marker GFAP can be analyzed to complement cytokine and phospho-protein analysis for neuroinflammation studies11.\nMultiplex immuno-assay protocol for cytokines and phospho-proteins\n\tNOTE: Although similar overall, there are some minor differences in the protocols for cytokine and phospho-protein kits. Differences are noted in each step. The steps to prepare samples for the Luminex assay are outlined below.\n\t\nPreparation of reagents (day 1, same for cytokines and phospho-proteins)\n\t\t\nAllow reagents to warm to room temperature (~30 min).\nSonicate multiplex magnetic beads bottle for 30 seconds followed by 1 min of vortexing. Ensure multiplex magnetic beads are shielded from light with aluminum foil or use provided light protective bottles.\nPrepare wash buffer by mixing 0.1% Tween20 in 1xPBS or alternatively use the wash buffer provided in the kit.\nPreparation of lysed tissue samples (day 1, same for cytokines and phospho-proteins)\n\t\t\nIf previously frozen, remove lysed tissues samples from freezer and allow to thaw on ice (~20 min). Centrifuge samples for 10 min at 9,167 x g to remove precipitate.\nPrepare 25 µL of sample at the optimal protein concentration determined by the linear range analysis (see section 3.3). To normalize total volume for all samples, dilute samples in assay buffer provided in the kit.\nPreparation of 96 well plate (day 1, same for cytokines and phospho-proteins)\n\t\t\nUse the 96 well plate included in the kit or one with a thin bottom (e.g., Brand Tech).",
    "Add 200 µL of wash buffer (or 1x PBS, 0.1% Tween) into each well and mix on plate shaker for 10 min at 750 rpm.\nDecant wash buffer and tap the plate onto a paper towel to remove residue.\nImmunoassay procedure for Cytokines (day 1)\n\t\t\nAdd the following to each well in order.\n\t\t\t\nAdd 25 µL of assay buffer to all wells.\n\t\t\t\t\nAdd 25 µL of additional assay buffer ONLY to background wells. For every experimental run, have at least two background wells. Background wells have no sample loaded and define the fluorescent intensity read by the instrument without sample.\nAdd 25 µL of each diluted sample to corresponding sample wells.\nAdd 25 µL of 1x multiplex magnetic beads to all wells (Figure 6). Be sure to vortex beads for 1 min before adding to wells.\nSeal plate with plate sealer and cover the plate with aluminum foil. Incubate overnight (12-16 h) at 2-8 °C.\nImmunoassay procedure for cytokines (day 2)\n\t\t\nPlace 96 well plate on magnetic separator, making sure that the wells are aligned with the magnets. Let sit for 2 min. Decant well contents while the plate is still attached to the magnetic separator.\nWash plate 2 times using the following steps.\n\t\t\t\nAdd 200 µL of wash buffer to each well and place on shaker for 2 min at room temperature.\nPlace the well plate on the magnetic separator for 2 min at room temperature.\nDecant well contents while the well plate is still attached to magnetic separator.\nAdd 25 µL of detection antibody per well (Figure 6). Cover with foil. Incubate for 1 hour on a plate shaker (750 rpm) at room temperature.",
    "Leave the detection antibody in and add 25 µL of streptavidin-phycoerythrin (SAPE) to each well (Figure 6). Cover with foil. Incubate for 30 min on plate shaker (750 rpm) at room temperature.\nPlace the well plate on a magnetic separator and let sit for 2 min. Decant well contents and detach from magnetic separator.\nWash well plate two times (see step 3.2.5.2).\nAdd 75 µL of Luminex Drive Fluid (if using MAGPIX instrument) to each well or assay buffer (if using 200 or FlexMap 3D instrument). Re-suspend beads on plate shaker for 5 min at room temperature.\nRead on Luminex Instrument (MAGPIX, 200, or FlexMap 3D), referring to the user’s manual for proper operation (Figure 6).\nImmunoassay procedure for phospho-proteins (day 1)\n\t\t\nAdd the following to each well in order.\n\t\t\t\nAdd 25 µL of assay buffer to all wells.\n\t\t\t\t\nAdd 25 µL of additional assay buffer ONLY to background wells. For every experimental run, it is recommended to have at least two background wells. Background wells have no sample loaded and define the fluorescent intensity read by the instrument without sample.\nAdd 25 µL of each diluted sample to each sample well.\nAdd 25 µL of 1x multiplex magnetic beads to all wells (Figure 6).\n\t\t\t\t\tNOTE: The Luminex assay kit provides multiplex magnetic bead in 20x stock solution. Be sure to vortex 20x stock multiplex magnetic bead solution for 2 min, and then dilute it in assay buffer to 1x solution. Vortex 1x multiplex magnetic bead suspension for 1 min before adding to wells.\nSeal plate with plate sealer and cover the plate with aluminum foil. Incubate overnight (12-16 hours) at 2-8 °C.\nImmunoassay procedure for phospho-proteins (day 2)",
    "Place the well plate on a magnetic separator, making sure that the well plate is fully aligned with the magnetic separator. Let sit for 2 min. Decant well contents while the well plate is still attached to the magnetic separator.\nWash plate 2 times (see step b in cytokine’s immunoassay procedure day 2).\nDilute the 20x stock detection antibody to 1x solution in assay buffer. Add 25 µL of 1x detection antibody per well (Figure 6). Cover with foil. Incubate for 1 h on plate shaker (750 rpm) at room temperature.\nPlace the 96 well plate on magnetic separator, and let sit for 2 min. Decant well contents, detach from the magnetic separator.\nDilute 25x stock SAPE in assay buffer to 1x buffer. Add 25 µL of 1x SAPE (Figure 6). Cover with foil and incubate for 15 min on plate shaker (750 rpm) at room temperature.\nLeave the SAPE in wells, and add 25 µL of amplification buffer to each well. Cover with foil.\nIncubate for 15 min on plate shaker (750 rpm) at room temperature.\nPlace the well plate on the magnetic separator for 2 min. Decant well contents and detach from the magnetic separator.\nAdd 75 µL of Luminex Drive Fluid (if using MAGPIX instrument) or assay buffer (if using 200 or FlexMap 3D instrument). Re-suspend beads on a plate shaker for 5 min at room temperature.\nRead on Luminex instrument (MAGPIX, 200, or FlexMap 3D), referring to the user’s manual for proper operation (Figure 6).\nLinearity of sample dilution curve\n\t\nPreparation of samples: Serially dilute test samples with different concentration of total protein. For bulk brain tissues, load serial dilutions from 0-25 µg for cytokines and 0-12 µg for phospho-proteins. Total protein concentration can be measured using bicinchoninic acid (BCA) assay.",
    "Multiplex immunoassay: Perform the Luminex assay (see section 3.2) on selected samples.\nData analysis\n\t\t\nPlot fluorescent intensity for each protein vs. amount of protein loaded (Figure 7).\nFor each analyte, identify range of total protein loaded for which the relationship between total protein and the fluorescent intensity readout is linear (Figure 7).\nTo determine the amount of total protein that should be loaded for the full assay run, identify the linear portion of the curve for each analyte and then select a protein concentration that falls within the linear range for the majority of analytes.\n\t\t\tNOTE: Although most proteins share a similar linear range, the linear ranges may not overlap for all proteins. If this is the case, it may be necessary to run each sample multiple times with different amounts of total protein loaded. Alternatively, nonlinear samples may be left out of the analysis. Additionally, some proteins may not have a linear range whatsoever.\n4. Partial least squares regression\nNOTE: Sample R code and a sample data spreadsheet are provided to carry out the Partial Least Squares Analysis.\nData Preparation: Format the data as shown in the provided sample data spreadsheet, “MyData”. Include variable names in the row 1, sample names in column A, the response variable in column B, and all predictor variables in columns C+. Fill the last two rows with the background data, and set both sample names to “Background”.\nPartial Least Squares Regression in RStudio\n\t\nInstall R from www.r-project.org (free, open source).\nInstall RStudio Desktop from www.rstudio.com (free, open source license).\nDownload the sample R code provided with this publication, “PLSR_Sample_Code.R” and save it to the same folder that contains the data spreadsheet. Open the code file in RStudio.\nIn the User Input section, change “dataFileName” to the name of the data spreadsheet.",
    "Carry out the following steps by highlighting the section of code to run and clicking Run in the top right corner of the script.\n\t\t\nLoad necessary R packages, functions, the working directory address, and user input values in RStudio (subsection “Preliminaries”).\nLoad the data into RStudio and prepare raw data for processing by subtracting mean background signal from all measurements and z-scoring each analyte (subsection “Read Data and Subtract Background”)(Figure 8A).\nPerform partial least squares regression in RStudio using the plsRglm package v1.2.528 available on the Comprehensive R Archive Network (CRAN). Perform a varimax rotation (stats package v3.6.2)23 in the LV1-LV2 plane to identify a new horizontal axis that best separate samples by the response variable (subsection “PLS”)(Figure 8B).\nConduct a Leave One Out Cross Validation (LOOCV) in which one sample is iteratively left out of the data and the PLSR model is re-computed. Compute standard deviation for analyte loadings across all LOOCV runs (subsection “LOOCV”).\nCreate representative plots: Run the provided sample code as detailed above to create representative plots which automatically export as pdf files to the working directory (the folder containing the data and code files).\n\t\nCreate a heat map of the processed data as shown in Figure 8A (subsection “PLS”). Color each entry along a spectrum defined by z-score. Sort analytes by the order computed in the latent variable of interest.\nCreate a scores plot with LV1 scores plotted along the horizontal axis and LV2 scores plotted along the vertical axis, as shown in Figure 8B (subsection “PLS”). Color each data point according to its response variable measurement to visualize the relationship between each latent variable and the response variable.",
    "Create a bar plot displaying loadings for each of your predictor variables to visualize how each analyte contributes to the latent variables, as shown in Figure 8C (subsection “LOOCV”).\nCreate a plot regressing LV1 scores against your response variable to visualize how well the PLSR model separates the samples, as shown in Figure 8D (subsection “PLS”).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}