{
  "id": 18684,
  "origin_website": "Jove",
  "title": "Generation of Induced Pluripotent Stem Cells from Muscular Dystrophy Patients: Efficient Integration-free Reprogramming of Urine Derived Cells",
  "procedures": [
    "NOTE: Patients and/or their guardians should give informed consent to participate in an Institutional Review Board approved study.\n1. Buffers and Media Preparations\nWashing buffer: To prepare 100 ml of washing buffer, add 1 ml of 100x pen/strep Solution (100 U/ml penicillin + 100 µg/ml of Streptomycin) to 99 ml of phosphate buffer saline (PBS).\nUrinary Progenitor Cell (UPC) Medium: To prepare UPC medium, mix equal volumes of Keratinocyte Serum Free (KSF) Medium + Progenitor Cell Medium.\n\t\nKSF Medium: To prepare keratinocyte medium, add 5 ng/ml of epidermal growth factor (EGF), 50 ng/ml of bovine pituitary extract (BPE), 30 ng/ml of cholera toxin, and pen/strep solution (100 U/ml penicillin, 100 µg/ml streptomycin) to 500 ml KSF medium.\nProgenitor Cell Medium: Add three quarters of DMEM with one quarter of Ham-F12 media and supplement with 10% FBS, 0.4 µg/ml hydrocortisone, 0.1 nM cholera toxin, 5 ng/ml insulin, 1.8 x 10-4 M adenine, 5 µg/ml transferrin, 2 x 10-9 M triiodo thyronine, 10 ng/ml EGF, and pen/strep solution.\nhES Medium: Add 20% KO-serum replacement (K-SR), 1x MEM non-essential amino acids, 2 mM l-glutamine, 100 µM β-mercaptoethanol, 20 ng/ml bFGF and pen/strep to 400 ml DMEM/F12 medium.\n2. Urine Sample Collection\nInstruct the patients to drink fluids 30 min prior to urine collection to ensure that an adequate amount (~30–40 ml) of urine can be collected.\nGive the patients and/or their guardians a urine collection kit containing the following items: (1) written instructions on how to obtain sterile or clean catch urine sample, (2) moist anti-bacterial toilettes, and (3) a 100 ml sterile specimen collection cup. Instruct patients to collect sample.",
    "Immediately place the urine samples on ice and transfer to the laboratory in a cooler. Process the urine for cell isolation immediately. If a delay is unavoidable, store the specimen on ice for up to 4 hr with minimal loss of cell viability.\n3. Isolation and Expansion of Urine Cells\nNOTE: Perform the following steps under sterile conditions in a BSL2 Biological Safety Cabinet.\nUsing sterile pipettes, transfer urine samples to sterile 50-ml centrifuge tubes. Centrifuge at 400 × g for 10 min at RT.\nAspirate the supernatant leaving 1 ml in the tube; be careful not to disturb the cell pellet.\nResuspend and combine the pellets from multiple tubes into 7 ml of washing buffer and repeat centrifugation at 400 × g for 10 min at RT.\nCarefully aspirate the supernatant, leaving the cell pellet and ~0.2–0.5 ml of supernatant. Resuspend in 2–3 ml of Urinary Progenitor Cell (UPC) medium and transfer the suspension into 4–6 wells of an uncoated 24-well plate.\nAfter 72 hr, supplement the culture with 0.5 ml of fresh UPC medium per well and change medium every 2–3 days after. The erythrocytes and squamous cells that do not attach to the plate will be removed with the medium changes.\nMonitor culture after 4–6 days.\n\tNOTE: Small 2–4 cell colonies will start to appear. Cells will be rounded or elongated which represent type I or type II of renal epithelial (RE) cells respectively3.\nChange the medium every 2–3 days since once the cells appear, they will undergo a rapid expansion phase.\nOnce the cells reach 80–90% confluence, around 9–15 days after plating, dissociate and passage the cells (15,000–18,000 cells/cm2) onto 2–4 wells of 24 well plate for further expansion. Mark this as cell passage 1 (P1).",
    "Characterize urine cells for lineage specifications through flow cytometric analysis, immunohistochemical staining or through reverse transcriptase-polymerase chain reaction (RT-PCR).\nReprogram isolated urine cells (section 4) or freeze them down in Freezing Medium (DMEM supplemented with 10% serum and 10% DMSO) for long-term cryostorage.\n4. Urine Cell Reprogramming Using Sendai Virus\nNOTE: The proper handling and the use of PPE (personal protective equipment) is recommended while manipulating the transfecting agents. Perform the following steps under sterile conditions in a BSL2 Biological Safety Cabinet. The proper disposal of transfecting agent and/or transfected cells is recommended to avoid risk of environmental and health hazards. For urine cell reprogramming, use a Sendai Reprogramming Kit with modifications to the manufacturer’s feeder-dependent protocol as detailed below.\nTo ensure high efficiency reprogramming using the Sendai virus, use passages 1–5 of urine cells that are rapidly dividing. If the cells do not replicate well or become senescent, discard them as they will not reprogram efficiently.\nSeed 60,000 cells per well in two wells of a 6 well plate. Mark this as Day -2. Adjust cell seeding density (5 x 104 – 9 x 104 cells per well) as needed to reach 80–90% confluence by Day 0.\nOn Day 0 (48 hr after plating the cells), prepare the Sendai reprogramming vectors (SeV) containing each of the four OSKM factors. Add each of the vectors to 1 ml of pre-warmed UPC medium. Use an MOI of 1–1.5 (5–7.5 x 105 CIU), which is sufficient for reprogramming urine cells. Aspirate the medium and slowly add the 1 ml UPC + SeV to one well of the urine cells. Use the second well as the transduction negative control.",
    "On Day 1, replace the UPC + SeV medium with fresh UPC medium. Some cell death is seen after 24 h due to viral cytotoxicity.\nDepending on efficiency of reprogrammed clone formations and the compact morphology, keep changing the medium daily until day 6 or 7.\nOne day prior to dissociation of transduced cells (day 5 or 6), prepare MEF feeder plates by plating Mitomycin-C (10 µg/ml for 3 hr) treated-MEFs at density of 5 x 104 cells/cm2, on 0.1% gelatin coated 100 mm2 culture dishes.\nNext day (day 6 or 7), dissociate the cells with 0.25% trypsin, resuspend the cells in UPC medium and plate 5 x 104 – 2 x 105 cells/100 mm2 MEF feeder plate.\nThe following day, switch to hES medium and change the medium every day. Observe the cells under a microscope to monitor transformed cells.\n\tNOTE: The cells form clonal aggregates with characteristic cobblestone morphology and having higher nucleus to cytoplasmic ratio (12–18 days post transduction).\nWithin two to three weeks after transduction, pick colonies and transfer to new plates for clonal expansion.\nPerform live cell staining for selecting iPSC clones by incubating cells with TRA-1-81 antibody for 1 hr at 37 °C in CO2 incubator followed by counter staining with specific florescent dye conjugated secondary antibody for 1 hr at 37 °C in CO2 incubator.\nUse a 26 G 1½ inch needle to cross-hatch the larger TRA-1-81 positive iPSC clones into small equal sized pieces (4–6 pieces per clone).\nUse a sterile pipette-tip to pick and transfer 10–20 cross-hatched pieces from multiple clones into each well of Matrigel (10 µg/cm2)-coated 24 well plate with hES medium.\n\tNOTE: Pieces from a single clone plated individually into a single well do not expand or maintain pluripotency.",
    "Change from hES to iPSC medium 24–48 hr after the reprogrammed clones are attached to the Matrigel surface.\nDuring maintenance on Matrigel-coated plates, manually scrape-off any differentiated cells or contaminating MEF feeder cells using a pipette-tip to enrich for fully reprogrammed and pluripotent dystrophic iPSC (MD-iPSC) clones.\nAfter individual clones have reached ~100 μm size, expand the clones by dissociating with 0.48 mM EDTA (ethylenediaminetetraacetic acid) solution for 3 min and plating small cell aggregates of MD-iPSCs suspended in iPSC medium (supplemented with 5 μM Y27632, RhO Kinase inhibitor) on fresh matrigel (10 µg/cm2) coated 12 well plate. Change iPSC medium daily.\nFull reprogramming of each clone can be determined by both gene expression analysis of OSKM genes and immunohistochemical staining of pluripotency markers (Oct3/4 and TRA-1-81). A rigorous evaluation of pluripotency potential should be employed to confirm fully reprogrammed iPSC lines can differentiate into three germ layers. This can be accomplished either by embryoid body (EB) formation and differentiation assay or a teratoma formation assay.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}