{
  "id": 1690,
  "origin_website": "Cell",
  "title": "Protocol for Designing Small-Molecule-Regulated Destabilizing Domains for In Vitro Use",
  "procedures": [
    "Step-by-Step Method Details\nStep-by-Step Method Details\nLentivirus Production of the ecDHFR-DD-POI Construct\nTiming: 3–4 days\nHere we detail the steps required for the production of lentivirus encoding for the ecDHFR-DD-POI fusion protein. The virus produced can then be used to infect a cell line of interest and generate a stable cell line expressing the ecDHFR-DD fusion protein. While non-viral methods can be utilized, the use of a stable cell line is ideal for subsequent experiments to ensure reproducibility. While transducing cells with lentivirus often results in a heterogenous polyclonal population due to variations in the number of integration copies of the ecDHFR-DD-POI construct and the genomic context which influences their expression, we have found such cell lines to be sufficient for the purpose of validation experiments. It is up to the user whether they wish to generate single colony clones, which will take much more time.\nWe recommend the use of HEK-293T cells for their high transfection efficiency and resulting high levels of lentivirus titer. Cells should be low passage (< P10) and cultured with DMEM containing high glucose supplemented with 10% fetal bovine serum (FBS) and 1X penicillin/streptomycin/glutamine (PSQ). Lipofectamine 3000 provides excellent transfection efficiency in these cells.\nIn a 6-well plate, add 1 mL of Poly-D-Lysine and tilt plate to coat the well evenly. Allow the plate to sit at room temperature (20°C–23°C) for 5 min.\nTrypsinize the HEK-293T cells using 0.25% trypsin-EDTA and perform a cell count using a hemocytometer.\nRemove the Poly-D-Lysine and wash the well with 1 mL of media. Poly-D-Lysine can be toxic at high concentrations, so it is important to aspirate any that is remaining and unbound. Aspirate the media from the well.",
    "Plate 1 × 106 HEK-293T cells in a total volume of 1.5 mL into each well. Allow cells to attach overnight (14–18 h). Use one well of a 6 well for each lentivirus construct wished to be produced.\nFor each reaction, combine 125 μL of Opti-MEM medium with 5 μL of P3000 reagent, 1.43 μg of viral packaging DNA (psPAX2 plasmid), and 476 ng of viral envelope DNA (VSV-G is recommended due to its broad tropism, this is included in the pMD2.G plasmid). Finally, add 595 ng of the pLenti plasmid DNA containing the ecDHFR-DD fusion gene (pLenti CMV Puro plasmid, for example, as the vector backbone). Vortex for 10 seconds and incubate at room temperature (20°C–23°C) for 2 min.\nNote: As a positive control, we suggest to use ecDHFR-DD fused to a fluorescent protein such as YFP [https://www.addgene.org/73188/[href=https://www.addgene.org/73188/]] to gauge transfection/infection efficiency and to also estimate how well the ecDHFR-DD would be turned over/stabilized under idealistic conditions. Additionally, we prefer to use the pLenti CMV Puro backbone because of the rapidity with which stable cells can be generated under puromycin-selection conditions.\nNote: it is highly recommended to use high-quality DNA originating from endotoxin-free midi/maxi preps for each of the above listed DNAs.\nNote: The described transfection is utilizing second-generation lentivirus (three plasmid system). We find this to be a nice compromise between safety and sufficient titers. However, if the user so desires, third-generation lentivirus (four plasmid system) could also be utilized for increased safety and lower risks of replication-competent events.\nFor each reaction, in another tube combine 125 μL of Opti-MEM medium with 7.5 μL of L3000 reagent.",
    "Combine the volumes from steps 5 and 6, vortex for 10 seconds, and incubate at room temperature (20°C–23°C) for 5–10 min. During this time, the transfection complex forms. This is your transfection reagent.\nGently pipette the 250 μL of transfection reagent into the existing media in the well containing the HEK-293T cells which were seeded the day before. Rock the plate gently to mix.\n6 h post transfection, aspirate the existing media and add 2 mL of fresh media. Continue incubation overnight (14–18 h).\nNote: at this point, we consider that the cells are producing lentivirus, so it is important to bleach (1%–2% final concentration, 20 min at room temperature (20°C–23°C)) all waste material and pipette tips that have encountered the media at this point. We routinely use Clorox wipes to disinfect biosafety cabinet working surfaces.\nNote: we also recommend using aerosol barrier tips to prevent contamination of pipettes with lentivirus.\n24 h post transfection, the media in the well will contain virus. Collect this media while utilizing the proper safety equipment and technique into a 15 mL conical tube. Store this media at 4°C and add 2 mL of fresh, warm media to the well.\n48 h post transfection, collect the media once again and add to the 15 mL conical tube described in step #10. Bleach and discard the 6-well plate.\nFilter the collected media through a 0.45 μm PES filter and aliquot into single use screw top tubes. We recommend using up to 500 μL per vial. The lentivirus can be used immediately or frozen at −80°C for later use. This is an appropriate pause point, if necessary.",
    "Note: The collected virus is crude, and viral titer will vary from batch to batch. If one will be producing multiple viruses for comparison, it is best to perform the virus production simultaneously. Nonetheless, crude virus will suffice for the purposes of this protocol. If a better handle on viral titer is desired, the user can also perform a p24 ELISA or functional titer (e.g., Crystal violet staining) to more accurately determine and normalize titers.\nNote: The VSV-G envelope protein will not tolerate freeze-thaws. A >10-fold reduction in titer can be expected if the lentivirus is frozen and thawed. We highly recommend storing it as single use frozen aliquots.\nNote: Using a filter pore size of 0.22 μm or less in step #12 will shear the virus and compromise its ability to infect cells.\nGenerate a Stable Cell Line Expressing the ecDHFR-DD-POI\nTiming: 1–2 weeks, 1–2 months if selecting single colony clones\nHere we describe the use of crude lentivirus extract to generate a stable cell line expressing the ecDHFR-DD-POI construct. The amount of crude lentivirus media used will vary depending on how easily the target cell line is infected.\nPlate target cells (e.g., ARPE-19) to be infected with lentivirus at a density of 1 × 105 cells/well of a 12 well (or scale accordingly). Allow to attach overnight (14–18 h).\nNote: while ARPE-19 cells tolerate (and even prefer) confluent conditions, one may have to adjust the seeding density according to their cell type of choice.\nNote: always include an additional well that will serve as uninfected cells. These cells should die quickly after prolonged incubation with the selective antibiotic, whereas infected cell should survive.",
    "Dilute polybrene into full DMEM media to reach a final concentration of 1–10 μg/mL. Make enough media to cover cells in their appropriate dish. For ARPE-19 cells, we use 1 μg/mL polybrene.\nNote: the final concentration of polybrene used will depend on the cell line selected for stable cell generation. Prolonged polybrene use can kill cells or cause differentiation (when used on ARPE-19 cells). Other cells (293-based, for example) are remarkably resilient to polybrene.\nThaw a single lentivirus aliquot at room temperature (20°C–23°C). For each well to be infected, transfer 50–100 μL into the appropriate amount of polybrene-containing media.\nRemove old media on cells, add polybrene/lentivirus containing media on top, incubate for 24 h. Alternatively, for suspension cells, spinoculation can be used.\nAfter 24 h, change the media and replace with fresh media. Allow cells to recover.\nAfter another 24 h (48 h post infection), add media containing the appropriate selective antibiotic. For puromycin selection, we use 1 μg/mL.\nReplace the media every 2–3 days with new media containing the selective antibiotic. Continue to expand the cells during this period and monitor them under the microscope. Inclusion of selective antibiotic during the passaging can help accelerate the selection process. The resulting population is polyclonal so we recommend continued use of the selective reagent for at least 3–5 passages after initial selection to ensure stable integration. If the ecDHFR-DD-POI is suspected to be toxic, we recommend to continuously include selective antibiotic during all subsequent culturing and passaging, except for experiments.",
    "Note: if there is no apparent cell death 1–2 weeks after antibiotic addition, verify that your cells did not initially contain a selective antibiotic cassette. For example, HEK-293T cells are inherently resistant to G418 after introduction of the large T-cell antigen. Thus, this antibiotic cannot be used for stable cell selection in HEK-293T cells. Alternative explanations for the lack of cell death could be a complete, 100% infection rate, or high-resistance to the selective antibiotic.\nEvaluating ecDHFR-DD-POI Basal Abundance and Dynamic Range in Newly Generated Stable Cell Lines\nTiming: 3–4 days\nOnce the stable cell line(s) is/are established, it is important to evaluate initial basal and stabilized expression of the ecDHFR-DD-POI transgene using western blotting and quantitative polymerase chain reaction (qPCR), regardless of the actual desired activity of the construct. This will allow one to evaluate basal expression in the absence of stabilizer and the dynamic range when stabilizer is added. Significant increases in ecDHFR-DD-POI should be observed at the protein level (e.g., western blot) after stabilization, but not at the mRNA (e.g., qPCR) level as the stabilizer works at the protein, not transcript level. Initially we describe how to accomplish this using the canonical ecDHFR ligand, TMP, but later describe the possibility to use alternative stabilizing molecules with potentially complementary functions to the ecDHFR-DD-POI. (see Figures 3[href=https://www.wicell.org#fig3] and 4[href=https://www.wicell.org#fig4] for data obtained using stable cell lines).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/115-Fig3.jpg\nFigure 3. Whole-Well Fluorescence Analysis Provides a Convienent, Sensitive, and Accurate Quantitation Method for ecDHFR-DD Stabilization\nExample whole-well microscopy obtained on a Celigo Imaging Cytometer (Nexcelom Bioscience, Lawrence, MA) of stable, lentivirus-infected ARPE-19 ecDHFR-YFP cells treated with either DMSO (A), 2,4-diaminoquinazoline (B), or TMP (C) for 24 h. Note the very low apparent basal fluorescence in (A) compared to Figure 1[href=https://www.wicell.org#fig1]A. Scale bar, 2 mm.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/115-Fig4.jpg",
    "Figure 4. Newly Identified Stabilizers Demonstrate Unique Dose-Response Curves\nExample dose-response curve obtained using high content imaging in stable ARPE-19 ecDHFR-YFP cells after treatment with stabilizers of varying potency. Images and fluorescence were measured on the IN Cell Analyzer 6000 (GE Healthcare, Chicago, IL). Data are represented as mean ± SD.\nTrypsinize or detach the cells from the culture vessel, determine the cell count, and dilute to the preferred seeding density. For ARPE-19 cells, we use a concentration of 1 × 105 cells/well of a 12 well for western blotting and qPCR. Allow cells to attach overnight (14–18 h).\nNote: If your ecDHFR-DD-POI has a reporter attached to it, such as a fluorescent protein or a luciferase, it is possible to perform higher-throughput assays (i.e., 96-well plates) after confirming that western blotting and the reporter assay are in accordance.\nDissolve TMP in DMSO to a final concentration of 100 mM. Make small aliquots of this stock and store at −20°C, avoid more than 5 freeze-thaw cycles.\nUsing serial dilution, prepare media with compound concentrations ranging from 100 μM down to 1 nM in 10-fold dilutions. This range should capture the full dynamic range of TMP. In addition, prepare a negative control with an equal volume of DMSO as the highest concentration dilution.\nTreat cells for 24 h.",
    "For western blotting, harvest cells by washing with Hank’s buffered salt solution (HBSS) followed by in-well lysis using radio immunoprecipitation precipitation assay (RIPA) buffer supplemented with benzonase (0.05 - 0.1 U/μL final concentration) and protease inhibitor. Rock multiwell plate for 2 min at room temperature (20°C–23°C), then transfer cell lysate to a microcentrifuge tube. Spin the lysate at 21,100 × g at 4°C for 10 min. Transfer the supernatant to a new tube and freeze at −20°C until further use. This is an appropriate pause point, if necessary. When ready, normalize soluble protein content using a bicinchoninic acid (BCA) assay or similar kit. Proceed with conventional western blotting procedures. While antibodies used will depend on the ecDHFR-DD-POI, one can also consider using a polyclonal ecDHFR antibody that works very well for western blotting (custom-made by Pacific Immunology, provided by Prof. Eugene I. Shakhnovich, Harvard University). (see Figure 2[href=https://www.wicell.org#fig2] for example western blotting data originating from transiently transfected cells followed by stabilization)\nThe user should also note that the resulting dose-response curve is sigmoidal when graphed logarithmically, and while the raw values may fluctuate, the half-maximal activity value (AC50) should remain consistent. The curve will eventually flatten at higher concentrations (usually between 1 μM and 10 μM), indicating maximal stabilization of the DD. Based on the individual construct, this may occur at differing concentrations, or it may even lay outside the range of assayed concentrations, indicating a wide dynamic range. A wide dynamic range can indicate efficient and rapid turnover of the DD at lower concentrations. Conversely, a more moderate dynamic range may indicate increased stability at lower concentrations or at basal levels. (see Figure 4[href=https://www.wicell.org#fig4] for example data demonstrating these phenomena)",
    "For qPCR analysis, wash cells with HBSS followed by trypsinization for 3–5 min at 37°C, neutralize with full media, spin cells at 900 × g at 4°C for 5 min, wash with cold HBSS, spin again at 900 × g at 4°C for 5 min, aspirate, and freeze pellet at −80°C until further use. This is an appropriate pause point, if necessary. Extract RNA using any number of methods, we use the Aurum Total RNA Mini kit (BioRad), followed by cDNA synthesis using qScript SuperMix (Quantabio). As with western blotting, qPCR primers or TaqMan probes will be dependent on the ecDHFR-DD-POI that is used (see Figure 5[href=https://www.wicell.org#fig5] for example qPCR versus reporter signal data +/- TMP in mice).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/115-Fig5.jpg\nFigure 5. Confirmation of ecDHFR-DD Regulation at the Protein, Not Transcript Level\nExample data demonstrating no changes at the mRNA level of NanoLuc (NLuc) or ecDHFR-firefly luciferase (FLuc) after TMP administration, but obvious high levels of luminescent signaling of the ecDHFR-FLuc reporter. Mice were intravitreally injected with adeno-associated virus encoding for a constitutively expressed NLuc and ecDHFR-FLuc. Next, mice were treated with TMP (1 mg via gavage) or remained untreated. Bioluminescence was measured in 3 mice before and after 6 h of TMP treatment on the IVIS Spectrum (PerkinElmer Inc., Waltham, MA). Neural retina were then harvested from all mice and processed for qPCR measuring NLuc and FLuc transcripts. qPCR was performed on a QuantStudio 6 (Life Technologies, Carlsbad, CA). Data are represented as mean ± SD. FLuc signal is a single value.\nIt is important to confirm that if leaky levels of the ecDHFR-DD-POI are observed, that such levels are not sufficient to activate or repress signaling on their own, in the absence of the small molecule stabilizer.\nEvaluating ecDHFR-DD-POI Activity in Newly Generated Stable Cell Lines",
    "Subsequent to evaluation that TMP predictably and effectively elevates ecDHFR-DD-POI abundance, the next step is to confirm that indeed the ecDHFR-DD-POI is active and functions as expected when stabilized. In many cases, one could use the cell lysates or cDNA that were obtained in the previous section to confirm this. Alternatively, one can culture or treat cells with the necessary pharmacologic or genetic perturbations to evaluate their expected activity. For example, previously, we fused ecDHFR-DD to IκBα, an inhibitor of NFκB, a proinflammatory transcription factor (Vu et al., 2017[href=https://www.wicell.org#bib25]). To evaluate the ecDHFR-DD activity, we stabilized ecDHFR-DD-IκBα and then treated ARPE-19 cells with a pro-inflammatory cytokine, interleukin 1α (IL1α). Subsequently, we evaluated NFκB translocation to the nucleus (something that IκBα would prevent if active) and the expression of downstream cytokines, IL-1β and IL-6 by ELISA and qPCR.\nUsing an assay specific to the construct, basal levels of the ecDHFR-DD-POI should be assessed to verify that under untreated conditions, the abundance of the fusion protein is negligible. Such assays may include fluorescent or luminescent reporter assays, translocation assays, morphometric assays, ELISAs, western blots, or qPCR. Dose-response curves are recommended. The appropriate timing of stabilization will have to be determined experimentally and will depend on several factors including unknown repressive signaling pathways, xenobiotic removal pathways, and endogenous feedback loops.\nUsing Non-TMP ecDHFR-DD Pharmacological Stabilizers – the Potential for Synergistic Signaling Regulation\nTiming: up to 4–5 days",
    "While TMP is the canonical stabilizer for the ecDHFR-DD, we have found that non-antibiotic TMP derivatives (Peng et al., 2019[href=https://www.wicell.org#bib17]) or other compounds containing the 2,4-diaminopyrimidine (or triazine) ring with an aryl group (Ramadurgum et al., 2020[href=https://www.wicell.org#bib20]) can also promote ecDHFR-DD-POI abundance, and thus be used to conditionally control cellular signaling. Interestingly, the chemical space that can stabilize the ecDHFR-DD appears to be rather vast. This opens up the possibility of using a non-TMP small molecule to simultaneously stabilize the ecDHFR-DD, but also act on another endogenous supporting pathway to achieve a potentially synergistic response. Based on our work thus far, such endogenous pathways include, but are not limited to cFMS kinase inhibition, PI3Kγ/δ inhibition, P2X3 and P2X2/3, ENaC, and pharmacological chaperoning of other proteins.\nAs a starting point, one can begin using already validated compounds described in (Ramadurgum et al., 2020[href=https://www.wicell.org#bib20]), or they could source from the list of virtually identified compounds (Table S1 in Ramadurgum et al., 2020[href=https://www.wicell.org#bib20]) most of which were not validated. (see Figure 6[href=https://www.wicell.org#fig6] for example stabilizers)\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/115-Fig6.jpg\nFigure 6. Examples of Validated Potential Stabilizers that Contain the Minimum 2,4-diaminopyrimidine/Aryl Structure for ecDHFR-DD Stabilization\nProceed with performing dose-response curves and downstream evaluation as described above in “Evaluating ecDHFR-DD-POI Basal Abundance and Dynamic Range in Newly Generated Stable Cell Lines[href=https://www.wicell.org#sec3.3]”.\nNote: Even in DMSO, some of the 2,4-diaminopyrimidine compounds are poorly soluble and must be warmed at 37°C to dissolve completely. Additionally, it is possible that DMSO solubility may max out at 500 μM, unlike TMP, which is soluble >100 mM in DMSO. Nonetheless, it is important to try minimize the final DMSO concentration and keep it below 0.5% to reduce off-target disturbances of the cells.",
    "Note: TMP and its derivatives for the most part have limited water solubility (∼0.2 mg/mL for TMP [∼690 μM]). Nonetheless, this amount of soluble TMP is certainly sufficient for basic in vitro studies as well as for in vivo regulation as long as sufficient amounts of this solution is used/imbibed (Datta et al., 2018[href=https://www.wicell.org#bib8]). Additional solubility can be achieved through pH reduction and generation of salt forms of 2,4-diaminopyrimidine-containing compounds or TMP. For example, TMP sulfate found in POLYTRIM® eye drops is soluble to at least 1 mg/mL at pH 4.0–6.2.\nNote: The virtual screen that we performed searched for 2,4-diaminopyrimidine-containing molecules, but did not specifically screen for 2,4-diaminotriazine molecules, which would further expand the available set of molecules for ecDHFR DD stabilization.\nIf the user is unable to find an existing molecule, they could rationally design and synthesize one. Theoretically, part of another molecule can be fused to TMP at the 4′ phenyl position without compromising its stabilizing activity to a high degree (see Figure 7[href=https://www.wicell.org#fig7] for example stabilizing compounds with modification at the 4′ phenyl site).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/115-Fig7.jpg\nFigure 7. The 4' Phenyl Position of the TMP Scaffold is a Well-Tolerated Modification Site for Custom ecDHFR-DD Stabilizers\nExample validated ecDHFR-DD stabilizers with a TMP scaffold, but 4′ phenyl modifications that are apparently well tolerated in the ecDHFR structure, which also renders the new compounds inactive (or inefficient) antibiotics.\nEvaluation and Reduction of Stabilizer Off-Target Activity",
    "When using small molecule stabilizers (including TMP), it is important to note potential adverse side effects due to the small molecule. As a compound that binds tightly to ecDHFR, TMP is an effective antibiotic. Similarly, many TMP analogs are also antibiotics. If the desire is to use one’s ecDHFR-DD-POI in vivo, we feel that it is sub-optimal to use a compound that could potentially disrupt the brain-gut axis (Carabotti et al., 2015[href=https://www.wicell.org#bib3]) through disruption of gut microbiome. Furthermore, if thinking very long term, towards potential translation in humans, development of antibiotic resistance is also a significant concern. Surprisingly, though, subtle modifications of the base TMP structure can compromise its antibiotic properties while not appreciably changing its ability to regulate an ecDHFR-DD-POI.\nAdditionally, TMP is a highly specific compound with a >10,000 fold affinity for ecDHFR versus human DHFR (hsDHFR). Modifications to the TMP structure lead to the likelihood that the compound could become more promiscuous and target other DHFRs, which is undesirable. Specifically, hsDHFR is involved in de novo synthesis of nucleotides, meaning that hsDHFR inhibitors are likely to be toxic to highly proliferative cells that rely heavily on such pathways , such as immune cells or cancer cells (Villa et al., 2019[href=https://www.wicell.org#bib24]). To test whether newly identified stabilizers inhibit hsDHFR, a simple commercially-available assay kit (Sigma) can be used.\nBacterial Growth Assay\nTiming: 48 h\nTo rule out antibiotic activity of a newly identified small molecule, we recommend testing both gram-positive (e.g., S. aureus) and gram-negative (e.g., E. coli) bacteria, incubating wild-type bacterial cultures with the small molecule compounds for 24 h. In the interest of preventing cross-contamination, the user should perform separate bacterial growth assays for the gram-positive and gram-negative strains. (see Figure 8[href=https://www.wicell.org#fig8] for an example plate layout and basic protocol).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/115-Fig8.jpg",
    "Figure 8. Layout and General Procedure for Performing 96 Well Bacterial Growth Assays\nGrow wild-type (WT) E. coli cultures (e.g., BW25113 or MG1655) overnight (14–18 h) in 25 mL M9 minimal media (supplemented with 0.4% [w/v] glucose and 0.2% [w/v] amicase) at 37°C. If using gram-positive bacteria, we recommend WT RN4220 S. aureus grown overnight (14–18 h) in Luria-Bertani (LB) broth at 37°C.\nNote: We have found that growth inhibition curves of TMP in S. aureus in LB seem to be shifted towards less growth inhibition than expected, possibly because of the levels of thymidine in LB. To avoid this, one could alternatively use brain-heart-infusion (BHI) broth.\nMeasure the optical density (OD600) of the overnight culture and dilute it to an OD = 1 × 10−4 in M9 minimal media or LB broth, depending on the culture.\nNote: Do not dilute less than 20 μL into the corresponding media. Pipetting such small amounts of cultures can result in inconsistent dilutions and uneven growth.\nTo fully evaluate bacterial growth under all possible conditions, growth must be assessed with the positive control ligand TMP, the small molecule of interest, DMSO, and only media. In this respect, the user is able to confirm the antibiotic activity of TMP, potential antibiotic activity from the small molecule of interest, potential toxicity from DMSO, and growth under ideal conditions in plain media. Furthermore, prepare media without bacteria to function as a blank when comparing OD. To fully use the 96-well plate, we suggest testing the small molecule across 8 dilutions in triplicate (24 wells total). In this regard, the user can conveniently dilute vertically in serial dilutions. Four different compounds can be evaluated within a single 96 well plate (see Figure 8[href=https://www.wicell.org#fig8] for an example plate layout).",
    "In the experimental wells, add 100 μL of minimal media or LB media to each row except the very first within the set of 8 dilutions. This is to prepare the wells for the serial dilutions described in step 34.\nPrepare stock concentrations of compounds (10 mM or 100 mM in DMSO).\nPrepare 600 μL of 100 μM of TMP and any other stabilizing compounds in M9 or LB media. Make an equivalent dilution of DMSO to serve as a vehicle control. Using a 12 well multichannel pipette, prepare dilutions by adding 150 μL of 100 μM compound to the first well (which was purposely left empty), mix, and take 50 μL to add to the next well (a 3-fold dilution). Mix the second well and continue to transfer 50 μL across the remaining wells in a similar pattern. Discard the last 50 μL originating from the last dilution well. Add 100 μL of media containing diluted bacteria to all wells (except for media only wells). The first well should have a concentration of 50 μM and the last should be 0.02 μM as the final concentration.\nCritical: DMSO is also serially diluted out in its own wells in a similar way to compound dilution. This is important to assess whether DMSO itself may have adverse effects on bacterial growth.\nSeal plates with an acetate sticker or similar cover, incubate at 37°C at 200–250 rpm for 24 h.\nAfter 24 h, measure the OD600. We perform this assay as an endpoint reading. Alternatively, one can also perform a kinetic read, if desired, and if they have a plate reader with such capabilities.\nCritical: All handling and experimentation during the bacterial growth assay should be under sterile conditions using a flame.\nDetermining Dynamic Stabilization and Destabilization Effects of New Compounds",
    "Timing: 48 h\nUp to this point, we have mainly suggested the use of a stabilizer in a dose-response curve at a (somewhat) arbitrary timepoint of 24–48 h (since that is when maximal stabilization occurs). However, one unique aspect of the destabilizing domain is the ability to turn “off” the strategy simply by removing (and washing out) the small molecule stabilizer. Different stabilizing compounds will vary in terms of their kinetics of stabilization and destabilization once removed. For example, we found that TMP analogs ormetoprim and diaverdine were able to stabilize to similar degrees at 10 μM after 24 h, but once removed, ecDHFR-YFP fluorescence reduced more quickly to baseline (Ramadurgum et al., 2020[href=https://www.wicell.org#bib20]) than with TMP. Thus, such a compound could turn “on” with similar kinetics, but once removed, would result in quicker “off” rates of signaling. Conversely, compounds such as methotrexate stabilized and maintained ecDHFR-DD abundance well after removal, allowing for sustained regulation of abundance (Ramadurgum et al., 2020[href=https://www.wicell.org#bib20]). If new compounds are used for stabilization of the ecDHFR-DD-POI, we recommend testing their ability to dynamically stabilize and destabilize. The easiest method to evaluate the kinetics of a stabilizer is through a fluorescent or luminescent reporter gene. If this is not available to the user, we recommend performing an ELISA or possibly dot blot to directly measure fusion protein abundance at multiple concentrations and timepoints in a multiwell format.\nTrypsinize or detach the stable cells from the culture vessel, determine the cell count, and dilute to the preferred seeding density.\nPlate cells at 1 × 104 cells/well in a 96-well plate and allow to attach overnight (14–18 h).",
    "The next day, dissolve the small molecule compound in the chosen solvent at a concentration of 100 mM. We recommend DMSO as it can dissolve a variety of compounds - both polar and nonpolar.\nNote: Some 2,4-diaminopyrimidine-containing compounds must be warmed to dissolve completely. In addition, certain compounds may not dissolve at concentrations of 100 mM, 10 mM, or even 1 mM.\nUsing serial dilution, prepare media with compound concentrations ranging from 100 μM to 1 nM using 10-fold dilutions. Make sure to resuspend each dilution to achieve the most consistent results. This range can usually capture the dynamic range of a compound. In addition, prepare a negative control with an equal volume of DMSO as the highest concentration of dilution.\nNote: We recommend performing dose-response in triplicate with at least 3–6 wells for the DMSO negative control.\nAspirate the old media from the wells and add 100 μL of compound-containing media to the wells. This timepoint is considered t = 0 h.\nThe user can harvest the cells at select timepoints, or if a fluorescent or non-lytic luminescent reporter is used, one can measure in well until a plateau has been reached (typically 24 h). We recommend 2, 4, 6, 8 and 24 h “on” timepoints.\nAfterwards, remove the treated media, wash the cells with an isotonic buffer such as HBSS. We recommend either washing twice with 100 μL or washing once with a larger volume such as 200–300 μL.\nAt this point, the user can measure stabilization at various timepoints until the final timepoint (typically 48 h). Again, if possible, we recommend using 2, 4, 6, 8, 24, and 48 h “off” timepoints."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}