{
  "id": 3934,
  "origin_website": "Cell",
  "title": "Isolation of human bone marrow stromal cells from bone marrow biopsies for single-cell RNA sequencing",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIsolation of BM cells and stromal cells from trephine biopsy\nTiming: ∼20 min per biopsy\nThis step describes the isolation of hematopoietic and non-hematopoietic BM cells by flushing and crushing the trephine biopsy. This sample includes both a bone fragment and bone marrow cells and is usually taken to identify hematological abnormalities. The trephine biopsy includes a bone fragment that needs to be flushed/crushed in order to isolate BM cells. This step should be performed as quickly as possible after the biopsy has been taken to maximize cell viability and quality for downstream analysis and applications. Additionally, it is recommended to work quickly and efficiently, and to keep cell fractions at 4°C if possible.\nClean a biohazard safety cabinet or sterile working area, as well as any small equipment (pipettes, tweezers) with 70% ethanol.\nClean a mortar and pestle with 70% ethanol. Remove the ethanol from the mortar and pestle and allow it to air dry (∼5 min) in a sterile biohazard safety cabinet. Rinse the mortar and pestle with sterile PBS just prior to use (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/656-Fig2.jpg\nFigure 2. Preparation of the flush/crush and bone chips fractions from the bone marrow biopsy\n(A) A cleaned mortar/pestle and a 70 μm cell strainer is placed on a 50 mL Falcon tube.\n(B) The BM biopsy is flushed with a 1 mL insulin syringe or using a P1000 pipette tip into the cleaned mortar (or directly through the strainer).\n(C) BM biopsy is placed in clean mortar with 5 mL Cell Isolation buffer (2%FBS/PBS).\n(D) BM biopsy is gently crushed using the pestle, gently tapping directly onto the bone fragments.\n(E) Crushed cells are transferred to the 70 μm cell strainer and collected with the Flushed fraction.",
    "(F) Remaining crushed bone fragments are transferred to a new 50 mL falcon tube and will be digested with Collagenase II enzyme.\nPlace a 70 μm cell strainer over a 50 mL Falcon tube to collect flushed/crushed BM cells (Figure 2[href=https://www.wicell.org#fig2]A).\nUsing a P1000 pipette or a 1 mL Insulin syringe, carefully flush the BM biopsy with 1 mL Cell Isolation buffer (PBS/2% FBS) through the cell strainer into the 50 mL Falcon tube [This will be referred to as the Flush/Crush Fraction] (Figure 2[href=https://www.wicell.org#fig2]B). Repeat this step twice.\nPlace the remaining BM biopsy into a sterile mortar and add 5 mL Cell Isolation buffer (Figure 2[href=https://www.wicell.org#fig2]C).\nCrush the BM biopsy to release the BM cells by gently grinding the pestle onto the biopsy fragment (Figure 2[href=https://www.wicell.org#fig2]D).\nNote: We recommend gently tapping the pestle onto the bone fragments to release as many cells as possible into the buffer.\nNote: To maximise the number of cells that can be analysed downstream, avoid brisk movements that could result in spills and loss of cells.\nCarefully transfer the buffer (approximately 5 mL) from the mortar through the cell strainer into the 50 mL Falcon tube used in step 4 [Flush/Crush Fraction] (Figure 2[href=https://www.wicell.org#fig2]E).\nCentrifuge the Flush/Crush Fraction tube at 300 × g for 5 min at 4°C and discard supernatant.\nResuspend the cell pellet in 300 μl Cell Isolation buffer. It is best to resuspend the pellet gently, in order to prevent clumping. This tube [Flush/crush Fraction] is kept on ice until further processing.\nNote: If clumps do occur during resuspension, filter the cell suspension through a new 70μm cell strainer. However, this leads to a loss of cells, so it should be avoided if possible.",
    "Transfer the remaining bone fragments (bone chips) from the mortar into a second sterile 50 mL Falcon tube [Bone Chip Fraction] (Figure 2[href=https://www.wicell.org#fig2]F). Bone chips will be enzymatically digested with Collagenase II solution, which is used to disrupt extracellular matrix and collagen fibers, in order to release additional stromal cells from the bone fragments.\nRinse the mortar and the cell strainer used in steps 4 and 7 with the prepared 10 mL Collagenase II solution and combine with the Bone Chip Fraction tube. Proceed directly to step 12.\nIsolation of BM stromal cells from bone chips using collagenase digestion\nTiming: ∼2 h\nThis step is performed to release BM stromal cells that remain in the bone fragments that have previously been crushed using enzymatic digestion. This will increase the number of stromal cell populations that are detected in single-cell RNA sequencing and provide the researcher with a broader dataset to analyze.\nSeal the Bone Chip Fraction 50 mL Tube containing bone chips and Collagenase II solution with Parafilm to prevent spills or contamination during incubation step 13.\nPlace the tube in a pre-warmed, shaking incubator and incubate the Bone Chip Fraction tube for 90 min at 37°C under gentle agitation.\nAfter digestion, let the bone chips settle to the bottom of the 50 mL falcon and carefully transfer supernatant through a 70 μm cell strainer into a new 50 mL Falcon tube.\nWash the digested bone chips with 10 mL Cell Isolation buffer and combine supernatant with the new tube used in step 14. Repeat this step and combine supernatant.\nNote: This step significantly reduces cell loss and ensures the transfer of the greatest number of cells for downstream analysis.\nCentrifuge cells at 300 × g for 5 min at 4°C and discard supernatant.",
    "At this point, the cell suspension obtained from bone chips can be combined in a 50 mL Falcon tube with the cell suspension obtained from the flushed/crushed fraction in step 9.\nOptional: Cell counts and viability checks can be performed after step 17 using Trypan Blue and a Countess II FL Automated Cell Counter, or alternative cell counter. Cell counts are useful to determine cell viability (at least >60% live cells) and the total numbers of cells isolated from a specific biopsy and can be used to estimate sorting duration and general cell fitness.\nCritical: Except for the collagenase II digestion, always use solutions stored at 4°C to maintain cell viability.\nStaining of BM stromal fraction for FACS sorting\nTiming: 40 min\nThis step is performed to stain the human BM cell suspension with flow cytometry-specific antibodies to isolate human BM stromal cells using fluorescence-activated cell sorting (FACS). To obtain a more specific BM stromal cell population, we use CD41 and CD61 antibodies to exclude megakaryocytes, CD71 and CD235a to exclude erythroid cells and CD45 to exclude the majority of hematopoietic cells.\nCentrifuge the combined cell suspensions in a 50 mL Falcon tube [Flushed/Crushed Fraction and Bone Chip Fraction] at 300 × g for 5 min at 4°C.\nDiscard supernatant and gently resuspend the cell pellet in 110 μL Cell Isolation buffer.\nAliquot 10 μL cell suspension into a separate 1.5 mL eppendorf and add 290 μL Cell Isolation buffer. This aliquot will be used for the unstained and single stain samples.\nNote: This sample can be split further into more eppendorfs to use as single stain and unstained controls for flow cytometry and FACS-sorting.",
    "Add 5 μL of the antibody mastermix to the remaining 100 μL cell suspension, mix gently, and incubate for 20 min at 4°C in the dark.\nNote: It is highly recommended to prepare flow cytometry single-stains by incubating leftover cells or samples with 1μl of each antibody (1:100 dilution). Also prepare an unstained sample to be used for gate determination during FACS sorting.\nWash the cell suspension with 1 mL Cell Isolation buffer.\nCentrifuge at 300 × g for 5 min at 4°C and discard supernatant.\nResuspend the cell pellet with 300 μL Cell Isolation buffer and pass the sample through a 5 mL Falcon® Round-Bottom Tube with Cell Strainer Cap (35 μm nylon mesh) to ensure it is ready for FACS sorting. Keep samples at 4°C in the dark.\nSamples are now ready for flow cytometry analysis and FACS sorting. FACS sorting should be performed within the next 4 h, but ideally as soon as possible.\nPrepare 1.5 mL eppendorfs with 300 μL Sorting buffer (DMEM/10% FBS) and store on ice until use.\nPause Point: The stained cells can be kept for 4 h at 4°C in the dark before FACS sorting. However, we suggest proceeding to FACS sorting as quickly as possible to maximize cell viability and recovery of fragile BM stromal cell subpopulations.\nFACS sorting of BM stromal cells and gating strategy\nTiming: ∼30 min–1 h, depending on number of cells in sample",
    "The purpose of FACS-sorting is to identify a variety of BM stromal cell subpopulations from large, heterogeneous BM samples. We characterize these BM stromal cells as CD45- CD235a- CD71- CD41- CD61- cells on a flow cytometer in order to perform downstream analysis such as single-cell RNA sequencing on patient stromal cells. We stain for specific \"contaminating” hematopoietic, megakaryocytic, and erythroid populations to be able to exclude these cells when sorting. Negative selection approaches are commonly used to enrich MSCs from mouse and patient samples (Baryawno et al., 2019[href=https://www.wicell.org#bib1]), however, previous bulk RNA-sequencing strategies required additional stromal cell markers (Kenswil et al., 2021[href=https://www.wicell.org#bib4], Ping et al., 2019[href=https://www.wicell.org#bib6]). The resolution of single cell analysis now allows for a more unbiased approach that does not require these markers. CD45 is used to identify the majority of hematopoietic cells. CD235a and CD71 (transferrin receptor) mark mature and progenitor erythroid cells, and CD41 and CD61 are used to identify mature and progenitor megakaryocytes.\nAdd 3 μL of 7-AAD solution (1:100 dilution) to the cell suspension just prior to cell sorting.\nGating strategy is provided in Figure 3[href=https://www.wicell.org#fig3].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/656-Fig3.jpg\nFigure 3. Sorting strategy for human BM stromal cell populations\nIn panel 1, FSC versus SSC gating is used to identify cells of interest based on size and granularity, and then gated for single cells in panels 2 and 3. We subsequently select for live cells based on 7-AAD negativity (Panel 4, PerCp-Cy5.5 negative cells). Stromal cells are sorted by gating the negative populations (Panel 5) from the remaining cells that are stained for hematopoietic, megakaryocytic, and erythroid markers. FSC: forward scatter, used for the discrimination of cells by size, SSC: side scatter, provides information on the internal complexity, or granularity, of the cell. 7-AAD: 7-Aminoactinomycin D, FITC: Fluorescein isothiocyanate, scRNA-seq: single-cell RNA sequencing,",
    "Note: We use aliquots of single-stained cells for voltage settings, area scaling, and setting sort gates.\nNote: The 7-AAD solution is added just prior to FACS in order to prevent overstaining that can occur with prolonged exposure (no more than 1 h) of cells to 7-AAD solution.\nDiscard doublets by using FSC-H and FSC-W (Figure 3[href=https://www.wicell.org#fig3]).\nDiscard non-viable cells using 7-AAD (PerCp-Cy5.5 channel).\nSort the desired CD45- CD235a- CD71- CD41- CD61- cells (FITC channel) according to the gating strategy (Figure 3[href=https://www.wicell.org#fig3]) into 300 μL sorting buffer (DMEM/2% FBS) in the prepared 1.5 mL eppendorfs and transfer onto ice.\nNote: From our experience on the BD FACS Aria II, we recommend using a 100μm nozzle for sorting. This places less pressure on sensitive cells like BM stromal cells and preserves viability. Additionally, we suggest sorting at a flow rate below 7,000 events/s, although flow rate will vary depending on the sorter type, sorter setup, and sorting efficiency.\nCentrifuge collected cells at 300 × g for 5 min at 4°C.\nIn order to retain as many cells as possible for analysis, carefully remove the supernatant until you have approximately 40 μL left, then resuspend the cell pellet and proceed with the single-cell RNA sequencing pipeline.\nOptional: Perform cell count and viability check using a Countess II FL Automated Cell Counter (or alternative). However, it is likely that the number of sorted cells will be very small and hard to quantify. Performing a cell count at this stage also reduces the number of cells that can be analyzed for single-cell RNA sequencing, and we often omit this step and proceed directly to 10× Genomics, or alternative single-cell RNA sequencing pipeline.",
    "Pause Point: If more than one biopsy is isolated on the same day, sorted cells can be stored on ice until further processing. It is however, important to minimize sorting time and time between sorting and further processing as much as possible to keep sorted cells viable."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cell Isolation",
    "Flow Cytometry",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}