{
  "id": 5318,
  "origin_website": "Bio",
  "title": "<em>In vitro</em> Histone H3 Cleavage Assay for Yeast and Chicken Liver H3 Protease",
  "procedures": [
    "Preparation of core histonesFor protease assay, good quality of histones is required. We purified core histones from chicken brain tissue. To isolate histones from tissue requires preparation of nuclei as detailed below.Homogenize the chicken brain tissue (5 g) via a motor-driven homogenizer in solution 1 (50 ml) for 30 sec to make a 10% homogenate solution.Add 1.25 ml 10 % Triton X-100 drop-wise with constant shaking (swirling with hand) to the homogenate to a final concentration of 0.25%.Centrifuge the sample at 4 °C, 3,024 x g for 20 min and discard the supernatant to obtain nuclei pellet.Wash nuclei pellets (at 4 °C, 3,024 x g for 20 min) 3 times with 50 ml chilled solution 1 containing 0.34 M sucrose.Suspend the nuclei thoroughly into the 7 ml hypotonic buffer at a concentration of 1 mg DNA/ml. Check DNA concentration by measuring A280.Purify core histones from isolated nuclei by hydroxyapatite affinity purification (HAP) method as described below:Sonicate nuclei in 7 ml hypotonic solution to prepare soluble chromatin. Note: We have observed that soluble chromatin preparation is fine when made as described above but this step can be improved. To improve soluble chromatin preparation, first dissolve nuclei in 7 ml HB buffer and apply 5 strokes by Potter-Elvehjem homogenizer. Centrifuge (27,216 x g, 4 °C for 5 min) the sample to collect nuclei. Repeat the same step (resuspension in HB buffer, homogenization, centrifugation and discard the supernatant) 6 times in total. Further, dissolved nuclei in 7 ml HAP buffer containing 0.4 M NaCl and apply 5 strokes by hand homogenizer. Collect nuclei by centrifugation at 27,216 x g, 4 °C for 5 min. Repeat this step 2 times.Resuspend nuclei pellet in HAP buffer containing 0.",
    "6 M NaCl and sonicate (60% amplitude, 4 min-10 sec on, 10 sec at 4 °C) off it. These steps are adapted from Côté et al., 1995; Workman et al., 1991.Mix 5 g of hydroxyapatite resin (1.5 mg DNA/g hydroxyapatite) with 50 ml of 50 mM sodium phosphate buffer, pH 6.8. Keep it at room temperature for 10 min and centrifuge it (3,024 x g, 5 min). Discard the supernatant. Repeat it for two more times.Note: Alternatively, equilibration of hydroxyapatite resin can be done with HAP buffer containing 0.6 M NaCl. Mix soluble chromatin (1 mg/ml) with hydroxyapatite resin equilibrated in 50 mM sodium phosphate buffer, pH 6.8 (1.5 mg DNA/g hydroxyapatite).Add NaCl (5 M) to the final concentration of 0.6 M and incubate chromatin-HAP resin for half an hour at 4 °C with 10 rotations per minute on rotator.Wash chromatin mixed hydroxyapatite with 50 ml 50 mM phosphate buffer containing 0.6 M NaCl. Perform washing through centrifugation (3,024 x g, 5 min). Discard the supernatant. Repeat it 6 times.Elute total histones with 15 ml phosphate buffer containing 2.0 M NaCl. Perform the elution three times.Note: Alternatively, we can elute histones with 15 ml HAP buffer containing 2.5 M NaCl. Perform the elution three times. Desalt the eluted histones by dialysis against 1,000 ml of 10 mM Tris-Cl (pH 7.5) overnight at 4 °C with 4 changes.Note: Alternatively, we can remove salt by spin filter and concentrate core histones, which can be used directly for assays. Precipitate histones by addition of 3.5 volumes of chilled acetone. After adding acetone, keep the solution for precipitation at -20 °C for 1 h.Collect the precipitated histones by centrifugation at 4 °C, 12,096 x g for 15 min and wash 2-3 times with chilled acetone.",
    "Air-dry the pellet for 15 min and dissolve it in 500 μl 10 mM Tris-Cl (pH 7.5). Check purity of core histones by running 18% SDS PAGE as shown in Figure1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161229/20161229020905_4240.jpgFigure 1. Purification of core histones. Core histones were purified from chicken brain tissue through hydroxyapatite resin and the purity was checked by running 18% SDS-PAGE. 2 μg core histones were loaded onto a lane.Purification of H3 proteasePartial purification of H3-protease from Saccharomyces cerevisiae  Make extract from sporulation-phase yeast cells (BY4743 strain) as it yields maximum H3-protease activity.Harvest 100 ml yeast cells growing in exponential phase (OD600-0.8) by centrifugation (2,300 x g, 5 min).Discard supernatant. Suspend yeast cell pellet in 2% (w/v) potassium acetate solution (50 ml).Allow the cells to grow further for 3 h at 30 °C with constant shaking (200 rpm). Under these condition, the yeast cells reach sporulation phase.Harvest yeast cells grown to sporulation-phase by centrifugation (2,300 x g, 5 min). Transfer the harvested cells into 1.5 ml centrifuge tubes. Wash the cell pellet with 2 ml of prespheroplasting buffer and discard the supernatant.Incubate the yeast cells in 0.5 ml spheroplasting buffer containing lyticase (250 U) at 37 °C for 15 min. Prepare the spheroplasts through lyticase enzymatic degradation of the yeast cell walls.Harvest the spheroplasts by centrifugation at low speed (3,300 x g) for 3 min at 4 °C.Discard the supernatant and wash the pellet once with 1 ml ice-cold wash buffer.Lyse the spheroplasts with 0.8 ml lysis buffer through incubation on ice for 15 min. Mix the cells by hand tapping at regular intervals.Centrifuge the cell lysates at 13,400 x g for 15 min at 4 °C to obtain clear lysates and transfer it into a new 1.5 ml centrifuge tube. Discard the pellet.",
    "To acquire H3-specific proteolytic activity, incubate the cell lysates with 100 µl of protein A sepharose beads (50% slurry) for 1 h at 4 °C with constant shaking on a rotator.Centrifuge (800 x g, 5 min, 4 °C) the bead mixed cell lysate and discard the supernatant.Similarly, wash the beads two times with 1 ml of lysis buffer (by reversing the microcentrifuge tube by hand, settle beads by centrifugation and throw the supernatant ) followed by washing twice with lysis buffer without Triton X-100.Resuspend the beads in yeast-protease resuspension buffer (100 µl) and use it for in vitro H3 cleavage assays.Partial purification of H3-protease from chicken liverExtract liver tissue from chicken and wash it with saline solution.Prepare the microsomes as described earlier (Grillo et al., 2002). Briefly, the method to purify microsomes from chicken liver tissue is described below.Homogenize 5 g chicken liver tissue via a motor-driven homogenizer in 50 ml of chilled solution 1 to make 10% homogenate and filter it through four layered cheese cloth.Remove nuclei and mitochondrial contaminations from homogenate subsequently by centrifugation at 5,000 x g, 4 °C for 10 min and 27,000 x g, 4 °C for 10 min respectively.Centrifuge the collected supernatant at 105,000 x g, 4 °C for 1 h to pellet down the microsomes.Resuspend the collected microsomes in 5 ml of 10 mM Tris-Cl, pH 8.0. Extract the resuspended microsomes with 0.2% Triton X-100 for 1 h at 4 °C by continuous rotation (rotator, 10 rpm).Centrifuge the extracted microsomes at 105,000 x g, 4 °C for 1 h. This time collect the supernatant and further precipitate it with 30% ammonium sulfate for 30 min at 4 °C.",
    "Collect the precipitates by centrifugation (27,216 x g, 4 °C, 30 min) and dialyze it over-night, against 2,000 ml dialysis buffer at 4 °C to remove ammonium sulfate.After dialysis, perform the centrifugation (27,216 x g, 4 °C, 15 min) to remove insoluble precipitates.To further purify H3 protease, perform SuperoseTM 6, 10/300 GL chromatography (Sample volume-500 μl, flow rate-0.3 ml/min, fraction volume-0.3 ml). Buffer for size exclusion chromatography is same as dialysis buffer. Collect positive fractions ranging from 39th to 51st as shown in Figure 2.Pool fractions (39th to 51st) together and use them directly (no need to concentrate these fractions for experiments) for in vitro histone H3 cleavage assay.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161229/20161229022248_4814.jpgFigure 2. Western blot of liver microsomal extract with Glud1 antibody. Size exclusion chromatography fractions of chicken liver microsomal extract probed with Glud1 (Chicken liver H3 protease) antibody to confirm the presence of H3 protease in these fractions.Set up of in vitro histone H3 cleavage assayProtease source: yeast (BY4743 strain)Perform in vitro protease assay in reaction buffer (20 µl).Initiate assay by addition of 10 μl protein A sepharose bead-bound proteins into reaction mix containing 1-2 μg core histones.Incubate the reaction mix for 1 h at 37 °C, with constant shaking.Stop the in vitro cleavage reaction by addition of 3.33 μl 6x SDS-PAGE sample loading buffer into the reaction mixture (final concentration of SDS-loading dye in reaction mix: 1x).Protease source: chickenPerform the in vitro proteolytic assay in reaction buffer.Incubate 2 μg core histones with 0.25 μg of partially purified H3 protease extract from chicken liver tissue in 20 μl reaction volume.Incubate the reaction mix for 1 h at 37 °C.Stop the reaction by addition of 3.33 μl 6x SDS-PAGE sample loading buffer.Visualization of core histones after assayStop the in vitro cleavage reaction by the addition of SDS-PAGE loading dye as mentioned earlier.",
    "Incubate the samples at 95 °C for 5 min.Examine the cleavage of histone H3 by running 18% SDS-PAGE as shown in Figure 3.Visualize the bands of core histones by staining with Coomassie blue staining.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161229/20161229023045_2027.jpgFigure 3. In vitro histone H3 cleavage assay with core histones. A. In vitro activity assay with yeast protease. B. In vitro activity assay with chicken liver protease. Out of four core histones, only histone H3 get cleaved as protease is specific for histone H3. ‘-’ and ‘+’ indicate absence and presence of H3 protease respectively.Note: The in vitro histone H3 cleavage assay works best when proteases are freshly prepared. The core histone should be stored in small aliquots at -80 °C. Repeated freeze-thawing of both histones and proteases should be avoided."
  ],
  "subjectAreas": [
    "Biochemistry",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}