{
  "id": 4321,
  "origin_website": "Bio",
  "title": "<em>In vitro</em> Regulatory T cells Differentiation From Naïve T Cells",
  "procedures": [
    "Isolation of CD4+CD62L+ T naïve cells   Prepare a single cell suspension from mouse spleens. Disrupt the spleen with the plunger of a 1 ml syringe against a 70-μm filter in a petri dish filled with 2 ml of RPMI.    Centrifuge single cell suspensions in 15-ml conical tubes for 8 min at no more than 300 x g.   Re-suspend the splenocytes with 5 ml of ACK buffer and incubate 5 min at RT. Dilute it with PBS and centrifuge for 8 min at no more than 300 x g. Re-suspend cell pellet in FACS buffer and count cell number. Normally, each spleen yields between 80-100 x 106 splenocytes.   Purification of CD4+ T cells by negative selection using Dynal® Mouse CD4 Cell Negative Isolation Kit is thoroughly detailed in the protocol provided by manufacturer. Protocol yield is usually 20-25% of spleen cells (http://tools.invitrogen.com/content/sfs/manuals/dynabeads_untouched_ms_CD4_man.pdf[href=http://tools.invitrogen.com/content/sfs/manuals/dynabeads_untouched_ms_CD4_man.pdf]).   After CD4+ T cells isolation adjust the cell concentration by centrifugation (8 min at 300 x g) and dilution in FACS buffer to 4 x 107/ml and proceed to CD4 and CD62L staining.   Use 0.2 μg of APC-conjugated anti-CD4 antibody and 0.3 μg of PE-conjugated anti-CD62L antibody per 200 μl of CD4+ T cells suspension. Incubate 30 min at 4 °C in the dark.    Wash cells with FACS buffer, centrifuge for 8 min at no more than 300 x g and re-suspend cell pellet with FACS buffer at a concentration of 3 x 107/ml.   Using a FACSAria cell sorter proceed to the selection and sorting of the CD4+CD62Lhigh population. Exclude cell doublets using FSC-H vs. FSC-W and SSC-H vs. SSC-W dot plots. The total percentage should be between 60-70% for Balb/c mice strain and 50-60% for C57Bl/6 mice strain. Flow rate is recommended to be adjusted around 1-3. Sort precision could be set to “yield”.",
    "One should expect around 10 x 106 and 7 x 106 of CD4 T naïve cells per Balb/c and C57Bl/6 spleen, respectively.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140313/20140313003544_2642.jpg    Use 15 ml conical tubes to collect sorted population with 2.5 ml of collection medium. Prior to use, vortex tubes so that tube walls will be covered by a thin layer of fluid thus avoiding cell death when cells are deflected to the tube.   Keep the sorted population on ice.      Conditioned media from tumor cells   This step can be performed at any time prior to the Treg differentiation protocol.   Plate the chosen tumor cells in P60 dishes at 50% confluence with 2 ml of serum free media. Incubate for 18 h at 37 °C with 5% CO2 and then collect conditioned media. Filter with 0.22 μm syringe filter, aliquot into 200 µl samples and store at -70 °C.      Anti-CD3 coating of 24-well plates   Prepare a 5 μg/ml solution of anti-CD3ε from the stock of CD3ε antibody (1 mg/ml) in sterile PBS and vortex. For 24-well plates use 150 μl per well.   Incubate at 37 °C in a humidified atmosphere for at least 2 h.    Before use rinse wells with PBS and aspirate twice.      Conversion of naïve T cells to Treg in the presence of tumor cells conditioned media   The stimuli indispensable for Treg conversion are TGFβ1 and IL-2. To asses Gal-1 fine-tuning of Treg conversion frequency it is necessary to use a limiting concentration of the former. TGFβ1 limitation has shown to be more efficient at modulating Treg differentiation. Adjust naïve T cells concentration to 1 x 106/ml in serum free-RPMI supplemented with 1-2 ng/ml hTGFβ1, 100 U/ml mIL-2, 1 μg/ml CD28 mAb and antibiotic-antimycotic.   Plate 1 ml of naïve T cell suspension per well in anti CD3-coated 24-well plates.   Add conditioned media (CM) tumor cells.",
    "It is suggested to determine dose-dependent responses to the CM. Dilutions ranging from 1:10 to 1:100 are recommended.   Incubate at 37 °C with 5% CO2 for 4 days. More days will only result in an increased cell death.   Asses Treg frequency by flow cytometry after staining of CD4, CD25 and Foxp3.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140313/20140313003641_2043.jpg      Treg staining   Staining of CD4 and CD25 molecules are performed for 30 min in the dark at 4 °C. Per 2 x 106 cells use 0.03 μg of APC-conjugated CD4 antibody and 0.075 μg of AlexaFluor 488-conjugated CD25 in 100 μl of FACS buffer.   Wash cells and centrifuge for 8 min at no more than 300 x g. Fix and permeabilize cells using Fix/Perm buffer in 100 μl for 30 min to 18 h in the dark at 4 °C.    Wash cells with 1x Permeabilization Buffer. Foxp3 staining is performed in 100 μl 1x Permeabilization Buffer using 0.225 μg PE-conjugated Foxp3 antibody for 1 h at 4 °C in the dark.   Wash cells with 1x Permeabilization Buffer, centrifuge for 10 min at 300 x g and re-suspend in FACS buffer.   For flow cytometry analysis a two-laser cytometer must be used and 5 additional tubes containing the appropriate compensation samples should be considered. It is highly recommended to exclude cell doublets using FSC-H vs. FSC-W and SSC-H vs. SSC-W dot plots."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}