{
  "id": 17346,
  "origin_website": "Jove",
  "title": "Measuring Single-Cell Mitochondrial DNA Copy Number and Heteroplasmy Using Digital Droplet Polymerase Chain Reaction",
  "procedures": [
    "All experiments followed the ARRIVE guidelines and were approved by the University of Cambridge Animal Welfare Ethical Review Body (AWERB).\nNOTE: All sample preparation steps prior to droplet generation must be performed in a clean pre-PCR work area, ideally in a UV-sterilized cabinet where possible. The protocol described here uses specific droplet generation PCR equipment (see Table of Materials), and while the general method should be applicable to other systems, it is recommended to consult the manufacturer's guidelines regarding primer/probe concentrations, PCR cycling conditions, etc., as they may differ from those described here. Cell lines/primary cells used in this study were as follows: Human HeLa cells (commercially obtained), human HEK 293T cells (commercially obtained), primary human dermal fibroblast cells (obtained from the Newcastle Biobank), human cybrids (WT & ΔH2.1 deletion15, obtained from C. Moraes, University of Miami), mouse embryonic fibroblasts (immortalized, from C57Bl/6 mice, obtained from J. Stewart, Newcastle University), mouse primordial germ cells (obtained from C57Bl/6 mouse embryos), and mouse MII oocytes (obtained from adult female C57Bl/6 mice). All cultured cells were maintained in High Glucose (4.5g/L) DMEM supplemented with 10% fetal bovine serum at 37 °C with 5% CO2. Primary mouse cells used in this study were isolated from animals kept according to the Animal (Scientific Procedures) Act 1986 under Home Office Project License P6C97520A.\n1. Design and synthesize primer & probe sets targeting DNA sequences of interest\nNOTE: Droplet generation PCR can also be performed using a dsDNA binding dye in place of the amplicon-specific probes.\nDesign the primer and probe sequences according to the guidelines given by the system manufacturer. Validated primer and probe sequences suitable for measuring single-cell mtDNA copy number/deletion heteroplasmy in both human16,17 and mouse18 cells are provided in Table 1. When selecting alternative target sequences, consider the following points.",
    "Multiplex two primer/probe sets in a single PCR assay but ensure that the two assays utilize one FAM-labeled probe and one HEX-labeled probe so that the target amplicons can be differentiated by the droplet reader. This protocol presents a duplex probe assay. With careful experimental design, multiplexing can be increased up to four targets, and alternative platforms can achieve higher-dimensional multiplexing.\nWhen multiplexing primer/probe sets targeting separate mtDNA sequences, ensure that the amplicons generated by the two primer sets do not overlap.\nWhen measuring heteroplasmy in samples carrying mtDNA deletions, ensure that one target amplicon falls within the expected deleted region and the other falls outside of the expected deleted region.\n\t\tNOTE: Optimal PCR cycling conditions for alternative assays may differ from those quoted in Step 5.1; see the Discussion for further details on assay optimization.\n2. Isolation of DNA from single cells\nNOTE: This method can also be used for small bulk samples of up to 100 cells.\nCollect single cells using an appropriate method, such as Fluorescence-Activated Cell Sorting (FACS)19 or laser capture microdissection20, in as small a volume as possible into a suitable receptacle (e.g., 96-well plate). Use of a cell viability dye prior to or during single-cell isolation will minimize the likelihood of isolating dead cells. Sort the single cells directly into lysis buffer if desired and store at -80 °C (up to 6 months) prior to analysis.\nLyse the cells in a small volume (<10 µL) of a suitable lysis buffer (the buffer used in this study is described in step 2.2.1.).",
    "NOTE: All data obtained from cells in this study are from single-cell lysates or pools of 20 cells (sample sizes are stipulated in the figure legends). Efficient formation of an oil/droplet emulsion during the droplet generation step of the droplet generation PCR protocol can be significantly affected by the presence of detergents in the sample; therefore, it is recommended to validate the compatibility of all cell-lysis buffers with droplet generation at the intended input concentration before proceeding with experimental samples and using the smallest practical volume of lysis buffer. The following lysis protocol results in minimal impact on droplet generation efficiency.\n\t\nPrepare the lysis buffer containing 50 mM Tris-HCl pH 8.3, 1% TWEEN-20, and 200 µg/mL Proteinase K.\nAdd 2.5 µL of the lysis buffer to each sample, seal the plate with an adhesive plate seal, and then centrifuge the samples at 1,000 x g for 1 min at 4 °C.\nIncubate the samples at 37 °C for 30 min on the thermocycler with the heated lid set at 105 °C to prevent the condensation of liquid on the plate cover.\nAdd 7.5 µL of nuclease free water to each sample to get a final sample volume of 10 µL, re-seal the plate, and then centrifuge the samples at 1,000 x g for 1 min at 4 °C.\nIncubate on the thermocycler at 80 °C for 15 min (heated lid set to 105 °C) to inactivate Proteinase K.\nCentrifuge the samples at 1,000 x g for 1 min at 4 °C and then keep on ice.\nProceed to step 3 below.\n\tNOTE: Cell lysates can be stored at -20 °C prior to continuing with step 3; however, use freshly eluted DNA where possible to eliminate the risk of freeze-thaw cycles resulting in DNA degradation.\n3. Preparation of samples",
    "NOTE: Ensure that technical replicates of samples and non-template controls (NTCs) are included on each assay plate to ensure the accuracy of results. The dynamic range of the droplet generation PCR assay is up to 120,000 copies of the target amplicon per reaction. For single-cell or small bulk-cell sample lysates, dilution is unlikely to be necessary, and the lysate mixture can be input directly to the reaction for the measurement of mtDNA copy number (e.g., a lysate sample of 10 µL can be split and run in triplicate with 3 µL input directly into each assay). However, using undiluted lysate from cells with very high copy mtDNA numbers (e.g., oocytes) or containing larger numbers of cells (e.g., 50-100) may exceed this dynamic range. In such cases, an initial serial dilution is required to identify an appropriate dilution factor that avoids saturation of the assay for that specific cell type/cell number (see Representative Results for further details).\nDefrost all reagents on ice, vortex, and spin down briefly before use.\nPrepare the master mix (minus sample DNA) on ice as described in (Table 2).\n\tNOTE: If only one target amplicon is being measured, add an additional 2.55 µL of nuclease-free water per sample to achieve the final volume of 22 µL. Prepare sufficient master mix for the number of samples and NTCs to be analyzed, plus enough to account for any 'blank' wells required on the droplet generation PCR plate (see next step).\nVortex the prepared master mix briefly to mix and aliquot the required volume (22 µL minus input DNA volume) into each well of a droplet generation PCR 96-well plate. Arrange the samples in full columns on the 96-well plate; fill any empty wells in incomplete columns with master mix and use them as NTCs.",
    "Add the input DNA to each sample well and nuclease-free water/elution buffer to NTC wells to bring the total volume of each up to 22 µL.\nSeal the plate with an adhesive plate seal and place on a shaker at 2,000 rpm for 1 min, and then centrifuge at 1,000 x g for one min at 4 °C.\nPlace the plate on ice and proceed to Step 4.\n\tNOTE: Prepared plates can be stored on ice and protected from light for short periods of time (e.g., 1-2 h) before proceeding with droplet generation.\n4. Generation of droplets\nNOTE: Refer to Figure 1A for the schematic of the droplet generator instrument deck referenced in this section.\nPower on the droplet generator.\nCheck that a bottle of droplet generating oil is loaded to position E of the instrument deck. If prompted, follow the on-screen instructions to replace the bottle.\nClick Configure Sample Plate on the touch screen. Select all columns on the sample plate that contain samples/blanks.\n\tNOTE: Entry of plate name and details of the experiment at this step is optional and not required to continue setting up the experiment.\nClick OK to confirm the plate configuration; orange lights will illuminate on the instrument deck to indicate positions where consumables need to be loaded.\nLoad the droplet generator cartridges to position B on the instrument deck so that all lights turn green.\nPlace an empty tip waste trough into position C on the instrument deck.\nRemove lids from filter tip boxes and load to position D on the instrument stage so that all lights turn green.\nRemove the adhesive plate seal from the sample plate and load to position F of the instrument deck so that the light turns green.",
    "Place an empty droplet collection 96-well plate into a cool block (pre-chilled at -20 °C) and load to position G of the instrument deck so that the light turns green.\nClick Start Droplet Generation on the instrument touch screen.\nClick Start Run on the instrument touch screen. The instrument lid will close automatically. After initializing, the time remaining until droplet generation is complete will display on the instrument touch screen.\nOnce the droplet generation is complete, check the sample collection plate visually to confirm that a droplet emulsion layer is present above the oil phase in each well (Figure 1B).\n\tNOTE: If a droplet emulsion layer is not visible, do not proceed further with the experiment and check for any errors that may have occurred during previous steps of the protocol.\nClear the used consumables from the instrument deck and empty the tip-waste trough.\nPower on the plate sealer, set the temperature to 180 °C and seal time to 5 s, and allow the machine to reach the operating temperature.\nPut the sample collection plate into the plate sealer plate-holder and place a fresh foil seal on top of the plate with the red line facing upwards. Take care not to touch the underside of the foil seal.\n\tNOTE: The plate holder should be stored at room temperature (RT) and only placed into the plate sealer drawer when a foil seal is being applied to prevent heat transfer to the sample collection plate.\nWhen the plate sealer has reached operating temperature, press Eject on the instrument touchscreen; the drawer will open automatically.\nPlace the plate holder into the plate sealer drawer and press Seal. The drawer will close automatically and then open again once sealing is complete.",
    "Replace the sealed plate on the cold block, turn off the plate sealer, and proceed immediately to Step 5.\n\tNOTE: At this stage, the droplets are unstable, so ensure that the PCR step is commenced within 1 h of droplet generation finishing.\n5. PCR\nPlace the sealed droplet collection plate onto a PCR cycler equipped with a 96-deep-well block and run the thermal cycling protocol described in Table 3.\n\tNOTE: Set heated lid temperature to 105 °C and sample volume to 40 µL. Denaturation and annealing/extension steps must include a temperature ramp-rate of 2 °C/s to ensure that the oil has time to equilibrate to the correct temperature.\nProceed to Step 6.\n\tNOTE: Once the thermal cycling protocol is complete, the droplets are more stable, and the plate can be stored for up to 4 days at 4 °C before proceeding with the next step.\n6. Droplet reading\nPower on the droplet reader and connected computer.\nCheck the fluid levels in the droplet reader oil and droplet reader waste bottles and fill/empty these, respectively, if required.\nLoad the plate containing the post-PCR samples into the droplet reader plate holder, place the cover on top of the holder and secure it in place with the black locking clips. Do not remove the foil lid from the sample plate.\nPress the Open/Close button on the lid of the droplet reader to open it.\nLoad the droplet reader plate holder containing the sample plate into the reader chamber and locate it securely onto the magnetic base.\nPress the Open/Close button on the lid of the droplet reader to close it.\nOpen the analysis software interface, select the Add Plate tab and prepare a new sample plate as follows:\n\t\nClick Add Plate and then Configure Plate.",
    "In the Plate Information tab enter a Plate Name, select Supermix for Probes (no dUTP) from the Supermix drop-down menu and enter a file name under Save Data File As.\nIn the Well Selection tab highlight the wells to be analyzed and click Include Selected Wells.\n\t\tNOTE: Steps 6.7.4 – 6.7.7 are optional.\nIn the Well Information tab, select the wells to be annotated.\n\t\tNOTE: Refer to Figure 1D for an example of the Well Information tab interface.\nSelect Direct Quantification (DQ) from the Experiment Type drop-down menu, populate the Sample Description, Sample Type & Target Name boxes, and add Well Notes and/or Plate Notes as required.\nClick Apply. The information in the fields will be applied to the selected wells.\nRepeat steps 6.7.4–6.7.6 until all sample wells have been annotated. \nOnce the plate configuration is complete, click Start Run.\nWhen the run is complete, discard the empty sample plate and empty the droplet reader waste bottle if necessary. \nProceed to Step 7.\n7. Analysis of results\nNOTE: The droplet reader measures the fluorescence intensity in the FAM and HEX channel for each droplet in a sample. In a successful assay, droplets fall into one of two categories for each probe: Negative (meaning the target was not present in the droplet) or Positive (meaning the target was present in the droplet). Prior to analyzing samples, ensure that each well contains >10,000 droplets and has two clearly separate populations of low fluorescence (negative) and high fluorescence (positive) droplets in each channel (Figure 2A).\nSelect the Data Analysis tab and open the file to be analyzed from the My Datafiles menu.\nClick the 1D Amplitude tab for single-color experiments or the 2D Amplitude tab for two-color experiments.",
    "Apply a fluorescence threshold to each channel to differentiate the positive and negative droplets. The analysis software will attempt to apply an automatic threshold on a sample-by-sample and channel-by-channel basis, but if this appears to have failed, or looks inaccurate, then manually apply the threshold as follows:\n\t\nSelect the wells that require thresholding.\nManually apply the threshold in the clear space between the positive and negative populations on the amplitude plot using the Threshold Line Mode tool. When setting manual thresholds in 2D view, ensure that the crosshair is placed so that the four droplet populations (double negative, single positive FAM, single positive HEX, and double positive) are clearly separated.\n\t\tNOTE: Thresholding can either be done well-by-well or applied to multiple wells at once.\nOnce all samples have had a threshold applied, export the results as a .csv file for further analysis by clicking on the Data Table tab, clicking Import/Export and selecting Export Visible Data to CSV. Enter a suitable file name and click Save.\nCalculate the mtDNA copy number in the initial sample as follows:\nCopy Number = mtDNA target concentration × 22 × 1/fraction of total lysate input",
    "NOTE: If two mitochondrial probes are used, then the concentration of the two targets is averaged before making the calculation. For samples containing more than one cell, the copy number per cell is calculated by dividing by the number of cells in the sample. It is important to use the 'Concentration' value (i.e., number of copies per microliter) multiplied by the initial sample volume of 22 µL, rather than the 'Copies per 20 µL' value calculated in the .csv file, since the mtDNA copies left in the 2 µL overage required by the droplet generator must be taken into account when calculating the absolute copy number of the initial sample.\nFor cells carrying heteroplasmic mtDNA deletions, calculate the copy number using the results from the mtDNA target outside the deleted region (i.e., the target present in both deleted and WT mtDNA molecules). The deletion heteroplasmy is calculated using the concentrations of the target inside the deleted region and the target outside the deleted region as follows:\nimgsrc://cloudfront.jove.com/files/ftp_upload/63870/63870eq01.jpg\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}