{
  "id": 3491,
  "origin_website": "Cell",
  "title": "Protocol for establishing a protein interactome based on close physical proximity to a target protein within live budding yeast",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDesign the Bpa incorporation sites\nTiming: 1 day\nThis section details the selection of surface residues on a target protein (TP) for the incorporation of p-benzoyl-L-phenylalanine (Bpa).\nSelect the amino acid sites on your target protein (TP) for p-benzoyl-L-phenylalanine (Bpa) incorporation.\nNote: If available, use high-resolution structures of the TP to identify suitable surface residues for substitution. Also, exploit solved structures with known binding partners to create positive controls for validating the cross-linking method. The PyMOL script InterfaceResidues is helpful for determining the interaction interfaces between two proteins (https://pymolwiki.org/index.php/InterfaceResidue[href=https://pymolwiki.org/index.php/InterfaceResidue]). If high-resolution information is not available, use an AlphaFold predicted structure of your TP.10[href=https://www.wicell.org#bib10]\nThe following characteristics, listed in order of importance, should be considered when selecting the surface residues to target for Bpa incorporation:\nSites that are not involved in the catalytic activity of the TP.\nSites that are not targeted for post-translational modifications.\nSites that are phenylalanine or another aromatic residue.\nSites that minimally disrupt the stability of the TP upon a change to phenylalanine, which is used as a Bpa proxy.\nNote: The Site Directed Mutator is useful for these predictions.11[href=https://www.wicell.org#bib11]\nGenerate yeast expressing the Bpa variants\nTiming: ∼1 week\nThese steps describe the generation of yeast expressing Bpa-incorporated TP.\nEngineer an expression plasmid to produce the wild type TP as a fusion protein with an amino-terminal 6x His-tag that will be used for affinity protein purification in later steps.\nModify the His-tag fusion construct with amber stop codons (UAG) at the amino acid sites selected for Bpa incorporation. We will refer to this protein derivative as TP-Bpa.",
    "Note: Besides plasmid-borne protein expression, a Bpa-variant can be generated using other methods such as CRISPR/Cas9.12[href=https://www.wicell.org#bib12] If the TP is essential, this will require constant supplementation of the media with Bpa thereby raising the cost of the experiment.\nPrepare Bpa-containing media. Make a 100x liquid stock solution of Bpa (200 mM) just prior to use. For 100 mL media, dissolve 53.8 mg of powder Bpa in 500 μL of 1 N NaOH. Neutralize the pH with an equal volume of 1 N HCl. We will refer to this media as SD + Bpa.\nNote: Autoclave Synthetic Dextrose (SD) media without amino acids. If preparing agar plates, include agar (2% final) before autoclaving. After cooling the media to 55°C, add the necessary amino acid drop-out mix to the SD media. To the cooled media (55°C), add Bpa stock by slowly dripping the 100x solution into the liquid media to a final concentration of 2 mM while stirring.\nNote: Agar plates with Bpa can be stored for up to 2 weeks when kept shielded from light.\nCritical: If the Bpa solution is not added dropwise with continuous stirring, the Bpa tends to precipitate out of the solution.\nNon-essential TP: If the TP gene is non-essential, transform the TP-Bpa expression plasmid along with a Bpa tRNA synthetase (pSNR-tRNA-pBpaRS) vector into yeast where the endogenous locus for the TP has been knockout using standard methods.13[href=https://www.wicell.org#bib13] Hence, the Bpa-variant will be the sole source of the TP within these yeast.\nNote: The pSNR-tRNA-pBpaRS vector expresses a Bpa-specific aminoacyl-tRNA synthetase that allows the assimilation of Bpa into amber stop codons during translation.1[href=https://www.wicell.org#bib1],14[href=https://www.wicell.org#bib14]\nEssential TP: If the TP is essential, use a plasmid shuffling approach to achieve conditions where the Bpa-variant is the sole source of the TP (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3065-Fig2.jpg\nFigure 2. Yeast plasmid shuffling method",
    "To interrogate the protein products of essential genes, a commonly used yeast genetic strategy is plasmid shuffling. First, the essential open reading frame (ORF) is cloned into an expression vector with a URA3 marker and the endogenous TP ORF is knocked out using standard methods.13[href=https://www.wicell.org#bib13] Next, the yeast is transformed with an expression vector for the TP-Bpa variant and pSNR-tRNA-pBpaRS plasmid, which is a vector for expressing the tRNA that allows Bpa to be incorporated into the engineered Amber stop codons while the TP is being translated. Finally, the transformants are grown on 5-FOA selectable media that induces loss of the URA3-marked plasmid thereby leaving the TP-Bpa variant as the sole source of the TP.\nTransform yeast with a URA3-marked vector expressing the wild type TP and knockout the endogenous TP gene locus using standard methods.13[href=https://www.wicell.org#bib13]\nTransform this strain with pSNR-tRN-pBpaRS and the TP-Bpa expression vector (selection is dependent upon available markers).\nPatch the transformants onto a fresh selective SD media plate.\nIncubate the plate at 30°C for 2 days.\nPrepare two additional plates: one selective media supplemented with 0.1% 5-FOA and the other lacking uracil.\nReplica plate the patched colonies by inverting the master plate with the freshly grown patches over a velveteen pad placed on a plate holder. Press the plate firmly against the surface of the sterile velveteen fabric.\nCarefully remove the plate thereby leaving a replica of the yeast patches on the velveteen.\nOne after the other, place the 5-FOA supplemented plate, press firmly, remove, then repeat with the (-) uracil plate.\nThe patches that fail to grow on the SD plate lacking uracil but grow on the plate with 5-FOA indicate successful “shuffling out” of the URA3-containing plasmid expressing the wild-type TP.15[href=https://www.wicell.org#bib15]",
    "To confirm the loss of the URA3-containing plasmid, re-streak the patches onto a fresh SD plate without uracil and ensure that the patches still do not grow.\nNote: The URA3 gene product converts 5-FOA into a toxic compound (5-fluorouracil) that prevents yeast cell growth.\nValidate TP-Bpa variants\nTiming: 2 days\nThis section details the steps for validating the expression of Bpa-incorporated TP in yeast cells with Bpa variants.\nInoculate SD + Bpa selection media (5 mL) with the yeast carrying the TP-Bpa expression vector and incubate 12–16 h at 30°C. Inoculate SD(-)Bpa selection media (5 mL) with transformants expressing the wild type His-tagged TP to serve as a control and incubate 12–16 h at 30°C.\nUsing the overnight cultures, seed SD + Bpa (TP-Bpa) and SD(-)Bpa (WT TP) selection media (25 mL) to an optical density (OD)595 = 0.3. Incubate the cultures at 30°C until OD595 = 0.6–0.7.\nHarvest the cells by centrifugation by decanting the cultures into 50 mL conical tubes and clarify the suspensions by spinning at 1467 × g for 5 min at 4°C.\nWash the cells 1x with 25 mL dH2O. Clarify the suspensions by centrifugation at 1467 × g for 5 min at 4°C.\nResuspend the cell pellets in 2 pellet volumes of TE10N1.0G (20 mM Tris pH 7.4, 10 mM EDTA, 100 mM NaCl, 10% Glycerol) buffer. As pellet volume can vary from experiment to experiment, the volume is empirically determined each time.\nTransfer the cell suspensions to 2 mL microcentrifuge tubes with conical shaped bottoms.\nAdd prechilled glass beads until ∼1 mm of cell suspension remains above the bead bed.\nBead beat at 460 × g for 13x of 1 min on/2 min off shaking cycles in an Eppendorf Thermomixer R.",
    "Alternatives: Vortex the tubes for 1 min and place on ice for 2 min for a total of 13 cycles.\nTransfer the glass beads/cell suspensions to fresh 1.5 mL microcentrifuge tubes.\nCap the tubes, flip over, and pierce a hole in the tube bottoms using a thumbtack.\nPlace the pierced tubes into fresh 1.5 mL microcentrifuge tubes, spin the nested tubes in a microcentrifuge to 5870 × g for 5 s then bring the speed to 13206 × g for 2 min.\nDiscard the upper tubes containing the used glass beads. Cap the lower tubes and clarify the whole cell lysates by centrifugation at 46017 × g for 15 min at 4°C.\nTransfer the clarified whole cell extracts to fresh 1.5 mL microcentrifuge tubes and keep them on ice.\nDetermine the protein concentrations using the BCA assay (Pierce Inc.). Resolve an aliquot (100 μg) of each whole cell extract on 12% acrylamide Laemmli SDS-PAGE along with marker protein size standards.\nTransfer the resolved protein samples to nitrocellulose and perform immunoblot analysis to visualize the wild type TP and the TP-Bpa His-tagged variants using an antibody directed against the TP or the 6x His-tag.\nNote: The TP-Bpa derivatives should resolve to the same apparent molecular size as the wild type protein when grown in SD + Bpa media but each will resolve to a smaller molecular weight in SD(-)Bpa media (the exact size will depend on where the Bpa substitution has been placed) since Bpa is needed to complete the polypeptide chain.",
    "Note: Checking that your TP-Bpa constructs produce protein products equivalent in molecular size as the wild type TP is a minimal validation step. If possible, perform activity tests to assess whether the TP-Bpa variant is functionally equivalent to the wild type TP. For example, in our tests of the Hsp90 molecular chaperone, we assessed the abilities of the Hsp90-Bpa variants to both support life (Hsp90 is essential) and the folding of the known client protein Glucocorticoid Receptor (GR), which is an established molecular chaperone activity for Hsp90.4[href=https://www.wicell.org#bib4]\nEstablishing the timing of ultra violet (UV) light-induced cross-linking\nTiming: 6–9 h\nThis part describes the steps for UV-induced cross-linking of interacting proteins to TP.\nInoculate SD + Bpa selection media (5 mL) with yeast transformed with the TP-Bpa expression vector or SD(-)Bpa media with wild type TP expression vector and incubate 12–16 h at 30°C.\nUsing the overnight cultures, seed cultures of SD + Bpa/(-)Bpa selection media (25 mL) to an optical OD595 = 0.3 for the TP-Bpa variant or WT TP. Incubate the cultures at 30°C until OD595 = 0.6–0.7.\nHarvest the cells by centrifugation by decanting the cultures into 50 mL conical tubes and clarify the suspension by spinning at 1467 × g for 5 min at 4°C.\nWhile the cell suspensions are clarifying, prepare a Styrofoam box to maintain the temperature of your cells during the UV cross-linking step.\nNote: We used a Spectrolinker XL-1500 for cross-linking that has an interior chamber height of 16 cm. Therefore, we used a Styrofoam box that is 14 cm high.\nAdd crushed dry ice to a depth of ∼3 cm or 1/3rd of the box depth, followed by wet ice filled to the box top.",
    "Place an aluminum plate on top to both keep a level surface and support the cell dish during UV cross-linking (Figure 3[href=https://www.wicell.org#fig3]). Significantly, no matter your UV device setup, the distance between the top of the petri dish and the UV bulbs should be ∼2 cm.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3065-Fig3.jpg\nFigure 3. Schematic of the UV cross-linking contraption\nTo maintain the sample temperature during prolonged UV exposure, cells are supported on an aluminum plate that is resting on a bed of wet ice (2/3rd of the box depth) on top of a bed of dry ice (1/3rd of the box depth) contained in a Styrofoam box. An important aspect of the design for achieving effective UV-cross-linking is the distance (∼2 cm) between the top of the Petri dish and the UV bulbs.\nDiscard the supernatant and resuspend the cell pellets in 2 mL of SD(-)Bpa, and transfer the cell suspensions to 6 cm clear petri dishes. Place each petri dish on top of the chilled metal plate.\nPlace the cells and Styrofoam box in the Spectrolinker XL-1500 equipped with 365 nm bulbs. The top of the petri dish is ∼2 cm from the UV bulbs.\nNote: If necessary, paper towels can be used to raise the box and adjust the distance between the petri dish and UV bulbs to ∼2 cm.\nSince the strength of the bulbs is an important variable, empirically determine the time needed for effective cross-linking. Process a 25 mL culture without exposure to UV light in parallel (i.e., 0 min control).\nNote: In determining a sufficient cross-linking time, which results in the majority of the TP being cross-linked, we found that initial test times of 60, 120, and 180 min were effective for our test protein Hsp904[href=https://www.wicell.org#bib4] (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3065-Fig4.jpg\nFigure 4. Empirical establishment of UV cross-linking time",
    "Yeast expressing a Bpa variant (TP-Bpa) or a wild type (WT) version of the TP was exposed to 0, 1, 2, or 3 h of UV light. Whole cell extracts were prepared from the cells and the TP was visualized by immunoblot analysis. In the presented case, the TP is the Hsp90 molecular chaperone expressed as a His-tagged fusion protein.4[href=https://www.wicell.org#bib4] The immunoblot step used an anti-His6 antibody (1:1000 dilution in 1X PBS substituted with 5% bovine serum albumin and 0.04% NaN3). The position of the full length TP is marked with a red arrow head and the un-cross-linked and cross-linked TP-Bpa species are marked with a red rectangle.\nClarify the cell suspensions by centrifugation (5870 × g for 5 min at 4°C), wash 1x with 1 mL of dH2O, snap freeze the cell pellets in a dry ice/methanol bath, and store at ‒80°C.\nCross-linking validation\nTiming: 2–3 h\nThese steps validate whether interacting proteins have been cross-linked to the TP.\nTo check the relative level of cross-linking of the TP-Bpa variants, visualize the proteins by immunoblot analysis following steps 11‒15. Both the wild type TP and 0 min samples serve as negative controls.\nNote: If cross-linking is successful, multiple bands above the full-length TP-Bpa species will be present depending upon the position of the Bpa and/or the full-length TP-Bpa band will be significantly reduced, as it is cross-linked to other proteins (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3065-Fig5.jpg\nFigure 5. Cross-linking validation of purified TP-Bpa variants",
    "Yeast expressing 5 different His-tagged Bpa variants (TP-Bpa #1-5) or a His-tagged wild type (WT) TP were exposed to 0 (-) or 3 (+) h of UV light. Whole cell extracts were prepared from the cells, the un-cross-linked and cross-linked TPs were isolated by metal affinity chromatography, aliquots of the purified proteins were resolved by SDS-PAGE, and the TP protein and cross-linked-complexes were visualized by staining with Coomassie blue. The TP is the Hsp90 molecular chaperone expressed as a His-tagged fusion protein.4[href=https://www.wicell.org#bib4] The TP-Bpa variants (#1-3) that produced distinct cross-linked products are marked with a red rectangle and the TP-Bpa derivatives (#4 and 5) that only showed a reduction in the full length proteins are indicated with red asterisks.\nNote: For our model TP Hsp90 we engineered 5 different Bpa sites that spanned the 3 domains of Hsp90.4[href=https://www.wicell.org#bib4] We found that different Bpa variants can produce distinct cross-linking patterns as visualized by immunoblot analysis including just a reduction in the full-length Bpa containing protein (Figure 5[href=https://www.wicell.org#fig5]). Presumably, the TP-Bpa variants #4 and #5 do not show distinct higher molecular weight cross-linked species since there isn’t a major binding partner near the site of Bpa incorporation but rather there are a number of protein interactors that result in a decline in the full-length (un-cross-linked) protein.\nIf your TP has known binding partners, analyze your samples by immunoblot analysis by probing for the captured partner using an antibody selective for the binding partner. Both the 0 min UV treatment and wild type TP samples serve as negative controls.\nNote: This test is especially relevant if you designed the Bpa incorporation sites at or near the site for interaction with the binding partner.",
    "Note: In some instances, it can be difficult to detect higher molecular weight products in a whole cell extract. If you encounter this problem, purify the His-tagged TP, as described below, and visualize the purified products by immunoblot analysis.\nCross-linking validation after purification of TP\nTiming: 4–5 h\nThis section confirms cross-linking to your TP after metal-affinity purification.\nResuspend the frozen cell pellets on ice in 2 pellet volumes of ice cold TALON binding (TBB) buffer (50 mM Na3PO4, 300 mM NaCl pH 7.4) supplemented with Triton-X (0.75% final).\nTransfer the cell suspensions to 2 mL microcentrifuge tubes with conical shaped bottoms, and add prechilled glass beads until ∼1 mm of cell suspension remains above the bead bed.\nAs before, bead beat at 1467 × g for 37 min with 1 min on/2 min off shaking cycles in an Eppendorf Thermomixer R.\nAlternatives: Vortex the tubes for 1 min and place on ice for 2 min for a total of 13 cycles.\nWhile the cells are bead beating, prepare TALON cobalt beads by washing the beads 3x with 10x bead volume of TBB. As pellet volume can vary from experiment to experiment, the volume is empirically determined each time. Gently centrifuge between washes to pellet the beads at 2113 × g for 3 min. The volume of beads needed is dependent upon the volume of the cell cultures with 20 μL of beads needed for every 25 mL of culture.\nTransfer the glass beads/cell suspensions to fresh 1.5 mL microcentrifuge tubes.\nCap tops, flip over, and pierce a hole in the tube bottoms using a thumbtack.",
    "Place the pierced tubes into fresh 1.5 mL microcentrifuge tubes, spin the nested tubes in a microcentrifuge to 5870 × g for 5 s then bring the speed to 13206 × g for 2 min.\nDiscard the upper tubes containing the used glass beads. Cap the lower tubes and clarify the whole cell lysates by centrifugation at 46017 × g for 15 min at 4°C.\nTransfer the clarified whole cell extracts to fresh 1.5 mL microcentrifuge tubes containing the necessary aliquot of washed TALON cobalt resin (e.g., 20 μL of beads for a 25 mL test culture) and nutate the mixture at 4°C for 2 h.\nClarify the bead suspensions by centrifugation at 2113 × g for 3 min, carefully remove the lysate, and discard the lysate.\nWash the beads 4x with 10x bead volume of TBB supplemented with 20 mM imidazole. As pellet volume can vary from experiment to experiment, empirically determine the volume each time. Clari the suspensions by centrifugation at 2113 × g for 3 min between washes.\nElute the proteins off the metal beads by adding 1 bead volume of TBB supplemented with 150 mM imidazole, nutate 15 min at 4°C, clarify the bead suspensions by centrifugation at 2113 × g for 3 min, carefully remove the lysate, and transfer the supernatant (i.e., eluted proteins) to a fresh 1.5 mL microcentrifuge tube.\nResolve the entire sample on 12% acrylamide Laemmli SDS-PAGE along with marker protein size standards.\nVisualize the resolved products using Coomassie brilliant blue stain or SYPRO Ruby protein gel stain.\nPreparation of cross-linked samples for mass spectrometry\nTiming: 2 days\nThis section describes the sample preparation for mass spectrometry analysis.",
    "For each biological replicate, inoculate SD + Bpa selection media (20 mL) with yeast transformants carrying the TP-Bpa expression vector and incubate 12–16 h at 30°C.\nNote: In addition to the Bpa variants, it is important to include either or both transformants expressing the wild type His-tagged TP and/or parental yeast not expressing a His-tagged TP variant (negative control for mass spectrometry analysis).\nCritical: The end point assay to identify physical interactors uses Multidimensional Protein Identification Technology (MudPIT) mass spectrometry. A thorough analysis of this type of data minimally requires biological triplicates and negative control(s). As our tactic relies on a metal affinity purification step, a suitable negative control is the use of yeast with a comparable background that do not express the TP as a His-tagged fusion. The negative controls are processed comparably to the experimental samples.\nAlternatives: Cultures not treated with UV light can be used as a negative control.\nUsing the overnight cultures, seed SD + Bpa media (250 mL each) to an optical density (OD595) = 0.3. Incubate the cultures at 30°C until OD595 = 0.6–0.7.\nNote: If your TP is essential, growing the cells in complete media (e.g., Yeast extract, Peptone, and Dextrose (YPD) media) supplemented with Bpa will provide more robust growth if the expression of the full length, essential protein can serve as the selective pressure to maintain the plasmids.\nHarvest the cells by centrifugation (1467 × g for 5 min at 4°C).\nWhile the cell suspensions are clarifying, prepare the Styrofoam box with dry ice/wet ice/metal plate, as in step 20.",
    "Resuspend the cell pellet in SD(-)Bpa to a final volume of 20 mL, and transfer 5 mL aliquots to 10 cm clear petri dishes (∼0.8 OD595 units of cells per cm2 surface area achieving ∼0.1 cm cell suspension depth). Place the petri dishes on top of the chilled metal plate.\nPlace the cells and Styrofoam box in the Spectrolinker XL-1500 equipped with 365 nm bulbs with the top of the dish being ∼2 cm from the UV bulbs.\nTreat cells to UV light using the empirically determined time (step 23).\nClarify the cell suspensions by centrifugation (5870 × g for 5 min at 4°C), wash 1x with 1 mL of dH2O, combine cell suspensions from the same culture to form a single cell pellet, snap freeze the cell pellets in a dry ice/methanol bath, and stored at ‒80°C.\nRepeat steps 37‒44 three more times to accrue frozen cell pellets containing a total of 1 L of yeast culture (step 36).\nResuspend the cell pellets expressing the same TP variant in 2 pellet volumes of TBB buffer supplemented with 0.75% Triton-X. As pellet volume can vary from experiment to experiment, the volume is empirically determined each time.\nTransfer the cell suspensions to 2 mL microcentrifuge tubes with conical shaped bottoms. The exact number of 2-mL tubes needed will vary with the total sample volume.\nAdd prechilled glass beads until ∼1 mm of cell suspension remains at the top.\nBead beat at 460 × g for 37 min with 1 min on/2 min off shaking cycles in an Eppendorf Thermomixer R.\nAlternatives: Vortex the tubes for 1 min and place on ice for 2 min for a total of 13 cycles.\nTransfer the glass beads/cell suspensions to fresh 1.5 mL microcentrifuge tubes.",
    "Cap tops, flip over, and pierce a hole in the tube bottoms using a thumbtack.\nPlace the pierced tubes into fresh 1.5 mL microcentrifuge tubes, spin the nested tubes in a microcentrifuge to 5870 × g for 5 s then bring the speed to 13206 × g for 2 min.\nDiscard the upper tubes containing the used glass beads. Cap the lower tubes and clarify the whole cell lysates by centrifugation at 46017 × g for 15 min at 4°C.\nTransfer the clarified whole cell extracts to 15 mL conical tubes containing prewashed TALON cobalt resin (200 μL of beads for each 325 mL culture) and nutate the mixture at 4°C for 2 h. Typically, 1 L of yeast culture will result in ∼10 mL of whole cell extract with a protein concentration in the range of 8–10 mg/mL.\nClarify the bead suspensions by centrifugation at 2113 × g for 3 min, carefully remove the lysate, and discard the lysate.\nWash the beads 4x with 10x bead volume of TBB supplemented with 20 mM imidazole. As bead volume can vary from experiment to experiment, the volume is empirically determined each time, clarifying the suspensions by centrifugation at 2113 × g for 3 min between washes.\nRemove the wash buffer completely from the beads and resuspend in 8M urea and 50 mM ammonium bicarbonate.\nNote: Samples can be frozen and stored at ‒80°C prior to resuspending in urea/ammonium bicarbonate if needed.\nIncubate the suspension with 5 mM tris(2-carboxyethyl) phosphine (TCEP) at 30°C for 60 min, followed by 30 min incubation with 15 mM iodoacetamide (IAA) in the dark at 25°C.\nNote: TCEP reduces disulfide bonds in the affinity-purified proteins and IAA alkylates the cysteines.",
    "Dilute the urea concentration to 1M using 50 mM ammonium bicarbonate and digest the proteins for 16 h using mass spectrometry grade Trypsin/Lys-C.\nFollowing 16 h digestion, collect the beads by centrifugation at 2113 × g for 3 min and transfer the peptide solution to a fresh tube.\nUsing formic acid (FA), acidify peptide samples and subsequently desalt using AssayMap C18 cartridges mounted on an Agilent AssayMap BRAVO liquid handling system. Prior to mounting, condition the cartridges with 100% acetonitrile (ACN) followed by 0.1% FA.\nAfter mounting, wash the samples with 0.1% FA and elute the peptides with 60% ACN, and 0.1% FA. Dry the samples and resuspend in 2%ACN + 0.1 FA.\nMass spectrometry and bioinformatic analysis\nTiming: 2–4 weeks\nThis section covers the mass spectrometry work and analysis of the raw mass spectrometry data including identifying the peptides that are cross-linked to the Bpa TP variants.\nAnalyze the samples by LC-MS/MS using a Proxeon EASY-nanoLC system coupled to a Q-Exactive Plus mass spectrometer.\nSeparate the peptides using an analytical C18 Aurora column (75 μm × 250 mm, 1.6 μm particles; IonOpticks) at a flow rate of 200 nL/min using a 120-min gradient: 1%–5% B in 1 min, 6%–23% B in 72 min, 23%–34% B in 45 min, and 34%–48% B in 2 min (A = FA 0.1%; B = 80% ACN: 0.1% FA).\nNote: The mass spectrometer was operated in positive data-dependent acquisition mode.\nMeasure the MS1 spectra in the Orbitrap in a mass-to-charge (m/z) of 350–1700 with a resolution of 70,000 at m/z 400.\nSet the automatic gain control target to 1 × 106 with a maximum injection time of 100 ms. Set the dynamic exclusion to 20 s with a 10 ppm mass tolerance around the precursor.",
    "Note: Up to 12 MS2 spectra per duty cycle can be triggered, fragmented by HCD, and acquired with a resolution of 17,500 and an AGC target of 5 × 104, an isolation window of 1.6 m/z, and a normalized collision energy of 25.\nAcquire the Saccharomyces cerevisiae protein sequence database from UniProt and GPM cRAP sequences that contains commonly known protein contaminants.\nAnalyze the LC/MS spectra using the MaxQuant software (v1.5.5.1). Set the precursor mass tolerance to 20 ppm for initial mass recalibration and to 4.5 ppm for the main search.\nUse a mass tolerance of 0.5 Da and a maximum precursor ion charge state of 7 to search for the product ions.\nDenote carbamidomethylation of cysteine as a fixed modification and oxidation of methionine and acetylation of protein at the N-terminal as variable modifications.\nSet the enzyme to trypsin in a specific mode and set a threshold of a maximum of two missed cleavages. We used a target-decoy-based false discovery rate (FDR) filter of 1% for spectrum and protein identification.\nAsses the raw mass spectrometry datasets using the Bioconductor package artMS (https://bioconductor.org/packages/release/bioc/html/artMS.html[href=https://bioconductor.org/packages/release/bioc/html/artMS.html]).8[href=https://www.wicell.org#bib8] We used a p-value cut off of 0.05; however, the user can define their statistical threshold. In our presented example, we used Bioconductor version: Release (3.17).\nConsider hits as positive when the average value for the triplicate is enriched 1.5-fold and higher relative to the negative control samples.",
    "Note: The negative control can vary depending on the desired outcome. In our experience, the wild type TP (i.e., non-Bpa containing) is useful for identifying stably associated factors. The TP-Bpa variants not only identify these proteins but also capture transiently interacting proteins. If you decide to follow this approach, then it is important to process in parallel yeast not expressing a His-tagged derivative of the TP to be used as the negative control in this bioinformatic analysis step.\nTo identify cross-linked peptide pairs linked through the Bpa moiety, Analyze the resulting artMS hits using the MeroX algorithm.9[href=https://www.wicell.org#bib9],16[href=https://www.wicell.org#bib16] (http://stavrox.com/help.htm#workflow[href=http://stavrox.com/help.htm#workflow]).\nCreate the expected peptide fragments resulting from the digestion of your TP with trypsin that encompasses the Bpa moiety. Upload the sequence(s) as a single FASTA file and the artMS output data (mzML file) using the \"Load Fasta\" and \"Load MS-File\" buttons.\nSince Bpa is a non-natural amino acid, replace the site of Bpa incorporation in the TP FASTA sequence with an “x”.\nTo accomplish this, navigate to the settings tab on the MeroX home screen and click on the amino acids tab.\nUse the ‘Add’ button to include BPA on the amino acid list.\nSet the code as ‘x’ and also include Bpa’s elemental composition (C16H13NO2) and molecular mass (251.09462863) in the table.\nUnder the modifications tab, change the Max mod. to 2 (m for oxidized methionine and x for BPA).\nUnder the cross-linker tab, using the ‘Add XL’ button, add BPA as a cross-linker. Enter the maximum distance bridged by the cross-linker (Cα-Cα) to 12.0 Å. Mention the specificity site 1 as ‘x’ and specificity site 2 as ‘{’ followed by the codes of all amino acids added in the amino acids table.\nNote: The specificity site 2 should be {ABCDEFGHIKLMmNPQRSTVWYx where '{' denotes the N-terminus of the tryptic peptide.",
    "In the Mass Comparison tab, change the Precursor precision (MS1) to 10 and the Fragment ion precision (MS2) to 15. Set the signal-to-noise (S/N) ratio to 1.\nUnder the Score & FDR tab, adjust % intensity to 5%, FDR cut off to 5%, and Score cut off to 2.\nPress the ‘OK’ button at the bottom and press the ‘Start’ button to start the analysis.\nAfter the analysis is completed, the Main Window will display the candidates, unique cross-link sites, the cross-link position and fragmentation, and the mass spectrum (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3065-Fig6.jpg\nFigure 6. Mass spectrum of cross-linked peptides\nCross-linked peptide pairs are identified in the MudPIT spectra using the MeroX algorithm.9[href=https://www.wicell.org#bib9],16[href=https://www.wicell.org#bib16] The recognized pairs are further filtered by visually scanning the pairs for the presence of b and y ions from each peptide. The TP peptide will contain an “X” that represents the Bpa moiety created while running MeroX. For illustrative purposes, we highlight the b and y ions from the captured interaction partner protein in an idealized MS/MS spectrum free of noise and containing all of the b and y ion fragments (right). Ionization at the N-terminal of the peptide results in the formation of b ions and ionization at the C-terminal results in the formation of y ions.\nSave the analysis using [Ctrl+S] or by the dropdown option from the ‘File’ menu at the top left."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Protein Biochemistry",
    "Model Organisms"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}