{
  "id": 3671,
  "origin_website": "Cell",
  "title": "Exclusive labeling of direct and indirect pathway neurons in the mouse neostriatum by an adeno-associated virus vector with Cre/lox system",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nVirus injection\nTiming: ~1 h\nHere, we describe the stereotaxic injection of an AAV vector solution (200 nL) into the mouse CPu.\nDisinfect the instruments for use in the injection experiment with 70% ethanol. Please refer to institutional guidelines for specific instructions on proper aseptic technique.\nFabricate a glass micropipette using a PC-100 puller with a single pulling mode. Set the heating value to 73.5 and pulling force to 125 g ( Figures 3[href=https://www.wicell.org#fig3]A and 3B ).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/358-Fig3.jpg\nFigure 3. Injection of the AAV vector solution\n(A) PC-100 puller.\n(B) Fabrication of a glass micropipette.\n(C) Folding the tip of a glass micropipette\n(D) Aspiration of the AAV vector solution into the glass micropipette. First, 500 nL of the solution is aspirated to mark the top surface with a permanent marker, and then another 200 nL is aspirated.\n(E) Head fixation of an anesthetized mouse with a stereotaxic instrument.\n(F) Perforation with a hand drill.\n(G) Picospritzer III connected to a high-pressure N2 cylinder.\n(H) Attaching the glass micropipette to the holder of Picospritzer III.\n(I) Inserting the micropipette into the brain.\nNote: The setting values will vary depending on the filament. Find the best conditions for your purpose.\nFold the tip with fine-tip tweezers and check under a microscope that the tip is 50–70 μm in diameter (Figure 3[href=https://www.wicell.org#fig3]C).\nDilute AAV2/1-E/SYN-FLEX-[pR-pG(r)] vector solution with PBS containing 2% (w/v) BSA to 1 × 1011 infectious unit/mL.\nPlace the diluted solution on ice.\nNote: The solution may be preserved at 4°C for up to 1 month.",
    "Aspirate 500 nL of an AAV vector solution on a Parafilm sheet through the tip of a glass micropipette using capillary action, and mark the top surface of the solution with a permanent marker. Then, aspirate 200 nL of a virus solution again (700 nL in total).\nCritical: When injecting deep into the brain, the top surface of the solution becomes invisible, making it difficult to ascertain the injection volume. Aspirate the extra solution (e.g., 500 nL) and mark the level with a permanent marker so that you can inject the exact amount of the virus solution ( Figure 3[href=https://www.wicell.org#fig3]D).\nAnesthetize a Drd1-Cre BAC transgenic mouse (8–16 weeks) by intraperitoneal injection of a mixture of medetomidine (Domitor; 0.3 mg/kg), midazolam (Midazolam Sandoz; 4 mg/kg), and butorphanol tartrate (Vetorphale; 5 mg/kg) in saline (0.9% NaCl). Please refer to institutional guidelines for proper anesthesia.\nMount the anesthetized mouse into a stereotaxic instrument using an auxiliary ear bar. Adjust the position of the mouth and nose fixing clamp (incisor bar) until the lambda and bregma are equal in height (flat-skull position) (Figure 3[href=https://www.wicell.org#fig3]E).\nMake an incision in the scalp with a scalpel along the midline to expose the skull.\nAfter marking the skull above the CPu with a surgical marker-pen (NESCO DERMARK R), thin the skull above the marked site using a hand drill with a steel hole cutter (Figure 3[href=https://www.wicell.org#fig3]F). The injection coordinates for the CPu are as follows: 0.8 mm anterior to bregma, 2.0 mm lateral to the midline, and 2.5 mm ventral to the brain surface.\nCritical: While thinning the skull by a hand drill, wet with saline appropriately to avoid damage to the cortices by frictional heat.\nCarefully remove the remaining bone using fine-tip tweezers to expose the surface of the brain.",
    "Set the Picospritzer III to 40 psi injection pressure and 5 ms injection duration ( Figures 3[href=https://www.wicell.org#fig3]G and 3H).\nCritical: Eject a drop of virus solution from the tip of the glass micropipette to make sure it is not clogged, before inserting it into the brain. Troubleshooting 1[href=https://www.wicell.org#troubleshooting]\nMove the glass micropipette to the brain surface and slowly insert it into the target ( Figure 3[href=https://www.wicell.org#fig3]I). Pull the micropipette upward approximately 0.05 mm to make space for the virus solution to diffuse. Troubleshooting 2, 3, and 4[href=https://www.wicell.org#troubleshooting]\nInject the virus solution into the mouse CPu by pressure pulses through a glass micropipette attached to Picospritzer III for 5 min. Troubleshooting 5[href=https://www.wicell.org#troubleshooting]\nLeave the micropipette in place for 5 min, and then remove it slowly.\nAfter closing and sterilizing the wound, administer antibiotics (e.g., gentamicin ointment) locally.\nRecover the mouse from anesthesia by intraperitoneal injection of atipamezole (Antisedan; 1.5 mg/kg) in saline after approximately 15 min. Please refer to institutional guidelines for anesthesia management.\nMaintain the mouse in specific pathogen-free conditions under a 12 h light/dark cycle with ad libitum access to food and water for 1 week after the AAV injection.\nTissue preparation\nTiming: 2–3 days\nNote: Filtrate PBS and the fixative solution through filter paper before perfusion.\nHere, we introduce the preparation of sections for free-floating immunostaining.\nAnesthetize the mouse deeply by intraperitoneal injection of sodium pentobarbital (Somnopentyl; 200 mg/kg) in saline. Please refer to institutional guidelines for proper anesthesia.\nOpen the thoracic cavity with surgical scissors, cut the right atrial appendage to bleed, and immediately insert a 22-gauge needle from the apex into the left ventricle of the heart.\nPerfuse with 20 mL of PBS using a syringe for 3 min to remove the blood from the circulatory system.",
    "Perfuse with 20 mL of a fixative solution using another syringe at the same speed.\nCritical: Be careful not to allow any small bubbles to enter during the perfusion. The inclusion of bubbles results in incomplete fixation.\nRemove the brain from the skull and place it in the same fixative solution for 12–24 h at 4°C.\nReplace the fixative solution with 30% (w/v) sucrose in 0.1 M PB and gently shake it for 1–2 days at 4°C to cryoprotect the brain tissue.\nApproximately 30 min before sectioning, turn on the low temperature circulator and set it to 4°C (Figure 4[href=https://www.wicell.org#fig4] A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/358-Fig4.jpg\nFigure 4. Section preparation\n(A) Sliding microtome equipped with a freezing device.\n(B) Equipment to make dry ice powder (snow horn).\n(C) Mounting brain tissue onto the stage with OCT compound.\n(D) Freezing brain tissue with dry ice powder.\n(E) Cutting brain tissue sections on the sliding microtome.\n(F) Brain sections serially collected in 6 vials.\nMount the brain tissue onto the stage of a freezing microtome with OCT compound, and adjust the stage angle to keep the sagittal plane of the brain horizontal (Figure 4[href=https://www.wicell.org#fig4]C).\nTurn on the electro-freezing component and set it to −25°C.\nQuickly freeze the brain tissue using dry ice powder and leave it in place for at least 5 min (Figure 4[href=https://www.wicell.org#fig4]D).\nNote: We recommend dry ice powder prepared by a snow horn for rapid tissue freezing (Figure 4[href=https://www.wicell.org#fig4]B).\nCut the brain tissue into 20-μm-thick parasagittal sections (Figure 4[href=https://www.wicell.org#fig4]E), collect the sections with a paintbrush, and store them in 6 vials containing 0.02% sodium azide in 0.1 M PB (Figure 4[href=https://www.wicell.org#fig4]F). Each vial will contain around 20 sections.\nNote: For long-term storage (e.g., 5 years), increase the concentration of sodium azide to 0.2%.\nImmunofluorescence staining\nTiming: 2 days",
    "Here, we explain the procedure for double immunofluorescence staining for GFP and RFP. All the incubations are performed at 20°C–25°C with a gentle shake.\nWash the sections with 8 mL of PBS for 10 min twice, and then with PBS-X for 30 min.\nIncubate the sections for 12–24 h with a mixture of 20 μg/mL of chicken polyclonal anti-GFP antibody and 1 μg/mL of affinity-purified rabbit antibody against mRFP1 in 500 μL of PBS-XCD.\nWash the sections with 8 mL of PBS-X for 10 min twice.\nIncubate the sections for 2 h with a mixture of 5 μg/mL of AlexaFluor (AF) 488-conjugated antibody against chicken IgY and 5 μg/mL of AF568-conjugated antibody against rabbit IgG in 500 μL of PBS-XCD.\nWash the sections with 8 mL of PBS-X for 20 min twice, and then with 8 mL of PBS for 20 min twice.\nMount the sections onto APS-coated glass slides.\nApply a coverslip with a mounting medium for fluorescence microscopy.\nNote: The sections can be kept for about 2 years at −20°C.\nObserve the sections under a confocal laser scanning microscope (Figures 5[href=https://www.wicell.org#fig5]A–5F ). Troubleshooting 6 and 7[href=https://www.wicell.org#troubleshooting]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/358-Fig5.jpg\nFigure 5. Exclusive labeling of dMSNs and iMSNs\n(A–C) The presence of spines on the dendrites indicates that GFP-positive and RFP-positive cells are dMSNs and iMSNs, respectively. Arrows indicate the cell bodies. Scale bar, 30 μm.\n(D–F) In the GPe, GFP-positive fibers were sparsely distributed, whereas RFP-positive fibers were dense. GFP-positive, but not RFP-positive, fibers extend caudally beyond the GPe, forming the direct pathway to the output nuclei of the basal ganglia. Scale bar, 100 μm.\nImmunoperoxidase staining\nTiming: 4 days",
    "Critical: Before incubation with the sections, mix solutions A and B of ABC Elite kit at 1:100 dilution each in 500 μL of PBS-X and incubate the mixture for at least 30 min at 20°C–25°C with a gentle shake to form the avidin-biotinylated peroxidase complex (ABC).\nWe developed a cost-effective and straightforward signal amplification method called BT-GO reaction. Here, we describe the protocol in detail. All the incubations are performed at 20°C–25°C with a gentle shake.\nWash the sections with 8 mL of PBS for 10 min twice.\nIncubate the sections for 30 min with 8 mL of 1% (v/v) H2O2 in PBS to inactivate endogenous peroxidase activity.\nWash the sections with 8 mL of PBS-X for 10 min twice.\nIncubate the sections for 12–24 h with 0.1 μg/mL of affinity-purified rabbit antibody against GFP or mRFP1 in 500 μL of PBS-XCD.\nWash the sections with 8 mL of PBS-X for 10 min twice.\nIncubate the sections for 2 h with 10 μg/mL biotinylated goat antibody against rabbit IgG in 500 μL of PBS-XCD.\nWash the sections with 8 mL of PBS-X for 10 min twice.\nIncubate the sections for 1 h with 1:100-diluted avidin-biotinylated peroxidase complex (ABC) in 500 μL of PBS-X.\nWash the sections with 8 mL of PBS-X for 10 min twice.\nWash the sections with 8 mL of 0.1 M PB for 10 min twice.\nIncubate the sections for 5 min with a BT-GO reaction mixture containing 1:50,000-diluted BT solution, 3 μg/mL of GO, and 1% BSA in 1 mL of 0.1 M PB.\nNote: The optimal concentration of the BT solution used in the reaction should be determined by the end user. We recommend a dilution of the solution from 1:5,000 to 1:500,000 for the trial.",
    "Add 10 μL of β-D-glucose solution to a final concentration of 2 mg/mL and mix the solution and sections well.\nIncubate the sections for 30 min ( Figure 6[href=https://www.wicell.org#fig6] A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/358-Fig6.jpg\nFigure 6. Signal enhancement with the BT-GO reaction\n(A) Schematic diagram of the signal amplification method with the BT-GO reaction. BT is deposited on tyrosine residues in the tissue via the peroxidase activity of ABC. This deposition requires H2O2, and the chemical reaction between glucose and GO supplies H2O2 stably.\n(B and C) Visualization of GFP-labeled dMSN axon fibers in the GPe without (B) or with (C) the BT-GO reaction. While DAB deposition through the peroxidase activity of ABC gave a weak signal (B), the BT-GO reaction markedly amplified the signals of the axon fibers. (C) is the adjacent section of (B). Scale bar, 100 μm.\nWash the sections with 8 mL of 0.1 M PB for 10 min.\nWash the sections with 8 mL of PBS-X for 10 min twice.\nIncubate the sections for 1 h with 1/100-diluted ABC in 500 μL of PBS-X.\nWash the sections with 8 mL of PBS-X for 10 min twice.\nWash the sections with 8 mL of PBS for 10 min twice.\nIncubate the sections for 30–60 min with 0.02% (w/v) DAB and 0.0001% (v/v) H2O2 in 8 mL of 50 mM Tris-HCl (pH 7.6).\nCritical: Check the progress of DAB deposition under the microscope and stop the reaction at a high signal-to-noise ratio. If DAB deposition is weak and slow, additional H2O2 can be added directly to the reaction solution.\nWash the sections with 8 mL of PBS for 10 min three times.\nMount all the stained sections serially onto APS-coated glass slides.\nDry up the sections.",
    "Soak the glass slides in ethanol-water mixtures of 30, 50, and 70% (v/v) for 30 min each, and dip the slides into 95% (v/v) ethanol in water.\nSoak the glass slides in 100% ethanol for 12–24 h.\nDip the glass slides into a xylene-ethanol mixture of 50% (v/v) and soak the slides in 100% xylene for 12–24 h.\nCoverslip the sections with a mounting medium for bright-field microscopy, NEW MX.\nObserve the sections under a bright-field microscope, MICROPHOT-FXA, ( Figures 6[href=https://www.wicell.org#fig6]B and 6C) and capture images using a Nikon D-700 camera. Troubleshooting 8[href=https://www.wicell.org#troubleshooting]\nNote: Specimens can be stored for at least 10 years at 20°C–25°C with protection from light.\nAxon tracing\nTiming: ~4 days\nBy using the virtual slide system, the efficiency of the two-dimensional reconstruction is greatly increased. We briefly describe the reconstruction method using a TOCO virtual slide scanner.\nAcquire a color image of the entire section with a spatial resolution of 1.038 μm/pixel using the digital slide scanner TOCO with a 10× objective lens.\nTrace and digitize the axons of DAB-stained neurons on the images with a digital pen tablet and a graphic software ADOBE ILLUSTRATOR CS3.\nAlternatives: Virtual slide systems from other manufacturers are also available.\nNote: Axons are sometimes out of focus, where multiple axon fibers cross one another. Additional observations with a bright field microscope may also be required to reconstruct the axons accurately."
  ],
  "subjectAreas": [
    "Gene Expression",
    "Microscopy",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}