{
  "id": 13545,
  "origin_website": "Jove",
  "title": "A 5-mC Dot Blot Assay Quantifying the DNA Methylation Level of Chondrocyte Dedifferentiation In Vitro",
  "procedures": [
    "This study was approved by the Human Ethics Committee of Shenzhen Second People's Hospital.\n1. Human Articular Cartilage Tissue Collection and Chondrocyte Culture\nPreparation of materials\nPrepare Dulbecco's modified eagle medium (DMEM) medium supplemented with 10% fetal bovine serum and 1% penicillin-streptomycin. Prepare 1 mg/mL collagenase II, 0.25% trypsin-EDTA, phosphate-buffered saline (PBS), and a cell strainer (40 µm nylon).\nHuman articular cartilage tissue collection\nIsolate articular cartilage from the knee joints of donor patients after trauma. Obtain informed consent from all participants.\nDice the cartilage into 1-2 mm3 pieces using a sterile scalpel and digest chondrocytes from the minced cartilage with 1 mg/mL collagenase II in DMEM at 37 °C for 12-16 h.\nFilter the resulting cell suspension through a cell strainer (40 µm) and wash twice with PBS.\nCount cells with a hemocytometer and seed at a density of 20,000-30,000 cells/cm2 in DMEM supplemented with 10% fetal bovine serum (FBS) and 1% penicillin-streptomycin.\nCulture in an incubator at 37 °C.\nMonolayer chondrocyte expansion\nHarvest sub-confluent cells using 0.25% trypsin-EDTA and re-plate at a density of 6,600 cells/cm2. Change the medium twice a week.\nCulture chondrocytes in monolayers for up to six passages and assess at passages 1, 2, 3, 4 and 5.\n2. Genomic DNA (gDNA) Extraction\nCollect cells and resuspend in 500 µL lysis buffer (15 mM Tris pH 8.0, 10 mM EDTA pH 8.0, 0.5% SDS, 200 µg/mL RNase A) per 10 million cells. Resuspend cells by pipetting and rapid inversion, and then incubate for 1 h at 37 °C.\nAdd proteinase K at a concentration of 160 µg/mL of cell lysate and invert the mixture vigorously. Incubate 6 h at 55 °C.",
    "Add one volume of Tris pH 7.9 saturated phenol:chloroform:isoamyl alcohol (25:24:1) to the sample. Vortex or shake the sample by hand thoroughly for approximately 20 s.\nCentrifuge the sample at room temperature for 5 min at 13,000 × g. Remove the upper aqueous phase and transfer the layer to a fresh tube.\nExtract with an equal volume of chloroform to remove phenol and transfer the top aqueous phase to a fresh tube.\nPrecipitate DNA by adding 0.1 sample volume of 3 M sodium acetate pH 8.0 and 2 volumes of 100% ethanol.\nStore the tube at -20 °C overnight to precipitate the gDNA.\nCentrifuge the sample at 4 °C for 10 min at 16,000 x g to pellet gDNA.\nWash the sample three times with 70% ethanol, and centrifuge at 4 °C for 2 min at 13,000 x g.\nRemove the supernatant carefully and then air-dry. Resuspend the DNA in 10 mM Tris pH 8.0, 0.1 mM EDTA.\n3. DNA Methylation Profiling\nUse a DNA methylation kit to perform the bisulfite conversion reaction using a total of 500 ng of the genomic DNA, according to manufacturer's protocol. Elute in 10 µL of elution buffer (50 ng/µL).\nPerform the DNA methylation profiling using a commercial kit according to manufacturer's protocol.\n4. Dot Blot Analysis\nDenature the isolated DNA (1 mg per sample) in 0.1 M NaOH for 10 min at 95 °C. Neutralize the DNA with 1 M NH4OAc on ice, and then dilute two-fold. Spot 2 µL of the serial diluted genomic DNA on an N+ membrane.\nBlot the membrane at 80 °C for 30 min.\nBlock non-specific antibody binding sites by soaking the N+ membrane in 5% BSA in TBS-T for 1 h. Use a 10 cm Petri dish as a reaction chamber at room temperature.",
    "After washing 5 min three times in TBST, incubate the membrane with a mouse anti-5-methylcytosine (5-mC) monoclonal antibody (1:1,000) in TBS-T at 4 °C overnight.\nWash the membrane for 5 min three times in TBS-T, and then incubate with a secondary antibody, HRP-conjugated sheep anti-mouse immunoglobulin-G (IgG) (1:5,000) in TBS-T for 1 h at room temperature.\nWash the membrane for 5 min three times in TBS-T.\nAdd the enzyme substrate to the membrane and incubate for 5-10 min. Visualize the secondary antibody signal using a chemiluminescence kit according to the manufacturer's instructions.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}