{
  "id": 18951,
  "origin_website": "Jove",
  "title": "Assessment of Cardiac Function and Myocardial Morphology Using Small Animal Look-locker Inversion Recovery (SALLI) MRI in Rats",
  "procedures": [
    "1. Preparation\n1.1. Anesthesia of the rats\nPlace the rat into a chamber prefilled with isoflurane (depending on the size of the chamber about 3 minutes of 5%) to anesthetize the rat.\nOnce anesthetized, remove the rat and weigh it.\nPlace the nose of the rat into the anesthesia mask (isoflurane 2-3% in oxygen 1 L/min) to maintain anesthesia. During anesthesia with isoflurane, the heart rates of rats decrease to 300-340 bpm (380-420 bpm in mice).\n1.2. Insert a tail vein cannula\nWash the tail of the rat with warm water (38 °C) and soap to allow the blood vessels to be more easily seen.\nCannulate either vein, which can be easily seen on the lateral aspect of the tail. Using a 22-24 G i.v. catheter, begin attempts approximately 1/3 of the way from the tip.\nIf the initial efforts are unsuccessful, retry more proximally.\nTake blood sample for analysis of hematocrit (necessary to calculate extracellular volume fraction= ECV).\nSecure the i.v. catheter with skin glue and tape.\n1.3. Positioning of the electrodes\nClean all footpads with alcohol saturated swab or with soap and water.\nFour electrodes are needed, one for each foot.\nAttach the electrodes to the middle of the footpad and secure them with adhesive tape.\nTwist or plait the ECG cables around each other to minimize the formation of loops that would cause interference with the ECG signal.\n2. Scanning\n2.1. Positioning of the animal and monitoring\nPlace the rat in a supine or prone position onto the imaging tube and position the heart in the center of the coil.\nArrange the rat so that its nose rests in the cone which delivers isoflurane anesthesia (2-3% in oxygen 1 L/min). The rat is allowed to breath freely throughout the entire imaging procedure.",
    "Place the sensor of the thermometer at the anal orifice and fix it on the table with tape.\nBody temperature is maintained at 38±1 °C by a warm water heating system. The warming mat is placed under the lower aspect of the animal which extends outside the coil. Please see the schematic representation of the MRI experimental setup (Figure 2) for more details.\nConnect the ECG electrodes, once the ECG signal is stable begin imaging.\n2.2. Scan protocol/ Imaging parameters\nIn this study a Philips Ingenia 3.0T clinical MRI system with a solenoid coil with 70 mm inner diameter was used [MR system requirements are a small bore (e.g. 16 cm) or large bore (human size, e.g. 65 cm) with dedicated small animal coil, ECG gating capabilities for heart rates up to 500/min, oxygen supply and a removal system for anesthetic gases].\nStart with a survey to locate the heart in the center of the MRI field of view.\nOnce the position is correct, continue with two-chamber and four-chamber cine MRI views to determine the geometry of the stack of short axis images.\nFor SALLI, position mid-cavity short axis slice on the two- and four-chamber images (PreSALLI). A combination of 4,000 msec acquisition duration and 4,000 msec relaxation duration allows for sufficient recovery of magnetization along the z-axis and prevents overheating of gradients. To enable functional analysis, phases should be set to at least 12, with temporal undersampling of factor 2 to accelerate acquisition.\nInject the gadolinium-based contrast agent into the indwelling catheter, without moving the rat. Wait five minutes.",
    "Start planning SALLI as multislice short axis stack, consisting of at least 7 slices (slice thickness 2.4 mm). Position the slices so that the most distal is below the apex of the heart and the top level is just distal to the cardiac valves. Try to ensure that the short axes are perpendicular to the septum. Almost every 30 minutes (around three SALLIs) inject another dose of contrast agent.\nWhen image acquisition is finished remove the rat from the scanner and allow it to recover from anesthesia.\n3. Image Reconstruction\nImage reconstruction may be performed either online using predefined reconstruction parameters, or offline using a dedicated image reconstruction tool:\n3.1. Online Reconstruction\nVarious Parameters can be defined including:\nFor T1 mapping: location and width of the reconstruction window within the cardiac cycle (e.g. from 50 to 100 msec to achieve systolic T1 map at heart rate 300/min)\nFor IR-prepared (LGE) images: location and width of the inversion time (TI) window and number of images to be reconstructed within that window (e.g. TI 100-300 msec, 5 images, to generate 5 LGE images with TIs 100-150-200-250-300 msec).\n3.2. Offline Reconstruction\nWhen using a dedicated software package (Gyrotools, Zürich, Switzerland) for image reconstruction, extract the three sets of data (cine MR, inversion recovery and T1 maps) in a more interactive way.\nAdjust the definition of end-systole or end-diastole for the T1 by selecting the corresponding cine image.\nVisualize T1 maps as color maps. Find exact values by passing the mouse over an area of interest. Images can be stored in various image formats for further analysis (e.g. calculation of ECV from pre- and post-contrast T1 values of myocardium and blood pool) 12.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}