{
  "id": 15286,
  "origin_website": "Jove",
  "title": "Robust DNA Isolation and High-throughput Sequencing Library Construction for Herbarium Specimens",
  "procedures": [
    "1. Prior to Start\nMake fresh cetyl trimethylammonium bromide (CTAB) buffer17 by adding 20 g of CTAB, 10 g of polyvinylpyrrolidone (PVP) 40, 100.0 mL 1 M Tris pH 8.0, 40 mL of 0.5 M ethylenediaminetetraacetic acid (EDTA) pH 8.0, 280.0 mL of 5 M NaCl, and 400.0 mL of reagent water together, and bring the total volume to 1 L using reagent-grade water. Adjust the pH to 8.0.\n\tNOTE: Additional reagents can be added to CTAB depending on secondary compounds in individual taxa. See Allen et al.18 for a thorough list of additive reagents.\nAdd 10 µL of β-mercaptoethanol per 5 mL of CTAB buffer.\n\tNOTE: this can be prepared in batches of 50 mL and stored at room temperature for 3–4 weeks.\n\t\nHeat the CTAB solution in a 65 °C water bath.\nChill mortars and pestles in -20 °C for at least 20 min.\nLabel 4 sets of 2 x n 2-mL tubes (where n = the number of samples). Put 1 set of the labeled tubes on ice.\nChill isopropanol on ice or in a -20 °C freezer.\nRemove solid phase reversible immobilization (SPRI) beads (see Table of Materials) from the fridge, and allow them to equilibrate to room temperature (at least 30 min).\nPrepare 80% ethanol.\nSelect herbarium specimens for extraction and retrieve ~1 cm2, or 10 mg, of tissue per specimen, preferably leaf material.\n2. DNA Extraction\nGrind ~1 cm2 of preselected herbarium tissue using prechilled mortars and pestles. Add liquid nitrogen and 30–50 mg sterilized sand. Grind until tissue turns into fine powder.",
    "NOTE: 10 mg or more tissue is desirable, but less has also worked in some cases. Once the liquid nitrogen evaporates, add more as needed until tissue is fully ground. Another common method for disrupting cells and tissues is the use of a bead beater. However, this method was found to not work well for the specimens used in these experiments.\nTransfer the frozen powder into two 2 mL tubes (add no more than half of the tube's volume). Add 600 µL of warm CTAB solution to each tube and mix the tubes thoroughly by inversion and vortexing.\n\tNOTE: Since the quantity and quality of herbarium material is often low, performing DNA isolation in two repetitions helps to obtain higher yields.\nIncubate the samples in a 65 °C water bath for 1–1.5 h, vortexing every 15 min.\nCentrifuge samples at 10,000 x g for 5 min. Transfer the supernatant to a fresh set of labeled tubes (~500 µL). Discard the pellet using a standard non-chlorinated disposal procedure.\nAdd 4 µL of RNase-A (10 mg/mL) to each tube and mix by inverting or pipetting. Incubate the samples at 37 °C in a heat block or water bath for 15 min.\nAdd an equal volume (~500 µL) of a 25:24:1 phenol:chloroform:isoamyl alcohol mixture once the tubes have reached room temperature. Mix thoroughly by pipetting up and down and/or with inversion. Centrifuge the tubes at 12,000 x g for 15 min. Transfer the aqueous layer (upper layer) to a fresh set of labeled tubes (~400 µL). Discard the organic layer into a chlorinated waste container.\n\tNOTE: Step 2.6 may be repeated if large quantities of secondary compounds are expected in plant material.",
    "Add an equal volume (~400 µL) of a 24:1 chloroform:isoamyl alcohol mixture. Mix thoroughly by pipetting up and down and/or with inversion. Centrifuge the tubes at 12,000 x g for 15 min. Transfer the aqueous layer (upper layer) to a fresh set of prechilled, labeled tubes (~300 µL). Discard the organic layer into a chlorinated waste container.\nAdd an equal volume (~300 µL) of prechilled isopropanol and 12 µL of 2.5 M sodium acetate to each tube. Incubate samples at -20 °C for 30–60 min.\n\tNOTE: The incubation times can be extended (up to overnight incubation), but DNA quality will decrease the longer the samples incubate.\nTake the samples out of the freezer and centrifuge the tubes at 12,000 x g for 15 min. Remove and discard the supernatant gently without disturbing the pellet. Wash the pellet by suspension with fresh 70% ethanol (approximately 300–500 µL). For each doubled sample, consolidate the two individual pellets into one with accompanying ethanol.\n\tNOTE: Samples should be consolidated into one tube using ethanol first and then proceed. It is not necessary to wash each sample with ethanol separately.\nCentrifuge the tubes at 12,000 x g for 10 min. Remove and discard the supernatant gently without disturbing the pellet. Air dry the pellets.\n\tNOTE: Samples can be dried faster using a dry heat block (do not exceed 65 °C). Make sure that the samples do not over-dry, as this can decrease the final yield of DNA.\nSuspend the isolated DNA in 50 µL of 1x TE. Store in the -20 °C freezer for long term storage or 4 °C for use in the following week.\n3. Quality Control (QC)\nRun an agarose gel for quality check.",
    "Prepare a 1x Tris/Borate/EDTA (TBE) buffer by adding 54 g Tris base, 27.5 g boric acid, and 3.75 g EDTA disodium salt, bringing the total volume to 5 L using reagent grade water.\nPrepare a 1% agarose gel by adding 1 g agarose to 100 mL of 1x TBE. Microwave the solution until no agarose is visible. Add 0.01% nucleic acid gel stain (see Table of Materials). Let the flask cool until it is warm to the touch. Mix well by stirring. Pour agarose in a gel tray and let it sit until it solidifies.\nMix 3 µL of sample, 2 µL of reagent grade water, and 1 µL of 6x loading dye. Load the samples in the gel matrix, noting their order.\nRun the samples for 60–70 min at 60–70 V. Image the gel under UV light with correct exposure and focus.\n\t\tNOTE: Presence of a clear high molecular weight band is a sign of high quality DNA, while smears usually indicate DNA degradation. Most herbarium specimens are degraded.\nRun a dsDNA quantification analysis (see Table of Materials) to determine the quantity of double stranded DNA.\nUse 2 µL of sample for analysis.\n\t\tNOTE: Dilutions are not needed for the quantification analysis of herbarium material as they tend to be in minimal amounts. Successful libraries have been made from as little as 1.26 ng total dsDNA from this step.\n4. DNA Shearing\nNOTE: This is an optimized version of a commercial double-stranded fragmentase protocol (see Table of Materials).\nPlace dsDNA fragmentation enzyme on ice after vortexing for 3 s.",
    "In a sterile 0.2 mL polymerase chain reaction (PCR) tube, mix 1–16 µL isolated DNA with 2 µL of accompanying fragmentation reaction buffer. Bring the total volume to 18 µL by adding nuclease free water. Add 2 µL of dsDNA fragmentation enzyme and vortex the mixture for 3 s.\n\tNOTE: The amount of DNA needed varies depending on DNA concentration (aim for 200 ng total in the tube).\nIncubate the samples at 37 °C for 8.5 min. Then add 5 µL of 0.5 M EDTA to the tubes.\n\tNOTE: This step needs to be performed as soon as the incubation period is over to terminate the reaction and prevent DNA samples from over-shearing.\n5. Bead Clean-up\nHomogenize the SPRI beads by vortexing.\nBring the total volume of the sheared DNA to 50 µL by adding 25 µL of nuclease free water. Add 45 µL of room temperature SPRI beads (90% volume) to 50 µL of sheared DNA and mix thoroughly by pipetting up and down.\n\tNOTE: Adding beads at 90% of total sample volume is done to remove the smallest of DNA fragments, often below 200 base pairs.\nLet the samples incubate for 5 min. Put the tubes on a magnetic plate and let them sit for 5 min. Carefully remove and discard the supernatant.\n\tNOTE: Be careful not to disturb the beads, as they contain the desired DNA targets.\nAdd 200 µL of fresh 80% ethanol to the tubes while on the magnetic stand. Incubate at room temperature for 30 s and then carefully remove and discard the supernatant. Repeat this step once. Air dry the beads for 5 min while the tube is on the magnetic stand with its lid open.\n\tNOTE: Avoid over-drying the beads. This can result in lower recovery of DNA.",
    "Remove the tubes from the magnet. Elute the DNA from the beads into 55 µL of 0.1x TE and mix thoroughly by pipetting up and down. Incubate at room temperature for 5 min. Place tubes on the magnetic stand and wait for the solution to turn clear (~2 min).\nPull off 52 µL of the supernatant. Run a DNA quantification analysis on the samples to check the recovery and the initial concentration that goes into library prep.\n\tNOTE: Libraries have been made with total dsDNA estimated to be less than 1.25 ng, though in each case reamplification was required.\n6. Library Preparation\nNOTE: This is a modified version of a commercially available library kit (see Table of Materials protocol).\nEnd Prep\nAdd 3 µL of endonuclease and phosphate tailing enzymes, and 7 µL of accompanying reaction buffer to 50 µL of cleaned, sheared DNA. Mix thoroughly by pipetting up and down. Spin the tubes to remove bubbles.\n\t\tNOTE: The total volume should be 60 µL.\nPlace the samples in a thermocycler with the following program: 30 min at 20 °C, 30 min at 65 °C, then hold at 4 °C.\n\t\tNOTE: Heated lid was set to ≥75 °C\nAdaptor Ligation\nDilute the adaptor 25–50 fold (working adaptor concentration of 0.6–0.3 µM). Add 30 µL of ligation master mix, 1 µL of ligation enhancer, and 2.5 µL of adaptor for high-throughput short read sequencing to the tubes.\n\t\tNOTE: The total volume should be 93.5 µL.\nMix thoroughly by pipetting up and down. Spin the tubes to remove bubbles. Incubate the tubes at 20 °C for 15 min.",
    "Add 3 µL of commercial mixture of uracil DNA glycosylase (UDG) and the DNA glycosylase-lyase Endonuclease VIII (see Table of Materials) to the tubes. Ensure that the total volume is 96.5 µL. Mix thoroughly and incubate at 37 °C for 15 min using a thermocycler.\n\t\tNOTE: The lid should be set to ≥47 °C. The original version of the commercial protocol has size selection after the adaptor ligation step, followed by a bead cleanup as the final step. This protocol, which achieves higher yields, switches the order of these steps and implements size selection as a final step.\nCleanup to Remove Enzymes and Small Fragments\nHomogenize magnetic beads by vortexing.\nAdd 78 µL of SPRI magnetic beads (80% volume) and mix thoroughly by pipetting up and down.\n\t\tNOTE: Adding beads at 80% of total sample volume is done to remove the smallest DNA fragments, which are often shorter than 250 base pairs. The more stringent removal of small DNA fragments is to (i) remove surplus adaptors and (ii) emphasize amplification of larger fragments in the following steps.\nLet the samples incubate for 5 min. Put the tubes on a magnetic plate for 5 min. Carefully remove and discard the supernatant that contains the DNA outside the desired size range.\n\t\tNOTE: Be careful not to disturb the beads that contain the desired DNA targets.\nAdd 200 µL of fresh 80% ethanol to the tubes while on the magnetic stand. Incubate at room temperature for 30 s and then carefully remove and discard the supernatant. Repeat this step once. Air dry the beads for 5 min while the tube is on the magnetic stand with lid open.\n\t\tNOTE: Avoid over drying the beads. This can result in lower recovery of DNA.",
    "Remove the tubes from the magnet. Elute the DNA target from the beads by adding 17 µL of 0.1x TE and mix thoroughly by pipetting up and down.\nIncubate at room temperature for 5 min. Place tubes on the magnetic stand and wait for the solution to turn clear (~2 min).\nPull off 15 µL of the supernatant.\nPCR amplification\nAdd 25 µL of high fidelity PCR master mix, 5 µL of high-throughput short read sequencing library prep 5' primer, and 5 µL of high-throughput short read sequencing library prep 3' primer, to 15 µL of the cleaned adaptor-ligated DNA.\n\t\tNOTE: Total volume should be 50 µL.\nMix well by vortexing. Place the samples into a thermocycler using the settings found in Table 1: Thermocycler amplification setting.\n\t\tNOTE: A large number of cycles is needed due to the low quantity of input DNA.\ntable:\n﻿0,1,2,3\nCycle Step,Temp.,Time,Cycles\nInitial Denaturation,98 °C,30 s,1\nDenaturation,98 °C,10 s,12\nAnnealing/Extension,65 °C,75 s,12\nFinal Extension,65 °C,5 min,1\nHold,4 °C,,\nTable 1: PCR protocol denaturation, annealing, and extension times and temperatures. Temperature and times were optimized for the reagents presented in this protocol. If reagents are altered, temperatures and times should be optimized again.\nSize Selection for Desired Library Size\n\tNOTE: This bead step will remove fragments both above and below the target range.\n\t\nHomogenize SPRI beads by vortexing.\nAdd 25 µL (50% volume) of room temperature magnetic beads and mix thoroughly by pipetting up and down. Let the samples incubate for 5 min. Put the tubes on a magnetic plate and let them sit for 5 min. Carefully remove and transfer the supernatant to a new set of labeled tubes.",
    "NOTE: This volume can be adjusted based on desired library size. The supernatant contains DNA fragments of the desired size. In the first bead incubation, the beads are binding larger library fragments. These are removed to focus on those in the 400–600 base pair range. The supernatant contains smaller fragments.\nAdd 6 µL of room temperature SPRI beads to the supernatant and mix thoroughly by pipetting up and down. Let the samples incubate for 5 min. Put the tubes on a magnetic plate and let them sit for 5 min.\n\t\tNOTE: This volume can be adjusted based on desired library size in accordance with step 6.5.2.\nCarefully remove and discard the supernatant.\n\t\tNOTE: Be careful not to disturb the beads that contain the desired DNA. In the second bead incubation, the beads are binding to the fragments left after the initial removal of the largest DNA fragments. This set of fragments is usually in the desired size range.\nAdd 200 µL of fresh 80% ethanol to the tubes while on the magnetic stand. Incubate at room temperature for 30 s, then carefully remove and discard the supernatant. Repeat. Air dry the beads for 5 min while the tube is on the magnetic stand with lid open.\n\t\tNOTE: Avoid over-drying the beads. This can result in lower recovery of DNA.\nRemove the tubes from the magnet. Elute the DNA target from the beads into 33 µL of 0.1x TE and mix thoroughly by pipetting up and down.\nIncubate at room temperature for 5 min. Place tubes on the magnetic stand and wait for the solution to turn clear (~2 min). Pull off 30 µL of the supernatant and transfer to 2 mL tubes (see Table of Materials) for storage.\n\t\tNOTE: The libraries can be kept at -20 ˚C for long-term storage.",
    "Quality control\nRun a quality control test on the DNA Libraries. Refer to steps 3.1 and 3.2.\n\t\tNOTE: For DNA libraries, run the gel for ~45 min at 96 V.\nLibrary reamplification: Optional if library quantity is not sufficient.\n\tNOTE: Samples with library concentrations below 10 nM can be reamplified using the following steps. Reamplification of low concentration libraries can achieve workable results for sequencing, but reamplification may cause a modest shift in base composition diversity, though gathered data (Table 3) suggest that this is negligible for certain metrics.\n\t\nDilute the universal reamplification primers 10-fold using 0.1x TE.\nAdd 25 µL of high fidelity PCR master mix, 5 µL of diluted universal reamplification primer 1 (AATGATACGGCGACCACCGA), and 5 µL of diluted universal reamplification primer 2 (CAAGCAGAAGACGGCATACGA) to 15 µL of low concentration libraries. NOTE: Total volume should be at 50 µL.\nMix well by vortexing. Place the samples into a thermocycler using the settings found in Table 1: Thermocycler amplification setting\n\t\tNOTE: The large number of cycles is needed due to low quantity of input DNA.\nBead clean-up\nHomogenize SPRI beads by vortexing. Add 45 µL of room temperature SPRI beads (90% volume) and mix thoroughly by pipetting up and down.\nLet the samples incubate for 5 min. Put the tubes on a magnetic plate for 5 min.\nCarefully remove and discard the supernatant that contains the unwanted DNA.\n\t\tNOTE: Be careful not to disturb the beads that contain the desired DNA targets.\nAdd 200 µL of fresh 80% ethanol to the tubes while on the magnetic stand. Incubate at room temperature for 30 s, and then carefully remove and discard the supernatant. Repeat this step once.\nAir dry the beads for 5 min while the tube is on the magnetic stand with its lid open.",
    "NOTE: Avoid over-drying the beads. This can result in lower recovery of the DNA target.\nRemove the tubes from the magnet. Elute the DNA target from the beads into 33 µL of 0.1x TE and mix thoroughly by pipetting up and down.\nIncubate at room temperature for 5 min. Place tubes on the magnetic stand and wait for the solution to turn clear (~2 min).\nPull off 30 µL of the supernatant. The libraries can be stored at -20 °C for long-term storage.\nQuality control\nRun a quality control test on the DNA Libraries. Refer to steps 3.1 and 3.2. For DNA libraries, run the gel for ~45 min at 96 V.\n\t\tNOTE: If a double band is seen in the gel, this is likely a consequence of primer exhaustion from the reamplification step. The bands can be removed by repeating 6.9, but using only one cycle in the PCR program depicted in Table 1.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}