{
  "id": 4257,
  "origin_website": "Bio",
  "title": "Autophagy Assays (LC3B immunofluorescence, LC3B western blot, acridine orange assay)",
  "procedures": [
    "LC3B immunofluorescence   Place one round coverslip per well in 24-well plate and add around 0.5 ml 70% ethanol for 1 min to sterilize the coverslip. Aspirate ethanol and let it dry for 5-10 min. Tissue cultured cells were plated on 24-well plate one day before experiment to let them attach to coverslips. [For cells to be plated on the coverslips, it depends on the time of drug treatment for your experiment so that the final cell confluency will be optimal for observation (80-90%)].   On the day of experiment, treated with different concentrations of small molecule compounds for desired time.    Fix the cell by replace with 0.5 ml cold 100% methanol (prestored in -20 °C) and fix for 5 min. Since the cold methonal is prestored in -20 °C and the fixation time is short, this step can be performed at RT on the bench. Cells can also be fixed in PBS + 4% formaldehyde at room temperature for 20-30 min followed by permeabilization with TBS-Tx for 20 min.    Wash coverslips with 0.5 ml PBS once and replace with 0.5 ml AbDil-Tx to block. The block step can range from room temperature 30 min to 4 °C overnight. For example, people can use RT 30 min, 1 h, 2 h or 4 °C 2 h to overnight.   Prepare primary antibody. LC3B antibody from cell signaling can be diluted at 1/200-1/500 in AbDil-Tx. Usually one coverslip need 30-100 μl.   Transfer coverslips to the humid chamber. It can be made from a 15 cm round tissue culture plate. Cut a piece of square or rectangle parafilm that can fit the bottom of the plate. Use finger and tweezer to press down to make the parafilm adhere tightly to the bottom of the plate.",
    "The coverslips can then sit on the parafilm with liquid on top. Use a sheet of foil that can cover the lid of the plate to protect the coverslips from light. Incubating coverslips in this humid chamber will protect the coverslips from light in all steps. Use wet kimwipes to keep the humid chamber humid to prevent antibody evaporation.   Add diluted LC3B antibody onto the coverslips. Incubate at room temperature for 1-4 h or at 4 °C overnight. If incubate overnight, make sure to add at least 50 μl to each coverslip and wet the kimwipes in the humid chamber in case of antibody evaporation.   While incubating, prepare secondary antibodies by diluting fluorescently labeled anti-rabbit secondary antibody into AdDil-Tx.    After incubation, wash LC3B antibody away by holding a transfer pipette filled with TBS-Tx in one hand and a pipe that is attached to a liquid bottle and a vacuum pump to remove washing solution. Let TBS-Tx flow through the coverslips to wash the antibody away. Each coverslip needs to be washed 3 times with around 2 ml of TBS-Tx each time.    Add diluted secondary antibody onto coverslips and incubate at room temperature for around 1-2 h. After incubation, wash the coverslips in the same way as above.   Take the mounting medium, ProLong® Gold Antifade Reagent with DAPI out of freezer around 10 minutes before the end of incubation to let it warm up to room temperature. Squeeze out a small drop (around 2-3 μl) of mounting medium onto the slide.   Suck off the liquid on the coverslips as complete as possible and mound the coverslips onto the slide, on the top of ProLong® Gold Antifade Reagent with DAPI mounting medium. Remember to keep the cell side down and keep them with direct contact with mounting medium.",
    "The ProLong® Gold Antifade Reagent with DAPI mounting medium usually needs overnight to solidify and this step needs to be done at room temperature. Leave slides in a drawer or other space protected from light overnight to let it dry.   When the slides are ready, take it to a fluorescent microscope to observe and take pictures (Figure 1).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20131218/20131218023448_4873.jpg Figure 1. LC3B immunofluorescence shows that Torin2 induces autophagy in cells. Hela cells were treated with indicated concentrations of Torin2 for 3 days stained with antibody specific for LC3B and DAPI.      LC3B western blot   Tissue-culture cells are plated on 12-well plate (or 6-well plate) one day before experiment to let the cells attach to coverslips.   On the day of experiment, 10 μg/ml of E64d/pepstatin A were added to cells one hour before to increase autophagy turnover. Different concentrations of small molecule compounds were then added to cells.   After desired time of incubation, wash cells once with PBS. Then lyse cells in lysis buffer by directly overlay 100-200 μl lysis buffer (M-PER with protease inhibitor and phosphatase inhibitor) on the cells and incubate on ice (or 4 °C) for 10-20 min.    At the end of incubation, collect cell lysate in a 1.5 ml tube and spin 1 minute at max speed and 4 °C to remove cell debris.    Transfer the supernatant to a fresh tube, normalize, and add sample buffer. For drugs treated for a couple of hours, it’s usually not needed to normalize them since they normally don’t affect the cell numbers. However, for longer treatment (longer than a few hours), people should normalize the protein concentration across samples. Boil and load on a SDS-PAGE. Either a 15% SDS-PAGE or a 4-15% Mini-PROTEAN TGX Precast Gel id good for separating LC3B bands.",
    "Transfer gel into a PVDF membrane as the standard western blot protocol.   Block the PVDF membrane in TBS-Tween (“TBS-T”) with 5% Non-fat dry milk for 1 h at room temperature on a shaker.   Wash with TBS-T for 5 min, 3 times. Prepare LC3B antibody by diluting it at 1/1,000 into AbDil-Tw.   Incubate membrane in diluted LC3B at room temperature for 2-3 h or at 4 °C overnight.   Wash with TBS-T for 5 min, 3 times. Prepare HRP-conjugated secondary antibody by diluting it at 1/1,000 into AbDil-Tw.   Incubate membrane in diluted secondary antibody at room temperature for 1 hour.   Wash with TBS-T for 5 minutes, 3 times.    Gently use paper towel to dry the membrane and place it face up and flat on a sheet of plastic wrap.   Use prepared ECL to detect protein. Drain ECL and gently use paper towel and kimwipes to dry the membrane.   Wrap up the membrane with plastic wrap.   Either expose it to an X-ray film or use an imaging machine (Figure 2).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20131218/20131218023601_3394.jpg Figure 2. Western blot of LC3 shows that Torin2 induces apoptosis and autophagy in cells. Indicated cell lines were treated with increasing concentrations of AZD8055 or Torin2 for 3 days before the cells and analyzed by Western blot analysis using anti-LC3B and anti-tubulin antibodies.       Acridine orange assay   Tissue cultured cells were plated on coverslips in 24-well plate one day before as introduced in LC3B immunofluorescence.   One the day of experiment, cells are treated with different concentrations of small molecule compounds for desired amount of time before 1 μg/ml acridine orange was added for 15 min.    Cells were washed once with PBS, fixed in PBS + 4% formaldehyde, washed with TBS-Tx before they are mounted in Prolong Gold with DAPI, which is the same as step A11 and A12.",
    "Pictures were taken by a fluorescent microscope (Figure 3, left panel).    Total fluorescence of acridine orange in each frame was quantified using MetaMorph and divided by the total number of cells within the frame. Numbers are then normalized to DMSO-treated cells to show the acridine orange fold changes (Figure 3, right panel).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20131218/20131218023640_4643.jpg Figure 3. Acridine orange assay shows that Torin2 induces autophagy in cells. Hela cells were treated with different concent rations of Torin2 for 3 days and then stained for acridine orange and DAPI."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}