{
  "id": 17716,
  "origin_website": "Jove",
  "title": "Longitudinal In Vivo Imaging and Quantification of Human Pancreatic Islet Grafting and Contributing Host Cells in the Anterior Eye Chamber",
  "procedures": [
    "The Regional Ethics Committee in Lund, Sweden, approved the study according to the Act Concerning the Ethical Review of Research Involving Humans. Animal experiments were performed in strict accordance with the Swedish ethics of animal experiments and approved by the ethics committees of Malmö and Lund. 6 to 8-week-old immunodeficient NOD.(Cg)-Gt(ROSA)26Sortm4-Rag2-/- (NOD.ROSA-tomato.Rag2-/-) recipient mice were used as recipients for transplantation of human islets10.\n1. Islet preparation for transplantation\nCulture human islets in CMRL 1066 supplemented with 10 mM HEPES, 2 mM L-glutamine, 50 μg/mL gentamycin, 0.25 μg/mL fungizone, 20 μg/mL ciproxfloxacin, 10 mM nicotinamide (NIC), and 10% heat-inactivated human serum at 37 °C in 5% CO2 and humidified air until transplantation, as described previously12.\n\tNOTE: Islets should be free of exocrine tissue and not touch each other in culture. Exocrine tissues appear translucent.\nOn the day of transplantation, transfer culture media containing the islets to a new Petri dish using an aspirator tube assembly connected to a pulled glass capillary.\n\tNOTE: Alternatively, use a 200 µL pipette. Coloring the back of the Petri dish helps make the islets more easily distinguishable under the stereo microscope.\nUsing a stereo microscope, pick ~20–40 islets per transplantation and transfer to a 1.5 mL tube. Fill the tube to the top with culture media from the incubator.\nSeal the tubes with paraffin film and store on ice until transplantation. Prepare an appropriate amount for the number of transplantations performed.\nAlternatively, ensure a CO2 incubator is available in the surgery room to keep islets in culture and pick them immediately prior to each transplantation.\n2. Preparation of transplantation equipment and surgery table\nNOTE: All surgical tools should be autoclaved, and the surgery table and instruments disinfected with 70% alcohol.",
    "Connect a stereotaxic head holder to anesthesia via a nose mask and turn on the heating pad.\nConnect a gastight Hamilton syringe to polyethylene tubing and a blunt end eye cannula.\n\tNOTE: It is recommended to fill all parts with PBS before assembly. Check for trapped air bubbles and remove if present.\nAttach the Hamilton syringe tightly to the table (Figure 1a) or a movable base (Figure 1e) and attach the tubing to the stereo microscope, with cannula hanging down (i.e., waiting position).\n\tNOTE: Use surgical tape, because it is easy to remove and reattach.\nPrepare a 1 mL syringe connected to a 30 G needle filled with 0.1 mg/kg buprenorphine solution.\nPrepare a syringe with sterile PBS. Alternatively, use a pipette.\nSet aside a clean wake-up cage with heating lamp.\n3. Anesthesia and positioning of recipient mice for surgery\nNOTE: All animals were bred and maintained in a pathogen-free environment at the animal facilities at Lund University.\nAnesthetize the mouse in a chamber filled with 40% O2/60% N2/3% isoflurane and transfer the anesthetized mouse to the head holder platform on a warm heating pad (Figure 1a). Check for the lack of pedal reflexes.\n\tNOTE: Isoflurane anesthesia is the preferred method of anesthesia for fast recovery after surgery. The microscope room must be properly ventilated to use isoflurane.\nPlace the snout of the mouse into the anesthesia mask connected to 40% O2/60% N2/0.9%–1.5% isoflurane anesthesia machine. Use the thumb and finger to lift the head up slightly and fasten it using the metallic pieces on the sides. Ensure that the earpieces fix the head directly below the ears. Inject 0.1 mg/kg buprenorphine solution subcutaneously on the back of the mouse.\n\tNOTE: Buprenorphine is used as an analgesic.",
    "Tilt the head so that the eye to be operated on is facing upwards and is close to the researcher.\nGently retract the eyelids of the eye to be transplanted using blunt forceps, pop the eye out, and loosely fix with a pair of tweezers. Ensure that the tips of the tweezers are covered with a polythene tube attached to the head holder platform (Figure 1a, insert).\nAlways keep both eyes wet by applying a droplet of sterile PBS onto the eye.\nTransfer the human islets from the sealed 1.5 mL tube (section 1) to a Petri dish with sterile PBS and make sure that the islets are close to each other to minimize the amount of cell culture media transferred (Figure 1c).\nPick up ~20–30 islets in the eye cannula connected via polythene tubing to the Hamilton syringe.\n\tNOTE: Take up as little liquid as possible with the islets.\nHang the tubing upside down and attach to the stereo microscope (Figure 1d). Tape the tubing carefully to let the islets sink to the end of the tube toward the cannula.\n4. Transplantation procedure\nNOTE: This method has been previously described for the transplantation of mouse islets6. A slightly modified procedure is presented here.\nPinch the pads on the hind legs to make sure that the mouse is asleep.\nTighten the forceps restraining the eye without disrupting the blood flow and apply a droplet of sterile PBS onto the eye.\nUsing a 25 G needle as a scalpel, bevel upwards, carefully penetrate only half of the tip in the cornea and make a single lateral incision. Make the hole in an upward angle; the hole will seal more easily after the transplant (Figure 1f).",
    "Carefully lift up the cornea with the cannula preloaded with islets and slowly apply islets in the eye. Avoid insertion of the cannula into the anterior chamber to prevent damage of the iris, but rather push carefully against the corneal opening (Figure 1g).  Slowly retract the cannula from the ACE.\n\tNOTE: Aim for an injection volume of 3–8 µL. If the volume is too large, it will expose the eye to unnecessarily high intraocular pressure and may result in reflux of the injected islets out of the anterior chamber.\nWhen facing difficulties with insertion of the islets due to increased pressure in the eye chamber, enlarge the incision site by reinforcing the lateral incision site and reapply islets.\n\tNOTE: Occasionally, introduced air bubbles can be used as space holders.\nApply eye gel to the eye, loosen the eye-restraining forceps and leave the mouse on isoflurane in the same position for 8–10 min to let the islets set.\nRemove the forceps holding the eyelid and put the eyelid back to its normal position.\nRemove the mouse from the head holder and transfer it to a wake up cage.\nWhen the mouse is awake and moving, transfer it back to the original cage and keep in the animal housing until scanning (at least 5 days are recommended).\n5. Imaging of implanted human islets by 2-photon microscopy\nNOTE: Taking overview images of the eye using a fluorescence stereoscopic microscope (Figure 2a–c) 4–5 days after transplantation prior to 2-photon imaging is recommended to localize the islets of interest. Avoid restraining the eye too tightly this early after transplantation. Use 2-photon imaging 6–7 days posttransplantation.",
    "Start the image acquisition software (see Table of Materials). In the “Laser” menu activate the Mai Tai laser (Power “ON”) and in the “Light Path” menu set the wavelength to 900 nm and apply a minimal transmission laser power starting with 5%–10% laser power (use sliders).\n\tNOTE: While scanning, adjust the laser power as needed.\nSet green, orange, and red channels. Collect emission light simultaneously onto three nondescanned detectors (NDD) using a dichronic mirror (LBF 760) and emission filter information as follows: Red/Angiosense 680, 690–730 nm; Green/Autofluorescence, 500–550 nm; and Orange/Tomato, 565–610nm (Figure 2d).\nPlace the head holder stage onto the motorized microscope stage and connect the gasmask to the tubing of the anesthesia machine and tubing connected to ventilation system. Turn on the heating pad.\nAnesthetize the recipient mouse, transfer to the head holder platform, restrain the eye for imaging, and administer buprenorphine solution as described above (steps 3.1–3.5).\nAdjust isoflurane vapors as needed. A breath rate of ~55–65 breaths per minute (bpm) indicates optimal anesthesia. If anesthesia is too deep, the rate will be <50 bpm with heavy breathing or gasping; if too light, the rate will be >70 bpm with superficial breathing. Carefully monitor mice during anesthesia by visual inspection every 15 min.\n\tNOTE: Anesthetization varies from mouse to mouse, between mouse strains, and as time under anesthesia progresses13.\nAdminister enough eye gel onto the eye as an immersion liquid between the cornea and the lens, allowing it to slowly accumulate (Figure 2f, insert). Avoid air bubbles.\n\tNOTE: Side illumination with a flexible metal hose lamp is recommended to adjust the focus and localize islet grafts.\nTo visualize blood vessels, administer 100 µL of the imaging agent (e.g., Angiosense 680) intravenously into the tail vein using a disposable insulin 30 G syringe.",
    "In “Acquisition mode” adjust the frame size to 512 x 512 and the scan speed.\n\tNOTE: Slower scans (i.e., increasing dwell time) will improve the signal-to-noise ratio.\nIn the “Channels” menu adjust Master Gain for each PMT in Volts to amplify the signal until an image is seen on screen in the Live scanning mode. The higher this value, the more sensitive the detector becomes to signal and noise.\n\tNOTE: Preferably, keep values between 500–800 V.\nIn the “Z-stack” menu define the beginning and the end of the z-stack by manually moving the focus to the top of the islet graft. Save position by selecting “Set First”. Move to the last bottom plane that can be focused in the islet graft and save position by selecting “Set Last”. Use a z-step size of 2 µm.\nCollect the final image stack by clicking the “Start Experiment” tab and save as 8-bit CZI (i.e., Carl Zeiss format) file.\n6. Imaging of implanted human islets by confocal microscopy\nNOTE: The total volume, morphology, and plasticity of transplanted islets can be assessed by monitoring the in vivo scattering signal in a separate scan (i.e., separate track) by detection of laser backscatter light10.\nTake out the main beam splitter (i.e., LBF Filter) and in the “Light Path” dialog set up a separate track for confocal imaging. Choose the Argon laser with wavelength of 633 nm and detection at the same wavelength as the laser light. Z-stacks are acquired with a step size of 2–3 µm for backscatter light signal.\nReadjust the z-stack settings to make sure to record the whole islet (see step 5.10).\nAcquire the image stack and save as 8 bit CZI file.\n7. Image analysis\nNOTE: Commercial software (see Table of Materials) was used for this step.\nRemoving islet autofluorescence (Figure 3b)",
    "In the “Image processing” tab choose “Channel arithmetic´s” and type “ch1-ch2”. This creates a new channel 4 (ch 4); rename as “Vasculature”.\n\t\tNOTE: The Green/Autofluorescence channel is subtracted from Red/Angiosense channel.\nRepeat the previous step and type “ch3-ch2” to create a new channel (ch 5); rename as “Tomato (all)”.\n\t\tNOTE: The Green/Autofluorescence channel is subtracted from the Orange/Tomato channel.\nDefining islet mask by manual drawing (Figure 3c)\n\t\nCreate a new surface (blue symbol) and in the wizard choose “Edit manually”. Keep the pointer in “Select” mode and in 3D view unclick “Volume” (under Scene) to visualize sections.\nFor easier islet border discrimination, activate all channels, including ch 1–ch 3.\n\t\tNOTE: The Orange/Tomato channel is useful to define islet borders by the Tomato capsule signal. Alternatively, increase channel intensities to use multichannel islet autofluorescence and detector background signal as guidance.\nIn the “Drawing” tab choose “Contour” and click “Draw” to start drawing contours around the islet border starting in slice position 1.\nMove to a new slice position and repeat drawing contours. Finish with the last slice on the top of the islet and end by clicking the “Create surface” tab. Usually it is enough to draw contours every 10th slice.\nSegmentation of “Islet vasculature” and “Islet tomato” fluorescence using islet mask (Figure 3d).\n\t\nChoose the previously defined “Islet mask” object, go to the editing tab (pencil symbol), and click the “Mask all” tab, which opens a new window.\nChoose the previously named channel “Vasculature” (ch 4) in the channel selection dropdown menu and activate options “Duplicate channel before applying mask”, “Constant inside/outside”, and set voxels outside surface to “0.000”, which creates a new channel; rename as “Islet vasculature” (ch 6).",
    "Repeat steps 7.3.1 and 7.3.2 and choose the previously created channel “Tomato (all)” (ch 5) in the channel selection drop down menu to create the new channel; rename as “Islet tomato” (ch 7).\nSurface rendering of islet vasculature (Figure 3e)\n\t\nCreate a new surface in the “Scene” menu and in the wizard choose “Automatic creation”.\nSet the source channel to previously created “Islet vasculature” (ch 6) and choose background subtraction. Automatic threshold estimation can be adjusted if needed. Compare to the responding fluorescence channel (e.g., by blending in/out the newly created surface tab). Proceed in the wizard.\nOptionally, use filters. For example, choose “Volume” and adjust the filter (yellow) in the window, which can remove selected surface objects. Finish the wizard and name the new surface object “Islet vasculature”.\nSegmentation of “Islet tomato vasculature” fluorescence signal (Figure 3f)\n\t\nIn the previously created “Islet vasculature” surface object, go to editing tab and click the “Mask all” tab, which opens a new window.\nChoose the previously named channel “Islet tomato” (ch 7) in the channel selection drop down menu and set voxels outside surface to “10.000”, which creates the new channel; rename as “Islet tomato vasculature” (ch 8).\nSegmentation of “Tomato capsule” fluorescence signal (Figure 3g)\n\t\nChoose “Channel Arithmetic’s” in the “Image processing” tab and type “ch7-ch8”, creating the new channel; rename as “Tomato capsule” (ch 9).\n\t\tNOTE: The “Islet tomato vasculature” fluorescence signal is subtracted from the total “Islet tomato” fluorescence signal.\nSurface rendering of “Islet tomato vasculature” and “Tomato capsule” (Figure 3h)\n\t\nFollow step 7.4, and in the wizard choose source channels “Islet tomato vasculature” (ch 8) or “Tomato capsule” (ch 9) to create new surface objects accordingly.\nSurface rendering of total islet surface (Figure 3i)\n\t\nOpen the islet backscatter file and create a new surface.",
    "In the wizard, choose “Automatic creation” and define “Region of interest”.\n\t\tNOTE: \"Region of interest\" is used to separate the signals of multiple islets and to define the depth of the islet to be analyzed (e.g., top 75 µm).\nIn “Absolute intensity” adjust threshold if needed. The surface object can be clicked on or off to cross-check with corresponding channel intensity. Close the wizard.\nQuantification (Figure 3j)\n\t\nSelect a created surface object in the “Scene” menu and go to the “Statistics” tab.\nTo retrieve detailed volume data in the selected surface object choose the “Detailed” tab and select “Specific values” and “Volume” from dropdown menu. To retrieve a total volume value of the selected surface object, go to the “Detailed” tab and choose “Average values”.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}