{
  "id": 2247,
  "origin_website": "Cell",
  "title": "Surgical and intravital microscopy protocol to image Trypanosoma brucei-host interactions in live rodent models",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIn this paper, we will describe how to visualize fluorescent parasites in organs of anesthetized mice. We will describe the detailed steps for 10 organs independently. Later on, we provide optional protocols for a) blocking receptors, b) quantifying the mean fluorescence intensity of labeled vasculature, c) fluorescently labeling and visualizing red blood cells, and d) restricting blood flow. Readers can refer to the point of relevance to own research questions.\nNote: The protocols hereby presented are aimed at providing details that enable other researchers to address their own research questions (e.g., any fluorescent line/dye/conjugated antibody should be tested according to the researchers’ own aims), and readers are encouraged to use this methodology as a basis to addressing their own questions rather than as an exhaustive list of all the research possibilities this methodology opens.\n(Optional step) Inject mice with antibodies against specific endothelial receptors you aim to block\nTiming: 5 min\nThis step is optional, and it aims to block endothelial receptors (e.g., ICAM1, VCAM1, PECAM1, CD36). It takes place prior to mouse infection with T. brucei to ensure that receptors are not available for binding during the early stages of infection.\nDetermine duration of blocking antibody lifetime in mice. This includes antibody affinity, and receptor turnover rate. This optimization step should be done for each receptor of interest according to the reader’s own research questions.\nCritical: Ensure you are achieving maximum blocking at the correct time windows. Depending on the time of infection of interest, this can involve a single or multiple injections.\nDilute blocking antibodies to concentration desired. Calculate volume needed per mouse.\nSecure mice in adequate restrainer to allow for intravenous injection, and inject antibodies.",
    "In our protocol, we intravenously injected all antibodies at 20–30 μg per mouse (body weight of 25 g), daily, over a course of 6 days.\nInfect mice with Trypanosoma brucei by intraperitoneal or intradermal injection\nTiming: 24–25 h\nThe aim of this step is to establish an infection in C57BL/6J mice with T. brucei (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1718-Fig2.jpg\nFigure 2. Principle of infection of C57BL/6J mice with 2000 Trypanosoma brucei parasites\n(A) Infection procedure: Begin by thawing a blood stabilate from liquid nitrogen or −80°C storage. Centrifuge the stabilate for 2 min at 800 g and remove all supernatant to remove glycerol. Resuspend in 10 mL of HMI-11 complete media and recover for 24 h at 37°C in 5% CO2. Count parasites using a suitable method (e.g., various automatic counting methods or manually using a Neubauer chamber), and dilute (or concentrate) to have 2000 parasites/200 μL volume. If various mice will be infected, calculate accordingly. Inject 200 μL intraperitoneally into C57BL/6J mice.\n(B and C) How should T. brucei look in morphology? (B) shows T. brucei immediately after thawing a stabilate from liquid nitrogen or −80°C storage (left image shows bright field image; right image shows TdTomato fluorescence). (C) shows T. brucei after 24 h of culture in HMI11 media (left image shows bright field image; right image shows TdTomato fluorescence). Scale bar: 5 μm.\nThaw a stabilate of T. brucei blood trypomastigotes and place in HMI-11 culture media for a minimum of 24 h. (For comparison of cells immediately after thawing and 24 h after thawing see Figures 2[href=https://www.wicell.org#fig2]B and 2C and Methods Videos S1[href=https://www.wicell.org#mmc1] and S2[href=https://www.wicell.org#mmc2]).",
    "Note: In our experience, quantification of live parasites can be over-estimated when using a stabilate, thus affecting the inoculum of live parasites, and readouts at least during the initial days of infection. We therefore recommend a recovery period for the parasites in culture.\nCentrifuge cells at 800 g for 1 min to remove glycerol from freezing solution.\nResuspend in 5–10 mL of HMI-11 media and place into a 75 mm2 flask at 37°C with 5% CO2.\n    Your browser does not support HTML5 video.\n  \n \nMethods video S1. Imaging T. brucei viability, related to step 5\nVideo shows T. brucei parasites from a glycerol stabilate immediately after thawing from storage at −80°C.\n    Your browser does not support HTML5 video.\n  \nMethods video S2. Imaging T. brucei viability, related to step 5\nVideo shows T. brucei parasites 24 h after thawing from storage at −80°C.\nAfter 24 h, observe T. brucei parasites under the microscope and assess their suitability for infection by checking their motility and general morphology.\nCritical: Recover desired number of parasites by diluting or concentrating parasites as necessary. In this protocol, we injected 2 × 103 parasites per mouse.\nResuspend parasites in HMI-11 volume required to have 2 × 103 parasites per 200 μL per mouse (i.e., 104 parasites/mL).\nLoad an insulin syringe (29G) with 200 μL of HMI-11 + T. brucei, and inject C57BL/6 mice by intraperitoneal or intradermal injection.\nNote: Depending on the time points desired for intravital microscopy (IVM) injection should be done at approximately the same time of day that each imaging session will take place. For instance if a time course of 20 days will be done, and each imaging session will begin at 2 pm, infection should be performed at 2 pm of day 0 (i.e., the day of infection).",
    "Anesthetize mice prior to surgical procedures and IVM\nTiming: 5–10 min\nPrepare ketamine/xylazine solution.\nAdd 0.8 mL of xylazine (20 mg/mL) to a sterile 15 mL Falcon tube.\nAdd 1.2 mL of ketamine (100 mg/mL) to the same tube.\nAdd 8 mL of pharmaceutical grade distilled water or sterile 0.9% NaCl to obtain 10 mL of anesthetic solution.\nNote: This solution can be stored for a month at 4°C for one week, and be used in multiple experiments.\nWeigh the mice before injection of anesthetic solution in order to administer a correct dose.\nAdminister 100 μL of anesthetic mixture per 10 g of body weight (i.e., 120 mg/kg ketamine + 16 mg/kg xylazine). Administration is via intraperitoneal injection.\nPlace the animal back in its cage until it is immobilized (confirm loss of upright reflex).\nNote: Before reaching its full effect, the mixture of ketamine/xylazine can cause confusion and agitation in some mice. This may cause a tendency to jump. Mice should always be placed in a cage to avoid any injuries. In addition, anesthetized mice should never be left in a cage with awake mice for prolonged periods as anesthesia leaves them vulnerable to attacks by cage mates.",
    "Note: In animals heavier than 30 g (usually older animals), as well as sick animals (regardless of weight) (i.e., beyond day 13 of infection with T. brucei at the dosage described in this protocol), this dosage of anesthetic needs to be adjusted. While additional volume (ie. with up to 50% additional dosage) might be needed to achieve full anesthetic effect, care should be taken to avoid overdosage. Additional drug administration can be done intraperitoneally. Alternatively, an inhalational anesthetic can be used (e.g., isoflurane). In animals that are overweight, anesthetics can have unpredictable effects due to the metabolism of the anesthetic – this is the focus of research in other areas. We therefore suggest care if working with animals above 30 g. In sick animals (overweight or not), the recommended dosage considering body weight only, can be lethal. We therefore suggest that in sick animals (overweight or not), care is taken, and a lower initial dose is used.\nCritical: Avoid stressing the animal while holding or manipulating it. Stress can alter the effects of the anesthetic and its duration. Additionally, the person responsible for experimentation must have proficiency in intraperitoneal injection to avoid causing any internal bleeding or damage that might compromise surgeries or IVM.\nCritical: Additional aliquots of anesthetic must be available in surgery and imaging sites, in order to ensure boosts of anesthesia when required, during the entire duration of the procedure. Usually, additional boosts are administered in hourly periods. Care should be taken to avoid overdosage. check pedal withdrawal reflex to monitor anesthetic depth.\nPrepare the microscope at least 1 h prior to starting surgeries for IVM\nTiming: 1 h\nTurn on microscope including all lasers to be used.",
    "Turn on incubation system to 27°C–30°C (if the microscope contains a temperature-controlled chamber). Otherwise, turn on heating mat to 27°C–30°C to ensure that the mouse does not suffer hypothermia once it is anesthetized and surgery has been performed.\nPrepare all settings in hardware (e.g., stage) and software (e.g., exposure time, acquisition rate, laser power, etc.) before starting surgeries to ensure that the equipment is ready to use immediately after the surgeries.\nCritical: Body temperature quickly drops in anesthetized mice. Heating should be ensured at all times during surgery. Moreover, hypothermia can affect the behavior of T. brucei both in exposed surfaces and inside a mouse.\nNote: If more than one mouse will be imaged in the same day, it is recommended to perform the anesthesia and surgeries on each mouse immediately prior to imaging, rather than as a batch.\nPerform surgeries for IVM\nTiming: Variable (see specific timing for each organ)\nNote: Care should be taken in each surgery, to avoid damaging the blood vasculature. Any damage to the vasculature may result in blood loss and reduced life span. In some cases, with a single surgical incision, more than one organ can be exposed (and imaged if desired). This is consistent with decreasing animal usage, while inducing little additional stress on any one animal.",
    "Critical: One or more organs can be exposed through a single incision. Regardless of the number of organs studied, great care should be taken during the imaging procedure, to ensure that the animal remains anesthetized the entire time. Constant monitoring of anesthetic effects should be done, and top-up/repeat doses provided at adequate intervals, or an inhalational anesthetic should be provided throughout the entire procedure. In long imaging procedures, great care should be taken to ensure that the organ remains hydrated, and that no physical alterations occur on the tissue (eg. bleeding, burning due to imaging, etc.).\nNote: Windows can be chronic or terminal. We have recently published detailed methods and uses of intravital microscopy and existing surgical methods in the context of parasitology, as a mini-series collection ((De Niz et al., 2019b[href=https://www.wicell.org#bib7]; 2019c[href=https://www.wicell.org#bib8]; 2019a[href=https://www.wicell.org#bib6], 2020[href=https://www.wicell.org#bib9]). In this work, we will focus on the description of terminal windows only. Terminal windows allow for visualization over several hours, but do not envisage recovery of the mouse after imaging. Terminal windows can be secured in place using sutures, vacuum, or surgical glue.\nBefore starting any of the surgeries described below, check for righting and pedal withdrawal reflexes.\nTo assess righting reflex, place the mouse in a dorsal position and determine its ability to return to the ventral position. Once the mouse is unable to return to the ventral position, proceed to check for the righting and pedal withdrawal reflex.\nPinch the metacarpal region of the hind foot either with the index and thumb, or with a blunt forceps (with care not to injure the mouse) (Methods Video S3[href=https://www.wicell.org#mmc3]). Check both hind feet and proceed to surgery ONLY when this reflex is absent in both feet.\nProtect the mouse’s eyes from drying using specialized gel (e.g., Puralube® or Lacrilube®) for this purpose.",
    "For all surgeries described below, clean the mouse hair and skin with 70% ethanol at the site where you wish to make a surgical incision.\nNote: Cleaning the site with ethanol will sterilize the region and will prevent hair from dispersing across the surgical site and the surgical material. If post-surgical recovery will take place, the hair must be removed to prevent any contamination.\nNote: Before starting to image, observe under microscope to remove any potential hair. Hair is heavily auto-fluorescent and can block important imaging sites at the site of surgical incision. Any remaining individual hairs can be carefully removed using forceps or a moist cotton swab.\n    Your browser does not support HTML5 video.\n  \nMethods video S3. Verifying hind leg reflex, related to step 15b\nVideo shows hind leg reflex during anesthesia. Surgery should only be performed once this reflex is absent.\nSurgeries to expose the various organs of interest are detailed below. The order followed for the lists is based on the anatomical location (starting from cranial (i.e., the head), and ending in the caudal region (i.e., the pelvis)), rather than by the order of complexity. For order of complexity, we suggest observing details described in Figure 3[href=https://www.wicell.org#fig3], and summarized main challenges in Table 1[href=https://www.wicell.org#tbl1].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1718-Fig3.jpg\nFigure 3. Order of surgeries and IVM. Schematic showing the order we suggest to follow if multiple surgeries will be performed in the same animal",
    "This is further explained in Table 1[href=https://www.wicell.org#tbl1]. Surgeries with low risk include the brain (unless a full craniotomy is performed) (1), the interscapular brown adipose tissue (isc-BAT) (2), the kidneys (3), the lymph node (4), and the gonadal white adipose tissue (5). Surgeries with medium risk include the spleen (6), pancreas (7) and liver (8). The surgeries with the highest risk include the heart (9) and the lungs (10). Created with BioRender.com[href=http://BioRender.com].\ntable:files/protocols_protocol_1718_2.csv\nProcedure for brain IVM\nTiming: 10–30 min\nPlace the mouse in the ventral recumbency.\nPreparation for surgical site (Figure 4[href=https://www.wicell.org#fig4] left panel). Perform a surgical incision on the mouse scalp to expose the region of interest in the skull and brain. For exposing the region of interest, the incision can extend throughout any region from the olfactory bulb to the posterior region of the head (Figure 4[href=https://www.wicell.org#fig4]). Various options exist to proceed.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1718-Fig4.jpg\nFigure 4. Surgeries for implanting terminal windows in the mouse brain",
    "Left panel: Preparation of surgical site. Begin by injecting anesthetic intraperitoneally. Diagram and picture show site of incision. Three options exist for surgical preparation: a) Option 1: No skull thinning. Coronal view shows untouched cranium and meninges. b) Option 2: Skull thinning using surgical drill. Coronal view shows thinned cranium with untouched meninges. c) Option 3: Surgical creation of cranial window. This involves the removal of the skull cap, and imaging directly on the brain. Coronal view shows full view into the brain. Middle panel: Place window for imaging. Several options exist for imaging. Option 1: no coverslip is placed, and imaging is done directly on the hydrated exposed tissue. Option 2: A round coverslip is placed using surgical glue. Option 3: A round coverslip attached to a vacuum ring is placed on top of the incision. Right panel: Place mouse on stage and image. The head of the mouse must be secured/immobilized using a stereotaxic instrument. This includes securing at 3 main points: the teeth, and both ears. A support for the chin can be used to help immobilization. Depending on the experimental conditions, dyes can be added intravenously either before or after securing the mouse on the stage. An upright microscope is best suited to image the brain. The objective reaches the brain from the top. Scale bar: 20 μm. Created with BioRender.com[href=http://BioRender.com].\nOption 1: Imaging can be performed through the skull, without any further surgical procedure (i.e., if a 2 PM is used).\nOption 2: Skull thinning can be performed using a spherical surgical drill, in order to access deeper layers of the brain. The drill is run at 30,000 rpm, until the thickness of the remaining skull is 10–20 μm. This can be measured by second harmonic generation.",
    "Option 3: A surgical incision to remove a piece of the skull can be performed using both a surgical drill and surgical instruments. This must be performed with great care in order to avoid brain damage in the form of swelling, oedema or vascular damage. This option requires the placement of a window to reduce brain swelling. This is only suitable for short term imaging (i.e., up to 2 h).\nPlace window for imaging (Figure 4[href=https://www.wicell.org#fig4] middle panel). Before placing a window or imaging, verify that no hair is present on the area of interest. Once this is verified, various options exist to proceed.\nOption 1: Depending on the type of surgery, a window may or may not be required. If not required (i.e., when the skull is intact or thinned), immersion oil can be used directly on the skull. Alternatively, the surgical site can be covered with a hydration solution or 1×PBS.\nOption 2: A coverslip can be placed on the site of interest by adding surgical glue around the contour of the incision (shown on image by dotted lines).\nOption 3: A coverslip can be secured on a holder attached to a vacuum pump, and placed on top of the surgical site of interest. This will serve both to keep the coverslip in place and keep a constant pressure on the brain to prevent quick oedema. Allow for lose adherence to the brain surface via 20–25 mmHg of reversible vacuum.\nPlace mouse on stage and image (Figure 4[href=https://www.wicell.org#fig4] right panel). Once the surgical incision is ready, place the mouse on the ventral recumbency. The mouse head must be immobilized for imaging. This can be achieved using a stereotaxic instrument that provides support to both ears and the front of the head e.g., via the teeth.",
    "Once the mouse is secure and ready for imaging, inject dyes or conjugated antibodies of interest.\nCritical: Care should be taken during the surgery to avoid injuring the blood and lymphatic vasculature.\nUse an upright microscope with at least a 63× objective, and position the objective at the site of the surgical incision.\nConfirm that no significant vascular damage, or blood flow alterations occurred, and acquire images as needed (see steps 98–103). See Methods Video S4[href=https://www.wicell.org#mmc4].\n    Your browser does not support HTML5 video.\n  \nMethods video S4. Outcome of brain IVM, related to step 24\nVideo shows the expected outcome of the injection of 70 kDa FITC-Dextran (green) in the brain in an uninfected mouse.\nProcedure for interscapular brown adipose tissue (isc-BAT) IVM\nTiming: 10–30 min\nPlace the mouse in the ventral recumbency.\nPreparation for surgical site (Figure 5[href=https://www.wicell.org#fig5] left panel). To visualize the isc-BAT, perform a surgical incision immediately below the neck and skull, and slightly above the shoulder blades. For exposing the region of interest, the incision can extend throughout any region from the base of the neck to the region between the shoulder blades (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1718-Fig5.jpg\nFigure 5. Surgeries for implanting terminal windows in the mouse interscapular brown adipose tissue (isc-BAT)",
    "Left panel: Preparation of surgical site. Begin by injecting anesthetic intraperitoneally. Diagram and picture show site of incision. Generate a small cut between the neck and the shoulder blades to find the interscapular brown adipose tissue. Middle panel: Place window for imaging. Several options exist for imaging. Option 1: no coverslip is placed, and imaging is done directly on the hydrated exposed tissue. Option 2: A round coverslip is placed using surgical glue. Option 3: A round coverslip attached to a vacuum ring is placed on top of the incision. Right panel: Place mouse on stage and image. The head of the mouse must be secured/immobilized using a stereotaxic instrument. This includes securing at 3 main points: the teeth, and both ears. A support for the chin can be used to help immobilization. Depending on the experimental conditions, dyes can be added intravenously either before or after securing the mouse on the stage. An upright microscope is best suited to image the isc-BAT. The objective reaches the isc-BAT from the top. Scale bar: 20 μm. Created with BioRender.com[href=http://BioRender.com].\nPlace window for imaging (Figure 5[href=https://www.wicell.org#fig5] middle panel). Various options exist to proceed.\nOption 1: Depending on the type of surgery, a window may or may not be required. If not required, immersion oil can be used directly on the isc-BAT. Alternatively, the surgical site can be covered with a hydration solution or 1×PBS.\nOption 2: A coverslip can be placed on the site of interest by adding surgical glue around the contour of the incision (shown on image by dotted lines).",
    "Option 3: A coverslip can be secured on a holder attached to a vacuum pump, and placed on top of the surgical site of interest. This will serve both to keep the coverslip in place and to stabilize the imaging region. Allow for lose adherence to the tissue surface via 20–25 mmHg of reversible vacuum.\nPlace mouse on stage and image (Figure 5[href=https://www.wicell.org#fig5] right panel). Once the surgical incision is ready, place the mouse in the ventral recumbency. The mouse head must be immobilized for imaging. This can be achieved using a stereotaxic instrument that provides support to both ears and the front of the head e.g., via the teeth.\nOnce the mouse is secure and ready for imaging, inject dyes or conjugated antibodies of interest.\nCritical: Care should be taken during the surgery to avoid injuring the blood and lymphatic vasculature.\nUse an upright microscope with at least a 63× objective, and position the objective at the site of the surgical incision.\nConfirm that no significant vascular damage, or blood flow alterations occurred, and acquire images as needed (see steps 98–103). See Methods Video S5[href=https://www.wicell.org#mmc5].\n    Your browser does not support HTML5 video.\n  \nMethods video S5. Outcome of isc-BAT IVM, related to step 31\nVideo shows the expected outcome of the injection of 70 kDa FITC-Dextran (white), Hoechst (blue), and TdTom AnTat1.1E T. brucei (red) in the isc-BAT at day 5 post-infection.\nProcedure for lung IVM\nTiming: 20–30 min\nCritical: Alteration to oxygenation will likely affect other organs, and may include alterations to host and pathogen parameters. Care should be taken to avoid alterations to oxygenation.",
    "Note: The protocol used in our work (with slight modifications) is based on (Looney et al., 2011[href=https://www.wicell.org#bib4]). Multiple protocols are available, alternative to the one described below (Fiole and Tournier, 2016[href=https://www.wicell.org#bib2]). These protocols depend on whether mechanical stabilization is needed (i.e., if not needed, an easier strategy to image the lung could be to oversample the free-moving lung); whether ventilation alterations are acceptable, and whether ventilation is required (i.e., if it is not required, this allows the use of bronchus clamping or sequential apnea and gated imaging). For a better explanation helping to decide on these parameters for thoracic surgery and imaging, readers are referred to (Fiole and Tournier, 2016[href=https://www.wicell.org#bib2]) exploring the advantages and disadvantages of each method.\nPlace the mouse in the dorsal recumbency.\nPreparation for surgical site (Figure 6[href=https://www.wicell.org#fig6] left panel). (Optional) Perform assisted ventilation using a nose cone (Rindfield and McBrian, 2012[href=https://www.wicell.org#bib11]) or endotracheal intubation, and link to a ventilator.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1718-Fig6.jpg\nFigure 6. Surgeries for implanting terminal windows in the mouse lungs",
    "Left panel: Preparation of surgical site. Begin by injecting anesthetic intraperitoneally. Diagram and picture show site of incision. Then perform a tracheotomy to Intubate mice for assisted ventilation. Follow by performing a thoracotomy with the aid of rib retractors. Middle panel: Place window for imaging. Use a round coverslip attached to a vacuum ring and place on top of the incision. Right panel: Place mouse on stage and image. A custom-built stage provides full body support to the mouse and allows space for tubing (used for vacuum, oxygenation and intravenous cannulation). Immobilize all limbs and tail. Depending on the experimental conditions, dyes can be added intravenously either before or after securing the mouse on the stage. An upright microscope is best suited to image the lungs. The objective reaches the lungs from the top. Scale bar: 20 μm. Created with BioRender.com[href=http://BioRender.com].\nSeveral protocols exist for endotracheal intubation. A recent example is described in detail in (Maruyama et al., 2021[href=https://www.wicell.org#bib5]).\nIntubate mice and initiate assisted ventilation.\nPerform a thoracotomy – an incision of 0.5 cm–1 cm wide on the left side of the chest. This involves re-sectioning up to 3 ribs around the 5th rib, and stabilization using rib retractors.\nPlace window for imaging (Figure 6[href=https://www.wicell.org#fig6] middle panel). Use a suction system linked to a ring that acts as a holder for a glass slide to create a vacuum. This leads to stabilization of the lung. Use a round coverslip (#1.5, 15–20 mm diameter) to make a window. Allow for lose adherence to the lung surface via 20–25 mmHg of reversible vacuum.",
    "Place mouse on stage and image (Figure 6[href=https://www.wicell.org#fig6] right panel). Place the mouse in dorsal recumbency. A custom-built stage must allow for full-body support of the mouse. All limbs and the tail should be immobilized with the aid of adhesive tape. Similarly, tubing for oxygenation and for vacuum generation should be considered in the setup that will be introduced to the microscope.\nCritical: Spread suction force over large vacuum area to prevent injuries on the lung.\nUse an inverted microscope with at least a 63× objective, and position the objective at the site of the optical window over the surgical incision.\nConfirm that no significant vascular damage, or blood flow alterations occurred, and acquire images as needed (see steps 98–103). See Methods Video S6[href=https://www.wicell.org#mmc6].\n    Your browser does not support HTML5 video.\n  \nMethods video S6. Outcome of lung IVM, related to step 38\nVideo shows the expected outcome of the injection of 70 kDa FITC-Dextran (green), Hoechst (blue), and TdTom AnTat1.1E T. brucei (red) in the lungs at day 5 post-infection.\nProcedure for heart IVM\nTiming: 20–30 min\nCritical: Alteration to oxygenation will likely affect other organs, and may include alterations to host and pathogen parameters. Care should be taken to avoid alterations to oxygenation.\nNote: The protocol used in our work (with slight modifications) is based on (Looney et al., 2011[href=https://www.wicell.org#bib4]). The main challenge with heart surgery is that upon opening the thoracic chamber, lung collapse can occur. This can alter oxygenation to other organs, and drastically shorten the lifespan of the mouse. Although in this procedure the heart is imaged, several steps required for lung stabilization, are performed as described in steps 32–36.\nPlace the mouse in the dorsal recumbency.\nPreparation for surgical site (Figure 7[href=https://www.wicell.org#fig7] left panel). Perform assisted ventilation using endotracheal intubation, and link to a ventilator.",
    "imgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1718-Fig7.jpg\nFigure 7. Surgeries for implanting terminal windows in the mouse heart\nLeft panel: Preparation of surgical site. Begin by injecting anesthetic intraperitoneally. Diagram and picture show site of incision. Then perform a tracheotomy to intubate mice for assisted ventilation. Follow by performing a thoracotomy with the aid of rib retractors, and carefully move the left lung sideways to expose the heart. Middle panel: Place window for imaging. Use a round coverslip attached to a vacuum ring and place on top of the incision. Right panel: Place mouse on stage and image. A custom-built stage provides full body support to the mouse and allows space for tubing (used for vacuum, oxygenation and intravenous cannulation). Immobilize all limbs and tail. Depending on the experimental conditions, dyes can be added intravenously either before or after securing the mouse on the stage. An upright microscope is best suited to image the heart. The objective reaches the heart from the top. Scale bar: 20 μm. Created with BioRender.com[href=http://BioRender.com].\nIntubate mice and initiate assisted ventilation.\nPerform a thoracotomy – an incision of 0.5 cm–1 cm wide on the left side of the chest. This involves re-sectioning up to 3 ribs around the 5th rib, and stabilization using rib retractors. Carefully move the lung to the left, to display the heart instead.\nPlace window for imaging (Figure 7[href=https://www.wicell.org#fig7] middle panel). Use a suction system linked to a ring that acts as a holder for a glass slide to create a vacuum. This leads to stabilization of the thorax, and allows a direct partial immobilization of the heart. Use a round coverslip (#1.5, 15–20 mm diameter) to make a window. Allow for lose adherence to the heart surface via 20–25 mmHg of reversible vacuum.",
    "Place mouse on stage and image (Figure 7[href=https://www.wicell.org#fig7] right panel). Place the mouse in dorsal recumbency. A custom-built stage must allow for full-body support of the mouse. All limbs and the tail should be immobilized with the aid of adhesive tape. Similarly, tubing for oxygenation and for vacuum generation should be considered in the setup that will be introduced to the microscope.\nOptional: Important for heart imaging will be heartbeat-induced artifacts. Image acquisition and image processing methods exist to address this motion.\nCritical: Spread suction force over large vacuum area to prevent injuries on the heart.\nUse an inverted microscope with at least a 63× objective, and position the objective at the site of the optical window over the surgical incision.\nConfirm that no significant vascular damage, or blood flow alterations occurred, and acquire images as needed (see steps 98–103). See Methods Videos S7[href=https://www.wicell.org#mmc7] and S8[href=https://www.wicell.org#mmc8].\n    Your browser does not support HTML5 video.\n  \nMethods video S7. Outcome of heart IVM, related to step 45\nVideo shows the expected outcome of the injection of A647-ICAM2 (white), in the heart at day 3 post-infection.\n    Your browser does not support HTML5 video.\n  \nMethods video S8. Outcome of heart IVM, related to step 45\nVideo shows the expected outcome of the injection of 70 kDa FITC-Dextran (yellow), in the heart at day 3 post-infection. Parasites are visible by dark contrast.\nProcedure for liver IVM\nTiming: 10–20 min\nNote: The protocol used in this work is based on a previously published protocol, also established in parasitology by (Thiberge et al., 2007[href=https://www.wicell.org#bib13]).\nPlace the mouse in dorsal recumbency.\nPreparation for surgical site (Figure 8[href=https://www.wicell.org#fig8] left panel). Locate the xiphoid process (caudal thoracic limit reference) and perform a small horizontal surgical incision immediately below it.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1718-Fig8.jpg\nFigure 8. Surgeries for implanting terminal windows in the mouse liver",
    "Left panel: Preparation of surgical site. Begin by injecting anesthetic intraperitoneally. Diagram and picture show site of incision. Find the xiphoid process (at the bottom of the ribs) to locate the site for incision. Make a small incision (up to 5 mm) and with the aid of cotton buds, eject either the middle or part of the left liver lobe. Middle panel: Place window for imaging. Two options exist for imaging the liver either using an inverted microscope (option 1) or an upright microscope (option 2). Option 1: Use a rectangular coverslip and secure on the mouse using surgical glue. Option 2: Use a round coverslip attached to a vacuum ring and place on top of the incision. Right panel: Place mouse on stage and image. Option 1: For imaging in an inverted microscope, an adjustable holder can be used on the microscope stage. The mouse is turned to display the ventral side (and the incision), and the coverslip attached to the mouse is secured on the holder. Note: This setup will likely be sufficient for a mouse of 6–10 weeks old. Younger mice will likely need support for the head and lower body. Older mice will likely bend the coverslip, risking that it breaks within the microscope. For older mice, option 2 is therefore recommended. The objective reaches the liver from the bottom.Option 2: A custom-built stage provides full body support to the mouse and allows space for tubing (used for vacuum, and intravenous cannulation). Immobilize all limbs and tail. Depending on the experimental conditions, dyes can be added intravenously either before or after securing the mouse on the stage. The objective reaches the liver from the top. Scale bar: 20 μm. Created with BioRender.com[href=http://BioRender.com].\nBegin by using the forceps to lift the skin away from the liver.",
    "Make a small cut on the skin. Once the abdominal muscles become visible, make a small horizontal cut to reach the liver. Liver lobes will be identifiable by their coloration (brownish/red).\nNote: Although cutting large vessels in the skin and muscle while making the incision is unlikely, you should have a cauterizer ready to solve any major bleeding coming from these tissues.\nCritical: The incision on the skin and muscle must be small (i.e., no more than 5 mm in width) in order to prevent major alterations to the cardiac and respiratory output. Care should be taken to make small cuts to approach the liver, as the liver lobes are very close to the skin surface at this anatomical point.\nCritical: The liver should not be directly handled with the surgical instruments. Handling with the forceps is likely to either collapse the immediate vasculature or cause major perforations and bleeding.\nTo expose the liver lobe, extend the incision carefully as needed. Then, push the left liver lobe through the incision with the aid of moist cotton swabs.\nMoisten the liver with saline solution (0.9% NaCl) or 1×PBS.\nPlace window for imaging (Figure 8[href=https://www.wicell.org#fig8] middle panel).\nOption 1: For a terminal window, add surgical glue above and below the surgical incision, and place a rectangular coverslip on top of the organ.\nOption 2: Alternatively, use a suction system linked to a ring that acts as a holder for a glass slide to create a vacuum. This leads to stabilization of the abdomen, and allows a direct partial immobilization of the liver. Use a round coverslip (#1.5, 15–20 mm diameter) to make a window. Allow for lose adherence to the liver surface via 20–25 mmHg of reversible vacuum.",
    "Critical: Do not press the coverslip very hard against the liver. This poses the risk of interrupting blood flow or damaging the tissue. Any damage can affect host and parasite parameters.\nPlace mouse on stage and image (Figure 8[href=https://www.wicell.org#fig8] right panel). Place the mouse on ventral recumbency (window option 1) or dorsal recumbency (window option 2), using a suitable microscope stage. While custom-built stages can be used, a conventional stage with adjustable sections suitable for imaging glass slides and coverslips can be used. Care should be taken, however, that key points in the rest of the body are well supported (e.g., head at the anterior end, and legs and tail at the posterior end).\nFor window option 1, use an inverted microscope with a 63× or 100× oil immersion objectives, and position the objective below the window on the surgical incision. For window option 2, use an upright microscope with a 63× or 100× oil immersion objectives, and position the objective above the window on the surgical incision.\nConfirm that no significant vascular damage, or blood flow alterations occurred, and acquire images as needed (see steps 98–103). See Methods Videos S9[href=https://www.wicell.org#mmc9] and S10[href=https://www.wicell.org#mmc10].\n    Your browser does not support HTML5 video.\n  \nMethods video S9. Outcome of liver IVM, related to step 53\nVideo shows the expected outcome of the injection of A647-ICAM2 (magenta), 70 kDa FITC-Dextran (white), and TdTom AnTat1.1E T. brucei (red) in the liver at day 3 post-infection.\n    Your browser does not support HTML5 video.\n  \nMethods video S10. Outcome of liver IVM, related to step 53\nVideo shows the expected outcome of the injection of 70 kDa FITC-Dextran (yellow), and Hoechst (blue) in the liver in an uninfected mouse.\nProcedure for spleen IVM\nTiming: 10–20 min\nPlace the mouse in right lateral recumbency.",
    "Preparation for surgical site (Figure 9[href=https://www.wicell.org#fig9] left panel).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1718-Fig9.jpg\nFigure 9. Surgeries for implanting terminal windows in the mouse spleen",
    "Left panel: Preparation of surgical site. Begin by injecting anesthetic intraperitoneally. Diagram and picture show site of incision. Make a small incision (up to 5 mm) and carefully expose the spleen. In infected mice the spleen is more fragile and therefore we recommend using the pancreas as an anchor point to carefully pull the spleen. Middle panel: Place window for imaging. Two options exist for imaging the spleen either using an inverted microscope (option 1) or an upright microscope (option 2). Option 1: Use a rectangular coverslip and secure on the mouse using surgical glue. Option 2: Use a round coverslip attached to a vacuum ring and place on top of the incision. Right panel: Place mouse on stage and image. Option 1: For imaging in an inverted microscope, an adjustable holder can be used on the microscope stage. The mouse is turned laterally to display the left side (and the incision), and the coverslip attached to the mouse is secured on the holder. Note: This setup will likely be sufficient for a mouse of 6–10 weeks old. Younger mice will likely need support for the head and lower body. Older mice will likely bend the coverslip, risking that it breaks within the microscope. For older mice, option 2 is therefore recommended. The objective reaches the spleen from the bottom.Option 2: A custom-built stage provides full body support to the mouse and allows space for tubing (used for vacuum, and intravenous cannulation). Immobilize all limbs and tail. Depending on the experimental conditions, dyes can be added intravenously either before or after securing the mouse on the stage. The objective reaches the spleen from the top. Scale bar: 20 μm. Created with BioRender.com[href=http://BioRender.com].\nBegin by using the forceps to lift the skin away from the spleen.",
    "Make a small cut on the skin only, and retract the skin to generate a small field of view.\nMake sure you can visualize the underlying spleen.\nNote: Although cutting large vessels in the skin while making the incision is unlikely, you should have a cauterizer ready to solve any major bleeding coming from these tissues.\nOnce the underlying muscle is exposed, locate a large ascending vessel, and perform a small diagonal incision in its vicinity but with the utmost care to avoid it.\nCritical: The incision on the skin and muscle must be small (i.e., no more than 5 mm in width) in order to prevent major bleeding and stabilize the organ better. However, in an infected animal, splenomegaly will require that this incision is larger than in an uninfected mouse. This enlargement of the incision should be done with great care to avoid important vasculature in the vicinity.\nCritical: The spleen should be handled with great care. Avoid using any sharp forceps to handle it, as this might create bleeding that can be life-threatening. Blunt forceps can be used, however, great care should be taken not to perform dents on the organ, nor collapse the underlying vasculature of the organ.\nPlace window for imaging (Figure 9[href=https://www.wicell.org#fig9] middle panel). The pancreas is located in the medial side of the spleen, and is more resistant to handling with blunt forceps. The pancreas can be used as an anchor point to pull the medial side of the spleen through the surgical incision.\nCritical: Great care should be taken not to pull the spleen with much force, nor create significant tension during exposure (at risk of rupturing the arteries in the middle and posterior of the organ).",
    "Critical: Expose the pancreas and up to 1/3 of the spleen, and make sure enough tissue is exposed to prevent retraction into the body.\nCritical: Care should be taken during the surgery to avoid injuring the blood and lymphatic vasculature.\nOnce it is clear that retraction of the organ into the body does not occur, hydrate the organ with saline solution (0.9% NaCl) or 1×PBS.\nOption 1: For a terminal window, add surgical glue above and below the surgical incision, and place a coverslip on top of the organ.\nOption 2: Alternatively, use a suction system linked to a ring that acts as a holder for a glass slide to create a vacuum. This leads to stabilization of the organ and surrounding tissues, and allows a direct partial immobilization of the spleen. Use a round coverslip (#1.5, 15–20 mm diameter) to make a window. Allow for lose adherence to the spleen surface via 20–25 mmHg of reversible vacuum.\nCritical: Do not press the coverslip very hard against the spleen as this can cause vascular collapse. Any damage can affect host and parasite parameters.\nPlace mouse on stage and image (Figure 9[href=https://www.wicell.org#fig9] right panel). Place the mouse in (window option 1) left lateral recumbency, or (window option 2) right lateral recumbency, on a suitable microscope stage.\nFor window option 1, use an inverted microscope with a 63× or 100× oil immersion objectives, and position the objective below the window on the surgical incision. For window option 2, use an upright microscopy with a 63× or 100× oil immersion objectives, and position the objective above the window on the surgical incision.\nConfirm that no significant vascular damage, or blood flow alterations occurred, and acquire images as needed (see steps 98–103). See Methods Videos S11[href=https://www.wicell.org#mmc11], S12[href=https://www.wicell.org#mmc12], and S13[href=https://www.wicell.org#mmc13].",
    "Your browser does not support HTML5 video.\n  \nMethods video S11. Outcome of spleen IVM, related to step 60\nVideo shows the expected outcome of the injection of 70 kDa FITC-Dextran (yellow), and TdTom AnTat1.1E T. brucei (red) in the spleen at day 3 post-infection.\n    Your browser does not support HTML5 video.\n  \nMethods video S12. Outcome of spleen IVM, related to step 60\nVideo shows the expected outcome of the injection of 70 kDa FITC-Dextran (yellow), and TdTom AnTat1.1E T. brucei (red) in the spleen at day 5 post-infection.\n    Your browser does not support HTML5 video.\n  \nMethods video S13. Outcome of spleen IVM, related to step 60\nVideo shows the expected outcome of the injection of 70 kDa FITC-Dextran (yellow), and TdTom AnTat1.1E T. brucei (red) in the spleen at day 2 post-infection.\nProcedure for pancreas IVM\nTiming: 10–20 min\nPlace the mouse in right lateral recumbency.\nPreparation for surgical site (Figure 10[href=https://www.wicell.org#fig10] left panel).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1718-Fig10.jpg\nFigure 10. Surgeries for implanting terminal windows in the mouse pancreas",
    "Left panel: Preparation of surgical site. Begin by injecting anesthetic intraperitoneally. Diagram and picture show site of incision. Make a small incision (up to 5 mm) and carefully expose the pancreas. Middle panel: Place window for imaging. Two options exist for imaging the pancreas either using an inverted microscope (option 1) or an upright microscope (option 2). Option 1: Use a rectangular coverslip and secure on the mouse using surgical glue. Option 2: Use a round coverslip attached to a vacuum ring and place on top of the incision. Right panel: Place mouse on stage and image. Option 1: For imaging in an inverted microscope, an adjustable holder can be used on the microscope stage. The mouse is turned laterally to display the left side (and the incision), and the coverslip attached to the mouse is secured on the holder. Note: This setup will likely be sufficient for a mouse of 6–10 weeks old. Younger mice will likely need support for the head and lower body. Older mice will likely bend the coverslip, risking that it breaks within the microscope. For older mice, option 2 is therefore recommended. The objective reaches the spleen from the bottom. Option 2: A custom-built stage provides full body support to the mouse and allows space for tubing (used for vacuum, and intravenous cannulation). Immobilize all limbs and tail. Depending on the experimental conditions, dyes can be added intravenously either before or after securing the mouse on the stage. The objective reaches the spleen from the top. Scale bar: 20 μm. Created with BioRender.com[href=http://BioRender.com].\nBegin by using the forceps to lift the skin away from the pancreas.\nMake a small cut on the skin only, and retract the skin to generate a small field of view.\nMake sure you can visualize the underlying pancreas.",
    "Note: Although cutting large vessels in the skin while making the incision is unlikely, you should have a cauterizer ready to solve any major bleeding coming from these tissues.\nOnce the underlying muscle is exposed, locate a large ascending vessel, and perform a small diagonal incision in its vicinity but with the utmost care to avoid it.\nCritical: The incision on the skin and muscle must be small (i.e., no more than 5 mm in width) in order to prevent major bleeding and stabilize the organ better.\nPlace window for imaging (Figure 10[href=https://www.wicell.org#fig10] middle panel). The pancreas is located in the medial side of the spleen, and is relatively resistant to handling with blunt forceps.\nCritical: Expose the pancreas, and make sure enough tissue is exposed to prevent retraction into the body.\nCritical: Care should be taken during the surgery to avoid injuring the blood and lymphatic vasculature.\nOnce it is clear retraction of the organ into the body does not occur, hydrate the organ with saline solution (0.9% NaCl) or 1×PBS.\nOption 1: For a terminal window, add surgical glue above and below the surgical incision, and place a coverslip on top of the organ.\nOption 2: Alternatively, use a suction system linked to a ring that acts as a holder for a glass slide to create a vacuum. This leads to stabilization of the organ and surrounding tissues, and allows a direct partial immobilization of the pancreas. Use a round coverslip (#1.5, 15–20 mm diameter) to make a window. Allow for lose adherence to the pancreas surface via 20–25 mmHg of reversible vacuum.\nPlace mouse on stage and image (Figure 10[href=https://www.wicell.org#fig10] right panel). Place the mouse in left lateral recumbency (window option 1), or right lateral recumbency (window option 2) on a suitable microscope stage.",
    "For window option 1, use an inverted microscope with a 63× or 100× oil immersion objectives, and position the objective below the window on the surgical incision. For window option 2, use an upright microscopy with a 63× or 100× oil immersion objectives, and position the objective above the window on the surgical incision.\nConfirm that no significant vascular damage, or blood flow alterations occurred, and acquire images as needed (see steps 98–103). See Methods Videos S14[href=https://www.wicell.org#mmc14] and S15[href=https://www.wicell.org#mmc15].\n    Your browser does not support HTML5 video.\n  \nMethods video S14. Outcome of pancreas IVM, related to step 67\nVideo shows the expected outcome of the injection of 70 kDa FITC-Dextran (yellow), and TdTom AnTat1.1E T. brucei (red) in the pancreas at day 2 post-infection.\n    Your browser does not support HTML5 video.\n  \nMethods video S15. Outcome of pancreas IVM, related to step 67\nVideo shows the expected outcome of the injection of 70 kDa FITC-Dextran (yellow), Hoechst (blue), and TdTom AnTat1.1E T. brucei (red) in the pancreas at day 5 post-infection.\nProcedure for kidney IVM\nTiming: 10–20 min\nPlace the mouse in ventral recumbency.\nPreparation for surgical site (Figure 11[href=https://www.wicell.org#fig11] left panel).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1718-Fig11.jpg\nFigure 11. Surgeries for implanting terminal windows in the mouse kidney",
    "Left panel: Preparation of surgical site. Begin by injecting anesthetic intraperitoneally. Diagram and picture show site of incision. Make a small incision (up to 5 mm) and carefully expose the kidney. Middle panel: Place window for imaging. Two options exist for imaging the kidney either using an inverted microscope (option 1) or an upright microscope (option 2). Option 1: Use a rectangular coverslip and secure on the mouse using surgical glue. Option 2: Use a round coverslip attached to a vacuum ring and place on top of the incision. Right panel: Place mouse on stage and image. Option 1: For imaging in an inverted microscope, an adjustable holder can be used on the microscope stage. The mouse is turned laterally to display the left or right side (and the incision), and the coverslip attached to the mouse is secured on the holder. Note: This setup will likely be sufficient for a mouse of 6–10 weeks old. Younger mice will likely need support for the head and lower body. Older mice will likely bend the coverslip, risking that it breaks within the microscope. For older mice, option 2 is therefore recommended. The objective reaches the kidney from the bottom. Option 2: A custom-built stage provides full body support to the mouse and allows space for tubing (used for vacuum, and intravenous cannulation). Immobilize all limbs and tail. Depending on the experimental conditions, dyes can be added intravenously either before or after securing the mouse on the stage. The objective reaches the kidney from the top. Scale bar: 20 μm. Created with BioRender.com[href=http://BioRender.com].\nBegin by using the forceps to lift the skin away from the kidney.\nMake a small cut on the skin and retract it to generate a small field of view.",
    "Make sure you can visualize the underlying kidney under the muscle layer – it will be clear due to the dark red colur.\nNote: Although cutting large vessels in the skin while making the incision is unlikely, you should have a cauterizer ready to solve any major bleeding coming from these tissues.\nCritical: The incision on the skin and muscle must be small (i.e., no more than 5 mm in width) in order to prevent major bleeding and stabilize the organ better. Any enlargement of the incision should be done with great care to avoid blood vasculature in the vicinity.\nPlace window for imaging (Figure 11[href=https://www.wicell.org#fig11] middle panel). The kidney is resistant to handling with blunt forceps. Do not use sharp tools to handle it. Gently retract the surgical incision and expose the dorsal side of the organ.\nCritical: Great care should be taken not to pull the kidney with much force, nor create significant tension during exposure (at risk of rupturing blood vessels of the organ).\nOnce it is clear that retraction of the kidney into the body does not occur, hydrate the organ with saline solution (0.9% NaCl), or 1×PBS.\nOption 1: For a terminal window, add surgical glue above and below the surgical incision, and place a coverslip on top of the organ.\nOption 2: Alternatively, use a suction system linked to a ring that acts as a holder for a glass slide to create a vacuum. This leads to stabilization of the organ and surrounding tissues, and allows a direct partial immobilization of the kidney. Use a round coverslip (#1.5, 15–20 mm diameter) to make a window. Allow for lose adherence to the kidney surface via 20–25 mmHg of reversible vacuum.",
    "Place mouse on stage and image (Figure 11[href=https://www.wicell.org#fig11] right panel). Place the mouse in left lateral recumbency (window option 1), or dorsal recumbency (window option 2) on a suitable microscope stage.\nFor window option 1, use an inverted microscope with a 63× or 100× oil immersion objectives, and position the objective below the window on the surgical incision. For window option 2, use an upright microscopy with a 63× or 100× oil immersion objectives, and position the objective above the window on the surgical incision.\nConfirm that no significant vascular damage, or blood flow alterations occurred, and acquire images as needed (see steps 98–103). See Methods Video S16[href=https://www.wicell.org#mmc16].\n    Your browser does not support HTML5 video.\n  \nMethods video S16. Outcome of kidney IVM, related to step 74\nVideo shows the expected outcome of the injection of 70 kDa FITC-Dextran (yellow), Hoechst (blue), and TdTom AnTat1.1E T. brucei (red) in the kidney at day 4 post-infection.\nProcedure for lymph node IVM\nTiming: 20–30 min\nNote: This protocol requires the generation of suitable stages/holders for positioning the mouse within the microscope. This protocol is based on a published method by (Liou et al., 2012[href=https://www.wicell.org#bib3]). The method described below is adapted to the popliteal lymph node, but other lymph nodes are accessible to visualization too, and the protocol should be adapted accordingly.\nPlace the mouse in the ventral recumbency.\nPreparation for surgical site (Figure 12[href=https://www.wicell.org#fig12] left panel). Use the forceps to lift the skin away from the mid-calf, and cut vertically up to the upper thigh.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1718-Fig12.jpg\nFigure 12. Surgeries for implanting terminal windows in the mouse popliteal lymph node",
    "Left panel: Preparation of surgical site. Begin by injecting anesthetic intraperitoneally. Diagram and picture show site of incision. Make a small incision on one of the lower limbs (up to 2 mm) and carefully move the subcutaneous adipose tissues and muscles to expose the popliteal lymph node. Middle panel: Place window for imaging. Two options exist for imaging the popliteal lymph node either with or without a coverslip. Option 1: Hydrate the site of incision and image directly. Option 2: Use a round coverslip attached to a vacuum ring and place on top of the incision. Right panel: Place mouse on stage and image. A custom-built stage provides full body support to the mouse and allows space for tubing (used for vacuum, and intravenous cannulation). Stretch the leg fully and immobilize all limbs and tail. For stabilization of the leg, a lumbar and hip clamp must be used. Depending on the microscope, an additional custom-built support for the leg might be required. Depending on the experimental conditions, dyes can be added intravenously either before or after securing the mouse on the stage. The objective reaches the lymph node from the top. Scale bar: 20 μm. Created with BioRender.com[href=http://BioRender.com].\nGenerate skin flaps by making two horizontal skin incisions at the top of the vertical incision line. Separate the skin as needed, to expose the lymph node.\nSeparate the lymph node from the surrounding adipose and muscle tissues.\nCritical: Care should be taken during the surgery to avoid injuring the blood and lymphatic vasculature.\nHydrate the lymph node with warm saline solution (0.9% NaCl) or 1×PBS.\nPlace window for imaging (Figure 12[href=https://www.wicell.org#fig12] middle panel). Place a glass coverslip on the tissue and secure using either surgical glue or via suction using vacuum, and place the mouse in the microscope stage.",
    "Place mouse on stage and image (Figure 12[href=https://www.wicell.org#fig12] right panel). Use an upright microscope with a 63× or 100× oil immersion objectives, and position the objective below the window on the surgical incision.\nConfirm that no significant vascular damage, or blood flow alterations occurred, and acquire images as needed (see steps 98–103). See Methods Video S17[href=https://www.wicell.org#mmc17].\n    Your browser does not support HTML5 video.\n  \nMethods video S17. Outcome of lymph node IVM, related to step 82\nVideo shows the expected outcome of the injection of 70 kDa FITC-Dextran (yellow) and Hoechst (blue) in the lymph nodes in uninfected mice.\nProcedure for gonadal white adipose tissue IVM\nTiming: 5–10 min. This protocol is also suitable to image the reproductive organs of both male and female mice\nPlace the mouse in dorsal recumbency.\nPreparation for surgical site (Figure 13[href=https://www.wicell.org#fig13] left panel). Locate the site of interest, i.e., in the pelvis, on either lateral location, at the level of the upper thigh and before the knee.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1718-Fig13.jpg\nFigure 13. Surgeries for implanting terminal windows in the mouse gonadal white adipose tissue (g-WAT)",
    "Left panel: Preparation of surgical site. Begin by injecting anesthetic intraperitoneally. Diagram and picture show site of incision. Make a small incision in the pelvis, lateral to the area of the knee (up to 5 mm) and carefully expose the g-WAT. Middle panel: Place window for imaging. Two options exist for imaging the g-WAT either using an inverted microscope (option 1) or an upright microscope (option 2). Option 1: Use a rectangular coverslip and secure on the mouse using surgical glue. Option 2: Use a round coverslip attached to a vacuum ring and place on top of the incision. Right panel: Place mouse on stage and image. Option 1: For imaging in an inverted microscope, an adjustable holder can be used on the microscope stage. The mouse is turned to display the ventral side (and the incision), and the coverslip attached to the mouse is secured on the holder. Note: This setup will likely be sufficient for a mouse of 6–10 weeks old. Younger mice will likely need support for the head and lower body. Older mice will likely bend the coverslip, risking that it breaks within the microscope. For older mice, option 2 is therefore recommended. The objective reaches the g-WAT from the bottom. Option 2: A custom-built stage provides full body support to the mouse and allows space for tubing (used for vacuum, and intravenous cannulation). Immobilize all limbs and tail. Depending on the experimental conditions, dyes can be added intravenously either before or after securing the mouse on the stage. The objective reaches the g-WAT from the top. Scale bar: 20 μm. Created with BioRender.com[href=http://BioRender.com].",
    "Use the forceps to lift the skin away from the pelvis, and cut diagonally and downwards to expose the underlying muscle. Locate the gonadal adipose tissue, and make a small incision in the muscle and peritoneum, to expose the gonadal adipose tissue.\nCritical: Care should be taken during the surgery to avoid injuring the vasculature in the vicinity, and to enter the region of the hind leg adipose tissue and muscle. The surgical incision must remain within the confines of the pelvis and must be very small in order to stabilize the organ adequately.\nThrough the incision in the peritoneum, place the forceps inside the pelvis and with care, withdraw the full gonadal adipose tissue.\nCritical: Care should be taken not to extend the adipose tissue too much in order to avoid damage to the vasculature and tissue integrity.\nHydrate the tissue with 1×PBS or saline solution (0.9% NaCl).\nPlace window for imaging (Figure 13[href=https://www.wicell.org#fig13] middle panel).\nOption 1: For a terminal window, add surgical glue above and below the surgical incision, and place a coverslip on top of the organ.\nOption 2: Alternatively, use a suction system linked to a ring that acts as a holder for a glass slide to create a vacuum. This leads to stabilization of the organ and surrounding tissues, and allows a direct partial immobilization of the g-WAT. Use a round coverslip (#1.5, 15–20 mm diameter) to make a window. Allow for lose adherence to the g-WAT surface via 20–25 mmHg of reversible vacuum.",
    "Place mouse on stage and image (Figure 13[href=https://www.wicell.org#fig13] right panel). For window option 1, use an inverted microscope with a 63× or 100× oil immersion objectives, place the mouse on the stage in the ventral recumbency, and position the objective below the window on the surgical incision. For window option 2, place the mouse in dorsal recumbency and use an upright microscopy with a 63× or 100× oil immersion objectives, and position the objective above the window on the surgical incision.\nConfirm that no significant vascular damage, or blood flow alterations occurred, and acquire images as needed (see steps 98–103). See Methods Videos S18[href=https://www.wicell.org#mmc18] and S19[href=https://www.wicell.org#mmc19].\n    Your browser does not support HTML5 video.\n  \nMethods video S18. Outcome of g-WAT IVM, related to step 90\nVideo shows the expected outcome of the injection of 70 kDa FITC-Dextran (yellow) and Hoechst (blue) in the g-WAT at day 4 post-infection. Parasites are visible by dark contrast.\n    Your browser does not support HTML5 video.\n  \nMethods video S19. Outcome of g-WAT IVM, related to step 90\nVideo shows the expected outcome of the injection of 70 kDa FITC-Dextran (green) and TdTom AnTat1.1E T. brucei (white) in the g-WAT at day 4 post-infection.\n(Optional) prepare and inject RBC markers to visualize distribution across vasculature\nTiming: 1 h and 15 min\nThe main aim of this step is to use labeled RBCs as markers for cell distribution across the vasculature, which can be used to compare relative parasite distribution.\nFollowing the surgery and window implantation in the tissue of choice, inject fluorescently labeled RBCs by intravenous injection. In our protocol we compared the distribution of labeled RBCs upon injection through retro-orbital plexus, or tail vein, and saw no differences in perfusion time or distribution.",
    "To prepare labeled RBCs, we adapted a previously published protocol (Theron et al., 2010[href=https://www.wicell.org#bib12]).\nRemove 10–20 μL of blood from the tail vein of an unlabeled, uninfected mouse and collect in RPMI 1640, in tubes treated with heparin to prevent coagulation.\nCount the required number of RBCs to label, using a Neubauer chamber or other method that enables quantification of RBC concentration.\nCentrifuge cells at 800 g for 5 min, and resuspend the pellet in 20 μM CFDA-SE or 10 μM DDAO-SE, and incubate for 1 h at 37°C.\nWash the suspension with complete RPMI 1640 medium twice.\nResuspend in a final volume of 200 μL of 1× PBS, and inject the full volume into an infected mouse ready for IVM imaging. Figure 14[href=https://www.wicell.org#fig14] shows labeled RBCs before and after injection into mice.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1718-Fig14.jpg\nFigure 14. Exogenous labeling of red blood cells for IVM visualization\nRed blood cells labeled with (A) DDAO-SE and (B) CFDA-SE before and (C) after injection into mice as seen in the liver vasculature. Labeled cells were used as markers for cell distribution and blood flow. Scale bars: 5 μm (A and B); 30 μm (C).\nNote: The dye should be chosen based on the compatibility with other fluorescent reporters/markers used in the same assay. For instance, if antibodies conjugated to A647 are used to label the vasculature, then CFDA-SE is preferable. Conversely, if FITC-Dextran is a requirement, DDAO-SE would be a more suitable dye to use in this context for RBC labeling. It is possible, however, to use several combinations, although care should be taken to ensure that the various markers can be clearly visualized.\n(Optional) Inject dyes and conjugated antibodies to visualize receptors of interest (or other markers of interest)\nTiming: 1 min",
    "The main aim of this step is to visualize the vascular endothelium, host and parasite nuclei, vascular permeability and extravascular parenchyma within the mouse body.\nFollowing the surgery and window implantation in the tissue of choice, inject conjugated antibodies for the vascular receptor of interest (or other cellular or subcellular markers of interest).\nIn our work, we performed intraocular and tail vein injections, and demonstrated that perfusion time and labeling is similar regardless of the injection site.\nIn our work, we resuspended the desired concentration (per mouse) of Hoechst, 70 kDa FITC-Dextran and A647-conjugated antibodies in 100–200 μL 1× PBS, and injected the full volume into the mouse.\nDetermine perfusion kinetics and begin imaging at a suitable time post-injection.\nNote: Hoechst labeling occurs immediately and is stable for several hours after injection. FITC-Dextran is a marker of vascular permeability and will diffuse across injured endothelium over time. If such kinetics are important for the research question, imaging should begin immediately after injection of the dye.\n(Optional) restricting blood flow to image parasite behavior within the confines of the vascular endothelium\nTiming: 1–10 min\nThe main aim of this step is to visualize T. brucei behavior within the vascular endothelium, without blood flow.\nTo visualize parasite behavior without blood flow, it is possible to block the blood flow within a specific vessel by surrounding the vessel or capillary of interest with sutures and tightening the sutures to completely or partially block blood flow.\nNote: While surgical clamps exist, if they are used, they should be specific for small animal surgeries. Larger clamps (eg. used for human surgeries) have the risk of resulting in severed vasculature or unsuccessful occlusion.\nImaging and finalizing the IVM procedure",
    "Timing: Variable depending on imaging time required, mouse survival, surgery success. Generally, minimum of 30 min, maximum 8 h\nAfter successfully performing the surgery and labeling steps of interest, position the mouse in the stage, and image as required, depending on the research question.\nFor maximum tissue coverage and quantification purposes, we recommend imaging at least 30 fields of view per tissue per mouse. To diminish possible quantification biases, we recommend these fields of view should be contiguous to one another, and a method for surveillance should be established in advance.\nFor time lapse imaging, suitable total time and time intervals should be established, that enable answering the question of interest.\nCritical: During imaging, the mouse will be alive and anesthetized. Care should be taken to ensure that the mouse remains fully anesthetized for the whole duration of the process. Care should be also taken to provide cardiac resuscitation in some instances.\nFor all terminal windows, if more than one surgery will be performed, as each respective imaging is finished, the surgical incision can be carefully closed using stitches.\nFor all terminal windows, once all surgeries are finished, euthanize the mouse using an anesthetic overdose and/or cervical dislocation while the mouse remains anesthetized.\nPlace mice cadavers in freezer or dispose according to institute regulations."
  ],
  "subjectAreas": [
    "Model Organisms",
    "Cell Biology",
    "Microbiology",
    "Microscopy"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}