{
  "id": 17248,
  "origin_website": "Jove",
  "title": "Visualization of Metabolites Identified in the Spatial Metabolome of Traditional Chinese Medicine Using DESI-MSI",
  "procedures": [
    "1. Sample preparation\nCollect cleaned roots and leaves from a 2-year-old Salvia miltiorrhiza plant (Figure 1A), and directly slice at a cross-sectional thickness of approximately 3-5 mm by hand. Then, stick the sample onto an adhesion microscope glass slide using double-sided tape (Figure 1B).\n\tNOTE: Ensure the size of the double-sided tape is bigger than the sample. If the tissues are dried, soak them in water or 4% paraformaldehyde overnight before slicing.\nPut another microscope glass slide above the sample and wrap the two glass slides with a sealing film like a sandwich (Figure 1C). Freeze the sandwich sample at -80 °C for at least 4 h, then subject it to an air vacuum for 2 h (Figure 1D) with the following setting parameters: trap temperature at -75 to -82 °C and vacuum gauge at 2.5 to 3.7 Pa.\n\tNOTE: Ensure the two glass slides are parallel when wrapping the sealing film to keep surface of the sample intact. If the plant tissues have a high moisture content, extend the time of air-vacuum to 3 h. Do not exceed 5 h, otherwise the tissues will easily fracture.\nStore the sandwich samples at -80 °C until analysis. Bring the samples to room temperature in a desiccator to avoid the condensation on the sample surface. Then, subject the sample to matrix application.\n2. Installation of desorption electrospray ionization (DESI) unit\nImplement detector setup and mass calibration of the instrument in ESI mode; carry out detector setup using Leucine Enkephalin (LE) in water-acetonitrile (1:1 v/v) solution and perform mass calibration with sodium formate (NaFA) in water-isopropanol (1:1 v/v) solution.",
    "Take the ESI source out and mount the DESI unit onto the mass spectrometer. Connect the N2 gas supply to the DESI unit and adjust the gas pressure to around 0.5 MPa (Figure 2A). There is no need to vent the instrument when exchanging sources.\nFill the 5 mL syringe with LE and formic acid in water-methanol (1:9 v/v) solution and attach the syringe to the high-performance syringe pump to provide solvent for ionization of the chemicals in the sample (Figure 2B).\nAttach a solvent providing capillary to the syringe and the DESI sprayer (Figure 2C). The solvent providing capillary is a standard 75 µm internal diameter and 375 µm outside diameter capillary; it is rather narrow and easily gets blocked by impurities, therefore solvents used in the scanning processes should be MS grade and filtered before usage to reduce the risk of blockage.\nStart the syringe pump and set the infuse rate at 2 µL/min to get a constant flow and spray of the solvent (Figure 2B). Turn off the N2 gas valve, then after about 15 s turn it on; a small drop of solvent will be blown out onto the stage, and spray can be seen if the solvent flow is in a constant state.\nAdjust the position of the sprayer in terms of the spray angle, XYZ axis, protrusion, and height (Figure 2D). Use red and black markers as references to optimize the mass spectrometry signal, to get a signal intensity above 1 x 105 in sensitivity mode (Figure 2E).",
    "Protrusion of the sprayer is the most significant factor that affects the signal intensity; adjust the protrusion by changing the N2 gas guard with a 5 mm wrench. Spray direction influences the quality of the mass image; rotate the sprayer until the spray is straight. Once the protrusion is adjusted to the best signal intensity position, try not to change it when exchanging sources.\nAfter all the steps above, the setup is ready for experiments, and the setup is normally stable for >3 weeks of usability, observed after the initial setup.\n3. DESI-MS image acquisition\nFor DESI-MSI, perform no sample pretreatment. For samples that already have pretreatment, minimize the pretreatment steps as much as possible. For instance, some samples can only be made with mounting media, so remove the excess media on the slides if possible.\nTake an image of the sample on the slide (Figure 3A). Do not touch the surface of the sample to avoid any impurity take-in.\nPlace the slide on the plate position on the DESI stage. The stage has two plate positions, A and B; it is important to remember the right position. Use standard slides (75 mm x 25 mm) or a full slide, otherwise the slide will not fit in the position and cannot be stably held. A full slide (120 mm x 80mm) can accommodate up to four slides, and thus has a much larger area for experiments.\nOpen the high-definition mass image processing software, set a new plate in the Acquire tab, and select the right plate position (A or B) and the plate type. On the image-select page, select the four corners of the slide, then the image is auto-adjusted to the correct orientation (Figure 3A).",
    "Set the MS parameters; the commonly used experiment type is DESI-MS mode, in which only the parent ion will be detected. The instrument can use only one polarity in one experiment; therefore, select the polarity as positive or negative. To get more information on chemicals in small amounts, apply the sensitivity mode (Figure 3B).\nDraw a rectangle to define the scanning area in the Pattern tab and set the pixel size. Generally, for DESI-MS mode, keep the X and Y sizes of the pixel equal. Set the scanning rate to no more than 5x the pixel size (Figure 3C).\nSave the project and export a worksheet for the mass spectrometry acquisition software.\nOpen the mass spectrometry acquisition software, import the worksheet, and save it as a new sample list. Press Start Run to begin the MSI scanning. Multiple images can be added to the experiment queue by importing more worksheets.\n4. Processing DESI-MSI data and visualization\nLoad the data file of the sample into the mass image processing software and set the parameters for DESI image processing (Figure 3D). As Leucine Enkephalin was used for internal lock mass, and the lock mass is the only point to identify the polarity of the experiment, it is of great importance to set the correct lock mass. Set the following values: for positive mode: 556.2772; for negative mode: 554.2620.\nIt is possible to build a list of target chemicals, in which case the processing result will focus on the chemicals in the target list. Load the processed data file to visualize the DESI image of the sample. Click the \"Normalization\" button to normalize the data by total ion chromatography (TIC) to get the relative intensity of a specific chemical to the reference, then different samples can be compared with each other (Figure 3E).",
    "Draw a region of interest (ROI) and copy several copies on the sample image; ROIs can be made across different images. Select all the ROIs and export multi-variate analysis (MVA) to extract MS information from all ROIs for MVA (Figure 3F).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}