{
  "id": 19769,
  "origin_website": "Wiley",
  "title": "Isolation of Genomic DNA from Mammalian Cells and Fixed Tissue",
  "procedures": [
    "Most commercially available extraction kits can be used to extract DNA from multiple types of human samples, such as blood, tissue, and cultured cells. In addition, there are kits that are designed to handle varying amounts of starting material. The yield of DNA is mainly dictated by the amount and type of starting material used as input for the extraction process. The main components of the extraction kits and their purposes are described. It is crucial to follow the specific instructions that come with each kit. Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.818#cpz1818-prot-0001] describes the extraction of DNA from human blood, tissue, or cultured cells using a column-based kit such as the QIAamp DNA Blood Mini Kit or the DNeasy Blood and Tissue Kit. Though far from an exhaustive list, Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.818#cpz1818-tbl-0001] provides information about most of the commonly used DNA extraction kits in research laboratories.\nTable 1.\n                Commercial Kits Available to Extract DNA from Blood, Cells, or Tissue\ntable:\n﻿Kit name,Manufacturer,Starting material(s),# preps,Starting vol (µl) or amt (mg),Yield (µg),Special notes\nDNeasy Blood & Tissue Kit,Qiagen,\"Cells, blood, or tissue\",\"50, 250\",\"2 × 106 cells, 100 µl blood, 25 mg tissue\",3-30,\nQIAwave DNA Blood & Tissue Kit,Qiagen,\"Cells, blood, or tissue\",250,\"2 × 106 cells, 100 µl blood, 25 mg tissue\",3-30,Eco-friendly reagents\nQIAamp DNA Blood Mini Kit,Qiagen,\"Cells, blood, or tissue\",\"50, 250\",\"1 × 106 cells, 25 mg tissue, 200 µl blood\",4-50,\nMonarch Genomic DNA Purification Kit,NEB,\"Cells, blood, or tissue\",\"50, 150\",\"Up to 5 × 106 cells, 100 µl blood, 25 mg tissue, buccal swabs, 500 µl saliva\",2.5-9,\"Works on fatty, fibrous tissue\"\nMonarch HMW DNA Extraction Kit for Cells and Blood,NEB,Cells or blood,\"5, 50\",\"Up to 10 × 106 cells, 2 ml blood\",125,Best for long-range seq applications\nMonarch HMW DNA Extraction Kit for Tissue,NEB,Tissue,\"5, 50\",10-25 mg,60,Best for long-range seq applications",
    "DNAzol Reagent,ThermoFisher,\"Cells, blood, or tissue\",100,\"1-3 × 107 cells, 100 µl blood, 25-50 mg tissue\",25-250,10-30 min protocol\nPureLink Genomic DNA Mini Kit,ThermoFisher,\"Cells, blood, or tissue\",50,\"Up to 5 × 106 cells, 1 ml blood, 25 mg tissue, buccal swabs, 500 µl saliva\",3-30,\nQuick-DNA Miniprep Plus Kit,Zymo,\"Cells, blood, or tissue\",\"10, 200\",\"1 × 106 cells, 1 mg tissue, 100 µl blood\",1-7,\"20 min protocol, low elution volume\"\nGenElute Blood Genomic DNA Kit,Millipore Sigma,Blood,\"70, 350\",200 µl,10,\nGenElute Mammalian Genomic DNA Miniprep Kit,Millipore Sigma,Cells or tissue,\"10, 350\",\"2 × 106 cells, 25 mg tissue\",25-30,\nMaterials\nWhole blood, cultured cells, or human tissue (fresh or frozen and thawed)\nDNA extraction kit containing:\n               \nLysis buffer\nProteinase K digestion enzyme\nWash buffer(s)\nElution buffer\nWater bath\nAdditional reagents and equipment for quantitation of DNA by absorption spectroscopy (Gallagher & Desjardins, 2007[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.818#cpz1818-bib-0002])\n1. Add a mixture of lysis buffer and proteinase K enzyme to an aliquot of whole blood, cultured cells, or tissue. The lysis buffer contains detergents that will disrupt cellular and nuclear membranes, releasing the cell contents, including the DNA from the nuclei. Incubate the sample at 56°C for a length of time required to digest the proteins in the sample.\nThe length of the incubation depends on the sample; most human tissue samples will likely require an overnight incubation to achieve complete digestion.\n2. After digestion, add the cell lysate mixture to a resin-containing column. The resin in the column is positively charged, allowing the negatively charged DNA to bind to the resin. The remaining biomolecules and debris will flow through the column when it is centrifuged.\nSome kits make use of magnetic beads to capture the DNA. This procedure would require a magnetic plate to bind the beads during the subsequent wash steps.",
    "3. Wash the column with the wash buffers that contain ethanol and various salts to wash away any contaminants or unwanted biomolecules that may have bound to the column.\nAfter the final wash, spin the column for an extra-long spin (e.g., 3 min instead of 1 min) to be sure any residual wash buffer is removed and the ethanol has been dried, as it could interfere with downstream applications.\n4. Elute the DNA from the resin in the column by adding an elution buffer in which the DNA is highly soluble.\nDNA may be stored for several years at 4°C if storage vials are tightly sealed. For long-term storage, DNA can be frozen at −20°C or −80°C, though DNA degradation could occur if the DNA is subjected to many freeze-thaw cycles.\n5. Quantify DNA concentration using UV or fluorescence absorption spectroscopy. Taking a measurement at 260 and 280 nm and comparing the ratio of these numbers (260/280) will give you an indication of the quality of the DNA as well.\nDNA can also be run out on an agarose gel at this point to confirm the presence of high molecular weight fragments and minimal degradation.",
    "Many of the extraction kits and protocols can be modified or run using automated machines. Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.818#cpz1818-tbl-0002] lists many of the commonly used automated machines that are available for use in research labs. Of note, these machines are generally quite expensive to purchase and require service contracts for preventative maintenance. It might only be a cost-effective choice for labs that routinely extract DNA from hundreds or thousands of samples per year. This Alternate Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.818#cpz1818-prot-0002] describes extraction using a QIASymphony machine.\nTable 2.\n                Automated Systems for DNA Extraction\ntable:\n﻿Machine name,Manufacturer,Special notes,Associated extraction kits\nQIAcube Connect,Qiagen,\"Spin-column based, 12 samples at a time\",QIAamp DNA Mini QIAcube Kit\nQIAcube Connect HT,Qiagen,96 samples at a time,QIAamp 96 DNA QIAcube HT Kit\nQIASymphony,Qiagen,24 samples at a time; load up to 4 batches,QIAsymphony DSP DNA Mini/Midi\nKingFisher Duo Prime,ThermoFisher,12 samples at a time; load up to 2 batches,MagMAX DNA Multi-Sample Ultra Kit\nKingFisher Flex,ThermoFisher,24 or 96 samples at a time,MagMAX DNA Multi-Sample Ultra Kit\nepMotion 5073,Eppendorf,24 samples at a time,\"NucleoMag DNA Blood, Tissue; other companies' kits\"\nepMotion 5075,Eppendorf,96 samples at a time,\"NucleoMag DNA Blood, Tissue; other companies' kits\"\nMaxwell RSC,Promega,16 samples at a time; includes quantification capability,\"Maxwell RSC Blood DNA Kit, Tissue DNA Kit\"\nMaxwell RSC 48,Promega,48 samples at a time; includes quantification capability,\"Maxwell RSC Blood DNA Kit, Tissue DNA Kit\"\nChemagic Prepito Instrument,PerkinElmer,12 samples at a time,\"Prepito DNA Blood Kit, Tissue Kit\"\nMaterials\nWhole blood (fresh or frozen and thawed)\nReagent cartridge containing all lysis, wash, and elution buffers\nPipet tips compatible with extraction machine\nTubes for final elution\nWater bath\nAdditional reagents and equipment for quantitation of DNA by absorption spectroscopy (Gallagher & Desjardins, 2007[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.818#cpz1818-bib-0002])\n1. Thaw blood quickly in 37°C water bath or aliquot appropriate volume of blood as specified in the machine and kit manual of choice.",
    "Most extractions machines also have kits available for extraction of DNA from cell pellets and tissues as well. These may require some upstream processing to prepare for the lysis step before loading onto the machine.\n2. Load the samples, pipet tips, the reagent cartridge, and tubes for elution into the extraction machine.\n3. Choose the appropriate extraction protocol for the appropriate sample type and volume, then run the extraction procedure.\nAs an example, to extract DNA from 24 1-ml aliquots of whole blood, the QIASymphony machine takes about 1.5 hr to run, and other batches can be immediately loaded on the machine as soon as the first run has finished.\n4. Run any clean up or maintenance procedures as necessary on the machine.\nIt is also important to keep up with preventative maintenance and calibration of the machine as covered by the service contract.\n5. Quantify DNA concentration using UV or fluorescence absorption spectroscopy.",
    "Saliva and oral/buccal samples (cheek swabs and brushes) have become increasingly valuable sources of genetic material for clinical applications due to ease of access (non-invasive sample collection), as well as convenient storage and transport procedures that result in adequate DNA yield and quality for genetic studies. Multiple reports indicate that saliva samples provide better quality DNA than buccal samples (Rethmeyer et al., 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.818#cpz1818-bib-0006]; Rogers et al., 2007[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.818#cpz1818-bib-0007]). Saliva-derived DNA is now a common alternative to blood-derived DNA, and there are several commercially available saliva collection kits that act to stabilize the samples at ambient temperatures for extended periods prior to DNA extraction. Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.818#cpz1818-prot-0003] describes the extraction of DNA from saliva collected using the Oragene-DX Saliva Collection Kit. Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.818#cpz1818-tbl-0003] provides information about additional saliva and buccal swab sample collection and DNA extraction kits.\nTable 3.\n                Commercial Kits Available for Extraction of Buccal and Saliva Samples\ntable:\n﻿Kit name,Manufacturer,Starting material(s),# preps,Starting vol (µl) or amt (mg),Yield (µg),Special notes\nMonarch Genomic DNA Purification Kit,NEB,\"Saliva, buccal\",\"50, 150\",500 µl,Varies,\nPrepIT-L2P-5,DNA Genotek Inc.,Saliva,200,0.5-2.0 ml,Varies,\nSaliva DNA Isolation kit,BioChain Inst. Inc.,Saliva,,50-200 µl,0.25-4.0,\nGeneFix Saliva-prep DNA Isolation kit,Diagnostica Longwood,Saliva,\"12, 50\",0.5-2 ml,Up to 100,\nSaliva DNA Isolation kit,Norgen Biotek Corp.,Saliva,50,0.25-0.5 ml,3-7,\nChargeSwitch gDNA Buccal Cell Kit,ThermoFisher,Buccal swabs,\"50, 960\",1 swab,6,\nGenElute Mammalian Genomic DNA Miniprep Kit,MilliporeSigma,Buccal swabs,\"10, 70, 350\",1 swab,Varies,\nBuccalyse DNA Isolation Kit,Boca Scientific Inc.,Buccal swabs,\"3, 50\",1 swab,2-4,No centrifugation required\nBuccalFix Plus DNA Isolation Kit,Boca Scientific Inc.,Buccal swabs,50,1 swab,Varies,Precipitation-based with buccal swabs already stored in BuccalFix buffer\nBuccal-Prep Plus DNA Isolation Kit,Boca Scientific Inc.,Buccal swabs,\"3, 50\",1 swab,Varies,Precipation-based with all buffers included\nHigherPurity Buccal Swab Genomic DNA Extraction Kit,Canvax,Buccal swabs,\"20, 50, 250\",1 swab,0.3-3,\nQIAmp DNA Mini Kit,Qiagen,\"Saliva, buccal\",50,1 swab,Varies,\nMaterials\nSaliva, 0.5 to 2 ml\n1.5-ml microcentrifuge tubes, sterile and nuclease-free\nOragene-DX saliva collection kit (DNA Genotek, cat. no. OGR-600)",
    "Saliva samples can be exposed to a wide range of temperatures during collection and transport (−20°C to 50°C) and can be stored at room temperature (15 to 25°C) for up to a year before extraction of DNA.\nPrepIT-L2P DNA extraction kit (DNA Genotek, cat. no. PT-L2P)\nEthanol, 100% (200 proof)\nEthanol, 70%\nTE buffer, nuclease-free\nWater bath\nIce bucket\nVortex\nAdditional reagents and equipment for quantitation of DNA by absorption spectroscopy (Gallagher & Desjardins, 2007[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.818#cpz1818-bib-0002])\n1. Mix saliva sample (invert and gently shake) in the Oragene-DX saliva collection tube for a few seconds.\n2. Incubate the sample at 50°C for a minimum of 2 hr, or overnight if it is more convenient.\nHeat treatment is required to ensure that DNA is adequately released, and nucleases permanently inactivated. At this stage, the sample can be stored at room temperature or frozen (−20°C) for up to 1 year.\n3. Invert the saliva sample 10 times, then transfer 500 μl of mixed sample to a sterile 1.5-ml micro-centrifuge tube.\n4. Add 20 μl prep-IT-L2P to the tube and vortex 10 sec.\nSample will become turbid as impurities and inhibitors are precipitated.\n5. Incubate on ice for 10 min.\n6. Centrifuge 10 min at 15,000 × g, room temperature.\n7. Carefully transfer 500 μl of the supernatant to a new microcentrifuge tube.\nPellet may be accidentally disturbed during transfer. If so re-centrifuge tube for 5 min at 15,000 × g, room temperature before attempting to repeat supernatant transfer step.\n8. Add 600 μl of 100% ethanol (200 proof) to the tube and gently invert 10 times.\nThe DNA may appear as a clot of DNA fibers, or as a fine precipitate, depending on amount of DNA in the sample. DNA will still be recovered even if no clot is visible.",
    "9. Incubate the sample for 10 min at room temperature.\nAllows DNA to fully precipitate.\n10. Centrifuge 2 min at 15,000 × g, room temperature. with hinge portion of micro-centrifuge tube pointing out from center of rotor.\nIf DNA pellet position cannot be seen after centrifugation, it will be located on the wall of the tube below hinge.\n11. Carefully remove the supernatant by pipetting; discard supernatant.\n12. Add 250 μl of 70% ethanol.\n13. Incubate the sample for 1 min at room temperature.\nIf pellet becomes detached, re-centrifuge for 5 min at 15,000 × g, room temperature.\n14. Pulse-spin the tube and remove any residual ethanol with 200 μl pipettor.\nRemoval of all ethanol from the tube is important as ethanol carryover may impact downstream assays. If available, the tubes can be run in a vacuum centrifuge for 1 to 2 min to ensure all ethanol is removed.\n15. Add 50 μl TE buffer, vortex for 15 sec to dissolve DNA pellet.\n16. Incubate overnight at room temperature or incubate sample at 50°C for 1 hr, vortexing every 15 min.\n17. Give sample tube a final vortex and store DNA at −20°C or −80°C for long term storage.\n18. Quantify DNA concentration using UV or fluorescence absorption spectroscopy.",
    "There is a potential wealth of information present in tissue samples taken from patients. Almost all tissues biopsied or surgically removed due to a condition or disease involve pathological testing. The most common pathological analysis of tissues involves fixation with formalin followed by embedding the fixed material in a paraffin block. Thin slices of the block can then be made and mounted on slides for staining and examination by a pathologist. Over the last one or 2 decades, there has been a great deal of interest in examining the sequence of the DNA present in these human tissue samples. However, purification of DNA from formalin-fixed, paraffin-embedded (FFPE) tissue presents several challenges. To purify the DNA, the paraffin must be removed from the sample by volatile chemicals such as xylene. When the tissue is fixed in formalin it creates tangled crosslinked structures of proteins and DNA in the cells of the tissue. It can be difficult to achieve adequate digestion of cellular proteins to purify the DNA. In addition, the resulting DNA that can be isolated consists of short fragments that are not suitable for some applications, such as long-range sequencing. Library preparation techniques have been developed using the polymerase chain reaction (PCR) to amplify short regions of this DNA for use in some next-generation sequencing protocols. Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.818#cpz1818-prot-0004] describes the extraction of DNA from FFPE tissue using the QIAamp DSP DNA FFPE Tissue Kit. Table 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.818#cpz1818-tbl-0004] provides information about other common commercially available DNA extraction kits for FFPE tissue. Kresse et al. (2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.818#cpz1818-bib-0004]) compared several FFPE DNA extraction kits and found that most produced comparable sequencing libraries and sequencing data.\nTable 4.\n                Commercial Kits Available for Extraction from Formalin-Fixed Paraffin Embedded Tissue\ntable:\n﻿Kit name,Manufacturer,Section thickness (µm),# of sections,# preps,Yield (µg),Special notes",
    "Ion AmpliSeq Direct FFPE DNA Kit,ThermoFisher,5-10,1,\"8, 96\",Varies,Used in conjunction with library prep kit\nRecoverAll Total Nucleic Acid Isolation Kit for FFPE,ThermoFisher,20,4,40,24,\nMagMAX FFPE DNA/RNA Ultra Kit,ThermoFisher,20,2,20,Varies,Can be automated\nPureLink Genomic DNA Mini Kit,ThermoFisher,5-15,1-8,\"50, 250\",Varies,\nQIAamp DNA FFPE Tissue Kit,Qiagen,10,3-8,50,Varies,Can be automated\nEX-WAX Paraffin-embedded DNA Extraction Kit,Millipore Sigma,5,3-5,20,Varies,\nNucleoMag DNA FFPE Extraction Kit,Takara/Macherey-Nagel,3-20,3-10,\"96, 384\",Varies,High throughput\nMaxwell FFPE Plus DNA Kit,Promega,5-10,4-10,48,Varies,Used with Maxwell instrument\nPrepito FFPE Kit,PerkinElmer,10,4,1-12,Varies,Used with chemagic Prepito instrument\nCAUTION: Chemical substances such as xylene should be used in chemical fume hood and proper chemical waste disposal procedures.\nMaterials\nFFPE blocks of tissue, cut into sections ∼5 μm thick\n               \nThe sections can be mounted (unstained) onto glass slides for ease of transport, or formed into curls or scrolls and put into microcentrifuge tubes. Alternatively, a pellet or section can be punched from the block (∼2 mm wide × 3 to 5 mm deep) and then flattened into a thin section using a mortar and pestle. Using a piece of weigh paper in the pestle (under the pellet) helps with transporting the flattened sample into a microcentrifuge tube.\nScalpel, sterile and disposable\nMicrocentrifuge tubes, sterile and nuclease-free\nDNA extraction kit compatable with FFPE tissue, containing digestion buffer, wash buffers, elution buffer, and spin columns\nXylene\nEthanol, 100% (200 proof)\nFume hood\nVortex\nWater bath or heat block\nAdditional reagents and equipment for quantitation of DNA (Gallagher & Desjardins, 2007[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.818#cpz1818-bib-0002])\n1. Scrape the tissue from the slides using a sterile scalpel, or transfer the scroll or flattened pellet/section to a sterile 1.5-ml microcentrifuge tube.\n2. Add 1 ml xylene to the sample.\nAll steps using xylene must be performed in a safety fume hood.\n3. Pulse-vortex to remove paraffin from the tissue.\nUsually requires 10 to 25 sec, depending on the amount of paraffin.",
    "4. Centrifuge sample for 2 minutes at maximum speed, room temperature. Remove supernatant carefully with pipette, leaving pellet in the tube.\nXylene waste should be disposed in a designated hazardous waste bottle.\n5. Add 1 ml 100% ethanol (200 proof) to sample, pulse vortex 10 sec, and remove supernatant by pipetting.\n6. Re-spin tube briefly to bring down residual ethanol and remove it by pipetting.\n7. Leave sample pellet to air-dry at room temperature.\nSafety fume hood is no longer required for the remaining steps.\n8. Add 180 μl Buffer ATL (digestion buffer) and 20 μl proteinase K solution, vortex for 15 sec. Incubate mixture for 1 hr at 56°C.\nVortex 2 to 3 times per hour during incubation period to disperse the sample. No residual particles should be visible at end of incubation. It may be possible to increase the yield by allowing the digestion to go for as long as 7 days with a daily spike-in of 50 to 100 μl fresh Buffer ATL/proteinase K mixture.\n9. Incubate sample for 1 hr at 90°C.\n10. Pulse-centrifuge the tube to remove drops of liquid from inside the lid.\n11. Add 200 μl Buffer AL, vortex for 15 sec.\n12. Add 200 μl 100% ethanol (200 proof).\n13. Vortex 15 sec and repeat step 10.\n14. Apply mixture carefully to a QIAamp spin column in a 2-ml collection tube, without wetting the rim.\n15. Close cap of spin column and centrifuge 1 min at 6000 × g, room temperature.\n16. Transfer spin column to a new collection tube and discard the tube containing the filtrate.\n17. Add 500 μl Buffer AW2 to the spin column.\n18. Close the cap and centrifuge for 1 min at 6000 × g, room temperature.\n19. Repeat step 16.",
    "20. Close the cap of the spin column and centrifuge for 2 min at max speed (approximately 20,000 × g), at room temperature.\nEnsure all buffer is removed from the column as any ethanol present can interfere with downstream applications.\n21. Transfer spin column to a 1.5-ml microcentrifuge tube and discard the collection tube containing the filtrate.\n22. Add 200 μl Buffer ATE to spin column and incubate sample for 5 min at room temperature.\n23. Centrifuge for 1 min at max speed (approximately 20,000 × g), room temperature.\n24. Quantify DNA concentration using UV or fluorescence absorption spectroscopy.\nStore eluate containing DNA at 4°C. For long-term storage, store DNA at −20°C or −80°C."
  ],
  "subjectAreas": [
    "Human Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}