{
  "id": 5272,
  "origin_website": "Bio",
  "title": "DNA Damage Induction by Laser Microirradiation",
  "procedures": [
    "Seed 4-9 x 104 U2OS cells/ml in a 35 mm µ-Grid dish (Ibidi) 2-3 days before starting the microirradiation experiment. Use dishes with Grid to relocate cells after microirradiation and immunofluorescence staining.Optional: transfect cells with plasmid encoding a fluorescently tagged protein of interest 24-48 h before microirradiation experiment. In our hands jetPEI gives good transfection efficiencies in U2OS cells.Sensitization of cells for DNA damage induction by laser micorirradiationBrdU sensitization: incubate cells in medium containing 10 µM BrdU for at least 24 h prior to microirradiation experiment. BrdU is an analog of thymidine, which gets incorporated into DNA during DNA replication and upon irradiation with the 405 nm laser will lead to induction of DNA damage through, e.g., radical formation.Hoechst sensitization: incubate cells in medium containing 10 µg/ml Hoechst for 10 min prior to microirradiation experiment. Hoechst is a cell permeable DNA dye that binds to the minor groove of DNA. As Hoechst is excited by UV light, localized microirradiation with a 405 nm laser will generate DNA damage. Use either Hoechst or BrdU for sensitization.Add prewarmed, CO2 adjusted live cell medium supplemented with 10% FBS and antibiotics without phenol-red to cells to minimize autofluorescence.DNA damage induction followed by live cell imaging (Figure 1)Spot irradiation: For DNA damage induction in live cells expressing a fluorescently tagged protein of interest irradiate a diffraction-limited spot within the nucleus with a 405 nm diode laser (Xie et al., 2015) (405 nm laser set to 70%, 1 iteration, zoom 5, pixel dwell time 177.32 µs).Line irradiation: For DNA damage induction in live cells expressing a fluorescently tagged protein of interest irradiate a stripe of 5-pixel width with a 405 nm diode laser (Xie et al., 2015) (405 nm laser set to 24%, 1 iteration, zoom 5, pixel dwell time 12.61 µs).",
    "Live cell imaging: Before and after microirradiation record confocal image series of one mid z-section at 2 sec time interval (typically 6 pre-irradiation and 60 post-irradiation frames, frame size of 512 x 512 pixels, pixel size of 90 nm), using the laser line according to the excitation spectrum of the chosen reporter protein (e.g., 488 nm Ar laser for GFP/tagged Timeless)DNA damage induction followed by immunofluorescence staining Laser microirradiation: Use the FRAP module of the ZEN software (line scan, 405 nm laser set to 92%, 50 iterations) or the tile scan mode (Xie et al., 2015; Baldeyron et al., 2011) (3 x 3 tiles, image size 128 x 128, scan speed 177.32 µs, every 7th line scanned, 405 nm laser set to 30%). Fixation and immunofluorescence:Fix cells in 4% formaldehyde for 10 min after different repair times.1 x wash in PBSPermeabilize with 0.5% Triton X-100 in PBS for 5 min1 x wash in PBSIncubate in blocking solution for 40 min1 x wash in PBSAdd primary antibody, e.g., Mouse-anti-γH2AX diluted in blocking buffer and incubate overnight at 4 °C.3 x wash in PBST for 5 minAdd secondary antibody, e.g., Donkey anti-Mouse IgG (H+L) secondary antibody, Alexa Fluor® 488 diluted in 4% BSA/PBS and incubate for 1 h at RT3 x wash in PBST for 5 minAdd fresh PBS and store at 4 °CNote: The intensity of the 405 nm laser may vary between different microscopes. Therefore optimal laser settings have to be determined first, e.g., varying the laser intensity followed by staining with DNA damage markers like γH2AX, PAR or thymine dimers. Settings that induce clear stripes of, e.g., γH2AX should be used, whereas pan-nuclear staining indicates that the used laser intensity is too high.",
    "Sensitization methods can also be varied depending on what kind of DNA repair pathway should be analysed, e.g., single strand break repair versus double strand break repair."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}