{
  "id": 19537,
  "origin_website": "Jove",
  "title": "Immunolabeling and Counting Ribbon Synapses in Young Adult and Aged Gerbil Cochleae",
  "procedures": [
    "All protocols and procedures were approved by the relevant authorities of Lower Saxony, Germany, with permit numbers AZ 33.19-42502-04-15/1828 and 33.19-42502-04-15/1990. This protocol is for Mongolian gerbils (M. unguiculatus) of both sexes. Young adult refers to the age of 3-12 months, while gerbils are considered aged at 36 months and older. When not stated otherwise, buffers and solutions can be prepared and stored in the fridge for up to several months (4-8 °C). Before use, ensure that the buffers and solutions have not precipitated.\n1. Fixation and organ collection\nNOTE: If only the cochleae are needed, it is recommended to carry out the somewhat simpler procedure of fixation by immersion. However, if a well-preserved brain is also needed, then transcardial perfusion is the only option. The fixative in both cases is 4% paraformaldehyde (PFA) in phosphate-buffered saline (PBS). This should be freshly made but can be stored frozen until use. Use aliquots of ~300 mL for a transcardial perfusion or ~50-100 mL per cochlea for fixation by immersion.\nCAUTION: PFA is a hazardous substance; handle it according to general lab safety procedures.\nFixation by transcardial perfusion\n\t\nFlush the perfusion setup until the tubing is clear of any air bubbles. Fill the perfusion tubing with PBS containing heparin (0.2 mL in 100 mL of PBS) to prevent blood clotting. Stop the flow once the tubing is filled with PBS and the fluid storage bottle has just emptied; pour 200 mL of thawed PFA into it.\n\t\tNOTE: The setup is now ready for the animal. The remaining PBS in the tubing is sufficient to flush out the blood and will automatically be followed by the fixative once the flow is resumed.",
    "Ensure that a waste collection system is in place for the outflow of PFA. Use a fresh cannula (19 G) and have large scissors, forceps (with a flattened tip), hemostats, scalpel or sharp cannula, and a rubber mat with pins handy.\nEuthanize the gerbil with an intraperitoneal overdose of pentobarbital (160 mg/mL, 0.3 mL per animal, body weight range: 50-120 g). Put the animal back into its cage. When respiratory arrest sets in such that the breathing becomes irregular with intervals of 30 s or longer, place the gerbil on its back on the rubber mat and fix both fore-paws and one hind-paw with pins (leave one hind-paw free to move for better judgment of perfusion success; see note after step 1.1.7).\nTo open the thoracic cavity, lift the skin above the sternum with forceps and cut the skin approximately 0.5 cm below the sternum with scissors until the white-colored processus xiphoideus is visible. Hold the sternum at the processus xiphoideus with forceps and cut along the diaphragm to get a good view into the thoracic cavity. Cut the ribs laterally on both sides until there is good access to the heart. Ensure that the angle of the scissors is parallel and flat in relation to the body of the gerbil to avoid damage to organs and, thus, ensure a closed circulatory system.\nClamp a hemostat onto the sternum, lift the ribcage, and place the hemostat over the shoulder of the gerbil without resting the hemostat on any body parts to avoid blocking blood flow.",
    "Open the fluid flow slightly until one drop of PBS flows out of the cannula (19 G) approximately every 2 s. Hold the heart with forceps and turn it a bit to the left such that the left ventricle can be clearly seen. Insert the cannula into the left ventricle at an angle that avoids penetrating the septum. Hold the needle in place either by hand or with another hemostat.\n\t\tNOTE: The left and right ventricles can be differentiated by their different color hues; the left ventricle appears lighter in color than the rest of the heart tissue.\nSlowly increase the pressure of the fluid flow and open the right atrium either with fine scissors, a scalpel, or another cannula. Open the fluid flow further until approximately 2-3 drops/s are observed at the drip chamber, or set a flow of 4 mL/min for the pump. Once fixation of the heart sets in, ensure that the perfusion cannula stays in place without being held any further.\n\t\tNOTE: Signs of successful perfusion are slow muscle contractions, stiffening of the neck and extremities, the liver going pale, and rosy lungs. The sign of unsuccessful perfusion is whitening of the lungs, which indicates that the pulmonary circulation is perfused due to puncture of the septum.\nIn case of unsuccessful perfusion, try to move the cannula further up, into the aorta, and clamp it in place with a hemostat.\nDecapitate the gerbil. Remove the bullae and cut and break away its bone as described in step 1.2.2.\n\t\tNOTE: If the tissue is not sufficiently fixed, the sensory epithelium will dislodge from the organ of Corti during the dissection.",
    "If the perfusion shows no signs of fixation within 5-10 min, abort it and immediately follow the procedure below for fixation by immersion. For that, treat the cochlea as in step 1.2.2 and postfix the tissue in approximately 50-80 mL of 4% PFA in screw cap containers for 1-2 days on a 2D-shaker at 8 °C.\n\t\tNOTE: Since it can be difficult to ultimately rate the quality of fixation during perfusion, it is recommended to routinely postfix the cochleae as described.\nFixation by tissue immersion\n\t\nEuthanize the gerbils with an intraperitoneal overdose of pentobarbital (160 mg/mL, 0.3 mL per animal, body weight range: 50-120 g). When the gerbil has stopped breathing, decapitate the animal.\nRemove the bullae and cut and break away its bone with scissors and forceps, respectively, to reach the cochleae. Remove the maellus, incus, and semicircular canals. Make small holes at the apex and in the basal turn by carefully scratching over the cochlear bone with forceps. Immediately transfer the bullae into an excess of cold fixative (at least 50 mL) and fix the tissue in the cold (4-8 °C) under gentle agitation (2D-shaker [100 rpm]) for 2 days.\n\t\t​NOTE: After fixing the tissue, the cochleae can either be processed immediately or stored in PBS with 0.05% sodium azide. CAUTION: Sodium azide is toxic. Note that the length of storage may negatively influence the quality of the staining. Limited trials have suggested that the immunostaining appeared weaker after 2 years of storing the tissue in sodium azide.\n2. Tissue preparation and immunolabeling",
    "Dissolve ethylenediaminetetraacetic acid (EDTA) powder in PBS to produce a 0.5 M solution at pH 8. For this, place a beaker onto a magnetic stirrer, fill it with approximately half of the total amount of the PBS, and add the appropriate amount of EDTA powder, resulting in an acidic suspension. Carefully add concentrated sodium hydroxide solution (NaOH) while monitoring the pH with a pH meter. Fill up with PBS to the desired final volume and filter the solution to prevent microbial contamination.\n\tNOTE: The EDTA powder will only completely dissolve once the suspension has reached a neutral pH value.\nFor decalcification, transfer the cochleae to 80 mL of 0.5 M EDTA in PBS. Incubate the tissue in the cold (4-8 °C) under gentle agitation on the 2D-shaker (100 rpm) for 2 days.\n\tNOTE: After the decalcification step, the tissue can be stored in PBS for several days up to 3 weeks before continuing with the remaining processing steps. For antibodies that label the stria vascularis, it is advisable to cut the cochleae in half along the modiolar axis at this point (i.e., prior to immunostaining) to ensure uniform access of antibodies to their respective targets. This is antibody-dependent and does not apply to the antibodies used here to label synaptic structures and IHCs. Use a piece of breakable razorblade and a blade holder (as described in step 4.2) for the cutting.",
    "Perform the following steps (up to step 3.2) in 2 mL safe-seal reaction tubes. If the tissue piece is too large to fit inside the tube, trim the excess tissue with scissors. To improve penetration of the antibodies, first permeabilize the tissue in 1 mL of 1% triton (Triton X-100) in PBS on the 2D-shaker (100 rpm) at room temperature for 1 h. Wash the tissue 3x with 1 mL of 0.2% triton (Triton X-100) in PBS on the 2D-shaker (100 rpm) at room temperature for 5 min each.\nTo block nonspecific antigens, incubate the cochleae in 1 mL of blocking solution (3% bovine serum albumin [BSA], 0.2% triton, in PBS) on the 2D-shaker (100 rpm) at room temperature for 1 h.\n\tNOTE: The blocking solution can be prepared in advance but should not be older than ~10 days.\nDilute the following primary antibodies freshly in the same aliquot of blocking solution: anti-myoVIIa (myosin VIIa) to label IHCs (IgG polyclonal rabbit), diluted 1:400; anti-CtBP2 (C-terminal binding protein 2) to label presynaptic ribbons (IgG1 monoclonal mouse), diluted 1:400; and anti-GluA2 to label postsynaptic receptor patches (IgG2a monoclonal mouse), diluted 1:200. Make sure that the cochleae are fully covered with the antibody solution (typically 0.4 mL) and incubate them at 37 °C for 24 h.",
    "Next, wash the tissue 5x with 0.2% triton in PBS on the 2D-shaker (100 rpm) at room temperature for 5 min each. Choose secondary antibodies to match the host species of their primary counterparts and again freshly dilute them in 3% BSA, 0.2% triton, in PBS: goat anti-mouse (IgG1)-Alexa fluorophore (AF) 488, diluted 1:1,000; goat anti-mouse (IgG2a)-AF568, diluted 1:500; and donkey anti-rabbit-AF647 (IgG), diluted 1:1,000. Wrap the tube in aluminum foil to prevent bleaching of the fluorescence. Incubate the cochleae in 0.4 mL of secondary-antibody solution at 37 °C for 24 h.\n\tNOTE: Limited trials have indicated that incubation of cochlear tissue at 37 °C for 24 h with primary and secondary antibodies resulted in brighter immunostaining than following the more common incubation procedure with lower temperatures and shorter durations.\nWash the cochleae 2x with 1 mL of 0.2% triton in PBS for 5 min each and 3x with PBS for 5 min each on the 2D-shaker (100 rpm) at room temperature.\n\t​NOTE: After these washing steps, the cochleae can remain in PBS in the fridge at ~4 °C for several days.\n3. Treatment with autofluorescence quencher (optional)\nNOTE: Cochleae from middle-aged and aged gerbils show extensive background autofluorescence. In young adult tissue, treatment with an autofluorescence quencher is not necessary. It is, in principle, possible to apply the autofluorescence quencher before the immunostaining procedure, which then avoids any inadvertent reduction of the desired antibody fluorescence. However, according to the manufacturer's datasheet, the use of detergents (such as Triton X-100 in the current protocol) is no longer possible as they remove the quencher from the tissue.\nCut the cochleae in half under a stereomicroscope, as described in step 4.2.",
    "Mix the autofluorescence quencher with 70% ethanol to obtain a 5% solution and incubate the cochleae in this solution on the 2D-shaker at room temperature for 1 min. Wash the cochleae 3x with 1 mL of PBS on the 2D-shaker at room temperature for 5 min each.\n\t​CAUTION: The autofluorescence quencher is hazardous and harmful. Wear gloves when handling this substance.\n4. Final fine dissection\nDissect the cochlea under a stereomicroscope. Fill a polystyrole Petri dish and its lid with PBS and keep two fine forceps, Vannas spring scissors, a blade holder, and a breakable razorblade handy. Break pieces from the razorblade to obtain a cutting surface of ~2-4 mm depending on the dissection step. Prepare a microscope slide by placing three drops of mounting medium in a row.\n\tNOTE: The cutting surface of the razor blade wears off quickly. The blade must be exchanged after dissecting and mounting approximately every second piece of the cochlea.\nIf not already done in step 3.1, first cut the cochlea in half along the modiolus under a stereomicroscope. For this, position a piece of a razorblade longer than the coiled length of the cochlea into a blade holder. Place the cochlea in the Petri dish and cut away excess tissue with the piece of razorblade. Hold the cochlea in place with fine forceps and cut in half along the modiolus.\nStart with one half, but leave the other half in the Petri dish as well. Carefully fixate the cochlear half with forceps such that the cutting edge is facing upwards. Use fine spring scissors to cut away the bone of the cochlea above the helicotrema, covering the apex.",
    "To begin the separation of the cochlear pieces, isolate the middle turn by cutting with scissors through the modiolus and auditory nerve, above (scala vestibuli) and below (scala tympani).\nCut through the cochlear bone covering the stria vascularis within the cochlear duct. Make two cuts on both sides of the cochlear bone above the organ of Corti and along the stria vascularis and use the razorblade to eventually separate the cochlear pieces.\n\tNOTE: The stria vascularis is easily visible as a dark stripe. Cutting along the stria vascularis leaves the organ of Corti intact.\nOptional: To collect the stria vascularis, carefully cut between the organ of Corti and the stria vascularis to separate the two. Leave the stria vascularis connected to the spiral ligament (attached to the bone covering the outer surface of the cochlea) and remove the decalcified bone using forceps. Place the piece with the stria side up on the microscope slide in a drop of mounting medium.\n\tNOTE: If the collected piece is curved too strongly, it may be necessary to divide it into smaller pieces for it to be flat enough for mounting on the slide.\nTransfer the cochlear pieces to the PBS-filled lid of the polystyrole Petri dish, ensuring that the cochlear whole mounts lie as flat as possible on the slide. Remove excess tissue, such as parts of the spiral ligament on the abneural side and parts of the spiral limbus on the neural side. Carefully remove the tectorial membrane with super fine forceps.",
    "Place the cochlear pieces onto the slide into a drop of mounting medium. Place the cochlear whole mounts with the organ of Corti facing up on the slide to avoid obscuring the IHCs in the optical path for imaging. Look for invagination of the spiral limbus in close proximity to the IHCs, which is visible by shifting the cochlear piece into the sagittal plane to identify the side to face upward.\n\tNOTE: To digitally reconstruct the complete cochlea from its individual pieces during further processing, it is strongly recommended to document sketches of the pieces and note landmarks. Furthermore, the pieces should ideally be arranged in the correct order on the slide.\nRepeat steps 4.3 to 4.8 until the entire cochlea is transferred onto the microscope slide. If necessary, add more mounting medium, coverslip the slide, and seal the coverslip in place with black nail polish painted around the edges. Let it dry in the dark at room temperature and then store the slide in the dark at 4 °C.\n\t​NOTE: Even if parts of the sensory epithelium itself are accidentally lost, it is important to nevertheless mount what is left of the cochlear piece for correct length estimation.\n5. Cochlear length measurement\nMeasure the length of the cochlea from brightfield images of its pieces using an epi-fluorescence microscope system and associated software. Save low-magnification images (4x lens) from every cochlear piece and use the lasso measurement tool of the microscope software to draw a line along the row of IHCs in each of the images. Calculate the total length by adding the lengths of all the pieces.\n\tNOTE: When parts of the sensory epithelium are missing within a cochlear piece, interpolate the line.",
    "To define the cochlear locations that should be analyzed in an individual cochlea, calculate their corresponding distances from the apex using the equation given by Müller25. Mark these locations, for instance, on a printout of the cochlear pieces.\n6. Image acquisition with a confocal microscope\nUse a confocal microscope with an oil-immersion 40x objective (numerical aperture 1.3) and the appropriate oil for high-resolution imaging.\n\tNOTE: If the confocal microscope has an inverted light path, the slide must be positioned upside down. In this case, give the specimen approximately 30 min to sink and rest stably on the coverslip before starting the final scan. Alternatively, use a mounting medium that is fluid throughout the duration of dissection but solidifies later and simultaneously conserves the fluorescence.\nActivate the appropriate lasers: two optically pumped semiconductor lasers with wavelengths of λ = 488 nm and λ = 522 nm, and a diode laser with a wavelength of λ = 638 nm are used in this protocol. Choose the emission range of the fluorescence tags (AF488: 499-542 nm, AF568: 582-621 nm, AF647: 666-776 nm). As a hybrid detector counts the released photons, place the laser line at least 10 nm away from the emission curve.\n\tNOTE: It is important to carry out preliminary checks with single-labeled tissue to ensure that the chosen detector bandwidths cleanly separate the color channels (i.e., do not lead to channel crosstalk). Radio waves interfere with the hybrid detector, resulting in maximum photon count, and thus cause artefactual stripes in the stack. Therefore, avoid using a mobile phone near the microscope.",
    "Zoom in on the tissue until the image spans 10 IHCs. Choose the resolution of the image according to Nyquist sampling, which is typically ~40-60 nm/pixel. Set the step size in the z-direction to 0.3 µm and the imaging speed to 400-700 Hz.\n\tNOTE: Both these settings (step size and imaging speed) are compromises between using optimal imaging parameters and saving scanning time.\nPerform bidirectional sampling to shorten imaging time. Accumulate the frame for the 488 nm and 638 nm channel 3x and for the 522 nm channel 6x; additionally, average the lines 3x for each channel. Choose the beginning and the end of the stack in the z-dimension.\nSet the gain to 100 when using the hybrid detector (counting mode) to avoid decreased signal-to-noise ratio. Set the laser power so that no pixel is saturated in the region of interest but the structures cover mostly the full 8 bit range. Start with a low laser power of 0.5% and increase it until structures are visible.\n\tNOTE: Good staining typically needs a laser power between 0.1% and 5%.\nUse deconvolution software for post hoc processing of the image stacks to remove the blurring halo around small fluorescent structures using a theoretical point-spread function. Use the same settings for each stack within an experiment. Save the deconvolved images as .tif or .ics.\n\t​NOTE: The myoVIIa-label (IHCs) does not benefit from deconvolution and may be omitted to save time. The software uses meta data of the image files; however, several parameters such as the light path, the embedding medium, or the immersion medium need to be specified.\n7. Synapse quantification\nOpen a copy of the deconvolved stacks in the freely accessible software ImageJ with the additional Biovoxxel-plugin, which is also available on their website.",
    "Adjust the colors of individual channels by splitting the channels (Image | Color | Split Channels) and merging (Image | Color | Merge Channels) them again, assigning different colors. Convert the image to an RGB-stack (Image | Color | Stack to RGB) and adjust the brightness and contrast (Image | Adjust | Brightness/Contrast | either Auto or slider regarding the Maximum), if needed, so that the pre-and postsynaptic structures and the IHC label are pleasantly distinct from the background.\nChoose five IHCs and label them with the text tool (IHC1-IHC5) by clicking on the desired location within the stack. Open the ROI manager (Analyze | Tools | ROI Manager); activate the tickbox Labels to label the points with a number. Zoom in on the IHC of interest.\nUse the point/multipoint tool in multipoint mode (right-click on the tool to choose between point- or multipoint mode). Click onto a functional ribbon synapse (i.e., a presynaptic ribbon in close juxtaposition to a postsynaptic glutamate patch) while scrolling through the z-dimension.\n\tNOTE: Depending on their amount of overlap and the color chosen for each channel, the shared pixels appear in mixed color. Usually, the distinction between individual functional synapses is simple because they are sufficiently distant from each other.\nWhen all the structures of interest are ticked, click Add on the ROI manager's graphical user interface. Click on the arbitrary name and choose Rename.\n\tNOTE: The point-labels still stay through all planes of the stack when the Show all checkbox is selected in the point tool options menu (double-click on the point tool icon), which helps avoid counting the same ribbon synapse multiple times.",
    "When choosing the next IHC to count, avoid inadvertently adding counts by adjusting the image to fully display the next IHC with the hand tool. Change from multipoint tool to point tool to avoid adding more puncta to the previously stored data. Click on a structure of interest within the next IHC and change back to multipoint tool. Repeat steps 7.4 to 7.5 until all the IHCs of interest are evaluated.\nTo save data, click on a dataset in the ROI manager and then on measure. Wait for a new window to appear, listing the measured data points. Save this list as a spreadsheet file (File | Save as). Save the image by activating Show All in the ROI manager. Click on Flatten to permanently add the point-labels to the stack. When closing the image stack, agree to save the changes.\n8. Analysis of synapse volume and position on the hair cell\nNOTE: The authors used a custom-programmed procedure based on Matlab. Since it is not publicly available, it is outlined here only in broad terms (see also7). Please contact the corresponding author if interested in using it. The procedure expects a triple-labeled (IHCs, pre- and postsynaptic) image stack in TIFF format as input, guides the user through the various steps of analysis via a graphical interface, and provides extensive output of the results in spreadsheet format.\nNormalize the position of the synaptic structures to a 3D-coordinate system defined by the individual IHC's extent on the pillar-modiolar axis and cochlear apical-basal axis and the IHC's top (cuticular plate) to bottom (synaptic pole) axis.\n\tNOTE: The volumes of synaptic elements (both pre- and postsynaptic, and the combined volume of functional synapses) are provided in µm3 and normalized to the respective median value3.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}