{
  "id": 18069,
  "origin_website": "Jove",
  "title": "Objective Nociceptive Assessment in Ventilated ICU Patients: A Feasibility Study Using Pupillometry and the Nociceptive Flexion Reflex",
  "procedures": [
    "This single-center cohort study was performed in accordance with the ethical standards of ICH-GCP and the Declaration of Helsinki after it was approved by the institutional review board and ethics committee of the Antwerp University Hospital, Belgium (study identifier: 16/33/334). The study was registered at Clinicaltrials.gov (NCT02916004) before its initiation.\nAll included patients were sedated in accordance with the standard hospital sedation protocol before study enrollment. The patients were titrated to a Richmond Agitation-Sedation Scale (RASS) set by the ICU physician. Patients were sedated to a RASS - 4 prior to study inclusion. All patients were routinely titrated to a Behavior Pain Scale (BPS) of 3 by the ICU analgosedation protocol.\nNote: Determining therapeutic measures solely on the basis of the excitability of the recorded pain reflexes is not recommended. When interpreting the measurements, possible effects on the efferent branch of the reflex arc must be considered. Patients who are sedated or anesthetized have a higher pain reflex threshold than non-sedated patients. For reflex assessment, higher currents may be required. Monitoring of physiological parameters (heart rate, blood pressure, breathing rate) is recommended.\n1. Safety Precautions\nVerify potential confounders for noise control (other devices, alternating mattress).\nVerify if the ambient temperature is in the normal range.\n2. Positioning of the Subject\nPosition the patient in the bed to maintain angles of 120° of flexion of the hip and 130 - 160° at the knee.\nPlace the palmar side of the wrist upwards.\nEnsure that the non-measured eye is closed during reflex recording.\n3. Preparation of the Skin for Electrode Application\nNote: This will reduce electrode impedance.\nClip or shave hair at the application sites.",
    "Check the application sites, they must be clean and dry. If necessary, remove any body lotion by cleaning the skin with soap and water and rub the skin gently with a dry wash cloth or gauze.\nAbrade the application sites with available abrasive material. Use the skin preparation paper over a large area rather than only a single swipe.\nApply each electrode immediately after skin preparation.\n4. Placement of the Electrodes for Pupil Dilation Reflex (PDR) Assessment\nNote: Please see the Figures for an overview of electrodes application. Magnetic and electrical fields may appear as background noise or other artefacts in the measurement trace. Maximal acceptable noise level using the followings protocol is set from values higher than 10 µV. High noise level is defined when the maximum amplitude in the area before the stimulation (‘noise area’, i.e., -130 ms up to -10 ms before stimulation) exceeds this adjustable threshold (‘maximum acceptable noise level’). Noise values are not used to calculate the threshold and the stimulation is repeated with the current intensity until an EMG signal with no noise is determined. To limit the occurrence of artefacts, verify the device has been updated to the latest version. Artefacts can be reduced by optimal electrode placement and skin preparation.\nUse Ag-AgCl electrodes with highly conductive wet gel to ensure an optimal signal during reflex recording.\nMaintain an inter-electrode distance of 30 mm (center-to-center).\nPlace two stimulation electrodes for PDR recording, at the wrist on the skin area innervated by the median nerve, keeping the palmar side of the wrist facing upwards.\n5. Placement of the Electrodes for Nociceptive Flexion Reflex (NFR) Assessment\nNote: Please see the Figures for an overview of electrodes application.",
    "Use two stimulation electrodes at the ankle and place the electrodes distal to the lateral malleolus, stimulating the sural nerve area.\nUse two registration electrodes for EMG recording at the biceps femoris muscle. Place the electrodes four finger breadths above the popliteal fossa, posterior to the iliotibial band on the ipsilateral leg.\nUse one reference electrode, placed at the quadriceps tendon.\n6. Safety Check\nIdentify the materials: battery status (PDR tool), accessibility of a plug connection nearby (NFR evaluation monitor), lead wires, and connections to the labeled device sockets.\nIdentify the patient: patient number, medical history, current medications, behavior pain scale, and sedation depth.\n7. Pupillary Dilation Reflex Assessment: Getting Started\nAttach the lead wire to the stimulation electrodes at the wrist. Verify that the black-labeled part is attached to the most distal electrode. \nTurn the infrared camera on.\nSelect the measurement protocol: ‘pupillary pain index’ (PPI) through menu selection on the touch screen display. Perform an impedance control indicated by the colored symbols, if necessary repeat the preparation procedure.\nClean the camera and eye cab with water and disinfect them.\n8. Pupillary Dilation Reflex Assessment: Installation\nOpen the eyelid and place the camera in an optimal position.\n\t\nLet the rubber eyecup rest on the orbit, enclosing the whole eye.\nVerify whether pupil detection has been set correctly and adjust the camera if necessary. The operator may have to raise the eyelid more.\nCenter the pupil in the middle of the screen and verify the position by pursuing a pupil completely colored green.\nClose the contralateral eye, decreasing the consensual light response.\nWait for a least 5 seconds to start the measurement, ensuring a stabilization period necessary for pupil accommodation (dark measurement environment).\n9. Pupillary Dilation Reflex Assessment: Measurement",
    "Start the test by pushing the trigger button. Hold the button until the pupil assessment is complete (a few seconds). Ensure that the entire measurement cycle is executed by 2 audible signals (first at the start, second when the test is finished)\n\t\nDo not move the camera during measurement; a countdown is shown on the screen when stimulation intensity is increasing automatically from 10 mA up to maximum 60 mA.\nIdentify the results automatically displayed after 15 seconds on the screen\n\tBaseline pupil size (mm) before noxious stimulation (yellow horizontal line).\n\tMaximal pupil size (mm) after noxious stimulation (white horizontal line).\n\tDifferent levels of noxious stimulations by colored bands and values.\n\tMaximal pupil variation (% and mm).\n\tPPI score\nSave the measurement results by pressing the icon after pupil assessment.\n10. Nociception Flexion Reflex Assessment: Getting Started\nAttach the lead wires for stimulation, recording and reference. Verify whether the black-labeled parts are attached to the most distal electrodes; white is for reference value recording at the knee.\nTurn the device on when connected to a power supply. Identify the USB flash drive if data storage is desired.\n11. Nociceptive Flexion Reflex Assessment: Installation\nPress the settings button to go to the configuration menu to verify the stimulation settings and the threshold determination procedure for reflex measurement in unconscious sedated patients.\n\t\nVerify Measurement technique is on threshold tracking.\nVerify the Stimulus type is determined as RIII reflex.\nSelect off when asked for NRS input.\nChoose Peak Z Score as Evaluation criterion.\nUse >100 number of stimuli.\nInitiate stimulation at 1 mA intensity, with minimum and maximum step size of 0.5 mA.\nVerify the Interstimulus interval is defined as 8 s with a reflex range of 90 – 180 ms.\n12. Nociceptive Flexion Reflex Assessment: Measurement",
    "Start the measurement, i.e., automatic reflex threshold tracking.\nReduce impedances when ‘High noise level’ appears by repeating the skin preparation protocol.\nIdentify reflex features.\n\t\nIdentify the currents applied to the patient and number of stimulations.\nIdentify the raw EMG displayed 200 ms before to 300 ms after stimulation via the EMG electrode on the thigh.\nIdentify the reflex range and the reflex threshold value. The parameter is shown numerically (value in mA).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}