{
  "id": 2984,
  "origin_website": "Cell",
  "title": "Protocol to engineer apical-out airway organoids using suspension culture of human airway basal stem cell aggregates",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation of 804G-Conditioned medium, adapted from Levardon et al. 20182[href=https://www.wicell.org#bib2]\nTiming: 10–14 days\nThis section outlines how to prepare culture vessel coating solution for better human Airway Basal Stem Cell (hABSC) attachment.\nThaw a frozen vial of 804G Rat Bladder Epithelial Cells into a 175-cm2 cell culture flask.\nQuickly thaw the frozen vial via gentle agitation in a 37°C water bath. As soon as the thawing process is complete, spray a paper towel with 70% ethanol and wipe down the cryovial before moving it into the biosafety cabinet.\nResuspend the thawed cells in 7 mL of RPMI 1640 Complete Medium.\nCentrifuge at 220 × g for 5 min at 20°C–25°C.\nAspirate the supernatant and resuspend the cell pellet in 1 mL of RPMI 1640 Complete Medium.\nTransfer the cells to a 175-cm2 flask with 25 mL of RPMI 1640 Complete Medium and culture at 37°C in an incubator supplemented with 5% CO2 (see Figure 1[href=https://www.wicell.org#fig1]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2525-Fig1.jpg\nFigure 1. 804G-conditioned medium preparation\n(A) Process for collecting, filtering, aliquoting, and storing the 804G-Conditioned Medium.\n(B and C) 804G cell culture. Images of 804G cell culture 24 h after thawing (B) and upon reaching confluency (C). Scale bars represent 200 μm.\nEvery 2 days, replace the culture medium with 25 mL of fresh RPMI 1640 Complete Medium.\nOnce the 804G cells reach desired confluency (>90%) (see Figure 1[href=https://www.wicell.org#fig1]C), replace the culture medium with 50 mL of fresh RPMI 1640 Complete Medium for each 175-cm2 flask to initiate conditioned medium collection.\nCollect the conditioned medium every two days for up to 4 times, which is referred to as 804G Conditioned Medium. Following each conditioned medium collection, add 50 mL of fresh RPMI 1640 Complete Medium to each flask and continue the culture until the final collection.",
    "Combine all the collected 804G-Conditioned Medium and filter it through a 0.45-μm filter unit to remove cell debris (see Figure 1[href=https://www.wicell.org#fig1]A).\nAlternatives: A syringe filter can be used instead of the filter unit depending on the user’s preference and the volume of conditioned medium being processed.\nMake 10 mL aliquots of the 804G-Conditioned Medium (or another volume based on the user’s preference) to avoid multiple freeze-thaw cycles. 804G-Conditioned Medium can be stored at −20°C for up to 1 year (see Figure 1[href=https://www.wicell.org#fig1]A).\nCulture initiation, expansion, and cryopreservation of hABSCs\nTiming: 3–5 days\nThis section provides procedures for initiating and expanding the culture of hABSCs, and for their cryopreservation. hABSCs will be used in the next section to produce AOAOs.\nNote: All the volumes are calculated based on using a 75-cm2 cell culture flask. For using flasks of other sizes, please adjust the reagent volume based on the culture surface area.\nPre-coat the culture flask by adding 10 mL of the 804G-Conditioned Medium and incubate for a minimum of 8 h at 37°C in a 5% CO2 incubator.\nAlternatives: Although not being tested in this protocol, other extracellular matrix coating (such as Collagen IV) has also been reported to support hABSC culture.3[href=https://www.wicell.org#bib3]\nAspirate the 804G-Conditioned Medium and rinse the flask once with 5 mL of DPBS.\nAdd 15 mL of Complete Airway Basal Stem Cell Expansion Medium that has been prewarmed to 37°C to the pre-coated flask.\nThaw and seed one cryovial of hABSCs.\nQuickly thaw the cryovial via gentle agitation in a 37°C water bath. As soon as the thawing process is complete, spray a paper towel with 70% ethanol and wipe down the cryovial before moving it into the biosafety cabinet.",
    "Transfer the thawed cells to a 15 mL conical tube that contains 7 mL of RPMI 1640 Complete Medium and gently mix.\nCentrifuge at 220 × g for 5 min at 20°C–25°C.\nRemove the supernatant and resuspend the cell pellet in 1 mL of Complete Airway Basal Stem Cell Expansion Medium.\nSeed resuspended hABSCs at a density of 3500 cells/cm2 in the cell culture flask prepared in steps 6–8.\nRefresh medium every other day until cells reach 50%–75% confluency. Figure 2[href=https://www.wicell.org#fig2] shows hABSC culture at low confluency.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2525-Fig2.jpg\nFigure 2. A representative image of hABSCs in culture\nScale bar represents 100 μm.\nCritical: Do not allow hABSCs to expand beyond 75% confluency, as it may compromise further hABSC proliferation and their ability for proper organoid differentiation.\nLift hABSCs from the cell culture flask.\nAspirate the cell culture medium.\nRinse once with 5 mL DPBS.\nIncubate the flask in 5 mL of 0.25% trypsin EDTA at 37°C until cells have lifted (approximately 5 min).\nAdd 7 mL of RPMI 1640 Complete Medium to neutralize trypsin.\nTransfer the cell suspension into a 15 mL conical tube and centrifuge at 220 × g for 5 min at 20°C–25°C.\nFrom this point on, hABSCs can either be passaged to continue the culture (a), cryopreserved for later use (b), or used for producing AOAOs (described in the next section).\nPassage of hABSCs:\nRemove the supernatant.\nResuspend the cell pellet in 1 mL of Complete Airway Basal Stem Cell Expansion Medium.\nSeed resuspended cells at a density of ∼3500 cells/cm2 in a culture flask pre-coated with 804G-Conditioned Medium.\nNote: hABSCs can be passaged for up to 6 times without obvious alteration in their ability to form AOAOs.\nCryopreservation of hABSCs:\nRemove the supernatant.",
    "Resuspend the cell pellet in pre-cooled (4°C) Cryostor CS10 Freeze Medium to a final cell density of ∼500,000 cells/mL.\nTransfer 1 mL of cell suspension into each cryovial and freeze in a Corning CoolCell Container at −80°C for a minimum of 8 h.\nTransfer cell cryovials to liquid nitrogen for long-term storage.\nDifferentiation of hABSCs into AOAOs\nTiming: 21 days\nThis section describes procedures to form epithelial spheroids from defined number of hABSCs and their subsequent differentiation into AOAOs.\nNote: The procedure below is for AOAO formation from 500 hABSCs per organoid (see Figure 3[href=https://www.wicell.org#fig3]A). The size of AOAO can be tuned by adjusting the initial number of hABSCs seeded per well for each organoid formation (see Figure 3[href=https://www.wicell.org#fig3]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2525-Fig3.jpg\nFigure 3. AOAO differentiation\n(A) Bright-field images of the production of hABSC spheroids and their differentiation into AOAOs over 21 days.\n(B) Bright-field images of AOAOs over the course of differentiation with different starting cell numbers for spheroid formation. Scale bars represent 100 μm. Schematic in Panel A was adapted from Wijesekara et al. 2022 with permission from Elsevier.1[href=https://www.wicell.org#bib1]\nStart with 2D hABSC culture at 50%–75% confluency. Following post-trypsin centrifugation, remove the supernatant and resuspend the cell pellet to a cell density of 5,000 cells/mL in Complete Airway Differentiation Medium supplemented with 10 μM Y-27632.\nNote: Y-27632 is only supplemented during the initial seeding of hABSCs into the cell-repellent microplate to improve cell viability in suspension culture prior to epithelial spheroid formation.\nTransfer 100 μL of cell suspension (containing 500 hABSCs) to each well of 96-well cell-repellent, U-bottom microplate.\nCritical: Re-mix the cell suspension intermittently (following seeding every 10–20 wells) to ensure homogenous cell distribution in the suspension, as cells will settle to the bottom over time.",
    "Centrifuge the seeded microplate at 100 × g for 5 min at 20°C–25°C using a centrifuge equipped with microplate swinging bucket rotor.\nNote: Examine the microplate under an inverted cell culture microscope to verify that cells are well aggregated (see Figure 3[href=https://www.wicell.org#fig3]A, Day 0). An additional 5-minute centrifugation can be performed to improve cell aggregation.\nEvery 2 days, prior to medium change, measure the medium level in selected wells with a wide-orifice pipette tip to assess the volume loss from the initial 100 μL per well due to evaporation. Add cell culture water to resume a total volume of 100 μL per well.\nCritical: Use wide-orifice pipette tips when handling organoids to minimize shear stress.\nNote: In suspension AOAO culture, a half-medium change is typically performed (as described in step 16 below). Thus, evaporation between medium changes will cause a gradual increase in the concentration of medium components (such as salt), which will ultimately compromise AOAO viability and differentiation over a long period of time (3 weeks for AOAO differentiation). This challenge is typically not encountered for adherent cell culture where a complete medium change can be performed or during short-term suspension culture of a few days. The extent of medium evaporation varies between wells within the same microplate with the evaporation of those along the plate edges being more severe than the rest and is also affected by incubator conditions (such as humidity and insulation). Users are recommended to perform volume measurement of culture wells at a few representative locations within the microplate prior to medium change to establish an optimal water volume for compensating medium evaporation. If some wells within the microplate are not being used for AOAO culture, filling these unused wells with 100 μL of cell culture water will help reduce medium evaporation.",
    "Aspirate 50 μL of medium from each well and replace with 50 μL of fresh Complete Airway Differentiation Medium. The organoids will reach maturity after 21 days of differentiation.\nNote: Emergence of cell debris around the AOAO during the 3 weeks of differentiation is common, and the mature AOAO at the end of differentiation is typically smaller in size compared to the initial hABSC spheroid observed on Day 1 of differentiation (see Figure 3[href=https://www.wicell.org#fig3]A).\nOptional: Supplement the Complete Airway Differentiation Medium with 5 ng/mL IL-13 from Day 1 of differentiation to induce goblet cell specification (see Figure 4[href=https://www.wicell.org#fig4]B).1[href=https://www.wicell.org#bib1]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2525-Fig4.jpg\nFigure 4. Wholemount immunofluorescence staining of AOAOs\n(A) Representative images of Acetylated-α-Tubulin, FOXJ1 and MUC5AC staining in mature AOAOs with and without IL-13 treatment during the course of differentiation. Scale bar represents 25 μm.\n(B) Images in Panel B were adapted from Wijesekara et al. 2022 with permission from Elsevier.1[href=https://www.wicell.org#bib1]\nWholemount immunofluorescence staining of AOAOs\nTiming: 3 days\nThis section outlines procedures to assess cellular composition of AOAOs using wholemount immunofluorescence staining.\nCollect AOAOs from 96-well cell-repellent microplate into a 1.5 mL Eppendorf tube using wide-orifice pipette tips.\nPerform 3 washes using the following wash procedure at 20°C–25°C:\nGently remove the top liquid until approximately 100 μL is left at the bottom of the Eppendorf tube.\nAdd 1 mL of DPBS (with 0.1% Tween-20).\nLet the solution sit at 20°C–25°C for 30 min.\nCritical: Use Tween-20 to prevent the organoids from sticking to the tube wall or pipette tip. Be careful not to accidentally remove the organoids during washing. Confirm no organoids got removed by putting the aspirate into an empty well and checking under an inverted cell culture microscope.\nFix the AOAOs.\nGently remove the top liquid until approximately 100 μL is left at the bottom of the Eppendorf tube.",
    "Add 1 mL of 4% paraformaldehyde and incubate at 4°C for 1 h.\nPerform 4 washes as described in step 19.\nPause point: Fixed AOAOs can be stored in DPBS (with 0.1% Tween-20) at 4°C for up to 3 months for staining at a later time.\nPermeabilize the AOAOs via incubation in 1 mL of DPBS (with 1% TritonX-100) for 45 min at 20°C–25°C.\nPerform 4 washes as described in step 19.\nBlock the AOAOs via incubation in 1 mL of DPBS (with 1% BSA) for 20 min at 20°C–25°C.\nReplace the blocking solution with 100 μL of primary antibody diluted in DPBS (with 1% BSA) and incubate at 4°C for a minimum of 8 h.\nNote: Refer to Table 1[href=https://www.wicell.org#tbl1] for appropriate primary antibody dilutions.\ntable:files/protocols_protocol_2525_4.csv\nPerform 4 washes as described in step 19.\nAdd the Donkey Anti-Mouse Secondary Antibody, Alexa Fluor 647 at a 1:1000 dilution in DPBS (with 1% BSA). Let the Eppendorf tube sit in dark at 20°C–25°C for 45 min.\nPerform 2 washes as described in step 19.\nFor nuclear counterstain, incubate in 1 mL of DPBS (with 0.1% Tween-20) supplemented with DAPI (1 μg/mL) for 30 min at 20°C–25°C.\nPerform 4 washes as described in step 19.\nResuspend the stained AOAOs in 1 mL of DPBS (with 0.1% Tween-20) (see Figure 4[href=https://www.wicell.org#fig4]A).\nPause point: Stained AOAOs can be stored in dark at 4°C for up to two weeks until imaging.\nAssemble the imaging chamber by placing a piece of circular cover glass within the Attofluor Cell Chamber.\nUse a wide-orifice pipette tip to transfer the stained AOAOs from the Eppendorf tube to the imaging chamber.\nMount the imaging chamber onto the confocal microscope for fluorescence imaging (see representative images in Figure 4[href=https://www.wicell.org#fig4]B).\nEmbedding AOAOs in Matrigel for assessing motile cilia-powered organoid rotation",
    "Timing: 1 day\nThis section provides procedures to enable motile cilia-powered AOAO rotation that can be used to assess cilia motility.\nCritical: Pre-gel Matrigel solution and any reagent or material coming into direct contact with pre-gel Matrigel should be kept ice-cold. Pre-cool the pipette tips in a −20°C freezer for a minimum of 30 min prior to this procedure.\nCollect mature AOAOs from the cell-repellent microplate into a 1.5 mL Eppendorf tube using wide-orifice pipette tips and let the AOAOs settle for 10 min (see Figure 5[href=https://www.wicell.org#fig5]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2525-Fig5.jpg\nFigure 5. Schematic for enabling Cilia-powered AOAO rotation in Matrigel\n(A) Collection of mature AOAOs from the cell-repellent microplate, AOAO settling, and volume adjustment.\n(B) AOAO embedding in Matrigel to enable cilia-powered AOAO rotation.\nNote: Mature organoids are typically used for analysis, but organoids from any stage of differentiation can undergo this procedure.\nGently remove the top medium until approximately 100 μL of volume is left at the bottom of the Eppendorf tube (see Figure 5[href=https://www.wicell.org#fig5]A).\nTransfer AOAOs from the Eppendorf tube into a well of the flat-bottom 96-well microplate.\nAfter the organoids settle, aspirate the top medium until 60 μL of volume is left in the well.\nCritical: The 60 μL must be exact for proper Matrigel dilution to be achieved in the next step, which can be done by measuring the fluid volume in the well with a wide-orifice pipette tip. Transfer the aspirated top medium into a spare empty well to inspect for any accidentally removed organoids to minimize organoid loss.\nAdd 40 μL of Growth Factor Reduced Matrigel into the well (containing mature AOAOs within 60 μL of medium) and gently pipet up and down using a wide-orifice pipette tip to mix.",
    "Critical: Avoid introducing air bubbles into the Matrigel solution as it will cause inconsistency in gelation and organoid embedding. We also recommend mixing organoid-containing medium with Matrigel directly in the well to minimize organoid transfer and loss due to adherence to surfaces.\nLeave the flat-bottom 96-well microplate on a heat block set to 37°C for 10 min for rapid gelation of Matrigel (see Figure 5[href=https://www.wicell.org#fig5]B).\nAdd 100 μL of Complete Airway Differentiation Medium and culture in the incubator for 1 day before assessing cilia-powered AOAO rotation (see Figure 5[href=https://www.wicell.org#fig5]B)."
  ],
  "subjectAreas": [
    "Cell Differentiation",
    "Organoids",
    "Biotechnology And Bioengineering",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}