{
  "id": 17685,
  "origin_website": "Jove",
  "title": "Orthotopic Kidney Auto-Transplantation in a Porcine Model Using 24 Hours Organ Preservation And Continuous Telemetry",
  "procedures": [
    "The present study was designed according to the principles of the ARRIVE (Animal Research: Reporting of In Vivo Experiments) guidelines23. Experiments were performed in accordance with the institutional guidelines and the German federal law regarding the protection of animals. The full ethical proposal was approved by the responsible authorities (Governmental Animal Care and Use Committee, LANUV NRW - \"Landesamt für Natur, Umwelt und Verbraucherschutz Nordrhein-Westfalen\", Recklinghausen, Germany, Protocol ID: 81-02.04.2018.A051). All animals in the present study received humane care according to the principles of the \"Guide for the Care and Use of Laboratory Animals\" (8th edition, NIH Publication, 2011, USA) and the Directive 2010/63/EU on the protection of animals used for scientific purposes (Official Journal of the European Union, 2010). Female German landrace pigs were obtained from a hygienically optimized barrier breeding facility (Heinrichs GbR, Heinsberg, Nordrhein-Westfalen). Figure 1 depicts the summary of the described experimental protocol.\n1. Animals and housing\nUse female German landrace pigs (or comparable) for this protocol. Deliver the animals to the research facility 14 days before the first surgery (telemetry implantation) for acclimatization and house them in a temperature- and humidity-controlled barrier environment with a 12 h light and dark cycle ( Figure 2).\nMount two telemetry receivers on the ceiling of the room which allows the registered data to be transferred directly to a PC located in the observation room. Ensure that animals are observed visually during the regular visits by the veterinary officers and by the animal caretaker in charge (every 8 h and on-demand).\n\tNOTE: Furthermore, in this experiment a real-time camera footage with integrated thermal imaging connected to the local network was used. Details of the housing facility used in this study are depicted in Figure 2.\n2. Basic techniques and common procedures\nFast the animals overnight before surgery.",
    "Premedicate by an initial intramuscular injection of azaperone (4 mg/kg) and atropine (0.1 mg/kg), followed by an injection of ketamine (15 mg/kg) 10 min later.\nAfter premedication, weigh the animal and transfer it directly from the housing facility to the central OR facility anesthesia preparation room.\nCannulate one of the large ear veins using an 18 G peripheral venous catheter. Monitor the animal by a standard ECG and pulse oxymetry.\nInitiate the anesthesia with propofol (3 mg/kg).\nExpose the vocal cord with a laryngoscope and insert a 7.5 mm endotracheal tube. The cuff is blocked with air according to manufacturer´s recommendations.\nInsert an oro-gastric drainage tube to remove fluid and air from the stomach.\nInsert a urinary catheter via the urethra.\nSubsequently, trim the skin in the area of the surgical incision.\nApply eye ointment to prevent drying of the cornea during surgery.\nAfter orotracheal intubation, maintain anesthesia with isoflurane (final expiratory 1.45-2.0 Vol.%) and fentanyl (3 -7.5 µg/kg/h).\nEnsure active intraoperative temperature control of the animal by a heating pad and using warmed air. Insert a rectal probe to monitor body temperature (target temperature 36.5 °C - 37.5 °C).\nAdminister antibiotic prophylaxis using cefuroxime (35 mg/kg i.v.). Infuse Ringer solution at 4 mL/kg/h and increase to 8 mL/kg/h after skin incision. Administer a prophylactic dose of pantoprazole (40 mg i.v.) over the ear vein access.\nPerform all surgical procedures under sterile conditions according to the general principles of surgical asepsis and antisepsis. Disinfect the surgical field with povidone-iodine solution and cover with surgical drapes.\n3. Telemetry implantation\nPrepare the animal for surgery following the steps described under section 2 of the protocol and confirm proper anesthesia by a decreasing heart rate and a lack of conscious movement of the animal.",
    "Collect blood and urine samples to determine individual baseline lab values.\nMark the incision sites using a permanent marker.\nTo implant the arterial sensor of the telemetry transponder, perform a 3-4 cm incision in the groin. Expose and dissect the artery in a 360˚ fashion.\nUsing an Overholt clamp pull through two-vessel loops below the artery and secure them with mosquito clamps.\nAfter making an arteriotomy using #11 blade scalpel, insert the arterial sensor. Close the arteriotomy using 5-0 polypropylene suture with single knot sutures and secure the arterial sensor using one of these sutures.\nMake a 3-4 cm large incision on the left flank of the animal and create a subcutaneous pouch for the transponder by blunt dissection.\nTunnel the telemetry transponder to the flank and fix it to the muscle fascia (3-0 polypropylene, single knot). Tunnel the red and white ECG electrodes to the right and left side of the thorax. Make two 1 cm incisions and secure the electrodes in the muscle tissue to ensure a good ECG signal with single knot sutures (3-0 polyglactin).\nCommence registration of telemetry data and check the various signals (e.g., body temperature registered by the transponder body itself, arterial blood pressure, and ECG signals).\nClose the incisions in the groin, on the left flank and the two small thoracal incisions using muscle and subcutaneous sutures (3-0 polyglactin) and close the skin using a non-absorbable monofilament suture (e.g., 2-0 Prolene).\nUse a spray film dressing to seal the incision sites.\nAt this time point prepare the animal to wear a designated porcine jacket which the animal wears for the rest of the study period. Replace jackets with a clean jacket following every surgical intervention.",
    "NOTE: To record stable baseline data, telemetry transponders are implanted 14 days before the index surgery (left nephrectomy, please also see Discussion).\n4. Nephrectomy and kidney graft retrieval\nPrepare the animal for graft retrieval surgery following the procedures described in section 2.\nAfter the induction of anesthesia, cannulate the external jugular vein. Following the sterile disinfection of the surgical field, a 4 cm incision is made on the right side in the jugular groove.\nDissect subcutaneous tissue and muscle to expose the external jugular vein.\nExpose and dissect the vein in a 360˚ fashion.\nUsing an Overholt clamp pull through two-vessel loops below the vein and secure them with mosquito clamps.\nTunnel the jugular catheter to the back of the animal. For this, position the pig on its left side.Use the Seldinger method to insert the jugular catheter.\nClose the opening on the vein and secure the catheter using 5-0 polypropylene suture.\nClose the incision in two layers (e.g., 3-0 polyglactin for the muscle and subcutaneous and 2-0 polypropylene for the skin).\nSecure the catheter to the skin with multiple sutures (2-0 polypropylene).\nTest the jugular vein catheter for free aspiration and injection. Subsequently, switch the intravenous line from the ear vein cannula to the central venous line.\nFollowing surgical disinfection and draping, perform a median laparotomy to open the abdomen (25-30 cm). Use a standard abdominal retractor to expose the surgical field.\nUse wet and warm abdominal towels to cover the colon and the small bowel. Ask the second assistant to hold the bowel to the direction of right hemi-abdomen exposing the kidney and its vascular structures.\nOpen the peritoneal layer and dissect the left kidney and the ureter from any adherent tissue using the monopolar cautery, bipolar forceps, and fine scissors.",
    "Ligate and divide the left ureter (3-0 polyglactin) leaving an at least 10 to 12 cm long segment.\nComplete the dissection of the left renal vein(s) and artery to their origin from inferior vena cava and aorta, respectively.\n\tNOTE: Avoid injury and opening of the large lymphatic vessels in this anatomical region. Also be aware of a potential injury to the azygo-lumbar vein joining to the renal vein near to its origin from the vena cava.\nDissect and ligate the azygo-lumbar vein between two ligatures (3-0 polyglactin).\nPrepare for the back-table dissection using a bowl of ice and a sterile cover.\nTo retrieve the graft kidney, clamp the renal artery and the renal vein close to the aorta and the vena cava with vascular clamps. Remove the kidney graft by cutting the vessels with a scissor close to the clamps then hand the kidney over to the back-table team.\nClose the stump of the renal artery using a 5-0 polypropylene suture. Close the renal vein using a two-layer continuous suture with 5-0 polypropylene. Remove the vascular clamps.\nAfter checking the area for bleeding or lymphatic leakage, close the abdomen in 4 layers.\n\tNOTE: Peritoneum: 3-0 polyglactin running suture; fascia: 0 polyglactin running suture; subcutaneous layer: 3-0 polyglactin running suture; skin: skin staplers after kidney retrieval surgery, to facilitate re-opening the abdomen the following day and 2-0 polypropylene single knot sutures after the transplantation procedure for definitive closure.\nAfter applying sterile wound dressing, return the animal to the housing facility and allow to recover following endotracheal extubation. For postoperative analgesia, use buprenorphine (0.05 - 0.1 mg/kg) intramuscularly every 8 h until auto-transplantation.\n5. Back-table and organ preservation",
    "After graft retrieval, immediately cannulate the renal artery using a standard 14 G (orange) peripheral catheter and fix it using a tourniquet prepared from 3-0 polyglactin.\nRinse the kidney with cold organ preservation solution.\nAfter flushing with 500 mL of organ preservation solution, remove the arterial cannula, wrap the kidney graft in sterile organ bags and store in organ preservation solution with a target cold ischemic time (CIT) of 24 h at 4 °C using a computer-controlled cooling circuit.\n\tNOTE: A brief post-preservation flush is recommended using 500 mL of 4 °C normal saline solution.\n6. Contralateral nephrectomy and orthotopic kidney auto-transplantation\nDuring the recipient operation, adapt premedication and initial anesthesia to the restricted renal metabolism and avoid the use of ketamine. Induction is performed with propofol (3-5 mg/kg i.v.), midazolam (0,25 mg/kg i.v.), and atropine (0.1 mg/kg i.m.). Thereafter, the preoperative preparation is identical to the procedures described in section 2.\nMaintain anesthesia with isoflurane (final expiratory 1.45-2.0 Vol.%) and fentanyl (3 - 7,5 µg/kg/h) and propofol (2 - 4 mg/kg/h).\nCheck and continuously monitor ECG, pulse oximetry, rectal temperature and the function of the telemetry transponder.\n\tNOTE: Strict anesthesia and blood pressure control is of crucial importance during the implantation procedure.\nIn rare cases where the arterial blood pressure signal registered over the telemetry transponder is not satisfactory due to the supine position of the animal, place a further arterial catheter into the right femoral artery using percutaneous puncture and the Seldinger technique.\nFollowing sterile draping, reopen the median laparotomy and expose the surgical field using the abdominal retractor. The colon and small bowel are placed to the left side of the abdomen to expose the intact right kidney.",
    "Similar to the donor procedure, dissect the contra-lateral kidney and its vessels from the surrounding tissue. Dissect the right renal vein and renal artery in the direction of the kidney hilum to ensure sufficient vessel length for anastomosis.\n5 min before vascular clamping, inject natrium-heparin intravenously (100 I.U./ kg).\nClamp the right renal artery and the right renal vein using vascular clamps. The right kidney is removed. The vessels are checked for integrity before starting the anastomoses.\nPlace the preserved graft kidney into the abdomen and start the venous and arterial anastomoses.\nFrom this point onwards, keep the mean arterial pressure over 80-90 mm Hg to ensure a good early perfusion of the kidney graft following reperfusion. Achieve this partially by adequate volume management and partially by the administration of norepinephrine (0.1 - 1.0 µg/kg/min as a continuous infusion using the mean arterial blood pressure and heart rate for monitoring the efficiency).\nPerform end-to-end anastomosis of the renal vein:\n\t\nAfter placing two corner stitches using 5-0 polypropylene, suture the back wall in a continuous fashion.\nTie the cranial corner stitch and tie it together with the thread used for the back wall.\nAfter finishing the back wall, use the cranial corner stitch to suture the front wall in a cranio-caudal direction. Flush the vein with aheparinized saline solution (100 I.U./mL). Tie the caudal corner stitch.\n\t\tNOTE: In case of a size mismatch between the donor and recipient sides, a small growth-factor can be used to ensure a wide and sufficient anastomosis. There are many possible variations of the porcine renal vein branches. In the case of complex venous anatomy, a modified anastomosis approach is necessary (see Figure 3).\nPerform the end-to-end anastomosis of the renal artery:",
    "Use a 6-0 polypropylene cranial corner stitch to perform the arterial anastomosis. Placing a further caudal, supporting corner stitch which is later removed, is optional.\nSuture the back wall in a continuous fashion using the parachute technique. After arriving at the caudal corner remove the second corner stitch (if applicable).\nSuture the front wall with the other end of the double-armed 6-0 polypropylene suture. Flush the artery with a heparinized saline solution (100 I.U./mL). Tie the two threads at the caudal corner.\nRecord the time needed for performing both anastomoses with a target warm ischemia time of <40 min.\nReperfuse the kidney by opening the venous vascular clamp and subsequently the arterial clamp. Check for significant bleeding.\nIf no significant bleeding from the anastomoses is observed, unwrap the kidney graft and pour warm normal saline solution in the abdomen covering the reperfused graft.\nReposition the graft, if needed, to ensure homogeneous reperfusion and avoid congestion.\nAdminister papaverine topically to the outside of the renal artery and the arterial anastomosis (5 mL undiluted).\nAfter reperfusion, infuse 250 mL of 20% glucose solution to induce osmotic dieresis followed by the administration of a single dose of 80 mg of furosemide.\n\tNOTE: Following this, initial urine production may be observed.\nTo ensure urinary drainage, pass a 12 French pediatric urine catheter through the abdominal wall of the right flank of the animal, retroperitoneally.\nSecure the catheter in the ureter using ligatures (2-0 polyglactin) and block the catheter with 2 mL saline. Further sutures are used to adapt and secure the ureter to the peritoneum of the abdominal wall (2-0 polypropylene). The catheter is also secured to the skin with at least two single knot sutures (2-0 polypropylene).",
    "Close the peritoneal layer over the kidney to prevent dislocation of the kidney graft and kinking of the vascular anastomoses (3-0 polyglactin).\nClose the abdomen in a similar 4-layer fashion as described earlier for the graft retrieval.\nFollowing abdominal closure, maintain normothermia on the OR table.\n\tNOTE: Mean arterial blood pressure should be maintained over 80 mm Hg until the animal is awake and is in a prone position.\nFollowing abdominal closure, use color Doppler ultrasound to ensure adequate arterial and venous perfusion of the kidney graft (Figure 4). Monitor the animal closely until it is fully awake and can walk and drink spontaneously. The animals are given 1 L of Ringer solution during the recovery phase.\nSubsequently, return the animal to its box in the housing facility.\n7. Follow up, sample and data collection\nProvide the animals water ad libitum as soon as they can drink spontaneously. Provide solid food from postoperative day 1.\nFor postoperative analgesia, administer buprenorphine (0.05 - 0.1 mg/kg) intramuscularly every 8 h for 72 h, give pantozol (40mg i.v.) once a day for 72 h. Provide antibiotic treatment (cefuroxime 35 mg/kg i.v. 2x daily) and thrombosis prophylaxis (500 mg of acetylsalicylic acid from postoperative day 1) during the whole observation period until the end of the experiment.\n\tNOTE: If bleeding complications occur, aspirin is discontinued.\nRegister continuous telemetry data throughout the observation period. Ensure that the animals are visited at least every 8 h by the veterinary officer and/or by an experienced veterinary technician and their clinical condition is evaluated using a score sheet which is used as a basis to prematurely terminate the experiment if required by the clinical condition of the animal.\n\tNOTE: These so-called humane endpoint criteria are defined as described previously24.",
    "Perform daily sample collection using the central venous line and the percutaneous urinary catheter. Change urinary bags (2,000 mL) 2x daily.\nFollowing sample collection or the administration of fluids or drugs, block the central venous catheter with heparinized saline solution (100 I.U./mL) between every use to avoid occlusion and cover it with a new sterile cap.\nFollowing the corresponding observation period of 5 to 7 days, sacrifice the animals in deep anesthesia following relaparotomy, sample collection and explantation of the kidney graft. Sacrifice is performed using a single injection of pentobarbital (50 - 60 mg/kg i.v.).\n\tNOTE: In compliance with the 3R principle, the remaining organs and tissues of the sacrificed animals may be used for various ex vivo research and educational purposes in in-house institutes."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}