{
  "id": 5869,
  "origin_website": "Bio",
  "title": "Measuring the Endocytic Recycling of Amyloid Precursor Protein (APP) in Neuro2a Cells",
  "procedures": [
    "Note: The APP recycling assay is performed on Neuro2a cells grown on glass coverslips.    Cell culture and transfection (Day 1, Day 2)   Place one washed coverslip in the bottom of each well of a 24-well plate.   Plate Neuro2a cells (30,000 cells per well of 24-well plate; adjust the cell density so that Neuro2a cells do not reach confluence at the day of the recycling assay) in culture medium (see Reagents) at 37 °C in a 5% CO2 and 20% O2 humidified incubator (Day 1). We recommend using two coverslips per condition.  Note: Most cells will grow adherent to the glass coverslip.   For expression of APP-RFP cDNA, 60-70% confluent Neuro2a cells are transiently transfected with 0.5 µg cDNA: 0.5 µl Lipofectamine 2000 mix in 25 µl Opti-MEM per well of 24-well plate with 250 µl of antibiotics-free complete medium. (Day 2)   Replace transfection medium 2 h post-transfection with complete culture medium at 37 °C to avoid the excessive expression of APP-RFP (Day 2).   (Optional) siRNA transfection for knockdown analysis with Lipofectamine RNAiMax (Thermo Fisher Scientific) according to manufacturer’s protocol 72 h prior to the recycling assay (Day 2).      APP recycling assay in Neuro2a cells expressing APP-RFP by the following steps (Figure 1) (Day 3)  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171129/20171129214443_9922.jpg Figure 1. Schematic of protocols to monitor APP endocytosis, APP recycling and non-recycling APP. A. Pulse with anti-APP antibody for 10 min; B. Upon 10 min pulse, non-endocytosed APP at the surface is removed with acid-stripping buffer, and recycled APP at the surface is detected in non-permeabilized cells after a 20 min chase; C. Upon the 20 min chase, the non-recycled pool of APP is detected upon acid-stripping and permeabilization.",
    "Remove cell culture media with a plastic Pasteur pipette, add 500 µl serum-free culture medium at 37 °C and incubate cells for 30 min at 37 °C in cell culture incubator.  Note: All pipetting should be done slowly against the wall of the well without touching the cells.   Dilute 0.25 µl of anti-APP antibody (22C11; 0.25 µg/µl stock concentration) into 25 µl culture medium with 10 mM HEPES (0.25 µl of stock solution at 1 M pH 7.2-7.5) per coverslip.    Place one 25 µl droplet of diluted anti-APP antibody per glass coverslip onto Parafilm stretched on a 24 wells plate lid.    Carefully place the coverslips over the droplets with cells facing the antibody solution and incubate them at 37 °C for 10 min in cell culture incubator. Cover the reaction to avoid evaporation. This step allows for anti-APP antibody binding to cell surface APP and subsequent endocytosis. (Optional) For a surface labeling control coverslip, carefully transfer the coverslips over the droplets with cells facing the antibody solution and incubate them at 37 °C for 4 min in cell culture incubator. Wash each coverslip by dipping in PBS at 37 °C for 4 s. Place coverslips back in a 24-well plate and add 250 µl of 4% PFA fixative solution for 10 min at room temperature (RT). After washing 3 times with PBS (RT) proceed for detection of anti-APP. This optional step allows for anti-APP antibody binding to cell surface APP.    Wash each coverslip by dipping in PBS at 37 °C for 4 s.  (Optional) For controlling the pool of endocytosed APP (see Figure 1A) proceed for fixation by placing the control coverslip(s) back in the 24-well plate and add 250 µl of 4% PFA fixative solution for 10 min at room temperature (RT).",
    "After washing 3 times with PBS (RT) proceed for detection of anti-APP.   For assaying the pool of recycled APP bound to anti-APP (see Figure 1B) is necessary to:   Remove of surface anti-APP antibody bound to non-endocytosed APP by dipping the corresponding coverslips into an acid-stripping buffer (see Recipes) for 5 s and careful washing by dipping the coverslips in PBS at 37 °C for 4 s.    Place the coverslips back in a 24-well plate containing pre-warmed culture medium (37 °C) for a 20 min incubation at 37 °C in a CO2 incubator.   Wash cells carefully by dipping the coverslips for 4 s in PBS at RT before fixation in 4% PFA for 20 min. Wash 3 times with PBS and proceed for detection of anti-APP.     For assaying the pool of non-recycled APP bound to anti-APP (see Figure 1C), cells are carefully washed for 4 s in PBS at RT, followed by removal of recycled anti-APP antibody by dipping coverslips into an acid-stripping buffer for 5 s before fixation in 4% PFA for 20 min at RT. After washing 3 times with PBS proceed for detection of anti-APP.    Note: Cells are fixed for 20 min instead of 10 min because Neuro2a cells, after the extensive manipulation required to detect the recycled APP, tend to detach from the coverslips.     Anti-APP antibody detection (Day 3).   For detection of the recycled APP bound to anti-APP at the plasma membrane (after 20 min chase, see Figure 1B): Note: Permeabilization is not necessary since the recycled anti-APP is extracellular.   Place Parafilm stretched on a 24 wells plate lid.    Place each coverslip (cells facing down) onto a 50 µl droplet of diluted donkey anti-mouse Alexa 488 (1:250) in 3% FBS/PBS.    Cover the reaction and incubate it for 60 min at RT, in the dark.",
    "Place coverslips back on a 24-well plate and wash 3 times with PBS at RT.    Mount coverslips with cells facing down onto a 25 µl droplet of Fluoromount G on microscope slides and let dry overnight in the dark to preserve the fluorescence signal.     For detecting the pool of non-recycled APP bound to anti-APP (an optional endocytosis control, see Figure 1C)   Place coverslips on the 24-well plate and add 250 µl of 0.1% saponin/PBS to permeabilize fixed cells for 20 min at RT.   Wash once with PBS at RT.   Place Parafilm stretched on a 24 wells plate lid.    Place each coverslip (cells facing down) onto a 50 µl droplet of diluted donkey anti-mouse Alexa 488 (1:250) in 3% FBS/0.1% saponin/PBS.   Place coverslips back on a 24-well plate and wash 3 times with PBS at RT.    Mount coverslips with cells facing down onto a 25 µl droplet of Fluoromount G on microscope slides and let dry overnight in the dark to preserve the fluorescence signal.   Optional: Include DAPI (1:10,000 of a stock of 1 mg/ml) in the fluorescently-labeled antibody solution to counterstain cell nuclei.      Image acquisition (Day 4)   Image acquisition can be done using epifluorescence microscopy (such as ZEISS Z2) with a 60x NA 1.4 oil immersion objective and a CCD camera (see Equipment for details on microscope used). Exposure times should be determined based on the sample with the brightest expected signal, to use as much of the dynamic range of the camera and a 16-bit binary range as possible, without saturating any of the pixels.    Acquire 10-20 fields per condition to have sufficient data for statistical analysis. Select fields with isolated cells to facilitate analysis. Focusing on the dorsal plasma membrane may facilitate the visualization of APP recycling, see Figure 2 for representative images.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171129/20171129214800_4713.jpg Figure 2.",
    "Representative images of APP surface labeling (4 min), endocytosed APP (10 min) and recycled APP (+ 20 min chase) by Neuro2a cells expressing APP-RFP with anti-APP (22C11) detected with anti-mouse Alexa 488 (adapted from Ubelmann et al., 2017). Scale bar = 10 μm.      Image analysis & APP recycling quantification (Figure 3) (Day 4) Note: Quantification of fluorescent signal of endocytosed APP per single cell acquired with ImageJ/Fiji.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171129/20171129214920_6090.jpg Figure 3. Image analysis of APP recycling    Select cells with median expression of APP-RFP for image analysis in order to uniformize the quantity of APP present on the surface, available for endocytosis and subsequent recycling. Repeat the procedure for 20-50 cells with good morphology and median APP-RFP expression, about 10 fields per condition.   Outline each cell based on anti-APP or APP-RFP signal, which becomes visible upon increasing the brightness using B&C tool (without altering intensity levels), using the tool ‘polygon selection’. Add it to ‘ROI manager’ (shift + t).    Draw a background ROI using the tool ‘polygon selection’ in the original image and add it to the ‘ROI manager’.   Measure mean intensities of APP-RFP and background ROIs using ‘measure’ (click M) of ROI manager. Fluorescence intensities of the two regions (background and cell) are measured for APP-RFP and anti-APP using the ‘ROI manager’.   Transfer all regions to recycled Alexa488-anti-APP channel, and use ‘measure’ to obtain the mean fluorescence intensities per ROI and repeat this procedure for each ROI.   Export measurements to Microsoft Excel."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}