{
  "id": 18456,
  "origin_website": "Jove",
  "title": "Multi-exon Skipping Using Cocktail Antisense Oligonucleotides in the Canine X-linked Muscular Dystrophy",
  "procedures": [
    "All protocols listed below are in accordance with the animal care guidelines set forth by the National Center of Neurology and Psychiatry (NCNP) in Japan. All experiments were approved by the Institutional Animal Care and Use Committee of the NCNP.\n1. Design of Antisense Oligos\nUse rescue ESE and ESEfinder programs to detect ESE sites 44, 45-47.\nDesign 25 base pair (bp) sequences that are antisense to exons that are to be targeted. Target exons 6 and 8 in the dog model (Figure 1).\n\t\nUse 25 - 30 bp sequences for PMOs (Table 1) or 25 bp for 2'OMePS. To design 25 bp sequences, select sequences that are within the target region. Consider secondary structure, avoidance of heterodimers, exon splicing enhancer motifs, and GC content to create stable sequences 43. AONs should target at least one of the ESE sites as identified by the above-mentioned software.\nSelect AONs with a GC content that is less than 65%, with fewer than 4 consecutive 'G's, and do not contain self-complementary sequences. Use NCBI Blast software to predict off-target annealing sites 22,48,49.\nSelect an appropriate AON backbone chemistry. For in vitro experiments use 2'O-methyl oligonucleotides (2'OMePS) or morpholinos. For in vivo experiments, use 2'OMePS, morpholinos or vPMOs.3,19,48,50\n2. In Vitro Experiments (Exons 6 and 8 Skipping in the CXMD Model)\n2'OMePS Transfection of Dog Myoblasts\nCulture CXMD myoblasts in 3 ml of growth medium in 6-well plates. Seed 1 - 5 x 103 cells/cm2 with 0.5 ml/cm2 of medium for myoblasts. For the growth medium, use Dulbecco's modified Eagle's medium (DMEM) with 10% fetal bovine serum (FBS) and 1% penicillin/streptomycin (P/S) 40.\nIncubate at 37 °C until 60 - 80% confluent. This takes approximately 12 to 24 hr.",
    "Dilute a cationic liposome transfecting agent to a total of 100 µl in reduced serum medium (2:1 ratio transfecting agent: AONs, e.g., 10 µl lipofectin vs. 5 µg AONs). Allow mixture to stand at RT for 30 - 45 min.\nDilute AONs (2'OMePS or morpholinos) to a final volume of 100 µl in reduced serum medium.\nCombine the diluted transfecting agent with diluted AONs and incubate at RT for 10 - 15 min.\nWhile the transfection agent/AON mixture is sitting at RT, remove old media from cells via aspiration and wash cells with the media.\nAdd 0.8 ml media to the transfection agent/AON mixture and then add the entire solution to the freshly-washed cells. Incubate for 3 hr at 37 °C.\nAfter incubating, replace media with differentiation media (DM); differentiation can take up to 10 days. Check to see whether differentiation has occurred starting at around day 3. The differentiation media is DMEM with 2% horse serum, 200 U/ml penicillin, 200 mg/ml streptomycin, and 10 µg/ml insulin.\nMorpholino Transfection of Dog Myoblasts\nCulture CXMD myoblasts in growth medium as described in step 2.1.\nSwitch to differentiation medium (DM), and add 0.1 mM stock morpholino to each well to make the final concentration 1 µM. Heat cocktail morpholinos at 65 °C for 10 min before transfection or injection to avoid AON aggregation. Add a peptide delivery reagent 39,51 and adjust to a final concentration of 3 - 6 µM.\nAfter 16 - 48 hr of incubation, collect cells for RNA extraction. Add 1 ml acid guanidinium thiocyanate-phenol-chloroform to the cells to detach cells from the plate. Perform RNA extraction after this step.\n\t\t\nAlternatively, add trypsin so that it covers all cells and incubate for 2 min at 37 °C.",
    "Note: If intending to perform immunochemistry, use chambered slide glasses for culturing. After differentiation, cells can be fixed using paraformaldehyde (PFA) (4% for 10 min).\nRNA Extraction and Reverse Transcription Polymerase Chain Reaction (RT-PCR)\nOnce cells are differentiated into myotubes, remove medium and add 1 ml acid guanidinium thiocyanate-phenol-chloroform; incubate for 10 min at RT.\nTransfer to 1.5 ml tubes. Combine with 200 µl chloroform and incubate at RT for 2 min until three separate layers can be seen. The three layers from top to bottom are: an RNA layer, a DNA layer, and a protein layer.\nCentrifuge at 12,000 × g for 15 min at 4 °C. Remove the top layer supernatant and place in a tube with 500 µl isopropanol (if stopping here, store the supernatant at -80 °C). Centrifuge the supernatant at 12,000 × g for 10 min at 4 °C; after centrifuging, keep the resulting RNA pellet and discard the supernatant.\nWash the pellet with ethanol and centrifuge at 8,000 x g for 5 min at 4 °C. Evaporate residual ethanol by inverting the tube for 15 min and then add 15 - 30 µl of RNase-free water. Quantify total RNA concentration using US/VIS spectroscopy at 260 nm.\nCombine the required reagents for an RT-PCR reaction: 1.5 µl 10 μM forward primer, 1.5 µl 10 μM reverse primer, 1 µl dNTP, 5 µl one-step PCR kit buffer, 0.7 µl RNase inhibitor, 1 µl enzyme mixture from one-step PCR kit, and 200 ng of RNA. Once these have been mixed, add water to a final volume of 25 µl.",
    "Place mixture in a thermo-cycler. Run a 30 min cycle at 50 °C, a 15 min cycle at 95 °C, then 35 cycles of 94 °C for 1 min, 60 °C for 1 min, and 72 °C for 1 min. Lastly, run a 10 min cycle at 72 °C. Store PCR product in a refrigerator at 4 °C or -20 °C\nComplementary DNA (cDNA) Sequencing\nIdentify exon 6 - 9-skipped bands using agarose gel electrophoresis. Load 5 µl of each sample into the wells of a 1.5% agarose gel, run 135 V through the gel for 5 min, and then 120 V for 20 min. Next, incubate the gel in DNA gel stain at RT for 30 min. Visualize the bands using imaging software.\nExcise the band of interest using a gel extraction kit.\n\t\t\nExcise the DNA fragment and solubilize the gel slice using 200 µl NTI/100 mg gel. Let this sit for 5 to 10 min in a 50 °C water bath. Then transfer to silica membrane tube.\nCentrifuge at 11,000 x g for 30 sec. Wash twice with 700 µl NT3 buffer before centrifuging again at 11,000 x g for 30 sec.\nDry the silica membrane by centrifuging at 11,000 x g for 1 min.\nAdd 15 - 30 µl NE buffer and allow it to sit at RT for 1 min. Then, centrifuge at 11,000 x g for 1 min. Remove the silica gel and keep the contents in the tube.\nUse a sequencing kit to determine the sequence according to the manufacturer's protocol.\n3. Intramuscular Injections or Open Muscle Biopsy",
    "For maintenance of sterile conditions during survival surgery, remove hair using clippers in the area surrounding the surgery site (the hind limb). Use iodophors or chlorohexidine as a disinfectant. Use sterile drapes for the surgical site by placing and securing them over the entire animal and the operating table.\n\t\nWear clean scrubs, face masks, head covering, sterile gloves, and special shoes for the operating room52,53.\nInject CXMD dogs with 20 mg/kg of thiopental sodium to anesthetize them. Use vet ointment on the eyes to prevent the eyes from drying out.\nUse 2 - 3% isoflurane inhalation to maintain general anesthesia (Figure 3). Check muscle reflexes and monitor heart and breathing rate to assess the depth of anesthesia. The normal respiration rate (RR), heart rate (HR), and SpO2 under general anesthesia are as follows: RR: 10 - 20 breaths/min; SpO2: 95 - 100%, HR: 80 - 120 beats per minute (bpm).\nUsing a scalpel, cut the skin over the cranial tibial (CT), also known as the tibialis anterior (TA), and make a single cut approximately 5 cm longitudinally (for young adult dogs). To mark the injection sites, stitch the deep fascia using a surgical needle and surgical thread and make two stitch markers at 2 cm intervals.",
    "Inject the desired concentration of AONs into the muscle with a 27 G needle. The desired concentration varies between treatment conditions. For CT, give two injections of 1 ml volume each, for a total of 1.2 mg of cocktail PMOs (0.4 mg each PMO) or 0.4 mg of cocktail vPMOs (0.13 mg each vPMO). For the extensor carpi ulnaris (ECU) forelimb muscle, inject two volumes of 0.5 ml each for a total of 1.2 mg of cocktail PMOs (0.4 mg each PMO) or 0.4 mg of cocktail vPMOs (0.13 mg each vPMO). Leave the needle in for 1 min. Use an equal amount of each AON for the cocktail.\nPerform open muscle biopsy by removing a piece of muscle tissue approximately 2 cm in length from CT muscle using a surgical scalpel.\nGo to step 6.5 for muscle sample preparation.\nUsing a needle, administer an intramuscular injection of 0.02 mg/kg buprenorphine hydrochloride before awakening from general anesthesia. Lay muscle fascia and skin back over muscle and stitch these using a 3-0 absorbable thread and 3-0 nylon thread for muscle fascia and skin closure, respectively.\nWhile holding the mouth open, determine whether the gag reflex has returned; when the gag reflex has returned, extubate the dog.\nAdminister 15 to 30 mg/kg cefazolin or cephalexin (antibiotics) for up to 3 days via intravenous or intramuscular injection to prevent infection.",
    "Remove sutures within seven days. Do not leave the dog unattended until it has regained sufficient consciousness to maintain sternal recumbency and do not allow the dog to interact with other animals until a full recovery is made. Keep the endotracheal tubes in place as long as possible and remove them when the animal begins to chew or swallow. Monitor the animal's heart rate, respiration, and hydration to make sure they are stable and within normal limits.\nFor post-surgery care, provide analgesia for 3 days (e.g., buprenorphine 0.01 mg/kg) and nursing support, including a quiet, dark resting place, appropriate wound and bandage maintenance, a soft resting surface, rehydration with oral or parenteral fluids, and a return to normal feeding through the use of highly palatable foods or treats. If any animals require the additional medication, give an intramuscular injection of 0.3 mg/kg of butorphanol tartrate depending on the pain symptoms.\n\tNote: Dogs in pain may bite, scratch, or guard painful regions, and if handled, may be unusually apprehensive or aggressive. In addition, pain in one limb usually results in limping or holding-up of the affected limb with attempts to use it. In such situations, give an intramuscular injection of 0.02 mg/kg of buprenorphine hydrochloride every 6 - 8 hr.\n4. Systemic Injections\nNote: This procedure can be repeated weekly or biweekly for the desired number of weeks.\nRestrain dogs manually and gently by getting the dog to lie down and then drape arms over the shoulders and hips to hold the dog in place throughout the procedure.",
    "Inject AONs; 120 - 240 mg/kg cocktail PMOs (40 - 80 mg each AON) using a venous indwelling needle into a limb vein (known as a cephalic or a saphenous vein). The amount of AON injected depends on the experimental condition. Use an equal amount of each AON for the cocktail.\nUse an infusion pump or syringe driver to inject 50 ml total at a rate of 2.5 ml/min for 20 min, following the manufacturer's instructions. Repeat injections weekly or biweekly (every two weeks) at least 5 times, as dystrophin expression will accumulate with repeated injections.\nPerform blood tests weekly to examine toxicity.\n\t\nUsing a needle, collect 3 ml of blood — 0.5 ml for complete blood count (CBC) and 2.5 ml for others — from one of the subcutaneous veins of the fore or hindlimb. Include CBC, gamma-glutamyl transferase (GGT), aspartate aminotransferase (AST), blood urea nitrogen (BUN), alanine aminotransferase (ALT), creatine kinase (CK), and creatinine assessments when testing the collected blood, following manufacturer's instructions from blood test kits. 40,54\n5. Clinical Grading of Dogs\nSet up a video camera and record dog behavior and gait. Record the entire encounter with the dog as this will act as a reference when grading the dog; this means each video will be a different length depending on the dog's abilities and willingness. Use default recording parameters. Filming creates a record of the grading so it can be reviewed at a later date.\nGrade gait and movement disturbances.\n\t\nFor gait and movement disturbances, use the following grades:\n\t\tgrade 1 = none, grade 2 = sitting with hind limb extended, grade 3 = bunny-hops with hind limbs, grade 4 = shuffling walk, and grade 5 = unable to walk.",
    "For mobility disturbance, use the following grades: grade 1 = none, grade 2 = lying down more than normal, grade 3 = cannot jump on hind limbs, grade 4 = increasing difficulty moving around, and grade 5 = unable to get up and move around.\nTime how long it takes the dog to run 15 m. Measure out 15 m, place the dog at the starting line and encourage it to run until the 15 m mark.\nDetermine muscle atrophy of the limb using the following grading scale:\n\tgrade 1 = none, grade 2 = suspect hardness, grade 3 = can feel hardness or appears thin, grade 4 = between grades 3 and 5, and grade 5 = extremely thin or hard.\nGrade drooling using the following scale: grade 1 = none, grade 2 = occasionally dribbles saliva when sitting, grade 3 = some drool when eating and drinking, grade 4 = strings of drool when eating or drinking, and grade 5 = continuous drool.\nGrade hypertrophy of the tongue (macroglossia) using the following scale: grade 1 = none, grade 2 = slightly enlarged, grade 3 = extended outside dentition, grade 4 = enlarged and slightly thickened, and grade 5 = enlarged and thickened.\nGrade the dog's ability to swallow using the following scale: grade 1 = no difficulty, grade 2 = takes time and effort in taking food, grade 3 = difficulty in taking food from a plate, grade 4 = difficulty in chewing, swallowing, or drinking, and grade 5 = unable to eat.\nCalculate total grade by adding the scores from each category (except for the 15 m running test) 55.\n\tNote: The studies should be blinded so as not to introduce bias.\n6. Magnetic Resonance Imaging (MRI)",
    "Use a 3 Tesla (3T) MRI and 18 cm diameter/18 cm length human extremity coil to obtain T2-weighted images of hind-limbs.\nAnesthetize animals by injecting CXMD dogs with 20 mg/kg of thiopental. Use vet ointment on the eyes to prevent the eyes from drying out. Use 2-3% isoflurane inhalation to maintain general anesthesia.\n\t\nCheck muscle reflexes and monitor heart and breathing rate to assess the depth of anesthesia. The normal respiration rate (RR), heart rate (HR) and SpO2 under general anesthesia are as follows: RR: 10 - 20 breaths/min, SpO2: 95 - 100%, HR: 80 - 120 beats per minute (bpm).\nUse the following settings to obtain T2-weighted images: TR/TE = 4,000/85 msec, slice thickness = 6 mm, slice gap = 0 mm, field of view = 18 cm x 18 cm, matrix size = 256 x 256, and number of acquisitions = 3 during fast spin echo (Figure 4).\n7. Muscle Sampling and Preparation (Necropsy)\nNote: Muscles should be sampled one or two weeks after the last AON injection.\nInject dogs with 20 mg/kg of thiopental sodium to anesthetize them. Use vet ointment on the eyes during anesthetization to prevent drying of the eyes.\nUse 2 - 3% isoflurane inhalation to maintain anesthesia. Check muscle reflexes and monitor heart and breathing rate to assess the depth of anesthesia. The normal respiration rate (RR), heart rate (HR) and SpO2 under general anesthesia are as follows: RR: 10 - 20 breaths/min; SpO2: 95 - 100%, HR: 80 - 120 bpm.\n\t\nEuthanize dogs by exsanguination under general anesthesia (for necropsy only). Use exsanguination under deep general anesthesia to avoid the effects caused by blood-derived factors in the molecular analysis (e.g., cardiac muscles).",
    "Dissect the following muscles (Figure 5): CT, extensor digitorum longus (EDL), gastrocnemius, soleus, biceps femoris, rectus femoris, biceps brachii, triceps brachii, deltoid, ECU, extensor carpi radialis (ECR), flexor carpi ulnaris (FCU), flexor carpi radialis (FCR), gracilis, intercostal, abdominal muscles, diaphragm, lateral dorsi, esophagus, sternocleidomastoid, and heart. To examine toxicity, collect kidney and liver samples. Use Evans and Alexander de Lahunta (2009) as a reference for dissection technique 56.\nCut the CT, EDL, gastrocnemius, soleus, biceps femoris, rectus femoris, biceps brachii, triceps brachii, deltoid, ECU, ECR, FCU, FCR, gracilis, intercostal, abdominal muscles, lateral dorsi, esophagus, sternocleidomastoid, heart, kidney, and liver into small sections approximately 1 - 1.5 cm in length. Roll the diaphragm up and then cut it into 1 - 1.5 cm sections 56.\nPlace tragacanth gum so that it is approximately 0.5 - 1 cm thick on cork discs. Label discs with the animal's identification and muscle name on the opposite side of the tragacanth gum.\nPlace muscles with their longitudinal axis perpendicular to the cork in the tragacanth gum.\nPlace the corks in a container of isopentane that is sitting in liquid nitrogen. Move it around constantly with tweezers for 1 min or until completely frozen. Store muscles on corks in vials at -80 °C. When transporting, put vials on dry ice.\nPrepare glass slides labeled with animal identification/muscle name and date.\nIn a cryostat cooled to -25 °C, mount the cork to the stand. Set the section thickness to the desired level. Use 8 µm for immunohistochemistry and 12 µm for hematoxylin and eosin (HE) staining. Use 15 µm for Western blot samples. Trim about one-quarter of the muscle to obtain a flat muscle for proper muscle sampling.",
    "Cutting one section of muscle at a time, place every 6th section on the same glass slide if planning to use samples for immunohistochemistry or HE staining. If using samples for Western blots, put 30 - 40 sections in a tube and store at -80 °C.\nAfter preparation of slides, let slides dry for 1.5 hr at RT. Store slides at -80 °C.\n8. Immunohistochemistry\nRemove prepared slides from storage and place them in a moisture chamber to keep the slides separated and maintain moisture. Fill the moisture chamber so that the bottom is just covered with water (approximately 1 mm of water).\nAir-dry for 0.5 hr. Draw a square enclosing the muscle sample on the slide using a hydrophobic barrier pen.\nAdd 15% goat serum in phosphate buffered saline (PBS) and incubate for 2 hr at RT In blocking reagent.\nAdd anti-dystrophin rod domain (DYS-1) mouse monoclonal primary antibody, or C-terminal monoclonal antibody (DYS-2) for dog dystrophin staining (1:150 dilution). Dilute using a blocking agent in 1.25 ml of PBS. Incubate O/N in a refrigerator a 4 °C.\nWash with PBS for 5 min, repeated three times. Add secondary antibody Alexa 594 goat antibody against mouse IgG1 (for DYS-2) or IgG2 (for DYS-1) (1:2,500). Dilute with a blocking reagent in PBS containing 0.1% octyl phenol ethoxylate. Incubate for 0.5 hr at RT.\nWash with PBS for 5 min, three times. Allow slide to dry. Add 1 - 2 drops (3 ng/ml) of 4',6-diamidino-2-phenylindole (DAPI) mounting solution. Using tweezers, place a glass slip over the top of the sections, avoiding bubbles.\nView dystrophin- (DYS-1/DYS-2) positive fibers under a fluorescent microscope at 594 nm at 20X magnification.\n9. Western Blotting\nAdd collected muscle sections from cryo-sectioning to 150 µl of sample buffer on ice.",
    "Using a hand homogenizer, briefly homogenize the protein samples. Heat samples in a 1.5 ml tube in a heating block incubator at 95 °C for 3 - 5 min. Centrifuge at 16,500 × g for 15 min and collect the supernatant.\nStore aliquots of the supernatant at -70 °C. Use distilled water to dilute to 100x.\nDetermine protein concentration using a commercial kit according to manufacturer's protocol. Add 2x Laemmli SDS-loading buffer to samples and heat for 3 min at 95 °C.\nLoad samples into 3 - 8% Tris-acetate gel before running it for 3 hr at 150 V. Include several diluted wild-type (WT) samples (e.g., 1%, 10%, and 50%) for quantification. Less than 1% WT levels of dystrophin should be detected with this method.\nPlace the gel in cathode buffer for 20 min. During this time, take nine pieces of filter paper and put them in the transfer buffers (3 papers in the cathode buffer [+], the anode buffer ([-], and the concentrated anode buffer [--], respectively). This describes a semi-dry transfer method which increases sensitivity (Figure 6).\nSoak a PVDF membrane in methanol for 20 sec and then place in the anode buffer.\n\tSet up the gel with the membrane for semi-dry transfer and allow it to run 1.5 hr at 400 mA in RT or in a cold room.\nWash the membrane with PBS. Incubate the membrane in a mixture of PBS with Tween 20 (PBST) and 5% milk powder for 2 hr.\nDilute DYS-1 (primary antibody) in PBST and 5% milk powder mixture to a 1:100 dilution. Add it to the membrane and let it incubate for at least 1 hr. Wash three times with 100 ml PBST for 15 min each.",
    "Add 65 µl/lane of HRP conjugated secondary antibody (anti-mouse IgG2a for DYS1) at 1:5,000 dilution for 1 hr at RT in a dark area. Then, wash with three times with 200 ml PBST for 20 min. Mix solutions from a detection kit as directed. Incubate for 1 min.\nDevelop film to detect bands and analyze with ImageJ software 48,57,58."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}