{
  "id": 11016,
  "origin_website": "Jove",
  "title": "Visualization of Intensity Levels to Reduce the Gap Between Self-Reported and Directly Measured Physical Activity",
  "procedures": [
    "This protocol was approved by the ethics committee of the University Medicine Greifswald (number BB 076/18; June 2018).\n1. Video construction and experimental design\nSelect a publicly available or self-produced video based on the specific experimental question. The video should explain the terms used in the self-report questionnaire to support participants’ understanding. The video used here contains explaining and visualizing symptoms as well as naming examples of light, moderate, and vigorous PA.\n\t\nIn the video, have a person on a treadmill in a fitness center give a general introduction to the different intensity levels of PA.\nHave the person explain differences in heart rate, breathing frequency, and capability to talk normally in accordance with the intensity levels. Have the person simultaneously demonstrate those symptoms while walking/running on a treadmill at the according pace.\nHave the person give examples of daily-life activities and emphasize individual differences in the evaluation of PA intensity levels.\n\t\tNOTE: The video used here was produced in German based on a video clip from the Centers for Disease Control and Prevention (CDC)20. If participants are native English speakers, the original video may be used with emphasis on minutes 1:46 to 3:25. The person in the present video is an approximately fifty-year-old, normal-weight, white male in good physical shape. See Figure 1 for a visual depiction of video structure and contents.\nIntegrate the video into a self-administered tablet-computer survey to be presented directly before the PA questionnaire and make sure participants cannot skip the video. Randomize presentation of the video 1:1.\n\t\nIntegrate questions on sociodemographic and health related variables into the survey as desired for description of sample characteristics.",
    "In the present study, self-reported PA is assessed using a modified version of the International Physical Activity Questionnaire Short Form (IPAQ-SF)4, German version21, addressing the last seven days. Two items each address number of days and respective time spent in moderate and vigorous PA. The original items on walking are replaced with questions on light PA as walking may be performed on different intensity levels22 and walking is not equivalent to light PA measured by accelerometry. Sociodemographic and health variables included in the survey are sex, age, school education, employment, current living together with a partner, current smoking, and self-rated general health.\nimgsrc://cloudfront.jove.com/files/ftp_upload/58997/58997fig1.jpg\nFigure 1: Schematic structure of the video demonstration of different physical activity intensity levels. The main scenes of the video with according single shots, lengths, and summary of contents are depicted. The video was based on a video clip provided by the CDC20. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/58997/58997fig1large.jpg]\n2. Power calculation\nConduct a power analysis using respective software in order to define the sample size necessary to obtain statistically conclusive results. Include an interim analysis to verify underlying assumptions and early stopping of the study.\n\t\nChoose a statistical test appropriate for the research question.\nBased on the literature, set the assumed mean difference between questionnaire and accelerometer data in the control group, that is, the divergence between self-reported and directly measured PA without presentation of the video.\nSet the assumed mean difference between questionnaire and accelerometer data in the experimental group, that is, the divergence between self-reported and directly measured PA with inclusion of the video demonstration.\nSet the assumed standard deviation (SD) for both groups.\nChoose power and alpha-level as desired.",
    "Based on the literature and considering the specific study design, decide on an assumed drop-out rate to retrieve the final number of participants to be recruited.\nThe power analysis of the present study is based on a two-sample t-test assuming equal variance. Based on a comparable sample10, the assumed mean difference between questionnaire and accelerometer data in the control group is 90 min per day of MVPA. The assumed mean difference in the experimental group is 60 min per day (SD in both groups = 100 min per day). As it is hypothesized that the integration of the video reduces the gap between the two measures, a one-sided significance level of p = .05 is chosen (power = .80). Results of power calculation including interim analysis revealed that a total number of 314 participants is needed for demonstrating the experimental effect. Assuming a drop-out rate of about 10%, it is planned to recruit 350 participants (Figure 2).\nimgsrc://cloudfront.jove.com/files/ftp_upload/58997/58997fig2v2.jpg\nFigure 2: Schematic depiction of the calculated participation flow. n = number of participants. All n refer to results of the power calculation. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/58997/58997fig2large.jpg]\n3. Participant recruitment and preparation for data collection\nChoose a recruitment setting that permits enough time to hand out the accelerometer and to prepare it for data collection (e.g., in a shopping mall or at the workplace) in order to keep efforts of participants low and to increase adherence to the study.\n\t\nRecruit participants who have the ability to walk independently (e.g., no permanent use of a wheelchair) and who are physically and cognitively capable of completing a self-report questionnaire. Be sure to recruit a similar number of male and female participants of all ages within the desired age range.",
    "As an incentive for participation, point out that participants are going to receive a feedback letter on directly measured PA and sedentary time after completing the study. Use monetary incentives as desired.\nObtain written informed consent from each person prior to their participation.\nFor objective measurement, use a three-axial accelerometer to be worn on the right hip. Alternative devices can be used but should have the memory capacity for data collection on seven consecutive days. In order to most accurately capture daily PA, follow the instructions of the specific device used.\n\t\nHave accelerometers prepared with elastic belts of various sizes and select one that fits the participant comfortably.\nGive adequate information on how to handle the accelerometer according to instructions provided by the producer of the device. Instruct participants to start wearing the device on the next day. Ensure that participants wear the device during waking hours (i.e., every day after getting up until going to sleep).\nInitialize the accelerometer on a computer using the appropriate software. Make sure to set up the wearing period correctly. Select a sampling rate of 30 Hz23. If applicable, choose to fill in participant specific information as desired (e.g., body weight or date of birth for reasons of participant identification).\nSchedule each participant for an assessment session to obtain self-reported PA and somatometry. Ensure this session takes place one day after the last accelerometer wearing day. Hence, accelerometer and questionnaire data refer to the same period of time. If this is not possible for reasons of time, admit a maximum delay of two days.\nDismiss the participant with encouragement to engage in normal daily activities and make sure the participant remembers to return the accelerometer when appearing for the session.",
    "NOTE: This study is conducted in Greifswald, a city in Western Pomerania, a rural area in northeastern Germany. Persons from the general population aged between 40 and 75 years are recruited proactively at a shopping mall. Accelerometer feedback letters and shopping vouchers in the amount of 10 euros are used as incentives. Participants are instructed to wear the device for seven consecutive days and to remove it for any water-based activities (e.g., showering or swimming).\n4. Participant assessment session\nNOTE: Conduct this session within three days after the last accelerometer wearing day.\nCollect the accelerometer from the participant.\nSet up a new participant in the tablet-computer survey and type in the individual study identification number of the participant.\nHand over the tablet computer to the participant to answer the self-administrative questionnaire.\nWhen the participant has completed the questionnaire, collect the tablet computer and continue with measurement of somatometry.\n\t\nAsk the participant to take off their shoes and to stand on calibrated scales for measurement of body weight. Type in the result into the tablet computer.\nAsk the participant to stand up straight in front of a mirror with toes at a mark on the ground for measurement of body height. Type in the result into the tablet computer.\nAsk the participant to remove upper layers of clothing for measurement of waist and hip circumference. Measure waist circumference midway between lowest rib and iliac crest. Measure hip circumference about two inches below iliac crest. Use the mirror to check accurate positioning of the tape. Type in the results into the tablet computer.\nThank and dismiss the participant.\n5. Download of accelerometer data for processing and creation of feedback letters\nDownload the data from the device using the appropriate software.",
    "Select to use data from the vertical axis and choose an epoch length of 10 s.\nExport the data to an appropriate program for further processing. According to the output metric used, choose cut points to determine non-wear time and to differentiate between PA intensity levels24,25.\n\t\t\nDefine non-wear time as at least 60 min of consecutive zero counts, allowing for ≤2 min of counts between 0 and 10024.\nIn an adult sample (ages 18 or older), classify values <100 counts per min as sedentary time, values between 100 and 2019 counts per min as light PA, values between 2020 and 5998 as moderate PA and values of 5999 or more counts per min as vigorous PA24.\nImport all relevant variables into a computer program appropriate for creating a computerized feedback letter using an algorithm to automatically integrate the individual data into a general template. The letter may contain a number of graphs visualizing accelerometer-based PA outcomes as well as sedentary time as desired. Have each graph accompanied by a paragraph of three to five sentences explaining the content of the figures and providing respective health recommendations.\nDeliver the feedback letter as soon as possible after the participant completed the study.\n\tNOTE: Accelerometer feedback letters in the present study include three graphs. The first graph visualizes daily steps across the wearing period. The second graph shows amounts of time spent sedentary and in light, moderate, and vigorous PA on each wearing day. The third graph depicts all observed 10-min-bouts of sedentary time between 6 and 10 pm exemplified on a weekday and on a weekend day. Recommendations on PA are presented according to the PA guidelines of the World Health Organization for apparently healthy adults2. Recommendations on sedentary breaks are presented based on relevant studies26,27,28.\n6 Statistical analysis",
    "Calculate descriptive statistics for all variables.\nDefine a cut-off value for daily accelerometer wear time to avoid bias in accelerometer data.\nCreate a variable that presents the gap between the two measures. Calculate the variable as self-reported minus accelerometer-derived min of moderate-to-vigorous PA which results in a difference score (delta, ∆). Use a two-sample t-test to determine the difference of deltas between experimental and control group.\nCreate a graph to visualize the results of the main analysis as desired."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}