{
  "id": 13292,
  "origin_website": "Jove",
  "title": "Generation of Induced Neural Stem Cells from Peripheral Mononuclear Cells and Differentiation Toward Dopaminergic Neuron Precursors for Transplantation Studies",
  "procedures": [
    "All procedures must follow the guidelines of institutional human research ethics committee. Informed consent must be obtained from patients or healthy volunteers before blood collection. This protocol was approved by the institution's human research ethics committee and was performed according to the institution's guidelines for care and use of animals.\n1. Collection, isolation and expansion of PBMNCs\nCollection of PBMNCs\nCollect 10-20 mL of donor’s peripheral venous blood by venipuncture with a sodium heparin preservative vial.\n\t\tNOTE: Blood samples should be stored or shipped at room temperature (RT). Process the blood samples within 24 h.\nPreparation of culture medium\nPrepare serum free medium (SFM) by combining the following components: 245 mL of Iscove's modified Dulbecco's medium (IMDM), 240 mL of Ham’s F-12, 5 mL of insulin-transferrin-selenium-X supplement (ITS-X), 5 mL of 100x glutamine stock solution (Table of Materials), 5 mL of chemically defined lipid concentrate, 2.5 g of fetal bovine serum, 0.025 g of ascorbic acid and 9 μL of 1-thioglycerol. Filter the medium and store it at 4 °C.\n\t\tCAUTION: Ascorbic acid and 1-thioglycerol are toxic by skin contact and inhalation.\nTo prepare mononuclear cell (MNC) medium, supplement the SFM medium with 10 ng/mL human interleukin 3 (IL-3), 2 U/mL erythropoietin (EPO), 100 ng/mL human stem cell factor (SCF), 40 ng/mL human insulin-like growth factor 1 (IGF-1), 100 μg/mL holo-transferrin and 1 μM dexamethasone. Filter the medium and store it at 4 °C.\n\t\tNOTE: Prepare the medium immediately before use.\nIsolation of PBMNCs\n\t\nUltraviolet-sterilize a clean bench prior to use. Sterilize all surfaces and equipment with 75% alcohol. Sterilize all tips by using an autoclave.\nTransfer the peripheral blood (PB) into a 50 mL conical tube and dilute the PB with an equal volume of sterile Dulbecco's phosphate-buffered saline (D-PBS).",
    "Prepare 15 mL of sterilized density gradient medium (Tables of Materials) in another 50 mL conical tube.\n\t\tNOTE: Keep the density gradient medium and PB at RT to allow for better isolation of PBMNCs.\nTilt the conical tube containing the density gradient medium at a 45° angle, and then slowly and carefully lay 30 mL of diluted PB onto the density gradient medium.\n\t\tNOTE: Take care and allow the PB to slowly run down the side of the conical tube onto the density gradient medium layer. Red blood cells will deposit to the bottom of the tube. Tilt the tube carefully to minimize disruption of the layer interface.\nCentrifuge the tubes at 800 x g for 15 min at RT with the centrifuge brake set at \"off\" position. Aspirate the yellow, upper plasma layer and discard it. Then transfer the white cloudy thin film layer containing MNCs with a 10 mL pipette to a new 50 mL conical tube.\n\t\tNOTE: Switching centrifuge brake off is important for the isolation of MNCs.\nAdd 30 mL of D-PBS to the tube with MNCs and centrifuge at 600 x g for 10 min at 4 °C. Discard the supernatant, and then add 45 mL of D-PBS to re-suspend the cells. Centrifuge at 400 x g for 10 min at 4 °C.\n\t\tNOTE: The centrifuge brake should be switched on for this and the following centrifugation steps. As the cell pellets are dense, add 1-2 mL of D-PBS to gently re-suspend the pellets, and then add D-PBS to 45 mL.\nDiscard the supernatant and re-suspend the cells with 5 mL of D-PBS and count the live cells with the trypan blue exclusion method.\nAfter setting aside the MNCs needed for expansion, freeze the remaining cells for future use.",
    "NOTE: At least 5 x 106 MNCs can be frozen in one vial with 1 mL of freezing medium (Table of Materials). The protocol can be paused here.\nExpansion of MNCs\n\t\nOn day -14, seed MNCs at a density of 2-3 x 106 cells per milliliter in one well of six-well plates with 1.5 mL of pre-warmed (37 °C) MNC medium. Incubate at 37 °C, 5% CO2 for 2 days.\nOn day -11, collect the cells and medium with a sterilized pipette and transfer to a new 15 mL conical tube. Centrifuge the cells at 250 x g for 5 min at RT. Discard the supernatant and re-suspend the cells in 1 mL of pre-warmed (37 °C) MNC medium.\nCount the viable cells with trypan blue. Seed the MNCs at a density of 1 x 106 cells per milliliter in pre-warmed MNC medium and incubate at 37 °C, 5% CO2 for 3 days.\n\t\tNOTE: It is expected that the total number of cells may decrease on day -11.\nOn day -8, repeat steps 1.4.2-1.4.3 and culture the cells for 3 days.\nOn day -4, repeat steps 1.4.2-1.4.3 and culture the cells for 3 days.\n\t\tNOTE: After 14 days of culture, an equal or greater number of MNCs should remain in the culture.\n2. Reprogramming of PBMNCs to iNSCs by SeV Infection\nPreparation of solution and culture medium\n\t\nPrepare a poly-D-lysine (PDL) stock solution by dissolving 100 mg of PDL with 100 mL of H2O to a concentration of 1 mg/mL. Store at -20 °C in 1 mL aliquots.\nPrepare an insulin stock solution by dissolving 100 mg of insulin in 20 mL of 0.01 N HCl to a concentration of 5 mg/mL. Store at -20 °C in 1 mL aliquots.",
    "To prepare 200 mL of iNSC basal medium, combine 96 mL of DMEM-F12 and 96 mL of basic medium (Table of Materials) with 2 mL of 100x glutamine stock solution, 2 mL of nonessential amino acid (NEAA), 2 mL of N2 supplement and 2 mL of B27 supplement. Add 10 ng/mL recombinant human leukemia inhibitory factor, 3 μM CHIR99021 and 2 μM SB431542 prior to use. Filter the medium and store it at 4 °C.\n\t\tNOTE: Use the medium within 2 weeks. Add recombinant human leukemia inhibitory factor, CHIR99021 and SB431542 immediately before use.\nReprogramming of PBMNCs to iNSCs by SeV Infection\n\t\nUltraviolet-sterilize a clean bench prior to use. Sterilize all surfaces and equipment with 75% alcohol. Sterilize all tips using an autoclave.\nOn day 0, collect the cells in MNC medium and transfer to a 15 mL conical tube. Centrifuge the cells at 200 x g for 5 min. Aspirate the supernatant and re-suspend the cells with 1 mL of pre-warmed MNC medium.\nCount the viable cells with trypan blue. Re-suspend the cells with pre-warmed (37 °C) MNC medium to a concentration of 2 x 105 cells per well in 24-well plates.\nAfter removing the SeV tubes from -80 °C storage, thaw the tubes containing SeV in 37 °C water bath for 5-10 s, and then allow them to thaw at RT. Once thawed, place them on ice immediately.\nAdd the SeV encoding human Klf4, Oct3/4, SOX2 and c-MyC to the wells, at a multiplicity of infection (MOI) of 10. Centrifuge cells with plates at 1,000 x g for 30 min to facilitate the attachment of cells. Leave the cells and supernatant in the plates. Place the plates in the incubator at 37 °C, 5% CO2.",
    "CAUTION: All procedures involving SeV must be performed in a safety cabinet, and all tips and tubes should be treated with ethanol or bleach before disposal.\nOn day 1, transfer the medium and cells to a 15 mL centrifuge tube. Rinse the well with 1 mL of MNC medium. Centrifuge the cell suspension at 200 x g for 5 min. Aspirate the supernatant and re-suspend the cells with 500 μL of fresh pre-warmed MNC medium in 24-well plates.\n\t\tNOTE: Use a low attachment 24-well plate to prevent attachment of any cells before plating on PDL/laminin.\nOn day 2, dilute 1 mL of 1 mg/mL PDL with 19 mL of D-PBS to a concentration of 50 μg/mL. Coat 6-well plates with 50 μg/mL PDL for at least 2 h at RT.\nDilute 200 μL of 0.5 mg/mL laminin with 20 mL of D-PBS to a concentration of 5 µg/mL. Aspirate PDL in the 6-well plates, and dry on the vertical clean bench.\nCoat 6-well plates with 5 μg/mL laminin and incubate for 4-6 h at 37 °C. Wash with D-PBS before use.\nOn day 3, plate the transduced cells obtained in step 2.2.6 in iNSC medium on PDL/laminin-coated 6-well plates.\n\t\tNOTE: Move the plates gently if needed after the cells are placed on PDL/laminin-coated plates, trying not to disturb the attachment of the cells.\nOn day 5, add 1 mL of pre-warmed (37 °C) iNSC medium in each well in 6-well plates gently.\n\t\tNOTE: It is expected that the cells will undergo drastic death (>60%).\nOn day 7, add 1 mL of pre-warmed (37 °C) iNSC medium in each well in 6-well plates gently.",
    "From day 9 to day 28, replace spent medium with fresh pre-warmed (37 °C) iNSC medium every day. Monitor the emergence of iNSC colonies. Pick and transfer iNSC clones for expansion in about 2-3 weeks. Pick up colonies with appropriate morphology using burned glass pipettes, excluding any possibly contaminating cells, and aspirate the colonies with 200 μL tips.\n\t\tNOTE: The characterized iNSCs can be frozen for future use with 2-5 colonies in one vial. The freezing medium includes serum free basal medium (Table of Materials) and dimethyl sulfoxide mixed at a ratio of 9:1, which should be prepared immediately before use. The protocol can be paused here.\n3. Differentiation of iNSCs to dopaminergic neurons\nPreparation of solution and culture medium\n\t\nPrepare 200 mL of iNSC differentiation basal medium by combining 192 mL of DMEM-F12 with 2 mL of 100x glutamine stock solution, 2 mL of NEAA, 2 mL of N2 supplement and 2 mL of B27 supplement.\n\t\tNOTE: Use the medium within 2 weeks.\nPrepare iNSC differentiation stage I medium by supplementing the iNSC differentiation basal medium with 1 μM SAG1 and 100 ng /mL FGF8b.\n\t\tNOTE: Use the medium within 2 weeks.\nPrepare iNSC differentiation stage II medium by supplementing the iNSC differentiation basal medium with 0.5 mM cyclic adenosine monophosphate (cAMP), 0.2 mM ascorbic acid, 10 μM DAPT, 10 ng/mL brain derived neurotrophic factor (BDNF), 10 ng/mL glial derived neutrophic factor (GDNF) and 1 ng/mL transforming growth factor βIII (TGF-βIII).\n\t\tNOTE: Use the medium within 2 weeks.\nCoating the culture dishes\n\t\nUltraviolet-sterilize a clean bench prior to use. Sterilize all surfaces and equipment with 75% alcohol. Sterilize all tips using an autoclave.",
    "For PDL coating, at least one day before re-plating the cells, dilute 1 mL of 1 mg/mL PDL with 19 mL of D-PBS to a concentration of 50 μg/mL. Coat 12 mm glass coverslips that have been sterilized with 75% alcohol in the 24-well plates with 50 μg/mL PDL at RT for at least 2 h.\nFor laminin coating, dilute 200 μL of 0.5 mg/mL laminin with 20 mL of D-PBS to a concentration of 5 μg/mL. Aspirate PDL and dry the wells in the clean bench. Coat the 12 mm coverslips with 5 μg/mL laminin and incubate for 4-6 h at 37 °C. Wash with D-PBS before use.\nPassage cells for differentiation.\n\t\nWhen the confluence of cultured iNSCs reaches 70-90%, aspirate medium from the culture plate, and add 1 mL of D-PBS to wash the cells. Add 1 mL of pre-warmed (37 °C) cell dissociation reagent (Table of Materials) per well and incubate at 37 °C for 3 min to dissociate the cells.\nAfter incubation for 3 min, the cells have become semi-floating; add 3 mL of pre-warmed (37 °C) DMEM-F12 medium per well, and pipette cells up and down to dissociate cell pellets into single cells.\nTransfer cells into a 15 mL conical tube, and centrifuge at 250 x g for 3 min. Aspirate the supernatant, re-suspend the cells with appropriate volume of pre-warmed (37 °C) iNSC medium according to the number of cells.\nCount the cells using the trypan blue exclusion method. Plate 5 x 103 cells per 12 mm glass coverslip in 24-well plates and incubate at 37 °C, 5% CO2.\nDifferentiate iNSCs into dopaminergic neurons.",
    "Start differentiation 24 h after re-plating the cells onto PDL/laminin-coated coverslips. Aspirate culture medium, wash cells once with D-PBS, and then add 600 μL of pre-warmed differentiation stage I medium per well in 24-well plates and incubate at 37 °C, 5% CO2.\nChange medium every day from day 1 to day 10 during the first stage of differentiation.\nOn day 10, aspirate the culture medium, and wash cells once with D-PBS. Add 600 μL of pre-warmed (37 °C) differentiation stage II medium per well in 24-well plates and incubate at 37 °C, 5% CO2.\nChange medium every other day from day 11 to day 25 during the second stage of differentiation. The differentiated cells can be fixed by paraformaldehyde at different time points for analysis.\nFor immunofluorescent staining, wash the cells with D-PBS three times gently at chosen time points within differentiation day 11 to 25.\nPipette 300 μL of nonionic surfactant (Table of Materials) into 100 mL of PBS to make a 0.3% nonionic surfactant in PBS.\n\t\tCAUTION: Nonionic surfactant is toxic by skin contact and inhalation.\nFix the cells with 4% paraformaldehyde for 10 min at RT. Then wash with 0.3%  in PBS three times.\n\t\tCAUTION: Paraformaldehyde is toxic by skin contact and inhalation.\nBlock the cells by 3% donkey serum for 2 h at RT.\nDilute the primary antibody in 1% donkey serum at an appropriate concentration and gently triturate to mix. Add 300 μL of the primary antibody solution to each well of the 24-well plate. Incubate the cells at 4 °C overnight. Wash the cells with 0.3% nonionic surfactant in PBS three times.",
    "Dilute the secondary antibody in 1% donkey serum at an appropriate concentration and gently triturate to mix. Add 300 μL of the secondary antibody solution to each well of the 24-well plate. Incubate the cells at RT for 2 h, protected from light.\nWash the cells with 0.3% nonionic surfactant in PBS three times. Dilute 4',6-diamidino-2-phenylindole (DAPI) with PBS with 1:500 dilution. Incubate the cells in each well of the 24-well plate with 300 μL of diluted DAPI for 15 min at RT, protected from light. Wash the cells with 0.3% nonionic surfactant in PBS three times.\nGently take out the coverslips from the wells of plates with forceps. Dry in dark overnight at RT. Mount under a fluorescence microscope.\n4. Establishment of unilateral 6-hyroxydopamine (6-OHDA)-lesioned PD mouse models\nTo generate PD mouse models for cell transplantation, use adult male SCID-beige mice weighing 20-25 g for 6-OHDA injection.\nPreparation of drugs for surgery\n\t\nPrepare a 0.2% ascorbic acid solution by dissolving 0.2 g of ascorbic acid into 100 mL of sterilized saline (0.9%) and store at -80 °C until use. On the day of surgery, dilute 0.2% ascorbic acid solution by 10 times to obtain a 0.02% ascorbic acid solution.\n\t\tNOTE: Ascorbic acid is added to prevent oxidation of 6-OHDA to an inactive form.\nTo prepare a 6-OHDA solution, weigh appropriate amount of 6-OHDA into a sterilized 1 mL tube, and then add some volume of 0.02% ascorbic acid to make a 5 μg/μL 6-OHDA solution. Vortex the mixture until it is dissolved. Place the 6-OHDA on ice until use.\n\t\tNOTE: 6-OHDA is temperature and light sensitive. Be careful to protect the solution from light and keep it on ice before use.",
    "Prepare sterilized surgical equipment by autoclaving before surgery. Clean all equipment and surface areas with ethanol when setting up the stereotaxic frame. Set up a mouse recovery cage under a heating lamp.\nConduct surgery to establish unilateral 6-OHDA-lesioned mouse models.\n\t\nWeigh each mouse, record the weight and calculate the amount of drug that needs to be administered. Each mouse receives 0.5 mg/kg atropine 20 min prior to operations. Anesthetize the mouse with 80 mg/kg ketamine and 10 mg/kg xylazine.\nAdminister 0.5 mg/kg atropine by intraperitoneal injection.\nAnesthetize the mouse with 80 mg/kg ketamine and 10 mg/kg xylazine by intraperitoneal injection 20 min after administration of atropine.\nPut the mouse in a closed chamber. After 3-5 min, the mouse will be deeply anesthetized without response to hind leg pinch.\n\t\tNOTE: It is expected that the mouse that has received anesthesia would experience an excitation period.\nShave the head of mouse and apply erythromycin eye ointment on the eyes of mouse for protection from developing corneal ulcers.\nPlace the mouse on the stereotaxic apparatus. Fix the mouse with incisor bars firstly. Insert the ear cups correctly to make the mouse head in a flat and secure position.\nSterilize the head of the mouse with povidone iodine and isopropyl alcohol. Cut a sagittal incision (~1.5 cm) on the head skin with a scalpel blade, and expose the skull. Adjust the incisor bar and ear bars to reduce the height difference between bregma and lambda to less than 0.1 mm.\n\t\tNOTE: The mouse bregma is located at the intersection of coronal and sagittal sutures, and lambda is at the intersection of lambdoid and sagittal sutures.",
    "Slowly move and lower the tip of the needle towards bregma and treat the bregma as a zero point. Move the tip to a position with coordinates of A/P +0.5 mm, M/L -2.1 mm relative to bregma. Retract the tip and mark the point. Burr a little hole into the skull.\nExtract 2 μL of 5 μg/μL 6-OHDA solution into the microsyringe (Table of Materials). Return the needle to the point marked, and insert the needle to D/V -3.2 mm.\nInject 2 μL of 5 μg/μL 6-OHDA solution (10 μg total) at a rate of 1 μL/min. After injection of 6-OHDA is completed, leave the needle in place for another 5 min. Then retract the injection needle slowly.\nClose the incision with sutures and apply erythromycin eye ointment on the eyes of mouse. Deliver 0.5 mL saline subcutaneously to prevent dehydration, and apply an antibiotic ointment directly on the sutured skin.\nRemove the mouse from stereotaxic apparatus and put it in the recovery cage. Put the mouse back and allow access to food and water until it regains consciousness. Treat the mouse with analgesic in drinking water daily post-surgery for 2-3 days, and a recommended dosage of Ibuprofen is 0.03 mg/g of body weight per day.\nInspect the mouse daily post-surgery.\n5. Behavioral assessment after unilateral 6-OHDA lesioning\nTwo to three weeks following surgery, conduct behavioral assessment to estimate PD symptoms. Weigh each mouse, record their weight and calculate the amount of drug that should be administered (0.5 mg/kg apomorphine prior to assessment).\nAdminister 0.5 mg/kg apomorphine by subcutaneous injection before assessment and place the mouse in a glass cylinder.\nAfter a 5 min habituation period, count the number of contralateral and ipsilateral rotations relative to the lesion side per minute and record their activity with a video camera.",
    "Mice with contralateral minus ipsilateral rotations >7 rpm/min are considered successfully lesioned and selected as candidates for cell transplantation experiments. Return the mice to the housing cages after a 30-min rest.\n\tNOTE: If the mouse were successfully lesioned, 6-OHDA injected mouse will show a greater bias in turning towards contralateral side since the DA agonist activates the supersensitive denervated striatum of the lesioned side predominantly.\nConduct the behavioral assessment one week before and 2, 4, 6, 8, 12, 16 weeks after cell transplantation.\n6. Cell transplantation of DA precursors\nPrepare cell suspension for transplantation. For cell engraftment, suspend 2 x 105 DA precursors mixed by D10 and D13 DA precursors at a ratio of 1:7 in 4 μL of 5 g L-1 glucose in  balanced salt solution (Table of Materials) of transplantation buffer.\nPerform cell transplantation surgery following the procedures described in section 4.4, except that 6-OHDA is replaced by DA precursor cell suspension or buffer.\nPerform the behavioral assessment 2, 4, 6, 8, 12, 16 weeks after cell transplantation of DA precursors following the procedures described in section 5. Count the number of apomorphine-induced contralateral rotations relative to the lesion side per minute and record their activity with a video camera.\n\tNOTE: After transplantation, a reduced rate of contralateral rotations suggests an improved motor function.\nAt 4, 8 ,12, and 16 weeks after cell transplantation, perfuse the mouse under deep anesthesia with 4% paraformaldehyde until the body of mouse becomes stiff and the liver of mouse becomes pale.\nSeparate the brain of mouse gently and put the brain in 4% paraformaldehyde at 4 °C overnight.\nOn the second day, put the brain in 30% sucrose for dehydration until the brain sinks to the bottom.\nSlice the brains at 40 μm thickness by using a freezing microtome.",
    "Perform immunostaining as previously described in steps 3.4.5-3.4.12.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}