{
  "id": 4145,
  "origin_website": "Cell",
  "title": "Generation of hypoxia-sensing chimeric antigen receptor T cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nModifying a retroviral vector to contain a hypoxia-responsive promoter\nTiming:  +3 days (depending on sequencing service)\nThis protocol describes how to modify the SFG retroviral vector to contain a hypoxia-responsive promoter. To achieve this, the enhancer region of the 3′ long terminal repeat (LTR) in the SFG vector is modified to contain a poly-hypoxia-responsive elements (HRE) sequence.\nNote: Modification should be targeted to the 3′ LTR as this will be replicated to the 5′ LTR position upon integration of the provirus genetic material into the recipient host cell DNA (Levin et al., 2010[href=https://www.wicell.org#bib3]). HREs can be derived from genes that are upregulated in response to hypoxia (Liu et al., 1995[href=https://www.wicell.org#bib4]). Here we use HREs from human erythropoietin gene (EPO; Gene ID: 2056). We utilized a nine tandem HRE construct which is incorporated into the 3′ LTR using the XhoI/EcoRI restriction endonuclease cleavage sites (Figure 1[href=https://www.wicell.org#fig1]). Although increasing the number of tandem HREs are likely to further increase the strength of the promoter in hypoxia, a 9xHRE cassette was selected as it had an approximate base pair length to the enhancer region removed. However, it should be noted that the strength of the promoter is tunable, and the utilization of fewer HRE tandem repeats results in a weaker fold induction of the transgene (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/909-Fig1.jpg\nFigure 1. Overview of the cloning steps to modify the promoter of a CAR\n(1) Identification of the locus on the vector to be modified. (2) Synthesize fragment containing the HRE repeats. (3) Use restriction endonucleases to double digest the SFG vector and the HRE fragment and recover DNA from gel using a DNA ladder to guide band identification. (4) Ligate SFG backbone (A) and HRE fragment (B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/909-Fig2.jpg",
    "Figure 2. A tandem-HRE promoter provides tuneable but leaky hypoxia induction of a transgene\n(A) Tandem HRE repeats (3× or 9×) were modified in the SFG vector encoding a reporter transgene of Click beetle luciferase (Luc) and enhanced green fluorescent protein (eGFP; schematic on the left) and transduced in T-47D cells. After exposure for 18 h under either hypoxic (0.1% O2) or normoxic (20% O2) conditions, cells were assessed for their respective luciferase activity, presented as fold induction between the two conditions (n = 4-8).\n(B) Human T cells were stably transduced with the indicated CAR constructs (schematic on the left) and exposed for 18 h under either hypoxic (0.1% O2) (H) or normoxic (20% O2) (N) conditions prior to assessment of their surface CAR expression/cell presented as median fluorescence intensity of staining/cell (MFI) using flow cytometry analyses (n = 3). RLU value recorded was divided by the relative transduction efficiency for each construct (to normalize to the respective transduction efficiency). Bars represent mean and error bars represent S.D. ∗ p<0.05, ∗∗∗ p<0.001, ∗∗∗∗ p<0.0001.\nIdentify the locus in the SFG 3′ LTR enhancer region to be replaced for a hypoxia-responsive promoter.\nSynthesize the HRE fragment with the desired number of tandem HRE repeats as a synthetic DNA fragment (the 9xHRE fragment sequence is shown in Figure S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/909-Mmc1.extension]) with XhoI and EcoRI restriction sites flanked by at least 6 b.p. overhangs to allow efficient cleavage. These overhang b.p. are a random sequence, however, the extra b.p. should be chosen so that palindromes and primer dimers are not formed.\nNote: Synthetic DNA fragments can be ordered from Integrated DNA Technologies (IDT), GenScript, or others.\nAlternatives: Besides synthetic DNA fragments other cloning methods can be used such as overlapping PCR and HiFI.",
    "Double restriction endonuclease digest your construct containing the SFG backbone and your synthetic DNA fragment containing the HRE repeats.\nSet the following reaction for the vector and backbone in separate tubes:\ntable:files/protocols_protocol_909_5.csv\nIncubate at 37°C for 1 h.\nNote: Enzyme volume should not exceed 10% of the total reaction volume to prevent non-specific restriction activity. For enzyme-specific digestion protocols refer to: http://nebcloner.neb.com/#!/redigest[href=http://nebcloner.neb.com/]\nAdd Gel Loading Dye, Purple (6×) to the digestion products; 10 μL for a standard 50 μL reaction.\nRun the digested sample containing loading dye on a 1% agarose gel containing 0.5 μg/mL ethidium bromide, for the duration needed to observe a clear separation of the 2 bands in the digested SFG vector backbone (Figure 1[href=https://www.wicell.org#fig1]).\nCut the individual bands of interest from your gel (Figure 1[href=https://www.wicell.org#fig1]) using a scalpel on a UV light box.\nCritical: Minimize the exposure of UV light on your gel while imaging on a UV light box to avoid DNA damage.\nRecover the DNA from the excised gel bands using QIAquick Gel Extraction Kit, according to manufacturers’ handbook: https://www.qiagen.com/ch/products/discovery-and-translational-research/dna-rna-purification/dna-purification/dna-clean-up/qiaquick-gel-extraction-kit/[href=https://www.qiagen.com/ch/products/discovery-and-translational-research/dna-rna-purification/dna-purification/dna-clean-up/qiaquick-gel-extraction-kit/]\nAlternatives: Other kits are available, for example, Monarch® DNA Gel Extraction Kit.\nNote: At this stage, the SFG backbone fragment and the HRE fragment bear flanking compatible sticky ends that can be annealed.\nLigate the digested SFG backbone (7,516 b.p.) and the digested HRE synthetic DNA fragment (1,480 b.p.) together using T4 DNA Ligase, at a molar ratio of 3:1 insert to vector, according to manufacturers’ protocol: https://international.neb.com/protocols/0001/01/01/dna-ligation-with-t4-dna-ligase-m0202[href=https://international.neb.com/protocols/0001/01/01/dna-ligation-with-t4-dna-ligase-m0202]\nTransform One Shot™ Stbl3™ chemically competent E. coli with the ligation mix and spread transformed bacteria on a Luria broth (LB) agar plate containing 100 µg/mL ampicillin for selection as per manufacturers’ protocol: https://www.thermofisher.com/order/catalog/product/C737303#/C737303[href=https://www.thermofisher.com/order/catalog/product/C737303]",
    "Note: It is recommended to perform a parallel control ligation in which nuclease-free water, in place of the insert, is added to SFG backbone. This control ligation mixture can then be transformed as described above and can serve as a negative control in the transformation reaction, thereby giving the background signal. Although the gel-purified SFG backbone is not expected to re-ligate as it is flanked by incompatible sticky ends (XhoI and EcoRI), this negative control reaction ensures that the SFG backbone was completely digested and specifically recovered from the gel. In principle, this control should be free of colonies, but in reality, it may have some amount of background (for example from contamination with uncut plasmid). Ideally, the SFG backbone and insert ligation should, at least, have substantially more colonies than the vector and water control ligation.\nWhen bacterial colonies are visible on the LB agar plate, select a few colonies to grow up in 3 mL cultures of LB media containing 100 μg/mL ampicillin 16 h at 37°C, with agitation.\nPurify plasmid using a Mini Prep kit (Qiagen) and analyze the purified vectors by sequencing to confirm that the correct plasmid has been generated, from now on named SFG-HRE.\nNote: The resulting SFG-HRE construct, is leaky for the expression of transgenes (including a CAR) in normoxia (Figure 2[href=https://www.wicell.org#fig2]), but is used as the base vector into which an oxygen-dependent degradation domain (ODD)-appended transgene is cloned to create the stringent dual hypoxia-dependent CAR expression system.\nModifying a CAR to contain an oxygen-dependent degradation domain\nTiming:  +3 days (depending on sequencing service)\nThis section describes how to append an ODD to a CAR. This is achieved by directly fusing a human ODD (a.a. residues 401–603) from HIF-1α to the C-terminus of the CAR CD3ζ cytoplasmic domain (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/909-Fig3.jpg",
    "Figure 3. Overview of the cloning steps to append an ODD to a CAR\n(1) Identify locus on the vector (SFG-HRE) to be modified along with proximal unique restriction sites (in this case NcoI/XhoI). (2) Synthesize fragment containing the ODD flanked by sequence identical to the CAR sequence including the proximal restriction sites identified (NcoI/XhoI) and at least 6 additional random b.p. overhangs (to allow efficient restriction endonuclease cleavage) to either side. (3) Double digest the SFG-HRE CAR and the ODD-containing synthetic fragment and recover DNA from gel (fragments to be recovered from gel are indicated). (4) Ligate DNA fragments (A) and (B).\nNote: If space in the vector is limited, a smaller fragment of the ODD could be used (Figure 4[href=https://www.wicell.org#fig4]A). In our initial optimization, we directly appended three potential human HIF-1α-derived ODD residues: a.a. residues 401–603, 530–603, and 530–653. All three ODDs resulted in a significant destabilization of the protein of interest under conditions of normoxia (Figure 4[href=https://www.wicell.org#fig4]A) and conferred stabilization of the fusion partner in hypoxia (data not shown).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/909-Fig4.jpg\nFigure 4. An ODD partially destabilizes a CAR in normoxic conditions\n(A) Three human HIF1α-derived ODD residues (a.a. residues 401–603, 530–603, and 530–653, schematic on left of Figure) were appended to the luciferase gene in the reporter SFG vector and transduced in T-47D cells. After exposure for 18 h under normoxia, cells were assessed for their respective luciferase activity, presented as RLU. (n = 3-7).",
    "(B) Human T cells were stably transduced with a SFG vector containing T4-CAR or T4-CAR-ODD (a.a. residues 401–603) (schematic on the left) and exposed for 18 h under either hypoxic (H) or normoxic (N) conditions prior to assessment of their surface CAR expression presented as percentage of normalized CAR expressing cells relative to the non-ODD appended CAR under conditions of normoxia using flow cytometry analyses (n=3). Values were normalized to the relative transduction efficiency of each construct as assessed by qPCR to enable accurate comparisons across constructs. Bars represent mean and error bars represent S.D. ∗∗: p<0.01, ∗∗∗: p<0.001, ∗∗∗∗: p<0.0001.\nIdentify the locus on the vector (SFG-HRE) to be modified along with two proximal unique restriction sites (one upstream and one downstream as the multiple cloning site can vary). In our SFG-HRE CAR vector we chose to append the ODD on the C-terminus of the CAR directly after the CD3ζ intracellular domain, and selected the NcoI and XhoI in the multiple cloning site of the SFG vector as proximal unique restriction sites.\nSynthesize the ODD fragment to be appended to the C-terminus of the CAR as a synthetic DNA fragment (can modify sequence shown in Figure S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/909-Mmc1.extension]).\nAlternatives: Different lengths of ODDs can be used as stated before (Figure 4[href=https://www.wicell.org#fig4]A). Although not tested in this system, ODDs can be also placed at the N-terminus of a protein of interest (Smirnova et al., 2010[href=https://www.wicell.org#bib8]) and/or linkers can be interposed between for flexibility and/or additional spacing from the fusion partner. Linkers may be used in case the ODD interferes with the function of its fusion partner.\nDouble restriction endonuclease digest your HRE-modified SFG vector and your synthetic DNA fragment containing the CAR-ODD using NcoI and XhoI enzymes.\nSet the following reaction for the fragment and vector in separate tubes:\ntable:files/protocols_protocol_909_6.csv",
    "Note: Volumes and masses may be needed to optimize, depending on the construct being used.\nIncubate at 37°C for 1 h.\nRepeat steps 4 to 11 on the SFG-HRE vector and CAR-ODD insert. The bands of interest are the digested SFG-HRE backbone (6,391 b.p.) and the digested ODD synthetic DNA fragment to be used as the insert (1,824 b.p.) (Figure 3[href=https://www.wicell.org#fig3]). The resulting construct containing the dual hypoxia-sensing system (HRE promoter and ODD) will be referred to herein as ‘HypoxiCAR’.\nNote: The resulting HypoxiCAR construct can then be used for retrovirus production and transduction of T cells as described in the sections below.\nTransfection - transient virus production\nTiming: 7 days\nThe step of transfection allows the introduction of plasmid DNA into eukaryotic cells. This protocol uses FuGENE Transfection Reagent, a non-liposomal formulation, to introduce DNA into HEK293T cells. This method results in transient expression of the vector for retrovirus production (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/909-Fig5.jpg\nFigure 5. Workflow of virus production\n(1) HEK 293T cells are seeded 1 day prior to transfection. (2) Transfection process is performed. (3) Media is replaced (optionally virus-containing supernatant can be harvested and used or stored as indicated). (4) 48 h viral supernatant is harvested. (5) 72 h viral supernatant is harvested. POI: plasmid of interest (i.e., HypoxiCAR construct); O/N: overnight 16 h culture.\nNote: There are also other protocols to efficiently produce retroviral particles carrying the transgene of interest. Should such protocols already be established in users’ laboratory, if preferred, these can be used to generate transgene-carrier retrovirus.\nAt least four days before the transduction:\nThaw a vial of HEK293T cells in the water bath at 37°C.",
    "Note: Transfection can also be performed with HEK293T cells kept in culture. However low passages of this cell line often produce higher titers of transient virus, leading to higher transduction efficiencies.\nSeed the content of the HEK293T vial (approximately 1 × 107 cells in 1 mL) in a T75 flask in 25 mL 37°C pre-warmed I10 medium.\nPlace flask into incubator at 37°C and 5% CO2.\nCheck for confluency on ensuing days.\nOne day before the transfection:\nPrepare a suspension of HEK293T cells at 2.3 × 105 cells/ mL in I10.\nAdd 11 mL of the HEK293T suspension to a 100 mm plate, for a total of 2.5 × 106 cells per plate.\nNote: One plate is required per construct. One 100 mm plate of HEK293T cells will produce around 20 mL of viral supernatant (2 harvests), enough to transduce 4 × 106 human T cells. This step can be downscaled or upscaled as required.\nGently rock the plate to ensure aneven distribution of cells across the plate.\nPlace plate into incubator.\nThe day of the transfection, per 100 mm plate:\nIn a 1.5 mL Eppendorf tube add 1.133 mL of IMDM media and 68 μL of FuGENE reagent.\nIn another 1.5 mL Eppendorf tube mix the 5.6 μg RDF (RD114-encoding) envelope plasmid, 8.5 μg Peq-Pam-env (encoding gag and pol) and 8.5 μg of the vector plasmid of interest (ideally with a total volume of <100 µL).\nMix the contents of the tubes in steps 18a and 18b and incubate at 20°C–22°C for 15 min.\nAdd the mixture dropwise to the HEK293T cell plate and gently rock the plate to evenly distribute the mixture.\nPlace the plate back into the incubator.\nTwenty four hours after transfection:",
    "Remove and discard media from the plate and replace with 11 mL of prewarmed fresh I10 media.\nPlace plate back into the incubator.\nNote: Replace the media gently, trying not to detach the transfected 293T cell monolayer.\nForty eight hours post transfection:\nHarvest the media (containing the viral particles produced) into a 50 mL Falcon tube and store at 4°C. Replace with 11 mL of warm fresh I10 media.\nReturn the plate to the incubator.\nSeventy two hours post transfection:\nHarvest the virus-containing media into a 50 mL Falcon tube and store at 4°C.\nFilter the harvested 48 and 72h media using a 0.45 μm sterile filter. The filtered viral supernatants can be used for T cell transduction or snap-frozen in liquid nitrogen and stored at −80°C until required.\nNote: Retrovirus titer gradually drops upon storage at 4°C and it is thus recommended not to store retrovirus at 4°C for extended time periods (more than 1 day) prior to use or freezing.\nNote: Virus-containing media supernatant harvested at 48 h or 72 h post-transfection can be also filtered separately on respective harvest day as indicated in 20 and 21 and used fresh or snap frozen for storage (if pooling of 48 h and 72 h viral supernatant is not desired).\nNote: Filtering viral supernatant using 0.45 μm sterile filters can cause significant viral particle loss. In place of this, the user can opt to centrifuge the virus-containing media at 500 × g for 5 mins to pellet any contaminating cells or debris and then remove the viral supernatant (being careful not to disturb any pelleted material) to a fresh tube before snap freezing or using fresh.\nPeripheral blood mononuclear cell isolation\nTiming: 3 h",
    "This section describes how to isolate peripheral blood mononuclear cell (PBMCs) from human blood by Ficoll gradient centrifugation (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/909-Fig6.jpg\nFigure 6. Purification of T cells from peripheral blood mononuclear cells\n(1–6) Peripheral Blood Mononuclear Cell (PBMC) Isolation. (1) Peripheral blood withdrawal. (2–3) Ficoll density gradient centrifugation to separate blood components. (4) Harvest PBMC layer using sterile Pasteur pipette and transfer in RPMI. (5) PBMCs are washed twice in RPMI and resuspended in R5 media. (6) Cell counting. (7) Negative selection of T cells using magnetic beads. (8–10) T cells are counted and activated as shown.\nWithdraw peripheral blood (typically 50 mL) from a healthy donor with informed consent.\nTransfer the blood from the collection tubes to 50 mL Falcon tubes.\nDilute the blood 1:1 with RPMI media (in 50 mL Falcon tubes or another sterile vessel to accommodate the total volume).\nIn another 50 mL Falcon tube, add 15 mL of Ficoll-Paque Plus.\nCarefully transfer 30 mL of the diluted blood to the Ficoll-Paque tubes as not to disturb the Ficoll layer.\nCentrifuge the 50 mL tubes at 750 × g for 30 min at 20°C (acceleration and brake set to 0) to separate the PBMC cell fraction.\nTransfer the PBMC layer, seen as an interface between the plasma and the Ficoll layer (Figure 6[href=https://www.wicell.org#fig6]), using a sterile Pasteur pipette to a fresh 50 mL tube.\nNote: After centrifugation, the layer above the PBMC fraction which contains plasma can be carefully removed using a Pasteur pipette to make the PBMC layer easier to harvest.\nIn the 50 mL tube containing the PBMCs, add RPMI media to a final volume of 50 mL and centrifuge at 500 × g for 5 min. The acceleration and brake can be set back to 9.",
    "Aspirate and discard the supernatant leaving the pelleted cells.\nIf more than one tube has been used (due to the volume size), the pellets can be resuspended in RPMI and combined and the cells are once again brought up to a final volume of 50 mL of RPMI for a second wash.\nCentrifuge at 500 × g for 5 min.\nAspirate and discard the supernatant.\nResuspend the cell pellet in 10 mL of R5 media.\nT-cell isolation and activation\nTiming: 2 h\nThis protocol describes how to purify T cells from the PBMC fraction using human pan T cell isolation kit (Miltenyi Biotec), a MidiMACs separator and LS columns (Miltenyi Biotec) and how to activate purified T cells using CD3/CD28 Human T-Activator Dynabeads (Gibco) (Figure 6[href=https://www.wicell.org#fig6]).\nFor T cell isolation:\nCount the cells from the PBMC fraction and proceed according to the manufacturers’ protocol: https://www.miltenyibiotec.com/US-en/products/pan-t-cell-isolation-kit-human.html#gref[href=https://www.miltenyibiotec.com/US-en/products/pan-t-cell-isolation-kit-human.html]\nFor T cell activation:\nWash the CD3/CD28 Human T-Activator Dynabeads according to the manufacturers’ protocol: https://www.thermofisher.com/uk/en/home/references/protocols/proteins-expression-isolation-and-analysis/t-cell-activation-and-expansion/dynabeads-human-t-activator-cd3-cd28.html[href=https://www.thermofisher.com/uk/en/home/references/protocols/proteins-expression-isolation-and-analysis/t-cell-activation-and-expansion/dynabeads-human-t-activator-cd3-cd28.html]\nResuspend the purified T cells at a concentration of 3 × 106 cells/mL in R5 media.\nAdd Dynabeads Human T-Activator CD3/CD28 at a bead-to-cell ratio of 1:1.\nSeed 3 mL of the T cells containing the Dynabeads (3 × 106 cells/mL) per well on a TC-treated 6-well plate.\nPlace plate into incubator.\nAfter 24 h add recombinant human IL-2 at a final concentration of 100 IU/mL.\nRetroviral-mediated T cell transduction\nTiming: 3 days\nThis section describes the steps for retroviral-mediated transduction of human T cells. This method ensures the integration of the inserted coding DNA contained in the construct into the host T cell genome, thereby permitting stable expression of the transgene (Figure 7[href=https://www.wicell.org#fig7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/909-Fig7.jpg\nFigure 7. Workflow of CAR T cell production",
    "(1) RetroNectin coating. (2) Transduction setup. (3) Incubation to allow viral infection of target cells. (4) Expansion/enrichment of T cells. (5) Transduction efficiency measurement via quantitative PCR for accurate quantification of transgene abundance in the target cell population. (6) Evaluation of T cell phenotype and function (in vitro and in vivo).\nOne day before the T cell transduction:\nAdd 20 μg/mL RetroNectin (Takara Bio Inc.) to sterile PBS with a volume corresponding to 4 μg/cm2 to a non-tissue culture treated 6-well plate (2 mL of RetroNectin in PBS solution per well of a 6-well plate). Use one well per construct of interest and one for non-transduced and/or mock transduced control.\nPlace lid on plate and wrap edges with parafilm to prevent evaporation and incubate for 16 h at 4°C.\nOn the day of the T cell transduction:\nTake out the RetronNectin-coated plate from the fridge and aspirate the RetroNectin/PBS solution from the well.\nOptional: Plates can be blocked using serum-containing media (2 mL per well) for 30 min at 20°C–22°C. Following blocking, media is removed.\nAdd 2 mL of either fresh or thawed (if frozen) virus from the previous steps and incubate for 4 h at 4°C.\nRemove the Dynabeads from the T cells. Harvest the cells into a tube and place the tube on a magnet for 2 min to separate the beads from the solution. Transfer the supernatant containing the cells to a new tube and count the cells.\nTake out the virus coated plate from the fridge and remove and discard the liquid supernatant from the well.\nAdd 3 mL of fresh or snap-frozen virus and add 1 × 106 T cells in 1 mL R5 media per well.\nPlace plate into incubator.\nCAR T-cell expansion",
    "Timing:  +3 days (depending on the quantity of CAR T cells required)\nThis section describes how to maintain and expand CAR T cells in culture (Figure 7[href=https://www.wicell.org#fig7]).\nAssess T cell growth every day after transduction.\nOn the day after the T cell transduction:\nAdd recombinant human IL-2 into the wells at a final concentration of 100 IU/mL.\nPlace plate into incubator.\nThree days after T cell transduction:\nGently harvest the T cells.\nRe-plate in a 6-well plate in fresh R5 supplemented with fresh IL-2 (100 IU/mL).\nNote: For T cells transduced with the 4αβ chimeric receptor (that is specific to T4), instead of IL-2, T cells are enriched in culture following transduction using human IL-4 (Peprotech) at 30 ng/mL final concentration (Wilkie et al., 2010[href=https://www.wicell.org#bib11]). In the absence of an enrichment approach, concentrated virus can be used to improve transduction efficiencies.\nPlace plate/flask into incubator.\nNote: CAR T cells ideally should be kept at a density of 1 × 106 cells/mL.\nEvery two to three days:\nIf required, add R5 media and move cells into larger plates or flasks.\nAdd 100 IU/mL of IL-2 into the cultures.\nPlace plate/flask into incubator.\nNote: It is recommended to count T cells every 2–3 days and adjust their concentration to 1 × 106 cells/mL using fresh IL-2-supplemented R5 to maintain an optimal cell state during expansion.\nAssessment of HypoxiCAR T cell transduction efficiency via quantitative PCR\nTiming: 1 day",
    "This section describes how to assess the transduction efficiency of HypoxiCAR T cells. Since the expression of HypoxiCAR is conditional and not constitutive, standard surface staining of the CAR and subsequent flow cytometry analysis would not permit an assessment of the transduction efficiency for this approach without exposure to hypoxia (for 18 h). Therefore, quantitative PCR can be used as an assessment to determine the efficiency of transduction. To undertake this analysis, it is necessary to have identified primer pairs that specifically amplify the transgene of interest or CAR (for T4 CAR we used primer pairs specific to the T2A ribosomal skip peptide sequence) and a reference genomic housekeeping gene for which we selected TBP. The primer pairs we used for this analysis are listed in key resources table[href=https://www.wicell.org#key-resources-table]. These primers were used to measure stably integrated transgene abundance and hence transduction efficiency. In case T2A is absent from the SFG construct transduced (for example in non-bicistronic CAR-only SFG vectors), specific primers that bind either in the ORF (open reading frame) or in the SFG backbone can be designed and validated in situ. The advantage of using specific primers binding in the SFG backbone is that these can be used universally in any SFG vector transduced.\nExtract genomic DNA from the T cell culture using a DNeasy Blood & Tissue Kit (QIAGEN) according to manufacturers’ Quick Start protocol: https://www.qiagen.com/us/products/discovery-and-translational-research/dna-rna-purification/dna-purification/genomic-dna/dneasy-blood-and-tissue-kit/[href=https://www.qiagen.com/us/products/discovery-and-translational-research/dna-rna-purification/dna-purification/genomic-dna/dneasy-blood-and-tissue-kit/]\nNote: DNA extraction should be performed at least 4 days after retroviral transduction (to ensure stable integration of the vector). It is important for qPCR for all samples to be analyzed to use the same starting quantity DNA. Using 100 ng per sample is recommended.\nThaw your primers and the KiCqStart SYBR Green qPCR ReadyMix with ROX Reagent.",
    "Set up your qPCR Master Mix as shown in ‘Materials and equipment[href=https://www.wicell.org#materials-and-equipment]’ section, with all required components except sample template (genomic DNA). Vortex gently to mix reaction.\nAdd your qPCR Master Mix to your reaction plate.\nAdd your template (genomic DNA) to your reaction plate.\nOptional: In additional wells, add nuclease-free water in place of genomic DNA. This reaction will serve as a negative control for the qPCR assay.\nSeal your reaction plate using an adhesive PCR Plate seal to prevent evaporation.\nVortex gently to mix reaction.\nCentrifuge plate at 500 × g for 1 min to collect components at the bottom of the reaction tube.\nPlace plate in an ABI 7900HT Fast Real Time PCR instrument (or equivalent compatible).\nSet your real time-PCR cycling conditions as follows:\ntable:files/protocols_protocol_909_7.csv\nCollect data from the machine.\nData analysis uses the threshold cycle (Ct) value of each sample. The Ct value represents the cycle at which the qPCR product reaches the set threshold value and hence the amount of product present.\nAssumptions: This approach makes the assumption that there is equal transduction across the cell population. As opposed to flow cytometry-based quantification of transduction efficiency, the qPCR method does not provide single-cell information. Nevertheless, it provides a measurement of the abundance of the transgene (in comparison to the reference gene) in a given cell population. This value/abundance can be used to normalize data and make accurate comparisons between samples.\nHypoxia-response assessment via flow cytometry\nTiming: 2 days\nThis protocol explains how to assess the response of the HypoxiCAR to experimental hypoxia and also provides an alternative method to test transduction efficiency at the single cell level. This was performed using a hypoxic chamber followed by staining of the CAR and subsequent flow cytometry analysis.",
    "Harvest T cells from the transduced and non-transduced cultures into 15 mL Falcon tubes. Assuming that the concentration of T cells is maintained at approximately 1 × 106 (as recommended in this protocol), harvest at least 2.5 mLs from each T cell culture.\nCentrifuge the tubes 500 × g for 5 min.\nRemove the supernatant.\nResuspend T cells in 1 mL of R5 media.\nCount cells according to your own method.\nAdjust concentration of the cell suspension to 1 × 106 cells/mL.\nAdd 1 mL of the cell suspension to a 24-well plate of your transduced constructs and non-transduced cells. Repeat this in another 24-well plate, to assess for both conditions, normoxia (20% O2, 5% CO2, N2 balance) and experimental hypoxia (0.1% O2, 5% CO2, N2 balance).\nPlace one of the plates inside a hypoxic chamber, on top of the polycarbonate tray.\nNote: Place a 20 mm Petri dish containing 10–20 mL of sterile water in the chamber under the polycarbonate tray, to prevent excessive evaporation of cultures.\nPlace the lid on the base and close the chamber properly, by closing the ring clamp.\nAttach your system to the gas flow meter and gas cylinder (Figure 8[href=https://www.wicell.org#fig8]). For reference you can also see this video: https://www.stemcell.com/technical-resources/the-hypoxia-chamber-how-to-assemble-and-purge-the-chamber.html[href=https://www.stemcell.com/technical-resources/the-hypoxia-chamber-how-to-assemble-and-purge-the-chamber.html]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/909-Fig8.jpg\nFigure 8. Apparatus set up for hypoxic chamber to assess hypoxia-responsive CAR expression\nSchematic of the components needed and set up to perform the hypoxia-response CAR T cell assessment.\nOpen both clamps for the inlet and outlet tubing of the hypoxic chamber.\nConnect the bottom connection of the flow meter to the inlet tubing of the tank.\nConnect the tubing coming out from the flow meter to the tube inlet of the chamber.\nOpen the gas cylinder valve.\nOpen the regulator valve control clockwise to 8–10 psi.",
    "Adjust the flow meter to 25 L/min.\nPurge the chamber with a flow rate of 25 L/min for 4 min.\nClose the valve on the gas cylinder to prevent the gas flow.\nImmediately close both of the clamps for the inlet and outlet tubing for the hypoxic chamber.\nDisconnect the tubing from the chamber.\nTurn off the valve control.\nPlace chamber into the incubator. Next to the chamber and inside the incubator place the normoxic plate.\nAfter 1 h, re-purge chamber by repeating steps 66–76.\nPlace chamber into the incubator for at least 17 h.\nNote: For accurate comparison of hypoxia vs normoxia effect, it is recommended that the normoxic plate is placed next to the chamber when it is purged and re-purged prior to their return to the incubator. This is done to ensure that both plates are exposed to identical conditions (apart from O2 concentration) during the period of the assay.\nPause point: Cultures will remain in the chamber for at least 18 hours in total, to allow sufficient amount of CAR (or the oxygen-controlled protein of interest) to be expressed.\nTake the hypoxic chamber out of the incubator.\nOpen the outlet tubing clamp.\nNote: To make sure the chamber was properly sealed, a puff sound rather than a continuous flow should be audible when you open the outlet valve.\nOpen the hypoxic chamber by pulling the ring clamp to release the lid.\nTake 200 μL of the T cell suspension from the normoxic and hypoxic conditions and add them to respective wells of a 96-well plate or Eppendorf tube for antibody staining for flow cytometry.\nSpin the plate or tube at 500 × g for 5 min.\nRemove supernatant and resuspend in 200 μL FACs buffer (PBS, 1% FBS, 0.1% sodium azide).",
    "Proceed with your standard flow cytometry detection method for CAR expression using flow cytometry."
  ],
  "subjectAreas": [
    "Cell Separation/Fractionation",
    "Immunology",
    "Biotechnology And Bioengineering",
    "Cell Isolation",
    "Flow Cytometry",
    "Cancer",
    "Cell Culture",
    "Cell-Based Assays",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}