{
  "id": 6792,
  "origin_website": "Bio",
  "title": "A Simple and Fast Battery Test for Phenotypic Characterization of Mice",
  "procedures": [
    "General rulesArena must be placed under indirect light avoiding darkened areas or shadowed zones. The video camera must be placed above and center-aligned with the arena providing an entire coverage within the recording frame.Test must be performed in an isolated room, free from loud noises in order not to disturb animals during the procedure. If a quiet place is not possible using a white noise can be helpful to minimize disturbance from other noises.Animal identification can be written on a paper and placed on the floor, so it is recorded by the video camera during the whole procedure.Keep mice inside their home cages in the test room for 30 min to acclimation.Before each session, the arena must be cleaned with a 5% ethanol solution to prevent possible bias caused by odor cues left by the previous mouse.Camera must start recording before animal is placed in the arena center to avoid data loss.Parameters are supposed to be tested in a sequence in order to follow an increasing stress level, so that a first response does not interfere with the following one.All parameters must be evaluated in the same arena, unfamiliar for the animals, aiming to minimize stressful situations for animals. Be sure to take notes of every parameter evaluated. Observational parameters can be analyzed on the video, later.Test procedure/Data collectionAfter acclimation time, turn on the camera and gently remove mouse from home cage and immediately place it–each mouse, in the same position every time–in the center of the arena, at the test chamber.Once the animal is inside the arena, leave the chamber and record animal activity for 5 min. After recorded activity, return to the chamber in order to start the tests for subsequent parameters. It is not mandatory to record the following part of the procedure.",
    "Scores are described in Table 1.Table 1. Parameters related to the general activity, sensory nervous system, sensorimotor system, central nervous system (CNS) and autonomic nervous system (ANS)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200326/20200326193008_7332.jpgParameters classification was adapted from SHIRPA procedure (Rogers et al., 1997).Observational parameters (Table 1)General activity (Video 1)<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Observational Parameters–General activity. Video illustrates general activity parameters: rearing, grooming, and locomotion. (Experiments on animals were approved by the Animal Care and Use Ethics Committee of the School of Veterinary Medicine and Animal Science, University of São Paulo, Brazil (protocol number 3773120116, FMVZ-USP) and the Institute of Biomedical Science under protocol number 053, page 32, book 3 (2015).)General activity parameters are supposed to be quantified. Locomotion can be analyzed by software (blank arena) or by directly counting sectors covered by animals in an arena having a grid-drawn floor.Rearing. Frequency of standing up events. Animal stands with or without leaning paws on arena walls.Grooming. Frequency and period of self-grooming activity. Animal cleans its face and/or body.Locomotion: Animal walking activity in the arena.Sensorimotor systemMuscle tone. Animal presents continuous and passive partial muscle contraction, in order to maintain its body posture (Video 2).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Observational Parameters–Sensorimotor system. Video illustrates hindquarter angulation, an observational parameter related to the sensorimotor system. (Experiments on animals were approved by the Animal Care and Use Ethics Committee of the School of Veterinary Medicine and Animal Science, University of São Paulo, Brazil (protocol number 3773120116, FMVZ-USP) and the Institute of Biomedical Science under protocol number 053, page 32, book 3 (2015).)Hindquarter angulation. Animal presents an increased hindquarter angulation, which can lead to walking difficulties.Central nervous system (Video 3)<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 3. Observational Parameters–Central Nervous System. Video illustrates observational parameters related to central nervous system: straub tail, ataxia and tremor.",
    "(Experiments on animals were approved by the Animal Care and Use Ethics Committee of the School of Veterinary Medicine and Animal Science, University of São Paulo, Brazil (protocol number 3773120116, FMVZ-USP) and the Institute of Biomedical Science under protocol number 053, page 32, book 3 (2015).)Straub tail. Tail becomes rigid and erect when animal is walking and/or restingAtaxia. Lack of voluntary coordination of muscle movements, gait abnormality.Tremor. Animal presents tremor when walking and/or resting.Autonomic nervous systemUrination. Number of urine spots.Defecation. Number of fecal boli.Interventional parametersSensory nervous system (Video 4)Response to touch. Gently approach forceps to the animal body, touching it by lateral position for more than 15 s. Observe mouse reaction.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 4. Interventional (need the interference of a stimulus [Skinner, 1950]) Parameters–Sensory Nervous System. Video illustrates interventional parameters related to sensory nervous system: response to touch [score 2–walks slowly and score 4–walks with agility or runs (baseline)]; auricular reflex [score 1 (absent) and score 4–ears rotate outwards and/or back (baseline)]; corneal reflex [score 3–eyes completely closed (baseline)] and tail flick [score 4–run a d jump (baseline). (Experiments on animals were approved by the Animal Care and Use Ethics Committee of the School of Veterinary Medicine and Animal Science, University of São Paulo, Brazil (protocol number 3773120116, FMVZ-USP) and the Institute of Biomedical Science under protocol number 053, page 32, book 3 (2015).)Auricular reflex. Approaching from the side, snap fingers near the ear of the animal and evaluate ears stance.Corneal reflex. Gently approximate the forceps close to the eye of the animal but do not touch it. Be careful to avoid touching whiskers and observe mouse reaction.Tail flick. With forceps tightly press the tip of the tail and observe mouse reaction.Sensorimotor system (Video 5)<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 5. Interventional Parameters–Sensorimotor System.",
    "Video illustrates interventional parameters related to sensorimotor system: surface righting reflex [score 4–returns fast to prone position (baseline)] and grasp strength [score 1–does not hold the grid (absent) and score 2–holds the grid but quickly release it (2-9 s)]. (Experiments on animals were approved by the Animal Care and Use Ethics Committee of the School of Veterinary Medicine and Animal Science, University of São Paulo, Brazil (protocol number 3773120116, FMVZ-USP) and the Institute of Biomedical Science under protocol number 053, page 32, book 3 (2015).)Surface righting reflex. Gently turn the animal into its back and place it in supine position. Hold it for 5 s, then analyze latency to return to prone position.Grasp strength. Place animal over the wire grid. Give the animal 5 s to adjust to the situation, then slowly turn the grid. Observe the animal reaction.Central nervous systemSedation. (If animal is resting, closed eyes) gently touch the animal trunk with the forceps and observe if it moves or open its eyes (Video 6). <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 6. Interventional Parameters–Central Nervous System. Video illustrates the procedure to induce seizure, an interventional parameter related to central nervous system: score 1–absent (baseline) was showed. (Experiments on animals were approved by the Animal Care and Use Ethics Committee of the School of Veterinary Medicine and Animal Science, University of São Paulo, Brazil (protocol number 3773120116, FMVZ-USP) and the Institute of Biomedical Science under protocol number 053, page 32, book 3 (2015).)Seizure. Grab mice by tail and gently hang it, spin between fingers, and gently place animal back in the arena; analyze the reaction."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}