{
  "id": 9712,
  "origin_website": "Jove",
  "title": "Modeling Neural Immune Signaling of Episodic and Chronic Migraine Using Spreading Depression In Vitro",
  "procedures": [
    "Several points are worth emphasizing for successful study of immune-related SD signaling in brain slices.  First, initiating stimuli must synchronously depolarize a sufficient volume of gray matter brain to initiate SD.  This means an interface configuration (i.e., fluid exposure only below and gas exchange above slice culture insert) is required.1,2   Second, acute brain slices sustain SD but trauma from their preparation, as well as the use of 95%-oxygen aerated Ringer's solution generate pro-inflammatory changes and epileptiform behavior respectively, which can alter neural circuit function and immune homeostasis.3  Third, while hippocampal slice cultures overcome these acute slice limitations, it is important to note that slice cultures should be maintained for adequate periods before use (i.e., greater than 10 days in vitro) so that microglia and astrocytes become quiescent.3-5  Finally, SD should be induced using sterile and aseptic techniques.  The techniques outlined below are designed to fulfill this need.\n1. Spreading Depression in Slice Cultures\nCulture preparation and maintenance.\n  \nSlice cultures are prepared and maintained in horse-serum-based medium or a serum-free medium (SFM)6,7 as previously described8 with minor modifications to the medium.  Incubation parameters are 36°C, 5% CO2, 95% humidity-balance air.\n    \nWe find that cultures can be switched to a SFM after 18 days in vitro and maintained to at least 35 days in vitro by use of our previously defined SFM that includes extra calcium and magnesium.\nIn addition, antibiotics and an antifungicide are added to prevent infectious contamination associated with multiple recording episodes.\nThis long-term (or recording) medium formulation contains (per 100 mL):  Neurobosal medium, 97 mL; Gem-21, 2.0 mL; Glutamax (200 mM), 0.5 mL; Gentamycin (10 mg/mL), 10 μL; D-glucose (45%), 680 μL; ascorbic acid (0.5 M), 100 μL; Fungizone, (250 mg/mL), 400 μL; NaCl (5.0 M), 820 μL, Mg2Cl2 (1.0 M), 80 μL; CaCl2 (1.0 M), 160-240 μL.",
    "Cultures are used for SD from 21-35 days in vitro.\nVitality verification.3,6,7\nCultures are screened for evidence of pyramidal neuron death before use.\n      \nAt 18 days in vitro, inserts are incubated for 20 min in medium (under normal incubation conditions) containing 5 μM Sytox Green, a marker which becomes fluorescent when it binds to DNA (i.e., by penetrating into dead cells).\nInserts are then transferred back to their previous medium and examined with fluorescence microscopy (504 excitation and 523 emission) for evidence of CA3 or CA1 pyramidal neuron layer injury.\n        \nSlices with more than 20 cells or a standardized level of fluorescence greater than 250 IU were excluded from further use.\nMaterials fabrication.\n  \nGround electrodes are made with glass tubes (2.0 mm OD / 1.16 mm ID) cut to 4.5 mm lengths and briefly fire polished at both ends.\n    \nWe make about 20 electrodes at a time, which can last for more than a year.\nBring 100 mL of 1M KCl to boil and add, with stirring, 3.5 g agar and 0.5 g EDTA (ethylenediaminetetraacetic acid disodium salt dihydrate) to produce a clear yellow solution.\nUse a short length of flexible tubing fitted over each glass tube to draw warm KCl/agar solution into the glass tubes as well as a short distance into the flexible tubing.\n      \nRelease suction and allow the KCl/agar to drip slowly out of the open tip of a glass tube; then hold the open glass tube tip against a piece of ice.\nThe latter maneuver will prompt the agar to gel at the electrode tip and not gel after receding back up into the glass tube.\nOnce the agar has gelled in the cold running water, the flexible tube can be removed without altering the agar positioned in the glass tubes.",
    "Place 0.5 mL of 1 M KCl into each well of a 1.5 mL centrifuge tube rack.  Then place one tip of each KCl/agar filled glass tube in individual wells.  \nNext, hold an 80 cm length of 15 gauge silver wire with a hemostat and clean each of four sides by scraping the wire through an Emery board held to the counter top.\nCut the wire into 4 cm lengths and place them into a scintillation vial filled with bleach for 20-30 minutes to place a firm Ag-AgCl coat over the cleaned silver surface.  \nBend each wire in half and insert the free ends into one end of the glass tube filled with KCl/agar, leaving about 4-6 mm exposed.  \nFinally, coat the glass tube shank containing the silver wire and a small extent of the wire with Goop, a water-resistant and flexible glue, to prevent the KCl/agar from drying.  Repeat for all electrodes.  Let the glue dry overnight. \nStore the electrodes at 4°C in scintillation vials (5-6 electrodes/vial) containing ~ 5 mL 1 M KCl and 25 mg of EDTA, which markedly retards bacterial growth.  \nRecording electrodes are made from 1.5 mm diameter (0.86 mm ID; 10 cm length) borosilicate glass tubes with filaments (Video Figure 1).\n    \nPull microelectrodes to a fine tip with short glass tubes pulled to a sharp point.\n      \nWe typically pull electrodes ~ 7.5 cm in length with a 1 cm taper.  This allows adequate positioning and electrode tip visualization.\nElectrodes are pulled with a Narishige PE-2 puller.",
    "Microelectrode tips are broken back to 2-4 μm under visualization using a compound microscope fitted with a calibrated optical micrometer.  We use the edge of a standard glass histology slide (25 x 75 x 1 mm) attached to a hydraulic one-dimensional micromanipulator held by another 3-dimensional manipulator to gently break the microelectrode tips.\n        \nFirst, the electrode is mounted attached to a microscope slide using clay.\nThen the slide is placed on the microscope slide holder which is used to move the microelectrode tip near the edge of the glass slid attached to the hydraulic manipulator. \nFinally, the tip of the microelectrode is gently broken by pressing it up against the hydraulically driven microscope slide edge.    \nStimulating electrodes are twisted wire bipolar electrodes because:\n    \nThey allow recording of evoked field potentials, which otherwise would be obscured by the stimulus artifact from monopolar stimulation.\nA bipolar stimulating electrode can be gently applied to the dentate gyrus surface without injury, unlike sharp-tipped bipolar electrodes.\nFinally, applied current is localized to the transverse (bare) circular surfaces of the Teflon insulated wires used for the electrode.\n    \nStimulating electrode fabrication begins with cutting ~ 20 cm length of platinum-iridium (125 μm bare diameter; 200 μm coated diameter) and Teflon coated wire.  Then, bend the length in half and tie the loose ends into a loose square knot, leaving ~ 2 cm from the knot to the ends of the wire.\nSecure the knot in the chuck of an electric hand drill placed on a table.\nWhile holding the other end of the wire with a hemostat, briefly turn the drill on and off until the wire is tightly twisted (i.e., each cut surface would be an equal distance from the other when the wire is cut in the transverse direction without unraveling).",
    "Next, the bare ends of the platinum-iridium twisted wires need to be attached to lead wires used to connect the stimulating electrode to a stimulus isolator.\n      \nThis is done by soldering the free ends of the platinum-iridium wire to ~50 cm 30 gauge wires.\nFirst, tape the platinum-iridium twisted wire to a bench top and drop a puddle of concentrated HCl over one free end of the twisted wire.\n        \nNext, strip off about 1 cm of insulation from each wire using a wire cutter.\nPlace the stripped end on a lead wire adjacent to the twisted wire end and apply heat from a fine-tipped soldering iron, then solder until the two wires are firmly attached.  \nSlip a small length of heat shrink tubing over the exposed wire connection and shrink it fit with heat.\nRepeat for the second wire.\nFire polish the tip of a 15 cm Pasteur pipette and guide the twisted platinum -iridium wire down the pipette until about 6 cm of the twisted protrudes out.\nUse a water repellent epoxy (e.g., J-B Weld) to seal both ends of the electrode.\nFinally, attach banana plugs to the lead wire ends for connection to the stimulus isolator.  \nUnder stereoscopic observation, place the electrode tip in PBS and look for electrolytically produced bubbles coming from only the cut end of the electrode tips.  If any bubbles come from the sides of the twisted wires, cut the electrode with a transverse cut using a fresh single edge razor blade to re-establish intact insulation to the wire long axes.\nWhen troubleshooting to resolve aberrant stimulus effects, try making a freshly cut electrode tip.",
    "Recording dishes consist of a slice culture insert in a 35 mm culture dish that sits on two 1.0 x 12 mm glass rods spaced about 1.0 cm apart.  Attach glass rods to the dish base by heating the glass tubes and then pressing them into the base with forceps.\n    \nFor static recording conditions, add 1.5 mL of medium to the dish.\nNext, soak a ~ 10 mm wide and 3-4 cm long piece of sterile cotton in 1.0 mL of medium.  Fold the cotton in half along the long axis and place it along the inner well on the insert with sterile forceps.  The wet cotton helps maintain dish humidity. \nThree compressible 4 mm lengths of tubing are equally spaced around the insert. \nCover the dish tightly with polyvinyl chloride film, which allows gas exchange.\nCut around its mid-vertical wall with a single edge razor blade to remove excess polyvinyl chloride film.\nElectrophysiological setup\n  \nA slice culture insert assembly is placed into the PDMI recording chamber for electrophysiologic recordings.\n    \nThe insert/culture dish assembly in the PDMI chamber is covered by a 2 mm thick plastic disc supplied with the PDMI chamber, with various small holes positioned as needed for recordings electrodes, medium inflow/outflow tubes, etc.\nWe periodically monitor medium pH with a miniature combination pH electrode and temperature with a miniature Type T thermocouple probe mounted into a sealed semi-microelectrode to ensure 7.3 pH and 36.0°C conditions. \nThe insert/chamber is aerated with 5% carbon dioxide-balance air and medium is either held static or in a flow (1.2 mL/minute) configuration with the insert center held at 35-36°C.\nFor flow conditions, medium is warmed with an inline heater, again to keep the center of the recording chamber at 36°C.",
    "A peristaltic pump system with a pressure relief brings medium into to the slice cultures without pulsations from the pump.  An aspirator supplied with the PDMI chamber is used to remove medium from the insert via gentle suction.\nFor stability, the chamber is mounted on a specially designed Burleigh-Gibraltar inverted microscope stage that holds an inverted microscope and sits on a vibration free table.\nSmall holes are opened through the polyvinyl chloride insert wrap with a small, battery-operated cautery tool.\nNext, if a flow configuration is to be used, inlet and outlet flow is begun, followed by placement of a ground electrode.  Otherwise, simply put the ground electrode in place.\nElectrodes, held in place with micromanipulators, are positioned just above a slice visualized with an inverted microscope at 5x magnification (Fig. 1).\n      \nBegin with the recording electrode followed by the stimulating electrode.\nWe use an audio monitor to note when the microelectrode makes contact with the slice.  The tip is positioned at the midpoint along CA3 pyramidal cell body layer.  \nRecordings are started, and then the stimulating electrode is gently touched to the midpoint surface of the dentate gyrus. \nIn both instances, initial electrode movements are accomplished with coarse controls, and final positioning only with the hydraulic, fine controls using phase contrast illumination so that cell body layers can be easily distinguished.\nAdvance electrodes in ~25 μm increments under direct microscopic visualization.\nOnce electrodes touch the tissue, advance the electrodes another 20-30 μm.      \nRecordings are begun before the stimulating electrode is put in place to be certain this does not trigger SD (i.e., via a mechanical stimulus).\n~10 minutes are allowed to elapse before experiments are started. \nTransynaptically induced SD.\n  \nOptimize evoked CA3 field potentials as follows (Fig. 2).",
    "CA3 field potential are evoked with 100 μs pulses (0.2 Hz) beginning with a current that is sufficient to trigger a response (e.g., ~ 1-5 μA).\nMove the recording electrode in increments along the pyramidal neuron long axis until the field potential is maximal.\nThen, increase the current with the recording electrode at this position and note the maximal current response (e.g., ~ 10-20 μA).  \nFinally, use half-maximal stimulus intensity for experiments (e.g., sham control periodic stimulation).  \nDetermine the threshold for synaptically evoked SD (Fig. 2).  \n    \nWith the electrodes configured as outlined above for evoked field potentials, switch the stimulation paradigm to single, manually evoked bursts of 10 pulses (10 Hz @ 100 μs/pulse), a paradigm previously applied in whole animal studies.\nProgressively increase current intensity per stimulus burst until SD is triggered.  Wait at least 60-120 sec between stimuli.\nReport SD threshold in coulombs (i.e., current x time).    \nIn other experiments that require measuring responses to the induction of multiple SDs, use a stimulus strength likely to evoke SD (e.g., ~100-500 nC).\n    \nTrigger SD every 9 min for an hour.\nBe sure to use aseptic techniques throughout experiments.  \nAfter the last SD, return the culture insert to normal incubation conditions.\n      \nMark the culture dish to note the culture that experienced SD.\nOur habit is to place a single mark to the left and two marks to the right of the slice culture insert, noting each of the three cultures as #1, #2, and #3 from left to right.\nChange medium every 3-4 days until culture harvest.\nFor recurrent SD, follow procedures outlined above.\nWe typically test for a change in SD threshold 1, 3, 7, and 14 days after an initial hour of multiple SDs.",
    "CA3 area fast potential and slow potential changes are recorded via separate digital signal processing systems.\n2. Exemplary Vital Imaging in Hippocampal Slice Cultures\nDynamic functional behavior of resident immune cells (i.e., microglia) can similarly be monitored in slice cultures without cell injury or immune activation (Fig. 3).9\nFor example, to label microglia to assess their movement associated with synaptic activity changes of SD, we used fluorophore-tagged isolectin-IB4.\n\"Lectin PBS\" is PBS with additional cations (0.1 mM each CaCl2, MgCl2, MnCl2) since divalent cations (0.1-1.0 mM) are required to bind lectin to α-D-galactosyl moieties on microglial cell membranes.\nMake a solution of \"Lectin PBS\":\n    \nFor 1 L PBS, using aseptic technique and sterile filtration, add:\n100 μL of 1M MgCl2\n100 μL of 1M MnCl2\n100 μL of 1M CaCl2\nMix thoroughly to combine and keep refrigerated at 4°C.\n    \nOnly 500 μL of \"lectin PBS\" is needed per vial of isolectin, but since it can be refrigerated and kept for months at a time, it may be useful to make up larger volumes.\nReconstitute AlexaFluor 594-tagged isolectin-IB4 (isolectin) lyophilized powder to1 mg/mL in \"lectin PBS\".\n    \nIn order to minimize photobleaching, perform this step as quickly as possible, minimizing light exposure.\nIsolectin can be aliquoted to 20 μL once reconstituted at 1mg/ml and kept at -20°C for up to one year.\nDilute isolectin to 20 μg/mL in growth medium and incubate slice cultures at normal incubation conditions 4-10 hours before imaging.\nImaging set-up.\n    \nImaging set-up consists of: microscope, shutter, camera, light, 2.0 neutral density filter, 36°C, gas: 5% CO2, air (or 20% oxygen, balance nitrogen). \nTurn on the microscope, camera, UV light, temperature control, and gases at least one hour before imaging.\nSet up MetaMorph Imaging Protocol.\n    \nFrom the \"Journal\" drop-down menu, choose \"Run Journal...\".",
    "This should prompt the opening of the JOURNALS folder, from which you should select \"Motion w-var afs (journal previously established that follows the steps below)\", click \"Open\".\nThe \"Autofocus Frequency\" window will pop up next, keep Number at 1, click \"OK\".\nNext, the Setup \"Sequential File Na...\" window will pop up, keep everything as-is:\n      \nBase Name: Image;\nImage Number: 1; \nNumber Width: 3; \nSave As Type: MetaMorph TIFF;\nif image already exists -> Overwrite automatically;\nClick \"Select Directory...\", this will cause the \"Browse for Folder\" window to pop up.  Here, select the folder (or create a new folder) where the movie frames should be saved.  \nThen, when the correct folder (e.g. C:DataNew Folder) is displayed in the bottom of the \"Setup Sequential File Na...\" window, click \"OK\". \nIn the Acquire window: \n        \nSelect the Setting in the bottom left corner to be DiIMGBIN2;\n\"Exposure Time\": 20ms; \"Binning\": 1.\nThen, in the Special tab:\n        \n\"Sensor Mode\": FT;\n\"Digitizer\": 10MHz (EM Gain); \n\"Gain\": Gain3 (3x);\nSelect \"EM Gain: 45\";  Camera Shutter: Open for Expose;  Clear Mode: CLEAR PRE EXP;  Clear Count: 2, Trigger Mode & Live Trigger Mode: Normal (TIMED).\n\"Frames To Avg\": 3.\nClick \"Close.\"\nAfter setting up the MetaMorph imaging, place the insert in a 35mm culture dish with two 1 mm glass rods in the bottom.\n    \nPlace three 2 mm pieces of rubber tubing fitted between the walls of the insert and the culture dish to further stabilize the insert. \nPlace a ~10 mm wide piece of cotton soaked in an additional 1 mL medium inside the insert to maintain a humidified environment.  Make sure that it is flush with the walls and away from the hippocampal slices.\nCover the top of the culture dish tightly with polyvinyl chloride film to prevent fluid loss.",
    "Make sure that the focus of the imaging is the CA3 pyramidal cell layer.  Note the slice's orientation by taking phase pictures at 5x, 10x, and 20x.\nIn the \"Find Focus\" window that appears on the screen, set Range, current +/- to be \"8\", and Accuracy, in micron(s), to be \"1\" (both boxes at the bottom should be checked). \nClick \"Find Focus\" to ensure an in-focus image. \nIn the \"Acquire Timelapse\" window, select Time interval to be \"1 minutes\", and Duration to be \"6 hours\" (these are our preferred acquisition parameters).\n    \nTo accurately capture microglial movements, imaging should be no less frequent than once per minute.\nIn Image Storage, select Stack.\nThe Update Image Window box should be checked, but not the other two boxes underneath.\nSelect \"Illum\" to be \"Lambda\".\nClick \"OK\". \nThe movie will now begin to run.  This will mean that nothing else can be performed within the MetaMorph program until the movie finishes or until you stop the movie early by clicking Esc, after which the movie will then stop at the next timed acquisition step.\nAt the end of the movie, check for cell injury by Sytox screening as noted above (A).  \n3. RNA Extraction for Low-Level Cytokine Signaling11-15\nWe previously presented detailed instructions for detection of low-level cytokine signaling in slice cultures using qPCR and PCR array techniques.6,7 \nWe have markedly improved the sensitivity of our approaches for cytokine mRNA detection in slice cultures and present these improvements here.\nThe improvements include our approach to tissue harvest and RNA isolation, prescreening of samples for tumor necrosis factor alpha (TNF-α) change, and cDNA preamplfication, which are ~ 6 times more sensitive than previous techniques and, for example, allow detection for the first time of slice culture interferon-gamma (IFN-λ) detection.15\nPCR preparation.\n  \nSlice culture harvest.",
    "Following experiments, slice culture inserts are submerged in 2-3 mL RNAlater and stored at 4°C for up to 3 days until further processing. \nTo harvest, remove extraneous (i.e., any tissues adjacent to the hippocampus proper) tissue using a diamond knife and lift the slices into individual RNase/DNase free 1.5 mL centrifuge tubes containing 0.5 mL sterile phosphate buffered saline (PBS) using a fine tipped paint brush.   \nSpin samples (10,000 rpm x 1 min) in a stereotypic fashion so all slices adhere to the same side of their tubes. \nRemove PBS supernatant and resuspend sample in 500 μL TRIzol.\nStore samples at -80°C or keep on ice until RNA extraction.\nRNA extraction usingTRIzol with the RNeasy Micro kit results in greater RNA yield (Fig. 4) than use of the kit alone.\n    \nThaw TRIzol-samples and incubate at room temperature for 5 min.\nDissociate tissue by drawing samples up and down with 1 mL tipped pippetor and/or vortexing until solid tissue is no longer visible.\nAdd 100 μL RNase free (RF) chloroform and invert tube 2-3 times to mix.\nIncubate 3 min at room temp, vortexing every min.\nCentrifuge at 13,000 rpm for 15 min at 4°C.\nTransfer supernatant to a clean 1.5 mL microcentrifuge tube. Be careful not to disturb interface.\nAdd an equal volume of room temperature RF 70% molecular biology grade ethanol (~300 μL).\nMix gently by pipetting up and down a few times.\nContinue with the following steps per RNeasy Micro kit directions:\n      \nApply sample to an RNeasy micro column placed in a 2mL collection tube.\nCentrifuge at 10,000 rpm for 15 sec, discard flow-through. \nWash RNeasy column with 350 μL buffer RW1. \nCentrifuge at 10,000 rpm for 15 sec, discard flow-through.\nAdd 10 uL DNase 1 stock solution to 70 μL buffer RDD, mix gently.",
    "Apply 80 μL of DNase solution directly onto membrane and incubate at room temperature for 20 min.\nWash RNeasy column with 350 μL buffer RW1.\nCentrifuge at 10,000 rpm for 15 sec, discard flow-through and tube.\nAdd 500 μL buffer RPE to RNeasy column.\nCentrifuge at 10,000 rpm for 15 sec, discard flow-through.\nAdd 500 μL RF 80% molecular biology grade ethanol to RNeasy column.\nCentrifuge at 10,000 rpm for 2 min, discard flow-through and tube.\nPlace RNeasy column in new tubes with the caps open.\nCentrifuge at full speed (i.e., 14,000 rpm) for 5 min.\nTransfer RNeasy column to a RF microcentrifuge tube.\nApply 14 μL RF water directly to the membrane.\n        \nCentrifuge at 10,000 rpm for 1 min to elute.\nStore samples at -80°C or continue to next steps.\nRNA quantification.\n    \nDilute RiboGreen 1:200 in RF 1x Tris-EDTA (TE) buffer.\nPrepare yeast tRNA to be used as the RNA standard.\n      \nWorking stock is stored in -20°C at 100 μg/mL\nDilute to 1 μg/mL (10 μL in 990 μL TE).\nCreate standards as follows: For 100 ng/ μL, add 100 μL, for 80 ng/ μL, add 80 μL tRNA and 20 μL TE, for 60 ng/μL, add 60 μL tRNA and 40 μL TE, for 40 ng/μL add 40 μL tRNA and 60 μL TE, for 20 ng/μL add 20 μL tRNA and 80 μL TE, and for 0 ng/μL add 100 μL TE. \nPrepare samples:\n      \nCombine 99 μL TE + 1 μL sample.\nRun each sample in duplicate.\nUsing a multi-channel pipettor, add 100 μL of diluted RiboGreen per well.\nPipette up and down to mix.\nMeasure fluorescence on a plate reader. \n      \nFluorescein (485 nm/535 nm, 0.1 sec) program.\nExport results into an Excel spreadsheet.\nDetermine RNA concentration.",
    "Graph absorbency versus RNA concentration and create a best-fit linear regression line in Excel. \nDetermine sample RNA concentrations from the regression equation associated with the best-fit line.\nDetermine RNA quality.\n    \nRibosomal RNA band integrity is measured via agarose gel (Fig. 4).\n      \nThough it is impractical to run a fraction of each RNA sample obtained (since = 1 μg of RNA is required and our yields are small), it is a good idea to periodically run a denaturing agarose gel on an exemplary sample as proof that the method, when done properly, yields high quality RNA (i.e., without degradation).\nPrepare a 1% agarose gel (for a 100 mL volume).\n        \nClean the electrophoresis tank, casting tray and gel combs thoroughly with RNase AWAY.\nWeigh out 1 g of ultrapure agarose into a flask.\nAdd 83 mL of RNase free water and 10 mL of 10x MOPS [3-(N-Morpholino)propanesulfonic acid] buffer and microwave until agarose is dissolved and solution is clear (~3 min).\n          \nTo make 10x MOPS buffer\n            \nCombine 83.7 g MOPS, 13.6 g sodium acetate, and 3.7 g EDTA.\nAdd 800 mL of RNase free water, mix to dissolve. \nAdjust pH to 7.0 and fill to 1 L.\nFilter sterilize or autoclave.\nStore at room temperature, protected from light.\nAllow gel to cool to 55°C and add 7 mL 37% formaldehyde (this step should be done in a chemical fume hood).\nPour gel into casting tray and allow gel to solidify in the hood. \nPrepare the RNA samples.\n        \nRNA sample buffer (500 μL, make fresh).\n          \nCombine 50 μL 10x MOPS, 250 μL formamide, 90 μL 37% formaldehyde, 108 μL RF H2O and 2 μL ethidium bromide (stock solution 10 mg/mL).\nTo 1-10 μg of RNA, add double its volume using sample buffer, for a three-fold dilution.",
    "Denature at 95°C for 5 min, and then chill on ice for 5 min.\nSpin briefly and load the full sample into wells alongside a RNA ladder (add loading dye if desired).\nElectrophorese\n        \nFill chamber with 1x MOPS buffer. \nElectrophorese at 50-75 volts until markers have migrated about 2/3rd the length of the gel.\nVisualize the gel on a UV transilluminator.\n        \nVerify that there are sharp 18S and 28S ribosomal RNA (rRNA) bands, and that the 28S band is twice as intense as the 18S band (Fig. 4).\nDegraded RNA will have a smeared appearance, fuzzy bands, or will not exhibit a 2:1 ratio. \nTypically we use optical density to assess total RNA quality.\n    \nThough not as sensitive, UV spectrophotometry via a Nanodrop is a quick and cost efficient means of checking RNA quality. \nLook for optical density (OD) 260/280 ratio of 1.5-2.0.\nKeep in mind that the solution in which RNA is resuspended (TE buffer versus water) will affect the OD ratio. \nPCR activities.\n  \nPre-PCR setup\n    \nDesign specific primers\n      \nUsing NCBI's Primerblast http://www.ncbi.nlm.nih.gov/tools/primer-blast/[href=http://www.ncbi.nlm.nih.gov/tools/primer-blast/]:\n        \nEnter the target gene's Refseq accession number.\nSpecify PCR product size of 70 to 200 bp.\nSpecify a Tm of 55-72°, with less than 5° difference between forward and reverse primers.\nSelect \"Primer must span an exon-exon junction\" to reduce genomic background.\nEnable specificity check for Rat Refseq RNA database to ensure that primers don't recognize additional targets.\nChoose a primer pair from results that fits the following criteria:\n          \n18-30 bases long.\nLess than 2000 bases apart on your template.\n40-60% guanine-cytosine content to ensure stable binding of primer to template. \nChoosing a reference gene.",
    "Not every reference gene will be suitable for your experimental set up. Each time a new paradigm is used, the stability of your reference should be verified.  For consistency, we opted to use one of the four reference genes provided on the RT2 Profiler PCR array.\nA good reference gene should meet the following criteria: \n        \nIts expression level is not altered by the experimental paradigm.\nIt is expressed at levels similar to that of the target gene.\nTo select a suitable reference:\n        \nReview the literature to identify likely candidates for a stable reference gene in your system. For example, we tested Rpl13a because it was shown to be stable in studies of ischemia.11,12\nDesign primers as discussed above (or find already-validated primers for common reference genes in a database like RTPrimerDB http://www.rtprimerdb.org/[href=http://www.rtprimerdb.org/]).\nOptimize primers alongside target gene primers (see below).\nDetermine which candidate reference is most stable using software like Normfinder (http://www.mdl.dk/publicationsnormfinder.htm) which calculates a stability value for each gene based on the intragroup variance and selects the gene(s) with the least expression variation over the samples.  For example, Rpl13a is an optimal reference gene for SD (Fig. 4). \nOptimize primers.\n      \nTo obtain consistent and reliable results from qPCR, primers have to meet certain criteria of reproducibility, sensitivity, and specificity.  \n        \nIt is best to test these parameters for each new primer pair. \nReproducibility is tested for by running technical replicates. \nSensitivity can be assessed by performance with a standard curve of successive 4-fold dilutions.\nSpecificity is determined by confirming a single product by melt curve analysis and gel electrophoresis (Fig. 5).\nRun a qPCR plate to test the quality of your primers, and the concentration of      primers to be used.",
    "Using cDNA synthesized from whole-brain RNA, create a standard curve (series of consecutive 4-fold dilutions) as follows: 1, 1:4, 1:16, 1:64, 1:256, and no template control (NTC).\nFor each dilution, run 1 μL cDNA in duplicate for each concentration of primers, (i.e., 100 nM, 200 nM, 300 nM). \nConfirm that technical replicates give consistent Ct values.\nExamine Ct values for the dilution curve.\n        \nPlot the Ct values against concentration for each of the dilutions.  The resultant graph should be linear with a good correlation coefficient (i.e., >0.95).\nExamine melt curve to confirm the presence of a single amplification product (i.e., single peak).\n        \nIf there are multiple peaks, or the peaks are not similar, this might suggest contamination, mispriming, primer-dimer artifact, etc. (Fig. 5).\nA peak in the NTC will likely correspond to primer dimers which form more readily in the absence of template cDNA, and shouldn't be a concern.\nConfirm melt-curve data by resolving amplified products on a 1% agarose gel.\n        \nPrepare a 1% agarose gel (for a 100 mL volume)\n          \nWeigh out 1 g of agarose into a flask.\nAdd 100 mL of 1x Tris-Acetate EDTA (TAE) buffer and microwave until agarose is dissolved and solution is clear.\n            \n1 L 50x TAE buffer consists of 2 M Tris base, 57 mL glacial acetic acid, and 0.05 M EDTA (pH 8.0). \nDilute TAE buffer to 1x with distilled water (final concentrations:  40 mM Tris-acetate and 1.0 mM EDTA).\nAllow gel to cool to 55°C before adding ethidium bromide to a concentration of 0.5 μg/mL.\nPour gel into casting tray and allow it to solidify at room temperature.",
    "To run, place gel in electrophoresis chamber filled with 1x TAE, combine 10 μL of sample from the qPCR plate with 2 μL of 6x loading dye, mix well and load into wells alongside a molecular weight ladder.\nElectrophorese at 50-150 volts until markers have migrated an appropriate distance, depending on the expected size of your cDNA product.\nVisualize with a UV transilluminator.\nConfirm that the amplified PCR product is of appropriate size for your target.\nPrimer dimers will be around 50 bp.\nPre-screen for increased TNF-α.\n    \nSince TNF-α initiates inflammation reactions in the periphery, we suspect this is also true for brain and use initial screening for TNF-α mRNA as a marker of the slice culture immune status (i.e., normal, sham, and experimental groups) before proceeding to full PCR array analyses. \nIf normal and sham control TNF-α mRNA levels are not within an interassay  range found within our laboratory, experiments (i.e., normal, sham, and experimental groups) are discarded and do not proceed to full PCR array analyses.        \niScript cDNA synthesis.\n      \nFor each RNA sample, combine the following in a PCR tube: 4 μL 5x reaction mix, 1 μL reverse transcriptase, 25 ng RNA, and RF H2O to a final volume of 20 μL.\nMix gently by pipetting and spin down briefly.\nIncubate: 25°C, 5 min; 42°C, 30 min; 85°C, 5 min.\nDilute 1:4 (add 60 μL RNase free water). \nStore at -20°C or keep on ice until ready to use within hours. \nqPCR for TNF-α.\n      \nPrepare a master mix for each primer pair.  \n        \nCombine 12.5 μL iQ SYBR green, 1 μL primer mix and 10.5 μL water per sample.\nFor both our Rpl13a and TNF-α primers, 200 nM is the optimal concentration.",
    "Adjust the amount of primers and volume of waster as necessary in a 1.5 mL RF microcentrifuge tube and keep on ice while you set up the plate.\nSet up a qPCR plate with controls/shams/experimentals.  Use 1 μL of cDNA per sample in duplicate for each gene.\nAdd 24 μL of your master mix to each well and pipette up and down to mix.\nBe very careful to avoid bubbles, as they will interfere with fluorescence readings. \nRun 40 cycles of PCR amplification:\n        \n95°C, 8.5min;\n40 cycles: 95°C, 10 sec; 60°C, 30 sec; 72°C, 20 sec/cycle.\nMelt curve:  55°C, 1 min; 80 cycles of 0.5°C increments for 10 sec each starting at 55°C.\nAnalyze data (ΔΔCt method; Fig. 4).13\ncDNA synthesis for PCR arrays.\n  \nCalculate volume (μL) of each sample to have 250 ng of RNA.\n    \nChoose an amount of RNA (100 ng to 1 μg) that you can consistently extract from your samples.\nRT2 First Strand Kit - as per manufacturer's instructions.  Briefly:\n    \nThaw and spin down all reagents.\nFor each RNA sample, combine the following in a PCR tube:\n      \n250 ng of RNA, 2 μL of the 5x genomic DNA (gDNA) elimination buffer and water to a final volume of 10 μL.\nMix gently by pipetting and spin down briefly.\nIncubate at 42°C for 5 min.\nChill on ice for 1 min.\nIn the mean time, prepare the reverse transcription (RT) cocktail (per sample):\n      \nCombine 4 μL of 5x RT buffer 3, 1 μL primer and external control mix, 1 μL RT enzyme mix 3, and 3 μL of water.  \nAdd 10 μL of RT cocktail to each sample and mix gently. \nIncubate at 42°C for 15 min.\nStop reaction by incubating at 95°C for 5 min.",
    "Add 91 μL of RF H2O to each 20 μL cDNA synthesis reaction (dilute to a final volume of 111 μL).\nMix well by pipetting.\nStore at -20°C or keep on ice until ready to use within hours.\nRT2 Profiler PCR array.\n  \nThe following instructions follow those of the manufacturer and are reiterated here for convenience.  \nPrepare reagents\n    \nThaw and spin down all reagents.\nPrepare experimental cocktail:\n      \nCombine 1350 μL of 2x SABiosciences RT2 qPCR SYBR Green Master Mix, 102 μL of diluted cDNA and 1248 μL of RF H2O to a final volume of 2700 μL.\nCarefully remove PCR array from sealed bag.\nDispense cocktail into a loading reservoir.\nAdd 25 μL to each well with a multi-channel pipettor.\nCarefully seal PCR array plate.\nCentrifuge the plate at 10,000 rpm for 1 min at room temperature.\nPlace on ice until PCR program is ready.\nRun the appropriate cycling program for your machine.\n    \niCycler:\n      \n95°C, 10 min\n40 cycles: 95°C, 15 sec; 60°C, 1 min.\nMelt curve: 55°C, 1 min; 80 cycles of 0.5°C increments for 10 sec each starting at 55°C\nAnalyze data.\n    \nSelect \"Auto Calculated\" for baseline cycles.\nSelect \"User Defined\" for threshold position to manually set threshold value.\n      \nIn \"Log View\", set threshold in the lower one-third of linear phase of the amplification plot.\nBe sure to keep threshold value the same across runs.\nExport Data.\nInput into an Excel file.\nUpload to SABiosciences PCR Array Data Analysis.\n      \nhttp://sabiosciences.com/pcrarraydataanalysis.php[href=http://sabiosciences.com/pcrarraydataanalysis.php]\nSelect reference genes - we used Rpl13a.\nOur practice is to:\n      \nConfirm results with at least a duplicate PCR array.\n3-fold array changes need not be confirmed by subsequent specific target PCR amplification.6,7\nLess than 3-fold changes should be confirmed by subsequent specific target PCR amplification or use of 2-3 PCR arrays (to confirm 2x changes.",
    "DNA pre-amplification is used to analyze targets with expected ultra-low expression (Fig. 6).\n    \nSABiosciences's RT2 Nano PreAMP cDNA synthesis kit and primer mixes are intended for pre-amplification of RNA to allow use of small amounts (1-100 ng) of sample RNA to run a full PCR array.\nEach primer mix allows for the amplification of 89 gene-specific cDNA target templates with minimal bias.  We have used this system as a means of amplifying low level signals such as IFN-λ to a detectible level. \nRT2 Nano PreAMP cDNA synthesis kit - as per manufacturer's instructions.  Briefly:\n      \nThaw and spin down all reagents.\nFor each RNA sample, combine the following in a PCR tube.\n        \n1-100ng of RNA, 2 μL of the 5x gDNA elimination buffer and water to a final volume of 10 μL.\nMix gently by pipetting and spin down briefly.\nIncubate at 42°C for 5 min.\nChill on ice for 1 min.\nIn the meantime, prepare the RT cocktail (per sample). \n        \nCombine 4 μL of 5x RT buffer 3, 1 μL primer and external control mix, 1 μL cDNA enzyme synthesis mix, 1 μL RNase inhibitor, and 3 μL of water.  \nAdd 10 μL of RT cocktail to each sample and mix gently.\nIncubate at 42°C for 15 min.\nStop reaction by incubating at 95°C for 5 min.\nStore at -20°C or keep on ice until ready to use.\ncDNA amplification with specific primers.\n      \nMix the following in a PCR tube:\n        \n12.5 μL PCR master mix, 7.5 μL specific primers, and 5 μL of undiluted cDNA. \nRun 12 cycles of PCR amplification.\n        \n95°C, 10 min.\n12 cycles: 95°C, 15 sec; 60°C, 2 min.\nHold at 4°C.\nAdd 2 μL side reaction reducer to each sample.\nIncubate at 37°C for 15 min.\nStop reaction by incubating at 95°C for 5 min.",
    "Add 84 μL RF water to each 27 μL cDNA amplification reaction.\nStore at -20°C or keep on ice until ready to use within hours. \nAmplify individual gene targets using SAB primers and SYBR green master mix as described above.    \n4. Multiplexed Phosphoprotein Assays of Cytokine Signaling\nMutliplexed phosphoprotein assays are used to define cytokine ligand-receptor downstream signaling (Fig. 7).      \nDetermine amount of total protein in slice cultures.\n  \nHarvest slice cultures by gently lifting slices off of inserts and place in 1 mL cold (4°C) PBS.\nCentrifuge tubes for 30 sec and remove PBS.  Place on dry ice until finished harvesting.\nStore at -80°C.\nHomogenize slice cultures for total protein assay.\n  \nPrepare cell lysis buffer according to manufacturer's instructions.\n    \nAdd protease inhibitors to a total volume of buffer needed to place at least 200 μL of lysis buffer on each slice culture.\n      \nFor example:  add 20 μL of Factor 1, 10 μL of Factor 2, and 20 μL of 500 mM PMSF in DMSO to 4.95 mL cell lysis buffer.\nThaw slice cultures in 200 μL lysis buffer on ice.\nSonicate slice cultures five times in 1 sec pulses and place immediately back on ice.\nVortex samples for 10 sec.\nCentrifuge samples at 4°C for 15 min at 13,000 rpm.\nTransfer supernatant to a clean tube and keep on ice.\nPerform total protein assay.\n  \nPrepare protein standards.\n    \nReconstitute stock bovine serum albumin (BSA) according to manufacturer's instructions.\nPrepare standards ranging from 0-1000 μg/mL diluted in high purity water for BCA protein assay.\nCalculate volume of working reagent needed based on the number of samples and replicates.\n    \nFor example:  (8 standards + 18 unknown samples) x (2 replicates per sample) x (0.2 mL working reagent needed per well) = 10.4 mL total volume needed for all samples loaded onto the microplate.",
    "Round up to 12 mL total volume to ensure enough volume.\nWhen mixing Reagent A with Reagent B for the working reagent, some turbidity may occur, but should disappear shortly.\nLoad 10 μL of samples and standards per well.\nLoad 0.2 mL of working reagent into wells.\nCover plate with sealing tape and shake for 30 sec to mix.\nIncubate plate at 37°C for 30 min.\n    \nCool plate to room temperature (about 10 min) before reading on a plate reader at 595 nm wavelength.\nConstruct a standard curve using Microsoft Excel with measured absorbance vs. expected concentration.\n    \nA good correlation coefficient is equal to or greater than 0.98.\nCalculate protein concentrations in samples using the linear equation derived from the standard curve.\nDilute samples in lysis buffer to equal amounts of protein and store at -80°C until ready for further processing.\nProtein concentration should range from 200-900 μg/mL according to manufacturer's instructions.\nPerform Multiplex Assay.\n  \nNote:  multiplexed phosphoprotein assays take 2 days total to complete, with 1 hour of initial set-up and loading of plate followed by an overnight incubation step and additional incubation and wash steps the following day.\nMap out which wells will contain which lysate according to worksheet in manual.\nThaw homogenized tissue samples and kit lysates at room temperature and then place on ice.  Bring all buffers and reagents provided in kit to room temperature (except streptavidin and beads).\nPrepare beads for multiplex assay.\n    \nCover tubes containing coupled beads with aluminum foil to protect from light.  Vortex tubes for 5 sec and keep on ice.\nDilute coupled beads 1:50 in wash buffer. \n      \nEach well should contain 1 μL of coupled beads in 49 μL wash buffer for a total volume of 50 μL per well.\nCalibrate the vacuum apparatus.",
    "Wash the plate with 100 μL wash buffer per well.\nTurn on vacuum and suction off any excess liquid within 2-5 sec.\n      \nIf complete removal of buffer takes longer or shorter than 2-5 sec, adjust pressure valve accordingly.\nDry the bottom of the plate thoroughly before adding samples.\nVortex the diluted coupled beads for 5 sec and add 50 μL to designated wells.\n    \nImmediately vacuum filter and dry the bottom of the plate with a paper towel.  \nWash the plate twice with 100 μL wash buffer per well.  Dry the bottom of the plate after each wash.\nVortex thawed samples for 3 sec and add 50 μL to designated wells.  Place sealing tape over plate and incubate for 15-18 hrs shaking at 300 rpm at room temperature, protected from light.\nVacuum filter excess liquid and wash plate three times with 100 μL wash buffer.  Dry the bottom of the plate after each wash.\nDilute detection antibody 1:25 in wash buffer.\n    \nEach well requires 1 μL detection antibody in a total volume of 25 μL wash buffer.\nPlace sealing tape on plate and protect from light with aluminum foil.  Shake for 30 sec, gradually increasing speed to 1100 rpm.  Continue shaking at 300 rpm for 30 min at room temperature.\nVacuum filter the plate and wash three times with 100 μL wash buffer.  Dry the bottom of the plate after each wash.\nWhile protecting the plate from light, prepare a 1:100 dilution of streptavidin-PE with enough volume to add 50 μL per well.  Protect solution from light.\nVortex thoroughly and add 50 μL diluted streptavidin-PE per well.  Incubate with shaking at 1100 rpm for 30 sec followed by 10 min at 300 rpm.\n    \nVacuum filter excess buffer off.  \nWash the plate three times with 100 μL resuspension buffer per well.",
    "Dry the bottom of the plate thoroughly after each wash.\nAdd 125 μL resuspension buffer to each well and shake for 30 sec at 1100 rpm.  \nImmediately read plate or store at 4°C away from light for up to 24 hours.\n5. Mimicking and Modulation of Cytokine Signaling\nRecombinant cytokine proteins (with carrier) are used to mimic changes of SD.\n  \nLyophilized proteins (e.g., TNF-α) are stored for up to 1 year at -20°C.\nAfter diluting to a stock solution with 0.1% bovine serum albumin, aliquots are prepared, stored at -20°C, until use within 3 months.\nAny manipulations to slice cultures are refreshed at least every third day.\nCytokine signaling is silenced by:\n  \nUse of traditional cytokine signaling cascade pharmacological agents;\nUse of soluble ligand antagonist [e.g., soluble TNF receptor 1 (as described above for recombinant ligands)]; or \nGene silencing [i.e., small interfering RNA (siRNA)].\nDelivery of siRNA to neuronal cells is often problematic.\n  \nCommon lipid-based reagents usually result in low transfection efficiency and loss of cell viability.  \nInstead, we use Thermo Scientific's Dharmacon Accell siRNAs, which allow for high efficiency knockdown without use of a transfection reagent. \nHere we show knockdown of cyclophilin B, a non-essential protein expressed in all cell types, as confirmation of the use of this method in slice cultures.     \nDelivery protocol was adapted for slice cultures from manufacturer's instructions for use in adherent cells.\n    \nDilute 5x siRNA buffer to 1x with RNase free water.  \nPrepare a 100μM siRNA solution in 1x buffer\n      \nCyclophilin B siRNA is provided at 5 nmol.  Resuspend in 50 μL of 1x buffer for a 100 μM stock.\nMix siRNA with Accell delivery medium to a final concentration of 1μM siRNA.\n      \nAdd 11 μL of 100 μM stock siRNA to 1100 μL of Accell delivery medium in a 6-well plate.",
    "Place in the incubator and allow temperature to equilibrate to normal incubation conditions for at least 20 min.\nUsing a BSL-2 hood and sterile technique, transfer inserts into the delivery mix-containing wells.\nIncubate with delivery mix for 96 hrs for protein knockdown.\n        \nAssess protein knockdown by Western blot or intensified immunostaining.\nWestern blots, while a potential first choice for knockdown efficiency, may be too insensitive for low-level immune signaling associated with the non-injurious phenomenon of SD. \nAccordingly, we have followed negative Western blot measurements with silver enhanced diaminobenzidine (DAB) immunostaining and computer-based densitometry measurements (see below).\n6. Proteomic Confirmations\nCell specificity of phosphoprotein changes is established using immunostaining.6,7\nFix slice cultures for 24 hrs with PLP fixative consisting of:\n    \n10 mL 16% paraformaldehyde, 1.096 g lysine, 0.42 g sodium phosphate, and 0.17 g sodium periodate, filled to a total volume of 80 mL with ultrapure water (fixative is 6.2 pH).\nAfter 24 hrs, gently remove slice cultures from the inserts with a fine brush and transfer to PBS containing sodium azide (100 mg/L) until ready to section.\nThen, incubate slices at least 24 hrs in PBS-20% sucrose, cut whole slice cultures to 20 μm sections, and mount to gel coated slides.\nFluorescent immunostaining (e.g., for NFκB) is accomplished as follows with all steps coupled to shaking at ~50 rpm.\n      \nWash slice cultures in 3 mL PBS three times for 10 min.\n        \nPlace slides with mounted 20 μm slice cultures in Coplin jars with ~40 mL PBS for all wash steps.\nWash slice cultures in PBS three times, 10 min per wash.\nPlace a few drops of SFX signal enhancer on slice cultures and incubate in a humid chamber for 30 min.",
    "Incubate slice cultures for 2 hrs at 37°C with rabbit anti-NFκβ antibody at 1:100 diluted in 0.75% Triton X-100 in PBS.\n        \nPipette antibody solution directly onto slices.\nRemove slices from antibody solution and wash three times in PBS for 10 min per wash.\nIncubate slices at room temperature for one hour in goat anti-rabbit AlexaFluor 594 antibody at 1:50 in 0.75% Triton X-100 in PBS.\n        \nCentrifuge AlexaFluor 594 antibody for 15 min at 10,000 rpm to remove any precipitate that may have formed in solution.\nWash three times in PBS, 10 min per wash.\nDip slides in distilled water to rinse off any salts from PBS.\nCoverslip with ProLong antifade medium and let dry for at least 2 hours, covered away from light.\nVisualize with traditional or confocal (Fig. 7) fluorescence microscopy.\nProtein production changes from siRNA knockdown can be sensitively assessed by enhancing traditional DAB immunostaining7 via silver intensification16 and subsequent densitometric quantification (e.g., as shown here for cyclophilin B) (Video Figure 2).\n  \nImmunostaining for cyclophilin B follows standard procedures for bright field imaging we recently detailed,7 using:\n    \nAnti-mouse cyclophilin B (1:100) for 24 hours at 4°C;\nFollowed by horseradish peroxidase secondary antibody labeling (1:100);\nAnd DAB visualization.\nf the DAB reactions are too faint to allow digital densitometric quantification17, they can be intensified with a differentiated silver procedure according to Quinn and Graybiel.16\nRehydrate slides and then thoroughly wash x 3 for 10 minutes in high purity water.  \nPlace slides in high purity water in a Coplin jar and warm to 56°C.\nPrepare ammoniacal silver nitrate solution (0.5%):\n      \nStock ammonium chloride (25-30%) is freshly diluted (1:1) with high purity water.\nAdd ammonium hydroxide (~500-600 μL per 100 mL) drop by drop with stirring to the 0.5% silver nitrate solution which will briefly turn cloudy and then clear.",
    "Warm the solution to 56°C.\nIncubate sections for 10-12 min.\nWash slides for 15 sec in high purity water (this and all subsequent steps are done at room temperature using Coplin jars).\nDip slides for 15 sec in 1% sodium thiosulfate (pentahydrate).\nDip slides for 15 sec in high purity water.\nTone the slides for 2 min in 0.2% gold chloride.\nDip the slides in high purity water for 15 sec.\nExpose the slides to 0.5% oxalic acid for 2 min.\nDip the slides for 15 sec in high purity water.\nTreat the slides for 5 min in 5% sodium thiosulfate.\nWash slides thoroughly in high purity water, dehydrate and coverslip.  \nSlides are now ready for densitometric quantification.17\nAll equipment, including bright field lighting, is turned on for at least 20 min before imaging.\nWhole slice culture sections are imaged at 5-10x on an inverted microscope.\nLight intensity is set to a uniform level (e.g., ~2.6 V) and not changed throughout all image acquisitions.\n        \nNeutral density filters are used as needed to reduce full image transmitted light intensity to ~ 1500 on a 12-bit scale (0-4095) where \"0\" is completely black and 4095 is completely white.\nDigital images are then acquired and stored electronically for all (i.e., sham control and experimental samples), including a background image derived form an area of the slide without slice culture sections. \nThe background image is subtracted from all images (sham and experimental) and an area of interest (AOI) drawn around each slice culture and transmitted light intensity registered. \nImage intensity range is set to a constant range for all experiments. \nFor clarity, resultant expressed as a relative density compared to control levels (Fig. 8). \n7. Representative Results:\nimgsrc://cloudfront.jove.com/files/ftp_upload/2910/2910fig1.jpg",
    "Figure 1.  Slice culture electrophysiological recording paradigm.  Recording microelectrode is first placed in the CA3 pyramidal neuron layer and then a bipolar stimulating electrode is placed in the dentate gyrus (DG). \nimgsrc://cloudfront.jove.com/files/ftp_upload/2910/2910fig2.jpg\nFigure 2.  CA3 evoked field potentials and synaptically induced spreading depression. (A) Experiments begin with determination of the current needed to maximize standard CA3 area field potential responses and then half-maximal intensity is used to elicit CA3 area evoked field potentials.  This documents the normalcy of evoked synaptic responses between preparations.  If a slice's field excitatory post synaptic potentials are not at least 3 mV, slices are discarded.  (B) Next, trans-synaptically evoked threshold for triggering spreading depression is determined (right, slow responses) while at the same time field potentials (left, fast responses) are used to document that preparations are healthy enough to follow 10 Hz stimulation (e.g., amplitudes of vertical deviations in fast potential records are similar).  \nimgsrc://cloudfront.jove.com/files/ftp_upload/2910/2910fig3.jpg\nFigure 3.  Microglial motion associated with reduced synaptic activity.  Evidence shows that microglial branches extend and retract with increased synaptic activity, but long-distance motion of these cells in response to synaptic activity has not been described in uninjured brain.  Our results using fluorescent isolectin B4 labeling of microglia show that a fraction of these cells move long distances under normal conditions.  Furthermore, the number of these traveling microglia is significantly increased when synaptic activity is abolished by culture exposure to tetrodotoxin as shown in the accompanying image.  Red lines mark paths traveled by microglia over a period of 6 hrs with blue arrows marking the origin of a few exemplary microglia.  Calibration bar, 50 μm. \nimgsrc://cloudfront.jove.com/files/ftp_upload/2910/2910fig4.jpg",
    "Figure 4.  PCR screening activities.  (A) We use TRIzol along with Qiagen kits for RNA isolation since, in our hands, this results in significantly greater (P < 0.001; t-test) RNA yield from hippocampal slice cultures than use of Qiagen kits alone.  (B) In addition, we periodically confirm that our RNA extraction procedures produce high quality intact RNA as determined via a gel that shows sharp RNA bands.  (C) We use NormFinder software to choose a reference gene with a best stability value.  For example, slice cultures exposed to lipopolyssacharide (100 ng/mL for 2 hrs) were analyzed for three reference genes (Rpl13a, β-actin, 18s).  Ct values are used to calculate a stability value.  Our data here [and that for other experiments using spreading depression (data not shown)] show that Rpl13a is an optimum reference gene.  (D) We use the \"ΔΔCt\" method as a sensitive and reproducible means to detect fold-change RNA differences between experimental groups and sham controls. \nimgsrc://cloudfront.jove.com/files/ftp_upload/2910/2910fig5.jpg\nFigure 5.  PCR reaction checks.  (A) We measure dilution curve amplifications for primers as a means to verify the quality of PCR reactions.  For example, optimal amplifications show a uniform (1-5) increase in Ct thresholds.  (B) In contrast, amplifications are not uniform with poor primers (1-5).  (C) In addition, we perform a melt curve at the conclusion of PCR assays to confirm that the desired amplicons are detected (i.e., a single peak curve), which indicates the absence of any double stranded DNA including primer dimers, contaminating DNA and misannealed PCR product (which would appear as multiple peak curves).   \nimgsrc://cloudfront.jove.com/files/ftp_upload/2910/2910fig6.jpg",
    "Figure 6.  Nano pre-amplification allows detection of IFN-λ in hippocampal slice cultures.  Since only ~50 T-cells are found in a slice culture (out of ~55,000-90,000 total cells), we used the RT2 nano PreAMP cDNA Synthesis Kit as a means to detect potential ultra-low level expression of IFN-λ.  This means of cDNA preamplification provided a 12-fold increase in sensitivity to RNA levels.  The results shown above illustrate the capacity of preamplification to increase detection sensitivity.  Ct threshold for reference gene Rpl13a was 20.5 with initial amplification and this was increased to 14.1 with use of the preamplification kit, a 12-fold increase corresponding to 12 cycles of PCR amplification of cDNA.  In parallel, IFN-λ was not detectable (0.0) but was well within detection range (29.0) with preamplification.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2910/2910fig7.jpg\nFigure 7.   Innate cytokine pathway phosphoprotein phosphorylation changes.  (A) Exemplary effect of TNF-α pretreatment (i.e., neuroprotection) on innate cytokine pathway phosphoprotein phosphorylation 24 hrs after excitotoxic injury in hippocampal slice cultures.  Results show CA1 area changes between slices pretreated for 3 days with 100 ng/mL TNF-α before exposure to N-methyl-d-aspartate (NMDA) compared to those exposed to NMDA alone (i.e., experimental vs. sham) expressed as a percentage.  Notice that TNF-α induced a sustained phosphorylation increase in JNK and ATF-2 as well as a transient increase in NFκB.  (B) The spatial distribution of NFκB activation (i.e., presence of phosphorylated NFκB in the nucleus) is revealed by immunostaining (red).  YoYo stains nuclei green in a slice culture section [e.g., in astrocytes (arrow head)].  Pyramidal neurons, which otherwise would also appear green, are instead yellow because of concomitant marking with phosphorylated NFκB (red).  Calibration bar, 25 μm.   \nimgsrc://cloudfront.jove.com/files/ftp_upload/2910/2910fig8.jpg",
    "Figure 8.  Proteomic confirmation of siRNA efficiency.  Differentiated silver intensification of peroxidase-diaminobenzidine based immunostaining for cyclophilin B shows that siRNA can significantly (P < 0.001; ANOVA-Holm-Sidak method) reduce global hippocampal slice cyclophilin B expression 3 days after application of 200, 500, or 1,000 nM siRNA."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}