{
  "id": 18838,
  "origin_website": "Jove",
  "title": "Three Dimensional Cultures: A Tool To Study Normal Acinar Architecture vs. Malignant Transformation Of Breast Cells",
  "procedures": [
    "1. Preparation of Materials and Culture Media\nThaw growth factor reduced (GFR) Matrigel at 4 °C O/N.\nWarm up complete media for required cell line at 37 °C. MCF10A- ATCC specified media; HME- Ham's F-12 medium supplemented with 5% fetal bovine serum, 1 µg/ml hydrocortisone, 5 µg/ml insulin, 10 ng/ml epidermal growth factor, and 100 ng/ml cholera toxin; SUM149- Ham's F-12 media supplemented with 5% FBS, 2 µg/ml hydrocortisone and 5 µg/ml insulin; and MDA-MB-231-10% FBS-DMEM\nPrecool an 8-well chamber slide on ice.\nPrepare tissue culture hood and supplies.\n2. Three Dimensional Culture in 8-well Chamber Slide \nCoat each well of the 8-well slide with 40 µl of GFR Matrigel. Add the Matrigel in the center of the slide and then spread using a P200 pipette tip. Try to spread as evenly as possible, avoiding bubbles and overspreading which can lead to meniscus formation.\nIncubate the slides at 37 °C under 5% CO2. While the Matrigel is solidifying, trypsinize the cells, collect and spin at 150 x g in tissue culture centrifuge for 4 min.\nCount the cells and dilute to 12,500 cells/ml in complete media of the respective cell line. Add GFR Matrigel to 2% and add 400 µl to each well of a Matrigel precoated chamber slide.\nIncubate the slides in the CO2 incubator. Give fresh complete media changes every 4th day until 15 days.\nTreatment with pharmacologic inhibitors: For inhibitor studies add small molecule inhibitors to the complete media at the time of plating followed by fresh media changes supplemented with the inhibitors every three days while growing the cells on GFR Matrigel.\nTreatment with purified protein: \nPlate the cells following steps 2.1-2.3. Allow the cultures to grow for 4 days followed by serum starvation for 16 hr.",
    "At day 5, treat the cells with appropriate concentration of purified protein in 0.1% FBS supplemented media to the serum starved cells. Give fresh media change with purified protein after 2 days.\nAt day 10 replace the conditioned media with complete HME media. Allow the cultures to grow for another 5 days.\nImmunofluorescence staining of acinar structures grown on Matrigel: \nPrepare 2% paraformaldehyde, 0.5% Triton X-100 and 100 mM glycine in 1x PBS, pH 7.4. Prepare immunofluorescence buffer (IF buffer) that comprises of 1x PBS containing 0.1% bovine serum albumin, 0.2% triton X-100, 0.05% Tween-20.\nUse a P200 pipette tip to carefully aspirate the conditioned media.\nFix the acinar structures with 2% freshly prepared paraformaldehyde at room temperature (RT) for 20 min.\nPermeabilize the cells with 0.5% Triton X-100 for 10 min at 4 °C.\nWash the cultures three times with 100 mM glycine, 10-15 min for each wash.\nBlock the cells with 10% goat serum in IF buffer, called primary block, for 1 hr at RT.\nIncubate the cultures with a 20 µg/ml goat anti mouse F(ab´)2 fragment in primary block buffer for 30 min. This step is important to block the immunoreactive mouse IgG species in the Matrigel.\nIncubate with primary antibody in the second blocking solution (Primary block+20 µg/ml goat anti mouse F(ab´)2 fragment) O/N at 4 °C.\nWash three times with IF buffer for 10-15 min each with gentle rocking.\nIncubate with fluorescent conjugated secondary antibodies in IF buffer for 45 min.\nWash 3x for 10 min each with IF buffer with gentle rocking.\nMount the slides with anti-fade reagent containing DAPI to visualize the nuclei.\nAllow the slides to dry O/N at RT.",
    "Image acquisition: Acquire confocal images at the colony midsection of cells grown on top of Matrigel. For more information acquire a series of optical sections throughout the entire length of the acinar structure by Z stacking.\n3. Three Dimensional Culture in 2-well Chamber Slides for Immunoblotting\nPrecool a 2-well chamber slide on ice. Follow steps 2.1-2.4 scaling up the reagents for the 2-well chamber slide e.g. coat with 160 µl of Matrigel and add 1.6 ml of cell/Matrigel mix to each well of the 2-well slide.\nHarvest the acinar structures from the Matrigel using the commercially available 3D culture cell harvesting kit following manufacturer's instructions.\nDilute the cell wash and cell harvesting buffers to 1x and precool to 4 °C. Washing and dislodging of Matrigel should be carried out on ice.\nWash the acinar structures 3x using the cell wash buffer.\nCollect the acini into 15 ml centrifuge tubes using cell harvesting buffer followed by 30 min incubation on a rocker at 4 °C. Mix suspension well with a 1 ml pipette. This will break the Matrigel in small pieces and release most of the cells in the cell harvesting buffer.\nPellet the cells at 200 x g in a culture centrifuge. Remove the floating layer of hydrogel from the pelleted cells with a P200 pipette tip.\nResuspend the lysates in SDS sample buffer provided with the kit. RIPA lysis buffer can also be used.\n4. Quantification of Malignant vs. Benign Breast Phenotype\nGrow cells in triplicates for each treatment set following steps 2.1-2.4.",
    "Take phase contrast images of acinar structures from each well at 5X or 10X resolution using a phase contrast microscope attached to a slide shifter and a computer. Take the images by moving the slide from one frame to another and thus covering the entire well of the chambered slide.\nCount the total number of acinar structures, the number of single round flat acini and the number of multiacinar structures or haphazardly growing structures lacking organization and with branching processes emanating from it.\nCalculate the percentage of single round flat acinar structures vs. malignant structures and plot as column graph. Calculate the significance by Student's t-test.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}