{
  "id": 13764,
  "origin_website": "Jove",
  "title": "Isolation of Neural Stem/Progenitor Cells from the Periventricular Region of the Adult Rat and Human Spinal Cord",
  "procedures": [
    "All animal procedures are approved by the Animal Care Committee of the University Health Network, Toronto ON Canada, in accordance with the policies established in the Guide to the Care and Use of Experimental Animals prepared by the Canadian Council on Animal Care. For the harvesting of human spinal cord tissue, approval was obtained from the University Health Network Research Ethics Board and from the Trillium-Gift of Life Foundation which oversees organ donation in Ontario, Canada.\n1. Preparation of Dissection Buffers and Culture Media\nFor the isolation of rat spinal cord, prepare 100 ml dissection buffer (1x PBS + 0.6% glucose + 2% penicillin-streptomycin) and refrigerate. For human spinal cord prepare 100 ml dissection buffer (1x HBSS + 0.6% glucose + 2% penicillin-streptomycin) and refrigerate.\nPrepare 100 ml serum-free medium (SFM) and warm at 37 °C. To prepare SFM, add 2 mM L-glutamine, 100 µg/ml penicillin-streptomycin, 2% B27, and 10% hormone mix to Neurobasal-A medium. To prepare hormone mix, make a 1 : 1 DMEM/F12 medium containing 0.6% glucose, 3 mM NaHCO3, 5 mM HEPES, 25 µg/ml insulin, 100 µg/ml apo-transferrin, 10 µM putrescine, 30 nM selenium, and 20 nM progesterone.\nPrepare the EFH growth factor-enriched plating media (to SFM add 20 ng/ml EGF, 20 ng/ml bFGF, and 2 µg/ml heparin) and warm at 37 °C. Ensure that human EFH contains human recombinant growth factors (see Table of Materials).\n2. Harvesting and Dissection of Adult Rat Periventricular Spinal Cord Tissue",
    "Sterilize dissecting instruments in ethanol and rinse in sterile saline, or autoclave instruments in advance. Give rat (6 - 8 weeks old) a lethal injection of sodium pentobarbital (1 cc at 65 mg/ml) or overdose of anesthetic (i.e., 4% isofluorane) according to one’s institution approved animal protocol. Douse the back of the rat with 70% ethanol and remove the skin on the dorsal surface with large dissection scissors.\nHolding the scissors perpendicular to the dorsal surface, transversely cut the vertebral column above the hindlimbs. Use smaller scissors to longitudinally cut the dorsal muscle overlying the vertebral column in a rostral direction to expose the spinous processes.\nStarting at the exposed caudal end, insert rongeurs or a small blunt bone-cutting instrument extradurally into the lateral aspect of the spinal canal in the space between the spinal cord and the vertebral column. Make small cuts into the lamina (bony arches left and right of the spinous processes on each side of the vertebrae) and carefully peel away the lamina to expose the spinal cord (Figure 1A-D). Ensure the angle of the blades is shallow and parallel to the cord so the underlying spinal cord is not damaged.\nContinue laminectomy in the rostral direction to expose the thoracic and cervical spinal cord.\nGently excise the spinal cord from the vertebral column with blunt tissue forceps and use microscissors to carefully sever the roots to release the cord. Place the excised spinal cord in a Petri dish containing 4 °C sterile rat dissection buffer (described above in 1.1). Rinse the tissue in freshly prepared 4 °C dissecting buffer and using scissors cut the spinal cord transversely into 1 cm segments (Figure 1E).",
    "For each segment of tissue, use one hand to hold the tissue with fine forceps. With the other hand, use microscissors to carefully remove the overlying meninges, white matter, and most of the grey matter with the aid of a dissecting scope. Alternatively, use fine forceps (Dumont #4) to peel away most of the grey and white matter, leaving only the periventricular region of the spinal cord which includes the ependyma and a small amount of surrounding grey matter (Figure 1F-H).\nPool the dissected periventricular tissue into a 10 cm sterile Petri dish containing cold rat dissection buffer.\n3. Harvesting and Dissection of Adult Human Periventricular Spinal Cord Tissue\nNote: Human spinal cord tissue is harvested from adult organ transplant donors (donors ranged in age from 2 to 60 years of age) after the other organs have been removed for organ transplantation. The Trillium-Gift of Life Program obtains consent for removal of tissue for research purposes from the patient’s family and notifies our harvesting team in a timely fashion such that we have been able to harvest the cords within 2 hrs of aortic cross-clamping. Male and female adult donors with negative serology and no infections are accepted.\nHarvest tissue in a sterile fashion in the operating room through an anterior approach using the same anterior exposure already dissected for organ removal by the organ transplant harvesting team.\nExpose the anterior spinal column through retraction with large rib spreaders and large paddle retractors of the remaining tissues and organs including the large blood vessels.",
    "Use a sternal saw mounted with a long blade to cut through the intervertebral discs at the rostral and caudal ends of the desired length of the vertebral column to be resected. Angle the saw about 45° medially to cut a triangular trough from the lateral part of the vertebral bodies stopping just short of the spinal canal.\nRemove en bloc the medial aspects of the vertebral bodies of the desired segments with the aid of curved osteotomes and mallet taking care to avoid cutting through the dura. Then gently lift the dura covered spinal cord with toothed forceps and sharply incise the rostral and caudal ends of the cord. Use long scissors and forceps to bilaterally transect the individual roots.\nPlace the excised segment of the spinal cord in 4 °C sterile buffer (1x HBSS + 0.6% glucose + 2% penicillin-streptomycin) in a large test tube for transportation to the tissue culture room.\nNote: Generally, a 3 - 6 cm segment of spinal cord from the upper thoracic and/or mid-to-low thoracic level is removed in the operating room under sterile conditions as soon as possible after cessation of circulation and placed in cold sterile buffer. The time elapsed between cessation of circulation and removal of the spinal cord varies with the time required to harvest the targeted organs for donation and has ranged from 45 min to 2 hrs. If the heart and lungs have also been removed, the dissection can be taken far rostrally to harvest a portion of the lower cervical cord as well.\nDissect the human spinal cord tissue as soon as possible after harvesting, generally within 3 hrs. Remove the dura and other meninges with forceps. Rinse the spinal cord tissue in freshly made 4 °C dissection buffer and cut transversely into 1 cm segments.",
    "With the aid of a dissecting scope, excise the overlying meninges, white matter, and most of the grey matter using tissue forceps, fine forceps and microscissors for each tissue segment. Pool the dissected periventricular tissue, which includes the ependyma and a small amount of surrounding grey matter, into a 10 cm sterile Petri dish containing cold human dissection buffer.\n4. Isolation and Culturing of Adult Rat and Human Spinal Cord NSPCs\nPerform the following steps aseptically in a laminar flow hood.\n\t\nMince the dissected rat or human periventricular tissue into 1 mm3 pieces with microscissors.\nEnzymatically dissociate the minced tissue with proteolytic enzymes using the papain dissociation kit as indicated in the table of materials/reagents. Note: Reagent components include 4 vials; Vial 1: Earle's Balanced Salt Solution (EBSS), Vial 2: Papain containing L-cysteine and EDTA, Vial 3: Deoxyribonuclease I (DNase), Vial 4: Ovomucoid protease inhibitor with bovine serum albumin (BSA).\nNote: Note: Papain is a sulfhydryl protease that has wide specificity for protein substrates. The papain herein is derived from the latex from the Carica papaya plant and degrades most protein substrates more extensively than pancreatic proteases. During the dissociation process there is some cell damage causing DNA to be released into the dissociation medium which will increase viscosity and make pipetting difficult. Thus, DNase is included in the cell isolation procedure to digest the DNA without damaging the intact cells. Ovomucoids are glycoprotein protease inhibitors used to inhibit the papain activity after the dissociation step.\nAt first use, reconstitute the albumin ovomucoid inhibitor mixture (vial 4) with 32 ml of EBSS (vial 1), and then store at 4 °C and use for subsequent isolations. Note: This yields a solution at an effective concentration of 10 mg of ovomucoid inhibitor and 10 mg of albumin per ml.",
    "Add 5 ml of EBSS (vial 1) to a papain vial (vial 2), yielding a solution at 20 units of papain/ml in 1 mM L-cysteine with 0.5 mM EDTA. Check that the papain solution appears clear when completely dissolved, otherwise place the vial in a 37 °C water bath for ten minutes until the papain is completely dissolved to ensure full activity of the enzyme.\nAdd 500 µl of EBSS (vial 1) to a DNase vial (vial 3) and mix gently as DNase is sensitive to shear denaturation. Add 250 µl of the DNase solution to the vial containing the papain, resulting in a final concentration of approximately 20 units/ml papain and 0.005% DNase. Save the balance of the DNase vial to use later.\nPlace the minced rat or human tissue in the papain solution as prepared in step 4.4 above. For the human tissue isolation, split the minced tissue equally between two papain vials (approximately 0.2 g/vial).\nIncubate at 37 °C with constant agitation on a rocker platform to dissociate the tissue in the activated papain solution. Incubate rat tissue for 45 min to 1 hr, and human tissue for 1 to 2 hrs depending on the amount of minced tissue, about 0.2 – 0.4 g respectively.\nTriturate the mixture with a 10 ml pipette to dissociate any remaining tissue pieces to yield a cloudy cell suspension. Transfer the cell suspension (do not include any pieces of undissociated tissue) into a sterile 15 ml conical tube and centrifuge at 300 x g for 5 min at RT.\nResuspend the pelleted cells in medium containing ovomucoid, a papain inhibitor.",
    "Prepare the ovomucoid solution by mixing 2.7 ml EBSS (vial 1) with 300 µl of the reconstituted albumin-ovomucoid inhibitor solution (vial 4) in a 15 ml conical tube. Add 150 µl of DNase solution (vial 3) saved at step 4.4 above.\nDiscard the supernatant from the pelleted cells and immediately resuspend the cell pellet in the diluted DNase albumin-inhibitor mixture. \nSeparate intact cells from cell membranes by centrifugation through a single step discontinuous density gradient.\n\t\nPrepare the discontinuous density gradient by adding 5 ml of albumin-inhibitor solution (vial 4) to a 15 ml tube, and using a 5 ml pipette, gently and slowly layer the cell suspension (prepared as described above in step 4.8) on top of the albumin-inhibitor solution.\nCentrifuge at 70 x g for 6 min at RT.\nNote: The interface between the two layers of the gradient should be clearly visible, although minimal mixing at this boundary does not affect the result. Membrane fragments remain at the interface and dissociated cells pellet at the bottom of the tube. \nFor rat cells, discard the supernatant and resuspend the cell pellet in 1 ml of rat EFH medium (pre-warmed at 37 °C). Count live cell density with a haemocytometer and plate the cells into a T25 culture flask at a density of 10 cells/µl in EFH. The typical yield of cells from rat tissue is about 2 x 106 cells with about 80% viability.If clonal cultures are desired, seed cells at a density of less than 10 cells/µl. Incubate the flasks at 37 °C in 5% CO2 and allow the cultures to grow undisturbed for 1 week to avoid aggregation of spheres.",
    "For human cells, discard the supernatant and resuspend the cell pellet in 10 ml of human EFH medium (pre-warmed at 37 °C). Filter the cell suspension through a 40 µm nylon cell strainer followed with 30 ml of EFH to remove myelin and cell membrane fragments. Centrifuge at 300 x g for 5 minutes and resuspend the cell pellet in 1 ml of EFH medium.\nCount live cell density with a haemocytometer and plate the human cells into 6-well culture plates at a density of 105 cells/well in a total volume of 5 ml EFH/well. The typical yield of cells from human tissue is about 1 x 106 cells with about 70% viability. Pre-coat wells with an adherent substrate such as Matrigel (see Note below). Dilute at a ratio of 40 µl Matrigel : 1 ml SFM.\nNote: Alternatively, other adherent substrates such as poly-D-lysine/laminin, fibronectin, or collagen may be used.\nIncubate the plates at 37 °C in 5% CO2 and allow the cultures to grow undisturbed for 1 week.\n5. Passaging of Adult rat and human spinal cord NSPCs\nRat NSPCs will form small neurospheres approximately 70 µm in diameter within 1 week of initial seeding; passage rat NSPCs weekly by collecting the cell suspension, centrifuging at 300 x g for 5 min, and mechanically triturating the cell pellet to dissociate the neurospheres.\nSeed the dissociated cells into T25 flasks containing fresh rat EFH medium. Alternatively, use 50% conditioned rat medium for passaging. The typical yield of rat NSPCs at passaging is about 5 x 106 cells which increases exponentially with passage number.",
    "For the human cultures, one week after the initial plating, replace half of the culture medium with fresh EFH twice weekly to allow the cells to adhere to the substrate. Generally, 1 - 2 weeks later once the cells have attached to the substrate, replace the entire volume of culture medium twice a week with fresh EFH.\nSubculture cells before reaching confluence between 4 - 8 weeks.\n\t\nSubculture cells by detaching cells from the substrate enzymatically (see Table of Materials) with 2 ml of enzyme per well incubated for approximately 10 min at 37 °C. Collect cell suspension, centrifuge at 300 x g for 5 min, and gently resuspend the cell pellet in 1 ml of freshly made EFH medium.\nCount live cells with a haemocytometer and plate the cells into 6-well culture plates (pre-coated as above in step 4.12) at a density of 105 cells/well in a total volume of 5 ml EFH/well. The typical yield of human NSPCs at passaging is about 2 x 106 cells and generally this will double with passage. Generally, maintain cultures with 50% conditioned EFH medium 2 - 3 times per week between passaging.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}