{
  "id": 4666,
  "origin_website": "Bio",
  "title": "Random DNA Binding Selection Assay (RDSA)",
  "procedures": [
    "Random DNA preparation   PCR amplification. The double strand DNA fragments RDSA1 and RDSA2 with 20- and 18-bp random sequence regions flanked by independent sets of adaptors were amplified on the templates of RDSA_1 and RDSA_2 by PCR, using RDSA_1/2fo and RDSA_1/2re primers, respectively (Table 1). Conditions for PCR amplification are: 5 min at 94 °C; 30 cycles of 30 sec at 94 °C, 30 sec at 50 °C, and 30 sec at 72 °C; 10 min at 72 °C.   Purification of PCR products.   Take at least 200 μl PCR products; add equal volume of 24:1 (chloroform: isoamyl alcohol) to sample tubes; shake tubes vigorously by hand for at least 30 sec, centrifuge the sample at 15,000 x g for 10 min at 4 °C.   Transfer the aqueous phase to fresh tubes; add equal volume of isopropanol and mix; place in -20 °C freezer for 1 h.   Centrifuge the samples at 15,000 x g for 10 min at 4 °C.   Discard the supernatants and wash the precipitates with 70% alcohol.    Air dry the precipitates for at least 10 min; dissolve the precipitates in sterile ddH2O and store at -20 °C until use.        Prokaryotic expression of target protein tagged with GST or CBD (chitin binding domain)   Construct expression vector. The coding region of the target gene is ligated in frame into the expression vector pGEX-6P-1 (for GST fusion protein) or pTXB3 (for CBD fusion protein).   The constructs are transformed into E.coli expression strain BL21 (DE3) to express fusion proteins.      RDSA cycles   Harvest cells (100 ml bacterial cultures) and resuspend them in PBS buffer (for GST fusion protein) or column buffer (for CBD fusion protein).   Break cells by sonication (950 W x 20%, 2-10 min according to the solubility of the expressed protein and with 2 sec interruption after every 2 sec sonication.",
    "The tube with sample should be placed in ice-water during manipulation) and centrifuge at 1,000 x g for 10 min at 4 °C.   Prepare beads columns (load at least 3 ml beads in each chromatography column); equilibrate the glutathione sepharose beads column (for GST fusion protein) with PBS buffer (ten times of the bead volume), and the chitin beads column (for CBD fusion protein) with column buffer (ten times of the bead volume). In the following steps, the beads columns should be placed on ice.   Slowly load the clarified lysate on to the columns.   Wash the columns with at least 20 times of bed volume PBS buffer for GST fusion protein or column buffer for CBD fusion protein to thoroughly remove the unbound proteins; wash the beads at least three times with RDSA buffer; resuspend the beads in 3 ml RDSA buffer. Now the recombinant target protein is immobilized on beads.    Divide the beads into 5-10 tubes (1.5 ml tube).   Add the random DNA fragment RDSA1 or RDSA2 (10 μl, about 5-10 μg) into one tube; incubate for more than 2 h at 4 °C with gentle rolling.   Centrifuge at 500 x g for 5 min at 4 °C, discard the supernatant completely.   Wash the beads with RDSA buffer for at least four times to remove unbound DNA fragments; add 500 µl sterile ddH2O and boil the beads for 5 min to release the bound DNA; centrifuge at 500 x g for 5 min at 4 °C.   Transfer the supernatant to a fresh tube; purify and precipitate the released DNA as described in step A2 (do not need to dissolve the DNA).    Add PCR reagents to the tube: table:",
    "﻿0,1\n74 µl,ddH2O\n10 µl,10x PCR buffer\n10 µl,2.5 mM dNTP\n2.5 µl,20 μM RDSA1 fo or RDSA2 fo primer\n2.5 µl,20 μM RDSA1 re or RDSA2 re primer\n1.0 µl,rTaq DNA polymerase\n Perform PCR amplification using the following parameters: 5 min at 94 °C; 30 cycles of 30 sec at 94 °C, 30 sec at 50 °C, and 30 sec at 72 °C; 10 min at 72 °C.   Purify the PCR products as described in A2; dissolve the DNA in 10 μl sterile ddH2O and transfer the DNA to another tube in C6 for the next RDSA cycle (repeat steps C7-12).    After 5 to 10 cycles, clone the purified PCR products into pGEM-T easy vector and sequence."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}