{
  "id": 5706,
  "origin_website": "Bio",
  "title": "Using Silicon Polymer Impression Technique and Scanning Electron Microscopy to  Measure Stomatal Aperture, Morphology, and Density",
  "procedures": [
    "Select leaves for observation3- to 4-week-old mature, fully expanded and flat Arabidopsis leaves.The leaves at same developmental stage were collected after treatments immediately for use. Note: Thermotolerance test as described previously by Huang et al. (2017).Gently and thoroughly remove any moisture and any other surface contamination with a piece of lens cleaning tissue from the sample tissues. Note: Do not wipe it.Impression mold preparationThe silicone impression material was applied on the lower surface (abaxial side) of leaves to obtain the negative impression mold (Figure 1A).Mix two equal-volume pea size drops of the dental polymer pastes [A (base) + B (catalyst)] with a toothpick on a glass slide.Note: This step should be completed in less than 10 sec to avoid the impression material to thicken. As soon as possible, apply a small amount of the polymer to the leaf surface using a toothpick, and allowed it to harden for 3 to 5 min.Note: The silicone forms a mold that is less than 1/2 inch.When the polymer is not sticky, carefully remove the mold with a toothpick by gently pushing at one of the edges until the mold gradually peels away, do not attempt to remove it completely in one go.Note: If experiencing difficulties, introduce a small amount of water under the edge of the mold to help loosen it from the leaf. Place the mold upside down on double-sided tape on a glass slide, and examine under a dissection microscope to check for air bubbles and foreign particles that might obstruct analysis. Note: Orientating the mold horizontally ensures the Epoxy applied in the next step will not flow out.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170810/20170810002548_0261.jpgFigure 1. Silicon polymer impression technique and scanning electron microscopy (SEM) to measure stomatal apertures. A.",
    "(a) Mix silicon polymer (reagents A + B) with a toothpick on a slide; (b) Apply on the lower surface of leaf; (c) Negative impression mold made with silicon polymers; (d) The mold seated on a double-sided tape on top of the glass slide. B. (a) Mix Epoxy gel (reagents C + D) with a toothpick; (b) Fill the impression mold with freshly mixed Epoxy gel; (c) Thoroughly harden the Epoxy gel at room temperature (RT) for overnight, or in a 60 °C oven for 1 h; (d) Once hardened, observe using SEM examination. C. The example of image was taken using an SEM. The round shapes on the SEM picture could be air bubbles and foreign particles.Cast preparationFill the top of the impression mold with an Epoxy gel to prepare the cast (Figure 1B).Mix directly two equal-volume pea size drops of the Epoxy gel [C (resin) + D (hardener)] on a glass slide using a toothpick. Air bubbles that were introduced during mixing need to be removed with the toothpick. After the gel becomes viscous (it usually takes 10 sec), apply to the surface of the mold. Note: Make sure that the resin is not too thin, and applying additional amounts if necessary. For easily removing the cast from the mold, you can attach ultrafine threads at the edge of the cast if necessary (see Kwiatkowska and Burian, 2014).Leave the molds filled with Epoxy at room temperature overnight or in a 60 °C oven (not under vacuum) for 1 h to thoroughly harden the cast. Gently remove the resin using forceps, and examine first under the dissection microscope, then place on a SEM stub.",
    "SEM observationThe cast was fixed on metal stubs, and coated with a thin gold-palladium (1:1) film to 3 min in an automated sputter coater with a rotating stage.Follow the SEM manual to visualize the cast.Setting the parameters for stomata visualization.Note: Non-biological samples, it is not necessary to consider the loss of water, the intensity of electron flow, etc., so there are no special conditions on the setting.Setting high accelerating voltage to 15 kV (as a guideline) and photographed at 500x magnification. Note: Less resolution and noise images may occur at low accelerating voltages. Due to non-plane of stomata has the existence of an angle, try to acquire images with cells within the focal plane to avoid error of measurement."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}