{
  "id": 11859,
  "origin_website": "Jove",
  "title": "Pooled shRNA Library Screening to Identify Factors that Modulate a Drug Resistance Phenotype",
  "procedures": [
    "Follow the Institutional Biosafety Committee (IBSC) guidelines and use the proper facility to handle lentivirus (BSL-2). Personnel should be appropriately trained in the handling and disposal of lentivirus. This protocol follows the biosafety guidelines of Christian Medical College, Vellore.\n1. Selection of the most potent promoter to obtain persistent and prolonged expression of the shRNAs\nNOTE: It is essential to perform a transduction experiment using lentiviral vectors with different promoters that express fluorescence proteins to identify the promoter that provides a stable and long-term expression of shRNAs in the cell line selected for the experiment. The most commonly used promoters for this purpose are hEF1α (human elongation factor 1α), hCMV (human cytomegalovirus), and SSFV (spleen focus-forming virus) promoters that express green fluorescence protein (GFP) (Figure 2A).\nPerform the cell count using the trypan blue exclusion method. Suspend the MV4-11 AraC R cells in 10% RPMI medium (RPMI with 10% FBS supplemented with 100 U/mL penicillin and 100 U/mL streptomycin) containing 8 µg/mL polybrene. Seed 1 x 106 cells in 1.5 mL of medium/well of a six-well plate in triplicates.\nAdd different volumes of concentrated lentiviruses (for example, 10 µL, 20 µL, and 40 µL depending on the titer of the lentiviruses) to each well. Gently swirl the plate to mix the contents.\nPerform spinfection by centrifugation at 920 x g at 37 °C for 90 min.\nImmediately incubate the plates in a CO2 incubator (5% CO2 at 37 °C).\nObserve the GFP expression after 48 h under a fluorescence microscope to ensure successful transduction.\nQuantify the GFP expression by flow cytometry after 72 h to evaluate the transduction efficiency.",
    "Culture the cells for a total of 2 weeks and monitor the GFP expression periodically by flow cytometry. The reduction in GFP expression measured by the mean fluorescence intensity and the percentage of GFP+ cells indicate promoter silencing.\nSort the GFP+ cells on the 10th day and culture the cells for 1 week after sorting. Check the GFP expression periodically during the culture.\nUse the untransduced cells to set the gate. A population beyond the 1 x 101 scale toward the right on the x-axis is considered a positive population for GFP.\nChoose the promoter that shows a persistent expression of GFP in the prolonged culture of the cells.\n2. Preparation of pooled lentiviral human epigenetic factor shRNA library\nCulture 293T cells (at a low passage number with a good proliferation rate) in three 10 cm cell culture dishes with 8 mL of 10% DMEM medium (DMEM with 10% FBS containing 100 U/ml penicillin and 100 U/ml streptomycin) in each plate.\nOnce the cells attain 60% confluency, replace the medium with a complete medium.\nPrepare the transfection mix (as outlined in Table 1) that contains serum-free medium, lentiviral packaging (psPAX2) and envelope plasmid (pMD2.G), pooled library plasmids, and finally, the transfection reagent.\nTap the mixture to mix it well and incubate at room temperature for 15 min.\nAdd the transfection mixture to the 293T cells and mix gently by swirling the plates. Incubate the plates in a CO2 incubator (5% CO2 at 37 °C). Change the medium after 24 h.\nAfter 48 h, check for GFP expression under a fluorescence microscope to ensure high transfection efficiency in the 293T cells.",
    "Collect the virus supernatants after 48 h, 60 h, and 72 h and store them at 4 °C. Add fresh medium (8 mL) at each time point after collecting the virus.\nPool the virus supernatants. The total volume of the pooled viruses will be: ~8 mL/plate x 3 collections= ~24 mL/plate; ~24 mL/plate x 3 plates = ~72 mL from 3 plates.\nFilter the pooled viruses with the 0.4 µm filter.\nFor obtaining a high titer of viruses, concentrate the pooled viruses by ultracentrifugation. Transfer the filtered virus supernatant to two 70 Ti tubes (32 mL/tube) and centrifuge at 18,000x g for 2 h with slow acceleration and deceleration. Use a rotor and centrifuge precooled to 4 °C.\nTake out the tubes from the centrifuge gently and remove the supernatant completely.\nUsing a micropipette, gently resuspend the pellet in 400 µL of DMEM (without FBS and antibiotics). Incubate on the ice for 1 h and mix the pellets from both tubes.\nAliquot the viruses and freeze at −80 °C.\n\tNOTE: The tubes and viruses must be kept on ice during steps 2.10.-2.13. Avoid frothing while resuspending the virus with the plain medium. The medium should be maintained at 4 °C.\nCalculate the concentration (x) of virus as below:\n\tTotal volume before concentration = 72 mL (72,000 µL)\n\tVolume after concentrating = 400 µL\n\tThe concentration = 72,000/400= 180x\n3. Estimation of the transduction efficiency of lentiviruses\nTransduce 293T cells with the concentrated virus in different volumes (2 µL, 4 µL, 8 µL) to confirm the successful preparation of lentiviruses.\n\tNOTE: If concentrated viruses show high transduction efficiencies (>50%) in small volumes (1-2 µL), it is advisable to dilute the concentrated virus in the desired amounts (100x to 75x).",
    "Dilute the concentrated virus to 100x with DMEM (without FBS and antibiotics) to perform titration experiments in the MV4-11 AraC R cell line.\nSeed 1 x 106 cells (MV4-11 AraC R cell line in 1.5 mL of 10% RPMI medium containing 8 µg/mL polybrene) in one well of a six-well plate. Prepare four wells for transducing with different volumes of viruses.\nAdd four different volumes (for example, 1 µL, 1.5 µL, 2 µL, and 2.5 µL) of 100x viruses.\nPerform spinfection by centrifugation of the plate at 920 x g for 90 min at 37 °C.\nAfter 72 h, measure the percentage of GFP+ cells by flow cytometry.\nDetermine the volume of the viruses to obtain 30% transduction efficiency. This low transduction efficiency is to ensure single shRNA integration per cell.\n4. Transduction of pooled epigenetic shRNA library in the drug-resistant cell line\nMaintain the target cell line MV4-11 AraC R at a 0.5 x 106 cells/mL density. Ensure the cells are at the exponential growth phase in culture.\nCalculate the number of cells to be taken for the experiment as below based on the number of viral integrants.\n\tNumber of cells required for transduction = 5,485 (number of shRNAs) × 500 (fold shRNA representation) / 0.25 (MOI) = 10,982,000 ~11 x 106 cells\nResuspend 1.1 x 107 cells in 16 mL of 10% RPMI medium.\nAdd polybrene (8 µg/mL) and mix well. Then, add the required volume of viruses to obtain 30% transduction efficiency as calculated in the previous section.\nSeed all the cells on a six-well plate at a density of 1 x 106 cells/1.5 mL of 10% RPMI medium per well.\nCentrifuge the plate for 90 min at 920 x g at 37 °C.\nIncubate the plate overnight in a CO2 incubator (5% CO2 at 37 °C).",
    "After 24 h, change the medium and transfer the transduced cells to a T-75 flask.\nAfter 48 h, check the GFP under a fluorescence microscope to ensure successful transduction.\nAfter 72 h, quantitate the percentage of GFP+ cells by flow cytometry.\n5. Enrichment of GFP positive cells\nNOTE: Expand the transduced cells by culturing them at a density of 0.5 x 106 cells/mL for 5-7 days. These cells are a mixed population of transduced and untransduced, selected based on GFP by sorting, as mentioned in the next step.\nPerform flow-sorting of GFP+ transduced cells with the flow-sorting settings set as high purity and low yield. Use the untransduced cells to set the gate. A population beyond 1 x 102 toward the right is considered a positive population.\nCollect the sorted cells in 5% RPMI (RPMI with 5% FBS supplemented with 100 U/mL penicillin and 100 U/mL streptomycin).\nCulture the sorted cells in a 10% RPMI medium.\nAfter 72 h, perform the post-sorting estimation of the percentage of GFP+ cells to ensure >95% sorting efficiency.\n\tNOTE: Make sure to obtain ~3-5 x 106 GFP positive cells after sorting to obtain 450x to ~500x representation of the shRNA library.\n6. Dropout screening to identify epigenetic factors mediating drug resistance\nCulture the shRNA library transduced cells in 10% RPMI for up to 5 days. Cryopreserve the transduced cells for future experiments, if required, before the drug treatment.\nCentrifuge 1 x 107 cells in duplicates at 280 x g for 5 min at 25 °C. Discard the supernatant, and store the pellets at −80 °C. These samples will serve as the baseline reference for the epigenetic shRNA library.\nCulture the remaining transduced cells as duplicates (R1 and R2), each maintained at a cell count that provides a 500x representation of the library.",
    "Treat one of the duplicates with the drug (10 µM cytarabine) (R2) and the other without the drug treatment (R1).\nChange the medium for the flasks with and without the drug every 72 h. Repeat the medium change 3x for a cumulative drug exposure of 9 days.\nAfter 9 days of drug treatment, check the viability of the cells by the trypan blue exclusion method.\nCentrifuge the remaining cells at 280 x g for 5 min at room temperature. Resuspend the cells in sterile PBS and wash the cells. Centrifuge at 280 x g for 5 min at room temperature.\nDiscard the supernatant and store the pellets at −80 °C for DNA extraction.\n7. Amplification of the integrated shRNAs by PCR\nExtract DNA from the transduced baseline cells (T) (step 6.2.) and the cells treated with the drug (R2) and untreated with the drug (R1).\nCheck the concentration of the sample using a fluorometer.\nCalculate the amount of DNA required for PCR as below:\n\t5,485 (no. of shRNAs) × 500 (shRNA representation) × 1 x 6.6−12 (g/diploid genome) = 15 µg of DNA\nSubject the samples to the first round of PCR.\n\tNOTE: The PCR reaction mixture is depicted in Table 2 with the thermal cycler conditions. Details of the primers are provided in Supplementary Table 1.\nSet up multiple reactions containing 850 ng of DNA per tube (for a total of 43 reactions).\n\tNOTE: The first round of PCR amplifies the flanking regions of the shRNA resulting in an amplicon size of 397 bp.\nPool the PCR products and purify the PCR products using 3-4 columns of a standard gel/PCR purification kit.\n\tNOTE: Details are provided in Table 3.\nElute the product in 50 µL of buffer from each column and pool the elutes.",
    "Quantify the DNA and store it at −20 °C.\n\tNOTE: The reagents are tabulated in Table 4 with the thermal cycler conditions. The second-round PCR utilizes the primers with the INDEX sequence required for multiplexing in NGS in a singleflow cell. So, each sample should be tagged with a different index. Primer sequences are provided in Supplementary Table 1.\nSet up four reactions with 500 ng of the primary PCR product in a total reaction volume of 50 µL for each sample and the negative control.\nLoad the entire product for electrophoresis using 2% TBE agarose gel and confirm the band size using a 1 kb molecular ladder. The size of the amplicon is 399 bp.\nVisualize the PCR products on the gel documentation system.\nExcise the specific band and purify using a gel purification kit.\n\tNOTE: Calculations for purification with the kit are provided in Table 3.\nElute in a final volume of 30 µL of elution buffer. The approximate concentration of each eluent will be around 80-90 ng/µL with a total volume of 30 µL.\n8. Next-generation sequencing and data analysis\nSequence the gel-purified product from step 7.13. on a next-generation sequencer (e.g., Illumina) to obtain the read count for the depleted shRNAs.\nTrim the adaptor sequences of the generated FastQ reads using the Fastx-tool kit (version 0.7).\nAlign the filtered reads to reference sequences using a Bowtie aligner with the parameter of allowing two mismatches. Ensure the read length after adapter trimming is around 21 bp.\nLoad the files using the Samtools (version 1.9) program. Use the Flagstat option and calculate the alignment summary.\nLoad the trimmed fastQ files in CRISPRCloud2 (CC2) software (https://crispr.nrihub.org/) along with the reference shRNA sequences in the form of FASTA files and perform the analysis as per the instructions.",
    "Click on the Start Analysis link in the CC2.\nSelect the screen type as Survival and Dropout screens. Set the number of groups and type the name for each group.\nUpload the reference library in FASTA file format. The data uploaded is processed. Click on the output URL to obtain the results.\n\t\tNOTE: This software uses a beta-binomial model with a modified Student's t-test to measure differences in sgRNA/shRNA levels, followed by Fisher's combined probability test to estimate the gene-level significance. It calculates estimated overall log2-fold changes (Log2Fc) of shRNAs for the epigenetic factors between the treated (enriched/depleted) and the untreated samples (baseline) with \"p-values\" and \"FDR values.\"\nEnsure the FDR value is \"Negative\" for a Dropout screen and \"Positive\" for a Survival screen.\n\tNOTE: CC2 is an analysis platform for counting the reads and calculating the fold representation (enrichment or depletion) of shRNAs between samples.\nIdentify the significantly enriched and depleted shRNAs (FDR <0.05) from the CC2 results.\n\tNOTE: There are 5-24 shRNAs against each factor. Check the FDR values for each of the shRNAs; consider the FDR, which is <0.01, and take an average for the selected shRNAs. Consider the top 40 hits. Plot the graph for the selected factors based on Log2Fc or FDR negative values. Make sure the non-targeting shRNAs also have significant FDR values to ensure the authenticity of the data as they serve as control shRNAs.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}