{
  "id": 10684,
  "origin_website": "Jove",
  "title": "Isolation of Primary Murine Retinal Ganglion Cells (RGCs) by Flow Cytometry",
  "procedures": [
    "All procedures detailed in the following protocol were approved by the Institutional Animal Care and Use Committee (IACUC) review board at the University of Tennessee Health Science Center (UTHSC) and followed the Association for Research in Vision and Ophthalmology (ARVO) Statements for the Use of Animals in Ophthalmic and Vision Research, in addition to the guidelines for laboratory animal experiments (Institute of Laboratory Animal Resources, Public Health Service Policy on Humane Care and Use of Laboratory Animals).\n1. Preparation of Instruments, Solutions, and Media\nNote: All information about materials, reagents, tools, and instruments reported in the protocol are specified in the Table of Materials.\nAutoclave all dissection instruments and store them in a sterile area. Use the following instruments: 4 standard forceps (2 long and 2 short) and 2 scissors, as well as 2 forceps (1 long and 1 short) and 1 scissor for the dissection; keep an extra set as a backup.\nPrepare 100 mL of sterile PBS/1% FBS solution to use during washes, immunolabeling procedures, and cell sorting steps. Keep the solution chilled at 4 °C.\nNote: Do not add sodium azide (NaN3) to the solution, as it can be toxic to live cells.\n\t\nPrepare 100 mL of PBS/1% FBS with 99 mL of PBS and 1 mL of FBS.\nPrepare 100 mL of sterile neural cell medium supplemented with 3% FBS (see the Table of Materials) for use as collection and culture medium. Keep cell culture medium sterile at 4 °C. Only warm it to room temperature (RT) prior to use.\n\t\nPrepare 100 mL of neural cell medium supplemented with 3% FBS using 97 mL of neural cell medium and 3 mL of FBS.",
    "Pre-chill collection tubes (15-mL tubes) pre-coated with 5 mL of collection medium by placing them in an ice bucket. Only use polypropylene tubes to prevent the cells from adhering to the tube surface.\nPlace 40-mm dishes, 70-µm nylon strainers, syringes, pestles for the cell strainer, and sterile polypropylene tubes in the biosafety cabinet. Sterilize all items prior to the procedures and maintain them in a sterile manner throughout the procedures.\nNote: All steps after the collection of the retinae will be performed in the biosafety cabinet.\n2. Enucleation\nNote: A total of 10 young (5-7 weeks old) C57BL/6J mice were used in this experiment to isolate 1.0 x 106 RGCs with the phenotype CD90.2+CD48negCD15negCD57neg.\nEuthanize the mice using CO2 inhalation followed by cervical dislocation. Always use a secondary euthanasia method to ensure that the euthanized animal is dead.\nNote: Isofluorane can be used as an alternative to CO2. Ketamine is not recommended, as it is associated with an increase in the intraocular pressure (IOP) when used as an inducer of anesthesia24,25.\nInsert forceps under the globe of the eye, grip the optic nerve, and pull up; the globe will be enucleated, with the optic nerve intact. Place collected eyes in a vial containing PBS and keep the vial on ice until the next step.\nNote: Any personnel can carry out this step after receiving the appropriate training from the Laboratory Animal Care Unit (LACU).\n3. Preparation of the Retinal Cell Suspension\nPlace the collected eye on the base plate of a dissection microscope to begin the corneal dissection. Dissect each eye individually.\nCarefully hold the globe at the optic nerve base using forceps. For this step, use one long, and one short standard forceps.",
    "Use a 30-gauge (30G) sharp needle to puncture the cornea to allow the aqueous humor to evacuate from the eye, making it easier to hold the eye with the forceps.\nHold the cornea with the forceps and use scissors to make a small incision in the cornea. Gently peel the cornea and sclera using the forceps. When the globe is peeled halfway, roll the retina and lens out using the forceps. Discard the cornea, sclera, and lens.\nNote: This method ensures that the retina completely detaches from the remainder of the eye.\nPlace the retina in a small 40-mm Petri dish containing PBS/1% FBS.\nNote: As an alternative to the Petri dish, a cell culture dish can be used. Make sure to always keep the retinae moist, as in physiological conditions.\n\t\nWash each retina three times with fresh sterile PBS/1% FBS within the biosafety cabinet.\nPlace up to 12 retinae on a sterile 70-µm nylon strainer moistened with PBS/1% FBS. Using the back-end of a 10-mL syringe, gently macerate the retinae using a circular movement to detach the cells.\n\t\nAlternatively, use a pestle for the cell strainer maceration or use enzymatic digestion with a combination of 15 IU/mL papain, 5 mM L-cysteine, and 200 U/mL DNase I for 15 min at 37 °C, followed by inactivation with PBS/10% FBS.\nNote: No changes in the percentage of cells recovered were observed when enzymatic digestion was compared to maceration with either the back-end of the syringe or the pestle.\nTo transfer the isolated cells, place the sterile 70-µm nylon strainer over the polypropylene collection tube. Pass the collected cells through the strainer using a P1000 pipette. Rinse the strainer (step 3.6) with PBS/1% FBS to release any remaining cells and transfer them to the collection tube.",
    "Add PBS/1% FBS to achieve a final volume of 1 mL per retina. Centrifuge the cell suspension for 7 min at 200 x g and RT.\nNote: Depending on the number of macerated retinae (< 6 retinae), the cell pellet may be too small to be visible.\n\t\nDiscard the cell supernatant and resuspend the cell pellet in PBS/1% FBS using a ratio of 1 mL per 5 retinae.\nCount the cells using a hemocytometer.\n\t\nClean a glass hemocytometer and coverslip with 70% alcohol. Gently swirl the tube containing the cells to ensure that the retina cell suspension is evenly distributed. Place 20 µL of 0.4% trypan blue in a microcentrifuge tube and mix with 20 µL of the cell suspension.\nMix gently and apply 10 µL of the 0.4% trypan blue/cell suspension mix to the hemocytometer, filling both chambers; capillary action will draw the 0.4% trypan blue/cell suspension mix under the coverslip. Using a microscope, count all trypan blue-negative cells; this number represents the live cells.\nDetermine cell viability using the following formula: live cell count / total cell count = % viability.\nNote: If the viability of the cells is less than 95%, the use of fluorescent dye for cell viability discrimination is required during FACS.\nUse a fluorescent viability dye that is non-permeant to live cells. Wash the cells with PBS to remove any trace of serum. Add 1 µL of fluorescent dye for cell viability discrimination per 5.0 x 106 cells in a 100-µL final volume. Incubate at RT for 15 min, protected from light. Add 10x the volume of PBS/1% FBS. Centrifuge for 5 min at 200 x g and RT.",
    "Incubate the cell suspension overnight at 4 °C, if necessary. If this is done, fill up the cell suspension tube with neural cell medium rather than PBS/1% FBS. Place the tube horizontally and keep it at 4 °C.\n4. Immunolabeling the Retinal Cells\nUse the following conversion to determine the volume of antibody per cell number: 2 µL of antibody per 5.0 x 106 cells in a 100-µL volume.\nWash the cells and maintain them in PBS/1% FBS. Take a small aliquot of cells (5.0 x 106 cells) to use as a negative control (unlabeled) at the time of the sort setup.\nNote: This negative control is critical for the proper calibration of the cell sorter.\nTo minimize the non-specific binding of antibodies to cells that express the Fcγ receptors II and III, add 1 µL of an anti-mouse CD16/32 antibody per 1.0 x 106 cells in a 50-µL final volume using PBS/1% FBS. Incubate for 10 min at RT.\nAdd the antibody cocktail to the sample and mix gently by pipetting. Incubate for 30 min in an ice bucket. Ensure that the ice bucket is covered, as light could compromise the experiment due to the photobleaching of the tagged fluorophores.\n\t\nPrepare the antibody cocktail using the following fluorescently tagged anti-mouse antibodies: CD90.2 AF-700, CD48 PE-Cyanine7, CD15 PE, and un-tagged CD57.\nNote: For each antibody, use the following concentrations per 5.0 x 106 cells: CD90.2 AF700, 1 µg; CD48 PE-Cyanine7, 0.4 µg; CD15 PE, 0.02 µg; and un-tagged CD57, 0.4 µg.",
    "Use volumes as per the following calculations (based on the commercially available antibodies listed in the Table of Materials): total of 5.0 x 107 cells to be labeled; 2 µL per 5.0 x 106 cells = 20 µL of each antibody; 4 different antibodies = 80 µL of antibody cocktail; final volume = [(5.0 x 107 total cells)/5.0 x 106 cells] x 100 = 1,000 µL ; 80 µL Abs + 50 µL of anti-mouse CD16/32 + 870 µL PBS/1% FBS = 1,000 µL.\nNote: This combination provided the optimal combination of fluorochromes for the instrument configuration. The following parameters summarize the emission and excitation: AF-700, emission of 719 nm when excited with a 638-nm red diode laser; PE-Cyanine7, emission of 767 nm when excited with a 488-nm blue diode laser; and PE, emission of 575 nm when excited with a 488-nm blue diode laser.\nAfter the 30-min incubation, bring volume up to 5 mL using PBS/1% FBS. Wash the samples by centrifuging them for 7 min at 200 x g and RT. Repeat the procedure once to remove all unbound antibody.\nAdd 2 µL of secondary antibody (0.1 µg), which will bind the CD57 of 5.0 x 106 cells. Incubate for 30 min in an ice bucket, as in step 4.4. Wash the cells twice, as in step 4.5.\n\t\nLabel the cells with secondary antibody if an un-tagged primary antibody was used in step 4.4.\nNote: The secondary antibody of choice for this configuration is listed in the Table of Materials; it has an emission wavelength of 421 nm. Use it with a bandpass filter of 450/50 nm when excited with the violet diode laser at 405 nm.",
    "Use volumes as per the following calculations (based on the commercially available antibody listed in the Table of Materials): 2 µL per 5.0 x 106 cells = 20 µL of secondary antibody; final volume = [(5.0 x 107 total cells)/5.0 x 106 cells] x 50 = 500 µL; 20 µL of Abs + 480 µL PBS/1% FBS = 500 µL.\nKeep the labeled cells in PBS/1% FBS. Count the cells using a hemocytometer; use a final retinal cell concentration of 3.0 - 4.0 x 107 cells/mL.\nNote: Do not use cell culture medium to dilute the cells because the phenol red can increase the autofluorescence, thereby reducing the resolution between negative and positive cells. The final cell concentration per volume highly depends upon the volume flow rate of the instrument configuration.\nUse single-color controls during setup to minimize fluorescence spillover.\nNote: This step, also known as compensation, is applied to correct the noise created by the combination of fluorophores. Polystyrene microspheres in PBS/0.1% BSA/2 mM NaN3 with the capacity to bind fluorescently tagged immunoglobulin (Ig) isotypes from multiple species provide positive controls to set the compensation.\n\t\nPlace 3 drops of the polystyrene microspheres into sterile FACS tubes, allotting one per fluorophore. Add 1 µg of the respective fluorophore to each tube. Incubate for 15 min at RT, protected from light. Add 3 mL of PBS/1% FBS to the sample tubes. Centrifuge for 5 min at 200 x g and RT. Carefully remove the supernatant and resuspend in 250 µL of PBS/1% FBS.\nTo set up the negative controls, use polystyrene microspheres that do not bind to Ig. Carry out this step the day before, if necessary.\n5. Cell Sorting Strategy",
    "Note: Specific instructions for instrument setup for FACS with 355 nm, UV; 405 nm, violet; 488 nm, blue; and 640 nm, red lasers with 2, 2, 5, and 3 fluorescence channel distribution, respectively. The operating software was DIVA version 8.0.1. Cell sorting was performed with a 70 μm nozzle, 70 psi sheath pressure, 87.5 frequency, 48.6 amplitude with first drop breakoff at 333, gap asetting of 6, sort precision set to four-way purity with default (32) purity mask, and drop delay adjusted to 42.98 using beads.\nUse 15-mL polypropylene conical tubes as collection vessels. Add 5 mL of the collection medium (cell culture medium) to each tube and rotate the tube to coat the walls.\nNote: This step prevents the cells from sticking to the sides of the collection tube. As an alternative, tube can be coated with undiluted FBS.\nTake into consideration the efficiency of the cell sorter to estimate the final yield of cells.\nNote: The efficiency of the sort varies based on the flow cytometer used. RGCs with the CD90.2+CD48negCD15negCD57neg phenotype comprise about 1% of all retinal cells.\nHave the cell sorting performed by a trained operator (usually in a core facility) . Ensure that the instrument is cleaned and sterilized with 70% ethanol prior to sample acquisition. Carefully wipe the outside of collection tubes with 70% ethanol as well.\nIf the cells have settled or aggregated, pipette the cells up and down and filter the suspension through a sterile 40-µm nylon strainer prior to acquisition. Make sure to control the temperature and keep it at 4 °C while the cell sorting is being performed; failure to do so will reduce the cell yield.\nDiscuss the details of the sort with the cell sorter operator prior to performing the experiments.",
    "Note: At the time of experiment, the cell sorter operator will have clicked a series of buttons from the Workspace toolbar of the acquisition software for the cytometer. These are the Browser, Cytometer, Inspector, Worksheet, and Acquisition Dashboard. The strategy of cell sorting used here is known as a 2-way sort. Two populations are collected: the enriched RGCs and all other cell types. If additional populations are to be collected, up to two additional populations can be isolated as a 4-way sort. If additional populations will be collected, the cell sorter requires different collection tubes and setup.\nPerform compensation to correct for spectral overlap from the fluorophores.\nNote: This process can be done manually by adjusting each setting, or it can be done automatically as part of the software in use. Most software for cell sorting equipment have the option of an automated compensation. It is considered the gold standard and the most accurate type of compensation. The negative (no fluorophore) sample and the single controls prepared with polysterene microspheres (Compensation beads) specifically manufactured to bind all relevant monoclonal antibodies used in the experiment will be used in this step.\n\t\nSelect Experiment > Compensation Setup > Create Compensation Controls. Add the fluorophore-specific controls from the list displayed in the screen. Click OK.\nNote: A compensation tube for each of the controls will be displayed.\n\t\t\nUse an unlabeled control (no fluorophore, step 4.2) to verify the forward-scattered light (FSC), the side-scattered light (SSC), and to gate the initial population (P1).",
    "Install the negative control tube onto the cytometer and click Load. Verify that the population of interest is displayed and select it. This is population 1 (P1). Right-click the P1 gate and select Apply to All Compensation Controls. Click Record Data. Once the recording is done, click Unload and remove the tube.\nInstall the next tube onto the cytometer, as displayed on the screen. Repeat step 5.6.2 until all data from the controls have been recorded.\nSelect Experiment > Compensation Setup > Calculate Compensation. Save the setup and name the experiment. Click Link & Save.\nNote: Compensation is a necessary step, as it removes the spectrum overlap between the detectors.\nIf manual compensation is needed, do so by adjusting the means of the positive signals so that they equal the negatives for each of the fluorochromes used.\nNote: This step is done by the cell sorter operation and may take 30 min.\nGating strategy ( Figure 3A).\n\t\nSet up P1 by plotting FSC versus SSC; the FSC is indicative of the size and the SSC indicates the internal complexity of the cells. See Figure 3A.\nDraw a pseudocolor plot of SSC-H (height) versus SSC-W (width) using the selected population in step 5.7.1 (P1); the pseudocolor plot allows for the visual representation of the density of cells relative to one another.\nNote: A lower cell density is represented by blue and green, whereas red and orange areas represent high cell density.\n\t\t\nPerform this step to collect single cells only; the single cell gate is called P2. See Figure 3A.\nRepeat step 5.7.2 to plot FSC-H versus FSC-W using P2. Ensure that the selection of single cells as \"doublets\" or cell clumps contains both a positive and a negative marker, providing false positivity.",
    "Draw a pseudocolor plot of CD90.2 versus CD48. Select all CD90.2+CD48neg cells to eliminate monocytes from the RGC enrichment; call this gate CD90.2+CD48neg, or P3. See Figure 3A.\nUsing the selected CD90.2+CD48neg population or P3 gate, draw a pseudocolor plot of CD57 versus CD15 to eliminate amacrine cell contaminants from the RGC enrichment. Gate the CD15negCD57neg population. See Figure 3A.\nDefine the populations to be collected for the sample in the \"Sort Layout\" window and proceed with the cell sorting; the sample to collect is CD90.2+CD48negCD15negCD57neg.\nNote: The population to be sorted is selected from the drop-down Add menu in the sort window. After adding the population, it will ask for target events or how many events are to be collected. At any time, the sort layout can be edited by clicking the Sort Location field containing the population. 0.9% ± 0.3 of RGCs with the phenotype CD90.2+CD48negCD15negCD57neg are obtained from young (5-7 weeks old) and 0.5% ± 0.3 and old (>12 months old) C57BL/6J mice23.\nUsing 25,000 cells, perform a purity check23. See Figure 3B-E.\nNote: The purity check is the process to re-analyze the sorted cells to verify the accuracy of the cell sort. A small aliquot of sorted cells will be loaded onto the cytometer to verify the effectiveness of the sort.\n6. Confirmation on RGC Intracellular Markers\nIntracellular labeling.\n\t\nFix sorted cells for 1 h and permeabilize at 4 °C to make the cells metabolically inactive and to allow the penetration of intracellular antibodies.",
    "Dilute the following antibodies in the permeabilization solution: anti-RNA binding protein with multiple splicing (RBPMS) at a 1:100 dilution in a 100 µg/mL stock; anti-synuclein gamma (SNCG), 1:100 in a 1 mg/mL stock; brain-specific homeobox/POU domain protein 3A (BRN3A), 1:100 in a 200 µg/mL stock; and anti-neuron-specific class III beta tubulin (TUJ1), 1:100 in a 1 mg/mL stock. Incubate the cells and antibody solutions for 1 h in a covered ice bucket.\nWash the samples twice with PBS/1% FBS.\nResuspend the cells in the appropriate AF488-tagged secondary antibody at a 1:200 dilution for 30 min in an ice bucket.\nWash the samples as in step 6.1.3. Keep the cells in PBS/1% FBS (250 µL) until ready to analyze.\n7. Validation of the Cell Sort by qPCR Analysis\nNote: See Figure 4.\nRNA extraction23.\n\t\nExtract the RNA from 5.0 x 105 sorted cells by cell lysis and homogenization followed by the addition of chloroform.\nTransfer the upper, colorless phase to a clean microtube for alcohol precipitation followed by extract concentration in a spin column. Perform DNAse digestion on the column.\nWash the column with RNase-free water for RNA elution.\nAssess the RNA concentration by spectrophotometry.\ncDNA synthesis and pre-amplification.\n\t\nUse 100 ng of RNA material and mix with a solution containing reverse transcriptase enzyme, recombinant ribonuclease inhibitor (to avoid RNA degradation), magnesium chloride (MgCl2), and deoxynucleotides.\nMix the tube contents and incubate for 10 min at 25 °C followed by 60 min at 42 °C. Finish the reaction with a 5-min incubation at 85 °C. Store the resulting cDNA at -20 °C until ready to use.\nNote: cDNA material can be stored at -20 °C for up to a month if the pre-amplification step cannot be carried out immediately.\nPre-amplification of cDNA.",
    "Pre-amplify cDNA material using a series of primers specific for multiple retinal cell types including: retinal ganglion cells, amacrine cells, astrocytes, Müller, bipolar, horizontal, photoreceptors, and retinal pigment epithelial cells, as detailed in Reference 23 and in the Table of Materials.\nNote: The pre-amplification reaction is prepared to increase the sensitivity of detection for quantification. The pre-amplification reaction contains a mixture of the primer mixes from the Table of Materials; 2.5 µL of cDNA, which started at 100 ng of RNA; reverse transcriptase enzyme; and nuclease-free water in a final volume of 10 µL.\nCarry out the enzyme activation step at 95 °C for 10 min, followed by 14 cycles at 95 °C for 15 s, followed by 60 °C for 4 min. Dilute the pre-amplified material 1:10 in Tris EDTA buffer and keep it at -20 °C until ready for use.\n7.4 qPCR reaction.\n\t\nPrepare all qPCR reactions in a 10 µL final volume using the diluted, pre-amplified cDNA (2.5 µL), primers (listed in the Table of Materials), nuclease-free water, and a concentrate with DNA polymerase and deoxynucleotides.\nUse the following instrument conditions to run the qPCR: a hold step of 50 °C for 2 min, followed by 95 °C for 10 min. Run a total of 40 cycles at 95 °C for 15 s followed by 60 °C for 1 min. Perform all measurements in replicates of three.\nPerform relative quantification using the comparative threshold (CT) after determining the values of CT for the housekeeping gene and the target genes in each sample. Calculate the relative fold change (Rq) using the following equation: Rq = 2T –∆C, where ∆CT = CT target gene – CT reference gene23.",
    "Note: The CT is defined as the PCR cycle at which the fluorescent signal of the reporter dye crosses an arbitrarily placed threshold26. The CT is inversely related to the amount of amplicon (PCR product) in the reaction.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}