{
  "id": 6535,
  "origin_website": "Bio",
  "title": "Quantification of Blumenol Derivatives as Leaf Biomarkers for Plant-AMF Association",
  "procedures": [
    "Notes: In order to test the applicability of the method for the analyzed plant/AMF species, it is advised to perform an initial test screen with root tissue as the abundance of blumenol derivatives in root tissue is higher than in leaves. Blumenol levels can vary in different shoot tissues (Wang et al., 2018). Harvesting tissue samples from leaves at comparable developmental stages will reduce variation and allow better comparisons between plants. Blumenol levels reliably indicate AMF colonization 3 weeks after inoculation (Wang et al., 2018).Collection and preparation of leaf materialHarvest leaves and immediately freeze in liquid nitrogen using stainless steel tweezers. Store at -80 °C until processing the samples.Grind the frozen leaf material with mortar and pestle under liquid nitrogen.Aliquot approximately 100 mg leaf material with a pre-cooled stainless steel spatula into liquid nitrogen-precooled and pre-weighted 96-well BioTubeTM racks containing two steel balls (Ø 3 mm). Record the exact mass and leave the samples on liquid nitrogen for extraction or store at -80 °C.Note: Instead of 96-well BioTubesTM, 2 ml Eppendorf tubes equipped with two steel balls (Ø 4 mm) can be utilized.ExtractionAdd 800 µl of ice-cold extraction buffer containing the internal standard D6-ABA to each tube with an 8-channel pipette. Replace the tube caps with a rubber sealing mat.Note: Samples should be kept on ice during the extraction procedure. Homogenize the samples in a Geno/Grinder® for 60 s at 1,000 strokes per minute (Geno/Grinder® 2000 setting: 1x at 000).Centrifuge the samples at 2,000 x g for 20 min at 4 °C, transfer the supernatant to a new 96-well BioTubeTM rack or Eppendorf tubes without steel balls and centrifuge again under the same conditions.Transfer 100 µl of the supernatant into skirted 96-well microplates and close wells with sealing film for LC-MS/MS analysis.",
    "As the sealing film is not suitable for long-term freezer storage, transfer 190 µl of the supernatant into 96-well PCR plates and seal with 8-strip caps as freezer backup. Note: In case Eppendorf tubes are used, transfer 700 µl of the supernatant to 1.5 ml screw neck vials (vials are stored in the freezer for re-analysis). Prepare a mixed quality control (QC) sample for each 96-well plate by combining 10 µl aliquots of each sample of the plate in a 1.5 ml screw neck vial.Use the extraction buffer as blank and for signal background calculations.UHPLC-MS/MSFor the chromatographic separation, utilize an Agilent ZORBAX Eclipse XDB-C18 column. The mobile phase consists of 0.1% (v/v) acetonitrile and 0.05% (v/v) formic acid in MilliQ H2O for solvent A and 100% methanol as solvent B. The mobile phase gradient of the UHPLC method is shown in Table 1. The UHPLC instrument parameters comprise:table:",
    "﻿0,1\nFlow rate,0.5 ml min-1\nSample tray temperature,10 °C\nSample injection volume,5 µl\nColumn temperature,42 °C\nTable 1. Mobile phase gradient of the UHPLC runimgsrc:https://en-cdn.bio-protocol.org/attached/image/20190711/20190711184249_0530.jpgThe Bruker EVO-Q EliteTM triple quadrupole MS system is used in multiple reaction monitoring (MRM) mode. The heated electrospray ionization (HESI) source settings consist of:table:\n﻿0,1\nHESI spray voltage,\"± 4,500 V\"\nCone temperature,350 °C\nProbe temperature,300 °C\nCone gas flow,35\nNebulizer gas flow,60\nProbe gas flow,55\n  System performance and general ESI parameters can be evaluated by injecting a standard solution of related blumenol glycoside compounds: Roseoside (Wuhan ChemFaces Biochemical Co., Ltd.; catalog number: CFN98916), Corchoionoside C (CFN99859), Blumenol C glucoside (CFN99424), Byzantionoside B (CFN99871). Standards for the 11-hydroxy- and 11-carboxyblumenol C derivatives are not commercially available.  The MRM settings for the detection of specific blumenol derivatives are shown in Table 2 and a recording window of 1 min is set at the expected retention time (RT). The displayed compound table has been tested and found to be widely applicable. Additional markers can be identified in order to extend the method beyond the current list of plant species that have been investigated (Wang et al., 2018):table:\n﻿0,1\nBarley,Hordeum vulgare\nBarrel clover,Medicago truncatula\nCommon rice,Oryza sativa\nCommon wheat,Triticum aestivum\nPotato,Solanum tuberosum\nStiff brome,Brachypodium distachyon\nTomato,Solanum lycopersicum\nWild tobacco,Nicotiana attenuate",
    "Table 2. Quantifier and Qualifier m/z fragments used to detect blumenol derivatives in plant leavesimgsrc:https://en-cdn.bio-protocol.org/attached/image/20190719/20190719003821_5384.jpg§ Ionization polarity is indicated in parentheses.* Verified by NMR.** Verified with authentic standard.& The fragmentation of the m/z 241.2 aglycon precursor [M+H-Glc]+ allows for a sensitive MRM detection in addition to the MRM of the m/z 403.2 molecular ion [M+H]+.ǂ Blumenol A and abscisic acid are not induced by AMF (Wang et al., 2018) and can be used as internal standards to evaluate the overall functionality of the carotenoid biosynthesis in the analyzed plant as well as providing valuable information about instrument performance.† The identity of 11-carboxyblumenol C-Glc-Glc and 11-carboxyblumenol C-Mal-Glc detected in rice has not been confirmed.¶ Internal Standard (typically showing 20-30% relative standard deviation after full extraction/analysis procedure).The prepared QC samples will be analyzed repeatedly after every 15 to 20 samples with the identical UHPLC-MS/MS method. Comparisons of the QC runs will allow monitoring instrument performance and detecting retention time shifts or changes in mass spectrometer sensitivity in larger sample batches."
  ],
  "subjectAreas": [
    "Microbiology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}