{
  "id": 6646,
  "origin_website": "Bio",
  "title": "Model of Chemotherapy-associated Mucositis and Oral Opportunistic Infections",
  "procedures": [
    "Organotypic constructs (OTC)The organotypic oral mucosal model has been described previously (Dongari-Bagtzoglou and Kashleva, 2006a; Dongari-Bagtzoglou and Kashleva, 2006b; Sobue et al., 2016). The protocol was recently modified based on work by Nakagawa and colleagues (Nakagawa et al., 2015). The organotypic model consists of human immortalized oral keratinocytes (squamous cell carcinoma) SCC15 and type I collagen matrix-embedded mouse fibroblasts, 3T3. Mucosal constructs take approximately 2 weeks to form, resulting in a non-keratinizing, multilayer squamous epithelium which is then exposed to the chemotherapy agent 5-FU (Figure 1).A week ahead: Start growing 3T3 cellsThaw a frozen vial in 9 ml of DMEM with 10% FBS 1% Pen/Strep in a 50 ml tube.Centrifuge the tube 3 min with 670 x g in a centrifuge machine.Aspirate supernatant from the tube.Add 10 ml of DMEM with 10% FBS 1% Pen/Strep into 50 ml tube and resuspend gently.Seed 10 ml cell suspension on 75 cm2 cell culture flask and incubate the flask in the incubator with 37 °C and 5% CO2.Change the culture medium every 2 to 3 days.Grow until they reach 80% confluent in DMEM with 10% FBS 1% Pen/Strep. Day 0: Thaw Matrigel overnight (one vial for 2.5 OTC plates) at 4 °C. Day 1: Matrix preparation 15-30 min prior to matrix preparation:Place FBS, L-Glutamine, 10x EMEM and 7.5% Na-bicarbonate, Matrigel and type I collagen on ice.Place transwell inserts into each well in 6-well Falcon Deep Well Plate.Making acellular layer Add 10x EMEM, FBS, L-Glutamine, Na-bicarbonate and type I collagen in this order in a 50 ml tube on ice (Table 1).Mix gently using a 25 ml pipette in a 50 ml tube on ice.Note: When making acellular and cellular layers, mix components gently on ice to avoid bubbles. Pour 1 ml per insert using a 10 ml pipette.",
    "Leave inside the tissue culture hood while preparing fibroblasts and cellular layer.Table 1. Acellular layer mediaimgsrc:https://en-cdn.bio-protocol.org/attached/image/20191028/20191028005847_8006.jpgMaking cellular layerAspirate condition medium from cell culture flask.Wash cells with 10 ml PBS and aspirate PBS. Repeat one more time.Add 1 ml 0.05% Trypsin/EDTA to cell culture flask. Tap the flask gently and keep in the incubator for up to 2 min.Once cells detach from the bottom of flask, add 9 ml of DMEM with 10 % FBS 1% Pen/Strep and suspend cells with a 10 ml pipette.Collect cell suspension and place to a new 50 ml tube.Centrifuge the tube 3 min with 670 x g in a centrifuge machine.Aspirate supernatant and resuspend the cell pellet with 10 ml of DMEM with 10 % FBS 1% Pen/Strep.Count cell number with a hemocytometer and prepare cell suspension (6 x 105/ml, 2 ml for each plate).Add 10x EMEM, FBS, L-Glutamine, Na-bicarbonate, type I collagen, Matrigel and fibroblasts in this order into a new 50 ml tube on ice (Table 2).Mix gently using a 25 ml pipette in the 50 ml tube on ice.Note: When making acellular and cellular layers, mix components gently on ice to avoid bubbles.Pour 3 ml per insert using a 10 ml pipette.Incubate for 30-45 min in the tissue culture incubator (37 °C, 5% CO2).Add DMEM-10% FBS-1% Pen/Strep: 10 ml into the bottom of the wells, 2 ml into the insert.Table 2. Cellular layer mediaimgsrc:https://en-cdn.bio-protocol.org/attached/image/20191028/20191028005929_4699.jpgStart growing SCC15 cells Thaw a frozen vial in 9 ml of KSFM with BPE, 0.2 ng/ml hEGF, 0.4 mM and 1% Pen/Strep in a 50 ml tube.Centrifuge the tube for 3 min with 670 x g in a centrifuge machine at room temperature.Aspirate supernatant from the tube.Add 10 ml of KSFM with BPE, 0.2 ng/ml hEGF, 0.",
    "4 mM and 1% Pen/Strep into the 50 ml tube and resuspend gently.Seed 10 ml cell suspension on 75 cm2 cell culture flask and incubate the flask in the incubator with 37 °C and 5% CO2.Change the culture medium every 2 to 3 days.Grow until they reach 80% confluent in KSFM with BPE, 0.2 ng/ml hEGF, 0.4 mM and 1% Pen/Strep. Day 2: Dislodge matrix and add 2 ml of DMEM-10% FBS-1% Pen/Strep into the insert.Use a sterile glass Pasteur pipette to go around (2-3 times) the matrix along the inner wall of the insert. Feel the friction at the tip on the transwell membrane, but try not to pierce it.Note: The matrix will contract over the next few days. Additional 2 ml needs to submerge the OTC. No need to change medium. Wait at least 4 days before seeding epithelial cells.Day 5 or later (up to Day 7): Seeding epithelial cellsMake DMEM (-)/F12 (Table 3) to pre-saturate the OTC matrix.Remove old medium from the OTC plates/inserts.Note: Gentle aspiration is recommended to reduce the risk of distracting OTC. Add DMEM (-)/F12. Add 10 ml to the bottom well and 2 ml into the insert.Incubate for 1 h to equilibrate the matrix in the tissue culture incubator (37 °C, 5% CO2).Aspirate condition medium from the SCC15 cell culture flask.Wash cells with 10 ml PBS and aspirate PBS. Repeat one more time.Add 1 ml 0.05% Trypsin/EDTA to cell culture flask. Tap the flask gently and keep in the incubator (37 °C, 5% CO2) up to 2 min.Once cells detach from the bottom of flask, add 9 ml of DMEM with 10% FBS 1% Pen/Strep and suspend cells with a 10 ml pipette.Collect cell suspension and place to a new 50 ml tube. Count cell number with hemocytometer.",
    "Centrifuge the tube 3 min with 670 x g in a centrifuge machine at room temperature.Aspirate supernatant and resuspend cell pellet with KSFM with BPE, 0.2 ng/ml hEGF, 0.4 mM and 1% Pen/Strep. The volume of medium needs to be adjusted based on the counting cell number in Step A5i.Note: Prepare 1 x 107/ml epithelial cell suspension (300 µl per plate). 5 x 105 epithelial cells are seeded per insert/well. One ~80% confluent 75 cm2 flask yields about 2-3 x 106 SCC15 cells. Remove DMEM (-)/F12 from the OTC plates/inserts.Seed epithelial cells by adding 50 μl (5 x 105) of cell suspension per well onto the center of the surface of contracted matrix.Incubate for 2 h in the tissue culture incubator without medium.Make EP2 media. Mix all cell culture media components seen in Table 4 and store at 4 °C.Add EP2 media to the plate–10 ml into the bottom well and 2 ml into the insert. And incubate the plate in the tissue culture incubator (37 °C, 5% CO2).Table 3. DMEM/F12 Mediaimgsrc:https://en-cdn.bio-protocol.org/attached/image/20191028/20191028010007_4042.jpgTable 4. EP2 Mediaimgsrc:https://en-cdn.bio-protocol.org/attached/image/20191028/20191028010034_7997.jpgDay 7 (or 2 days after seeding epithelial cells): Medium change with EP2 media.Remove old medium from the OTC plates/inserts.Add EP2 media: add 10 ml to the bottom well and 2 ml into the insert.Incubate the plate in the tissue culture incubator (37 °C, 5% CO2).Day 9 (or 4 days after seeding epithelial cells, Air Lifting): Replace EP2 media with EP3 media.Make EP3 media. Mix all cell culture media components seen in Table 5 and store at 4 °C.Remove old medium from both inserts and the bottom well.Add 7.5 ml of EP3 media into the bottom wells only.Incubate the plate in the tissue culture incubator (37 °C, 5% CO2).Table 5. EP3 Mediaimgsrc:https://en-cdn.bio-protocol.org/attached/image/20191028/20191028010114_1692.",
    "jpgDay 11 (or 6 days after seeding epithelial cells): Medium change with EP3 media, prepared on Day 9.Remove old medium from both inserts and the bottom well.Note: After air lifting, further significant contraction will be seen. Contraction can be better assessed during medium change. Add 7.5 ml of EP3 media into the bottom wells only. Incubate the plate in the tissue culture incubator (37 °C, 5% CO2).Day 13 (or 8 days after seeding epithelial cells): Medium change with EP3 media, prepared on Day 9.Remove old medium from both inserts and the bottom well.Add 7.5 ml of EP3 media into the bottom wells only.Incubate the plate in the tissue culture incubator (37 °C, 5% CO2).Day 14 (or 9 days after seeding epithelial cells): Three-dimensional mucosal organotypic culture is now ready to use for 5-FU treatment followed by microbial inoculation.5-FU treatment of organotypic construct and confirmation of the drug effect on cell proliferation Prepare EP3 media with 10 μM 5-FU (2 ml for each well).Transfer inserts to a new 6 well dish with sterile tweezers.Add 2 ml EP3 media with 5-FU to basolateral side only to expose the submucosal compartment to the drug.Add 1 ml of fresh cell culture media without 5-FU to the apical mucosal surface.Add 100x concentrated BrdU (final concentration: 10 μM) on both apical mucosal surface (100 μl) and basolateral (200 μl) sides.Note: BrdU labeling is needed to confirm the anti-proliferative effect of 5-FU. Incorporation should be allowed for a minimum of 16 h since most of epithelial cells are slowly proliferating after the multilayer construct is formed. Incubate mucosal tissues in a transwell plate for 16 h at 37 °C with 5% CO2.Candida albicans infection of 5-FU treated organotypic constructCandida albicans (C.",
    "albicans) was inoculated flasks from colonies growing on YPD Agar plates into 10 ml YPD broth and incubate aerobically with gentle agitation, at room temperature, on a shaker.Remove all cell culture media from both sides of transwells (apical and basolateral) after 16 h incubation with 5-FU.Add EP3 media to both sides of transwells and incubate for 1 h at 37 °C with 5% CO2. Repeat twice more in total 3 h to wash out 5-FU from mucosal tissues.Note: Removing 5-FU prior to microbial inoculation is necessary because it is toxic to most organisms. Count cell number of C. albicans with a hemocytometer and prepare cell suspension (106 fungi cells in 20 µl EP3 media for each well).Remove all cell culture media from both sides of the transwell plate.Add the inoculum of C. albicans on mucosal surface side and leave for 45 min at room temperature.Note: Place the inoculum gently on the center of mucosal surface; to avoid the excessive spread of the liquid media to the sides use a small volume (up to 20 μl) and ensure microorganisms are inoculated on the surface. Add 1.5 ml of EP3 media to basolateral side only and incubate for 2 h at 37 °C with 5% CO2.Add 0.5 ml of EP3 media to mucosal surface side and incubate the plate for 16 h at 37 °C with 5% CO2.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191028/20191028010213_7054.jpgFigure 1. Organotypic Oral Mucosa modelPreparation for analysisSubmerge mucosal tissues in a new 6 well cell culture plate with 4% paraformaldehyde for fixation. Keep culture plates for 2 h at 4 °C. Note: Do not over-fix. It may mask certain antigens. Two hours are sufficient for fixation with 4% paraformaldehyde. Wash mucosal tissues with 4 ml of PBS twice for 3 min each at room temperature.",
    "Remove mucosal tissues from cell culture inserts and place the tissue into tissue embedding and processing cassettes.Process ordinal dehydration and paraffin embedding steps and cut 5 μm thick section for histological and Immunofluorescence analysis.Immunofluorescence analysisDeparaffinize by immersion in xylene, rinse in xylene and rehydrate in a series of ethanol washes.Antigen retrieval with 70 ml of Citrate buffer, pH 6.0 in Coplin jar for 10 min at 94 °C.Note: To maximize antigen-antibody binding, antigen retrieval step is necessary for unmasking epitope. Leave the slides at room temperature for 20 min.Wash with 70 ml of PBS for 3 min and repeat twice more, total 3 times in Coplin jar at room temperature.Immerse the slides in 70 ml of 0.05% H2O2 in PBS for 30 min in Coplin jar at room temperature.Wash with 70 ml of PBS for 3 min and repeat twice more, total 3 times in Coplin jar at room temperature.Incubate the slides in 300 µl of 10% normal goat serum, 0.2% triton X-100 in PBS (blocking buffer) for 30 min at room temperature.Incubate the slides with 300 µl of anti BrdU antibody (1:40 in blocking buffer) or anti active Caspase-3 antibody (1:100 in blocking buffer) overnight at 4 °C. To stain C. albicans, incubate with 300 µl of anti C. albicans antibody (1:20 in PBS) for 2 h in the dark at room temperature.Wash with 70 ml of PBS for 3 min and repeat twice more, total 3 times in Coplin jar at room temperature.For BrdU and active Caspase-3 stains, incubate with 300 µl of secondary antibody (A21434 for BrdU and A11011, 1:100 in PBS) for 1 h in the dark at room temperature.Wash with 70 ml of PBS for 3 min and repeat twice more, total 3 times in Coplin jar at room temperature.",
    "Counter staining with 300 µl of Hoescht 33258 (1:5000 in PBS) for 30 min in the dark at room temperature.Rinse with 70 ml of PBS and distilled water 3 min each and add a few drops of mounting solution, Fluoro-Gel, with coverslip.Sections can be observed under fluorescence microscope with 20x objective lens and further analysis can be conducted with AxioVision software."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}