{
  "id": 4681,
  "origin_website": "Bio",
  "title": "MIFE Technique-based Screening for Mesophyll K<sup>+</sup> Retention for Crop Breeding for Salinity Tolerance",
  "procedures": [
    "Plant material preparationSow 12 to 14 seeds in a 4.5 L PVC pot (with a saucer) using the standard potting mix and grow them under glasshouse conditions (day/night temperature 23/18 °C; ~ 11 to 13 h photoperiod).After seedlings have emerged, thin plants to leave eight uniform plants per pot. Grow wheat plants until they are 15 to 20 days old (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150429/20150429193309_5739.jpgFigure 1. Two week- old wheat seedlings grown in a glasshouse Preparation of ion selective microelectrodesElectrode blank preparationInsert a non-filamentous borosilicate glass capillary (GC 150-10; 1.5 O.D. x 0.86 I.D. x 100 L mm) into a vertical electrode puller.Pull the glass capillary by heating the middle part into two blanks with external tip diameter of about 3-4 μm.Store the pulled blank electrodes in a stainless steel rack (Figure 2) in a vertical position with the tips positioned upwards. Put the steel rack with the blank electrodes into an oven located in a fume hood cabinet and heat them overnight at 225 °C.After 8-10 h of heating, cover the steel rack with a round shape steel lid and heat for a further 15 min.Inject a few drops of tributylchlorosilane under the lid (70 μl for a steel rack containing 36 blank electrodes, Figure 2) and heat for a further 10 min with the lid on. Depending on the number of blank electrodes in the steel rack, the volume of injected tributylchlorosilane should be adjusted.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150429/20150429193337_2015.jpgFigure 2. Pulled blank electrodes stored in the metal electrode rack Remove the lid from the steel rack and continue heating the blank electrodes in the oven for a further 30 min.Switch off the oven and let the electrode blanks cool down inside the oven. Transfer the silanized blank electrodes to electrodes holder (Figure 3) and cover with a lid.",
    "Prepared electrode blanks can be stored up to a month. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150429/20150429193436_2320.jpgFigure 3. Perspex-made electrode holder Filling up electrodesPrepare a K+ LIX containing tube by dipping a pulled borosilicate glass capillary (GC 100-10; 1.0 O.D. x 0.56 I.D. x 100 L mm) with a broken tip (~ 50 μm diameter) into a bottle containing K+ LIX. Immobilize the silanized electrode blank in a microelectrode filling station and break the electrode tip against a flat glass surface under a microscope (step 1 showed in Figure B4a) to achieve the electrode tip diameter of 2-3 μm.Immobilize prepared K+ LIX tube horizontally in the filling station against the prepared microelectrode blank (step 2 showed in Figure 4a). Align tips of the microelectrode and the LIX-containing tube under the microscope (Figure 4b).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150429/20150429193453_1736.jpgFigure 4. The blank electrode and a glass capillary containing K+ LIX are aligned at the filling stationBack-fill the microelectrode with a K+ backfilling solution using a syringe with a plastic needle. Ensure the absence of any air bubble adhered to the glass capillary in the electrode tip. Add more back filling solution if the latter occurred.Front-fill the electrode by briefly putting the electrode tip in a contact with the open tip of the LIX-containing tube to achieve a column length of about 100-150 μm.Store prepared microelectrode in containing a basic salt medium (BSM) solution (Figure 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150429/20150429193515_9497.jpgFigure 5. Electrodes stored in BSM solution Preparation of a reference electrodePlace pulled blank microelectrodes with broken tips (~ 50 μm tip diameter) into a wide neck glass container tips down. Prepare ~50 ml 2% (w/v) agar solution in 1 M KCl and melt it in a water bath.Pour the melted agar solution over prepared electrode blanks to immerse them completely in the agar solution.",
    "Ensure that internal parts of the glass capillaries are filled with the agar solution. Seal the top of the glass container once it has cooled down and store in a fridge for further use.For a reference electrode preparation, cut ~5 cm of a silver wire.Chlorinate the silver wire by immersing it into bottle containing commercial bleach for ~1-2 min leaving one end of the wire (~5 mm) exposed to air. Ensure that immersed part of the wire turned black.Insert the chlorinated silver wire into the prepared reference electrode blank (glass capillary filled with the 1 M KCl agar solution). Leave un-chlorinated part of the silver wire (5 mm) outside the glass capillary.Secure silver wire in the glass capillary with a strip of parafilm. Ensure that un-chlorinated part of the wire stays un-covered. Immerse the prepared reference electrode in a container with BSM and store them in a fridge until use.Microelectrode calibrationThree calibration solutions with concentrations covering expected K+ concentration in the measured solution are used to calibrate K+ microelectrode. For example, for BSM containing 500 μM KCl, following KCl calibration solutions used are (μM): 250, 500, and 1,000. Place prepared K+ microelectrode in the MIFE electrode holder and ensure that the channel used is connected to an amplifier. Insert the electrode in BSM.Connect the reference electrode to a channel designated for the reference electrode and insert it in the same BSM.Run the MIFE software CHART from the appropriate directory (see http://www.phys.utas.edu.au/physics/biophys/mifecom/MIFEHome/Home.html[href=http://www.phys.utas.edu.au/physics/biophys/mifecom/MIFEHome/Home.html] for details).Press “Alt + S” to <s>tart creating a calibration file. Press F7 to specify channel used for K+ microelectrode. Press “Enter”.Insert K+ microelectrode into the first K+ calibration solution (250 μM). Press F7 to specify K+ concentration used. Record calibration outputs for 20-30 sec. Once the recorded line is strait, press F7 to accept it.",
    "In case the line is not acceptable, press “No” in F7 menu and repeat the calibration.Insert the K+ microelectrode into other calibration solutions (500 μM and 1,000 μM, one at a time) and repeat step D6. Press “Alt + H” to end the data acquisition. Then press “Y” for <Y>es to confirm your choice.On completion of K+ microelectrode calibration, its quality must be checked. Press “Alt + E” to enter the <E>lectrometer menu, then choose “A” to <A>average data, then press “C” for the <C>alibration average. Average calibration file <.AVC> will be created by the CHART software automatically, and also the information about a set of parameters, e.g. slop, intercept, and correlation coefficients, of K+ microelectrode will be displayed in the screen.Examine displayed parameters: only K+ microelectrode with a slope above 50 mV per decade and a correlation coefficient above 0.999 are accepted and can be used for further experiments. If the calibration result doesn’t meet the requirement, new electrode has to be prepared and the calibration process repeated. Preparing specimensExcise second youngest expanded leaf and place it in a beaker containing tap water.Using a sharp blade, cut the leaf segments angularly into small cross-sectional segments to expose mesophyll (5 to 8 mm each). Place leaf segments in an 85 mm diameter Petri dish containing BSM solution peeled side down and leave them floating on the surface in the darkness overnight to minimize possible confounding effects of tissue damage on ion fluxes (Shabala and Newman, 1999).After 10 to 12 h, mount the leaf segment in a Perspex holder and place it in a measuring chamber containing BSM solution.Press the holder to the bottom of the Petri dish with a plastic-coated weight. Leave the prepared sample to adapt for about 30 min. The leaf sample is ready for measurements now.",
    "Measuring NaCl-induced K+ efflux from the leaf mesophyll by the MIFE techniquePlace the measuring chamber on a microscope stage and insert the reference electrode into it. Position the calibrated K+ microelectrode 40 μm away from the exposed mesophyll (Wu et al., 2014; Wu et al., 2015) under high magnification (200x) of the inverted microscope using three dimensional micromanipulators of the MIFE technique.Start the MIFE program CHART as described above for calibration.Set up a travel range of 70 μm between two positions and moving cycle of 6 sec/ 6 sec to enable electrode movement in a 12 sec square-wave cycle by a computer-controlled hydraulic manipulator.Record K+ fluxes from leaf samples under control (BSM solution) conditions for 5 min.Add concentrated NaCl stock solution to achieve 100 mM NaCl in the BSM solution and mix well with a pipette.Record NaCl-induced K+ fluxes for 10 min. Press “Alt + H” to end the data acquisition followed by “Y” for <Y>es to confirm your choice.Create an average file by pressing “Alt + E” to enter the <E>lectrometer menu, then choose “A” for <A>average option and “M” for the <M>anipulator cycle average. A box with “Experimental parameter values” will open. Press <Z> and type radius of the root (in μm); press <U> and type distance between the root and the microelectrode (typically 40 μm), then press <OK>. A new box will appear in the screen with indication of a valid time. Accept all by pressing <Enter>. An <.AVM> file will be created. Quit the CHART program by pressing “Alt + Q”. Flux calculationRun MIFEFLUX software by typing “mflux” in the MIFE directory [see Shabala et al. (2012) for details].Type the name of the recorded AVC file (calibration of the electrodes).",
    "Follow the prompt, and then type the name of the AVM file for which flux calculation is required. Choose <C> for cylindrical diffusion geometry (Newman, 2001; Shabala et al., 2006) and press <Enter>. A flux file with an extension <.flx> will be generated. The same calibration file can be used for calculating more flux files. Copy flux files to your working directory and use Excel for data analyses. Flux data analysesOpen Excel and find a flux file of interest in , open it. Plot K+ flux values against time and assess flux changes. Negative values of the flux are associated with K+ efflux, the larger the value the higher K+ efflux through the plasma membrane. The lower is the value, the better is K+ retention ability (and, hence, salt tolerance).Pay specific attention to a peak and steady state values under different conditions (in the presence and the absence of NaCl in the BSM)."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}