{
  "id": 1686,
  "origin_website": "Cell",
  "title": "A protocol for isolation of primary human immune cells from the liver and mesenteric white adipose tissue biopsies",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nImmune cell isolation from liver\nTiming: 1 h\nIn this section we describe how to isolate primary immune cells from liver wedges of obese adolescents. We recommend the initiation of primary immune cell isolation process within 1 h after surgical tissue collection. Following tissue biopsy, the liver wedge is placed in a sterile gauze socked in sterile saline solution and promptly transported to the processing lab. For schematic overview see Figure 1[href=https://www.wicell.org#fig1].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1146-Fig1.jpg\nFigure 1. Depiction of liver homogenate from step 6 after centrifugation\nAn example of a cell pellet after successful homogenization of liver tissue using GentleMACS Tissue Dissociator.\nNote: Keep the liver tissue at room temperature\nAdd 10 mL of C-RPMI (room temperature) into a GentleMACS C tube.\nPlace the liver wedge (∼500 mg) into a GentleMACS C tube containing the C-RPMI.\nUse GentleMACS Tissue Dissociator (program E.01, pre-programmed by manufacturer) to homogenize the liver tissue.\nNote: If the liver tissue did not homogenize completely, repeat the same dissociation program (E.01) 2–3 additional times. We do not recommend using other methods of homogenization since most mechanical dissociation techniques are either to gentle or too harsh to obtain robust yields of viable tissue immune cells.\nTransfer homogenized liver tissue sample into a sterile 50 mL conical tube.\nWash GentleMACS C tube with an additional 10 mL of C-RPMI and transfer into the same 50 mL conical tube from step 4. Spin the homogenate at 800 × g for 10 min at 4°C (Figure 1[href=https://www.wicell.org#fig1])\nNote: While samples are spinning, prepare 33% Percoll in RPMI 1640 at room temperature.\nDecant supernatant (from step 6) gently.",
    "Add 30 mL of 33% Percoll solution directly to tube containing the cells pellet then briefly shake tube by hand to mix cell pellet with Percoll solution prior to centrifugation.\nNote: This protocol does not involve layering of immune cells onto Percoll gradient.\nSpin at 1000 × g for 20 min at room temperature.\nNote: Ensure that centrifuge is set to acceleration 1 and brake 0. Activating the break on the centrifuge may disturb the separation gradient and in turn may lower the cell number yield.\nGently and carefully decant the supernatant following centrifugation to limit disruption of immune cells pellet collected at the bottom of the 50 mL conical tube Figure 2[href=https://www.wicell.org#fig2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1146-Fig2.jpg\nFigure 2. Setup of the Percoll density gradient\n(A) An example of a prepared gradient prior to centrifugation.\n(B) Depiction of the resulting gradient layers after centrifugation. The desired immune cells pellet should be collected by discarding top fractions.\nCritical: Cell pellet does not stick to tube bottom of the conical tube. Thus, extra caution should be employed to gently and carefully decant the supernatant to avoid the loss of isolated liver tissue primary immune cells.\nResuspend the isolated primary immune cell pellet in 5 mL ACK (RBC lysis buffer) and incubate for 1 min at room temperature.\nSpin at 800 × g for 4 min at 4°C.\nGently decant supernatant and resuspend pellet in 5 mL of C-RPMI.\nSpin at 800 × g for 4 min at 4°C.\nGently decant supernatant and resuspend pellet in 1 mL of C-RPMI.",
    "Count cells using a hemocytometer (mix 10 μL of sample with Trypan blue at 1:10 ratio (10 μL cell sample + 90 μL Trypan blue), load 10 μL of this dilution into the hemocytometer and count cells. A liver wedge of ∼500 mg will yield between 0.5–2 × 106 cells following this protocol.\nProceed to downstream application. See Figure 3[href=https://www.wicell.org#fig3] for step-by-step guide\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1146-Fig3.jpg\nFigure 3. Immune cell isolation from liver wedge\nDetailed schematics illustrating isolation of liver immune cells by Percoll gradient.\nImmune cell isolation from mesenteric white adipose tissue (WAT)\nTiming: 1.5 h\nNote: Prepare Millipore Stericup receiver bottle with 300 ml DMEM, high glucose, L-glutamine and HEPES for tissue collection.\nIn this section we describe how to isolate immune cells from the mesenteric WAT. We recommend the initiation of primary immune cell isolation process within 1 h after surgical tissue collection. Following surgical collection, the WAT is placed in a sterile Millipore Stericup receiver bottle, containing 300 mL of DMEM, high glucose, L-glutamine and HEPES and promptly transported to the processing lab. For schematic overview see Figure 5[href=https://www.wicell.org#fig5]\nWeigh entire mesenteric WAT biopsy.\nNote: Be sure to keep sample sterile in hood.\nPlace approximately 3 grams of WAT into a 15 mL conical tube containing 10 mL of DMEM, high glucose, L-glutamine and HEPES. Prepare 10–20 tubes total (depending on amount of sample received).\nThoroughly mince tissue into small pieces using scissors.\nSpin at 1000 × g for 5 min at 4°C. Figure 4[href=https://www.wicell.org#fig4]A\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1146-Fig4.jpg\nFigure 4. Setup of the immune cell isolation from mesenteric WAT\n(A) An example of the different layers after mincing (after step 20).\n(B) An example of the WAT homogenates after enzymatic digestion (after step 24).\n(C) Depiction of the various layers post enzymatic digestion and after centrifugation (after step 26).",
    "Note: in the meantime, prepare WAT digestion buffer. Prepare fresh WAT digestion buffer every time the protocol is done. Do not make stocks, enzymes can undergo degradation.\nCritical: After spinning, the mesenteric WAT layer will remain at the top of the tube while unwanted red blood cells and cellular debris will form a pellet at the bottom of the tube.\nRemove the media and pellet from the bottom of each tube by inserting a 5 mL pipet through WAT layer. Keep the top WAT layer in the tube (Figure 4A[href=https://www.wicell.org#fig4]).\nAdd 7 mL of WAT digestion buffer to the tube containing the remaining WAT layer\nPlace on a shaking incubator at 37°C for 45 min at 225 rpm.\nAfter 45 min of digestion vigorously shake tubes with hand. Figure 4[href=https://www.wicell.org#fig4]B.\nFilter the digested mesenteric WAT through 100 μM cell strainers into a 50 mL conical tube.\nCentrifuge at 800 × g for 4 min at 4°C. Figure 4[href=https://www.wicell.org#fig4]C.\nCritical: The immune cells will be pelleted at the bottom whereas the mature adipocytes and lipid layer will be floating. Please make sure to remove as much as possible of the mature adipocytes and lipid layer to prevent downstream interference of these cells and lipids in flow cytometry analysis.\nDecant supernatant and floating adipocytes and resuspend the cell pellet in 3 mL ACK lysis buffer, incubate for 1 min at room temperature.\nCentrifuge at 800 × g for 5 min at 4°C.\nDecant supernatant and resuspend pellet in 1 mL C-RPMI.",
    "Count cells using a hemocytometer (mix 10 μL of sample with Trypan blue at 1:10 ratio (10 μL cell sample + 90 μL Trypan blue), load 10 μL of this dilution into the hemocytometer and count cells. From white adipose tissue (60 grams) the provided protocol should yield ∼20 × 106 cells.\nProceed to downstream application. See Figure 5[href=https://www.wicell.org#fig5] for step-by-step guide\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1146-Fig5.jpg\nFigure 5. Immune cell isolation from mesenteric WAT\nDetailed scheme illustrating isolation of WAT immune cells by enzyme digestion isolation protocol.\nImmunostaining of immune cells from liver and mesenteric WAT using flow cytometry\nTiming: 1.5 h\nCritical: We recommend using the manufacturer suggested volume per antibody concentration. However, we perform titration of each antibody prior to use for optimal standardization of flow cytometry staining in our lab.\nNote: Prepare all Flow reagents in the hood with the light OFF. Prepare all required controls for flow cytometry analysis including compensation controls (unstained cell control, viability control (Zombie) and single-color controls) for proper set up of the cytometer.\nPrepare Master Mix for surface markers for liver Macrophages, neutrophils, and DC.\ntable:files/protocols_protocol_1146_6.csv\nPrepare Master Mix for surface markers for WAT T cells Macrophages, neutrophils, and DC\ntable:files/protocols_protocol_1146_7.csv\nPlace the 0.5 × 106 cells into a 96-well round bottom plate (non-tissue culture treated).\nSpin plate at 800 × g for 4 min at 4°C.\nFollowing spin completion, gently aspirate media from the side of each well. Avoid touching the pellet.\nAdd 200 μL of FACS buffer.\nSpin 800 × g for 4 min at 4°C.\nFollowing spin gently aspirate media from the side of each well. Avoid touching the pellet.\nAdd 25 μL of FACS buffer and 2 μL of human IgG (1 mg/mL) and incubate for 10 min at 4°C",
    "Alternatives: Fc receptors can be blocked by incubating cells with 10% normal human serum or Fc Block (BD-Bioscience Cat# 564219).\nAdd antibody master mix prepared in the steps 32 and 33 above. Pipet up and down to mix.\nIncubate plate for 30 min at 4°C.\nCritical: Ensure to protect plate from light.\nFollowing incubation, add 150 μL of cold FACs Buffer.\nSpin at 800 × g for 4 min at 4°C.\nGently aspirate media.\nAdd 100 μL of BD Cytofix Buffer to each well then resuspend cell pellet by pipetting up and down.\nIncubate plate for 30 min at 4°C.\nSpin at 800 × g for 4 min at 4°C.\nRe-suspend the cell pellet in 200 μL of cold FACS buffer and transfer to flow tube for acquisition. Store at 4°C.\nNote: Cells can be run in the flow cytometer the following day.\nAcquire the data using available Flow Cytometer.\nAnalyze FCS files using desired flow cytometry analysis software. We routinely use FlowJo for flow cytometry data analysis (Figures 6[href=https://www.wicell.org#fig6] and 7[href=https://www.wicell.org#fig7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1146-Fig6.jpg\nFigure 6. Gating strategy for FACS analyses of Liver immune cells\nA representative of 60 individual human samples.\n(A) Forward and side scatter gating on lymphocytes to exclude cellular debris.\n(B) Singlets gating to exclude doublets.\n(C) Live cell positive gate.\n(D) CD45+ cells positive gating.\n(E) CD3+ and CD4+ gating for CD4+ T cells.\n(F) CD3+ and CD8+ positive gating for CD8+ T cells.\n(G) from the second staining panel we gated forward and side scatter gating on lymphocytes to exclude cellular debris then in singlets to exclude doublets followed by live cell and CD45+ cells positive gating. (G) CD11b and CD15 positive gating for macrophages/monocytes CD11b+CD15low and neutrophils CD11bhighCD15high.\n(H) HLA-DR high and CD3/CD16/CD19 negative gating for dendritic cells.",
    "(I and J) (I) CD11c vs CD123 for plasmacytoid DC (CD11c-CD123+) and myeloid DC (CD11c+CD123-) and (J) CD11c vs CD14 for monocyte exclusion.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1146-Fig7.jpg\nFigure 7. Gating strategy for FACS analyses of mesenteric WAT immune cells\nA representative of 60 individual human samples.\n(A) Forward and side scatter gating on lymphocytes to exclude cellular debris.\n(B) Singlets gating to exclude doublets.\n(C) Live cell positive gate.\n(D) CD45+ cells positive gating.\n(E) CD3+ and CD4+ gating for CD4+ T cells.\n(F) CD3+ and CD8+ positive gating for CD8+ T cells.\n(G) from the second staining panel we gated forward and side scatter gating on lymphocytes to exclude cellular debris then in singlets to exclude doublets followed by live cell and CD45+ cells positive gating. (G) CD11b and CD15 positive gating for macrophages/monocytes CD11b+CD15low and neutrophils CD11bhighCD15high.\n(H) Left panel, HLA-DR high and CD11b negative gating for dendritic cells and right panel, CD11c vs CD123 for plasmacytoid DC (CD11c-CD123+) and myeloid DC (CD11c+CD123-).\nIn-vitro stimulation of liver isolated immune cells with PMA and ionomycin for intracellular cytokines detection in T cells\nTiming: 4 h\nPlate 0.5×106 cells in 48-well plates in 500 μL of C-RPMI- one well for unstimulated and one well for PMA/Ionomycin (PMA/Iono) stimulation.\nNote: Only plate the cells that are going to be used for the intracellular cytokine staining\nPrepare the following stimulation solution:\ntable:files/protocols_protocol_1146_8.csv\nAdd 25 μL of the solution prepared in step 53 above to the stimulated well.\nIncubate at 37°C in 5% CO2 for 4 h.\nExtra- and intracellular immunostaining of in-vitro stimulated immune cells from liver using flow cytometry\nTiming: 3.5 h\nCritical: We recommend using the manufacturer suggested volume per antibody concentration. However, we perform titration of each antibody prior to use for optimal standardization of flow cytometry staining in our lab.",
    "30 min prior to the end of the incubation period with PMA/Ionomycin, prepare flow antibody master mix for extracellular antigens as follow:\nNote: Prepare all Flow reagents in the hood with the light OFF. Prepare all required controls for flow cytometry analysis including compensation controls (unstained cell control, viability control (Zombie) and single-color controls) for proper set up of the cytometer.\ntable:files/protocols_protocol_1146_9.csv\nAfter incubation transfer the 0.5 × 106 cells unstimulated cells and the 0.5 × 106 stimulated cells into a 96-well round bottom plate (non-tissue culture treated).\nSpin plate at 800 × g for 4 min at 4°C.\nFollowing spin completion, gently aspirate media from the side of each well. Avoid touching the pellet.\nAdd 200 μL of FACS buffer.\nSpin 800 × g for 4 min at 4°C.\nFollowing spin gently aspirate media from the side of each well. Avoid touching the pellet.\nAdd 25 μL of FACS buffer and 2 μL of human IgG and incubate for 10 min at 4°C\nAlternatives: Fc receptors can be blocked by incubating cells with 10% normal human serum or Fc Block (BD-Bioscience Cat# 564219).\nAdd antibody master mix prepared in the step 56 above. Pipet up and down to mix.\nIncubate plate for 30 min at 4°C.\nCritical: Ensure to protect plate from light.\nFollowing incubation, add 150 μL of cold FACs Buffer.\nSpin at 800 × g for 4 min at 4°C.\nGently aspirate media.\nAdd 100 μL of BD Cytofix Buffer to each well then resuspend cell pellet by pipetting up and down.\nIncubate plate for 30 min at 4°C.\nSpin at 800 × g for 4 min at 4°C.",
    "Break point: after fixation Cells can be stored to continue the intracellular staining at a later time up to 24 h. Resuspend cells in FACS Buffer for storing cells at 4°C for\nNote: If decide to continue with staining procedure, while plates are spinning prepare the 1× BD Perm Wash by diluting 10× BD Perm Wash to 1× in distilled water.\nPrepare intracellular stain for the liver T cells well as follows:\ntable:files/protocols_protocol_1146_10.csv\nGently aspirate supernatant from well. Do not touch the cell pellet.\nAdd antibody master mix prepared in step 72 above. Pipet up and down to mix.\nIncubate plate for 1 h at 4°C.\nFollowing incubation, add 200 μL of cold 1× BD Perm Wash.\nSpin at 800 × g for 4 min at 4°C.\nGently aspirate supernatant from well. Do not touch the cell pellet.\nAdd 220 μL of cold FACs Buffer.\nSpin at 800 × g for 4 min at 4°C.\nGently aspirate supernatant from well. Do not touch the cell pellet.\nRe-suspend the cell pellet in 200 μL of cold FACS buffer and transfer to flow tube for acquisition. Store at 4°C.\nNote: Cell can be run in the flow cytometer the following day.\nAcquire the data using available Flow Cytometer.\nAnalyze FCS files using desired flow cytometry analysis software. We routinely use FlowJo for flow cytometry data analysis. Figures 6[href=https://www.wicell.org#fig6] and 8[href=https://www.wicell.org#fig8].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1146-Fig8.jpg\nFigure 8. Gating strategy for FACS analyses of CD4+ and CD8+ T cytokine production after in vitro stimulation with PMA and Ionomycin\nA representative of 60 individual human samples. Gating strategy for intracellular detection of TNFα and IFNγ from liver T cells.\n(A) Intracellular detection of TNFα and IFNγ in CD3+CD4+ T cells (gated from Figure 6[href=https://www.wicell.org#fig6]E) with and without stimulation with PMA/Ionomycin.",
    "(B) Intracellular detection of TNFα and IFNγ in CD3+CD8+ T cells (gated from Figure 6[href=https://www.wicell.org#fig6]F) with and without stimulation with PMA/Ionomycin. Left panels unstimulated control. Right panels PMA/Ionomycin stimulated cells."
  ],
  "subjectAreas": [
    "Immunology",
    "Health Sciences",
    "Metabolism",
    "Cell Isolation",
    "Flow Cytometry",
    "Single Cell"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}