{
  "id": 6650,
  "origin_website": "Bio",
  "title": "A Mismatch-tolerant RT-LAMP Method for Molecular Diagnosis of Highly Variable Viruses",
  "procedures": [
    "Preparation of HIV-1 wild type and mutant RNA standardsConstruct two mutant pUC57-IN plasmids using the fast mutagenesis system according to the following steps. Primers for construction of the mutant plasmids are in Table 2.Prepare the PCR reaction mixes (Table 3), PCR cycling condition: Enzyme activation and pre-denaturation at 94 °C for 3 min, 25 cycles of denaturation at 94 °C for 20 s, annealing at 55 °C for 20 s and extension at 72 °C for 1 min, followed by extending at 72 °C for 10 min.Table 2. Primers for construction of two HIV-1 mutant plasmidsimgsrc:https://en-cdn.bio-protocol.org/attached/image/20191029/20191029234913_2621.jpgNote: Introduced mutant is shown in Red font. F: forward primer; R: reverse primer; Mu: mutant.Table 3. PCR reaction mixes of the construction of two HIV-1 mutantsimgsrc:https://en-cdn.bio-protocol.org/attached/image/20191029/20191029234940_3098.jpgNote: F: forward primer; R: reverse primer; Mu: mutant. Electrophoresis detection: measure 10 μl PCR product using 1% agarose gel electrophoresis at a constant voltage (140 V) for about 30 min.PCR product digestion: add 1 μl of DMT enzyme to the remaining PCR product, mix and incubate for 1 h at 37 °C.Add 5 μl of DMT digestion product to 50 μl of competent cells, mix and place on ice for 30 min. Then place the mixture at 42 °C for 45 s, and on ice for 2 min.Add 250 μl of room temperature LB medium (without antibiotics) to the mixture, 200 rpm, 37 °C for 1 h.Spread 100 μl of the bacterial solution evenly on a plate containing 100 μg/ml ampicillin and incubate overnight in a 37 °C incubator. Pick the mono-clones into 3 ml LB medium containing 100 μg/ml ampicillin, for shaking culture (200 rpm), at 37 °C for 10-12 h. Extract the plasmid DNA for Sanger sequencing (Shanghai Platinum Company) and verify the presence of the mutation.",
    "Store the mutated plasmids at -20 °C for subsequent experiments.Amplify the HIV-1 integrase segment using T7 promotor-containing primer pair (HIV T7-F: TAATACGACTCACTATAGACGGTTAGGGCCGCCTGT and HIV R: CAGTCGACGGGCCCGGGA) with the wild-type and mutant HIV-1 plasmids as templates. In a 0.2 ml PCR® tube with cap, a PCR reaction mix includes 25 μl 2x DreamTaqTM Green PCR Master Mix, 2 μl of 10 μM of each primer (HIV T7-F and HIV R primer) and 2 μl HIV-1 plasmid in a final volume of 50 μl. The cycling condition is enzyme activation and pre-denaturation at 95 °C for 3 min, followed by 40 cycles of denaturation at 95 °C for 30 s, annealing at 55 °C for 30 s and extension at 72 °C for 1 min, fully extending at 72 °C for 10 min.Measure the PCR product using 2% agarose gel electrophoresis at a constant voltage (140 V) for about 30 min. After electrophoresis, cut the specific PCR product from the gel under UV control and purify according to the manufacturer′s instruction using the QIAquick® Gel Extraction Kit. Obtain RNAs through in vitro transcription with the purified DNA as templates using the HiScribe T7 High Yield RNA Synthesis Kit. Quantify the obtained RNA using NanoDropTM 2000 Spectrophotometer, and calculate the RNA copy number using the following formula: RNA copies/ml = [RNA concentration (g/ml)/(nt transcript length × 340)] × 6.022 × 1023Dilute RNA to 104 copies/ul, aliquot to 40 μl in a 0.2 ml PCR® tube with cap and store at -80 °C until use.Plasma sample viral RNA extractionExtract viral RNA from 140 μl of plasma using the QIAgen Viral RNA Mini Kit following the manufacturer′s instruction.Elute the extracted RNA in 50 μl of nuclease-free water, aliquot to 25 μl per tube, and store at -80 °C until use.",
    "Qualitative detection of HIV-1 by the real-time mismatch-tolerant HIV-1 RT-LAMP assayPreparation of mixed primer sets (Table 4)Prepare the mixed primer set 1 by adding 5 μl 100 μm each of primers AceIN-F3, AceIN-B3a, and AceIN-B3b into 85 μl nuclease-free water; the mixed primer set 2 includes 20 μl 100 μm each of primers AceIN-FIPf and AceIN-FIPe, 40 μl 100 μm AceIN-BIP, and 20 μl nuclease-free water; the mixed primer set 3 includes 20 μl 100 μm each of primers AceIN-LF and AceIN-LB, and 60 μl nuclease-free water. Preparation of the real-time RT-LAMP mix (Table 5)In a 96-well PCR plate or 8-tube PCR strip, each 25 μl reaction mix includes 3 μl RNA template (RNA standard or RNA extracts from clinical sample), 2.5 μl 10x isothermal amplification buffer, 1 μl 100mM MgSO4, 3.5 μl 10 mM dNTPs, 0.075 μl 2 units of Q5 high-fidelity DNA polymerase, 1 μl 8 units of Bst 2.0 DNA polymerase, 0.5 μl 15 units of warmstart RTx reverse transcriptase, 1 μl 1 mM SYTO 9, and 1 μl each mixed primer set (mixed primer set 1-3 in Table 4).Table 4. Mixed primer sets preparation of the mismatch-tolerant RT-LAMP assayimgsrc:https://en-cdn.bio-protocol.org/attached/image/20191029/20191029235105_9944.jpgNote: The regular assay is recommended when no degenerate primers is used. RT-LAMP cycling condition: Perform the reaction at 62 °C for 1 min by 60 cycles. Collect fluorescence signal at each cycle.Colorimetric RT-LAMP detection (Table 5)Preparation of the colorimetric RT-LAMP mix (Table 5) In an 8-tube PCR strip, each 25 μl reaction mix includes 12.5 μl warmstart colorimetric LAMP 2x master mix, 1 μl each mixed primer set (mixed primer sets 1-3 in Table 4), 0.075 μl 2 units of Q5 high-fidelity DNA polymerase, and 3 μl of RNA template (RNA standard or RNA extracts from clinical sample).",
    "Colorimetric RT-LAMP cycling condition: Perform the reaction at 62 °C for 50 min. Observe the color change at 20-, 30-, 40-, and 50-min time points by naked eyes."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}