{
  "id": 12305,
  "origin_website": "Jove",
  "title": "A Detailed Protocol for Characterizing the Murine C1498 Cell Line and its Associated Leukemia Mouse Model",
  "procedures": [
    "Animal housing and all experimental procedures were approved by the local Animal Care Ethical Committee, CEEA.NPDC (agreement no.512012), and all experiments were performed in accordance with the French and European guidelines for the Care and Use of Laboratory Animals.\n1. In vitro Characterization of the C1498 Cell Line\nIn vitro culture of C1498 cells\n\t\nPrepare complete RPMI (Roswell Park Memorial Institute) 1640 medium by adding 50 ml of fetal bovine serum (FBS), 5 ml of penicillin (100 U/ml)-streptomycin (100 µg/ml), 500 µl of 50 mM β-mercaptoethanol, 5 ml of N-2-hydroxyethylpiperazine-N-2-ethane sulfonic acid (HEPES), 5 ml of non-essential amino acids and 5 mL of sodium pyruvate to 500 ml of RPMI medium.\nGrow the C1498 cell line in complete RPMI. Harvest the cells in suspension by pipetting, and transfer the cells to a 50 ml tube. Centrifuge at 350 x g for 10 min, and remove the supernatant.\nAdd 20 ml of phosphate-buffered saline (PBS) (1x) solution, centrifuge at 350 x g for 10 min, and remove the supernatant.\nResuspend the cells in 10 ml of Fluorescence-Activated Cell Sorter (FACs) buffer (2.5 g of bovine serum albumin (BSA) powder and 2 ml of 0.5 M ethylenediaminetetraacetic acid (EDTA) solution in 500 ml of PBS solution). Count the cells using a Thoma cell counting chamber after staining the cells with trypan blue.\nPhenotypic characterization of the C1498 cell line using immunostaining and flow cytometry analysis\n\t\nCell surface staining\n\t\t\nPrepare FACs buffer.\nAdjust the harvested cells in FACs buffer to 107 cells/ml and dispense 106 cells (in 100 µl) for each staining experiment into flow cytometry tubes.\nLabel the cells with 100 µl of the following antibodies or their associated isotype controls diluted in FACs buffer:",
    "For markers of precursor and differentiated cells, label the cells with anti-CD11b/anti-CD18 (1), anti-Ly-6G (1), anti-CD19, anti-B220 (2), anti-NK1.1, anti-CD49b, anti-CD4 (1), anti-CD8 (2), anti-CD3 (3), anti-CD21/35, anti-CD115 and anti-TCRVβ antibodies.\nFor hematopoietic stem/progenitor cells markers, use a combination of anti-CD34/anti-CD117/anti-Sca-1, anti-CD150/anti-CD117/anti-Sca-1, anti-CD117/anti-CD127 or anti-CD16/32-biotin antibodies alone.\nFor markers of cell functions (e.g., adhesion, antigen presentation, co-stimulatory molecules and receptors), stain the cells with anti-CD18 (2)/anti-CD11a, anti-MHC class I, anti-MHC class II, anti-CD31, anti-CD44, anti-CD80-biotin, anti-CD86, and anti-CD274 antibodies.\nIncubate all of the flow cytometry tubes at 4 °C for 30 min.\nWash the cells twice by adding 2 ml of FACs buffer to each tube, centrifuge at 350 x g for 5 min, and remove the supernatant.\nAdd 100 µl of FACs buffer to each tube and proceed to secondary staining by adding 100 µl of fluorescent streptavidin (1/100 in FACs buffer for a final dilution of 1/200) to the biotinylated-conjugated antibodies. Incubate the tubes at 4 °C for 30 min.\nWash the cells twice as follows: add 2 ml of FACs buffer to each tube, centrifuge the tubes at 350 x g for 5 min, and remove the supernatant by pipetting.\nResuspend the cells in 500 µl of cold PBS and place the cells on ice, keeping them in the dark by using aluminum foil to cover the tubes. Analyze results using a cytometer10.\nIntracellular staining\n\t\t\nPrepare fixation buffer by adding 125 ml of a 4% paraformaldehyde (PFA) solution to 375 ml of PBS solution.",
    "NOTE: To prepare 500 ml of 4% PFA, heat 400 ml of PBS solution to approximately 60 °C on a stir plate in a ventilated hood. Add 20 g of PFA powder, and raise the pH until the PFA is dissolved. Allow the solution to cool, adjust the pH to 6.9, and make up the volume to 500 ml with PBS.\nPrepare the permeabilizing buffer by adding 0.5 g of saponin and 0.5 g of BSA to 500 ml of PBS solution.\nAdjust the harvested cells in FACs buffer to 107 cells/ml and distribute 106 of the cells (100 µl) for each staining experiment into flow cytometry tubes. Centrifuge the cells at 350 x g for 5 min, and remove the supernatant.\nFix the cells in 200 µl of 1% PFA solution and incubate for 10 min at 4 °C.\nAdd 2 ml of permeabilizing buffer to each tube, centrifuge the tubes at 350 x g for 5 min, and remove the supernatant by pipetting. Add 100 µl of permeabilizing buffer to each tube.\nLabel the cells with 100 µl of the following antibodies or their corresponding isotype controls after diluting them in permeabilizing buffer: anti-CD3 (2)/anti-CD8 (1), anti-CD3 (3)/anti-CD4 (2), anti-CD107b and anti-CD3 (3)/anti-TCRVβ.\nIncubate the cells at 4 °C for 30 min.\nWash the cells twice by adding 2 ml of permeabilizing buffer to each tube. Centrifuge the tubes at 350 x g for 5 min, and remove the supernatant.\nAdd 100 µl of permeabilizing buffer to the cells. Proceed to secondary staining by adding 100 µl of fluorescent streptavidin diluted in permeabilizing buffer to biotinylated-conjugated antibodies. Incubate the tubes at 4 °C for 30 min.",
    "Add 2 ml of permeabilizing buffer to each tube, centrifuge the tubes at 350 x g for 5 min, and remove the supernatant. Repeat this step one more time.\nResuspend the cells in 500 µl of cold PBS, and then place the cells on ice in the dark. Analyze the results using a flow cytometer10.\nPreparation of a cell suspension on slides for microscopy\n\t\nWash 106 of the harvested C1498 cells (obtained in step 1.1.4) with 5 ml of cold FACs buffer twice, and dilute the cells in 1 ml of cold FACs buffer. Place the tubes on ice.\nPlace slides into disposable chambers with pre-attached filter cards and place these into a cytocentrifuge.\nAdd 100 µl of FACs buffer to each chamber and filter card, and spin them for 2 min at 4.52 x g.\nAdd 100 µl of cells to each chamber and filter card, and spin the cells at 4.52 x g for 2 min.\nCarefully remove the slides from the chambers and air-dry the slides before staining them with myeloperoxidase (step 1.4), esterases (step 1.5) or May-Grünwald Giemsa (step 1.6).\nMyeloperoxidase staining for immunofluorescence\n\t\nFix the cells on the slides by immersing the slides in a cold methanol:acetone (1:1) solution for 2 min, and then air-dry the slides.\nTo confine the liquid to the area of the slide containing the cells, draw a circle around the cells using a water-repellent pen.\nRinse the cells in 200 µl of cold PBS solution for 10 min.\nBlock the cells in 200 µl of 3% BSA/PBS buffer containing 10 µl of normal donkey serum and 10 µg/ml of purified anti-CD16/32 antibodies.\nApply 200 µl of the anti-mouse myeloperoxidase (diluted to 20 µg/ml in 3% BSA/PBS buffer). Incubate the cells O/N at 4 °C in a humidity chamber.",
    "Wash the cells with 200 µl of cold 0.1% BSA/PBS.\nApply 200 µl of anti-goat IgG antibodies diluted at 1/250 in 3% BSA/PBS buffer. Incubate the cells for 2 hr at RT in a humidity chamber.\nWash the cells 3 times with 200 µl of 0.1% BSA/PBS buffer and twice in cold PBS.\nStain the cell nuclei with 200 µl of Hoechst diluted at 1/1,000 in PBS (to a final concentration at 1 µg/mL) for 2 min at RT.\nWash the slides with water and allow them to air-dry before mounting. Apply one drop of mounting medium 1 to the cells, place one edge of a cover-glass onto the slide, and carefully lower it onto the cells using forceps. Press gently on the cover-glass to remove any air bubbles.\nEsterase cytochemistry\n\tNote: Pre-warm all reagents to RT.\n\t\nFixative preparation\n\t\t\nTo prepare the Citrate-Acetone-Formaldehyde (CAF) solution, add 2.5 ml of citrate solution, 6.5 ml of acetone and 0.8 ml of 37% formaldehyde to a glass bottle. Mix gently and store at 4 °C.\nNaphthol AS-D Chloroacetate esterase (CAE) activity assay\n\t\t\nWarm deionized water to 37 °C.\nIn a 50 ml tube, add 1 ml of sodium nitrite solution to 1 ml of dye solution. Mix gently and let stand for 2 min. Add 40 ml of pre-warmed deionized water, 5 ml of pH 6.3 buffer concentrate and 1 ml of Naphthol AS-D Chloroacetate solution. Mix and transfer into a Coplin jar.\nFix the cells onto the slides (see section 1.3) for 30 sec with CAF solution (see step 1.5.1.1), and wash the slides for 45 sec with deionized water.\nTransfer the slides into the solution that was prepared in step 1.5.2.2, and incubate the slides at 37 °C for 30 min in a humidity chamber protected from light.",
    "Dry the slides and then rinse them via immersion in deionized water for 2 min.\nCounterstain the cells by adding few drops of Hematoxylin solution and incubating them for 1 min.\nWash the slides with neutral water (pH 7) and allow them to air-dry. Apply one drop of mounting medium 2 to the cells, place one edge of a cover-glass onto the slide and carefully lower it onto the cells using forceps. Press gently on the cover-glass to remove any air bubbles.\nAlpha-Naphthyl butyrate esterase (NBE) activity assay\n\t\t\nWarm α-naphthyl butyrate solution to 37 °C before use.\nDilute one tablet of sodium nitrite in 6.25 ml of deionized water.\nIn a 50 ml tube, add 1.5 ml of a sodium nitrite tablet solution and 1.5 ml of a Pararosaniline solution. Mix gently and allow the solution to stand for 5 min. Supplement the solution with 40 ml of phosphate-buffered solution. Bring to pH 6 by carefully adding 10 N NaOH dropwise. Add 5 ml of the α-naphthyl butyrate solution, mix the entire solution, and transfer it into a Coplin jar.\nFix the cells onto the slides for 10 sec using the CAF solution at RT and rinse for 45 sec with deionized water.\nTransfer slides into the Coplin jar containing the solution that was prepared in step 1.5.3.2 and incubate together for 1 hr at 37 °C in a humidity chamber while protected from light.\nRinse the slides for 2 min in neutral water (pH 7) and air-dry.\nCounterstain the cells with Methylene blue solution by adding few drops on the slide and incubate for 4 min.",
    "Immerse the slides in deionized water for 2 min and allow them to air-dry. To mount the slides, apply one drop of mounting medium 2 to the cells, place one edge of the cover-glass onto the slide, and carefully lower it onto the cells using forceps. Press gently on the cover-glass to remove any air bubbles.\nMay-Grünwald Giemsa (MGG) staining\n\t\nStain the cells (prepared in section 1.3) by immersing the slides into a Coplin jar containing May-Grünwald solution for 3 min.\nTransfer the slides into a Coplin jar containing the pH 6.8 buffer solution for 1 min.\nStain the slides by placing them into a Coplin jar containing the Giemsa R solution (diluted to 1/20 in pH 6.8 buffer solution) for 10 min. Wash the slides with neutral water (pH 7) for 10 sec.\nDrain and air-dry the slides. Mount the slides by applying one drop of mounting medium 2 onto the cells. Place one edge of the cover-glass onto the slide and carefully lower it onto the cells using forceps. Press gently on the cover-glass to remove any air bubbles.\n2. In Vivo Development and Characterization of Acute Leukemia\nNOTE: Four-week-old female congenic C57BL/6J-Ly5.1 mice were maintained under specific pathogen-free conditions (i.e., in a sterile environment). The mice were injected when they were between 5 and 6 weeks old.\nIntravenous injection with C1498 cells\n\t\nHarvest the cultured C1498 cells in suspensions by pipetting. Transfer the cells to a 50 mL tube and centrifuge at 350 x g for 10 min. Wash the cells in 10 ml of cold PBS twice, and prepare a cell suspension of 107 cells/ml in PBS. Place the cellular suspension on ice before performing the injection.\nPlace the mouse in a restrainer and perform the injection under sterile conditions in a laminar flow hood.",
    "Use a 29G needle with a syringe to inject the cells into the tail vein. Grasp the tail at the distal end, and disinfect it with a gauze sponge soaked in 70% ethanol. Check to be sure that there are no air bubbles in the syringe, and then slowly inject 100 µl of the C1498 cell suspension (106 cells) into the tail vein.\nAfter the injection, remove the needle from the tail, and control any bleeding by applying pressure with a sterile gauze sponge at the injection site. Return the animal to its cage, and carefully check its health over the next hours and days.\nRetro orbital blood collection\n\t\nMonitor the behavior of the PBS- and C1498-injected mice for signs of leukemic disease (e.g., piloerection, isolation from the group, and reduced or no movements in the cage).\n\t\tNOTE: This usually occurs between 17 to 19 days after the cells are injected.\nPerform retro orbital blood collection just before euthanasia (see step 2.2.7) under sterile conditions in a laminar flow hood and under a heating lamp to prevent hypothermia.\nFor anesthesia, use ketamine at 150 mg/kg and xylazine at 10 mg/kg. Prepare the anesthetic solution by diluting 1.5 ml of ketamine and 0.5 ml of xylazine in 18 ml of PBS solution.\nAnesthetize the control and leukemic mice. Proceed with an intraperitoneal injection of 200 µl of the anesthetic solution per 10 g of mouse using a 26G needle and a 1 ml syringe. Check for the loss of the pedal reflex to confirm anesthesia.\nInsert a capillary tube into the medial canthus of the eye. Blood will rise from the orbital sinus into the capillary tube. Control the bleeding by gently applying pressure onto the eye with a sterile gauze sponge.",
    "NOTE: A volume of 100 to 200 µl of blood can be collected using this technique.\nCollect the blood into an EDTA tube, and store the sample on ice before isolating the mononuclear cells.\nEuthanize the mouse using cervical dislocation, and proceed to isolate the organs (section 2.3).\nOrgans and cells isolation\n\t\nOrgans isolation\n\t\t\nPlace the euthanized mouse onto its back on a plastic board and use needles to pin the animal's feet to facilitate organ isolation. Disinfect the mouse using 70% ethanol before performing an incision.\nUsing sterile scissors, perform a ventral incision from the abdominal skin to the neck. Cut through the abdominal wall to access the liver. Cut through the rib cage and the diaphragm to access the lungs. Move the intestine to the side and remove the spleen using sterile scissors and forceps.\nTo isolate the bone marrow, cut the legs at the top of the femurs above the joint using sterile scissors. Disconnect the tibia from the femur by pulling gently, and remove the skin and muscles from the bones using forceps and scissors.\nPlace each organ and bone in a 50 ml tube containing cold PBS, and place them on ice.\nIsolation of cells from the organs\n\t\t\nWeigh the spleen before disrupting the cells. Mechanically disrupt the spleen, lungs and liver by pressing them through a 70 µm strainer using a syringe plunger in a 50 ml tube, and collect the cells into 30 ml of cold PBS.\nTo collect bone marrow cells, put the femurs and tibias in a Petri dish on ice, cut the extremities using sterile scissors, and flush out the bone marrow by inserting a 26G needle attached to a 10 ml syringe containing 5 ml of cold PBS.",
    "Disrupt the bone marrow cells by passing the cell suspension through the needle/syringe, and filter the cell suspension through a 70 µm strainer in a 50 ml tube.\nCentrifuge all of the tubes containing each of the organs and the bone marrow cells at 350 x g for 10 min. Discard the supernatant, and resuspend the cells collected from the lungs and bone marrow in 2 ml of lysis buffer (1x) and the cells isolated from the liver and spleen in 5 ml of lysis buffer (1x) by gently pipetting the mixture up and down. Fill the tubes to 50 mL with cold PBS.\nCentrifuge the cells at 350 x g for 10 min. Resuspend the cells in FACs buffer for flow cytometry analysis or to prepare the cells for microscopy. Count the cells using a Thoma cell counting chamber after staining them with trypan blue.\nCell surface staining of cells isolated from organs for flow cytometry analysis\n\t\nIn a flow cytometry tube, label 106 cells that were isolated from organs with 10 µg/ml of purified anti-CD16/32 antibodies in 100 µl of FACs buffer.\nTo 106 bone marrow cells, add 100 µl of the following antibodies or combinations of antibodies and their corresponding isotype controls diluted in FACs buffer: anti-CD11b/anti-CD3 (1)/anti-Ly6C/anti-Ly6G (2), anti-B220 (1)/anti-CD45.2/anti-CD19, anti-CD115/anti-CD3 (1)/anti-Ly6C/anti-Ly6G (2), anti-CD45.2, anti-Ly6G (2), anti-CD11b, anti-CD115 or anti-CD19 alone for compensation settings.\nTo splenocytes, add 100 µl of the following antibodies and their corresponding isotype controls diluted in FACs buffer: a combination of anti-CD11b/anti-CD3 (1)/anti-Ly6C/anti-Ly6G (2), anti-B220 (1)/anti-CD45.2/anti-CD19, anti-CD45.2, anti-Ly6G (2), anti-CD11b or anti-CD19 for compensation settings.\nTo lung and liver cells, add 100 µl of anti-CD45.2 antibodies and its corresponding isotype control diluted at 1/100 in FACs buffer.\nIncubate all of the cell solutions for 30 min at 4 °C.",
    "Wash the cells by adding 2 ml of FACs buffer to each tube. Centrifuge the tubes for 5 min at 350 x g and discarding the supernatant by pipetting. Repeat this step one more time.\nResuspend the labeled cells in 500 µl of cold PBS. Keep the cells on ice and protected from light before performing flow cytometry for acquisition and analysis10.\nIsolation of blood mononuclear cells and immunofluorescent staining for flow cytometry analysis\n\t\nBefore starting the protocol, pre-warm the separating solution to RT.\nTransfer the blood sample (100 to 200 µl; obtained from step 2.2) into a microcentrifuge tube, and add PBS/1 mM EDTA solution until the solution volume is 500 µl. Carefully layer 500 µl of separating solution under the solution containing the blood using a 30G needle and a 1 ml syringe. Do not mix the blood and the separating solution.\nCentrifuge the tubes at 800 x g (without brake) for 20 min at RT. After centrifugation, collect the cellular ring (the opaque white layer) using a pipette. Transfer the cells to a microcentrifuge tube.\n\t\tNOTE: The opaque white layer contains lymphocytes as well as monocytes and appears between the lower layer - the separating solution - and the upper layer.\nAdd 1 ml of PBS solution, and centrifuge the tube at 350 x g for 10 min. Resuspend the cells in 600 µl of FACs buffer.\nAdd 10 µg/ml of purified anti-CD16/32 antibodies and distribute 100 µl of the cell suspension into six separate tubes (100 µl each).\nLabel the cells with 100 µl of the following antibodies or their associated isotype controls diluted in FACs buffer: a combination of anti-CD3 (1)/anti-B220 (1)/anti-CD45.2 and anti-Ly6C/anti-CD115/anti-CD45.2 or anti-CD45.2 and anti-CD115 alone for compensation settings.\nIncubate all of the tubes at 4 °C for 30 min.",
    "Wash the cells by adding 2 ml of FACs buffer to each tube, and then centrifuge the tubes for 10 min at 350 x g, and discard the supernatant using a pipette.\nResuspend the labeled cells in 500 µl cold PBS. Keep the cells on ice and protected from light before performing flow cytometry acquisition and analysis10.\nPreparation of bone marrow cell suspensions on slides for microscopy\n\t\nFollow the steps described in section 1.3, but in step 1.3.1, use 105 bone marrow cells, and in step 1.3.4, spin the cells into each chamber at 72.26 x g for 10 min.\nEsterase activity assays using bone marrow cells\n\t\nTo perform the bone marrow esterase cytochemistry assays, proceed from steps 1.5 to 1.5.3.7.\nMay-Grünwald Giemsa staining of bone marrow cells\n\t\nTo stain bone marrow cells, follow the protocol described in section 1.6, but in step 1.6.1, incubate the slides in May-Grünwald solution for 5 min."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}