{
  "id": 7029,
  "origin_website": "Bio",
  "title": "Dissecting the Rat Mammary Gland: Isolation, Characterization, and Culture of Purified Mammary Epithelial Cells and Fibroblasts",
  "procedures": [
    "The dissociation of mammary tissue and generation of single cell suspension protocols were adapted for use on rat tissue from the STEMCELL Technologies technical bulletin on the Monolayer Culture of Mouse Mammary Epithelial Cells. Additionally, the Miltenyi Dead Cell Removal and QuadroMACs cell selection protocols were adapted for use on rat mammary tissue to remove lineage positive rat hematopoietic (CD45+) and endothelial cells (CD31+) from mammary epithelial cells. The workflow of this protocol can be found in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3818/bioprotoc-10-22-3818-g001.jpgFigure 1. Isolation of rat mammary epithelial cells and fibroblasts. The fourth mammary fat pads from female rats are removed and digested overnight. The following morning, adipocytes and red blood cells are depleted by centrifugation and lysis, respectively. The remaining cells are subjected to negative selection using Miltenyi CD31 and CD45 biotin conjugated antibodies. Next, addition of Miltenyi anti-biotin microbeads allows capture of the antibody tagged lineage positive populations on an LS column with a Miltenyi QuadroMACS magnet. The eluted MECs and fibroblasts are cultured in ultra-low attachment (ULA) plates for 48 hours to deplete fibroblasts. Purified MECs are then maintained in ULA with the addition of Y-27632 or plated into 2D culture for experimental analysis. Figure 1 was created with BioRender.com.Dissociation of rat mammary tissueEuthanize the rat by CO2 asphyxiation according to your institutional IACUC protocol.Aseptically remove both fourth mammary fat pads from the rat, making sure to excise the entire ductal tree from the proximal nipple region out to the distal branches which may or may not have passed the lymph node, depending on the age. See Video 1 for rat mammary fat pad removal. Mammary development varies slightly among strains of rats. We exclusively use Sprague-Dawley rats purchased from Charles River Labs that are bred in-house at VARI (Figure 2). Refer to Filgo et al.",
    "(2016) for approximate mammary tree size at specific ages in Harlan Sprague-Dawley rats (Filgo et al., 2016) which is another commonly used rat strain. Keep in mind that the older the rat, the more developed the ductal tree and the more epithelial cells you will be able to isolate. Unfortunately, we observe decreased percent survival of digested cells from older rats compared to younger rats using this protocol (see Table 1). The decreased viability affects how many cells can be negatively selected. The fourth mammary fat pad is the largest and easiest fat pad to remove, but any fat pad may be substituted. Note that the first, second, fifth, and sixth fat pads are near muscle, and muscle contamination is not accounted for in our flow cytometry gating strategy.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Aseptic removal of the 4th mammary fat pad from a wild-type Sprague Dawley rat. (Use of animals in this protocol was approved by the Institutional Animal Care and Use Committee at Van Andel Research Institute under AUP #19-02-007.)imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3818/bioprotoc-10-22-3818-g002.jpgFigure 2. Rat mammary fat pad development and location. A. Representative carmine stained whole-mount images of the fourth mammary fat pad from female Charles Rivers Sprague-Dawley rats at postnatal days 8, 21, and 33 showing the mammary ductal tree, stroma, and lymph node. Images were taken at 4x (scale bar 1,000 µm), 2x (scale bar 1,000 µm), and 0.8x (scale bar 5,000 µm) respectively. B. Trypan blue dye was injected into the nipple of the fourth mammary fat pad following euthanasia of a 25-day old female rat to indicate the location and size of the fourth mammary fat pad (inside black oval). The top arrow points to the approximate location of the nipple where dye was injected. The bottom arrow points to an intramammary inguinal lymph node.",
    "At 25 days the ductal tree has reached the lymph node.Table 1. Average yield and viability of cells following digestion and negative selection of ONE fourth mammary fat pad from a wild-type Charles River Sprague-Dawley female imgsrc:https://en-cdn.bio-protocol.org/attached/image/20201116/20201116185953_5535.jpg From here on, perform each step in a biological safety cabinet to maintain sample sterility. Be sure to spray everything with 70% ethanol and wipe down before placing in the biosafety cabinet.Mince the fat pad with sterile scalpels in a sterile 100 mm plate in a crosswise pattern until glands are rendered into a paste.Transfer the minced pad to a 50 ml conical tube.Dilute 1-part 10x gentle collagenase/hyaluronidase mixture with 9 parts complete EpiCult B medium supplemented with 5% FBS into new 50 ml centrifuge tube. Add 10 ml per fat pad.Fat pads from older rats have also higher adipocyte content; therefore, it is advisable to only digest one fat pad per one reaction (one reaction = 10 ml of complete EpiCult B + gentle collagenase/hyaluronidase).Two fat pads from a rat less than 30 days old can be combined into one reaction.Incubate mammary pads overnight, or 16 h, in a cell culture incubator – no rotating or shaking is required.The following day make up HF solution and put on ice.Vortex the digested samples for 10 s on high power.Centrifuge the cells at 350 x g for 5 min. There should be three layers in the conical tube: a pellet of cells at the bottom that contains stromal, epithelial, hematopoietic, and endothelial cells, a liquid middle, and an adipocyte layer at the top. See Figure 3.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3818/bioprotoc-10-22-3818-g003.jpgFigure 3. Digested and centrifuged mammary fat pad. Representative image of the three layers present following centrifugation of a digested mammary fat pad.",
    "Hold the tube at a 45° angle, use a glass Pasteur pipette, and carefully vacuum suction out the adipocyte and the liquid middle layers while avoiding the pellet. We recommend vacuuming the supernatant from the top down with the pipette to ensure as much of the fat as possible is removed. For this and subsequent steps, do not get too close to the pellet while vacuuming out the waste because the pellet is comprised of a heterogenous mix of cells and is not densely packed like tissue culture cell line would be.Resuspend the pellet with 8 ml of a 1:4 mixture of cold HF and ammonium chloride (thaw ammonium chloride overnight at 2-8 °C).Centrifuge the cells at 350 x g for 5 min and discard the supernatant.Generation of a single cell suspension from dissociated rat mammary tissueAdd 4 ml of pre-warmed 0.05% Trypsin-EDTA to the digested mammary cells.Gently pipette up and down for 1-3 min. The sample should become very stringy due to lysis of dead cells and the release of DNA.Add 10 ml of cold HF and spin at 350 x g for 5 min. Remove as much of the supernatant as possible and discard.Add 2 ml of pre-warmed dispase (thaw overnight at 2-8 °C) and 200 μl of 1 mg/ml DNase I.Pipette the sample for one minute to further dissociate cell clumps. The sample should now be cloudy.Dilute the cell suspension with an additional 10 ml cold HF.Filter the cell suspension through a 40 µm cell strainer into a new 50 ml centrifuge tube. Take an aliquot of cells to count.Centrifuge at 350 x g for 5 min and discard the supernatant.While the sample is centrifuging, count cells with trypan blue.",
    "Take the viable cell count to prepare cells for flow analysis OR take the total cell count to continue with dead cell removal and negative selection to isolate mammary epithelial cells for cell culture.Dead cell removalNote: It is important to remove dead cells using the Miltenyi dead cell removal kit before negative selection to improve selection efficiency and column binding. Dead cells can non-specifically bind the anti-biotin microbeads. Prepare 1x binding buffer by dilution of 20x binding buffer stock solution: per 1 x 107 total cells, dilute 0.25 ml of 20x stock with 4.75 ml of sterile double distilled water.Resuspend 1 x 107 total cells in 100 µl dead cell removal microbeads.Mix well and incubate for 15 min at room temperature (RT).Put an LS column in the QuadroMACS magnetic field.Prepare the LS column by rinsing with 3 ml 1x binding buffer. One LS column can bind up to 1 x 108 dead cells and 2 x 109 total cells.Adjust the cell suspension to 1 x 107 cells/ml with 1x binding buffer.Pipette the cell suspension into the column and let the live cells flow through.Rinse the column with 4 x 3 ml 1x binding buffer. Collect the effluent as the live cell fraction.Spin down the sample at 300 x g for 10 min.Proceed to negative selection.Negative selection of CD24+/CD29+ cellsAdjust cell count to 1 x 106 cells/40 µl using selection buffer.Label the cells with CD31 and CD45 biotinylated antibodies: 5 µl (0.15 µg) for every 1 x 106 cells for 10 min at 2-8 °C.Wash cells with 2 ml of ice-cold selection buffer per 1 x 107 cells.Centrifuge at 300 x g for 10 min.Aspirate supernatant completely and discard.Resuspend the pellet in 80 µl ice-cold selection buffer per 1 x 107 cells.",
    "Add 20 µl of anti-biotin microbeads per 1 x 107 total cells.Mix well and incubate for 15 min at 2-8 °C.Wash cells with 2 ml of ice-cold selection buffer per 1 x 107 cells.Centrifuge at 300 x g for 10 min.Aspirate supernatant completely and discard.Resuspend up to 1 x 108 cells in 500 µl ice-cold selection buffer.Place a new LS column in the magnetic field of a QuadroMACS separator.Prepare the column by rinsing with 3 ml of buffer.Pipette the cell suspension onto the column and collect flow-through containing unlabeled cells–this elute will contain CD29+, CD24+, and stromal cells.Wash the column with 3 x 3 ml of buffer.Collect unlabeled cells that flow-through and combine with the effluent from Step D15.If the magnetically labeled CD45+ and CD31+ cells suspended in the column are required, pipette 5 ml of selection buffer onto the column and immediately flush out the cells by firmly pushing the plunger into the column.Generation of fibroblast cell linesImmediately after negative selection, plate 0.5 ml of cell suspension into a T25 flask in 4 ml fibroblast media containing gentamicin. Gentamicin is toxic to primary epithelial cells and embryonic fibroblasts while post-natal derived fibroblasts are routinely grown in media containing the antibiotic (Alfonso et al., 1990        ; El          Mouedden et al., 2000        ).If the use of gentamicin is experimentally undesirable, you can also separate fibroblasts from epithelial cells by differential attachment (Smalley et al., 2012        ):Plate 0.5 ml cell suspension and allow fibroblasts to adhere to the plate for 1 h.Aspirate and discard cell suspension solution, which will contain all non-attached cells.Wash the plate 1 x with enough media to cover the bottom of the plate.Aspirate and discard the media.Add 4 ml fibroblast media and allow fibroblasts to grow.",
    "Note that there may be epithelial contamination in your fibroblast culture with this method. Multiple rounds of the differential attachment procedure will help to purify the culture.Generation and maintenance of MEC cell linesTo deplete fibroblasts, plate CD24+/CD29+ cells isolated from the negative selection in ultra-low attachment (ULA) plates in MEC media for 48 h. Fibroblasts will die by anoikis under these conditions. You can plate up to 2 million cells in one well of a 6-well ULA plate.After 48 h, check for living cells, which will be in macroscopically visible colonies. Single cells indicate failure of the cells to adapt to ULA conditions and are likely dead.At this time, change media on the cells:Pipette the spent media and cells into a 15 ml conical tube.Wash the ULA plate 1 x with PBS and add that to the cells from Step F3a.Centrifuge cells at 350 x g for 3 min.Aspirate the supernatant and discard.Resuspend the cells in MEC media + 10 µM Y-27632 in an ULA plate. Y-27632 is a ROCK inhibitor that prevents luminal cells from apoptosing by anoikis under low attachment conditions and prevents luminal cells from undergoing apoptosis before they can attach in 2D or 3D culture.We maintain the cells in ULA plates until ready to use in an experiment. Primary MECs in our hands only survive to passage 4 or 5, so plan timing of experiments carefully.Change media every two days (except weekends).When colonies range in size between 100-200 µm, they need to be split or the cells in the center of the colony will die.To split colonies for maintenance or an experiment:Pipette spent media and cells into a 50 ml conical tube.Wash the ULA plate 1 x with PBS and add that to the cells from Step F7a.",
    "Centrifuge the cells at 350 x g for 3 min.Aspirate the supernatant and discard.Add 4 ml of 0.25% trypsin to the cell pellet.Pipette up and down 20 x.Add 10 ml of HF to neutralize the trypsin.Centrifuge the cells at 350 x g for 3 min.Aspirate the supernatant and discard.Add 2 ml dispase to the cell pellet.Pipette up and down 20 x.Add 10 ml of HF to neutralize the dispase.Centrifuge the cells at 350 x g for 3 min.Aspirate the supernatant and discard.Resuspend cells in growth media + 10 µM Y-27632.Plate in an ULA plate or on a collagen coated plate.To separate luminal and basal cells grown on collagen coated plates, use differential trypsinization:Wash the culture plate 1 x with PBS.Aspirate the PBS and discard.Add 0.05% trypsin-EDTA to the cells.After 5 min in trypsin, collect cells that have detached from the flask into a 50 ml conical tube.Wash plate 1 x with media containing FBS to neutralize the trypsin.Add the wash to the trypsinized cells.Add MEC media + 10 µM Y-27632 back to the plate. These are the strongly adherent luminal cells.Centrifuge the trypsinized cells at 350 x g for 3 min.Aspirate the supernatant and discard.Resuspend the cells in MEC media + 10 µM Y-27632.Plate the cells into a new collagen coated plate. These are the loosely adherent basal cells.Collagen coating – thin coating procedureNote: The protocol for isolating rat collagen was published by Pacak et al. in 2014. Note that the collagen obtained using the Pacak protocol is denatured. We have found that while rat MECs can attach to plastic tissue culture surfaces, they tend to peel off the plate in sheets with even the slightest disruption.",
    "Because mammary stroma is highly enriched in collagen, we coat our plates with a thin coat of rat skin collagen to which the cells can make much stronger attachments. MECs from our rats prefer rat skin collagen to commercially available rat tail collagen, although this can be used as a substitute. Tissue culture plates, chamber slides, glass coverslips, etc. can be coated with collagen. We mass coat many plates at one time and store them at 4 °C for 1 year. Protect both the collagen and collagen-coated plates from light. Dilute the collagen to 50 µg/ml in sterile-filtered 20 mM acetic acid at the final volume needed.Pipette the collagen/acetic acid solution onto a tissue culture plate, dish, or flask using enough solution to cover the bottom surface.Gently rock the tissue culture vessel to make sure the entire surface where cells will grow is covered with the solution.Incubate in a biological safety cabinet at RT for 1 h protected from light.Aspirate the solution from the tissue culture vessel and discard. The aspirated waste should still be liquid, not solidified. The aspirated waste should be almost equal in volume to the input volume. A thin, invisible, coat of collagen will remain on the plastic surface of the tissue culture vessel.Wash the tissue culture vessel with an equal volume of 1x PBS 2-3 times to remove any traces of acetic acid. Discard all waste.Use the tissue culture vessel immediately or parafilm the edges and store at 4 °C for 1 year protected from light.Flow cytometry analysisAdjust cell count to 1 x 107 cells/ml using HF buffer + 0.01 mg/ml DNase I.Aliquot 100 µl (1 x 106 cells) volumes into 15 ml round bottom polystyrene tubes.",
    "Add the indicated microgram amount of antibody found in Table 2 to each sample – the amounts were determined by titrating each antibody for optimal signal to noise ratio.It is highly recommended to use fluorescent minus one (FMO) controls to set gates and compensation controls to prevent spillover from all fluorescent channels in use for each experiment.Table 2. bAntibodies for flow cytometry imgsrc:https://en-cdn.bio-protocol.org/attached/image/20201116/20201116191724_7193.jpg  Vortex 3 s.Incubate for 30 min at RT.Add 3 ml HF (no DNase I) to the cell/antibody mix and centrifuge at 300 x g for 10 min.Decant supernatant and discard. There should be a visible cell pellet at the bottom of the tube. Do NOT aspirate out the supernatant.Vortex the cell pellet for 3 s.Add 300 µl HF + DAPI (10 mg/ml) to the cells and filter through a CellTrics cell strainer.Collect 30,000 single, live, CD31-, CD45- events on the CytoFLEXS and analyze using FlowJo. ImmunofluorescenceNote: The below procedure describes IF of cells in an eight well chamber slide, but it can be modified for cells attached to other surfaces including glass coverslips. The important thing to remember is to adjust volumes according to surface area. Cell density must be determined empirically as luminal cells are much smaller than basal cells or fibroblasts. Be very GENTLE when pipetting anything onto the cells because MECs detach easily, even when attached to collagen. Slowly add solution to wells by touching the pipette tip to the side wall of a chamber well. Plate 2 x 104 cells into one well of an eight well chamber slide.Use a chamber slide coated with collagen for MECs.Allow the cells to attach overnight in a tissue culture incubator.Wash each well 3 x with 200 µl RT PBST. Discard washes.Fix with 4% formaldehyde (200 µl/well) at RT for 15 min.",
    "Pipette off the formaldehyde from the cells and put into a labeled waste container for proper disposal.Fix with ice cold methanol for 3 min (200 µl/well).Aspirate the methanol and discard.Add 200 µl/well blocking buffer.Incubate 1 h RT.While the cells are incubating in blocking buffer, dilute the SMA-488 antibody 1:100 in antibody dilution buffer. Place the diluted antibody on ice and protect from light.Aspirate the blocking buffer.Add 100 µl of diluted SMA-488 antibody to each well.Incubate for 2 h RT in the dark.Wash 3 x with 200 µl/well PBST. Discard washes.Add 200 µl/well DAPI, diluted 1:1,000 in antibody dilution buffer, RT for 10 min in the dark.Wash 3 x with 200 µl/well PBST. Discard washes.Gently remove the media chamber and glue off the slide.Pipette 100 µl of ProLong Gold mounting reagent onto the cells.Immediately place a glass coverslip onto the mounting media, making sure that all the cells are covered and that there are no air bubbles.Allow the mounting media to cure overnight at RT in the dark.Image the next day, if possible, using a fluorescent microscope. We use a laser scanning confocal microscope to acquire z-stacks which allows us to analyze the entirety of a sample. Furthermore, we use z-stacks to generate maximum intensity projection images in FIJI.Store the slides in a dark place. The fluorescent signal lasts 1-2 weeks if stored at 4 °C."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}