{
  "id": 15175,
  "origin_website": "Jove",
  "title": "Isolating, Sequencing and Analyzing Extracellular MicroRNAs from Human Mesenchymal Stem Cells",
  "procedures": [
    "NOTE: Mesenchymal stem cell growth medium (MSC media) is prepared beforehand as indicated in the Table of Materials.\n1. Cell culture\nNOTE: Human mesenchymal stem cells can be obtained from the bone marrow, adipose tissue or other sources11. Alternatively, hMSCs can be bought through a supplier. The BMSCs used in this protocol were derived from the bone marrow of patients and bought from a company.\nThaw 1 x 106 BMSCs into a T175 flask containing 20 mL of MSC media. Incubate the cells at 37 °C with 5% CO2 and replace the media every 2-3 days until 80% confluency.\nWash the cells with 5 mL of 1x PBS and discard the PBS.\nDetach the cells by adding 5 mL of 0.05% Trypsin-EDTA and incubating the cells for 5 min at 37 °C. Tap the sides of the flask to facilitate detachment.\nAdd 15 mL of MSC media to inactivate the trypsin, detach the cells from the surface, and pipette up and down to obtain single cell suspensions.\nCollect the cells in a 50 mL tube and spin down for 5 min at 300 x g to pellet the cells.\nResuspend the cells in 1 mL of MSC media and count the cells using a hemocytometer.\n\tNOTE: Primary human bone marrow MSCs at 80% confluency in a T175 flask is around 2 x 106 cells.\nPlate hMSCs at 2,000 cells/cm2 in fresh MSC media in 5 T175 flasks. Grow the cells at 37 °C with 5% CO2 and replace the media every 2-3 days until 5 flasks of 90% confluent T175 flasks are obtained.\n2. EVs and RNA-associated biomolecules collection",
    "NOTE: EV collection media is prepared beforehand (Dulbecco's Modified Eagle's Medium [DMEM] with 10% fetal bovine serum [FBS] and 1% penicillin/streptomycin [P/S]). EV collection media is normal MSC media, but prepared with commercial EV-depleted FBS (Table of Materials). This is to avoid bovine exRNA contamination from FBS, which normally contains exRNAs associated with EVs, ribonucleoproteins, and lipoproteins. For small RNA library preparation, exRNAs derived from 5 confluent flasks of MSCs are required to enable library construction.\nWash the cells 3x with 20 mL of PBS per T175 flask. Add 20 mL of EV collection media per confluent T175 flask of MSCs and incubate at 37 °C with 5% CO2 for 48 h.\nCollect the media and centrifuge the media for 10 min at 300 x g and 4 °C.\nCollect the supernatant and centrifuge the media for 20 min at 2,000 x g and 4 °C.\nCollect the supernatant and centrifuge the media for 30 min at 15,500 x g and 4 °C. Then collect the supernatant.\nTransfer the media to ultracentrifuge tubes and pellet the exRNAs for 90 min at 100,000 x g and 4 °C. A fixed angle rotor is used here and the pellet is anchored to the side of the tube. Mark the side of the lid and draw a circle on the side of the tube where the pellet is expected.\nRemove the supernatant, dry the inside of the tube by inverting the tube on absorbent paper and use small pieces of absorbent paper to remove the liquid inside the tube without touching the bottom of the tube. Resuspend the pellet in 200 μL of PBS by vortexing for 30 s and pipetting up and down 20x.\nAssess the EVs and biomolecules with nanoparticle tracking analysis (NTA) (Figure 2).",
    "NOTE: The EVs and biomolecules can be assessed with nanoparticle tracking analysis (NTA), dynamic light scattering (DLS) or transmission electron microscopy (TEM)12.\nStore the EVs and biomolecules at -80 °C until further downstream experiments.\n\tNOTE: If EVs are going to be used for functional studies, 20% glycerol must be added to protect them from rupturing. The cells can be collected using standard procedures if necessary.\n3. EVs and RNA-associated biomolecules collection of differentiated cells\nNOTE: EVs and RNA associated biomolecules can also be collected from the cell culture media while the cells undergo differentiation. The example depicted in the protocol describes osteoblastic differentiation and exRNA collection at day 0 and 7 of differentiation. If no differentiation is required, then skip Section 3 and go to Section 4.\nPrepare osteoblastic differentiation media (DMEM with 10% FBS, 1% P/S, 10 mM β-glycerophosphate, 10 nM dexamethasone, 50 μM ascorbate-2-phosphate, and 10 mM 1.25-vitamin-D3) fresh every time.\nOnce MSCs are 80% confluent, change the MSC media to osteoblastic differentiation media.\nReplenish the osteoblastic differentiation media after 2-3 days.\nOn day 5 of differentiation, remove the media and wash the cells 3x with 20 mL of PBS per T175 flask.\nAdd 20 mL of EV collection media containing 10 mM β-glycerophosphate, 10 nM dexamethasone, 50 μM ascorbate-2-phosphate and 10 mM 1.25-vitamin-D3 per confluent T175 flask of MSCs. Incubate the cells at 37 °C with 5% CO2 for 48 h to ensure continued differentiation while collecting the EVs and biomolecules.\nCollect the media on Day 7 and proceed to isolate the EVs and biomolecules as described in steps 2.2-2.6.\nFor quality control, seed cells in 96-wells or 6-wells to assess differentiation using an alkaline phosphatase (ALP) activity assay or with quantitative polymerase chain reaction (qPCR), respectively.",
    "NOTE: Figure 3 is an example showing osteogenic differentiation of the cells.\n4. RNA extraction and quality control\nThaw samples from step 2.8 on ice. Extract RNA using an RNA isolation kit (Table of Materials).\nElute the RNA from the column provided in the RNA isolation kit (Table of Materials) in 100 μL of RNase-free water.\nConcentrate the RNA through ethanol precipitation by adding 1 μL of glycogen, 10 μL of 2 M pH 5.5 sodium acetate and 250 μL of pre-chilled 99% ethanol into 100 μL of purified RNA.\nIncubate the samples at -20 °C overnight to precipitate the RNA. Pellet the RNA by centrifuging for 20 min at 16,000 x g and 4 °C.\n\tNOTE: The pellet is white due to co-precipitation with glycogen.\nRemove the supernatant and wash the RNA pellet with 1 mL of 75% ethanol. Pellet the RNA again for 5 min at 16,000 x g and 4 °C.\nRemove the ethanol and leave the lid of the RNA tube open for 5-10 min to air dry the RNA pellet. Resuspend the RNA pellet in 7 μL of RNase-free water.\nCheck the RNA quality and concentration using a chip-based capillary electrophoresis machine to detect the RNA according to the manufacturer’s protocol prior to library construction.\n\tNOTE: A representative size distribution of the RNA is shown in Figure 4.\nExtract cellular RNA using a commercial purification kit (Table of Materials) if necessary.\n5. Library construction and quality control\nNOTE: Small RNA libraries are constructed using commercial kits (Table of Materials) with adjustments due to the low RNA input. Library construction is performed on the chilled block.",
    "Chill the heating block for 0.2 mL PCR tubes on ice and pipette 5 μL of the RNA from step 4.6 into 0.2 mL RNase-free PCR tubes on a chilled block.\nDilute 3’ adaptors (1:10) in RNase-free water in a 0.2 mL RNase-free PCR tube. Add 0.5 μL of diluted adaptor and mix with 5 μL of RNA by pipetting up and down 8x and centrifuge briefly to collect all the liquid at the bottom of the tube.\nIncubate the RNA and 3’ adaptor mix at 70 °C for 2 min in a preheated thermal cycler and then place the sample back on the chilled block.\nAdd 1 μL of ligation buffer, 0.5 μL of RNase inhibitor, and 0.5 μL of T4 RNA ligase (deletion mutant) into the RNA and 3’ adaptor mixture. Mix by pipetting up and down 8x and centrifuge briefly.\nIncubate the tube at 28 °C for 1 h in the preheated thermal cycler.\nAdd 0.5 μL of stop solution into the sample tube with the tube staying in the thermal cycler, mix by pipetting up and down 8x and continue to incubate at 28 °C for 15 min.\nDilute 5’ adaptors (1:10) in RNase-free water in a 0.2 mL RNase-free PCR tube. Add 0.5 μL of 5’ adaptor into a separate RNase-free 0.2 mL PCR tube, heat the 5’ adaptor at 70 °C for 2 min in the preheated thermal cycler, and then place the sample on the chilled block.\nAdd 0.5 μL of 10 nM ATP, 0.5 μL of T4 RNA ligase to the 5’ adaptor tube, mix by pipetting up and down 8x and centrifuge briefly to collect all the liquids into the bottom.\n\tNOTE: Keep the 5’ adaptor on chilled block as much as possible.",
    "Add 1.5 μL of the 5’ adaptor mixture to the sample from step 5.6, and mix very gently by pipetting 8x slowly. Incubate the sample at 28 °C for 1 h in the preheated thermal cycler.\nDilute RT primer 1:10 in RNase-free water in an RNase-free 0.2 mL PCR tube. Add 0.5 μL of diluted RT primer into the sample from step 5.9, mix very gently by pipetting up and down 8x slowly and centrifuge briefly.\nIncubate the sample at 70 °C for 2 min in the preheated thermal cycler and then place the sample on a chilled block.\nAdd 1 μL of 5x first strand buffer, 0.5 μL of 12.5 mM dNTP mix, 0.5 μL of 100 mM dithiothreitol (DTT), 0.5 μL of RNase inhibitor, and 0.5 μL of reverse transcriptase. Mix very gently by pipetting up and down 8x slowly and centrifuge briefly.\nIncubate the sample at 50 °C for 1 h in the preheated thermal cycler to obtain cDNA.\nAdd 4.25 μL of ultrapure water, 12.5 μL of PCR mix, 1 μL of index primer, and 1 μL of universal primer into the cDNA. Mix by pipetting up and down 8x and centrifuge briefly.\nPlace the sample in a thermal cycler and set up the cycler as follows: 98 °C for 30 s; 15 cycles of 98 °C for 10 s, 60 °C for 30 s and 72 °C for 15 s; and end the cycle with 72 °C for 10 min.\n\tNOTE: The prepared library can be stored at -20 °C for one week.\nPurify the RNA library by separating the library on a DNA gel and cutting the gel (gel extraction) between 140 bp and 160 bp and eluting the library from the gel following the protocol given by the library construction kit.",
    "NOTE: In this study, the prepared library from step 5.15 is loaded onto a commercial gel (Table of Materials) and the library between 140 bp and 160 bp is purified out by an automated DNA size fractionator (Table of Materials) according to the manufacturer’s protocol.\nConcentrate and wash the library from step 5.16 using a column-based PCR purification kit (Table of Materials) and elute the library in 10 μL RNase-free water finally.\nLoad 1 μL of the purified library onto a DNA chip (Table of Materials) to check the size of the library following the manufacturer’s protocol.\nDilute 1 μL of the purified library (1:1000) in 10 mM pH 8.0 Tris-HCl with 0.05% polysorbate 20 and quantify the library by qPCR using a commercial library quantification kit to quantify the library concentration using the DNA standards in the kit.\nPool equal amounts of the libraries according to the requirements of the sequencing machine and sequence on a high-throughput sequencing system.\n\tNOTE: The library construction of cellular RNA can be done using the same kits by following standard protocol of the kits.\n6. Bioinformatics pipeline\nNOTE: This is an in-house pipeline and the programs used here are listed in the Table of Materials. \nTrim away low-quality reads and remove adaptor sequences from the raw reads.\nMap the clean reads to different kinds of RNAs.\n\t\nAnnotate tRNAs by allowing two mismatches because the heavily modified tRNA sequences cause frequent base misincorporation by reverse transcriptase.\nAnnotate miRNAs by mapping to human miRNAs from miRBase v21 allowing zero mismatches. Since miRNAs are subject to A and U nontemplated 3’end additions, sequences that do not map are 3’trimmed of up to three A and/or T nts after which reads are mapped to human miRNAs and other miRNAs from miRBase v21 allowing zero mismatches.",
    "Annotate to other relevant small RNAs (snRNA, snoRNA, piRNA, and Y RNAs) by allowing one mismatch.\nMap the remaining unmapped reads to long RNA datasets (rRNA, other RNA from Rfam, and mRNA) to assess degradation.\nAnnotate the sequences to the human genome.\nAnnotate the sequences to bacterial genomes.\nNormalize miRNA expression using the following formula: miRNA counts / the total counts of all mapped miRNAs) x 106.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}