{
  "id": 5924,
  "origin_website": "Bio",
  "title": "Real-time Analysis of Auxin Response, Cell Wall pH and Elongation in <em>Arabidopsis thaliana</em> Hypocotyls",
  "procedures": [
    "Hypocotyl elongation measurementSurface sterilize Col-0 seeds (or any other genotype of your interest) by chlorine gas (Recipe 1) overnight. Plate the sterilized seeds on the AM+ medium (Recipe 2). Stratify for two days at 4 °C in the dark, then place vertically under light to cultivate for around 6 h in a growth room at 21 °C. Wrap with aluminum foil and grow for another 66 h vertically at 21 °C.Prepare a depletion plate with 5 ml depletion medium (DM, Recipe 3) in a Falcon 60 x 15 mm dish. After solidification, place cellophane foil onto the surface. Damp the cellophane foil with liquid depletion medium solution.Place a dissecting microscope in a dark room and cover the illumination with a green filter made of 8 layers of green office foil (Figure 1). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180103/20180103172455_2137.jpgFigure 1. Binocular dissecting microscope with a green filterUncover the Petri dishes with seedlings and select the seedlings with similar hypocotyl length excluding the longest and shortest ones. Decapitate the seedlings right below the apical hook and before the shoot-root junction to get a hypocotyl segment by cutting them on the surface of the agar using a very sharp razor blade. Prepare 6-8 segments for each treatment. Using sharp forceps, transfer the segments onto the cellophane foil in the depletion plate without squeezing them, the sample preparation procedure is depicted in Figure 2. Keep in darkness for 30-60 min. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180103/20180103172529_1752.jpgFigure 2. The sample preparation procedureAfterwards, transfer the segments by flipping the cellophane foil onto a treatment plate with the depletion medium supplemented with the desired treatment (Figure 2), in our case 10 µM 3-Indoleacetic acid (IAA) and the mock control (Ethanol equivalent).Immediately place the treatment plates on a flatbed scanner, imaging through the layer of the phytagel.",
    "A wet black filter paper is placed into the lid of the dish to improve the contrast of the image. Scan the samples in the 8-bit grayscale and at 2,400 dpi every 10 min automatically using the AutoIt program (see Supplemental file 1[href=https://os.bio-protocol.org/attached/file/20171227/Supplemental file 1.docx]).Measuring the TIR1/AFB-Aux/IAA dependent response using the DR5::LUC marker linePrepare the 6-10 decapitalized segments of DR5::LUC marker line for each treatment, as described before, on depletion medium. Add around 50 µl of 1 mM D-luciferin dissolved in 1x PBS and immerse the segments entirely for 30 min. Prepare the treatment solution (DM with desired drugs)–in our case, DM + mock or DM + 10 µM IAA. Pour 3 ml medium into each well of a 12 wells tissue culture plate and let the medium solidify; four wells can be imaged simultaneously.Note: There is no D-luciferin in the treatment solution, the substrate originates from Step B1. This is sufficient for approx. 5-h imaging. Alternatively, one can put D-luciferin in the treatment solution for a longer time of imaging.Using the cellophane foil, transfer the segments onto the surface of the treatment medium and remove the foil.Immediately image in a dark box (Figure 3) with a Photometric Evolve® EMCCD camera equipped with a 17 mm fixed lens/0.95 and an additional 125 mm lens. Set the multiplier EMCCD gain to 150 and the exposure time to 110 sec, and image every 2 min.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180103/20180103172657_3924.jpgFigure 3. Dark box with a Photometric Evolve EMCCD cameraImaging the apoplastic pH using apo-pHusion apoplastic pH marker linePrepare the decapitated hypocotyl of the apo-pHusion apoplastic pH marker line as above.Prepare 5 ml of DM medium with or without 10 µM IAA.Transfer 5 hypocotyl segments onto the surface of the agar with the treatment. Cut out a piece of the agar with the segments using a spatula.",
    "Place the agar with the segments into the Lab-TekTM chambered cover glass so that the segments are placed between the cover glass and the agar. When using the 2-well chambered glass, a treatment and a control sample can be imaged simultaneously. Alternatively, the treatment can be very carefully pipetted to the hypocotyl segments during imaging. Then ~50 μl DM with the treatment can be used, but one must be extremely careful not to move the sample during imaging.Using a confocal microscope with a 20x/0.8 Plan-Apochromat M27 objective, set the position of each segment using the position manager so that the apical region of the hypocotyl segment is imaged. Image 5 z-sections, z-thickness matched to the pinhole size, of each hypocotyl segment.Set the microscope for simultaneous imaging of GFP and RFP by exciting using 488 and 555 nm diode lasers, and splitting the emitted light with a short pass 550 nm and long pass 560 nm filters, 16 bits per pixel. Image all positions every 5 min."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}