{
  "id": 9094,
  "origin_website": "Jove",
  "title": "Assessing Primary Neurogenesis in Xenopus Embryos Using Immunostaining",
  "procedures": [
    "All animal experiments were approved from the University of Manchester Animal Welfare Centre and were covered by a UK Home Office Project License.\n1. Collection and Fixation of Xenopus Embryos\nPrepare Reagents and Materials for Experiments.\n\t\nPrepare 10x Marc's Modified Ringers (MMR) by dissolving 56.5 g of NaCl in approximately 800 ml ultrapure water and adding stock solutions of 1 M KCl, 1 M MgSO4, 1 M CaCl2, and 1 M HEPES pH 7.4 to achieve a final concentration of 20 mM KCl, 10 mM MgSO4, 20 mM CaCl2, 50 mM HEPES. Adjust pH to 7.4 by 10 M NaOH and then adjust the final volume to 1 L.\nSterilize the 10x MMR solution by autoclaving at 121 °C for 20 min on a liquid cycle. Upon using, dilute with ddH2O to 0.1x final concentration and add 20 mg/L gentamycin to inhibit microbial growth.\nMake 10x TBS solution by mixing 24 g Tris-HCl, 5.6 g Tris-base, 88 g NaCl and dissolving in approximately 900 ml ultrapure water. The final solution will have a pH value around 7.6. Adjust with either 10 M NaOH or concentrated HCl to achieve a final pH of 7.6 and final volume to 1 L.\nUpon using, make 1x TBS by diluting 1 part of 10x TBS solution with 9 parts of ultrapure water.\nMake 10x MEM Salt by dissolving 209.2 g MOPS in approximately 800 ml ultrapure water and adding stock solutions of 0.5 M EGTA and 1M MgSO4 to achieve a final concentration of 20 mM EGTA, 10 mM MgSO4. Adjust pH to 7.4 by 10 M NaOH and then adjust the final volume to 1 L.",
    "Sterilize the MEM salt solution by autoclaving at 121 °C for 20 min on a liquid cycle (the solution may turn yellow by a few months of storage at room temperature or after it has been autoclaved, but this change in color does not affect its use). However, do not use the solution after prolonged storage (more than 6 month).\nMake 1x MEMFA solution by diluting 1 part of MEM Salts, 1 part of 37% formaldehyde with 8 parts of Ultrapure water (v/v, stable at 4 °C for at least 1-2 weeks).\nPrepare 4% paraformaldehyde in TBS (for subsequent staining involving phalloidin) by dissolving 4 g of paraformaldehyde powder in 100 ml of 1x TBS solution Heat the solution to 60 °C and add a few drops of 10 M NaOH to assist dissolving. Aliquot in 5-10 ml volume and freeze in -20 °C. Do not re-freeze once thawed.\n\t\tCAUTION: Paraformaldehyde powder is an irritant and is toxic if inhaled, thus the weighing step should be performed in a fume hood.\nLabel as many 4 ml glass vials with screw caps prior to sample collection.\nPrepare 15% gelatin/15% sucrose by pouring 20 ml of 40% fish gelatin (pre-heat in a 50 °C water bath) into a 50 ml centrifuge tube. Add 8 g of sucrose and fill the tube to the 50 ml line with 1x TBS.\nPlace the gelatin tube on a rotary mixer or rolling bed to mix overnight at room temperature. This gelatin solution is stable at 4 °C for 1 week. Do not use expired solution and do not freeze-thaw.\nPrepare and Fix X. laevis or X. tropicalis Embryos Cultured to Desired Stages.\n\t\nCulture the fertilized X. laevis or X. tropicalis embryos in 0.1x MMR with gentamycin until the desired stages.",
    "NOTE: Generally, collect embryos between stages 23 and 40. Later collection of embryos after stage 40 is possible, especially when observing axonal growth from the spinal cord, but keep in mind that additional gelatin penetration time may be required. The embryos may be wild-type, transgenic, mutant, inhibitor-treated, Morpholino (MO)-injected, or electroporated 23,24.\nCollect 20-50 embryos in each 4 ml glass vial, remove as much medium as possible and replace with MEMFA.\n\t\tNOTE: If subsequent staining involves phalloidin, use 4% paraformaldehyde instead of MEMFA since commercial supplied formaldehyde solutions usually contain up to 10% methanol as a stabilizer that will interfere with phalloidin staining.\nFix overnight at 4 °C or, if in an urgency, at room temperature for 2 hr on a rotary mixer. The embryos will be stable in fixation solution for at least 1 week at 4 °C.\nAfter fixation, wash the embryos 3 times for 20 min using 1x TBS with 0.05% Triton X-100. After the final wash, remove as much TBS-Triton as possible and add 3 ml of 15% gelatin/15% sucrose into each vial.\nPlace the vials on a roller bed overnight at room temperature. For embryos older than stage 40, use at least 24 hr of penetration time. After penetration, proceed immediately to section 2.2 on the next day.\n2. Mounting and Cryosectioning of Xenopus Embryos\nPrepare Reagents and Materials for Experiments.\n\t\nTake one box of positively charged slides, ideally unopened.\n\t\tNOTE: If opened, keep the slides in a dry condition (such as a dry box) and use within 1 month to ensure the static charge on the slides is maintained. Do not use expired slides since samples will fall off during immunostaining.",
    "Pre-chill the cryostat chamber to -30 °C. Set the instrument parameters as -35 °C for microtome and 12 µm section thickness. Install the thick cover glass plate onto the stage and let the cryostat equilibrate for at least 30 min before section starts.\nPrepare painting brushes for moving section strips, keep inside the cryostat chamber.\nPrepare pencils for writing on slides, put them at room temperature.\nWear gloves during cryosection. Do not use bare hands.\nMounting Xenopus Embryos\n\t\nCarefully aspirate 5-10 embryos out of the glass vial using a plastic or glass pipette without introducing air bubbles. Transfer the embryos into the mounting chamber and observe under a stereoscope. Fill up the mounting chamber with gelatin solution to ensure the rigidity of the section block.\nArrange the embryos as per Figure 1 using a pair of fine-tip forceps. Mark the orientation of heads by drawing an arrow on the rim of the chamber using a cryogenic-compatible marker. For multiple groups of embryos, write down the description of each group on the rim of the corresponding chamber as well.\nCarefully place the chamber horizontally in a foam box half-filled with dry ice and close the lid. Observe the mounting chamber freeze in 5-10 min. Process each chamber serially (i.e. place the previous chamber onto dry ice before proceeding to the next one) as this will leave sufficient time for each chamber to freeze and prevent the dry ice box to become overcrowded.\n\t\tNOTE: Frozen mounting chambers do not need to stand horizontally and can be stacked up inside the box.\nProceed with cryosectioning or, if required, keep frozen samples at -80 °C for at least 1-2 week without losing immunogenicity.\nCryosection of Mounted Xenopus Embryos",
    "Remove a frozen sample block from the chamber by pressing the bottom of the chamber using a blunt stick (such as a pencil).\nAdd several drops of tissue-freezing medium, (a polyethylene glycol and polyvinyl alcohol-containing medium) onto the sample holding disc and mount the sample block with the anterior end of the embryos points up (Figure 2). Allow the mounted- block stand inside the cryostat chamber for approximately 1 min or until the tissue-freezing medium becomes opaque.\nImmediately install the sample holding disc onto the microtome with the bottom side of the sample block facing up. Trim off a portion of the sample block using a blade when the sample block is still relatively \"soft\" to reduce the length of each section (if desired). Leave the sample holding disc on the microtome for at least 5 min to allow its temperature to reach equilibrium.\nGradually trim the sample block down until the heads of tadpoles are visible through the translucent gelatin. To increase trimming speed, apply a higher (thicker) setting of section thickness (e.g. 20-25 µM) at this stage (such as enabling the \"trim\" option) but not too thick because sample block can fall off from the sample holding disc. Observe the performance of cryostat, such as the sharpness and angle of the blade at this stage to ensure the generation of a long strip of subsequent sections.\nOnce the tadpole heads become visible, adjust the settings of the cryostat back to normal (e.g. 10-12 µM) and clean both the microtome and stage using a paint brush. Gently make 2-3 sections as a trial using the hand wheel setting (do not use the motorized setting) to make sure that finished slices can form strips, not overlapping or sticking to the blade.",
    "Continue trimming until the heads of tadpoles are almost exposed (this may need some experience but achievable). Brush off any remnant sections on the stage and the collection of sample sections will begin.\nMake approximately 10-15 sections and let them form a long strip.\nFlip over the thick cover glass plate to the side and gently remove the strip from the blade using a fine-tip paint brush and arrange it on the stage with long axis parallel to the blade.\nPick one positively charged slide at room temperature, label it with a pencil (which will not be washed off during subsequent staining treatments), press it quickly but firmly onto the strip with the label side facing down and remove the slide from the cryostat chamber. If done correctly, the strip should immediately stick to the positively charged slide (Figure 3A).\nRepeat this step to have 20-30 slices on each slide and arranged in parallel (Figure 3B). This is sufficient to cover the entire brain region of X. tropicalis embryos and most of forebrain and midbrain regions of X. laevis embryos.\nAir-dry the slides for 10 min, proceed immediately or, store the slides in a slide box at -80 °C for at least 3-6 months without losing immunogenicity.\n3. Immunostaining of Sectioned Xenopus Embryos\nPrepare Reagents and Materials for Experiments.\n\t\nPrepare 0.05% TBS-Triton X-100 by adding Triton X-100 into 1x TBS to achieve a final concentration of 0.05%. This solution is stable at room temp for 3-4 days. Do not use expired solution.",
    "Prepare 5% heat-inactivated goat serum or 5% BSA in TBST as blocking buffer. Firstly, heat-inactivate the goat/lamb serum by placing approximately 20-30 ml of serum in a 65 °C water bath for 30-60 min. Aliquot into 1.5 ml centrifuge tubes and freeze in -20 °C. No re-inactivation is required upon using.\nDilute the heat-inactivated serum or BSA in TBST to achieve a final concentration of 5% before use.\nPrepare appropriate primary antibodies according to dilutions in blocking buffer (e.g. 1:500 anti-Sox3 10,25/1:250 anti-Myt1 26/anti-acetylated tubulin). Use approximately 100 µl of antibody solution on each slide.\nPrepare appropriate fluorescent antibodies (e.g. anti-mouse/rabbit red fluorescent dye-conjugated antibodies) in blocking buffer (usually 1:500).\n(optional) Add red fluorescent dye-conjugated Phalloidin (1:500) into secondary antibody mix to reveal actin network.\n(optional) Add DAPI (0.5 µg/ml final concentration) into secondary antibody mix to visualize nuclear localization.\nTake the anti-fade mounting medium out of the freezer and thaw in room-temperature water bath.\nImmunostaining\n\t\nRemove the frozen slides from -80 °C and place them on a piece of towel paper inside a ventilation hood for at least 1 hr to eliminate any condensed water droplets, then bake the dried slides on a 85-90 °C heat block with the slices facing up for 15 min to activate the adhesion mechanism. Finally, allow the slides cool down to room temperature (at least 10 min).\nFill the staining jar with pure acetone and incubate the slides in acetone for 10 min to remove fish gelatin. If multiple slides are to be treated, arrange them on a staining rack. Air-dry the treated-slides for 15 min in a ventilation hood. Do not re-use the acetone.",
    "Carefully draw a ring around the samples on the slide using a PAP pen without touching the samples. Ensure that the ring is self-enclosed, otherwise antibody solution will flow out during staining. Fully dry the PAP pen ring.\nFill another staining jar with 1x TBS without Triton X-100. Insert the dried-slides into the staining jar and allow rehydration for at least 1 hr. In the meantime, prepare the blocking buffer by diluting either heat-inactivated goat serum or BSA to 5% final concentration using 1x TBS with 0.05% Triton X-100.\nMake a wet box by placing 1-2 6-well plates inside a click-lock food box and fill the wells halfway with ultrapure water. Remove rehydrated slides from the staining jar and place them horizontally on the 6-well plates (without the plate lid).\nCarefully add 300-600 µl of blocking buffer inside the PAP ring. Seal the wet box by locking the lid into position and incubate at room temperature for at least 1 hr.\nDilute the appropriate primary antibodies in blocking buffer. Generally, use 100-150 µl diluted antibody solution per slide. If multiple slides are processed, scale up the volume proportionally.\nAfter blocking, carefully remove the blocking buffer from slides by aspiration and quickly add primary antibody solution to prevent dry-out, then seal the wet box and incubate at 4 °C overnight.\nOn the next day, remove the primary antibody solution from the slides by aspiration. Wash the slides by inserting into staining jars filled with 1x TBS with 0.05% Triton X-100, 3 times, 15 min each. Meanwhile, dilute the appropriate fluorescent secondary antibodies with blocking buffer (with or without DAPI or phalloidin).",
    "Carefully add 100-150 µl of secondary antibody solution onto the slides. Place the slides inside the wet box and seal the lid. Incubate the slides for 1-2 hr at room temperature.\nWash the slides in staining jars filled with 1x TBS with 0.05% Triton X-100, 3 times, 15 min each. At the final wash, thaw the anti-fade mounting medium in a 50 °C water bath for 10 min if stored at -20 °C. Cool down the mounting medium to room temperature before use.\nAdd approximately 20 µl (one drop) of mounting medium onto the slide and apply a large cover slip (at least 22 mm x 64 mm) over the samples. Observe using fluorescent or confocal microscope within 6 hr post mounting.\n\t\t\nIf imaging cannot be done on the same day, seal slides using nail polish and place them inside the wet box at 4 °C overnight.\n\t\t\tNOTE: The anti-fade mounting medium will gradually get oxidized after a few days (and turn brownish) so it is recommended to take the images as soon as possible."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}