{
  "id": 8522,
  "origin_website": "Jove",
  "title": "Stereological Estimation of Cholinergic Fiber Length in the Nucleus Basalis of Meynert of the Mouse Brain",
  "procedures": [
    "All procedures for using these animals have been approved by the Kansas City Veterans Affairs Medical Center Institutional Animal Care and Use Committee. Eighteen-month-old mice overexpressing Swedish mutant beta-amyloid precursor protein (APPswe) and their C57/BL6 WT littermates were used for the experiments. Details of breeding and genotyping is given in He et al.8.\n1. Perfusion and tissue processing\nAnesthetize mice using an intraperitoneal injection with ketamine (100 mg/kg) and xylazine (10 mg/kg). Pinch toes to confirm a lack of response before continuing9.\nTranscardially perfuse with ~50 mL of ice cold 0.1M Dulbecco's phosphate buffered saline (DPBS) followed by 4% paraformaldehyde (PFA) in 0.1M phosphate buffer (PB)10.\n\tCAUTION: PFA is toxic. Use personal protective equipment (PPE) when working with PFA.\nRemove brains10 and immerse in 4% PFA in 0.1 M PB at 4 °C for postfixation for 24 h. Wash with DPBS 3x.\nChange to 15% sucrose solution in 0.1 DPBS overnight and then 30% sucrose solution in 0.1 M DPBS for another 48 h at 4 °C.\nRemove the tissue from the sucrose solution and freeze in a cryotome chamber preset to a temperature of -20 °C. Frozen samples can be stored in sealed tubes at -80 °C until sectioning.\nEmbed tissues in optimum cutting temperature embedding medium (see Table of Materials) and mount on a specimen disc. Cut serial 30 µm thick sections in a coronal plane using a cryotome and collect all the sections consequently in 24 well culture plates filled with cryoprotectant solution (30% glycerol, 30% ethylene glycol, 40% DPBS; Figure 1A–C). Store in a -20 °C freezer.",
    "NOTE: Thicker sections (e.g., 50 µm) are preferable when feasible. Make sure that the sections are kept in cutting order and all sections are completely in cryoprotectant. A 96 well plate can be used as an alternative to 24 well plates to collect sections.\nCover the wells with plate sealer to prevent evaporation and drying. Store plates at -20 °C until further use. Sections stored at -20 °C are stable for several months for ChAT immunohistochemistry.\n2. Systematic section selection for IHC\nNOTE: A pilot study should be done to know the total number of sections required to achieve an acceptable coefficient of error (CE). The CE value is an expression of the total amount of error in the sampling procedure. The lowest value represents the minimal error and a CE value lower than 0.1 is considered acceptable by the software used here (see Table of Materials)11.\nIdentify the first and last sections for each brain by comparing morphological features with a standard mouse brain atlas such as Franklin and Paxinos. NBM begins at bregma -0.0mm and ends at -1.6 mm. Therefore, about 50 sections contain NBM. The total number of sections is one of the parameters required during stereology. The selection of every 8th section (SSF = 1/8) gave a total of 6–7 sections for the analysis and yielded an acceptable CE for both volume estimation and fiber length estimation in our pilot study.\nRandomly start with one of the first eight sections and then systemically sample every 8th section until the last posterior section containing NBM (Figure 1C).\n3. Immunohistochemistry\nTransfer the cryopreserved sections to room temperature in cryoprotectant and then 0.1M phosphate buffer (PB) in 6 well plates.\nWash 3x in PB.\nIncubate in 0.3% H2O2 in methanol for 15 min.\nWash 3x in Tris-buffered saline (TBS).",
    "Incubate in 0.25% Triton X-100 in TBS for 30 min.\nBlock with 10% normal bovine serum (NBS) in 0.1% Triton X-100 in TBS for 30 min.\nIncubate with a 1:1,000 dilution of goat anti-human ChAT primary antibodies (see Table of Materials) in TBS with 0.1% Triton X-100 and 1% NBS for 48 h at 4 °C.\nWash 3x in TBS at room temperature. Perform all further incubation and washing at room temperature.\nIncubate with biotinylated bovine anti-goat secondary antibody (see Table of Materials) for 1 h.\nWash 3x in TBS.\nIncubate with the avidin-biotin–peroxidase complex (see Table of Materials).\nWash 3x in TBS.\nDevelop using an enhanced DAB peroxidase substrate solution (see Table of Materials) according to the manufacturer's recommendations.\n\tCAUTION: DAB is a suspected carcinogen. It is toxic by contact and inhalation. Use PPE when working with DAB.\nWash the section a couple of times with distilled water and keep in Tris pH = 7.6.\nMount the sections on the gelatinized slides. All sections from one tissue can be put on the same slide. Air dry the sections, dehydrate 2x for 5 min each with 70%, 90%, 95%, and 100% ethanol, and then clear the sections with two 10 min xylene washes. Coverslip the sections using mounting medium (see Table of Materials).\n\tNOTE: The processing time of dehydration and clearing affects the thickness of the sections. Therefore, the same conditions should be used for all sections. In the current study, the mean value for the final thickness was 21.11 ± 0.45 µm.\nKeep the sections in the fume hood to dry. The dry sections are ready for stereology.\n4. Stereology",
    "NOTE: See the Table of Materials for the microscope and software used. An immersion objective with a numerical aperture (NA) > 1.2 will be useful and should be used if required. Slides should be grouped according to genotype or treatment group and coded. The complete stereology for one study should be performed by the same person and the person performing the stereology should be blind to the identity of the individual slides or group examined1,12,13.\nOpen a new study in the software. (File > New Study). A 'Study Initialization' dialog box will open. Fill out the study information, using Multi-level (Fraction Based) (Figure 2A).\nDouble click on 'Volume' under Parameters, which will open the Volume dialog box. Name the feature of interest and select 'Region Point Counting' probe. Click Next.\nDouble click on the next parameter, 'Length'.\n\t\nProvide a name of the feature (e.g., 'L') Select 'Sphere' probe and click Next.\nNext, click on the 'Study Initialization' dialog box, which will open the 'Case Initialization' box. Fill in the case information. Groups must be coded before starting the study. The total number of sections is the number of sections starting from the first section containing the area of interest to the last section containing area of interest (see step 2.1). The section sampling interval is eight, because every 8th section was selected for the IHC staining.\nClicking Next opens the 'Probe Initialization' dialog box, which will automatically set the lowest magnification for the region selection and volume estimation. Confirm the settings and check if the region of interest can be identified at the selected lower magnification. Double click on 'Volume' and fill 50,000 µm3 per point for the region volume fraction. Click Done.",
    "Under Object (High) Magnification, set Length at 63x or 100x. Double click on 'Length' to open the Length-Sphere dialog box and set the diameter of the sphere to 10 µm. Click Done.\n\tNOTE: The guard zone should be determined based on the actual thickness of the sections. The operator must check the thickness of the sections at multiple sites to avoid any damage. If necessary, adjust the guard zone thickness based on section thickness.\nSet appropriate values for frame area, frame height, guard zone, and frame spacing.\n\tNOTE: These values depend on the heterogeneity of the object profiles (fibers) in the region of study. A frame area of 400 µm2, frame height of 10 µm, guard zone of 2 µm, and frame spacing of 300 µm gives acceptable CE values for fiber length estimation in NBM. A pilot study must be performed with these values before heading to the next case.\nFollow the instructions provided by the software after each step. The instructions appear either as a dialog box and/or at the bottom of the screen.\nInsert Section 1.\nAt low magnification (5x), define the region of interest by making an arbitrary boundary around the NBM. Click the Next button at the left corner of the video window. Follow the instructions and confirm all green points are in the NBM. The points can be included or excluded by clicking on the points.\n\tNOTE: There is no definite, set boundary around the NBM. The selection is mostly investigator-defined. The ChAT+ cholinergic neurons of the NBM can be observed in the internal capsule (ic) and globus pallidus (GP). In this protocol, the ic with ChAT+ cholinergic neurons and their projections (fibers) and whole GP is included in the NBM (Figure 1D).",
    "Follow the instructions and change to 63x for fiber measurements at the current fraction. The 'Section Thickness' dialog box appears on the screen. Set the top and bottom surface of the section to measure the actual thickness of the section. The manual Z axis movement should be used. Click on Done.\n\tNOTE: If there is no fiber in the area, the step can be skipped to go to the next fraction location.\nMove the Z axis slowly from top to bottom in the frame height of the section and mark all intersecting fibers on the surface of the virtual sphere probe (Figure 3). When done, click Next to go to the next location.\nAfter completing all the fractions, the software will ask to insert the next section. Repeat steps 4.9–4.12 for all six or seven sections of the tissue.\n\t\nAt the end, the software will generate a result for the case showing the CE values (Figure 4). If the CE is acceptable, proceed to the next case. File > New Case. If the CE is not acceptable (Figure 4A), the software provides recommendations to change some of the parameters. In many cases, decreasing the frame spacing decreases the CE values to an acceptable range (Figure 4B).\nAfter completing all the cases, generate results for each case and group (File > Results).\n5. Analysis and statistics",
    "The software provides data for each sample and each group. The software itself calculates fractions such as SSF, ASF, and TSF, and provides the total reference volume (VREF) and total length (L) of the fibers in the reference region (in this case, NBM) (Figure 4B). Export the data and save or copy to the statistical software of choice for between group analysis. Table 1 shows typical result data for statistical analysis. Analyze fiber density (Lv) by dividing the total fiber length with the reference volume.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}