{
  "id": 8374,
  "origin_website": "Jove",
  "title": "Stereotaxic Intracranial Delivery of Chemicals, Proteins or Viral Vectors to Study Parkinson's Disease",
  "procedures": [
    "All experiments in this study were conducted in strict accordance with the recommendations in the Guide for the Care and Use of Laboratory Animals of the National Institutes of Health and approved by the Animal Care and Use Committees of the US National Institute on Aging.\nBefore starting, please make sure to have acquired the appropriate training and ethical approval from your institute necessary to perform this procedure. Additionally, anesthetics (e.g., ketamine and buprenorphine, or fentanyl and medetomidine) used should be acquired and handled according to relevant rules of your institution.\n1. Preparation (duration 1 hour)\nBring animals to the surgery room and let them acclimatize while setting up surgical area. Put on appropriate personal protection equipment (PPE).\n\tNOTE: This can be dependent on local safety regulations and substance injected. Viral vectors mostly need biosafety level 2 PPE. Generally, at least wear a mask, gloves and disposable lab coat. In specific circumstances additional gloves and goggles should be used.\nSterilize the surgical tools using either an autoclave or a glass bead sterilizer. For rodents you need scalpel handle, hemostatic forceps, Dumont tweezers, curved forceps, wound closing kit (clips) or scissors and forceps (for sutures) and a drill head.\nDisinfect the surgical area and stereotaxic instrument with 70% ethanol, and cover the area next to stereotaxic instrument with either clean paper towels or a sterile absorbent sheet.",
    "Place the following on towels: eye drops (e.g., Liquigel), hair trimmer, cotton swabs, diluted iodixanol, disposable surgical blade, surgical drill with disinfected drill bit, marker or ear clipper, sterile H2O in a 1.5 mL tube, 1.5 mL tube with 3 % H2O2 in sterile H2O (1.35 mL of H2O + 0.15 mL of 30 % H2O2, freshly prepared), a 1 mL syringe with 33G needle and sterile PBS or saline, syringe with analgesic and antidote if injectable anesthesia is used (e.g., atipamezole + buprenorphine/ketoprofen; freshly prepared and approved in the ethical permit) and autoclaved surgical tools.\nFill up isoflurane and check O2 and N2 pressures, if using gas anesthesia. Add a paper towel to the bottom of the inhalation chamber to keep it dry and clean.\n\t​Mix and freshly prepare the anesthetic (e.g., fentanyl + medetomidine (for rats) or ketamine + xylazine solution (for mice)) if using injectable anesthesia and if approved in the ethical permit.\nAssemble the Hamilton glass syringe and glass capillary (Figure 1A 1.).\n\t\nPlace the pulled glass capillary on the table. Place your index finger where capillary gets thinner with nail ending where capillary should be cut.\n\t\tNOTE: Depending on the depth of your injection anywhere between 0.5 - 2 cm.\nUse the edge of a ceramic tile to carefully scratch the needle part a few times. Take a glass capillary in one hand and use your thumb and index finger to grab the thin needle part. Pull from middle till end until the needle breaks off bluntly.\n\t\t​NOTE: If it does not work or the needle breaks off edged, repeat a few times. If it still does not break off, repeat tile scratching. Make sure the needle part is not too thin (>50 µm in diameter) and does not bend easily.",
    "Seal the glass capillary to the Hamilton syringe.\n\t\nAttach 1 cm shrink tubing over the blunt metal needle attached to the Hamilton glass syringe. Then put the thick end of glass capillary over the Hamilton metal needle.\nPlace shrink tubing over half the glass capillary, ensuring at least 1 cm space between the end of the Hamilton metal needle and the conical transition of the capillary. This will be the space holding the desired injectable solution later.\nUse a lighter or match to heat up the shrink tubing and seal the injection needle.\n\t\tNOTE: There are several different holder options that allow you to fix the Hamilton syringe to the stereotaxic arm on the left. Be sure you can still read the numbers on the Hamilton syringe. If you use a pump to inject the solution, attach the pump to the stereotaxic arm and fix the Hamilton syringe onto the pump.\nRemove the metal plunger. Insert a 27G needle attached to a 1 mL syringe filled with saline or PBS on the top part of the Hamilton syringe. Flush the Hamilton syringe with PBS to check if it is sealed and to flush out all air bubbles.\n\tNOTE: Air bubbles will disturb your take-up and injection of your solution as air compresses more than liquid.\nOnce everything is checked and ready, open the little screw on the z-axis arm (Figure 1A 2.) of the stereotaxic instrument and rotate the arm in 90˚ increments clockwise to move glass syringe/capillary out of the way (to avoid the capillary to break while fixing the animal to the stereotaxic instrument).\n\tNOTE: Check that all the stereotax angles and settings are set to desired parameters (normally 0˚), toothbar and earbars are set to desired coordinates and the Hamilton syringe/capillary are all straight.",
    "Turn on the heat pad on the stereotax platform, using additional padding on top if it is too warm. Place an empty, clean cage with an additional heat pad next to surgical area.\n2. Surgery (duration average 1 hour per animal)\nFor gas anesthesia\n\t\nTurn on isoflurane to 5% with a N2 + O2 air flow (about 1 L/min) and open the valveto the inhalation chamber. Place the animal into the chamber and make sure it is sealed well. Observe the breathing until it has slowed down considerably (deep breathing).\nOnce animal is unconscious, open the valve to stereotaxic instrument and close chamber valve. Set isoflurane to 2%.\nOpen the chamber and take out the animal holding it at the neck, open its mouth with the forceps and place the animal onto the tooth bar (Figure 1A 6.) with the front upper teeth fitting into the hole.\n\t\t​NOTE: This step is time sensitive as the animal can wake up again by not breathing in isoflurane.\nPlace the nose cone over the snout and observe breathing to ensure a steady rhythm without forced breathing. Make sure the animal is deeply anesthetized by checking the absence of the pedal withdrawal reflexes of the hindlimbs before proceeding.\n\t\tNOTE: Keep checking throughout the procedure so the animal doesn't stop breathing or wake up. If necessary, adjust % of isoflurane in small increments. To test pedal withdrawal reflex of the hindlimbs use a pair of tweezers and pinch the hindpaw. If the animal retracts the limb (reflex to remove from pain stimuli) the anesthesia is too low.",
    "Fix the head of the animal in place using the two earbars (Figure 1A 7.). When done correctly, the ears should be pointing sideways over the ear bars. If the head is still moving adjust the ear bars or nose cone to fix the head tighter in place.\n\t\tNOTE: Be gentleto avoid breaking the animals' eardrums by inserting the earbars too deep. Rats tend to blink when the earbar is inserted correctly.\nFor injectable anesthesia:\n\t\nInject the animal with an appropriate / recommended dose of anesthesia i.p. (300 µg/kg of fentanyl and 300 µg/kg medetomidine for rats; 100 mg/kg ketamine and 10 mg/kg xylazine for mice) and place it back into the home cage.\nCheck animals' pedal withdrawal reflexes 5 min after injection. If absent fix the head of the animal in place using the two earbars (Figure 1A 7.). When done correctly, the ears should be pointing sideways over the ear bars. Afterwards, place the animalonto the toothbar (Figure 1A 6.) and screw down the lever. If the head is still moving adjust the ear bars or lever cone to fix the head tighter in place.\n\t\t​NOTE: It is possible to break an animal'seardrum when earbars are inserted too deep. Do not screw on lever too tight. It can break the animals' nose.\nIf the pedal withdrawal reflexes are observed, wait another 5-10 min. If still observed, inject another 10% of the previous anesthetic.\n\t\t​NOTE: Increase the anesthetic dose slowly with a waiting period in between to avoid the death of the animal due to asphyxiation.\nMake sure that the skull is flat by adjusting tooth bar and/or ear bar heights.\n\t\t​NOTE: Be careful while adjusting the bars as the head will change angle and the nose cone/lever can break the animals' nose.",
    "Put eye drops on each eye (e.g., Liquigel) to avoid their drying out during the surgery. Shave the head of the animal from eyes to ears.\nDisinfect the surgical area using 10% iodopovidone. Additionally, inject a local anesthetic (e.g., 0.5% lidocaine) intradermally at the site of incision. It is recommended to wait for 2-3 min for it to act before continuing.\nUsing the scalpel, make one continuous incision from between the eyes to between the ears.\n\tNOTE: Be careful not to cut too far back as cutting the neck muscles will complicate recovery.\nUse the cotton tips to open the wound and clean the area from blood. For rats, use the hemostatic forceps to keep the wound open, by clamping them into the subcutaneous tissue and letting them hang down each side. For mice, if necessary, use micro clips.\n\tNOTE: This is the most painful part of the procedure. Clamping the subcutaneous tissue instead of the skin will increase healing.\nMove the syringe/capillary (Figure 1A 1.) 180° counter-clockwise on the z-axis (Figure 1A 2.) and bring it over the animal's head. Make sure to close the knob completely so the z-axis arm does not wobble during surgery.\nUse the microscope and the knobs on each stereotaxic arm (Figure 1A 3.-5.) to move the blunt end of the glass capillary (attached to the Hamilton glass syringe; Figure 1A 1.) right on top of bregma (touching but not pressing on the bone). Set all values on the digital display to zero (Figure 1A 8.).\n\tNOTE: Bregma (Figure 1B) is the point where the sagittal and coronal sutures of the parietal and frontal bones meet. This will be the point of origin.",
    "Looking through the microscope, move the blunt end of the capillary right on top of lambda. If the z-axis (dorsal/ventral = DV) value is within +/-0.1 mm the head of the animal is leveled. If it is higher or lower use the tooth bar to adjust the head accordingly until within +/-0.1 mm.\n\tNOTE: Lambda (Figure 1B) is defined as the point where the sagittal and coronal sutures of the parietal and occipital bones meet. This method could also be used to level the left and right side of the skull if ear bars can be adjusted individually. Be careful while adjusting bars as the head will change angle and nose cone / lever can break the animals' nose.\nUse the Allen brain atlas (Figure 1C, D) to identify the coordinates for your desired target region. Use the y-axis (anterior/posterior = AP) and x-axis (medial/lateral = ML) arms to move the syringe/capillary to the correct position.\n\tNOTE: Dye injections (Figure 2A-E) should be performed before surgical procedures on separate animals to ensure that the coordinates are correct for the strain/ age of the animals used.\nLook through the microscope and prepare to carefully drill a hole where the blunt end of the capillary meets the bone. Before starting, move the capillary up enough on the y-axis so it will not get damaged while drilling. Start drilling in a bigger circle and get smaller as you drill deeper. While drilling, rest the hand on an ear bar to keep it steady.\n\t​NOTE: Do not drill all the way to the brain tissue. Leave a thin layer of bone to avoid damage to the dura. Instead use a tweezer to carefully remove the remaining thin layer of bone.",
    "Using the microscope, check that the blunt end of the needle can touch the dura / brain tissue without being diverted by bone pieces.\nClean the syringe / capillary to avoid contamination of the injection solution.\n\t\nMove syringe/capillary all the way up, and dip it into the 1.5 mL tube containing 3% H2O2. Make sure to remove all debris and blood off the glass. Then, dip the capillary into the 1.5 mL tube containing H2O to wash off the H2O2.\nRemove the metal plunger from the Hamilton syringe and place a gauze under the syringe/capillary, on top of the animal's head. Use the 1 mL syringe filled with PBS to wash the Hamilton syringe by inserting the needle in the top and squirting out PBS. After this, insert the metal plunger into the Hamilton syringe.\nDraw up 1 µL of air. This will keep the PBS in the Hamilton syringe and the injection solution from mixing in the capillary. Then draw up the desired amount of injection solution. A maximum of 1 µL and 2 µL per deposit is recommended for mice and rats respectively.\n\tNOTE: A total of 3 µL /6 µL per hemisphere should not be exceeded as the pressure in the brain will rise too much. Using a pen, a little mark can be made very carefully where the meniscus of the solution is. This mark can then be used as a reference point to gauge if the solution enters the brain.\nFor rats, use a 25G needle to puncture the dura. Insert the capillary into the brain to the desired DV coordinate. Move the syringe/capillary 0.1 mm deeper than intended and draw back up to make space for the solution.",
    "Inject solution either by hand (0.1 µL per 10-15 sec) or with a pump (0.4-0.6 µL/min). Check the meniscus to ensure that the solution is fully injected.\n\tNOTE: If the solution does not move into the brain, move the syringe/capillary up and down 0.2 mm. If it still does not inject repeat steps 2.13-2.14. Most likely the needle is clogged with brain tissue debris.\nHold the syringe/capillary in place for another 5 min to let the injected solution distribute and the pressure go down. During this waiting period, inject the analgesic and mark the animal if necessary.\nMove the syringe/capillary up 0.2 mm and hold in place for another 2 min. Draw the syringe/needle out very slowly to avoid pulling up any injected solution due to the negative pressure.\nOnce the syringe/capillary is out of the brain, clean it as described in step 2.13 to prevent tissue from drying and clogging the capillary.\nContinue injecting more brain areas or finish the surgery.\nMove the syringe needle aside by turning it 180° on the z-axis to avoid breakage while closing the wound. Then, close the wound either with clips, tissue glue or sutures. If injectable anesthesia was used, inject the animal with the antidote.\n\tNOTE: Animals not housed singly tend to clean each other's head and possibly remove clips, glue or stitches.\nRemove the animalfrom the stereotaxic frame and place it into the clean cage on top of the heat pad. Monitor the animal to ensure it wakes up without complications. Provide easy access to food and water for the first 24 h.\n3. Post-OP care (duration 3-7 days)",
    "Check the weight (10% weight loss is acceptable), fur, feces and food/water intake of the animal over the next 2-3 days (up to 10 days for toxicant injection) to ensure proper recovery. If necessary, isolate the animal and provide wet food, saline injections and a heating pad, essential for some toxicant injections as animals might have additional systemic issues.\nInject animals with analgesic for another 1-2 days after surgery to ensure pain relief according to local regulations. If sutures, clips or glue does not come off by itself, use isoflurane to anesthetize the animal and remove sutures, clips or glue 1-week post-op.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}