{
  "id": 9317,
  "origin_website": "Jove",
  "title": "Flat Mount Imaging of Mouse Skin and Its Application to the Analysis of Hair Follicle Patterning and Sensory Axon Morphology",
  "procedures": [
    "This study was performed in strict accordance with the recommendations in the Guide for the Care and Use of Laboratory Animals of the National Institutes of Health. All of the animals were handled according to approved institutional animal care and use committee (IACUC) protocol MO11M29 of the Johns Hopkins Medical Institutions. Consult your local Institutional Animal Care and Use Committee guidelines for approved methods of euthanasia. Wear gloves, lab coat, and safety glasses when handling aldehyde fixatives or organic solvents.\n1. Preparation of Materials\nPouring Sylgard Plates\n\t\nFollow the manufacturer's instructions, mix the curing agent with the base, and stir with a plastic rod.\nPipette ~35 ml liquid Sylgard per 10 cm diameter tissue culture dish. Tissue culture dishes are deeper than the standard bacterial dishes; this provides vertical clearance for the insect pins.\nPlace the dishes on a horizontal surface at room temperature overnight. Bubbles formed during the mixing will disappear.\nFollowing polymerization, store the Sylgard plates at room temperature.\n\t\tNOTE: Sylgard plates can be stored at room temperature for years and re-used multiple times until the Sylgard detaches from the plate.\nSolutions\n\t\nBenzyl benzoate and benzyl alcohol (BBBA). Mix 2 volumes benzyl benzoate and 1 volume benzyl alcohol. Store in the dark in a glass bottle with a glass stopper or Teflon top.\n\t\tCAUTION: Used BBBA should be appropriately handled as organic solvent waste. Do not allow BBBA to contact plastic.\nPhosphate buffered saline (PBS). Add 4 g PFA to 80 ml water, add 0.1 ml 1 N NaOH, stir on a hot plate at ~70 °C for ~5 min until the PFA is completely dissolved, and then add 10 ml 10x PBS and bring the volume to 100 ml with water.",
    "CAUTION: Inhalation of formaldehyde/PFA and BBBA vapors should be minimized by keeping these solutions in covered containers. Formaldehyde/PFA is a carcinogen.\nOil Red O. Prepare a 0.5% stock in isopropanol. Immediately before use dilute with water to a final concentration of 0.3% Oil Red O, and then filter through a 0.2 µm filter.\n2. Skin Dissection, Fixation, and Clearing\nDorsal Skin for Immunostaining and Melanin Imaging\n\t\nFor very young mice (e.g., fetuses and postnatal day (P)0-P3 pups), euthanize the mice by isoflurane inhalation. Euthanize older mice by isoflurane inhalation or by ketamine/xylazine injection followed by cervical dislocation.\nRemove the hair with an electric razor and hair removal gel. For mice younger than P8, this step can be skipped.\nUse a razor blade to make a horizontal cut from the base of the tail along each flank, passing on the dorsal side of the base of each limb, proceeding lateral to the ears and ending at the nose.\nGently peel the skin from the underlying tissue proceeding from posterior to anterior by holding the skin between gloved fingers so that it is not pinched by forceps. When peeling the skin at the level of the ears, first cut off the ears with a pair of scissors and proceed especially slowly as the skin can tear at this location.\nFrom this point onward, orient the skin with the inside facing up. Pin the skin to Sylgard with ~20 insect pins evenly spaced around the periphery; do not over-stretch the skin (Figure 2B). Cover the skin with 10-20 ml of PBS.",
    "Dissect away the skin-associated fat and connective tissue using angled or curved forceps with the pointed end of the forceps facing horizontally to minimize the risk that the forceps will penetrate the skin. Extrude any air bubbles that have been trapped beneath the skin by gently rolling a cotton-tipped applicator over the skin surface.\n\t\tNOTE: If the skin is going to be used for flat mount immunostaining or histochemistry, remove as much of the connective tissue as possible; if the skin is going to be used to visualize hair follicles based on melanin pigmentation, less complete removal of connective tissue is satisfactory. Prenatal skin requires minimal “cleaning” of adherent connective tissue.\nFix the pinned skin by adding 20 ml of freshly prepared 4% PFA/PBS or 10% buffered formalin per 10 cm Sylgard plate (if the skin will be used for melanin imaging or alkaline phosphatase (AP) histochemistry) or 20 ml of freshly prepared 2% PFA/PBS (if the skin will be used for immunostaining or visualizing transgenic Keratin (Krt)17-GFP11), and gently rotate overnight in a cold room. The next day, wash in PBS for >10 min.\n\t\tNOTE: Standard formalin is 37% formaldehyde; therefore, “10% formalin” is 3.7% formaldehyde.\nFor AP staining and immunostaining, continue in Section 3. For melanin imaging, dehydrate the skin through a graded ethanol series (70%, 95%, 100%), one day for each step, with gentle horizontal rotation at room temperature. Remove residual connective tissues.\nWith the skin in 100% ethanol, remove the insect pins and, if desired, trim the skin with scissors to remove the most peripheral 1-2 mm of skin with the pin holes.",
    "Transfer the skin to a 10 cm diameter glass dish, place two glass microscope slides on the skin to prevent it from curling, and add 20 ml of BBBA. BBBA rapidly hardens tissue so it is important for the skin to be flattened under the weight of the glass slides before adding the BBBA.\nOver the next several hours, lift the slides off the skin for a few seconds to allow the BBBA to wash over the skin.\n\t\tNOTE: Wear gloves when working with BBBA. Depending on the age and location of the skin there can be as much as 30% shrinkage in BBBA.\nFoot Skin for the Analysis of Hair Follicle Patterning\n\tNOTE: The range of ages typically examined is P1-P8.\n\t\n\t\nAfter euthanasia, cut off the feet above the ankle joint and make a single straight cut along the ventral surface through the soles of the feet.\nGently peel the skin from the underlying tissue, proceeding in a proximal to distal direction.\nCut the digits to release the skin and pin it to Sylgard with the inside surface facing up (Figure 2C). There is minimal connective tissue on the foot skin.\nTransgenic Krt17-GFP skin is now ready for imaging. For melanin imaging proceed with fixation, dehydration and BBBA clearing as described in section 2.1.\nFoot Skin for Visualizing Sebaceous Glands\n\t\nAfter euthanasia, remove the hair by rubbing hair remover gel over the skin surface with a gloved finger and thumb; wait for 10 min.\n\t\tNOTE: Do not use an electric razor, which will damage the delicate foot skin.\nWash the skin surface with tap water, dissect and pin the skin to Sylgard as described in section 2.2.\nFix with 1% PFA/PBS for 30 min at room temperature and then wash in PBS.",
    "NOTE: For visualizing sebaceous glands on the feet, which develop after the first postnatal week, the optimal age for analysis with Oil Red O is P21, because this marks the nadir of hair pigmentation during the first hair cycle12, and therefore the sebaceous glands can be seen more readily. With albino mice this analysis could be performed at any age. To obtain albino progeny cross pigmented mutant mice to a tyrosinase mutant line such as C57BL/6J-Tyrc-2J .\nTail Skin Preparation for the Analysis of Melanin Distribution, Hair Follicle Orientation, and Sebaceous Gland Visualization\n\t\nAfter euthanasia, make a circular cut around the base of the tail, and then a longitudinal slit that runs the length of the tail along its ventral face.\nPeel off the tail skin starting at the tip by firmly grasping the tip of the tail-bone and/or connective tissue with one pair of forceps and the skin with a second pair of forceps. Pin the tail skin to Sylgard.\nFor the analysis of melanin distribution and hair follicle orientation, fix and process the skin as described in section 2.1. For analysis of sebaceous glands, cut the tail skin into a series of segments ~0.5 to 1 cm in length prior to fixation and incubate the skin pieces in PBS/5 mM EDTA overnight at 37 °C to weaken the dermis-epidermis adhesion13.\nGently peel the epidermis from the dermis, pin the epidermis to Sylgard (inner face up), and fix it in 4% PFA/PBS for 1 hr at room temperature. Wash with PBS, and stain with Oil Red O as described below.\n\t\tNOTE: An electric razor and/or hair removal gel can be used prior to dissecting older tail skin (e.g., P21), but this treatment is optional since the hair on the tail is not as dense as elsewhere on the body.",
    "3. Staining Reactions\nHuman Placental Alkaline Phosphatase (AP) Histochemistry to Visualize Genetically-labeled Axon Arbors10,14,15 (Figures 3A,B)\n\t\nAfter PFA fixation on Sylgard, place fixed skins in a 10 cm glass dish and submerge under PBS/1 mM MgCl2. Gently rotate the dish in a water bath at 70 °C for 90 min to destroy endogenous phosphatase activity.\nVisualize AP reporter activity histochemically with a 4-48 hr incubation at room temperature in 0.1 M Tris, pH 9.5, 0.1 M NaCl, 50 mM MgCl2, 0.34 µg/ml NBT, and 0.175 µg/ml BCIP, typically using 10-15 ml of staining solution per P21 dorsal skin. Monitor the reaction under the dissecting microscope, taking care not to let it proceed beyond the optimal time, as judged by visual inspection of axon staining intensity relative to nonspecific NBT deposition.\nStop the reaction by washing with three changes of PBS/0.1% Tween-20 over the course of 1 hr, re-pin the skins to Sylgard, dehydrate the skins through an ethanol series, and then transfer the skins to a 10 cm dish with BBBA.\n\t\tNOTE: BBBA slowly dissolves the NBT precipitate. During the first few hours in BBBA, a fine background of precipitated NBT will dissolve; as a result, the BBBA solution will darken, and the skin will lighten. Change to fresh BBBA after a few hours.\nAfter imaging the AP-stained skin, transfer it to ethanol for >1 hr at room temperature and then store it in fresh ethanol at -20 °C. AP-stained skins can be stored in this way for many months with no loss of signal.\nOil Red O Staining to Visualize Sebaceous Glands4 (Figures 3C-F)",
    "Remove insect pins and transfer the lightly fixed foot or tail skins from the Sylgard plate to the wells of a 6-well tissue culture plate, with up to two skin samples per well. Wash with 60:40 isopropanol:water for 5 min at room temperature.\nStain in 2 ml 0.3% Oil Red O in 60:40 isopropanol:water (see section 1.2) at room temperature for 2 hr.\nWash with 60:40 isopropanol:water for 5 min at room temperature, followed by a water wash. Carefully trim away the edges of the skin, including the pin holes, with fine scissors so that the surface of the skin can be made as flat as possible.\nPlace the skin on a slide with the outer surface facing up, add a few drops of water or aqueous mounting medium, cover the skin with a coverslip, and then gently tape the coverslip to the slide to further flatten the skin.\nFlat Mount Immunostaining4,16,17 (Figures 3G,H)\n\t\nCut a rectangle of PFA fixed skin (e.g. 1 cm x 0.5 cm), marking its orientation with an asymmetric cut (e.g. clip the anterior right corner). Perform the incubation and wash steps with gentle rotation on a rotating horizontal platform. In the wells of a 6- or 12-well tissue culture plate, wash several times with PBS to remove residual PFA, wash with ~10 changes of PBS with 0.3% Triton X-100 (0.3% PBST) over 5–8 hr at room temperature to permeabilize the skin.\nIncubate with the primary antibody in 0.3% PBST with 5% goat serum and 20% DMSO for five days at room temperature. Cover the wells of the plate with clear tape or adhesive plastic to eliminate evaporative losses.",
    "Wash with 10-15 changes of 0.3% PBST over 5–8 hr and incubate with secondary antibody in 0.3% PBST with 5% goat serum and 20% DMSO for 3 days at room temperature.\nWash with 10-15 changes of 0.3% PBST over 5–8 hr.\nDehydrate in 25%, 50%, and 75% methanol for 5 min each and then 3x in 100% methanol for 20 min each.\nClear in BBBA overnight at room temperature.\n\t\tNOTE: Flat mount immunostaining of skin younger than ~P1 can be performed as described above but with shorter incubation and wash times. For example, P1 skin can be immunostained with an overnight incubation in primary antibody and a several hour incubation in secondary antibody, and with intervening washes of only 2-3 hr in 0.3% PBST. As noted above, younger skins are also sufficiently thin that they can be imaged without BBBA clearing.\nVisualizing Merkel Cell Clusters with Fluorescent Nerve Terminal Dye Uptake (Figures 3I-L)\n\tAMI-43 (green) and AM4-65 (red) are fixable fluorescent dyes that enter cells via non-selective cation channel18. In the living skin these dyes are selectively taken up and concentrated in Merkel cells.\n\t\nDissolve 1 mg AM1-43 or AM4-65 in 2 ml PBS and store in aliquots at -80 °C.\nInject newborn pups subcutaneously with 2-10 µg dye per gram body weight using a 29 G needle.\nOne day later, euthanize the mice and dissect the dorsal skins.\nFix the skins in 4% PFA/PBS at 4 °C overnight, wash with PBS, and mount the skin as described in section 3.2.\n4. Imaging and Image Analysis\nImaging Hair Follicle Orientation (Figure 4)\n\t\nUse a dissecting microscope to image dorsal, foot, or tail skins that are submerged in BBBA, flattened beneath a glass slide, and still in the glass dish - this approach minimizes BBBA contamination of the microscope.",
    "Illuminate the dish from below. To minimize spatial variation in light intensity across the field of view, elevate the glass dish to a height ~10 cm above the standard working surface of the dissecting microscope and place a diffusing plastic or glass plate over the light source.\nReturn the skin to 100% ethanol for long-term storage at -20 °C.\n\t\tNOTE: Leaving the skin in BBBA for more than a day causes the melanin granules to break apart. Once the skin has been BBBA treated it will harden and remain flat from that point onward. Different skins can be coded with a series of notches at their anterior and/or posterior ends, so that they can be store together, to save space in the freezer.\nImaging and Tracing Axon Arbors (Figures 3A,B)\n\t\nPlace AP stained skin (section 3.1.3) between two glass plates of the type used for small protein gels. Avoid introducing air bubbles between the plates and the skin, and then carefully wick away any excess BBBA with a paper towel. Place the sandwich of plate-skin-plate on a microscope stage (Figure 2D).\nUse bright-field or DIC illumination with a 10X objective and 2 µm or 5 µm Z-steps. Use a mechanized X-Y stage to capture a montage of X-Y images that are stitched together to create a single three-dimensional grey-scale data set.\n\t\tNOTE: For a single large axon arbor, this data set can be as large as 5 Gb.\nPerform manual, automated, or semi-automated tracing of axon arbors with any of a variety of Software packages.\n\t\tNOTE: Software such as Neuromantic (http://www.reading.ac.uk/neuromantic/) is a free neuronal reconstruction tool that runs in a PC environment and is relatively easy to master10.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}