{
  "id": 9369,
  "origin_website": "Jove",
  "title": "A Low-cost Method for Analyzing Seizure-like Activity and Movement in Drosophila",
  "procedures": [
    "1. Preparation of Individual Flies for Locomotion Assay\nTransfer flies by gently tapping into individual empty vials and cap the vials with a cotton plug. Allow flies to sit undisturbed 20-30 min before observation. It is important to not anesthetize the flies within the hours prior to behavioral observation as previous studies have found anesthesia exposure can alter behavior as compared to unanesthetized flies14.\nGently tap the fly out of the vial and place individual flies under a 5 cm diameter Petri dish cover (5 mm high) with small slits to allow air passage. Illuminate from below and observe the flies using a webcam mounted above the Petri dish.\n2. Preparation of Individual Flies for Seizure Assay\nFeed two-day old seizure sensitive flies either standard yeast/cornmeal/agar media or standard media mixed directly with drug. For the data presented here, flies were fed either 1 g of standard media or 1 g of standard media mixed with 25 mg of metformin.\nAfter the flies have fed for two days on the media or media plus drug, transfer them by gentle tapping into individual empty vials and cap the vials with a cotton plug. Allow flies to sit undisturbed for 20 min before observation. It is important to not anesthetize the flies within the hours prior to behavioral observation as previous studies have found anesthesia exposure can alter behavior as compared to unanesthetized flies14.\nVortex individual vials containing a single fly on a lab vortexer using the highest setting for 10 sec. Place the immobilized fly on a blank white sheet of paper directly below a webcam mounted above the paper.\n3. Video Recording\nRecord the movement or SLA using the HandyAvi software program http://www.azcendant.com/download.htm[href=http://www.azcendant.com/download.htm]. This program uses the webcam to capture images based upon the user settings.",
    "Select the Time-Lapse images option under the Capture tab, When the window opens, select the webcam as the capture device. For most experiments the video frame size of 640 x 480 is adequate.\nSelect Intel IYUV codec for the compression and choose 0.1 sec/frame for the seizure assay or choose 0.1-0.5 sec/frame for the movement assay. Under the advanced tab, select create a .bmp image file for each capture and select a folder for the program to store the images that it takes (the image stack).\nPlace a dead fly on the sheet of paper. Click on the Video settings box and adjust the settings under the Device settings tab so that there is a bright white background and a clear contrast with the darker fly.\nClick the start button to begin the recording. Once the recording period has finished, click the stop button. The image stack should now be in the folder selected. Note: Before recording, ensure that the folder selected for the image stack is empty.\n4. Data Analysis Using ImageJ\nOpen NIH's free image processing software ImageJ, which can be downloaded at http://rsbweb.nih.gov/ij/download.html[href=http://rsbweb.nih.gov/ij/download.html]. Note: In addition to downloading the program, the Multitracker plug-in must be downloaded and installed as indicated at http://rsbweb.nih.gov/ij/plugins/index.html[href=http://rsbweb.nih.gov/ij/plugins/index.html].\nImport the image stack into ImageJ by clicking on the File tab and then selecting Import → Image sequence.\n\t\nSelect the folder that contains the image stack, highlight one of the images and select open. A Sequence Options dialogue box will open. Click the Sort names numerically and then select OK and the image stack will be loaded into ImageJ.",
    "Threshold all the images so that each consists of a white background with the fly being converted to a black dot. To begin this process, convert the image to an 8-bit format by selecting Type → 8 bit under the Image tab.\n\t\nClick on the Image tab again and select Adjust → Threshold. This will open the Threshold dialogue box in which the threshold cut off point can be adjusted.\nScan through the images to see if there are extra black dots or if a slice lacks a black dot. If this is the case, adjust the threshold to alleviate the problem. Usually the threshold does not need to be adjusted as the program defaults to an adequate value.\n\t\tNote: Every slide in the stack should have just one black dot representing the position of the fly.\nSelect apply in the Threshold dialogue box and a Convert to Mask dialogue box will open. Do not click any of the options but simply click OK to threshold the image stack.\nAfter thresholding the image stack, select the Multitracker plug-in under the Plugins tab in order to measure the movement of the fly in pixels. The Object Tracker dialogue box will appear.\n\t\nClick all of the four options given in the dialogue box and then select OK. The Multitracker plug-in will then attach coordinates to the black dot in each slice and list these in the Results window as well as the total path length in pixels. The Paths window gives a graphical display of the path the fly took.",
    "Copy the x- and y-coordinate list from the Results window and paste the data into an Excel spreadsheet. If any slide in the stack does not have a black dot in it, the Multitracker program will halt at that slide. If this occurs, it is necessary to go back to step 4.2 and re-threshold the stack to ensure that the fly registers as a black dot in the slide in question.\nIn order to convert the path lengths from pixels to cm, take a separate image of two dots that are spaced one cm apart on a blank white piece of paper.\n\t\nFollow the above steps (3.1-4.4.2), to determine the x, y pixel coordinates for the two dots and use this information to determine the number of pixels corresponding to a cm. This conversion factor is used in step five to generate movement data in cm. Note: Once this is done, it is important to keep the camera fixed for all future recordings. Every time the camera is moved or adjusted, one needs to repeat this step to convert the pixels to cm.\nThe path length that is generated by the Multitracker plug-in overestimates movement because slight fluctuations in body position and light intensity/reflection will affect the size and center of the black dot that is generated when thresholding the images. This noise must be removed in order to get an accurate estimation of fly movement.\n5. Data Analysis Using Excel\nRemove the noise from the recorded data by importing the series of x, y coordinates generated by the Multitracker program into Fly Analysis, an Excel Visual Basic program created by the authors. (The program is available by contacting the authors.)",
    "Click the Click Me button and select a threshold value cut-off. Select a threshold value of 0.5 cm/sec for SLA analysis or select a value between 0.1- 0.3 cm/sec for movement analysis. Click OK and the program will calculate the velocity, time and distance of movement. Note: The program uses a sliding window analysis to evaluate the data in sequential 0.5-1.0 sec bins and calculates the velocity during that window. Anything above the user-defined cutoff is treated as fly movement.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}