{
  "id": 3852,
  "origin_website": "Cell",
  "title": "Generating mutant Aedes aegypti mosquitoes using the CRISPR/Cas9 system",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nOnce injection plasmids have been prepared, it becomes possible to generate mutant strains via microinjection of mosquito embryos.\nNote: This protocol is an optimized and amalgamated version of previously reported protocols (Jasinskiene et al., 2007[href=https://www.wicell.org#bib5]; Kistler et al., 2015[href=https://www.wicell.org#bib6]; Lobo et al., 2006[href=https://www.wicell.org#bib9]).\nMicroinjection of mosquito embryos\nTiming: 2−4 h\nPrepare microinjection needles containing the injection mix.\nUsing a micro-pipette puller, create multiple glass needles with unbroken tips.\nThe optimal puller program differs according to the choice of glass needle; for the suggested micro-pipette type we recommend using the following settings: HEAT = 517; PULL = 20; VEL = 110; TIME = 250.\nBefore loading the injection mix into the needle, centrifuge the solution (excluding the Cas9 protein) at 16,000 × g for 10 min at 4°C to remove impurities.\nLoad 1 μL of the injection mix into the needle while avoiding bubble formation.\nUsing two overlapping microscope slides, carefully break the tip of the glass needle (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/574-Fig6.jpg\nFigure 6. Needle preparation for microinjections\nTwo overlapping microscope slides are used to carefully break the tip of the glass needle.\nPlace the needle horizontally into a micromanipulator.\nMove the microscope plate slowly towards the needle tip until it is sufficiently broken so that the injection mix can drip. Monitor the slide movement using a microscope.\nCritical: Pay particular attention to the glass needle tip after breaking. If it is too blunt, microinjection will be difficult.\nPrepare embryos for injection (Figure 7[href=https://www.wicell.org#fig7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/574-Fig7.jpg\nFigure 7. Collection and Alignment of Aedes mosquito embryos\nEmbryos are aligned in identical orientations to facilitate microinjection. The anterior end of the embryo is wide, whilst the posterior end is narrow (Left panel). Light gray mosquito embryos should be selected for alignment (right panel, red circle, scale bar 500 μm).",
    "Allow the prepared female mosquitoes to lay eggs 40−50 min prior to microinjection. We suggest aspirating 12−15 females into vials containing wet filter paper before leaving the vial in darkness for at least 40 min. Wild-type female should lay over 100 eggs each during this time period.\nUsing forceps, gently align 20−60 embryos on wet filter paper (Figure 7[href=https://www.wicell.org#fig7], left panel). Embryos should optimally appear light gray (Figure 7[href=https://www.wicell.org#fig7], right panel, red circle).\nCritical: In step 2b, take under 20 min to align the embryos to prevent melanization.\nNote: For this step we suggest using a maximum of 15 wild-type females per 28.5 × 95 mm Drosophila vial to collect eggs.\nNote: We do not recommend using embryos collected from females blood fed more than five days prior to the start of the experiment. In our experience, the yolk of these eggs is too thick and easily blocks the needle.\nDehydrate mosquito eggs delicately using filter paper before utilizing Scotch double sided tape to minimize egg movement. Tape should be placed over the anterior section of the eggs, as the posterior section must remain clear for injection.\nAdd approximately 200−500 μL oil to cover all embryos.\nCritical: In step 2c, dehydrated mosquito eggs should not be exposed to air for more than five minutes before oil is added to prevent embryo melanization.\nInject embryos with injection mix (Figure 8[href=https://www.wicell.org#fig8]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/574-Fig8.jpg\nFigure 8. Aedes mosquito embryo microinjection\nMixture should be injected into the posterior end of the mosquito eggs, with the needle suggested not to pass the yellow dotted line, scale bar 100 μm.",
    "Using a micromanipulator, allow the needle to penetrate the posterior section of each embryo. Typical injection volume should reach around 500 pL per embryo. For optimal results, do not allow the needle tip to go beyond the yellow dotted line.\nRetract the needle from the embryo slowly by moving the microscope plate laterally, minimizing yolk loss.\nRepeat this injection procedure for the entire row of embryos.\nCritical: Identifiable transparent droplets near the posterior of the egg after injection are a signature of a successful injection; the mixed droplets indicate outflow of yolk.\nMove injected embryos to fresh wet filter paper using forceps and wash the eggs using MilliQ-water to remove excess oil.\nKeep the eggs humid and attached to wet filter paper for four days, then hatch and rear as normal.\nCritical: Injected embryos require at least one day for repair. We suggest keeping the eggs on wet filter paper for at least four days before hatching.\nPause Point: Keep the injected embryos on filter paper for up to a maximum of two weeks.\nGeneration of mutant mosquitoes - day 5\nTiming: 3–4 months\nEstablishing heterozygous and homozygous mutants (Figure 9[href=https://www.wicell.org#fig9]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/574-Fig9.jpg\nFigure 9. Schema of mutant mosquito generation\nsgRNA: single guide RNA. G: generation. ddPCR: droplet-digital PCR. qPCR: reverse transcription polymerase chain reaction.\nAfter injected eggs have hatched and as the larvae are reared to adulthood, collect and sort male and female pupae prior to emergence to prevent mating from occurring.\nPrepare crosses between adult micro-injected and wild-type mosquitoes in cages. Cross micro-injected males with wild-type females and vice versa. Add an excess of wild-type mosquitoes in each cross to increase the likelihood that microinjected mosquitoes will mate; the suggested minimal ratios are one microinjected male to three wild-type females, and one microinjected female to one wild-type male.",
    "Note: Add an excess of wild-type mosquitoes independent of sex to ensure injected individuals mate and produce progeny. To ensure all microinjected females are mated, a 1:1 ratio or excess of males is suggested.\nAfter allowing mosquitoes to mate for three days, provide all females with a blood meal to allow for egg laying.\nAfter three more days, transfer females into individual vials containing wet filter paper. Allow females to lay eggs onto the filter paper.\nHatch the generation 1 (G1) eggs using separate containers for each individual female. Screen mosquito larvae for fluorescent markers either throughout the whole body (for markers driven by the Pub promoter) or specific to the eyes, peripheral nerves, and siphon tubes (for markers driven by the 3xP3 promoter).\nOutcross adults emerging from screened larvae with control mosquitoes for five generations, screening for fluorescence during the larval stage of each generation.\nNote: Fluorescent mosquitoes can be collected and tested using digital droplet PCR (ddPCR), genotyping PCR, sequencing, or other methods to screen for precise gene knock-in or potential off-target effects (please see details provided in the next step).\nPause Point: Store eggs on dry filter paper for up to a maximum of three months.\nPrecise gene knock-in mutant line confirmation by ddPCR\nTiming: 1 week\nWe originally tried to amplify the junction sequences of the integration between the marker cargo and flanking regions of the target gene (GCTL-3). Unfortunately, this attempt ultimately failed. Based on this experience, we tried to answer a basic question: How can we ensure the precise integration of a marker cargo? We thus utilized ddPCR technology as part of the gene knock-in mutant line screening procedure to check the copy number variation (CNV) of the target site and eGFP cargo.\nIsolate genomic DNA from a single fluorescent mosquito.",
    "Note: The following procedure for genomic DNA isolation is modified and optimized from Bioman Scientific Company’s suggested protocols.\nAdd a single fluorescent mosquito (male or virgin female) to 200 μL of Cell Lysis Solution (Bioman Scientific) and homogenize with a small Homogenizer.\nIncubate the lysate at 65°C for 30 min.\nAdd 2 μL Proteinase K solution (Stock: 10 mg/mL) to the lysate. Mix well by inverting and incubate at 55°C incubator with an inverting or shaking mixer for at least three h and up to 12−16 h.\nAllow the 55°C lysate sample to cool to 23°C–25°C, and then add 1 μL RNase A solution (Stock: 4 mg/mL) to the Proteinase K-treated lysate and mix well by inversion. Incubate the mixture at 37°C for 30 min.\nAdd 67 μL of Protein Precipitation Solution (Bioman Scientific) to the RNase A-treated lysate sample and vortex vigorously at high speed for 20 s.\nExtract with 40 μL Phenol/Chloroform/IAA (PCI) and then centrifuge at 15000 × g for 10 min at 23°C–25°C.\nCritical: Insect genomic DNA is very delicate at this point. Mix well with PCI via gentle inversion, and avoid vortexing as this can cause fragmentation.\nCarefully remove the supernatant containing the DNA (leaving the protein pellet and PCI behind) and transfer to a clean 1.5 mL Eppendorf tube.\nAdd 250 μL of isopropanol to the supernatant and gently mix the solution by inversion.\nCentrifuge for 15 min at 15000 × g. The DNA will be visible as a small white pellet. Carefully decant the supernatant.\nAdd 250 μL of 70% EtOH to wash the DNA pellet and incubate for 5 min. Centrifuge for 5 min at 15000 × g.\nDecant the supernatant and dry the pellet for 5−10 min in a DNA Speed Vacuum machine.",
    "Resuspend in 20 μL nuclease-free H2O and keep at 4°C for long term storage.\nCalculate the genomic DNA concentration using a NanoDrop 2000 Spectrophotometer.\nNote: DNA concentrations of single male and single virgin female mosquitoes are about 60 ng/μL and 130 ng/μL, respectively.\nDesign the primer/probe sets for the ddPCR assay (Figure 10[href=https://www.wicell.org#fig10]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/574-Fig10.jpg\nFigure 10. Design of the ddPCR primer/probe set\n(A) Relative position and sequences of the GCTL-3 primer/probe set and target site.\n(B) Flanking sequences around the target site after double confirmation using Sanger sequencing.\nCritical: Confirm the sequence of the 500 bp at either side of the strand flanking the Cas9 target site sequence before designing the primer/probe sets.\nThe primer/probe sets of the target genes (GCTL3 and eGFP) were obtained using the Beacon Designer software (PREMIER Biosoft).\nCritical: Design probe sequences located as close as possible to the Cas9 target site region.\nThe primer/probe set of the reference gene (nk) was obtained from (Hall et al. 2015[href=https://www.wicell.org#bib4]).\nThe probe was synthesized following the ZEN quencher technology protocol from the Integrated DNA Technologies (IDT) Company.\nNote: The ZEN quencher developed by IDT can promote a lower background and increase signal detection (available at https://sg.idtdna.com/pages/education/decoded/article/modification-highlight-zen-internal-quencher[href=https://sg.idtdna.com/pages/education/decoded/article/modification-highlight-zen-internal-quencher]).\nThe primer/probe set sequences are:\ntable:files/protocols_protocol_574_57.csv\nPrepare samples for ddPCR.\nNote: All relative ddPCR reagents and procedures follow the protocols from Bio-Red ddPCR Technology (available at https://www.bio-rad.com/en-tw/applications-technologies/droplet-digital-pcr-ddpcr-technology?ID=MDV31M4VY[href=https://www.bio-rad.com/en-tw/applications-technologies/droplet-digital-pcr-ddpcr-technology?ID=MDV31M4VY]).\nNote: Detailed information regarding the ddPCR Applications Guide can be obtained at https://www.bio-rad.com/webroot/web/pdf/lsr/literature/Bulletin_6407.pdf[href=https://www.bio-rad.com/webroot/web/pdf/lsr/literature/Bulletin_6407.pdf].\nEnsure the use of optimal genomic DNA concentrations of 20–40 ng/20 μL per reaction (Ae. aegypti genome size is approximately 1.38 Gbp).\nIdentify optimal melting temperature (Tm) for primer/probe annealing condition testing with test runs to find the most suitable conditions.\nPrepare the following reagents for ddPCR: Example: CNV detection of GCTL-3 target site.\ntable:files/protocols_protocol_574_58.csv",
    "Incubate the reagent mixtures at 23°C–25°C for 10 min for restriction enzyme digestion of the sample DNA.\nCritical: It is particularly important to fragment the genomic DNA by restriction enzyme digestion prior to droplet generation. This will enable optimal accuracy by separating tandem gene copies, reducing sample viscosity, and improving template accessibility.\nCritical: Each ddPCR amplicon should not involve the expected restriction enzyme sites (e.g., HaeIII for the GCTL-3 ddPCR amplicon).\nPerform droplet generation using a QX200 Droplet Generator (Bio-Red).\nAll steps follows the guide in the QX200 Droplet Generator Instruction Manual (available at https://www.bio-rad.com/webroot/web/pdf/lsr/literature/10031907.pdf[href=https://www.bio-rad.com/webroot/web/pdf/lsr/literature/10031907.pdf]).\nThe following is a summary of the steps:\nTransfer 20 μL of each prepared sample into sample wells (middle row) of the DG8 cartridge.\nUsing a multichannel pipette, fill each oil well (bottom row) with 70 μL Droplet Generation Oil.\nHook the gasket over the cartridge holder using the holes on both sides.\nOpen the QX200 Droplet Generator and place the cartridge holder into the instrument.\nWhen droplet generation is complete, the top wells of the cartridge will contain droplets, and the middle and lower wells will be nearly empty, with only a small amount of residual oil.\nCarefully transfer 40 μL of the contents of the top wells (the droplets) of the DG8 cartridge into a single column of a 96-well PCR plate.\nCover the 96-well plate with one sheet of pierceable foil sealed using PX1 PCR plate sealer (Bio-Red).\nOnce the 96-well plate containing the droplets is sealed, place it into the thermal cycler for PCR amplification.\nRun PCR reaction using a T100 Thermal Cycler (Bio-Red).\nPut the sealed 96-well plate containing the droplets into the thermal cycler for PCR amplification.\nRun the following PCR program.\ntable:files/protocols_protocol_574_59.csv",
    "Critical: When using each ddPCR primer/probe set for the first time, it is essential to run a gradient annealing temperature to find the optimal conditions.\nRead the droplets using a QX200 Droplet Reader (Bio-Red).\nRun a CNV Assay (Figure 11[href=https://www.wicell.org#fig11]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/574-Fig11.jpg\nFigure 11. Select “Copy Number Variation (CNV)” as the experiment type and set the ploidy for reference in QuantaSoft software\nSelect “Copy Number Variation (CNV)” as the experiment type in the QuantaSoft software when loading wells.\nDouble click on the experiment name in the main software window to set the ploidy for reference.\nCNV analysis by ddPCR involves quantifying target and reference loci through the use of duplex target and reference assays. In the QuantaSoft software, copy number is determined by calculating the ratio of target molecule concentration to reference molecule concentration, multiplied by the number of copies of reference loci in the genome (usually 2).\nApply the CNV formula:\nSelect “1D Amplitude” for threshold design from the Analyze panel (Figure 12[href=https://www.wicell.org#fig12]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/574-Fig12.jpg\nFigure 12. Select multi-well thresholding to group droplets of GCTL-3 and Rf-nk\nIdentify optimal Tm for testing GCTL-3 (blue) and Rf-nk (green) primer/probe annealing conditions by running a gradient annealing temperature from 52°C–62°C. The optimal Tm conditions are when the amplitudes are constant and concentrated (shown from E07_58°C to H07_62°C).\nDisplay amplitudes and histograms by individual assay (1D Amplitude).\nSelect single or multi-well thresholding to group droplets.\nExample: Optimal Tm condition identification for GCTL-3 primer/probe test.\nSelect Copy Number to display CNV for allele detection (Figure 13[href=https://www.wicell.org#fig13]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/574-Fig13.jpg\nFigure 13. Display CNV for allele detection by selecting Copy Number\nUse genotyping PCR to confirm the break point site\nTiming: 3−4 h",
    "After performing fluorescent marker analysis via ddPCR technology, candidate mutant line break point sites should be confirmed by genotyping. This requires amplifying the junction sequences of the integrations between the marker cargo and flanking regions of target gene (GCTL-3).\nDesign appropriate primers for genotyping.\nFor GCTL-3, we used the following sequences of primer sets for genotyping PCR:\ntable:files/protocols_protocol_574_60.csv\nCritical: Primer design for the genotyping PCR amplicon needs to cover the junction sequences of the integrated cargo and the flanking regions of the target gene (GCTL-3).\nPrepare the following reagents for the PCR experiment:\ntable:files/protocols_protocol_574_61.csv\nSet the following PCR program conditions:\ntable:files/protocols_protocol_574_62.csv\nPurify PCR products following the protocols established by the Zymoclean Gel DNA Recovery Kit.\nConfirm the purified PCR products with Sanger sequencing by using designed primers:\ntable:files/protocols_protocol_574_63.csv\nCritical: Design a sequencing primer that crosses the breakpoint and donor plasmid of the insertion site and reads from the L and R arms to ensure the marker inserts at the correct site (Figure 14[href=https://www.wicell.org#fig14], blue arrows).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/574-Fig14.jpg\nFigure 14. Primer sets for PCR and sequencing confirmation (red and blue arrows, respectively) for break point detection at the insertion site\nOff-target confirmation\nTiming: 3−4 h\nNo matter the sgRNA design, it is not possible to fully rule out the possibility of off-target effects in A. aegypti because both genome assembly and annotation are incomplete. All of the genotype confirmed GCTL-3 mutant lines were therefore back crossed with the wild-type strain for three generations to eliminate the chance of off-target effects. Sanger sequencing can be used to check the sequence states of the potential off-target sites.\nUse the VectorBase BLAST tool to find potential off-target sites for the sgRNA sequence.\nDownload the off-target genes.",
    "Design a series of primer sets to amplify approximately 500 bp around the flanking sequences that cover either strand of the off-target site.\nUse nest primers to confirm the sequence states with Sanger sequencing.\nExample: GCTL-3 target site (Figure 15[href=https://www.wicell.org#fig15]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/574-Fig15.jpg\nFigure 15. Sequencing analyses of the five potential target sites identified for GCTL-3 knock-in\nFigure reprinted with permission from Li et al., 2020[href=https://www.wicell.org#bib8].\nOptional: Other online tools, such as Cas-OFFinder (Bae et al., 2014[href=https://www.wicell.org#bib1]) (http://www.rgenome.net/cas-offinder/[href=http://www.rgenome.net/cas-offinder/]) and CHOP-CHOP (https://chopchop.cbu.uib.no/[href=https://chopchop.cbu.uib.no/]), not only allow for the use of the Aedes aegypti genome as a reference, but are also able to predict off-target sites based on similarity, likelihood of cleavage based on the position of the mismatches, number of mismatches, etc."
  ],
  "subjectAreas": [
    "Genetics",
    "Crispr"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}