{
  "id": 9821,
  "origin_website": "Jove",
  "title": "Assaying β-amyloid Toxicity using a Transgenic C. elegans Model",
  "procedures": [
    "1) Preparing Nematode Growth Media plates for paralysis assay.\nParalysis assays are performed on the standard Nematode Growth Media (NGM) plates routinely used for C. elegans propagation and genetics (Stiernagle, 2006).\nAutoclave the NGM solution containing NaCl, Agar and Peptone in an Erlenmeyer flask and add the appropriate amounts of sterile CaCl2, Uracil, Cholesterol, 1M MgSO4 and 1M KPO4.  Aliquot 10 mL of liquid NGM into each 60 mm x 15 mm Petri Dish.  Allow NGM to solidify overnight at room temperature.\nIf testing for the effects of compounds/extracts, aliquot the extract onto each plate and use a spreader to evenly distribute the extract over the surface of the plate.  Allow extract to dry overnight at room temperature.  Volumes over 1 mL will require more time to dry.  \n Spot each plate with 250 μL of E. coli strain OP5O grown in LB Media overnight for an optical density of 0.4-0.6.  Allow bacteria to dry overnight at room temperature.\nRelevant variables\nThe age of plates has a significant affect on the paralysis assay, as older plates tend to dry out.  Use plates poured within one week of paralysis assay. For ideal results, pour plates 3-4 days before initiation of synchronous worm populations [see (2) below]. For any experiment, only use plates poured from the same batch.\nAltering the size of the lawn (i.e. spotted vs. spread) and/or the type of bacteria will also alter the behavior of the worms.  Paralysis assays can be performed using alternative E. coli strains as a food source (e.g., the HT115 strain used in feeding RNAi experiments), but this can change the kinetics of paralysis, thus requiring appropriate internal controls.\n2) Preparation of Age-synchronous Worm Populations",
    "Strain CL4176 (smg-1(cc546ts) I; dvIs27 [myo-3/ Aβ minigene + rol-6(su1006) marker gene]  X is most commonly used for assaying Aβ-induced paralysis.  This strain and other transgenic models are available to academic researchers for a nominal fee from the Caenorhabditis Genetics Center (http://www.cbs.umn.edu/CGC/).\nTo maximize the age synchrony of the test population it is preferable to start with a synchronized parental generation. A week before the initiating the paralysis assay of the test population, use a platinum worm picker to transfer 20-30 gravid adults onto several 10 cm NGM plates spread with OP50 for a 2 hour egg lay at 16°C (the permissive temperature for CL4176). Remove the gravid adults and allow the progeny to grow for 7 days, by which time they will be \"second day\" gravid adults.  \n(Day 1) The second day gravid adults are used to prepare the age-synchronous test populations.  For each experimental condition the object is to generate triplicate plates containing 50-75 age-synchronous worms.  Using a platinum worm picker, transfer 10-12 of the day 2 gravid adults onto 60 mm (10 mL volume) NGM plates spotted with OP50. Allow the worms to lay eggs at 16°C for 2 hours, then pick off the adults and allow eggs to hatch and grow at 16°C.  At this point it is best to have someone who will not be scoring the plates to code them, so the scorer will be blind to experimental conditions.\nRelevant variables",
    "The stage of embryonic development when eggs are laid (~ the 26-cell stage for wild type worms under optimal conditions) is a function of adult age and nutrition.  If the gravid adults used for preparation of the test population are older or starved, later stage eggs will be laid, reducing the age synchrony of the population and the reproducibility of paralysis kinetics.  It is essential than mono-axenic (i.e., only OP50 bacteria) cultures are used (microbial contaminants can severely affect this assay), and reproducibility is highest if the triplicate plates have similar numbers of worms.\n3) Transgene Induction and Paralysis Assay\n(Day 3) Upshift plates to 25°C 48 hours after the end of the synchronous egg lay; worms should be at the third larval stage (L3).  Plates should be arranged without stacking in a 25°C incubator to allow all plates to reach 25°C at the same time.",
    "(Day 4)  Begin scoring the paralysis of worms (strain CL4176) at 18-20 hrs after the initiation of upshift.  At this point, all worms in the population should have reached the fourth larval (L4) stage. Continue scoring in two-hour increments until all worms on each of the plates are paralyzed.  For unknown reasons, paralysis is not even across the body length: the head region is the last part of the worm to cease moving.  Thus, worms that have recently initiated paralysis cannot translate across the plate, but can move their heads, thereby clearing bacteria around their anterior and leaving a \"halo\" of cleared bacteria.  These worms will invariably become completely paralyzed, and therefore worms with halos are categorized as paralyzed.  Some worms will not have halos but will also not show spontaneous movement; these are tested by prodding with the worm picker.  If a prodded worm cannot undergo a full body wave propagation upon prodding, it is also scored as paralyzed.  For efficient scoring, it is easiest to move the paralyzed worms to an unspotted sector of the plate so that they will not be unintentionally rescored the next scoring period.  (This also allows mis-categorized worms to demonstrate movement, allowing a scoring correction).\n To generate a paralysis curve, at each time point the fraction of worms on each plate that have not been paralyzed is converted to a percentage, and the average \"unparalyzed\" percentage is plotted against time from upshift initiation.  (The rationale for plotting in this manner is that the resulting curve is formally analogous to a survival curve, and thus can be analyzed using standard non-parametric survival statistics.)\nRelevant variables",
    "The upshift of transgenic myo-3/Aβ worms must occur before they reach the mid L4 stage for paralysis to be initiated, as the myo-3 promoter is developmentally regulated, and has significantly reduced expression in late L4 or adult worms.  Similarly, expression of this transgene is blocked if worms become starved, so it is essential that the worms are well-fed throughout the experiment.  We have never observed a paralyzed worm to recover under any conditions, and after 12-16 hr of upshift, all CL4176 worms will paralyze, even if they are downshifted to 16°C.  In strain CL4176, sufficient upregulation of transgene expression to cause paralysis can occur at lower temperatures (i.e., 20-25°C) although the timing of paralysis will be altered.  The paralysis rate depends on the specific transgenic strain used (we have constructed myo-3/Aβ strains with both faster and slower rates than CL4176), so with alternative strains the scoring window may need to be adjusted.\n4) Representative Results",
    "Shown in Figure 1 is a plot of a paralysis curve for CL4176, both untreated and exposed to 6.27 mM caffeine (final concentration in NGM plate).  This treatment results in a highly statistically significant delay in paralysis of approximately 4 hrs, which we interpret as indicative of suppression of Aβ toxicity in this model.  Shown in Figure 2 is an independent experiment assaying the effects of cafestol, another compound found in coffee.  This plot is typical for treatments that do not impact Aβ toxicity.  Note that in both experiments about half the untreated CL4176 populations are paralyzed at 24 hr, and paralysis is complete by 28 hr.  These are typical timeframes for paralysis of control CL4176 populations.  Significant deviations from this timing are indicative of altered environmental conditions or spontaneous deletion of transgene copies.  (CL4176 contains a chromosomally-integrated transgenic array with multiple copies of the myo-3/Aβ transgene. Although this transgenic array is normally quite stable, any propagation of the strain at temperatures >16°C will select for rare worms that have undergone a spontaneous deletion of transgenes, resulting in variants that will have reduced Aβ expression and slower paralysis results.)\nimgsrc://cloudfront.jove.com/files/ftp_upload/2252/2252fig1.jpgFigure 1. Paralysis curve for strain CL4176 worms untreated or exposed to 6.27 mM caffeine (Sigma). The indicated times are from initiation of temperature upshift.  Error bars = S.E.M.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2252/2252fig2.jpgFigure 2. Paralysis curve for CL4176 worms exposed to 0.48 mM cafestol (Sigma).  Error bars = S.E.M."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}