{
  "id": 18400,
  "origin_website": "Jove",
  "title": "Intravascular Delivery of Biologics to the Rat Kidney",
  "procedures": [
    "The experiments were performed on female Sprague-Dawley rats, weighing 250-300 g. All animal procedures complied with the standards stated in the Guide for the Care and Use of Laboratory Animals (Institute of Laboratory Animal Resources, National Academy of Sciences, Bethesda, MD, USA) and were approved by the Mayo Clinic College of Medicine Institutional Animal Care and Use Committee (IACUC).\n1. Preparation\nAutoclave all surgical instruments before surgery. If multiple surgeries on different rats are planned in the same day, rinse instruments after each animal procedure and then sterilize using a hot bead sterilizer.\nAnesthetize the rat with 4% isoflurane in 1 L/min O2.\nTransfer the rat to a controlled heating pad to preserve the body temperature at 37 °C. Maintain anesthesia with 1-2% isoflurane in 1 L/min O2.\nAdminister the analgesic drug (Buprenorphine Sustained Release 0.6 mg/kg) subcutaneously.\nApply ointment to the eyes to prevent drying during the procedure.\nIn order to compensate for loss of body fluids due to laparotomy, it is important to administer 10 ml/kg of 0.9% normal saline subcutaneously preoperatively.\nShave the abdominal area and clean the skin with povidone-iodine and 70% ethanol pads.\n2. Surgical Procedure\nEnsure that the depth of sedation is adequate by monitoring physical reflexes, such as withdrawal from toe pinch, palpebral reflex, jaw tone, and respiration rate/pattern.\nPerform a laparotomy through a small midline incision (2-2.5 cm in length) using a surgical scalpel blade No. 10.\nPull the intestine and colon to the right side of the abdomen by using cotton swabs and cover them with sterile gauze soaked in to 0.9% normal saline to maintain the organs moist.\nGently retract upward the spleen, liver, stomach and pancreas to expose the aorta and the left kidney artery.",
    "With the help of a surgical microscope, carefully separate the abdominal aorta above and below the left kidney and the left renal artery from the veins, the fat and the surrounding connective tissue with blunt dissecting curved forceps and sterile cotton swabs.\n\t\nUse the forceps with a repeated open-close motion (blunt dissection) along the length of the vessels to remove the connective tissue and the cotton swabs with a lateral rolling motion to remove the fat.\n\t\tNOTE: The dissection of the peri-aortic region is a very delicate step as nerves and lymphatic vessels might be damaged. Make sure to keep the arteries moist with saline during the dissection procedure.\nPlace a 4-0 silk suture underneath the aorta.\nUsing microvascular clips, clamp the aorta above (just below the superior mesenteric artery) and below the renal artery bifurcation.\nPuncture the aorta at the level of the left kidney artery bifurcation with a 24 G intravenous catheter and advance the catheter into the renal artery.\n\tNOTE: this is a critical step as puncture through the renal artery may occur.\nConnect a syringe filled with the drug solution or saline (up to 500 μl) to the catheter and perfuse the kidney.\nImmediately after perfusion, clamp the left renal vein and the left ureter with a microvascular clip and remove the catheter. Then, place a piece of absorbable hemostat gelatin sponge, with a small drop of tissue adhesive, over the punctured area of the aorta and gently apply pressure with a cotton swab.\nAt the same time, release the clamp from the abdominal aorta, below the left renal artery bifurcation. After 5 min, release the clamp from renal vein and ureter.",
    "Carefully release the clamp from the aorta, above the left renal artery bifurcation, and allow for kidney reperfusion. The total renal ischemia should last no longer than 7 min.\nEnsure that no active bleeding occurs and closely observe the area for 10 more min.\nClose the abdominal incision in two layers (muscle and skin), using 4-0 absorbable sutures and a continuous pattern to prevent infection. In addition to the continuous pattern suture technique, another option would be to use a simple, interrupted technique, especially for body wall closure to prevent dehiscence.\nApply topical antibiotic ointment over the incision area to prevent infections.\nTransfer the rat into a bedding-free observation cage on a warm pad until complete recovery with a temperature range set at 35-37 °C. Loose bedding should be covered (e.g. with a drape or paper towel) or removed from the cage until animals are fully recovered to prevent suffocation or aspiration of bedding.\nAfter surgery, observe the animals continuously until breathing spontaneously, then hourly for a few hours. Re-dose the analgesic Buprenorphine SR 72 hr later if signs of discomfort are observed, such as lethargy, hunched and scruffy, grimace, not resuming normal activities.\nAfter completion of all studies, euthanize animals with the inhalation of an overdose of CO2 and harvest the renal tissues for ex vivo analyses such as histology and Western Blotting5.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}