{
  "id": 9121,
  "origin_website": "Jove",
  "title": "Cortex-, Hippocampus-, Thalamus-, Hypothalamus-, Lateral Septal Nucleus- and Striatum-specific In Utero Electroporation in the C57BL/6 Mouse",
  "procedures": [
    "Ethics Statement: The handling of the mice and the experimental procedures were conducted in accordance with European, national and institutional guidelines for animal care.\n1. In Utero Electroporation\nNote: In utero electroporation was performed as previously published12,14. Therefore, the method is only described briefly in the following (Figure 1).\nPreparations\n\t\nPrepare Fast Green colored endotoxin-free advanced transfection-grade plasmid solution (containing 1,5 pCAGGS) as previously described12.\nPull and grind (35°angle) borosilicate glass capillaries (0.8-0.9 diameter) for injections.\nSterilize instruments.\nSurgery\n\t\nAdminister analgesics (carprofen, 4 mg/kg bodyweight, s.c., 24 hr depot) at least 30 min before starting the surgery.\nKeep the length of the anesthesia to a maximum of 35-45 min (Stage III - stage of surgical anesthesia according to Guedel15 - maximal 25-30 min).\nAnesthetize timed pregnant mice with isoflurane (induction in a chamber: 2.8%, surgery via mask: 2.5%). Confirm anesthesia by unresponsiveness to toe-pinch.\nApply eye ointment to prevent eye-dryness during anesthesia.\nSterilize the surgical area with 7.5% Providone-Iodine solution and cover the mouse with sterile gauze (moist with 0.9% benzyl alcohol saline solution) with only the surgical area exposed.\nCut open the abdominal cavity with a scalpel (skin incision: 1.5-2 cm, muscle incision: 1-1.5 cm).\nPreserve the opened abdominal cavity from drying out by moistening with warmed 0.9% benzyl alcohol saline solution or other sterile isotonic solution as directed by veterinary staff or committee. \nCarefully extract uterine horns (using ring forceps, do not touch the uterus with fingers).\nInjection of DNA and electroporation. Note: The exact details for targeting specific regions are indicated in section 2.\n\t\nSlowly inject the colored DNA solution into the ventricle as indicated in Figure 1 and section 2 via the prepared borosilicate capillaries.",
    "Apply the appropriate voltage for the corresponding embryonic stage (e.g., 36-38 V for E14) via specialized forceps-type platinum electrodes (interval cycle length 50 msec, interval pause 950 msec). Pulse the electroporation paddles during the application of the voltage to minimize damage of the uterine wall.\nPost electroporation/ post-operative care\n\t\nCarefully replace the uterine horns in the abdominal cavity.\nSuture the muscle and the skin incision separately.\nLet the mouse rest on a thermal support device for recovery.\nSupervise the mouse during recovery (behavior, feed and water consumption), 4 hr, 24 hr and 48 hr after surgery. If necessary, apply additional analgesics (carprofen, 4 mg/kg bodyweight, 24 hr depot) for further 2 days.\n2. Transfection of Specific Cerebral Areas\nNote: The position of the positive pole is shown as the angle between the vertical centerline through the ventricle filled with the DNA solution (the right or third ventricle) and the position of the positive pole. When filling the left ventricle the positions are mirror-inverted. In Figure 4 the positions of the ear primordial are shown, which provide important reference points.\nTransfection of cortical areas (Figure 2A, Table 1).\n\t\nPerform surgery as described in section 1.2. For the in utero electroporation of cortical areas use E14 embryos.\nInject 1.5-2 µl DNA-solution containing 4 µg DNA in the right lateral ventricle via the prepared borosilicate capillaries.\n\t\t\nCarefully position the embryo by using ring forceps so that there are no visible vessels above the puncture site.\nSlowly inject the DNA-solution approximately 0.75 mm coronal from the lambdoidal suture and 0.5 mm lateral from the sagittal suture (Figure 3). Ensure that the insertion depth is 1.2 mm (E14, measured from the uterine wall). Check for a blue-green colouring with a sharp demarcation.",
    "Apply voltage via the specialized forceps-type platinum electrodes (interval cycle length 50 msec, interval pause 950 msec).\n\t\t\nUse a 3 or 5 mm electrode paddle.\nUse a voltage ranging from 36-38 V.\nPlace the center of the electrodes just anterior of the ear primordia.\nTo transfect the retrosplenial cortex use angles from 330-0°, to transfect the motor cortex 0-40°, to transfect the somatosensory cortex 40-95°, to transfect the piriform cortex 95-110° (Figure 2A).\nPerform post electroporation/ post-operative care as described in section 1.4. Sacrifice the mice and analyze the embryos 4 days after electroporation (E18) as described in section 3.\nTransfection of the hippocampus (Figure 2B, Table 1).\n\t\nPerform surgery as described in section 1.2. For the in utero electroporation of hippocampal formation use E15 embryos.\nInject 2 µl DNA-solution containing 4 µg DNA in the right lateral ventricle via the prepared borosilicate capillaries.\nApply voltage via the specialized forceps-type platinum electrodes (interval cycle length 50 msec, interval pause 950 msec).\n\t\t\nUse a 3 or 5 mm electrode paddle.\nUse a voltage ranging from 38-40.\nPlace the center of the negative pole just anterior of the ear primordium and the center of the positive pole at the middle of the ear primordium.\nTo transfect the dentate gyrus use angles from 190-210°, to transfect the cornu ammonis (CA)3 210-230°, to transfect the CA2 230-250°, to transfect the CA1 250-275° (Figure 2B).\nPerform post electroporation/ post-operative care as described in section 1.4. Perform analysis after complete hippocampal formation (after birth, p21) as described in section 3.\nTransfection of the lateral septal nucleus and striatum (Figure 2C, Table 1)\n\tNote: The angles overlap with those for transfecting the hippocampus. To effectively transfect the lateral septal nucleus and the striatum without unwanted hippocampus transfection earlier embryonic stages (E12) have to be used.",
    "Perform surgery as described in section 1.2. For the in utero electroporation of the lateral septal nucleus and striatum use E12 embryos.\nInject 1 µl DNA-solution containing 4 µg DNA in the right lateral ventricle via the prepared borosilicate capillaries.\nApply voltage via the specialized forceps-type platinum electrodes (interval cycle length 50 msec, interval pause 950 msec).\n\t\t\nUse a 0.5 mm electrode.\nUse 33 V.\nPlace the center of the electrodes at the level of the ear primordia.\nTo transfect the lateral septal nucleus use angles from 100-170°, to transfect the striatum 170-240° (Figure 2C).\nPerform post electroporation/ post-operative care as described in section 1.4. Sacrifice the mice and analyze the embryos 6 days after electroporation (E18) as described in section 3.\nTransfection of the thalamus and hypothalamus (Figure 2D, Table 1)\n\t\nPerform surgery as described in section 1.2. For the in utero electroporation of the thalamus and hypothalamus use E12-E13 embryos.\nInject 1-1.5 µl DNA-solution containing 4 µg DNA in the lateral ventricle (left or right)via the prepared borosilicate capillaries. Wait for 2-3 min, until the solution is diffused into the third ventricle. Alternatively directly inject into the third ventricle.\n\t\tNote: This enhances specificity but might cause a decreased survival rate (high risk of damage).\nApply voltage via the specialized forceps-type platinum electrodes (interval cycle length 50 msec, interval pause 950 msec).\n\t\t\nUse a 0.5 or 3 mm electrode.\nUse a voltage ranging from 33-35 V.\nPlace the center of the electrodes just posterior the ear primordia.\nTo transfect the thalamus use angles from 25-40°, to transfect the hypothalamus 90-180° (Figure 2D).\nPerform post electroporation/ post-operative care as described in section 1.4. Sacrifice the mice and analyze the embryos 6 days after electroporation (E18) as described in section 3.\n3. Perfusion Fixation\nPreparations",
    "Warm 4% paraformaldehyde (PFA) to 37 °C.\nFill a 50 ml syringe with PBS (4 °C) and a second syringe with warmed PFA. Avoid bubbles.\nConnect the syringes to a three-way stopcock. Connect the third end to a winged infusion set (butterfly).\nFlush the winged infusion set with PBS.\nPerfusion\n\t\nDeeply anesthetize the mice (pregnant or postnatal transfected) with subcutaneous application of ketamine hydrochloride (60 mg/ kg) and xylazine (7.5 mg/ kg).\nConfirm the surgical tolerance stage by unresponsiveness to toe-pinch.\nOpen the abdominal cavity just beneath the rib cage.\nCarefully cut the diaphragm.\nCarefully open the rib cage via a cut on each site up to the collarbone.\nInsert the tip of the butterfly into the left heart chamber (starting from the apex of the heart).\nCut the left atrial appendage.\nSlowly perfuse the mouse with PBS (approximately 10 ml).\nSwitch the three-way stopcock.\nPerfuse the mouse with 5-10 ml 4% PFA.\nDecapitate the mouse using scissors and dissect the brain beginning at the foramen magnum. Perform the dissection as previously published 16.\nPostfixate the brain for 2 days in 4% PFA. Keep the brains at 4 °C in the dark.\n4. Immunohistochemistry\nGenerate 70 µm sections (e.g., with a vibratome).\nOptional: Enhance fluorescence with antibody staining.\n\t\nBlock the sections for 1 hr at RT (0.1-0.2% Triton X-100, 5% normal goat serum)\nIncubate O/N with the appropriate antibody (anti-GFP, 1:1,000)\nWash 3-5 times with 0.1 M phosphate buffer.\nIncubate 3-5 hr with the appropriate fluorescence-conjugated secondary antibody (Alexa Fluor 488 conjugated anti-rabbit-IgG, 1:1,000).\nOptional: Counterstain with 4-6-diaminodino-2-phenylindole (DAPI, 0.2 g/ ml in 0.1 M phosphate buffer) for 1 min.\nAnalyze fluorescence with an appropriate fluorescence microscope.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}