{
  "id": 6305,
  "origin_website": "Bio",
  "title": "Single-molecule Fluorescence <em>in situ</em> Hybridization (smFISH) for RNA Detection in Adherent Animal Cells",
  "procedures": [
    "Design and labeling of oligonucleotide probesProbes are 18-22 mer DNA oligonucleotides that are fluorescently labeled with a fluorescent organic dye at one or both ends. The most common dyes used are the cyanine (Cy), Alexa, and Atto dye series. To design the probes, first obtain the RNA sequence of interest. Note: For good signal-to-noise (SNR) ratio that will allow detection of the FISH spots over the background, it is recommended to use at least 25 probes (best = ~48 probes) per transcript, which means that a short transcript (i.e., < ~500 nt) may not be suitable for this version of smFISH. Alternative methods such as smiFISH (Tsanov et al., 2016), RNAscope (Wang et al., 2012) or clampFISH (Rouhanifard et al., 2018; preprint), which enhance the FISH signal, might be more suitable for short RNAs.  We recommend using the Stellaris probe design web tool. Insert the sense strand sequence and choose the required parameters (i.e., organism, specificity level, number of probes, probe length, and minimal spacing). We recommend choosing the highest level of specificity, i.e., 5, and 48 probes of 20 nt with 2 nt spacing as default. If there are < 25 probes, parameters can be changed until you are satisfied.There are multiple protocols to label the probes. The simplest solution, which we recommend for consistency and ease, is to order the Stellaris RNA FISH probes from Biosearch technologies (https://www.biosearchtech.com/[href=https://www.biosearchtech.com/]). However, these are relatively expensive. One alternative is to order DNA oligos with amine ends and label with an amine reactive dye (Singer, 1998). Note that this protocol is for 50 nt oligos, but can be utilized for 20 nt oligos. This method works well, but is still relatively expensive. A cheaper option is to enzymatically label the probes (Gáspár et al., 2017 and 2018).",
    "The oligo probe set should be suspended in nuclease-free water (for Stellaris probes, prepare a 25 µM solution) and kept at -20 °C in the dark. Probes can be divided into aliquots of 10-20 µl to avoid multiple freeze-thaw cycles (although in our experience we did not detect any noticeable deterioration after multiple freeze-thaw cycles).Cell cultureGeneral comments: Work in a bio-safety cabinet (biological hood) for sterile cell culture work. This protocol is designed for adherent cells. For non-adherent cells, it is required to add additional steps to adhere the cells to the coverslip. Users who plan such steps need to consider these points: How to adhere the cells to the glass (e.g., by poly-lysine coating)?  Decide whether to adhere the cells to the glass before fixation or after the final wash step. Each case could necessitate different protocol steps (e.g., either to perform the washes on coverslips or in tubes, or perform fixation either before or after adherence) and might even yield different results.  Calibrate the number of cells per coverslip.  If possible, it is recommended to add an additional cell line as a negative control for the FISH probes used (e.g., knockout cells, cells of a different species that express the RNA of interest, but with a nucleotide sequence that has low homology, etc.). This is helpful both for calibrating the FISH signals for the specific probes, as well as for FISH spot analysis. It is preferable to verify that the knockout cell line does not express the RNA of interest. We note that truncated RNAs might be expressed from knockout cells and these can be detected by FISH.Pre-warm 1x PBS and culture media to 37 °C.(Optional) If coating the coverslips, prepare a coating solution (e.g., dilute fibronectin 1:100 in 1x PBS).",
    "For each sample, place a coverslip in a well of 12-well plate.Wash briefly with 1 ml of 70% ethanol. Aspirate ethanol.Wash briefly with 1 ml sterile 1x PBS.(Optional) Add 1 ml of coating solution and incubate as required (e.g., for fibronectin, incubate for 10-20 min in a cell culture incubator). Remove coating solution and wash with 1 ml PBS (x1).Place 1 ml culture media per well.Seed adherent cells of choice. Culture the cells in a cell culture incubator for required time of the experiment; do not let the culture become confluent. Aim for a maximum of ~80%-90% confluence at the time of fixation.FISHGeneral comments:To avoid RNase contamination of samples, wear gloves, use barrier tips and avoid working on surfaces where there is regular use of RNases (e.g., from plasmid prep kits).  For safety, work with PFA and formamide solutions should be performed in a chemical (fume) hood.All steps except “hybridization” are performed while the coverslips remain in the well, with 1 ml of solution added per well. It is recommended to pipet liquids on the wall of the well and not directly onto the cells. For cells with delicate structures (e.g., dendrites, membrane nanotubes), it is recommended to use a pipet aid at the slowest setting and not to use vacuum aspirator. There is no need to shake the 12-well plate during wash steps. Wash cells with PBSM (3 quick rinses).Fix cells by incubating with fixation buffer (prepared fresh) for 10 min (not longer, see Note 1) at room temperature (RT).Wash with quenching buffer, 10 min at RT. Wash with PBSM for 10 min at RT. Repeat this step. Cells can be left overnight at 4 °C at this point.Permeabilize cells by incubating with permeabilization buffer for 10 min (not longer, see Note 1) at RT.",
    "Wash with PBSM for 10 min at RT. Repeat this step.Incubate with Pre-hyb buffer for 30 min at RT.While waiting (Step C7), mix the pre-made hybridization buffer with the probes, and prepare the hybridization chamber (see Recipes and Note 2).Place 45 µl of hybridization buffer at each intended coverslip position in the hybridization chamber. There is no need to remove large bubbles, but avoid small foam-like bubbles.With the tweezers, gently lift each coverslip from the well, remove excess liquid by touching the edge on a Kimwipe and place the coverslips with the cells facing down on the hybridization buffer (see Video 1 and Note 3).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Transferring coverslips from 12-well plate to hybridization chamber Seal the hybridization chamber with Parafilm, wrap with aluminum foil, and place in a 37 °C incubator for 3 h to overnight.Prepare a new (or same) 12-well plate with Pre-hyb buffer.Use the tweezers to transfer the coverslips back to the 12-well plate, cells facing up.Cover the plate with aluminum foil and incubate in the 37 °C incubator for 15 min.Wash again in Pre-hyb buffer, 15 min at 37 °C. Quick rinse with 2x SSC at RT (3 quick rinses).Stain in DAPI stain solution (pre-warmed to RT) for 1 min at RT.Wash for 5 min with 2x SSC.During this final wash step, prepare microscope slides in the cardboard tray: Label the slide(s).Just before lifting the coverslips, add 20 µl of Pro-Long anti-fade solution for each cover slip (there can be two per slide). Remove any air bubbles. See also Note 4.Use tweezers to lift coverslips, remove excess liquid and place cell-side facing down, on the Pro-Long anti-fade drop. Let dry at RT in the dark for at least several hours (for best images, wait > 24 h).",
    "(Optional) For long-term storage, seal with nail polish around the edges of the coverslip after the Pro-Long dries. Slides can be stored at RT for several days (at least, we have not checked longer than a week). Keep at -20 °C for long-term storage (months to years). ImagingImportant: All slides from the same experiment should be imaged using the same exact conditions.Imaging can be performed on any wide-field microscope, as detailed in the Equipment section.Do not use a confocal microscope for smFISH imaging. The higher light intensity of the lasers can cause rapid bleaching of the FISH signal. Since the smFISH signal is relatively weak and requires long exposure times to collect enough light, photobleaching limits the total amount of light collected. This is particularly problematic when taking multiple z sections in order to create a 3D image stack. Images should be taken at the relevant channels with descending color order [e.g., Cy5 (670 nm, far-red), Cy3 (570 nm, yellow-orange), Alexa488 (520, green), and DAPI (460 nm, blue)]. This is particularly important when imaging with DAPI, since we have noticed that in some cell types (e.g., MEFs, HEK293T cells), imaging through the DAPI channel may cause the appearance of granular autofluorescence in other channels. This was infrequent (i.e., it did not happen every time) but it was reproduced using several microscopes.Exposure time: For FISH, it is recommended to use maximum (100%) power of the light source and an exposure time of 1-3 s for each FISH channel. For DAPI, use a low power setting and very short exposure time (e.g., 30% power, 20-40 ms).For FISH spot detection, more photons (i.e., longer exposure time) means better detection, but also increased background fluorescence. Therefore, the user should adjust the time and exposure parameters accordingly.",
    "Z-sections: In order to detect RNA spots throughout the volume of the cell, multiple z-sections should be collected. It is recommended to use 0.2-0.3 µm steps and collect at least 30 sections (i.e., for flat cells, like fibroblasts) or more (e.g., for HEK293T or N87 cells we use 41 z-sections). When imaging, choose the option to image all z-sections in one channel before switching to the next channel.Binning: For better resolution, use pixel binning 1 x 1. However, sometimes for the benefit of signal enhancement over resolution, a 2 x 2 binning may be used.For examples of FISH images and z-stacks, see Figure 2 and Videos 2-5.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20181031/20181031204443_4799.jpgFigure 2. Examples of unfiltered and filtered FISH images produced by FISH-quant. smFISH on human NCI-N87 gastric carcinoma cells (top row) and immortalized MEFs (bottom row) were performed using Stellaris probes against human HER2 mRNA. Imaging was performed on a Zeiss AxioObserver Z1 DuoLink dual camera imaging system equipped with Illuminator HXP 120 V light source, PlanApo 100x 1.4 NA oil immersion objective and Hamamatsu Flash 4 sCMOS cameras. For both cell types, 41 steps of 0.2 μm z-stack images were taken using a motorized XYZ scanning stage 130 x 100 PIEZO, and ZEN2 software at 0.0645 μm/pixel. Images show a maximum projection of middle z-sections. Note that the brightness of the MEFs FISH image (lower left) was increased compared to that of N87, to allow better visualization of the cells. See Videos 2-5 for the full z-stack of each image. Scale bars = 10 µm.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. 3D FISH image of N87 cell with human HER-Q570 probes <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 3. 3D filtered image of the cell in Video 2 <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 4. 3D FISH image of MEF cell with human HER-Q570 probes <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 5.",
    "3D filtered image of the cell in Video 4"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}