{
  "id": 13781,
  "origin_website": "Jove",
  "title": "Efficient Derivation of Retinal Pigment Epithelium Cells from Stem Cells",
  "procedures": [
    "1. Directed Differentiation of Stem Cell-derived RPE\nNOTE: All incubation steps are carried out at 37 °C in 5% CO2\nMaintain the hES or hiPS lines (feed daily) in maintenance media (MM; Table 1). Once the lines have reached sufficient standards of quality control, maintain them on a layer of mouse embryonic feeder cells (MEFs) seeded at a density of 250,000/well of a six well plate. Xeno-free cultures can also be generated following the protocol established by Tucker et al.40.\nAllow the stem cell colonies to reach confluency.\nSwitch to differentiation media with Nicotinamide (DM/NIC; Table 1); feed daily.\nAfter three weeks in culture, switch to differentiation media with nicotinamide and either Activin-A or IDE-1 (DM/NIC/AA or DM/NIC/IDE1; Table 1) to enhance RPE differentiation.\nAfter five weeks in culture, switch back to DM/NIC. Daily feedings are no longer necessary once the pH indicators in the media stop turning yellow the day after feeding.\nWait for islets of pigmented cells to appear that are large enough to be cut and removed (See Figures 2D-F and 3A).\n2. Isolating Pigmented Islets\nCoat the wells of a 24-well plate with a matrix that mimics the natural cell environment (xeno-free is preferable).\n\tNOTE: Cornea blades and sharp, fine-tipped forceps are very useful for picking. The entire sheet of differentiated cells can detach while picking. Avoid this by working carefully and initially picking colonies in the center of the dish.\nFill as many wells of the 24-well plate with differentiation media (DM; Table 1) as needed. This decision will depend on the number of pigmented colonies collected.",
    "In a cell culture hood with a dissecting scope, manually cut out pigmented islets. Chop up each islet at the bottom of the original plate using a scalpel in about 2-6 pieces and grab the pigmented parts with sharp forceps.\nTransfer 1-2 pigmented pieces into each 24-well.\nDo not change media for 3-5 days until cells adhere, then start changing media three times per week. (If they do not adhere after this time, the likelihood is good that they never will).\nExpand cells for 3-4 weeks in differentiation media (DM; Table 1) -- An image of a typical culture is shown in Figure 3B. Cells may still not fill the entire well but waiting longer does not seem to help. Feed cells three times per week.\nAfter about 3 weeks, manually remove clusters of white cells in clumps if necessary with sharp forceps. Do not do this step unless it is necessary – it is easy to introduce contaminants. It is ideal to try to obtain purest populations of RPE from the original pigmented colonies in step 1.6.\n3. Passaging Stem Cell-derived RPE\nDetach cells with 200 µl with a cell dissociation solution (preferably not trypsin—a reagent that can be inactivated through dilution is preferable) for 5-8 min at 37 °C, and inactivate it by diluting with DM. Use a 200 µl pipette to wash off all cells and to resuspend them (If the selected well contains only a few cells, consider pooling the cells from two 24-wells).\nCentrifuge (800 x g for 5 min), discard supernatant, and resuspend in 3 ml DM media.\nRe-plate cells from one (or two) 24-wells into one matrix coated 6-well in 3 ml of DM per well (1:5 expansion).",
    "Expand for 1-2 weeks until the cells are ~90% confluent; an image of fully differentiated pure culture is shown in Figure 3C.\nDetach cells with 1 ml cell dissociation solution for about 5-8 min at 37 °C, inactivate it by dilution with DM, use 1,000 µl pipette to wash off all cells, and resuspend them.\nSpin down (800 x g for 5 min), discard supernatant, and resuspend in 18 ml DM media.\nRe-plate cells from one 6-well each into six matrix coated 6-wells in 3 ml of DM per well (1:6 expansion) or one-coated 75cm2 flask (1:7.5 expansion).\nRepeat steps 3.4–3.8 as necessary until enough cells are obtained.\n\tNOTE: Try to collect as many colonies as possible for expansion rather than planning to amplify the cultures via passaging since each passage induces RPE dedifferentiation.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}