{
  "id": 18365,
  "origin_website": "Jove",
  "title": "Profiling Ubiquitin and Ubiquitin-like Dependent Post-translational Modifications and Identification of Significant Alterations",
  "procedures": [
    "1. Generation of stable cell lines expressing 6His-Flag-Ubl\nNOTE: Co-transfection of HEK-293T cells with pCCL-6HF-Ubl, pVSVG and delta-Helper.\nDay 0: Seed 293T cells in a 6-well plate to obtain 50-70% confluence the day after.\nDay 1: Co-transfect 50-70% confluent cells with a mix of 1 µg of pCCL-6HF-Ubl or pCCL-GFP, 1 µg of pVSVG and 1 µg of delta-Helper vectors, using a transfection reagent and protocol for lentivirus production. After 6 h of transfection, change the medium to a fresh one corresponding to cells to be transduced. Seed the cells to be transduced in a 6 well plate in order to obtain a 10-20% confluence the day after (the day of starting the transduction).\nDay 2: 24 h after transfection, recover the medium containing lentiviral particles and filter using 0.45 µm filters. If needed, add fresh medium at this point in order to produce a second batch of lentiviruses. Replace the medium of cells to be transduced (10-20% confluence) by the one containing lentiviruses.\n\tNOTE: Lentiviral medium can be kept at +4 °C for several days before transduction or stored at -80 °C for months.\nIncubate the cells with lentiviruses between 24 h to 72 h in a standard incubator (37 °C, 5% CO2), and then change the medium for fresh standard one. If possible, check GFP expression using an inverted fluorescent microscope to evaluate efficiency of transduction: percentage of expressing cells and relative level of expression per cell. If no fluorescence is detected, wait for additional 2-3 days as expression may take longer depending on cells type to be transduced.\nIf GFP control is positive, grow all cells until having enough to perform an expression control of 6HF-Ubl by immunofluorescence and Western blot using anti-Flag antibody.\n2. Double purification of modified proteins",
    "NOTE: Buffer 1: 6 M Guanidinium-HCl, 0.1 M Na2HPO4/NaH2PO4, pH 8.0, 0.5% Triton X-100.\nBuffer 2: 50 mM NaH2PO4, 150 mM NaCl, 1% Tween20, 5% Glycerol, pH 8.0.\nBuffer 3: 100 mM NH4HCO3, pH 8.0.\nCell lysis: Once ready, wash culture dishes at least one time with phosphate-buffered saline (PBS) at room temperature (RT) and proceed to cell lysis or, alternatively, flash freeze in liquid N2 and store at -80 °C. For lysis, add 2 mL of Buffer 1 per a 15 cm dish at RT. Use a cell scraper to recover all lysates in 50 mL conical centrifuge tubes (final volume about 20 mL).\nSonicate the lysates three times for 30 s separated by a 1 min pause.\nCentrifuge the sonicated lysates at 15,000 x g for 15 min.\nTransfer the supernatant to a new tube using a cell strainer (40 µm).\nDetermine samples' concentration and adjust, if necessary, to obtain the same amount of proteins and same volume. Use a total amount of protein between 50 and 100 mg (10 dishes with 15 cm diameter for MiaPaCa-2 cells).\nAdd Ni2+-NTA beads, using 2 µL of beads per 1 mg of protein.\nRotate at 30 rpm during 2.5 h at RT.\nPellet the beads at 500 x g for 5 min.\nWash the beads with 1 mL of Buffer 1, transferring the samples to a 1.5 mL microcentrifuge tube, then transfer the tubes on ice. Perform all the next steps on ice or at 4 °C.\nWash two times with 1 mL of ice-cold Buffer 2 containing 10 mM imidazole.\nTo elute bound proteins, add 600 µL of Buffer 2 containing 250 mM imidazole and rotate for 2 h at 4 °C.",
    "Pellet the beads by centrifugation at 500 x g for 1 min. Transfer the supernatants to new, pre-cooled, 1.5 mL tubes and add 50 µL of anti-Flag M2 antibody conjugated beads.\nRotate at 30 rpm for 2.5 h at 4 °C, then wash 2 times with 500 µL of Buffer 2, then 2 times with 500 µL of Buffer 3.\nFor the final elution, add 100 µL of Buffer 3 containing a Flag peptide at 0.1 µg/µL and rotate at 4 °C for 1.5 h.\nCentrifuge at 500 x g for 1 min and transfer the supernatants to new pre-cooled tubes.\nTake 10% (10 µL) to load on SDS-PAGE and perform a silver staining of the gel to control the purification quality. If the purification looks good, analyze the 90% left by LC-MS/MS.\n3. Processing of mass spectrometry data to generate profiles of Ub/Ubls PTMs and to identify significant differences between them\nNOTE: Results from MS analysis contain many information including the total number of peptides as well as the peak area values (mean of TOP 3 peptide area10) for each protein identified in each samples. These data can be processed using either the peptide count numbers or the peak area values, or both. For calculation with peak areas, because these values are usually in the range of 106, it is necessary to divide them by this order before applying the same formulas as below. The results obtained with both methodologies of counting should show a strong correlation as it usually does. For each identified protein, use the following formulas where:\nv1 imgsrc://cloudfront.jove.com/files/ftp_upload/60402/60402eq1.jpg peptides values in non-treated ubiquitin sample (e.g., Ub - drug)\nv2 imgsrc://cloudfront.jove.com/files/ftp_upload/60402/60402eq1.jpg peptides values in Gemcitabine treated ubiquitin sample (e.g., Ub + drug)\nk1 imgsrc://cloudfront.jove.com/files/ftp_upload/60402/60402eq1.jpg peptides values in non-treated control GFP sample (e.g., GFP - drug)",
    "k2 imgsrc://cloudfront.jove.com/files/ftp_upload/60402/60402eq1.jpg peptides values in Gemcitabine treated control GFP sample (e.g., GFP + drug).\nNormalization: Normalize values between drug treated cells and untreated cells for Ubiquitin and GFP using the following formulas. Normalized v = V and normalized k = K.\n\tV1=v1.(∑v1+ ∑v2) / (2. ∑v1) ; V2=v2.(∑v1+ ∑v2) / (2. ∑v2)\n\tK1=k1.(∑k1+ ∑k2) / (2. ∑k1) ; K2=k2.(∑k1+ ∑k2) / (2. ∑k2)\nRemoval of background: Using the following formulas, subtract values in control sample (GFP) from values in the ubiquitin sample to obtain specific values (V'1 and V'2) for each identified protein in both conditions.\n\tV'1=V1-K1 if V1-K1≥0 ; V'1=0 if V1-K1<0\n\tV'2=V2-K2 if V2-K2≥0 ; V'2 =0 if V2-K2<0\nVariation (Var) of ubiquitination. To obtain a score (between -100 and +100) for positive and negative variations of PTMs induced by a drug, use the following formula in which the difference between specific values of treated and untreated samples are divided by the sum of all values, including those in control (to penalize proteins also identified in control GFP), and multiply by 100.\n\tVar = (V'2-V'1)/(V1+K1+V2+K2)*100 ; -100<Var<100 ;\n\tVariations below -50 (repression of PTM) or above 50 (induction of PTM) are usually considered as significant.\nConfidence (Conf). Use the following formula to obtain a confidence value between 0 and 100%,:\n\tConf = ((V1+V2)2/(1+V1+V2+K1+K2)2)*100 - 100/(1+V'1+V'2) ; =0 if <0\n\tValues above 50 are usually considered to be confident.\nTo obtain a nicer distribution of induction/repression values and to consider both variation and confidence parameters, multiply Var and Conf values using the following formula where V imgsrc://cloudfront.jove.com/files/ftp_upload/60402/60402eq1.jpg Var and C imgsrc://cloudfront.jove.com/files/ftp_upload/60402/60402eq1.jpg Conf\n\t=SI(V2>0;((V2*C2)^2)/(10^6);-((V2*C2)^2)/(10^6))",
    "NOTE: As peak area values are usually more accurate than peptide counting, it is possible to use specific software which are dedicated to the interpretation of this kind of data such as Perseus (https://www.biochem.mpg.de/5111810/perseus), following recommendations of use.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}