{
  "id": 16432,
  "origin_website": "Jove",
  "title": "Sample Preparation and Relative Quantitation using Reductive Methylation of Amines for Peptidomics Studies",
  "procedures": [
    "The following procedure for peptide extraction and reductive methylation was adapted from previously published procedures24,25,26,27. This protocol followed the guidelines of the National Council for Animal Experimentation Control (CONCEA) and was approved by the Ethics Commission for Animal Use (CEUA) at Bioscience Institute of Sao Paulo State University. The protocol steps are shown in Figure 1.\nNOTE: Prepare all aqueous solutions in ultrapure water.\n1. Peptide extraction\nCell culture\n\t\nCultivate SHSY5Y cells in a 15 cm dish at 37 °C under 5% CO2 in Dulbecco's modified Eagle's medium containing 15% fetal bovine serum and 1% Penicillin-Streptomycin.\nUse 2-3 plates for each sample. Grow the cells to 100% confluence.\nAfter treatment intended, wash the cells twice with phosphate-buffered saline. Next, add 10 mL of Phosphate-buffered saline, scrape the cells and collect into a 15 mL tube.\nCentrifugate at 800 x g for 5 min and remove the supernatant. Resuspend the pellet in 1 mL of ultra-purified deionized water at 80 °C.\nTransfer the contents of the tube (cellular lysate) to a 2 mL microfuge tube.\nAnimal tissues (mainly nervous tissue):\n\t\nAnesthetize wild-type male adult Danio rerio (zebrafish) with a lethal dose of MS 222 (100 mg/L) and immediately subject it to 8 s of microwave radiation to inactivate peptidase and protease.\n\t\tNOTE: A household-type microwave oven can be used. A 900 W microwave was used for 8 to 10 s at full power. The microwave used must be able to raise the brain temperature to > 80 °C within 10 s. Reproducibility in heating between samples would also be benefited by placing the tissue in the same location in the microwave.\nAfter heat-inactivation, collect the whole brain in a 2 mL microfuge tube and freeze at −80 °C until analysis.",
    "Resuspend the tissue sample in 1 mL of ultra-purified deionized water at 80 °C. Sonicate the tissue with a probe using 30 pulses (4 Hz) of 1 s.\n\t\tNOTES: For liver and kidney tissues, use a mechanical homogenizer at 10,000-30,000 rpm for 20 s. For muscular tissues, grind the tissue in liquid nitrogen using a porcelain crucible and pestle. The following steps are the same for the cellular lysate or the homogenate tissue.\nIncubate the cellular lysate or homogenate tissue at 80 °C for 20 min. Next, cool it on ice for 10-30 min.\nAdd 10 µL of 1 M HCl stock solution for each 1 mL of sample volume to obtain a final concentration of 10 mM. Mix by vortexing for 20 s and further incubate on ice for 15 min.\n\tNOTE: Before acidifying, ensure the sample is completely cooled to avoid breaking the peptide bonds caused by acidification at elevated temperatures.\nCentrifuge the cellular lysate or the homogenate tissue at 12,000 x g at 4 °C for 15 min. Collect the supernatant in low binding protein microcentrifuge tubes and store it at -80 °C.\nClean the ultrafiltration devices (10 kDa cut-off filters) by adding water and centrifuge at 2300 x g for 3 min. Repeat this step two more times.\nPlace the supernatant in the pre-washed 10 kDa cut-off filters and centrifuge at 2,300 x g at 4 °C for 50 min in a refridgerated centrifuge. The flow-through represents the peptide extract.\nDesalt the samples on reversed-phase cleanup columns according to the manufacturer's instructions using acetonitrile (ACN) and trifluoroacetic acid (TFA) solutions as described below:\n\t\nEquilibrate the column with 1 mL of 100% ACN.\nWash the column with 1 mL solution of 5% ACN with 0.1% TFA.\nLoad the complete volume of the sample in the column.",
    "Wash the column with 1 mL solution of 5% ACN with 0.1% TFA\nElute the peptides from the column with a 1.8 mL solution of 100% ACN with 0.15% TFA in protein low binding microcentrifuge tubes.\nDry the sample completely in a vacuum centrifuge. Set the concentration method for organic solvents and temperature at 30 °C. The concentration time is monitored on display.\n\t\nStore the samples at −80°C until the next step.\n2. Peptide quantification with fluorescamine\nNOTE: The amount of peptide can be estimated using fluorescamine at pH 6.8 as previously described11,28. This method consists of the attachment of a fluorescamine molecule to the primary amines present in the lysine (K) residues and/or the N-terminal of peptides. The reaction is performed at pH 6.8 to guarantee that the fluorescamine reacts only with the amino groups of the peptides and not with free amino acids. The fluorescamine is measured by using a spectrofluorometer at an excitation wavelength of 370 nm and an emission wavelength of 480 nm.\nPrepare different concentrations of the standard peptide (0.05, 0.1, 0.15, 0.2, 0.3, 0.5 and 0.7 µg/µL) and store the aliquots at -20 °C.\n\tNOTE: The peptide 5A (LTLRTKL) is suggested since it has a known composition and concentration.\nPrepare fluorescamine stock solution (0.3 mg/mL) in acetone. Aliquot quickly in microcentrifuge tubes (1 mL), seal using parafilm, and store at -20 °C in the dark.\nPrepare 0.2 M Phosphate buffer (PB) at pH 6.8.\n\tNOTE: Prepare 0.2 M PB by adding 0.1 M phosphate buffer pH 6.8 (26.85 mL of Na2HPO3 1M) and 0.1 M phosphate buffer pH 6.8 (23.15 mL of NaH2PO3 1M) to 250 mL of water\nResuspend the peptide samples in 100-200 µL of ultra-purified water.",
    "Pipette 2.5 µL of the standard peptide concentrations and samples onto the white 96-well plate for fluorescence assays in triplicate. Add 25 µL of 0.2 M Phosphate buffer.\nAdd 12.5 µL of fluorescamine with a multichannel pipette. Homogenize gently for 1 min on the orbital rotator shaker.\nNext, add 110 µL of water with a multichannel pipette to stop the reaction.\n\tNOTE: Transfer the fluorescamine stock solution and ultrapure water to two reservoirs to pipette these solutions with a multichannel pipette.\nAdjust the following reading parameters on the spectrofluorometer: Read the samples from the top, excitation wavelength at 370 nm, and emission wavelength at 480 nm.\nRead the plate on the spectrofluorometer.\n3. Reductive methylation of amines labeling\nNOTE: This isotopic labeling method is based on the dimethylation of amine groups with deuterated and non-deuterated forms of formaldehyde and sodium cyanoborohydride reagents. The final product of this reaction adds 28 Da, 30 Da, 32 Da, 34 Da, or 36 Da to the final mass of each peptide at each available labeling site (lysine or N-terminal). This reaction produces an m/z difference in the peptides labeled with different forms observed in the MS spectrum (Table 1).\nCAUTION: Proper safety equipment should be used to handle these compounds, and care should be taken to minimize exposure. Procedures with formaldehyde and sodium cyanoborohydride reagents should be performed in a fume hood because they are very toxic (including weighing the sodium cyanoborohydride). During the quenching reaction and acidification, a toxic gas (hydrogen cyanide) may be generated.\nPrepare the following fresh solutions from the stock or reagents on the day of the procedure in ultrapure water:\n\t\nDilute the stock of 37% Formaldehyde (CH2O) to 4%.\nDilute the stock of 20% Formaldehyde Deuterated (CD2O) to 4%.",
    "Dilute the stock of 20 % Deuterated C13 Formaldehyde (13CD2O) to 4%.\nPrepare 0.6 M NaBH3CN.\nPrepare 0.6 M NaBD3CN.\nPrepare a solution of 1% Ammonium bicarbonate.\nPrepare a solution 5% Formic acid.\n\t\tNOTE: Regarding the relative quantitation of peptides, as different experimental schemes can be performed depending on the number of labels used, attention is necessary during the chemical labeling procedure. It is recommended to separate small aliquots of the labels in separate racks with the respective samples to be labeled to reduce the potential for human error in adding the wrong reagent to the sample tubes.\nPrepare each sample containing up to 25 µg of the peptide. Samples must not contain Tris or Ammonium Bicarbonate.\n\tNOTE: The quantities described below are sufficient for each sample in a volume of 100 µL.\n\tProceed with steps 3.3-3.8 in a fume hood.\nAdd 1/10th volume of 1 M TEAB to the samples (final concentration of the solution 100 mM of TEAB). Check the pH with a pH indicator paper; it must be between 5-8. Adjust with HCl or NaOH if needed.\nAdd 4 µL of non-deuterated, deuterated Formaldehyde or C13 deuterated Formaldehyde according to the established labeling scheme. Mix for 5 s by vortexing.\nAdd 4 µL of NaBH3CN (0.6 M) or NaBD3CN (0.6 M) according to the established labeling scheme. Mix for 5 s by vortexing.\nIncubate in a fume hood for 2 h at room temperature, mixing every 30 min.\nRepeat steps 3.4 and 3.5. Incubate the samples in a fume hood overnight at room temperature.\nAdd 16 µL of Ammonium bicarbonate (1%) and mix by vortexing. Place the sample on ice, add 8 µL of formic acid (5%), and mix by vortex for 5 s.",
    "Combine the samples, adjust the pH to 2-4 and desalt the combined samples on reversed-phase cleanup columns as previously described in step 1.8.\nDry the sample completely in a vacuum centrifuge. Set the concentration method for organic solvents and temperature at 30 °C. The concentration time is monitored on display.\nStore the samples at -20 °C.\n4. Liquid chromatography and mass spectrometry\nPerform LC-MS analysis using a nanoHPLC system coupled to a MS instrument compatible with methyl tags.\n\t​NOTE: A variety of MS instruments are compatible with RMA labeling.A nanoHPLC system coupled to Orbitrap is typically used to perform LC-MS analysis through a nanoelectrospray ion source. First, the sample is loaded into a precolumn and peptides separated in an analytical column. The elution of peptides is performed using a linear gradient of 5%-45% acetonitrile, in 0.1% formic acid, during 90 min, with a flow of 200 nL/min. The mass spectrometer is set to function in data-dependent mode. Each full scan is acquired at an intensity of 10-30 eV, 2.3 Kv, and then the ten highest peaks are selected for collision-induced dissociation (CID) fragmentation. The injection time is set on the ion trap at 100 ms, and the Fourier Transform (FT)-MS injection is fixed with a resolution of 1000 ms 30,000 at m/z 300-1800. A minimum of 5000 counts and a dynamic exclusion of 70 s is used to perform fragmentation scanning.\n5. Relative quantitation of peptides\nNOTE: The MS spectra are analyzed in the mass spectrometer software. Peak groups of labeled peptides with different tags are identified in the MS spectra. The relative quantitation is calculated by the intensity of each monoisotopic peak. Each treated group is compared to the respective control group.",
    "Right double-click on the raw sample file to open the spectrum analysis software. Load the Retention time (RT) and MS spectrum (EM) chromatograms in two tabs, top and bottom, respectively.\nRight-click once sequentially on the Display and Mass options icons in the software toolbar and set the mass precision to four decimals.\nPosition the mouse cursor anywhere on the RT tab. Look for the retention time of the corresponding ion to be analyzed and click the right mouse button. The MS spectrum of the selected time will automatically be shown in the EM tab.\nPosition the mouse cursor anywhere on the EM tab. Look for the ions to be analyzed.\nRight-click and hold in an adjacent region to the left near these ions. Then, drag the mouse to the right at the desired range to zoom the region of interest.\nKeep the mouse positioned on the EM tab and click on the right or left keyboard arrows to define the range of ions to be analyzed.\nPosition the mouse cursor the RT tab again at the beginning of the desired time interval.\nRight-click and drag the mouse until the chosen time value. Leave the button. The accumulated intensity of the ions will automatically be shown on the EM tab.\nCollect the m/z, z, and ion intensity data on a spreadsheet.\n\tNOTE: The monoisotopic mass of each peptide without added methyl groups is calculated from the following formula:\nMass unmodified peptide = (m/z a  x  z) - (C a  x  T) - (1.008  x  z)\nm/za is the observed mass to charge value for the monoisotopic peak for each peptide labeled with different combinations of tags (a =1, 2, 3, 4 or 5, corresponding to the sample number).\nz is charge state.",
    "Ca is the monoisotopic mass of a pair of methyl groups:\n\tFor a=1, Ca = 28.0313 (the net addition of two CH3 groups to the primary amine)\n\tFor a=2, Ca = 30.0439 for two CHD2 groups\n\tFor a=3, Ca = 32.0564 for two CD2H groups\n\tFor a=4, Ca= 34.0690 for two CD3 groups\n\tFor a=5, Ca = 36.0757 for two 13 CD3 groups\nT is the number of pairs of methyl groups incorporated into the peptide. This can be calculated from the following formula when five tags are used: T=z*(m/z5 - m/z1)/8. For peptides that contain a single primary amine and therefore are labeled with only two methyl groups present peak overlaps on the MS spectra when adjacent labels are used. The peak intensity of each labeled peptide can be corrected using the equations described by Tashima and Fricker25.\n6. Peptide Identification\nTo identify peptides, analyze the MS/MS data using a database search engine29,30.\nTo calculate the false discovery rate (FDR) using the decoy fusion method, search a decoy database.\n\t​NOTE: The search parameters generally used are no enzyme specificity; precursor mass tolerance set 15-50 ppm; fragment ion mass tolerance of 0.5 Da; variable modifications: reactive amines from Lys residues and N-terminus of the peptides isotopic methylated labels (L1 (+28), L2 (+30), L3 (+32), L4 (+34) and L5 (+36)), oxidized methionine (+15.99 Da) and acetylation (+42.01 Da).\nThen, sort the peptides by their average of local confidence to select the best spectra to annotate and filter them by FDR ≤5%.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62971/62971fig01.jpg\nFigure 1: Peptidomic studies workflow. Steps of peptide extraction and Reductive Methylation of amines. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62971/62971fig01large.jpg]Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}