{
  "id": 9324,
  "origin_website": "Jove",
  "title": "Isolation and Respiratory Measurements of Mitochondria from Arabidopsis thaliana",
  "procedures": [
    "This protocol is used for the isolation of intact mitochondria from Arabidopsis thaliana organs grown on soil using continuous colloidal density gradients. All procedures following the collection of the material are carried out at 4 °C.\n1. Preparation of Grinding Medium, Wash Buffer, and Gradient Solutions\nPrepare 300 mL of grinding medium (minus ascorbate and cysteine) and 200 mL of 2x wash buffer per Table 1 one day prior to the isolation, keep them cold at 4 °C.\n\tNOTE: Add sodium ascorbate and L-cysteine (free base) to a final concentration of 17.84 mM and 20.36 mM, respectively, to the grinding medium on the morning of the isolation. If the mitochondria are to be used for western blot or blue native-polyacrylamide gel electrophoresis (BN-PAGE) analyses, make up 2x wash buffer without BSA.\nPrepare gradients on the morning of mitochondrial isolation (Figure 1 and Table 1).\n\t\nMake the heavy and light gradient solutions in two beakers; 35 mL of each is sufficient for two gradient tubes.\nWash the chambers of the gradient pourer and PVC peristaltic tubing with deionized water and ensure even flow through the tubing from all tubing.\nPlace 2 centrifuge tubes (50 mL) at a slight angle on ice with the PVC peristaltic tubing outlets taped to the inside of the tubes to ensure the gradient solution runs down the side of the tubes.\nClose the connection between the inner and outer chambers (black lever down). Place gradient pourer on a magnetic stirrer with a small stir bar in the inner chamber.\nPour the 35 mL heavy gradient solution into the inner chamber (chamber with tubing outlet). Dispense the heavy gradient solution into the two centrifuge tubes placed on ice until half is remaining with the peristaltic pump rate set to fast (300 mL/h).",
    "Pour the 35 mL light gradient solution into the outer chamber (chamber without tubing outlet). Open the connection between the chambers (push black lever up halfway) and allow solutions to mix gently. Mix the solutions using the magnetic stirrer.\nAllow the solutions to run slowly (60 mL/h) until all of the gradient mix has been dispensed from the chambers resulting in two 0 - 4.4 % (w/v) polyvinylpyrrolidone (PVP) gradient-filled tubes. Keep the gradients on ice until ready to use in Step 2.12.\n\t\tNOTE: Once the gradient has been prepared, dilute 2x wash medium to 1x with prechilled-deionized water and keep cold at 4 °C.\n2. Homogenization and Mitochondrial Isolation\nCut whole rosette tissue from 4-week old Arabidopsis plants grown on soil with scissors, at least 80 plants will be required for 1 prep.\n\tNOTE: 10 - 14 day old water cultures, minimum 5 pots/prep, or 2-week old seedlings grown on Murashige & Skoog Basal Salt Mixture (MS) agar plates, minimum of 4 plates, may also be used.\nPlace half of the plant material that has been cut into small pieces in a pre-cooled 4 °C large mortar and pestle with 75 mL of grinding medium (Table 1), and grind extensively for several minutes until no big pieces of tissue are left.\nPre-wet 4 layers of filtration material (22 - 25 µm pore size) with grinding medium and filter homogenate through the 4 layers of filtration material through a plastic funnel into a 500 mL conical flask.\nGrind the remaining half of the tissue with another 75 mL of grinding medium.\nCombine homogenates in the filtration materials and filter as much as possible homogenate through.",
    "Grind the remaining tissue remaining on the filtration material again with the remaining 150 mL of grinding medium, filter again into the 500 mL conical flask.\nCentrifuge the filtered homogenate in 8 pre-chilled 50 mL plastic centrifuge tubes at 2,500 x g at 4 °C in a fixed angle rotor for 5 min.\nPour the supernatant into clean centrifuge tubes (50 mL; avoid disturbing the green pellet) and centrifuge at 17,500 x g at 4 °C for 20 min in a fixed angle rotor.\nDiscard all but <3 mL of the supernatant by aspiration (or gently pour off without disturbing the pellet). Gently resuspend the pellet in the residual supernatant using a small fine paintbrush.\nAdd 10 mL of 1x wash buffer to each tube and combine 4 tubes into 1 clean centrifuge tube (i.e., resulting in 2 tubes).\nFill these tubes with 1x wash buffer to 50 mL and repeat steps 2.7 - 2.9.\nPool crude mitochondrial pellets into 1 tube using a dropper and disperse evenly with the fine paintbrush (a small amount of wash buffer may be used but the final volume needs to be less than 3 mL to fit on top of the gradient). Gently layer the mitochondrial suspension with a dropper onto the 2 continuous 0 - 4.4 % (w/v) PVP gradients.\nBalance tubes by weight (using 1x wash buffer) and centrifuge at 40,000 x g at 4 °C for 40 min. Ensure the break is turned off. Mitochondria will migrate to a band near the bottom of the tube, or may be present in the heavy solution at the bottom of the tube (identified by a cloudy, yellowish band; Figure 2).\nCarefully remove the upper 5 cm of solution above the mitochondrial band by aspiration.",
    "Distribute the remaining solution containing the mitochondria into 2 clean tubes and fill with 1x wash buffer. Evenly distribute the colloidal density gradient and mitochondria by covering the mouth of the tube with a plastic paraffin film and inverting several times. Centrifuge for 15 min at 31,000 x g at 4 °C with slow braking.\n\tNOTE: Before centrifugation, make sure the mitochondria and the remaining colloidal density gradient are evenly distributed. Otherwise, the colloidal density gradient may concentrate at the bottom of the tube and prevent pelleting of the mitochondria.\nRemove the supernatant by aspiration, fill the tube with 1x wash buffer up to 50 mL, and invert again to ensure mixing. Centrifuge for 15 min at 31,000 x g at 4 °C with slow braking.\nAspirate the supernatant and collect the mitochondrial pellets in as small a volume (~500 µL) as possible using a pipette with modified 200 µL tips (cut the tip a little above its end to increase its opening). Place the mitochondria into a 1.5 mL tube and keep on ice for immediate use or store at -80 °C.\n\tNOTE: If mitochondria will be used for sodium dodecyl sulfate-polyacrylamide gel electrophoresis (SDS-PAGE), BN-PAGE, or immunoblot analyses, use 1x wash buffer without BSA for the final washes (i.e., step 2.15 and 2.16).\nDetermine the protein concentration of mitochondria using the Bradford method.\n\tNOTE: For BN-PAGE centrifuge aliquots at 4 °C, and store pellet at -80 °C until use. For oxygen consumption measurements, only freshly isolated mitochondria can be used.\n3. Oxygen Consumption Measurements\nNOTE: Oxygen consumption by freshly isolated plant mitochondria can be analyzed with a Clark-type oxygen electrode, enabling the determination of mitochondrial intactness, cytochrome c pathway activity, and alternative pathway activity.\nSoftware installation",
    "Install licensed oxygen monitoring software onto the computer used for oxygen consumption measurements.\nPreparation of respiration medium, substrates, chemical stock solutions, and the Clark-type oxygen electrode\n\t\nPrepare respiration medium (300 mM sucrose, 10 mM NaCl, 5 mM KH2PO4, 2 mM MgSO4, 0.1 % (w/v) bovine serum albumin (BSA), 10 mM TES (pH 7.2)) used for oxygen consumption assays.\nPrepare substrates, inhibitors, and effectors used for measuring mitochondrial respiration (Table 2). These can be prepared earlier and stored at -20 °C.\n\t\tNOTE: Neutralize the pH of acidic solutions such as organic acids to pH 7.0 using NaOH before use.\nWarm the respiration medium to the same temperature as the assay chamber (25 °C).\nAssemble the Clark-type oxygen electrode as described in the protocol of the manufacturer.\nPlace 1 mL air-saturated water (air-saturated water is obtained by vigorously shaking a small quantity of deionized water in a large conical flask) in the measuring chamber. To switch on the stirrer, click the \"Stirrer Speed\" button. Click the \"On\" button and set the stirrer speed to 65 rpm. Click \"OK\" to continue. Stir the water continuously at 25 °C.\nCalibration of oxygen electrode\n\t\nWarm the water that will be used for calibration to the same temperature as the assay chamber (25 °C).\nWait for the current to stabilize and calibrate the oxygen electrode.\nTo start calibration of the oxygen electrode, click the \"Calibrate\" button, select \"Liquid Phase Calibration,\" and then \"Air Saturated Water.\"\nA new window will open (Oxygen Calibration (Liquid Phase) - Step 1 of 5). Select the channel to calibrate (the channel the electrode control box is attached to) and enter variables (set \"Chamber Temperature\" to 25 °C and \"Atmospheric Pressure\" to 101.32 kPa). Click \"OK \"to continue.",
    "In the next step (Step 2 of 5), setup the stirrer speed (65 rpm) and click \"OK\" to continue.\nIn step 3 of 5, wait for the signal to reach a plateau. The term \"Plateau reached, press OK to continue\" will appear in the box. Click \"OK\" to continue.\nIn step 4 of 5, establish zero oxygen in the chamber by adding 5 mg sodium dithionite. Click \"OK\" to continue.\n\t\tNOTE: A decline in oxygen concentration should be visible in the trace and should reach 0.\nIn the last step of calibration (Step 5 of 5), wait for the signal to reach a plateau. The term \"Plateau reached, press OK to continue\" will appear in the box. Click \"OK\" to continue.\nClick \"Save Calibration\" to save the calibration. A new window will open. Click \"OK\" to confirm to save the new calibration for the oxygen control box.\n\t\tNOTE: After successful calibration, the labeling \"Oxygen (nmol/mL)\" will appear on the y-axis.\nAfter calibration, clean the measuring chamber by rinsing the chamber with water (at least 5 - 10 times) to ensure proper cleaning. Place 1 mL of respiration medium into the measuring chamber and allow the membrane to equilibrate for a few minutes until the oxygen consumption trace is linear.\nAdapt the scale of the oxygen consumption trace to get a good slope view. Click \"Zoom XY\" and enter variables (set \"Oxygen\" to 0 - 300 and the \"Time Axis\" to 0 - 45 min).\nDetermination of mitochondrial integrity\n\t\nWith plunger open, add 970 µL air-saturated respiration medium to the reaction chamber.\nAdd 30 µL isolated mitochondria or 150 µg of total mitochondrial protein as determined after mitochondria isolation (total protein needs to be included in calculations afterwards) to the reaction chamber using a pipette with a cut tip.",
    "Stir the mitochondrial suspension continuously using a magnetic stirrer bar (65 rpm) at 25 °C to air-saturate the solution.\nSeal the chamber with the plunger, click \"Start Recording\" to record oxygen consumption, and allow the oxygen consumption trace to stabilize (1 - 2 min).\nDetermine the rate of oxygen consumption manually after adding 10 mM ascorbate and 25 µM cytochrome c for 5 min to get the \"before detergent\" rate.\n\t\tNOTE: To label the addition of substrates, inhibitors, and effectors directly in the trace, click the \"Add Event Mark\" button and enter the corresponding label designation. Click \"OK\" to continue.\nDetermine the rate of oxygen consumption manually for 3 min after adding 0.05% (v/v) detergent to give the \"after detergent\" rate. Click \"Stop Recording.\"\nClick the \"Rates of Change Table\" button. 2 cursors will appear as vertical lines on the graph screen. Click and drag the pair of rate cursors to the required positions in the trace to define the rate interval. Move the rate interval along the trace using the left rate cursor. Set the rate interval itself using the right rate cursor. The oxygen monitoring software automatically draws a line of best fit between the two cursors while moving the rate interval cursors along the trace.\nOnce the desired rate interval and position has been defined, enter the rate into the table with a right click on 1 of the 2 cursors, and select \"Add Rate to Table.\" Click the \"Add\" button to confirm to display the rate on the main rate table.\nCalculate mitochondrial integrity by dividing the \"before detergent\" rate by the \"after detergent\" rate, expressed as a percentage, and subtract it from 100.\nDetermination of mitochondrial respiration",
    "With plunger open, add 970 µL of air-saturated respiration medium to the reaction chamber. Add 500 µM ATP and 30 µL isolated mitochondria or 150 µg of total mitochondrial protein using a pipette with a cut tip to the respiration medium in the reaction chamber.\nStir the mitochondrial suspension continuously using a magnetic stirrer bar (65 rpm) at 25 °C.\nClose plunger, click \"Start Recording\" to record oxygen consumption, and wait for 1 - 2 min for oxygen consumption rate to stabilize (when the oxygen consumption trace is linear). Add 5 mM succinate. Record the rate of oxygen consumption for about 2 min.\n\t\tNOTE: To label the addition of substrates, inhibitors, and effectors directly in the trace, click the \"Add Event Mark\" button and enter the corresponding label designation. Click \"OK\" to continue.\nAdd 1 mM adenosine diphosphate (ADP). Continue recording the rate of oxygen consumption for 2 min.\nAdd 1 mM NADH. Record the rate of oxygen consumption for 4 - 8 min. This rate is the capacity of respiration via cytochrome oxidase.\nAdd 1 mM potassium cyanide (KCN) (or 2.5 µM myxothiazol or 5 µM antimycin A) to inhibit the cytochrome c pathway, and continue to record for about 2 min to observe oxygen consumption via the alternative oxidase.\nAdd 5 mM dithiothreitol (DTT) and 10 mM pyruvate to fully activate the alternative oxidase. Continue to record for 5 - 7 min: This is the capacity of the alternative oxidase.",
    "Add 500 µM n-propyl gallate (nPG), and record for 2 min. This assesses residual oxygen consumption rate that cannot be chemically inhibited. Subtract this rate from the other rates recorded, as it is not likely to be mitochondrial in origin. Oxygen consumption still occurring after inhibition of the cytochrome c and AOX pathway (by KCN and nPG) is very likely to come from peroxidases present as contaminants in the isolated mitochondria9.\nClick \"Stop Recording.\"\nClick the \"Rates of Change Table\" button and enter the rate into the table with a right click on one of the two cursors, and select \"Add Rate to Table\". Click the \"Add\" button to confirm to display the rate on the main rate table.\n\t\tNOTE: When adding effectors dissolved in organic solvents (e.g., antimycin A, nPG, myxothiazol), the chamber and plunger must be rinsed with ethanol and then water to ensure proper cleaning.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}