{
  "id": 15380,
  "origin_website": "Jove",
  "title": "Isolation of Giant Lampbrush Chromosomes from Living Oocytes of Frogs and Salamanders",
  "procedures": [
    "General information about frogs and salamanders, as well as sources of animals, can be found at the following websites: Xenbase (http://www.xenbase.org) and Sal-Site (http://www.ambystoma.org). This protocol follows the animal care guidelines of the Department of Embryology of the Carnegie Institution for Science.\n1. Solutions\nMake 10 L \"frog water\": Add 10 mL of 1 M CaCl2 and 10 mL of 1 M NaHCO3 to 10 L deionized or dechlorinated H2O with stirring.\nMake 1 L 20% paraformaldehyde: Make 1 L of 4 mM Na2CO3. In a chemical hood add 200 g of powdered paraformaldehyde, and heat to about 80 oC to dissolve. Cool, and filter through filter paper. Caution: paraformaldehyde is toxic and must be handled with care. Alternatively, purchase commercial paraformaldehyde solution.\nMake 1 L amphibian anesthetic solution: Add 1.5 g of ethyl 3-aminobenzoate methanesulfonate to 1 L frog water. Store at room temperature.\nMake 1 L oocyte culture medium OR214: 82.5 mM NaCl, 2.5 mM KCl, 1 mM CaCl2, 1 mM MgCl2, 1 mM Na2HPO4, 5 mM HEPES (from 500 mM stock, pH 8.3). The final pH will be about pH 7.8. Add 100 mg ampicillin and 100 mg streptomycin to prevent bacterial growth.\nMake 1 L GV isolation solution: 83 mM KCl, 17 mM NaCl, 6.5 mM Na2HPO4, 3.5 mM KH2PO4, 1 mM MgCl2, 1 mM dithiothreitol (DTT). Adjust to pH 7.0.\nMake 100 mL GV dispersal solution: 20.7 mM KCl, 4.3 mM NaCl, 1.6 mM Na2HPO4, 0.9 mM KH2PO4, 1 mM MgCl2, 1 mM dithiothreitol (DTT), 0.1% paraformaldehyde. Adjust to pH 7.0. To facilitate more rapid dispersal of the nuclear gel, add 10-50 µM CaCl2.",
    "Make 500 mL subbing solution. Swell 0.5 g of commercial gelatin in 20 mL H2O for 5 - 10 min. Add 500 mL boiling H2O and carefully swirl to dissolve the gelatin. Cool and add 50 mg CrK(SO4)2 ·12 H2O. Filter with suction and store at 4 oC.\nMake 10 mL mounting medium. Dissolve 10 mg phenylenediamine in 5 mL PBS (135 mM NaCl, 2.5 mM KCl, 4.3 mM Na2HPO4, 1.5 mM KH2PO4, adjusted to pH 9). Add 5 mL glycerol. Store in 250 µL aliquots at -80 oC.\n2. Materials\nFor subbed slides, place 3 inch x 1 inch glass microscope slides in a commercial detergent solution and rub them to remove any contaminants. Place in a slide rack and rinse well in tap water, then in deionized water. Dip the slides in the subbing solution, drain at an angle, and bake overnight at 60 oC.\nFor plastic squares, cut 25 mm squares from a sheet of 1 mm thick poly(methyl methacrylate). Drill a 5 mm round hole in the center of each square. Sand both faces and the edges of the square as well as the circumference of the hole.\n\tNOTE: As an alternative to homemade plastic squares and well slides, as described in the next paragraph, use commercial adhesive in situ PCR and hybridization chambers (25 µL). One could probably also use re-usable silicone isolators for cell culture, although this has not been thoroughly tested as yet.",
    "For well slides, melt 20 - 30 g of paraffin wax (56 - 57 oC) in a 50 mL glass beaker on a hot plate. With a 20 µL pipette, spread one 5 µL drop of paraffin on each side of the center of a subbed slide. Press a plastic square into the paraffin and place the slide onto the hot plate. The paraffin will melt and should spread evenly under the plastic square.\n\t\nRemove the slide from the hot plate and let it cool. Place a support under each end of the slide, so that the slide does not contact the tabletop during the cooling process. If the paraffin cools too rapidly, it may pull away from the central hole. Prepare 10 or more well slides: each GV preparation uses a new well slide.\nFor slide carriers for centrifugation, use specially constructed carriers for the rotor used. Several manufacturers provide centrifuges with carriers for 96 - well plastic plates. These carriers can be adapted quite easily to hold microscope slides.\n3. Isolation of Oocytes\nPlace an adult female frog (Xenopus laevis or Xenopus tropicalis) or salamander (Ambystoma mexicanum) in enough anesthetic solution to cover the animal completely. When the animal ceases movement, place it belly-up on a bed of chipped ice in a suitable container.\nWith surgical scissors make a 2 - 3 cm incision in the lower abdomen lateral to the midline. Move the internal organs gently aside to find the ovary on the side of the incision (there are two ovaries, one on each side of the abdomen). Cut out a portion of the ovary with enough oocytes for the planned experiments. Since there are thousands of oocytes in each ovary, a relatively small piece of ovary (1 - 3 cm) will usually suffice.",
    "Place one or a few pieces of ovary in OR2 saline in a large petri dish (100 mm) at room temperature. Oocytes can be stored in good condition for several days, if damaged oocytes are removed and the OR2 solution is changed daily.\nSuture the incision with surgical silk and return the animal to an individual glass bowl for recovery. Add just enough \"frog water\" to cover the animal until it regains consciousness (about 15 min). After the animal shows voluntary movements, fill the bowl with water. Although fresh water should be used, sterility is not necessary, as amphibians almost never become infected after surgery. If desired, neomycin can be applied to the sutures. The wound usually heals completely after a few days and the same animal can be used again after about 2 months.\n4. Isolation of a Germinal Vesicle (GV)\nPlace a portion of ovary (10 - 20 large oocytes) in a small petri dish (35 x 10 mm) containing OR2 solution.\nRemove an oocyte from the ovary using two pairs of #5 jeweler's forceps to tear the thin stalk of tissue that connects the oocyte to the ovary wall. Place the oocyte in another small petri dish containing GV isolation medium.\n\tNOTE: The state of the LBCs depends on the size (maturity) of the oocyte. LBCs reach maximal length with prominent loops in oocytes that are slightly less than full size. The most mature oocytes often contain short chromosomes with contracted loops.\nPerform the following steps under low magnification of a dissecting microscope (field diameter approximately 10 - 20 mm).\n\t\nGrasp the oocyte with both pairs of forceps near the animal pole (dark hemisphere) and make a small tear. Look in the extruded yolk for the transparent oocyte nucleus, also called the germinal vesicle or GV.",
    "Alternatively, poke a large hole near the animal pole with one pair of forceps and gently squeeze out the GV along with yolk (Figure 2).\nGently roll the GV away from the bulk of the yolk. Usually there will be a small amount of yolk tightly adherent to the GV.\n5. Removal of the Nuclear Envelope\nFor X. laevis and X. tropicalis, transfer the GV from the isolation medium to the spreading medium within 60 s of isolation, even if there is still a little adherent yolk.\n\tNOTE: GVs of these two species \"harden\" within about 60 s if left in the isolation medium and will not spread in subsequent steps. Therefore speed is of the utmost importance when examining Xenopus GV contents.\n\t\nGrasp the nuclear envelope near the top of the GV with one pair of jeweler's forceps, taking care not to press down. Grasp the envelope with a second pair of forceps as close to the first as possible. Pull the two pairs of forceps away from each other and the GV contents will \"pop\" out free of the envelope, which adheres tightly to one or both forceps.\nPick up the GV contents in a glass pipette or an adjustable 20 µL micropipette. If using an adjustable pipette, set the pipette to 10 µL and cut off the end of the plastic tip with a razor blade. Draw in 5 µL of liquid before picking up the GV in the remaining 5 µL.\nTransfer the still-gelled nuclear contents to the center of a well slide previously filled with spreading solution. The spreading solution must have a convex surface so that a bubble is not trapped when the coverslip is added.",
    "Add a coverslip (18 mm) and place the slide in a moist chamber. The nuclear gel will slowly disperse over the next 10 - 60 min, so that the chromosomes and nuclear organelles come to lie on the surface of the glass slide.\n\t\tNOTE: GVs of the salamanders A. mexicanum and N. viridescens do not \"harden\" unduly in the isolation medium. Therefore one can proceed more leisurely with removal of the nuclear envelope than one can with Xenopus.\nRemove the nuclear envelope from a salamander GV as described in section 5.1.1, but do so in the isolation medium.\n\t\nPick up the slightly gelled GV contents with a pipette and transfer to a petri dish containing spreading solution.\nQuickly rinse out the pipette tip in the spreading solution, pick up the nuclear gel, and place it in the center of a well slide previously filled with spreading solution. Add an 18 mm coverslip and place the entire slide in a moist chamber. The nuclear sap will slowly disperse over the next 10 - 60 min and the chromosomes and nuclear organelles will come to lie on the glass surface.\n6. Preliminary Observation of LBCs and Organelles\nView the LBCs and nuclear organelles by phase contrast (conventional upright microscope) at low magnification after dispersal of the nuclear contents in the spreading chamber. Because the chamber is approximately 1 mm deep and the nuclear contents are at the bottom, use a low magnification objective with a long working distance (5X - 10X).",
    "NOTE: The major reason for examining the preparation at this time is to determine whether it is worth carrying through the next steps. In a good preparation the chromosomes are unbroken and have settled to the bottom of the chamber. Proceed to the centrifugation step within an hour of making the preparation, as this will ensure optimal attachment of the lampbrush chromosome loops to the slide.\n7. Centrifugation of the Nuclear Contents\nPlace a piece of filter paper on the coverslip and press down to remove excess liquid from the chamber.\nPut about 1 mm3 of petroleum jelly on each side of the coverslip. Melt the petroleum jelly with a metal rod heated to about 70 - 80 oC to seal the coverslip onto the underlying plastic square.\nPlace slides in the slide carriers for centrifugation, making sure that opposite carriers are balanced. Centrifuge the slides at about 4,800 x g for 30 min - 1 h. at 4 oC. Use the slow start feature on the centrifuge.\n8. Fixing the Nuclear Contents\nFor most subsequent procedures, fix the nuclear contents with paraformaldehyde.\nPut a slide rack into a standard microscope slide staining dish and then place the slides individually in the rack. Add enough fixative to cover the slides(2 - 4% paraformaldehyde in OR2 or PBS).\nWith a pair of blunt forceps, push the coverslip laterally, pick it up, and discard it in the appropriate glass trash. Leave slides in the fixative for at least 15 - 30 min. For in situ hybridization and most antibody stains, longer periods of fixation (h or d) are permissible.",
    "To remove the plastic square, place slides one at a time into ice cold OR2 or PBS in a staining dish. Insert a sharp razor blade at the edge of the plastic square and pry it loose.\n\tNOTE: Ideally the plastic will come off cleanly, leaving all the paraffin wax on the slide. The wax serves a useful purpose: since it surrounds the small central area where the nuclear contents are attached to the slide, it acts as a dam that allows one to work with small volumes (5 - 10 µL) of reagents for immunostaining, etc. Slides can be held indefinitely in cold OR2 or PBS.\n9. Immunostaining of LBCs and Nuclear Organelles\nRemove a fixed GV preparation from storage in OR2 or PBS. Wipe off excess liquid and place on supports in a moist chamber. A convenient chamber is a 90 x 15 mm petri dish containing a 90 mm circle of moist filter paper.\n\tNOTE: At this point the nuclear contents are firmly attached to the slide in a 5 mm circular area free of paraffin wax. Because the wax is water-repellent, one can change solutions by adding and removing small volumes of liquid to the edge of the central area with a 20 µL pipette. The major precaution is to avoid touching the wax-free area with the pipette tip.",
    "Carry out immunostaining with small volumes (10 - 20 µL) of reagents. Because the chromosomes and nuclear organelles are very small and in immediate contact with added reagents, staining protocols can be short. Primary and secondary antibody staining times can be as short as 1 hr or less. Do not include detergent in any step, as this causes damage to the preparation. If desired, stain the preparation with DAPI (1 µg/mL) for 10 - 20 min to accentuate the axes of the LBCs.\nMount in glycerol or a commercial mounting medium suitable for immunofluorescence. To avoid trapping an air bubble during the mounting step, proceed as follows.\n\t\nPull 15 µL of mounting medium into the tip of a 20 µL pipette. Remove as much liquid as possible from the area immediately around the nuclear spread by \"wicking\" it off with a piece of filter paper (cut in the shape of a very thin triangle from a 90 mm circle of #1 filter paper).\nPipette most of the mounting medium onto the preparation, being careful not to touch the area of the nuclear spread. Place the last 1 µL or so of mounting medium in the center of a 22 mm coverslip (thickness #1.5). Invert the coverslip over the preparation and drop carefully into place.\nFor temporary mounts, up to a few days, use 1 mg/mL phenylenediamine in 50% glycerol. For permanent mounts, especially for superresolution studies, use a low-fluorescence medium that hardens to a refractive index of about 1.46.\n10. Fluorescent In Situ Hybridization (FISH) of LBCs and Nuclear Organelles",
    "Because FISH protocols usually require a step at elevated temperature, remove the paraffin wax from the preparation. Carefully scrape with a razor blade, although the procedure is tedious and can lead to accidental damage of the preparation. It is useful to mark the area of the preparation on the back of the slide with a diamond point.\n\t\nAlternatively, dissolve the paraffin wax with xylene. Set up a series of Coplin jars or staining dishes containing: 30%, 50%, 70%, 95%, and 100% ethanol; 3 containers of xylene; 2 more containers of 100% ethanol and one acetone.\nPlace slides in the slide carrier and dehydrate them in the ethanol series, leaving slides 3 - 5 min in each concentration (shorter times if agitated).\nDissolve the paraffin wax by passing the slides through the 3 containers of xylene, about 5 min each if agitated. Remove the xylene by passing through two 100% ethanols, and finally remove the ethanol with acetone. Take the slides from acetone and tilt them to dry.\nCarry out in situ hybridization using any standard protocol.15,16\n11. Isolation of a GV under Oil\nPick up an oocyte from the OR2 solution with jeweler's forceps, including as little surrounding tissue as possible. Place the oocyte on a small piece of #1 filter paper. Excess OR2 solution will transfer to the filter paper, leaving the oocyte almost free of liquid. Pick up the \"dry\" oocyte and place it under the surface of light weight mineral oil (paraffin oil) in a small petri dish (35 x 10 mm).",
    "With a fine tungsten needle or one tine of the forceps, poke a small hole in the oocyte near the dark animal pole. Pick up the oocyte with one pair of forceps (avoiding the tips) and squeeze gently. The GV will extrude along with a smaller or larger amount of yolk on its surface (Figure 3).\nRemove as much yolk as possible by gently sweeping the GV with the side of the forceps. In most cases it will be difficult to remove all of the yolk. However, for most purposes a small amount of yolk is not a problem.\nTo observe the GV contents, flatten the GV to a greater or lesser extent.\n\t\nRemove the plastic square from a well slide and use the remaining paraffin wax as a shallow receptacle for paraffin oil.10 Pick up the GV along with paraffin oil in a 20 µL pipette and transfer to the center of the paraffin area. Add a coverslip and observe the contents of the partially flattened GV. This technique does not damage the LBCs.\nAlternatively, flatten the GV to approximately 10 µm thickness for observation of nuclear organelles.\n\t\nCut off the final 1 mm of a plastic pipette tip with a sharp razor blade. Suck the GV into the tip along with exactly 5 µL of mineral oil. Extrude the GV and all the oil onto the center of a 22 mm glass coverslip.",
    "Lower a standard 3\" x 1\" glass slide slowly until it just touches the oil drop. The drop and coverslip will be lifted by capillarity and the oil will spread to the edges of the coverslip. When the drop has spread completely, the oil will be approximately 10 µm thick. The LBCs will be damaged and large nucleoli will be compressed slightly, but most of the smaller nuclear organelles will appear more or less as they exist in the intact GV (Figure 3).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}