{
  "id": 15394,
  "origin_website": "Jove",
  "title": "Delivery of Nucleic Acids through Embryo Microinjection in the Worldwide Agricultural Pest Insect, Ceratitis capitata",
  "procedures": [
    "1. Experimental Set-up\nInsectary requirements\nMaintain all C. capitata life stages at 25 °C, 65% humidity and 12/12 hr light/dark photoperiod.\nPlace about 1,500-2,000 medfly pupae in a 6 L cage. Use a cage with a brass mesh on one side with holes small enough to stimulate oviposition42. Insert a sponge strip through a small opening in the cage's base to provide flies with water by means of capillary action. Use a mixture of yeast and sugar (1:10) as food source for the adults (Figure 1A). Increase the amount of yeast (up to 1:3, yeast:sugar) should the females fail to lay eggs.\nPlace a plate filled with water below the cage to collect the eggs deposited through the mesh. As virgin females can oviposit, wait until the flies are at least 6-7 days old before collecting eggs for the microinjection experiments. This will ensure that the females will have mated and that the eggs will have been fertilized.\nCollect the eggs by filtering the water with a fine net strainer. Transfer the eggs from the strainer in a plastic box containing standard larval food (1.5 L H2O, 100 ml HCl 1%, 5 g broad-spectrum antimicrobial agent dissolved in 50 ml ethanol, 400 g sugar, 175 g demineralized brewer's yeast, 1 kg soft wheat bran) using a Pasteur pipette.\nPlace each box in a transparent container closed with a net lid to allow air circulation and containing a layer of bran to favor pupation (Figure 1B).\nAfter about 10 days, check for 3rd instar larvae that emerge from the larval food and jump down into the bran layer for pupation.",
    "24 hr later, collect the pupae in a small cup using a soft brush and transfer them to a new adult cage. Adults normally emerge 10 days after pupation. The emerging fly uses the ptilinum, an inflatable pocket located on its head above the base of the antennae, to force off the end of the puparium. After emergence, the ptilinum permanently collapses back inside the head.\nPreparation of 1 L food for microinjected larvae\nDissolve 2.5 g agar in 300 ml H2O.\nWarm 500 ml H2O on a hot stirring plate and dissolve 4 g Sodium Benzoate, 4.5 ml 37% HCl, 42 g yeast extract and 115 g dehydrated carrot powder.\nAdd to the mixture a solution of 2.86 g broad-spectrum antimicrobial agent dissolved in 10 ml absolute ethanol.\nDistribute the medium in 15 cm round Petri dishes and allow to cool. If necessary, store at 4 °C.\nSlide preparation\nPlace a 2 cm strip of double-sided tape on a microscope slide (75 x 26 mm2) and mark the edges with a china marker, to prevent oil spread and the consequent desiccation of the injected embryos.\nNucleic Acid Preparation\nIsolate plasmid DNA using commercially available kits34. Precipitate the plasmid using ethanol and re-suspend in injection buffer (0.1 mM phosphate buffer pH 7.4, 5 mM KCl) at the desired concentration.\nPurify in vitro synthetized long dsRNA using phenol-chloroform, precipitate using isopropanol and re-suspend in injection buffer43.\n2. Embryo Preparation\nPlace a tray filled with water under a cage containing 6-7 day old adults.\nAllow the females to oviposit for 30 min and then collect the embryos by filtering the water using a fine strainer. Always keep the strainer in water to avoid desiccation of the embryos.",
    "Dechorionate the embryos by immerging the strainer for 5 sec in a commercial 50% bleach solution.\nWash the embryos carefully by repeatedly immerging the strainer in clean ultrapure water (at least 4-5 times). Finally, place the strainer in clean ultrapure water. Use the embryos within maximum 2 hr.\n\tNOTE: The timing of microinjection is related to the necessity to inject into pre-blastoderm embryos, during a phase of nuclear divisions prior to cellularization. This allows the injected DNA to be taken-up into the nuclei, specifically into the primordial germ cell nuclei that will originate the gametes. In Drosophila, cellularization at the pole cells begins at about 90 min after fertilization (at 25 °C), with blastoderm formation occurring about 30 min later44, whereas in the medfly cellularization takes place between 9 and 12 hr45,46.\nEmbryo orientation in rows\nUsing a fine paintbrush, collect about 50 embryos and place them on a disk of black filter paper soaked with water.\nUnder a dissecting stereomicroscope, arrange the embryos in a row on the upper surface of the double-sided tape on the microscope slide using a fine paintbrush (000) (Figure 1C).\n\t\tNOTE: Align the embryos all in the same orientation, as injection is performed in the posterior pole, where germ-line will originate; the posterior pole is opposite to the micropyle region.\nCover the embryos with a layer of chlorotrifluoroethylene oil making sure that the oil does not spill over china marker borders (see 1.3).\n\t\tNOTE: Before covering the embryos with oil, a further step can be performed: the embryos can be desiccated for a few minutes to reduce their liquid content and thus facilitate the entry of the injected DNA solution. This may help avoid embryo bursting during injection or excessive leakage of the injected solution, as a consequence of the high liquid pressure.",
    "3. Embryo Microinjection\nFill a needle (1-2 µl) with plasmid DNA or dsRNA solution (1-2 µg/µl) using a micropipette.\nConnect the needle to the microinjection apparatus, which controls the injection time (0.5 sec), the pressure (800 hPa) and the backpressure (150 hPa).\nPerform microinjection under a stereomicroscope, using a micromanipulator to control the movements of the needle (Figure 1D). Use the microscope stage to move the slide.\n\t\nPlace the slide on the stage of the scope.\nInsert the tip of the needle into the posterior pole of the embryo ( Figure 1E ).\nInject the solution by activating the microinjection system with the pedal. The injected liquid induces an increase in internal pressure, resulting in a slight movement of the embryo.\nRelease the pedal and immediately, but gently, remove the needle from the embryo.\nObserve a little cytoplasmic leakage at the injection site.\n\t\tNOTE: To discriminate between potential lethal effects of DNA/dsRNA/siRNA and mortality due to the microinjection procedure itself, control experiments must be performed. These comprise the injection of buffer only, or, in the case of reverse genetics experiments, of a green fluorescent protein (GFP)-derived double-stranded RNA (dsRNA-GFP), or siRNA.\nFollowing injection incubate the embryos at 25 °C.\n4. Post-injection Procedures\nTwo days after injection, check the slides for hatched larvae (Figure 1F) under a stereomicroscope. Larvae can move in the oil but need to be transferred to larval food as soon as possible. For this reason, check the slides several times a day.\nUsing a fine paintbrush (000), gently transfer the hatched larvae to the carrot-based larval food. Transfer up to a maximum of 200 larvae per each Petri dish.\nIncubate the larvae at 65% humidity (25 °C). Ensure that the lid does not stick to the dish, impairing air exchange.",
    "Keep the Petri dishes with the lid mostly closed so that there is still air flow to the larvae. To avoid excessive drying, check the dishes daily and, if needed, add water to compensate for evaporation.\nPlace the Petri dishes in a clear container closed by a net-lid and containing a layer of bran to favor pupation. As for routine insectary rearing, 3rd instar larvae jump out of the larval food and pupate in the bran.\nCollect the pupae and place them in a small cage for adult rearing and screening (this is Generation 0, G0). Rear the progeny on standard larval food.\nIn the case of germ-line transformation experiments, check for possible transformed individuals in the next generation (G1), as injected individuals usually are chimeras. Transposition events, indeed, might have occurred in any of the nuclei of the embryonic syncytium, which will form either the germ-line or the soma.\n\t\nSoon after emergence, anesthetize G1 individuals using CO2 and check for transformation events under an epifluorescence stereomicroscope. To screen for the presence of red fluorescence, use a DsRedwide filter (Ext. 546/12; Emm. 605/75), while to screen for green fluorescence use the EYFP filter (Ext. 500/20; Emm. 535/30).\nPlace transformed individuals in a small cage with wild-type adults of the opposite sex and originate a new, initially heterozygous, strain.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}