{
  "id": 2190,
  "origin_website": "Cell",
  "title": "Simultaneous recording of breathing and neural activity in awake behaving mice",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nConstructing the thermistor-based respiration sensor\nTiming: 20 min\nThis section describes the construction of respiration sensor that will be implanted into the nasal cavity.\nPrepare the thermistor, the pins, and the socket.\nCut the thermistor head to 3-cm long.\nDissemble the original connector stripe by pushing out the pins with a hemostat.\nCut the black socket stripe using a wire cutter into small pieces that contain only two holes (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1667-Fig1.jpg\nFigure 1. Constructing the breathing sensor\n(A) The starting material: thermistor, pins, and socket.\n(B) Parts for assembling the breathing sensor: thermistor with wires separated, pins with bottom part cut, and socket.\n(C) Positioning the parts before pushing the pins into the socket.\n(D) An assembled thermistor sensor.\nCut off the bottom of the pins.\nCut off the thermistor.\nUse the flame to burn the wires so that the ends separate into two strands.\nSeparate the thermistor wires so that the total length of the thermistor head and intact wire is around ∼1.5 cm (Figure 1[href=https://www.wicell.org#fig1]B).\nNote: Adjust the length according to the implantation coordinates.\nBuild the thermistor.\nInsert two wires of thermistor into the socket.\nInsert the pins (with the bottom cut) into the socket (Figure 1[href=https://www.wicell.org#fig1]C).\nGently push the pins down with a hemostat to fit perfectly within the socket. [troubleshooting 1[href=https://www.wicell.org#sec5.1]].\nThe metal pin should now have a tight connection with the exposed wire of the thermistor without the need to solder (Figure 1[href=https://www.wicell.org#fig1]D).\nApply some epoxy, such as LED-curable epoxy, to the bottom of the sensor to protect the bare wires.",
    "Note: We recommend the direct connection rather than soldering because the wires are very thin. The integrity of the sensor can be tested by plugging the sensor into the patch cord and exhaling towards the sensor (step 14) before applying the epoxy.\nMaking the patch cord that connects to the thermistor\nTiming: 20 min\nThis section describes the construction of patch cord that connects the thermistor and electric circuit.\nPrepare two pins (with the bottom intact) and a socket. Insert the pins into the socket to make a connector (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1667-Fig2.jpg\nFigure 2. Constructing the patch cord that connects to the breathing sensor\n(A) An assembled connector.\n(B) Soldering the patch cord to the connector (the black part inside the clamp).\n(C) Using heat shrink tubing to protect the connection.\n(D) Attaching the thermistor sensor to the patch cord.\nPrepare a patch cord, separate its two ends, strip off the coating, insert two metal ends into each socket, and then solder the wire with the socket to electronically couple the wire and socket (Figure 2[href=https://www.wicell.org#fig2]B).\nUse heat shrink tubing to secure the connector and patch cord (Figure 2[href=https://www.wicell.org#fig2]C).\nConnect the patch cord with the thermistor sensor (Figure 2[href=https://www.wicell.org#fig2]D).\nUsing the same design, build a holder for a thermistor sensor that can be used during the stereotaxic implant.\nBuilding the electric circuit\nTiming: 30 min\nThis section describes the construction of the electric circuitry that transmits thermistor signals into the data acquisition system.\nIn the setting below, a voltage divider is used to adjust the voltage output of the thermistor sensor to amplify the breathing signals. The voltage divider is composed of three different wires (Figure 3[href=https://www.wicell.org#fig3]A) (Phidgets Inc., 2022a[href=https://www.wicell.org#bib4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1667-Fig3.jpg\nFigure 3. Assembling the recording system and testing the breathing sensor",
    "(A) Wire connections of the voltage divider (Phidgets Inc., 2022a[href=https://www.wicell.org#bib4]).\n(B) An assembled electric circuit for connecting the thermistor to the DAQ.\n(C) The knob of the Variable Resistor (screw inside the red circle) for adjusting baseline voltage (Phidgets Inc., 2022b[href=https://www.wicell.org#bib5]).\n(D) Example trace shown in LabChart software when the experimenter exhales towards the sensor.\n“Power” (red) and “Ground” (black) wires are connected to the power outlet.\n“Data” (white) and “Ground” wires are connected to the Data Acquisition (DAQ) system for receiving signals from the thermistor.\nThe “Ground” wire needs to be duplicated so that it can connect with both the “Power” and the “Data” wires.\nThe goal is to assemble the following system:\nOne end of the voltage divider (Figure 3[href=https://www.wicell.org#fig3]B, two green screws on top of the voltage divider) should be connected to the patch cord with the thermistor sensor attached.\nThe other end of the voltage divider should be connected to the power outlet (the yellow/red/black strands wrapped with the red tape in Figure 3[href=https://www.wicell.org#fig3]B) and the DAQ system (the white/yellow strands wrapped with the green tape in Figure 3[href=https://www.wicell.org#fig3]B).\nTo assemble the system:\nConnect the “Data” (white) wire to the BNC male connector.\nConnect the “Power” (red) wire to the 5 V power outlet.\nExtend the “Ground” (black) wire with silicone wire to duplicate it. Connect one duplication to the BNC male connector and the other one to the power outlet.\nOptional: Add a commutator between the voltage divider and the thermistor patch cord to help release the torque of the thermistor patch cord due to the animal’s movement.\nTest the thermistor\nTiming: 10 min\nThis section describes how to examine the integrity of the thermistor sensor before proceeding to implantation.\nConnect the data BNC cable to the DAQ system, such as the PowerLab.",
    "Note: PowerLab is one of the common DAQ systems in the physiology labs, and the built-in peak detection function of its associated LabChart software is also more intuitive, flexible, and reliable than the customized code. We are also aware that alternative options exist for using the open-source platform (such as LabView and MATLAB) to acquire and process breathing signals.\nOpen the LabChart software and create a new document to view the BNC input.\nAdjust the baseline voltage by turning the knob of the Variable Resistor (small screw on the side of the gray box) (Figure 3[href=https://www.wicell.org#fig3]C, red circle) (Phidgets Inc., 2022b[href=https://www.wicell.org#bib5]) on the voltage divider. We found the signal-to-noise ratio is the best when the baseline voltage is 1.5–1.7 V.\nTest the thermistor sensor by exhaling towards the sensor. You are expected to see an immediate change in voltage during exhalation (Figure 3[href=https://www.wicell.org#fig3]D).\nPause point: The procedure can be paused between any two steps in the above sections.\nImplanting the thermistor into the nasal cavity\nTiming: 30 min\nThis section describes the procedure of sensor implantation with stereotaxic surgery in mice.\nThe surgery procedures are revised based on a previous report (McAfee et al., 2016[href=https://www.wicell.org#bib3]). The goal is to implant the thermistor probe into the nasal cavity securely. The sensor head should be fully inserted into the airway to detect temperature changes between the inhaled and exhaled air.\nAnesthetize the animal and place the animal in the stereotaxic frame. We used isoflurane anesthesia for induction (flow rate: 4–5 L/min) and maintenance (flow rate: 1–1.5 L/min); however, other types of anesthesia can also be used.\nNote: The head should be well fixed because the nose cone cannot be securely attached to the nose during the sensor implantation.\nMove the nose cone close to the animal without blocking access to the skull.",
    "Note: This placement will still result in the leakage of isoflurane, so an exhausting system for isoflurane is strongly suggested.\nApply lubricant eye ointment.\nUse cotton tips to apply Nair Hair Removal Body Cream onto the fur above the surgical area.\nWait for 30–60 s, then use new cotton tips to remove the cream and clean the surface with water and 70% ethanol.\nNote: Hair removal cream is preferred over shaving because the hair on the anterior side is short. Only certain types of hair removal cream will work for this purpose (for example, Nair for sensitive skin will not work).\nCritical: Be careful not to touch the eyes when removing the cream. Re-apply lubricant eye ointment if necessary.\nMake an incision along the midline, from the most anterior part of the head to Bregma.\nRemove the skins on both sides to create space for implantation.\nUse the stereotaxic frame to locate the site of implantation. An example coordinate is Anterior-Posterior (AP) 3.5 anterior from the nasal fissure (McAfee et al., 2016[href=https://www.wicell.org#bib3]) and Medial-Lateral (ML) 0.4 from the midline. Since the nasal cavity are two parallel canals on both sides of the midline, anywhere between AP 3–6.5 and ML 0.3–0.5 would also work.\nDrill a hole big enough to allow the sensor to be inserted. Push the skull down with forceps during drilling to reduce the movement of the skull. You should be able to see the brain tissue rather than the membrane. There should be little to no bleeding. [troubleshooting 2[href=https://www.wicell.org#sec5.3]].\nAttach the thermistor with a custom-built holder. Gently lower the thermistor into the drilled hole with a ∼45-degree angle (tip pointing anterior) so that most of the sensor body goes inside the cavity, which secures the implant. [troubleshooting 3[href=https://www.wicell.org#sec5.5]].",
    "Fix the sensor head onto the skull with a small amount of gel-like superglue and fix the rest of the sensor body with Metabond. Other adhesives of choice may work as well. [troubleshooting 4[href=https://www.wicell.org#sec5.7]].\nInject the genetically encoded calcium indicator and implant the optic fiber (for fiber photometry) or GRIN lens (for single-cell calcium activity monitoring with miniature microscopes).\nWait for 3–5 days for the breathing recording experiment. Stable recording can be achieved for up to 10 months. [troubleshooting 5[href=https://www.wicell.org#sec5.9]].\nWait for at least 2 weeks for the calcium signal recording experiment.\nNote: The optic fiber or lens implant can be performed during the same surgery as the thermistor implant, or one procedure can be done weeks after the other. The thermistor is typically implanted at last since its signal may deteriorate over time if the implantation is not secure. If multiple implants are performed during different surgeries, enough skull surface should be left for later implants.\nSimultaneous recording of breathing rate and neural activities\nTiming: 30 min–2 h\nThis section describes the procedure for setting up the recording system and performing breathing/calcium signal recording.\nDesign the setup for simultaneous recording of breathing and calcium activity together with video recording of behavior. Use LabChart to record breathing signals and fiber photometry to record calcium activities.\nFor breathing recording, set the sampling rate at 100 Hz, low-pass filter at 10 Hz, and smooth with a 100-ms moving window.\nNote: Adjust the parameters above to improve signal-to-noise ratio of the respiratory waveform.\nIn different channels, calculate real-time breathing rate and relative amplitude by detecting respiratory peaks.\nNote: Adjust the parameters to ensure that breathing peaks can be detected across different breathing rates.",
    "Use Raspberry Pi to control the recording camera and send two simultaneous digital inputs to the LabChart and the fiber photometry system for synchronization.\nNote: LabChart has a “trigger mode” to allow breathing recording to be triggered by an external digital input.\nHabituate the animals at least three times before behavioral experiments. Practice a technique where the animal’s skull is firmly held with the thumb and index fingers, and the body is gently held in the palm. Use the other hand to attach the patch cords for breathing and calcium recording quickly.\nNote: The researcher may use gas anesthesia during the attachment of the sensors to reduce pain/stress to the animal. We decided not to use anesthesia to avoid any long-lasting effects on neural activity and locomotion.\nPerform the behavioral experiments.\nNote: When using video tracking software, the patch cords can be sprayed with white paint to facilitate automatic detection of the animal.\nNote: A similar setup can be used to examine breathing changes during neural activity manipulations.\nAnalysis of breathing rate and calcium signals\nTiming: 1 h\nThis section describes the procedure for data analysis.\nExport the breathing and calcium data to the format of your choice (.mat, .txt, etc.).\nAlign the onset of both sets of data and resample if necessary.\nCalculate breathing rate by counting the number of peaks per minute (which can be automatically calculated with LabChart).\nEstimate breathing amplitude by the plethysmograph amplitude, i.e., the height of the plethysmograph waveform (which can be automatically calculated with LabChart).\nPlot different breathing parameters with calcium signals and examine their correlation during specific behavioral episodes.\nNote: The MATLAB code for data analysis can be found in the key resources table[href=https://www.wicell.org#key-resources-table]."
  ],
  "subjectAreas": [
    "Metabolism",
    "Biotechnology And Bioengineering",
    "Behavior",
    "Neuroscience",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Ecology & Environmental Biology",
    "Molecular Biology & Genetics"
  ]
}