{
  "id": 18304,
  "origin_website": "Jove",
  "title": "Dry Powder and Nebulized Aerosol Inhalation of Pharmaceuticals Delivered to Mice Using a Nose-only Exposure System",
  "procedures": [
    "The mice used in these studies were cared for in accordance with the Guide for the Care and Use of Laboratory Animals, eighth edition24. Mice were group housed at an Association for Assessment and Accreditation of Laboratory Animal Care (AAALAC) international-accredited facility in sterile ventilated microisolator housing on corn cob bedding. When measuring bronchoconstriction, mice were anesthetized with 100 mg/kg i.p. pentobarbital and depth of anesthesia was monitored by lack of toe pinch reflex and maintained by i.p. anesthesia as necessary. At the end of the experiments, mice were euthanized by cervical dislocation after barbiturate overdose. Verification of euthanasia was confirmed by lack of respiration. No survival surgeries were performed on the mice. All research protocols were approved by the Institutional Animal Care and Use Committee (IACUC).\n1. Formulation and Device Selection for Generation of Pharmaceutical Aerosols\nNOTE: Formulation and device selection are dependent on the physicochemical properties of the individual drug to be aerosolized, therefore general protocols are presented below and the reader is referred to the reviews by Zeng25 and O'Riordan26.\nDry powder aerosols\nMicronize drug dry powders in a ball mill, jet mill or similar device27and ensure the micronized particle size distribution (PSD) contains particles of respirable (0.5-5 μm mass median aerodynamic diameter, MMAD) particle size. Blend potent test compounds that require dilution with micronized lactose.\n\t\tNOTE: If there is not enough micronized powder to determine the PSD with a cascade impactor, the PSD of a small (sub-milligram) sample of the micronized powder can be measured by light scattering to confirm it contains small/respirable particles.",
    "Generate the dry powder aerosol using a Wright dust feed dry powder aerosol generator. Pack the micronized drug/lactose powder into the cylindrical reservoir using a manual hydraulic press at approximately 1000 pounds per square inch (psi) to produce compacted cakes of powder used as input by the Wright dust feed aerosol generator17.\nScrew the cylindrical reservoir onto the Wright dust feed advancing the reservoir until the scraper blade is in contact with the drug cake.\nConnect the outlet of the Wright dust feed to a cyclone and the inlet to a compressed air source set to 15 L/min airflow rate (maximum pressure 90 psi).\nSet the feed rate control to 0.7 revolution per minute (rpm) and turn on the Wright dust feed aerosol generator.\n\t\tNOTE: 0.7 rpm corresponds to a test article cake feed rate of 1 g/h when using the small Wright dust feed cylindrical reservoir. The Wright dust feed scrapes a thin layer of compacted powder off the test article cake by rotating the reservoir. Air carries the dust out of the Wright dust feed, through a sonic nozzle for de-agglomeration, and into a cyclone to remove non-respirable particles and agglomerates.\nConnect the outlet of the cyclone to the central aerosol plenum of the inhalation unit (Figure 1).",
    "NOTE: Compounds can be compressed from 300 to 1500 psi in the reservoir of the Wright dust feed. The object is to compress the particles enough so they will be retained in the reservoir when inverted, but not so much that the Wright dust feed cannot scrape off a thin layer for re-aerosolization. It must be remembered that the gauge on the manual hydraulic press reads in pounds and the plunger on the small dust feed reservoir has a surface area of about 0.25 square-inch. Therefore, 250 pounds of compression force on 0.25 square inch is equivalent to 1000 psi.\nNebulized liquid aerosols\nDissolve the drug in 100 mL of water or physiologic saline.\nLoad a 100 mL syringe with the drug solution and place the syringe into the syringe pump with a flow rate set at 1 mL/min.\nConnect the syringe pump to the jet nebulizer and purge the air from the feed line leading to the nebulizer.\nConnect the pressurized air source to the jet nebulizer and set the air flow meter to 10 L/min.\nInsert the jet nebulizer into the pre-separator. The pre-separator connects the nebulizer to the central aerosol plenum of the inhalation unit (Figure 1).",
    "NOTE: Many drug compounds have limited aqueous solubility and are better formulated as dry powder aerosols. If a stable suspension can be made from micronized (MMAD < 5 μM) compound, it may be used with the jet nebulizer. Caution should be used as the suspension may clog the nebulizer. Nebulizer feed concentrations from 1 mg/mL for potent compounds (like the bronchodilator ipratropium) to 40 mg/mL suspensions (for less potent compounds like salbutamol sulfate) have been used. The syringe pump feed rate is set at 1 mL/min for a practical reason; to allow the aerosol concentration equilibration period and 45-min-long exposure to be completed without the need to reload the syringe.\n2. Aerosol Exposure Experiment Setup\nMeasure the drug concentration (by collecting aerosol on an absolute filter) and particle size distribution (by collecting aerosol using a cascade impactor) of the aerosol that enters the inhalation unit post pre-separator/cyclone. Use these parameters along with the animal's minute ventilation, body weight, and exposure time to estimate the dose of drug deposited in the lungs.\nWeigh the absolute filter and record the filter weight. Place the filter into the filter holder and assemble the filter holder. Connect the inlet of the absolute filter holder to a central aerosol plenum sample port and the outlet to a vacuum source set to sample the aerosol at a flow rate of 1 L/min for the duration of the experiment.",
    "NOTE: The mass of drug on the filter after sampling for 45 min can be in the sub-microgram range and/or be mixed with lactose, NaCl salt, or other vehicle. A microbalance that reads to 0.1 microgram is necessary. To get an accurate weight of drug deposited on the filter, the filter must be equilibrated and weighed in a humidity controlled environment. The weight of drug on the filters can only be used in dose calculation if there is no vehicle in the formulation or the vehicle is water. When there is a vehicle in the formulation other than water, the weight of substance on the filter only gives an estimated starting point for further analysis of drug content by high performance liquid chromatography (HPLC).\nWeigh and record the weight of the 7 cascade impactor stage filters and one final \"tail piece\" filter. Place a filter on each of the seven stages of the cascade impactor and assemble the Mercer cascade impactor28. Connect the inlet of the cascade impactor to a central aerosol plenum sample port and the outlet to a vacuum source set to sample the aerosol at the flow rate the cascade impactor is calibrated at (usually 0.5 or 1 L/min) for the duration of the experiment.\nMonitor the aerosol content of the inhalation unit with the real time aerosol monitor (see Table of Materials and Reagents) to confirm the aerosol generators are functional and producing a stable aerosol throughout the experiment. Connect the inlet of the real time aerosol monitor to a central aerosol plenum sample port and the outlet to a vacuum source set to sample the aerosol at a flow rate of 1 L/min for the duration of the experiment.",
    "NOTE: The signal from the real time aerosol monitor is reported in μg/L, but is calibrated for road dust and must be recalibrated for each individual drug aerosol to yield correct aerosol concentration values. Calibration is not needed to use the monitor to confirm the presence or absence and temporal stability of aerosol concentration.\nSet the process control parameters (air flow, vacuum, pressure, aerosol generator power) to the values required that depends on the number of animals to be connected to the inhalation unit. The inhalation unit and aerosol generators are continuously controlled/monitored by a computerized process control/data acquisition system (DACO) supplied by the manufacturer (see Table of Materials and Reagents). Air flow rate into the inhalation unit should be minimally approximately 2 times the total minute ventilation rate of all animals in the inhalation unit in order to avoid a buildup of CO2.\nLoad mice into nose-only restrainers before exposing to aerosol in the nose-only inhalation unit. Also load restraint stress control animals into restrainers to breathe room air.\n\tNOTE: A dose/response experiment consists of multiple groups of mice exposed to aerosol for different amounts of time. Exposure time is used to control the dose each group receives during a dose/response experiment.\n\t\nAngle the restraining tube up towards the ceiling while trying to load the animals, as they tend to run upward trying to escape. Pointing the tubes down while loading will encourage turning around and escaping out the back of the tube. Ensure the mouse's nose is oriented into the pointed end of the tube and fix the variable-position plunger into the back end of the restrainer.\n\t\tNOTE: The plunger is fashioned to allow the tail of the mouse to protrude from the holder, which allows the mouse to regulate its body temperature while in the restrainer.",
    "Adjust the plunger to allow the mice to rotate, but not turn head to tail; to ensure the aerosol is inhaled.\nContinuously monitor the mice while in the restraining tubes. After positioning the plunger, small mice (<20 grams) often attempt to turn head to tail in the tubes and adopt a U-position where they have trouble breathing. This turning behavior is most prevalent in the first 5 minutes of restraint, after that the mice rarely attempt to turn head to tail.\n3. Aerosol Delivery\nInsert stoppers to plug the delivery ports of the inhalation unit and activate the aerosol generator, compressed air flow controller, and inhalation unit vacuum pump from within the process control software.\nOnce the readings from the real time aerosol monitor demonstrate the aerosol concentration has to come to equilibrium (~30 min, Figure 2), begin removing stoppers and inserting the nose-only restraining tubes containing mice into the inhalation unit. Repeat until all mice to be exposed to drug are connected to the inhalation unit.\n\tNOTE: In the example experiment, the total air flow supplied to the inhalation unit via the aerosol generator and dilution air is set to supply a 0.5 L/min flow rate to each of animal exposure ports in use. For example, a 15 L/min total air flow is enough to supply each of the 30 ports in the inhalation unit. This is much more air flow than required by the minute ventilation of the mice, but a larger air flow is necessary to supply the energy (pressure drop across the aerosol generator) to produce (atomize/de-agglomerate) the aerosol.\nOnce all animals are loaded into the exposure unit, turn on the vacuum sampling pumps that are connected to the absolute filter and cascade impactor using the process control software.",
    "When all exposures are completed, turn off the aerosol generator and remove remaining mice from inhalation unit.\n\tNOTE: Animals will be handled in a change station hood or by personnel wearing a facemask. After conclusion of aerosol delivery, the mice are removed from the tubes and the tubes are sanitized after each use.\n4. Calculation of the Deposited Dose\nTo calculate the deposited dose29 in μg/kg (Equation 1) multiply the concentration of the drug in the aerosol (μg/L) x minute ventilation (L/min) x duration of exposure (min) x inhalable fraction x pulmonary deposition fraction and divide by the body weight (kg).\nCalculate the aerosol concentration (μg/L) by dividing the mass of drug on the absolute filter (μg) by the air flow rate through the filter (L/min) multiplied by the sampling time (min). Estimate the mouse's minute ventilation by an allometric equation based on body weight30. The inhalable fraction is 1 as the aerosol was passed through a pre-separator to remove non-respirable particles, and the pulmonary deposition fraction is determined from the drug aerosol MMAD (Figure 3) using experimental calibration curves from monodisperse aerosols (Figure 4)31.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55454/55454eq1.jpg"
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}