{
  "id": 4063,
  "origin_website": "Cell",
  "title": "A quantitative image-based protocol for morphological characterization of cellular solids in feather shafts",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nAcquiring the cross-sectional micro-image stack\nTiming: ∼ 4 h (for 20 tissue sections)\nA successful QMorF analysis requires a series of 2-dimensional (2D) micro-images of rachis tissue sections from a localized region of the rachis (usually < 100 μm, depending on the required resolution). A set of good quality micro-images, showing clear cellular morphology in each section, is requisite for the entire QMorF protocol. A qualified raw image, shown by Figure 5[href=https://www.wicell.org#fig5] in the expected outcomes[href=https://www.wicell.org#expected-outcomes] and Figure 9[href=https://www.wicell.org#fig9] in the problem 1[href=https://www.wicell.org#sec6.1] of the troubleshooting[href=https://www.wicell.org#troubleshooting] section, not only saves effort in the later image pre-processing steps but also ensures an accurate analysis. Here we introduce the standard acquisition procedure for obtaining a stack of qualified micro-images of multiple intact tissue sections fixed and sealed on the slide from a 100 μm-long localized region of a rachis (Figures 1[href=https://www.wicell.org#fig1]A and 1B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/774-Fig1.jpg\nFigure 1. Acquisition of the cross-sectional micro-image stack and the image pre-processing in the QMorF analysis\n(A) A stack of multiple cross-sectional tissue sample images obtained along a finite length of the rachis.\n(B) Each sectional image shows the mesh network of the sectioned porous medulla surrounded by the dense cortex.\n(C) Pre-process the tissue section image for cellular patch identification in a later process (Scale bar, 100 μm). The left panels in (C) are demonstrative results of the first image (j= 1) of sectional rachis tissue after each step. The center panels are zoom-ins of the yellow framed regions in the low-magnification views at left. The right panel is a flowchart of the whole process, showing the purpose of each step.\nMarking the reference rachis medulla contour for pre-alignment.\nThe least significant distortion/deformation tissue section is first chosen as the reference medulla contour.",
    "Record the outline of this reference medulla contour by simply marking the contour on the display screen as the reference for the later whole image-stack acquisition.\nNote: Over the entire micro-image stack, the medulla contours of the tissue sections must be well aligned to correctly reconstruct the three-dimensional (3D) relationships among the internal cellular structures in the rachis medulla. In practice, maintaining the relative position and orientation of each tissue section on a sealed slide is not trivial. A manual alignment is required before taking the micro-image of each section to obtain a well-aligned image stack.\nAcquiring a micro-image stack of the pre-aligned section slides.\nUsing the recorded outline of the reference medulla contour in step 1 as the reference, manually pre-align each rachis tissue section sealed on the microscope slide by adjusting the position and orientation of each section according to the marked reference medulla contour in the field of view for acquiring the micro image of each section under an Olympus BX51 microscope.\nBright-field images of the rachis tissue structure are taken under a 10× or 20× objective lens with a Canon EOS 50D digital camera under a transmissive light source.\nThe acquired images are saved as 8-bit monochrome digital images in BMP or uncompressed TIFF format to simplify the later image pre-processing step.\nNote: To amplify the object–background contrast, we adjust the brightness of the image by tuning the microscope illumination and the camera exposure time. After adjustment, the grayscale indices of the background and object signals are approximately 90–180 and 50–80, respectively. A typical image and its histogram are shown in the upper panel of Figure 2[href=https://www.wicell.org#fig2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/774-Fig2.jpg\nFigure 2. Demonstration of the object/background contrast change after each image pre-processing step",
    "(A) and (B) show the result of four processed regional images and the corresponding histograms of the rachis medulla from Figure 1[href=https://www.wicell.org#fig1]C after each step of the image pre-process protocol. The variation of the distributions of object and background signals after each step is displayed. Arrows indicate the reference grayscale levels for the parameter determination of the corresponding step. Scale bar, 50 μm.\nNote: The cross-sectional tissue images could be intentionally taken slightly out of focus to clarify the mesh network of the medulla cross-section (see illustration in the next major step), and hence improve the 2D cellular pore patch identification.\nNote: Besides the manual alignment method, other image alignment algorithms could also be used to align images in the stack. SIFT (Scale-Invariant Feature Transform) is one of the examples.\nCritical: Disqualified cross-sectional micro-images should be discarded in this step for accurate QMorF analysis. Please see problem 1[href=https://www.wicell.org#sec6.1] of the troubleshooting[href=https://www.wicell.org#troubleshooting] section for the examples of disqualified micro-images and the potential solution.\nPre-processing the tissue section images\nTiming: 1–4 h (depending on image size and image quantity)\nThe micro-images of the sectioned rachis tissue are pre-processed through a series of complementation, contrast enhancement, and segmentation steps. At the end of this major step, 2D cellular pore patches distinguishable for elliptical fitting are obtained. Here we illustrate the pre-processing procedures sequentially applied to a stack of micro-images in our standard QMorF analysis of rachis tissue (Figure 1[href=https://www.wicell.org#fig1]C). The result of this stage is a stack of binary images of the medulla section, showing black cellular pore patches isolated by a white mesh network of the cellular boarders.",
    "Grayscale image complementation: To facilitate the gray level operation in the later image processing, which identifies the contours of cellular pore patches, the micro-image of the cross-section rachis tissue is first processed using the grayscale image complement (“imcomplement” toolbox in MATLAB).\nNote: The keratinized components of the rachis are optically opaque. In a bright-field micro-image of a rachis cross-section, the 2D cross-section of the 3D porous medulla appears as a dark mesh of keratinized cellular membrane boarder, and the 3D vacuoles composing the medulla appear as transparent bright 2D cellular pore patches.\nNote: After this step, the mesh network and pore areas are converted into high and low gray levels, respectively. A higher gray level of the mesh signal provides wider dynamic ranges for the following operations.\nImage enhancement: To improve the contrast of the complemented image for later segmentation between the cellular pore patch and mesh network of cellular boarder, apply the contrast limited adaptive histogram equalization (CLAHE) enhancement method (“adapthisteq” toolbox in MATLAB) to the complement images.\nNote: This method adjusts the contrast value of each tissue section. Unlike ordinary histogram equalization, the CLAHE enhancement method prevents the over-enhancement of localized noise signals, and brings the mesh signal to a similar level over the entire image.\nImage binarization: The complemented grayscale images are converted into black and white images (“im2bw” toolbox in MATLAB) to exclude the unnecessary morphological information.\nNote: Binary images are suitable for most of the MATLAB toolboxes applied in later processes and simplify the pore-mesh segmentation. The mesh network and cellular pore patches in each image are then clearly distinguished for later morphological-based processing.\nMedulla region identification and noise reduction.",
    "To improve the accuracy of elliptical fitting in the next major step, the cortex portion of the rachis and the signals from the debris objects are manually removed from the binarized image using conventional image processing software (e.g., Photoshop or ImageJ). Only image signals contributed by the medulla portion are preserved for later stages.\nSmall noise patches on the image are automatically eliminated if their size is below a specified threshold (∼200 μm2) (“bwareaopen” toolbox in MATLAB).\nMorphological closing: To clarify the pixel patch of each pore structure (i.e., the cellular patch) for accurate elliptical fitting in the next stage, a morphological closing process (“imclose” toolbox in MATLAB) is applied to the medulla in the binary image of the last step.\nNote: Step 7 morphologically closes the locally broken mesh network and isolates the cellular patch of each pore in the binary image. These isolated cellular pore patches can be morphologically characterized by geometric fitting into an elliptical object. The parameters of these patches are extracted from the fitting objects in the following major step.\nNote: The demonstrative graphs in Figure 1[href=https://www.wicell.org#fig1]C show the anticipated result of each step. The histogram of each step shown in Figure 2[href=https://www.wicell.org#fig2] illustrates the enhanced signal quality through the variation of the gray-level distribution.\nCritical: To avoid elliptical-fitting failure in next major step, the pre-processed image must present an interconnected mesh network for the cellular border and isolated cellular patches. Please see problem 2[href=https://www.wicell.org#sec6.3] of the troubleshooting[href=https://www.wicell.org#troubleshooting] section for the example of poor pore-mesh segmentation and potential solutions.\nFitting elliptical object\nTiming: 1–12 h (depending on image size and image quantity)",
    "To characterize the morphological features of the cellular patches isolated by the interconnecting mesh network, the contour of each cellular patch is fitted into an ellipse. The location, orientation, and geometric parameters of the fitted ellipses are easily obtained. These fitted elliptical objects fairly represent the morphology of the original cellular patches over the cross-section of the medulla, and allow a quantitative description of this morphology (see Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/774-Fig3.jpg\nFigure 3. Quantification of the cellular morphology through fitting the cellular pore patch to an ellipse\n(A) Cross-sectional micro-image of rachis tissue from a chicken flight feather (Scale bar, 500 μm). The green loop highlights the cortex–medulla interface.\n(B) Zoomed-in image of the rectangular region enclosed by the black frame in (A). One of the cellular patches in the medulla cross-section is fitted to an elliptical object, from which the parameters for quantifying the cellular patch morphology can be obtained.\n(C) Scheme of elliptical fitting on a group of N pixels randomly sampled from the edge of the cellular pore patch. The blue crosses in the left panel show the 10 randomly sampled edge elements and the red ellipse is the corresponding fitting result. The red ellipses in the three right panels are the fitting results for different numbers of sampling pixels (N = 5, 10, and 30).\n(D) Area distributions of the fitted ellipse with different N after 5000 random sampling trials along the contour of a chosen cellular pore patch. Increasing N increases the computational power but also ensures rapid convergence toward a narrow distribution. It was found that N= 30 achieves a good balance between the fitting accuracy and computational time.\nElliptical fitting of the cellular patch.",
    "Applying the edge-finding method (“bwboundaries” toolbox in MATLAB) to the cellular patch, the edge pixels of each 2D cellular pore patch are identified.\nInput 30 randomly sampled edge pixels of a cellular patch into the open source MATLAB module “fit_ellipse,” the “fit_ellipse” module outputs an ellipse representing the original cellular patch.\nRecord the ellipse parameter: During the elliptical fitting of a cellular patch in step 8, the position, lengths of the major and minor axes (2a and 2b, respectively), and tilting angle Θ of the ellipse are recorded (Figure 3[href=https://www.wicell.org#fig3]B). These recorded parameters preliminarily quantify the morphology of the corresponding cellular patch.\nObtain the elliptical-fitting object image: Applying the fitting to every distinguishable cellular pore patch over the entire pre-processed micro-image stack, we obtain the plurality of elliptical-fitting objects and their recorded parameters.\nNote: After this step, the parameters that quantify the morphologies of the original cellular pores in each medulla cross-section are obtained. In non-technical terms, the original grayscale micro-image stack is converted into a new stack of “images” composed of “elliptical-fitting objects.” This new “image” stack is actually a 3D matrix containing the morphological features of the cellular pore patches in a stack of rachis cross-sections distributed over the 100 μm-long rachis segment.\nNote: Theoretically, the elliptical fitting requires at least three randomly sampled edge pixels. Obviously, sampling more edge pixels will improve the accuracy of the fitting, but will increase the computational time. To balance the fitting accuracy and computational resources, we recommend the sampling of 30 edge pixels from each cellular patch. The optimization of the number of sampled edge pixels and the fitting accuracy are detailed in Figure 3[href=https://www.wicell.org#fig3]D.",
    "Critical: Most of the elliptical objects should be accurately fitted on their represented cellular patches. The small portions of the incorrect fitted objects can be manually deleted. Please see problem 3[href=https://www.wicell.org#sec6.5] of the troubleshooting[href=https://www.wicell.org#troubleshooting] section for the example of incorrect fitted objects and the potential solution.\nCalculation and analysis of the quantitative morphology field\nTiming: 1–4 h (depending on image size)\nThe quantitative morphology of the cellular structure in a localized region of the medulla tissue is achieved by coarse-grain averaging the quantitative characters of the elliptical-fitting objects within a grain (Figure 4[href=https://www.wicell.org#fig4]). In this stage, the parameters and/or calculated results are statistically averaged over the correctly fitted elliptical objects within a specific coarse-graining volume in the 3D medulla centered at (x, y). The quantitative morphology is thus measured at (x, y). The spatial variation of the quantitative morphology measurements over a specific morphological feature are presented as a two-dimensional distribution graph called the quantitative morphology field (QMorF). The QMorF reveals the collective cellular deformation under the spatially varying mechanical stress imposed on the local cells during morphogenesis (Chang et al. 2019[href=https://www.wicell.org#bib1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/774-Fig4.jpg\nFigure 4. Major steps in the QMorF analysis and their results",
    "Panels (A1) to (A3) show how the cross-sectional micro-image of a flight feather rachis tissue (A1) is pre-processed (A2) to obtain an elliptical object fitting image (A3). Panel (B) demonstrates the QMorF analysis on the w × h ROI within the black frame in (A3). After overlapping the entire stack of elliptical-fitting objects, we calculate the desired QMorF by averaging the quantified morphological features of the elliptical-fitting objects within a coarse-grained volume. For example, the pore size, i.e., the area of a cellular patch in the binary image, is computed by averaging the pore areas Aij over the virtual volume defined as an s × s region on the cross-sectional plain multiplied by the vertical dimension contributed by the m images composing the image stack, where Aij is the pore area of the ith elliptical-fitting object in the jth section, and s is the horizontal dimension of the grain size. PS(x, y) represents the coarse-grained averaged pore size at position (x, y). The calculation is repeated over the entire ROI and the measured PS(x, y) matrix is presented as a heatmap. The regional PSs obtained by QMorF are displayed in the bottom panel of (B). Extracting the coarse-grained averaged pore sizes (PS ≡ <πab>), pore elongation rates (PEL≡ <a/b>), and pore orientation angles (PO≡ <Θ>) over the whole set of rachis tissue sections, we obtain different distributions of the morphological features from the chicken flight feather rachis tissue. The results are shown in (C). The heat maps in panel (C) are adopted and modified from (Chang et al. 2019[href=https://www.wicell.org#bib1]). Scale bar, 500 μm\nAlign and overlap the fitting object image stack: To sample the elliptical-fitting objects in a 3D coarse-graining volume in the image stack, the elliptical-fitting object images in the stack are aligned first.",
    "Overlap the plural elliptical-fitting object images within the 100 μm-long rachis segment from which the raw image stack was acquired. The overlap is performed by best manual alignment of the medulla contour of each frame.\nWhen the tissue section has been slightly distorted and the medulla contours cannot be perfectly aligned, use a small ROI or fine morphological features as reference coordinates for the alignment.\nNote: This alignment precisely reconstructs the spatial arrangement of the cellular pore patches, and therefore their corresponding elliptical-fitting objects, in three dimensions.\nCoarse-graining calculation.\nThe quantified morphological feature at a specific position (x, y) is calculated from the parameters of the elliptical-fitting objects within a pre-defined coarse-graining volume centered at (x, y).\nThe regional averaged ellipse size PS(x, y) is obtained by calculating <πab> .\nThe regional averaged ellipse elongation rate PEL(x, y) is obtained by calculating <a/b>.\nThe regional averaged ellipse orientation angle PO(x, y) is obtained by calculating <Θ>.\nNote: Here <> denotes the mean of the measurements within the coarse-graining volume (Chang et al. 2019[href=https://www.wicell.org#bib1]). The size of the coarse-graining volume is defined as an s × s region on the cross-sectional plain multiplied by the vertical dimension contributed by the m images composing the image stack.\nAfter conducting the above calculation over the rachis cross-section, a matrix recording the local quantified morphological features of the cellular patches (averaged size PS, elongation rate PEL, or orientation angle PO) at each pixel position is obtained.\nQMorF result output: To visualize the computationally calculated data and reveal the spatial features of the cellular morphology, the matrix obtained in step 12 is output in 2D heat map format.",
    "Note: This output heat map is particularly useful for side-by-side comparison between the original grayscale cross-sectional image and the associated fine morphological variations. The range of the scale color bar depends on the data type and visual purpose. In the QMorF analysis of a typical chicken flight feather rachis, the ranges PS, PEL, and PO are 0–500 μm2, 1.0–2.5, and 30°–150°, respectively.\nCritical: If the output QMorF heat map is blurry and cannot reveal the desired morphological features, please see problem 4[href=https://www.wicell.org#sec6.7] of the troubleshooting[href=https://www.wicell.org#troubleshooting] section for example heat maps and the potential solution."
  ],
  "subjectAreas": [
    "Microscopy",
    "Cell Biology",
    "Biophysics"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}