{
  "id": 5289,
  "origin_website": "Bio",
  "title": "Isolation of Latex Bead Phagosomes from <em>Dictyostelium</em> for <em>in vitro</em> Functional Assays",
  "procedures": [
    "Note: Steps mentioned in this protocol should be performed on ice in a walk-in cold room at 4 °C (unless stated otherwise). In case of unavailability of such a room, all steps should be performed strictly on ice. Culturing of Dictyostelium cellsDictyostelium AX-2 cells are cultured in HL-5 suspension media with Penstrep (100 μg/ml working concentration) at 22 °C and 150 rpm in a shaking incubator (see Note 6). The optimal cell density for phagosome extract preparation is between 4-8 x 106 cells/ml. A 100 ml suspension culture (or 4-8 x 108 cells) is usually sufficient for one preparation (see Note 7).Before each preparation a small aliquot of cells from the culture (50 µl) is put on a glass coverslip to observe motility of organelles inside cells under a 100x objective of a differential interference contrast (DIC) microscope. A video for the intracellular motility is shown (Video 1). Cells with poor intracellular motility and/or excess vacuoles are under stress, and should not be used. Vacuoles are easily observable as large membranous structures inside the cells (Figure 1B).If cells appear healthy, before proceeding for the extraction procedure, it is required to perform the preparatory tasks as outlined in Note 3. <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Intracellular motility of organelles in Dictyostelium. Cell suspension was placed on a clean glass coverslip, allowed to adhere to the surface for 3-5 min and then imaged under 100x objective of a DIC microscope. The movie was acquired at 30 frames/sec using a custom program written on LabVIEW and later reduced to 10 frames/sec. Movie runs in real-time. Organelles appear to move in a directed manner inside the cell. Robust in vivo motion of organelles (as observed in the video) is imperative for isolating highly motile LBPs.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161128/20161128190225_1817.jpgFigure 1. Comparison of healthy versus unhealthy Dictyostelium cells.",
    "Cell suspension from either an optimally dense (A) or highly dense (B) culture was placed on a clean glass coverslip, allowed to adhere to the surface for 3-5 min and then imaged under 100x objective of a DIC microscope. Stressed cells rarely adhere to the coverslip, appear spherical and show large vacuoles as opposed to healthy cells. Such cells also show highly diffusive intracellular motility and hence cannot be used for in vitro reconstitution experiments.Bead preparationThe 750 nm bead stock solution mentioned in the materials section has a bead density of 1.08 x 1011 particles/ml. 200 µl of the bead stock solution is taken in a 1.5 ml microfuge tube and beads are pelleted by centrifuging at 10,000 x g for 5 min at 4 °C. The supernatant is discarded and the bead pellet is resuspended in 1 ml of HL-5 medium (see Note 8). This washing step is repeated once more and the final bead pellet is resuspended in 500 µl of Sorensen’s buffer. In order to avoid clumping of beads, they are sonicated in a sonicating water bath for 10 min and kept on ice until further use.Cells are collected by centrifuging the suspension culture twice in a 50 ml Falcon tube at 900 x g for 3 min at room temperature. The cell pellet is immediately stored on ice and resuspended in 5 ml of ice-cold Sorensen’s buffer.Synchronization The washed bead solution (500 µl) is added to the cells and the bead-cell suspension is incubated at 4 °C for 20 min with gentle shaking on a rotatory shaker (see Note 9).PulseAfter synchronization, the bead-cell suspension is added to 100 ml of HL-5 medium kept in a 500 ml conical flask at 22 °C to initiate bead uptake.",
    "The incubation is done at 22 °C and 150 rpm in a shaking incubator. To isolate early phagosomes, a pulse duration of 5 min (see Note 10) is used. To isolate late phagosomes, the cells are pulsed with beads for 15 min.To stop the pulse, the 100 ml cell suspension is directly added to 330 ml of ice-cold Sorensen’s buffer kept in JA-10 centrifuge bottles. The cells are then pelleted by centrifuging them at 900 x g for 5 min at 4 °C in a Beckman JA-10 rotor.ChaseThe cell pellet is resuspended in 5 ml of ice-cold HL-5 medium and then added to 100 ml of HL-5 medium kept in a 500 ml conical flask at 22 °C to initiate the chase. For chase, the cells are incubated at 22 °C and 150 rpm in a shaking incubator. To isolate early phagosomes, no chase is needed and one can proceed directly to step 10 whereas to obtain late phagosomes, the cells are chased for 45 min to complete the process of phagosome maturation. Before chase period ends, we generally take 50 µl of cells on a coverslip to check whether the cells have phagocytosed beads and to ensure that LBPs are motile in vivo (Video 2).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Motility of LBPs in Dictyostelium. 50 µl of cell suspension after the chase step was placed on a clean glass coverslip, allowed to adhere to the surface for 3-5 min and then imaged under 100x objective of a DIC microscope. The movie was acquired at 30 frames/sec using a custom program written on LabVIEW and later reduced to 10 frames/sec. Movie runs in real time. Latex beads (now LBPs), being highly refractile, can be easily distinguished from other endogenous organelles and show robust motion in vivo.",
    "To stop the chase, the cell suspension is directly added to 330 ml of ice-cold Sorensen’s buffer kept in JA-10 centrifuge bottles. The cells are then pelleted by centrifuging them at 900 x g for 5 min at 4 °C in a Beckman JA-10 rotor.Removal of non-phagocytosed beadsAfter chase (or for early phagosomes after pulse), the cell pellet is washed thrice with ice-cold Sorensen’s buffer to remove any non-phagocytosed beads. During each washing step, the cell pellet is resuspended in 50 ml of Sorensen’s buffer and centrifuged at 900 x g for 5 min at 4 °C (see Note 11).Cell lysisAfter the final washing step, the cell pellet is weighed and then resuspended in a 1:1 (w/v) ratio of lysis buffer (LB/30% sucrose with inhibitors added and kept on ice). The cell suspension is then lysed by one passage through a preassembled syringe filter containing a 5 µm pore size membrane. The cell lysate is collected in a microfuge tube and kept on ice. Lysis efficiency is examined on a coverslip using a 20x objective of the cell culture microscope (Figure 2). For optimal yield, 70-80% lysis of cells is desirable (see Note 12).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161128/20161128190530_5880.jpgFigure 2. Lysis of Dictyostelium cells using a 5 micron pre-assembled syringe filter. Cell suspension was spread on a clean coverslip before (A) and after (B) lysis and viewed under 20x objective of a negative phase contrast microscope. Intact cells appear dark (red arrowheads). Around 80-90% lysis is obtained using the preassembled filter.High speed centrifugationThe cell lysate is then layered over a 1 ml cushion of LB/25% sucrose in an MLS-50 rotor tube and centrifuged in a Beckman MLS-50 rotor at 180,000 x g for 20 min at 4 °C (See Note 13).",
    "The LBPs, being more buoyant than other cell organelles and/or debris, do not pellet and are collected from the interface of the cell lysate and LB/25% sucrose as shown in Figures 3A and 3B. The top layer of the gradient is the cytosolic fraction. It is important to collect LBPs along with the cytosolic fraction otherwise their motility is compromised.Collection of LBPsA 1 ml syringe with needle is used to puncture the tube and phagosomes along with the cytosol are aspirated into the syringe (Figure 3B).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161128/20161128190654_9529.jpgFigure 3. Extraction of LBPs from cell lysate. A. Image showing separation of LBPs on sucrose gradient post centrifugation. Membrane components are generally pelleted at the bottom whereas the cytosol is present at the top layer. LBPs float at the 15-25% sucrose interphase; B. Procedure for collection of LBPs from the gradient interphase using a syringe needle. It is important to remove the needle while transferring LBPs from the syringe into the collection tube as shown in C.While transferring the aspirated solution from the syringe to a microfuge tube, it is important to remove the syringe needle (Figure 3C) otherwise the membrane might get disrupted.The phagosome/cytosol mixture is snap frozen in 36 µl aliquots in liquid nitrogen immediately after collection and stored in liquid nitrogen for up to a week. Each aliquot is rapidly thawed and used for one in vitro motility assay. Any unused thawed aliquot should be discarded."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}