{
  "id": 10232,
  "origin_website": "Jove",
  "title": "Propagation of Dental and Respiratory Cells and Organs in Microgravity",
  "procedures": [
    "All necessary institutional approval was obtained to ensure that the study was in compliance with TAMU institutional animal care guidelines.\n1. Bioreactor assembly and sterilization\nSterilize four high aspect ratio vessels (HARV) for the bioreactor in an autoclave on the plastic instrument cycle for 20 minutes at 121 °C as recommended by the manufacturer.\nAfter sterilization, assemble the vessels in a cell culture hood by tightening the screws provided with the bioreactor after which the vessels are ready to use.\n2. Scaffolds used for the bioreactor co-culture experiment\nIncubate the scaffolds together with the cells to provide support for cell attachment necessary for further growth.\nChoose among PGA based scaffolds, hydroxyapatite scaffolds, graphene sheets, gelatin discs, and collagen based scaffolds for co-culture studies.\n3. Cervical Loop (CL) dissection and single cell preparation\nSacrifice mice by decapitation following respiratory arrest by CO2 overdose.\n\tNOTE: All animal studies are in compliance with TAMU institutional animal care guidelines.\nDissect cervical loops from 6 days postnatal (DPN) mice following a modified version of a previously published protocol23.\n\tNOTE: In our study, the distal portion of the cervical loop not shown in the previously published protocol is included (Figure 3).\n\t\nWash the dissected tissue with cold sterile PBS prior to digestion with collagenase dispase at 37 °C for 30 minutes.\nPass the solution through a 70 µm sterile cell strainer and further centrifuge at 800 x g for 10 minutes.\nDiscard the supernatant. Centrifuge the pellet and wash twice with cold PBS at 800 x g. Discard the supernatant.\nCount the cells using a hemocytometer and add 1 X 105 cells per vessel.\n4. Dental pulp cell culture and cell line expansion\nPlate dental pulp cells in a 100 mm tissue culture plate at passage 4 at a concentration of 1 x 105.",
    "Prepare media for the culture consisting of DMEM high glucose media, supplemented with 10% fetal bovine serum (FBS), and 1% antibiotic/antimycotic (P/S).\nWhen the cells reach 85-90% confluence, aspirate the medium and wash the plates twice with pre-warmed PBS.\nAfter the PBS wash, add a pre-warmed 0.25% Trypsin-EDTA solution to the plate, and incubate the dental pulp cell-containing plates at 37 °C for 3 minutes.\nConfirm cell detachment by visual inspection using a microscope.\nCollect the media along with the cells from the culture plate and transfer via a 25 mL pipette to a 50 mL sterile conical tube.\nCentrifuge the cells at 800 x g for 8 minutes and discard the supernatant. Resuspend the cells in fresh media and count using a hemocytometer.\nFor co-culture with cervical loop cells, seed the dental pulp cells in the bioreactor at a concentration of 1 x 104 per vessel.\n5. Co-culture of cervical loop/dental pulp cells on a scaffold within the RCCS bioreactor\nAdd both cell types, the cervical loop, and the dental pulp to the culture medium containing keratinocyte SFM media with supplemented growth factors, extracellular matrix proteins and scaffolds.\n\tNOTE: Growth factors are added at a concentration of 0.03 µg/mL bone morphogenetic protein 2 (BMP 2), 0.03 µg/mL bone morphogenetic protein 4 (BMP-4), 10 ng/mL human recombinant fibroblast growth factor (hFGF) and 15 ng/mL epidermal growth factor (hEGF), while ECM components included 200 µg/mL Matrigel, 5 µg/mL laminin and 5 µg/mL fibronectin.\nCoat scaffolds with a mixture of 500 µL of collagen gel enriched with 1 mg of LRAP (Leucine-rich amelogenin peptide) peptide, 1 mg of lyophilized early stage enamel matrix prepared from porcine teeth24, 5 µg/mL laminin and 5 µg/mL of fibronectin.\n\tNOTE: This worked best for our experiments.",
    "Following scaffold coating, add both cells and scaffold to the bioreactor, and fill the bioreactor with 10 mL medium per vessel.\nClose the fill port cap of the bioreactor vessel after addition of media, cells, and scaffolds.\nAttach the sterile valves to the syringe ports at the beginning of the experiment and keep them in place with a cover until the end of the experiment.\nOnce the vessel is 90% full and the fill port caps are closed and tightened, open up the sterile valves.\nUse two sterile syringes (3 mL) every time a media change is required. Fill one syringe with fresh medium while the other syringe is left empty.\nOpen up both syringe valves and gently maneuver the bubbles towards the empty syringe port.\nOnce the fresh medium from the full syringe is carefully injected in the vessel, remove the bubbles through the empty syringe port.\n\tNOTE: This procedure is performed until all the microbubbles are removed from the vessels.\nClose the syringe ports with caps and discard the syringes in a sharps waste container.\nAttach each vessel to the rotator base and place the rotator base in an incubator with 5% CO2 and 37 °C temperature.\nTurn on the power and set the rotational speed to 10.1 rpm.\n\tNOTE: Adjust the speed to ensure that the scaffolds are in suspension without touching the vessel wall.\nFor media change, place the vessels in an upright position to ensure that the cells settle at the bottom. Open the syringe ports and connect the sterile syringes to the ports.\nFollow the same procedure by aspirating 75% of the nutrition-depleted medium and injecting fresh medium through the other port.\n6. Lung organ preparation and bioreactor based culture\nNOTE: E15 wild-type mouse pups were used for the preparation of lung organs.",
    "Dissect the lung tissue after euthanizing a pregnant female mouse with CO2 asphyxiation.\n\t\nOnce the death is confirmed following asphyxiation by cervical dislocation, use a scalpel to expose the thoracic cavity. Thereafter, remove the pups from the uterus and euthanize by decapitation.\nAfter euthanization, prepare the thoracic cavity by opening it with a scalpel to locate the lungs. Wash tiny segments of lung tissue with sterile PBS and place it on a pre-sterilized membrane for 2 hours with organ culture medium in an incubator containing 5% CO2 and 37 °C temperature.\nOnce the lung tissues attach to the membrane in a 2D organ culture plate, transfer the samples to the bioreactor vessel.\nPrepare the media for culture.\n\tNOTE: The control DMEM high glucose media contains 10% fetal bovine serum (FBS), 1% antibiotic solution (P/S) (penicillin, 100 U/mL, streptomycin, 50 µg/mL) and 100 µg/mL ascorbic acid (AA) and for the induction of inflammatory conditions, control medium is supplemented with 5 ng/mL IL-6 protein.\nCarry out the lung culture experiment for 10 days with a media change every 48 hours in the bioreactor as described above.\n7. Coated scaffold with Human periodontal ligament (hPDL) cell culture\nCulture human periodontal ligament cells.\n\tNOTE: The cells are isolated and cultured in our lab as per the protocol previously published25.\nCoat the collagen scaffold discs with 30 µL of PBS for the control group and the neuropeptide galanin (GAL) at a concentration of 10-8 overnight.\nSeed human PDL cells on the control and GAL coated scaffold for 2 hours at 37 °C in a culture plate, and transfer the cell seeded scaffolds to a bioreactor vessel as mentioned above.\nCulture the cell seeded scaffolds for 14 days in the bioreactor prior to harvesting the scaffolds for analysis.\n8. Bioreactor cleaning and maintenance",
    "After the scaffolds/cells are harvested from the bioreactor, remove the syringe ports from the vessel.\n\t​NOTE: The screws around the vessels are taken off and the vessel is gently washed with soap water.\nRinse the vessels with clean water and tighten the screws once more.\nStore the vessels after autoclaving until next use.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}