{
  "id": 13387,
  "origin_website": "Jove",
  "title": "Semi-automated Production of Hepatocyte Like Cells from Pluripotent Stem Cells",
  "procedures": [
    "1. Seeding Human Pluripotent Stem Cells (hPSCs) Into 96 Well Plates For Hepatocyte Differentiation\nNOTE: Reagents and equipment used in this protocol has been listed in Table 1. Media used for this experiment must be sterile and at room temperature for cell culture. All reagent/solution volumes described in this part of the protocol are based on a single well of a 96-well plate unless otherwise specified.\nPrepare laminin coated 96 well plates.\nThaw a vial of recombinant laminin 521 (100 µg/mL) (LN-521) for 2 h to overnight at 4 °C.\nPrepare a 5 µg/mL solution by diluting LN-521 in ice-cold 1x Dulbecco's phosphate-buffered saline (DPBS) (with Ca2+/Mg2+).\nUse an automatic liquid handling dispenser with a standard tube dispensing cassette to add 50 µL of the LN-521 solution per well of a 96 well plate.\n\t\tNOTE: All volume dispenses are performed with an automatic liquid handling dispenser with a standard tube dispensing cassette unless otherwise specified. Prime the solution until it reaches the dispensing end of the cassette, then proceed to dispense. Multiple 96 well plates can be prepared in the same experiment by repeating the procedure as many times as needed.\nIncubate the LN521-coated plates at 37 °C/5% CO2 for 2 to 4 h.\n\t\tNOTE: LN521-coated plates can be stored up to two weeks at 4 °C. Keep the plates sealed on a flat surface to avoid evaporation and contamination.\nWarm up the required number of pre-coated plates at 37 °C for 30 min to 1 h.\nAspirate the remaining LN-521 solution of the coated surface using an 8-channel aspiration adapter.\n\tNOTE: It is critical to avoid any contact with the coated surface to avoid coating degradation.",
    "Immediately add 50 µL per well of mTeSR1 medium supplemented with 10 µM Rho-associated kinase (ROCK) inhibitor Y27632 and keep the plate in the incubator until cell seeding at 37 °C/5% CO2.\n\tNOTE: Do not allow the laminin-coated wells to dry.\nPrepare a cell suspension of 3 x 105 cells/mL in mTeSR1 medium supplemented with 10 µM ROCK inhibitor Y27632.\n\tNOTE: The seeding density for each cell line will require optimization.\n\t\nAspirate the medium from a Petri dish with an undifferentiated culture of hPSCs at about 75% to 85% confluency cultured on LN-521 as previously described12.\n\t\tNOTE: hPSCs are cultured on LN-521 in mTSER1 with the medium changed every 24 h, and passaged regularly once the cells reach 80% of confluency as previously described12.\nWash the cells with 5 mL of room temperature 1x DPBS (without Ca2+/Mg2+) and aspirate the buffer.\nAdd 5 mL of 1x Gentle Cell Dissociation Reagent to the cells and incubate at 37 °C for 6 to 8 min for cell dissociation.\n\t\tNOTE: To stop the reaction, examine the detachment of the cells from the matrix under the microscope. The cells should be partially detached from the plate. If not, extend the incubation for an extra 1 to 2 min.\nTerminate the reaction by aspirating the Gentle Cell Dissociation reagent and add 5 mL of fresh mTeSR1 medium supplemented with 10 µM ROCK inhibitor Y27632 to the cells. Use a cell scraper to lift the cells from the matrix and pipette up and down using a P1000 tip several times to mix.\nCount the viable cells using a hemocytometer based on Trypan Blue staining exclusion method and prepare the cell suspension with required concentrations.",
    "Pipette the desired number of the cells into a sterile 15 mL or 50 mL centrifuge tube and spin the cells down by centrifuging them at 115 x g for 5 min at room temperature.\n\t\tNOTE: For one 96 well plate, 5 mL of mTeSR1 medium containing 3 x 105 cells/mL is required for the H9 cell line.\nAspirate the supernatant and gently resuspend the cell pellet until a homogenous solution is obtained at 37 °C in mTeSR1 medium supplemented with 10 µM ROCK inhibitor Y27632.\n\t\tNOTE: The use of ROCK inhibitor is recommended as it improves cell survival post re-plating.\nAdd 50 µL of the cell suspension onto the 96 well plate containing 50 µL of mTeSR1 with 10 µM ROCK inhibitor Y27632.\nAfter seeding, return the plates to the cell incubator at 37 °C/5% CO2 for 24 h to allow the cells to attach.\nExamine the cells the next day and withdraw ROCK inhibitor once the cell to cell contact has been established. At 40% confluency, switch to differentiation medium (Figure 1B).\n\tNOTE: If cell confluency is higher than 40%, the plates are not suitable for HLC differentiation with the H9 cell line.\n2. Differentiating hPSCs to Hepatocyte-like Cells on Recombinant Laminins in 96 Well Plates\nPrepare the differentiation medium and growth factors.\nPrepare human Activin A stock solution (100 µg/mL) by dissolving human Activin A powder in sterile 0.2% bovine serum albumin (BSA) in PBS. Aliquot the stock and store at -20 °C. Use at 1:1,000.\nPrepare mouse Wnt3a stock solution (10 µg/mL) by dissolving mouse Wnt3a powder in sterile 0.2% BSA. Aliquot the stock and store at -20 °C. Use at 1:200.",
    "Prepare human hepatocyte growth factor (HGF) stock solution (10 µg/mL) by dissolving human HGF powder in sterile 0.2% BSA. Aliquot the stock and store at -20 °C. Use at 1:1000.\nPrepare Oncostatin M (OSM) stock solution (20 µg/mL) by dissolving the powder in sterile 0.2% BSA. Aliquot the stock and store at -20 °C. Use at 1:1,000.\nDefinitive endoderm: Prepare endoderm differentiation medium, consisting of 2% B27 supplement (50x, without insulin), 1% penicillin/streptomycin (final concentrations: 100 IU/mL and 100 µg/mL, respectively) added to Roswell Park Memorial Institute 1640 (RPMI 1640) basal medium. Store at 4 °C and use within two weeks. At each medium change, supplement the required volume with Activin A and Wnt3a at final concentration of 100 ng/mL and 50 ng/mL, respectively.\nHepatoblast differentiation: Prepare hepatoblast differentiation medium, consisting of 20% knockout serum replacement (KSR), 0.5% an alternative supplement to L-glutamine, 1% non-essential amino acids (NEAA), 0.1 mM beta-mercaptoethanol, 1% DMSO, and 1% penicillin/streptomycin (final concentrations at 100 IU/mL and 100 µg/mL, respectively) added to knockout DMEM (KO-DMEM). Filter under vacuum and store at 4 °C. Use within two weeks.\nHepatocyte differentiation: Prepare hepatocyte differentiation medium, consisting of 1% an alternative supplement to L-glutamine, 10 µM hydrocortisone 21-hemisuccinate sodium salt (HCC), 1% penicillin/streptomycin (final concentrations at 100 IU/mL and 100 µg/mL, respectively) added to HepatoZYME medium. Store the stock at 4 °C and use within two weeks. For each medium change, supplement the required volume with HGF and OSM (final concentrations at 10 ng/mL and 20 ng/mL, respectively).\n24 h post seeding, carefully remove the medium using an automatic hand-held electronic channel pipette system and add 100 µL of fresh endoderm-priming medium supplemented with 100 ng/mL Activin A and 50 ng/mL Wnt3a.",
    "NOTE: The differentiation process commences once the definitive endoderm medium has been added. Once cell seeding is optimized, the cellular differentiation is normally initiated within 24 h. All medium changes are performed by removing the medium with an automatic hand-held electronic channel pipette system and dispensing 100 µL of fresh medium using an automatic liquid handling dispenser with a standard tube dispensing cassette unless otherwise specified. An automatic hand-held electronic channel pipette system was used with a 96 well head, using 300 µL tips. In brief, 90 µL were aspirated from the well avoiding any contact with the cells, and it is important to not dry the cells during medium change to reduce cell stress.\nFor human embryonic stem cells (hESCs), change the endoderm differentiation medium daily for three days. If the differentiation is performed for human induced pluripotent stem cells (hiPSCs), extend the definitive endoderm stage for 2 extra days using Activin A only.\nAfter definitive endoderm induction, switch to KSR/DMSO medium for hepatoblast specification, and change the medium every 2 days for 5 days.\n\tNOTE: If there are a number of non-attached cells in the well, use non-supplemented KO-DMEM to wash the cells once before the next medium change. Due to the duration of the second stage of the protocol (5 days), there will be 3 medium changes with the last one on the last day of the hepatoblast specification.\nFollowing the hepatoblast differentiation, switch to HepatoZYME medium for hepatocyte maturation. Wash the cells once with HepatoZYME without the supplement after removing KSR/DMSO medium and add 100 µL of HepatoZYME maturation medium supplemented with 10 ng/mL HGF and 20 ng/mL OSM.",
    "Change the medium every 48 h for 7 to 10 days. At day 18 of the differentiation, characterize HLCs by analyzing the gene expression and CYP P450 metabolic activity.\n3. Characterization of Hepatocyte-like cells Differentiated On Recombinant Laminins\nDetect the expression of hepatocyte-specific markers and polarization markers using immunostaining.\nTest hepatocyte metabolic function using CYP P450 assays as described before12.\nDetermine the plate variation, counting the total number of cells per well per plate.\n4. High Throughput Immunocytochemistry and Image Acquisition\nOn day 18 of differentiation, wash the wells three times with 1x DPBS, fix the HLCs by dispensing 50 µL of 4% paraformaldehyde (PFA), and incubate at room temperature for 15 to 30 min. After the fixation, wash three times with PBST (0.1% tween) (without Ca2+/Mg2+) using an automatic plate washer.\n\tNOTE: All washes in this section are performed using an automatic plate washer unless otherwise specified. All washes are done following the same protocol.\nPermeabilize the membrane by dispensing 100 µL of PBST (without Ca2+/Mg2+) and incubate for 20 min at room temperature. Next, perform the protein blocking by dispensing 100 µL of 10% BSA in PBST and incubate for 1 h in gentle shaking using a plate shaker. After protein blocking, add 50 µL of 1% BSA in PBST containing the primary antibodies, incubate at 4 °C overnight with gentle shaking using a plate shaker.\n\tNOTE: Do not wash between protein block and antibody addition.\nAfter 24 h, wash three times with 1x DPBS (without Ca2+/Mg2+) and add the secondary antibody by dispensing 50 µL of 1% BSA in PBST. Incubate 1 h at room temperature in the dark.",
    "After the secondary antibody incubation, wash 3 times with 1x DPBS. Add 50 µL of DPBS with DAPI (10 µg/mL) and incubate for 5–10 min at room temperature in the dark.\nFinally, wash 3 times with DPBS and leave 100 µL of 1x DPBS in the well. Plates are ready for imaging.\n\tNOTE: Plates should be stored at 4 °C in the dark until imaging.\nImage the plate by using a high-content imaging system, and acquire several fields across the well to obtain a good representation of the well. Quantify the expression of the different markers in the HLCs by using Columbus software (High-Content Imaging analysis system software).\n\tNOTE: Columbus is a high content analysis software, which offers cell segmentation analysis for cell phenotyping. Similar results can be achieved by using CellProfiler, an open-source software for quantitative analysis of biological images22."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}