{
  "id": 13806,
  "origin_website": "Jove",
  "title": "Production and Use of Lentivirus to Selectively Transduce Primary Oligodendrocyte Precursor Cells for In Vitro Myelination Assays",
  "procedures": [
    "NOTE: All animals used for this study were of mixed sex and bred at the Animal Facilities of the Department of Anatomy & Pathology and The Florey Institute of Neuroscience and Mental Health Research at the University of Melbourne. All animal procedures were approved by Animal Experimentation Ethics Committees at the University of Melbourne.\n1. Cloning of 2K7 Lentivector\nBefore cloning the gene of interest into the 2K7 lentiviral vector, subclone the gene into the pENTR vector (3637 bp, Kanamycin resistant) using standard molecular techniques11. Use the EcoRI and SacII restriction sites for the subcloning.\nAmplification of the 2K7 Lentivector\n\t\nTransform 2K7 lentivector DNA by gently mixing 100 ng of plasmid DNA with competent cells and incubate on ice for 30 min.\nHeat shock DNA/ competent cells mix at 42 °C for 90 sec and plate them on LB-Agar plates containing both ampicillin (100 µg/ml) and chloramphenicol (15 µg/ml) at 37 °C for 16-18 hr.\n\t\tNOTE: Chloramphenicol is used to prevent recombination between the long terminal repeats.\nThe next day, grow selected bacterial clones in LB media containing both ampicillin (100 µg/ml) and chloramphenicol (15 µg/ml) at 37 °C for 16-18 hr. Extract the DNA using a commercial plasmid DNA Maxiprep kit as per manufacturer’s instructions.\nSub-cloning from pENTR vector to 2K7 Lentivector (Figure 1)\nimgsrc://cloudfront.jove.com/files/ftp_upload/52179/52179fig1highres.jpg\nFigure 1: Schematic representation of the Gateway recombination process. The gene of interest, here represented as Flag-Erk1, is cloned into the pENTR L1-L2 vector. This is added to the pENTR L4-R1 vector containing the CMV promoter and the backbone 2K7 vector. These three vectors are recombined by the LR Clonase II Plus enzyme to insert the gene-of-interest and the promoter into the virus-ready 2K7 vector.\n\t\nAdd the following to a 1.5 ml tube and mix gently:\n\t\tL4-R1 pENTR-pDNOR-CMV (promoter) (60 bng)1-2.5 µl",
    "L1-L2 pENTR4IRES2GFP (with gene of interest) (80 bng)1-2.5 µl\n\t\tK7 lentivector (80 ng/µl)1 µl\n\t\tTE-buffer, pH 82-5 µl\n\t\tTotal 8 µl\nRemove clonase enzyme mix from -80 °C and thaw on ice for 2 min. Ensure that this enzyme is a fresh aliquot from -80 °C as the enzyme has substantially reduced cloning efficiency with repeated freeze-thaw cycles\nAdd 2 µl of enzyme per reaction and mix well via vortex, and incubate the clonase reaction mixture at 23-25 °C for 6-24 hr.\nAdd 1 µl of proteinase K solution (supplied with enzyme kit) to the clonase reaction mixture and incubate for 10 min at 37 °C.\nTransform clonase reaction mixture into competent cells and grow the select colonies in LB media containing ampicillin (100 µg/ml) at 37 °C for 16-18 hr.\nExtract and purify DNA using a commercial plasmid DNA Miniprep kit as per manufacturer’s instructions.\nConfirm the DNA via digestion using restriction enzymes Spe I and Sac II and an appropriate buffer as per manufacturer’s instruction to remove the fragment containing the promoter and gene of interest.\n\t\tNOTE: This step is critical to check if the subcloned DNA has the correct insert gene of interest with the right vector backbone. The size of the vector itself without inserted fragment is 6.7 kb. The size of the released inserted fragment includes both the promoter and the insert gene of interest. Calculate the expected fragment sizes from the digest for the specific gene via a DNA sequence editing program, e.g., APE – A Plasmid Editor.\nCheck the sizes of both DNA vector backbone and the released fragment by running a 1% agarose gel in 1x TAE buffer (see Table of stock solutions) at 100 V.",
    "Amplify the confirmed DNA by growing bacteria in 500 ml of LB media containing ampicillin (100 µg/ml) at 37 °C for 16-18 hr.\nExtract and purify DNA using a commercial plasmid DNA Maxiprep kit as per manufacturer’s instructions.\n\t\tNOTE: Maxiprep typically generates sufficient amount of DNA required for viral production.\nRepeat steps 1.3.9-1.3.10 to amplify the following DNAs for lentiviral preparations: Envelope vector (PMD2.G, 6.1 kb), Package vector (pBR8.91, 12.5 kb), and an empty lentiviral vector as a control (GFP-CMV-2K7, 8.7 kb).\n2. 2K7 Virus Production\nNOTE: Day 1:\nOn the day of transfection, plate 32 million HEK293 T cells in T175 flask containing 25 ml HEK293 T cell media (see the Table of stock solutions). Alternatively, plate 16 million cells the day before the transfection if time runs tight on the day of transfection.\n\tNOTE: Transfection can be equally successful by plating cells on the day of transfection or prior to the day. Using either of the two alternatives, the critical point here is to make sure cells be stuck down on culture dish surface prior to transfection.\n\tNOTE: Day 2:\nTransfection\n\t\nPrior to transfection, dilute DNA to 1 µg/µl in TE Buffer that contain 10 mM Tris pH 8, 1 mM EDTA pH 8 in deionized water.\nIn a 50 ml tube, prepare a master mix (Table 1) for transfection in the T175 flask. Add DNA to pre-warmed Dulbecco’s Modified Eagle Medium (DMEM) and mix well by vortex, then add sterile polyethylenimine (PEI) (see the Table of stock solutions) to avoid premature precipitation.\n\t\ttable:\n﻿0,1,2\nVector,Concentration,Volume\npMDG.2,1 µg/µl,5 µl\npBR8.91,1 µg/µl,15 µl\n2K7 vector with GFP + gene of interest,1 µg/µl,22 µl\nSterile Polyethylenimine (PEI),1 g/L,500 µl\nDMEM,,\"2,100 µl\"\nTable 1: Preparing transfection mix for 2K7 Virus.",
    "Mix well by inverting the tube 3-4x and incubate for 15 min at room temperature (RT).\nPerform a full media change on HEK293T cells. Aspirate off the culture media from cells completely and feed with pre-warmed HEK293T cell culture media (25 ml per T175 flask).\nAdd the transfection mixture (DNA/PEI mixture) drop wise to the monolayer cells. Move gently to mix well and incubate transfected cells at 37 °C, 5% CO2, overnight.\n\t\tNOTE: Day 3:\nTo ensure the transfection is successful, check GFP expression 24 hr post-transfection via a fluorescent microscopy.\n\t\tNOTE: Over 50% of cells expressing GFP typically indicates a good transfection.\n\t\tNOTE: Day 4: \nAt the 48 hr post-transfection, collect the viral supernatant and replace with fresh HEK293 T media (25 ml per T175 flask).\n\t\nCentrifuge the viral supernatant at 1,140 x g for 10 min at 4 °C to clear up cell debris from the supernatant. Transfer cleared supernatant to 50 ml tube and store at 4 °C.\n\t\tNOTE: Day 5:\nAt 72 hr post-transfection, collect the second batch of viral supernatant. Repeat step 2.3.1 and pool 48 and 72 hr cleared supernatants.\nTo concentrate the virus, centrifuge viral supernatant at 170,000 x g for 90 min at 4 °C using 30 ml ultracentrifuge tubes.\nDiscard the supernatant and repeat step 2.6 until all the cleared supernatant has been centrifuged leaving an (invisible) pellet of virus plus precipitated PEI in the base of the tube.\nTo resuspend virus, add 500 µl SATO media (see Table of stock solutions) to the ultracentrifuge tubes. Vortex for 30 sec and scrape the base of the tube with a pipette tip to mechanically loosen the virus. Repeat this step 6x in order to loose viral pellet.",
    "Pool the resuspended virus into microcentrifuge tubes and spin very briefly to remove insoluble PEI. Filter the supernatant through a 0.45 µm filter to remove proteins.\nAliquot the virus into 20 µl, 50 µl, and 100 µl aliquots and store at -80 °C.\n3. Viral Titer Determination in HEK293T Cells\nTo check the expression of protein of interest and to determine the optimal viral concentration for experiments, add a series of serial dilutions of viral stock (e.g., 0, 5, 10, 20, 40, 80 µl) to transduce HEK293 T cells plated in 6-well plates, and culture for 24 hr at 37 °C, 5% CO2. This protocol typically generates virus that can be used at concentrations ranging from 1:50 to 1:200 that achieve robust expression of the gene of interest.\n48 hr post viral transduction, lyse HEK293T cells in TNE buffer (see Table of stock solution) with protease inhibitors.\n\t\nRinse wells twice with chilled DPBS and then add 150 µl TNE buffer to each well.\nLyse cells by pipetting up and down 5-10x. Transfer whole cell lysates to 1.5 ml microcentrifuge tube and incubate on ice for 15-30 min.\nCentrifuge the lysates at 4 °C for 30 min at maximum speed (20,000 x g) and transfer cleared supernatant to a fresh tube for protein determination by Bradford and subsequent western blot analysis.\nDetermine the level of expression of the protein of interest by standard western blot analysis while probing for antibodies against the protein itself and the fused tag (i.e., Flag). Use the viral dilution that yields >95% GFP+ cells and robust expression of protein of interest for experiments.\n4. Isolation and Culture of DRGs (Figure 2 steps 1 & 2)\nimgsrc://cloudfront.jove.com/files/ftp_upload/52179/52179fig2highres.jpg",
    "Figure 2: Schematic diagram of the in vitro myelination assay. DRG neurons are dissected from P2-3 rat pups, then purified and cultured over two weeks (1-2). OPCs are purified from P7-9 rat brains using immunopanning (3). OPCs are then infected with lentivirus and cultured for 48 hr (4). OPCs are then seeded onto DRGs, and any growth factors of interest such as BDNF are added (5). Co-cultures are then cultured for 2 weeks to allow OPCs to differentiate and myelinate the axons (6). Finally, co-cultures are either lysed for western blotting or fixed for immunocytochemistry (7).\nNOTE: Day 1- 2 days prior to dissection:\nCoat autoclaved 22 mm x 22 mm coverslips with Poly-L-ornithine (0.5 mg/ml) in a 6-well plate, and incubate at 37 °C overnight.\nOn the next day, coat coverslips again with Laminin (20 µg/ml in MEM) at 37 °C overnight, aspirate off excess and dry for 20 minutes in tissue culture hood.\n\tNOTE: Day 2: Dissection and isolation of DRGs:\nSacrifice P2-P3 rat pups 12x by cervical transection.\nRemove the skin overlying the muscle from the back of the animal. Use vannas scissors to open vertebral foramen and use forceps to gently scoop out the spinal cord.\nPluck out DRGs that lie in between vertebral columns and cut off attached spinal nerve fibres, then place DRGs in a 33 mm Petri dish containing 3 ml L-15 media. It is usually possible to gather between 8 and 12 DRG from each side of the spinal cord\nTransfer collected DRGs along with the L-15 media into a 15 ml tube, centrifuge at 180 x g for 5 min.\nAspirate the supernatant, add 2 ml 0.25% trypsin to DRG pellets and incubate at 37 °C for 30 min.",
    "Add 5 ml of M1 medium (see Table of stock solution) to the DRG pellets to stop trypsin, and centrifuge at 180 x g for 3 min at RT.\nAspirate supernatant, re-suspend the pellet in 2 ml pre-warmed M1 medium (not with growth factors). Triturate the ganglia pellet by pipetting 50x or until the ganglia are dispersed. Centrifuge cell suspension at 180 x g for 3 min.\nResuspend dissociated neurons in M1 media and plate down in a 6-well plate at 5 ganglia per 100 µl per well.\nTo remove proliferating non-neuronal cells, after a minimum of 4 hr incubation to facilitate attachment, remove M1 media and feed neurons with M2 media (see Table of stock solution). Culture DRG neurons in the presence of NGF (100 ng/ml) to purify a culture of NGF-dependent TrkA-expressing DRGs. Alternatively, use BDNF (100 ng/ml) to purify BDNF-dependent TrkB-expressing DRGs.\nMaintain neurons in M1 media (+NGF or BDNF at 100 ng/ml) alternating with antimitotic M2 media for 2 weeks as below.\nMaintain medium M1 (+NGF or BDNF at 100 ng/ml) on days: 4-6, 8-10, 12-14 and M2 media (+NGF or BDNF at 100 ng/ml) with FDU and uridine on days 1 to 4, 6-8, and 10-12. A minimum of 3 cycles of M2 media purification is required.\nMaintain DRGs in M1 alone for a further week after completing the 2 week antimitotic cycle. Change M1 media every 2-3 days.\n5. Isolation and Culture of OPCs (Figure 2 step 3)\nNOTE: Day 1- 2 days prior to dissection:\nCoat 10 cm tissue culture plates with Poly-D-Lysine (PDL, 10 µg/ml in sterilized deionized water) at 4 °C overnight.\n\tNOTE: Day 2: 1 day prior to dissection:",
    "Wash PDL plates with sterilized deionized water for 3x. Allow to dry for ~6 hr in tissue culture hood. If not being used straight away, wrap and store for up to 4 weeks at 4 °C.\nPrepare secondary antibody plates for immunopanning. For 1 brain dissection, prepare 2x IgG plates (for Ran2 antibody to remove astrocytes and O1 antibody to remove premyelinating oligodendrocytes), with 45 µl Goat α mouse IgG in DPBS (15 ml) per 10 cm Petri dish; 1x IgM plate for (O4 antibody for selecting oligodendrocyte precursor cells), 45 µl Goat α mouse IgM in DPBS (15 ml) per 10 cm Petri dish.\n\tNOTE: Day 3: day of dissection:\nAdd 200 units of papain in 10 ml of papain buffer (Table 2), and warm up at 37 °C until the buffer turns clear.\n\ttable:\n﻿0,1,2,3\n,Concentration,for 250 ml,Final concentration\nEBSS stock,10x,25 ml,1x\nMgSO4,100 mM,2.5 ml,1 mM\nGlucose,30%,3 ml,0.46%\nEGTA,0.5 M,1 ml,2 mM\nNaHCO3,1 M,6.5 ml,26 mM\nBring volume up to 250 ml with deionized water and filter sterilize,Bring volume up to 250 ml with deionized water and filter sterilize,Bring volume up to 250 ml with deionized water and filter sterilize,Bring volume up to 250 ml with deionized water and filter sterilize\nTable 2: Preparation of papain buffer.\nWash all secondary antibody plates with DPBS for 3x.\nPour the Ran2 and O1 antibody onto the IgG plates and the O4 hybridoma to the IgM plate. Incubate all these primary antibody plates for over 2 hr at RT.\nDissect one brain from a P7 rat. Decapitate a pup with sharpened scissors and remove the skin overlying the skull with scissors.",
    "Cut around the skull from the occipital lobe, the temporal lobe and to the frontal lobe. Remove brain from skull using a forceps and gently transfer it to a 35-mm Petri dish with 1 ml DPBS.\nDice the brain into small pieces roughly with scissors or sterile blade.\nFilter pre-warmed papain buffer (10 ml) into a new 15 ml tube containing a few grains of L-cysteine, then add 200 µl DNAase (12,500 U/ml) to the filtered papain buffer.\nPour the papain buffer onto the diced brain tissues; incubate at 37 °C for 90 min.\nGentlly transfer dissociated brain tissues into 50 ml tube using a 25 ml pipette and allow to settle.\nRemove papain buffer, add 2 ml Lo Ovo (Ovomucoid) to brain tissues and titurate 5-10x by pipetting to break up chunks of brain tissues, allow to settle and remove the top 2 ml of supernatant to a new tube.\nAdd another 2 ml Lo Ovo to brain tissues and repeat step 5.11 until no chunks of tissue remain. Tituration can get increasingly aggressive.\nCentrifuge dissociated cell suspension for 15 min at 200 x g. Aspirate off supernatant and resuspend cell pellet in 10 ml Hi Ovo and centrifuge for 15 min at 200 x g.\nWash first immunopanning plate (Ran 2 plate) with DPBS for 3x. Aspirate supernatant, resuspend cells in 10 ml panning buffer (Table 2) and pour on to the first immunopanning plate (Ran 2 plate). Incubate cells for 15 min at RT.\nWash the second immunopanning plate (O1 plate) with DPBS for 3x.",
    "After the incubation on the first immunopanning plate, tip the cell suspension onto second immunopanning plate (O1 plate), Rinse any loose cells off the surface of the plate with 1-3 ml of panning buffer and transfer by pipette to the O1 plate. Incubate cells for 15 min at RT.\nWash the third immunopanning plate (O4 plate). This plate is the positive selection plate where the OPCs bind its surface. Wash the O4 plate with DPBS for 3x.\nAfter the incubation on the second immunopanning plate, transfer the cells to the final immunopanning plate (O4 plate), incubate cells for 45 min at RT. This step will select O4+ OPCs.\nAspirate the supernatant from the last immunopanning plate (O4 plate) and rinse the plate with EBSS for 6x.\nTo remove OPCs off the plate, incubate cells with 5 ml of warm 0.05% Trypsin-EDTA diluted 1:10 with EBSS at 37 °C for 8 min.\nAdd 5 ml of 30% FBS (made in EBSS) to neutralize the trypsin. Remove cells off surface of the plate by pipetting for about 50x.\nTransfer all cell suspension to a new tube and centrifuge for 15 min at 200 x g.\nDiscard supernatant and resuspend cell pellet in 1 ml pre-warmed SATO media, followed by cell counting. Dissection of one brain can yield 1.5-2 million OPCs.\nPlate cells onto dry PDL coated plates at a density between 1 x 105 and 5 x 105 per 10 cm plate with in SATO media (10 ml) that contain ciliary neurotrophic factor (CNTF, 10 ng/ml), platelet derived growth factor (PDGF, 10 ng/ml,), neurotrophin 3 (NT3, 1 ng/ml), and forskolin (4.2 µg/ml)2,12. Culture OPCs at 37 °C, 8% CO2.\n6. Transducing OPCs",
    "Culture primary OPCs in SATO media (10ml/10cm plate) with CNTF (10 ng/ml), PDGF (10 ng/ml), NT3 (1 ng/ml), and forskolin (4.2 µg/ml) at 37 °C, 8% CO2 for 24 hr after dissection.\nCompletely aspirate off the OPC culture media, feed cells with freshly made SATO media (10 ml) with growth factors (see above in step 6.1).\nAdd virus to the OPCs to the optimal concentration determined by step 3 (Figure 2, step 4), culture OPCs for a further 48 hr.\n7. OPC Seeding for Myelinating Co-cultures (Figure 2, steps 5 and 6)\nTo remove OPCs off the surface, first rinse OPC plates with 8 ml EBSS twice, then incubate cells with 5 ml of warm 0.05% Trypsin-EDTA diluted 1:10 with EBSS at 37 °C for 2 min.\nNeutralize the trypsin with 30% FBS in EBSS (5 ml) and remove cells from plate by pipetting. Transfer cell suspension to a 15 ml tube, centrifuge at 180 x g for 15 min at RT.\nAspirate off the supernatant and resuspend cell pellet in 1 ml pre-warmed SATO media followed by cell count.\nPrior to the OPC seeding, completely aspirate media from the DRG culture plate. Gently seed 200,000 OPCs drop wise on to the DRG neurons as previously described4-6.\n\tNOTE: The total OPC seeding volume must be less than 200 µl per 22 mm coverslip.\nLeave cells to settle without moving the plate for 10 min in the tissue culture hood, then gently top up with 1 ml pre-warmed SATO media per well.\nReplate the remaining sister OPCs with SATO media with growth factors (see step 6.1). Use these sister OPCs to verify expression of the protein of interest.",
    "After 24 hr, replace the SATO media with the co-culture media (2 ml/well) containing SATO media (no factors) and neurobasal (v/v) with 1% B27. Maintain the co-cultures for 14 days with media change every 2-3 days.\nAssess the co-cultures for myelin protein expression by western blot analysis and visualize for the formation of myelinated axonal segments by double-immunostaining with antibodies against myelin basic protein markers and neuronal markers4-6.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}