{
  "id": 10926,
  "origin_website": "Jove",
  "title": "Biofunctionalized Prussian Blue Nanoparticles for Multimodal Molecular Imaging Applications",
  "procedures": [
    "1. Synthesis of PB NPs, GdPB, and MnPB\nSynthesis of the nanoparticles (PB NPs, GdPB, or MnPB) is achieved using a one-pot synthesis scheme by performing the steps detailed below:\nPrepare solution 'A' containing 5 ml of 5 mM potassium hexacyanoferrate (II) in deionized (DI) water. Depending on the type of nanoparticle being synthesized — PB NPs, GdPB, or MnPB, prepare solution 'B' as follows:\n\t\nFor PB NPs: prepare 10 ml of a solution containing 2.5 mM iron (III) chloride in DI water.\nFor GdPB NPs: prepare 10 ml of a solution containing 2.5 mM each of gadolinium (III) nitrate and iron (III) chloride in DI water\nFor MnPB NPs: prepare 10 ml of a solution containing 2.5 mM each of manganese (II) chloride and iron (III) chloride in DI water.\nAdd solution ‘B’ to a round-bottom flask, and stir the flask contents at room temperature (RT) and 1,000 rpm. Add solution ‘A’ drop-wise into the round-bottom flask containing solution ‘B’. Control the flow rate for the addition of solution ‘A’ to ‘B’ by a peristaltic pump set to dispense approximately 10 ml/hr.\nContinue stirring at 1,000 rpm at RT for an additional 30 min after the addition of solution ‘A’ to ‘B’ is complete. Stop stirring and collect the mixture.\nTransfer aliquots of the mixture into microcentrifuge tubes to rinse the nanoparticles free of unreacted components. Add 5 M NaCl (0.2 ml NaCl/ml reaction mixture) to each aliquot to assist in particle collection by centrifugation.\nCentrifuge each aliquot of nanoparticles for at least 10 min at 20,000 × g. After centrifugation, carefully remove the supernatant.",
    "Resuspend each nanoparticle pellet in 1 ml DI water via sonication using a microtip (sonication pulse on/off = 1/1 sec, amplitude = 50%, duration = 5 sec, sonicator power rating = 125 W) to break up the pellet.\nRepeat steps 1.4-1.6 at least 3× to ensure that the nanoparticles are free of components of the initial reaction and reaction byproducts. After the final centrifugation, resuspend particles in 1 ml DI water.\n2. Biofunctionalization of PB NPs, GdPB, and MnPB\nBiofunctionalization of the nanoparticles involves coating of the nanoparticle “cores” with avidin and adding biotinylated ligands as described below:\nCoating of the Nanoparticles with Fluorescent Avidin\n\tCoating of the nanoparticles with fluorescent avidin is achieved using electrostatic self-assembly where positively charged avidin (pI ~10.5) is coated on to negatively charged nanoparticles as follows18:\n\t\nPrepare suspensions of the PB NPs, GdPB, or MnPB in 1 ml DI water. Filter Alexa Fluor 488-labeled avidin (A488; reconstituted in DI water) through a 0.2 µm nylon microcentrifuge filter at 14,000 × g for 10 min. Add ≤0.2 mg avidin/mg nanoparticles. Add each filtered aliquot of A488 separately to the aliquots of PB NPs, GdPB, or MnPB.\nContact the nanoparticles with A488 for 2-4 hr with gentle shaking or rotation at 4 °C. Protect the samples from light using aluminum foil.\n\t\tNOTE: This step yields A488 coated PB NPs (PB-A488), GdPB (GdPB-A488), and MnPB (MnPB-A488).\nAttachment of Biotinylated Antibodies\n\tAttachment of biotinylated targeting antibodies onto the avidin-coated nanoparticles is achieved using avidin-biotin interactions as follows:\n\t\nPrepare suspensions of the avidin coated nanoparticles — PB-A488, GdPB-A488, and MnPB-A488 in 1 ml DI water. Filter biotinylated antibody (as supplied by the manufacturer) through a 0.2 µm nylon microcentrifuge filter at 14,000 × g for 10 min.",
    "NOTE: Here, the present study uses biotinylated anti-neuron-glial antigen 2 (ANG2) that targets NG2 overexpressed within cells and tissues of the central nervous system and biotinylated anti-human eotaxin-3 (Eot3) that targets receptors overexpressed on eosinophils or eosinophilic cell lines.\nAdd each filtered aliquot of biotinylated antibody separately to the aliquots of the avidin-coated nanoparticles. Add ≤0.05 mg biotinylated antibody/mg avidin-coated nanoparticles. Contact the avidin-coated nanoparticles with the biotinylated antibodies (ANG2 or Eot3) for 2-4 hr with gentle shaking or rotation at 4 °C. Protect the samples from light using aluminum foil.\n\t\tNOTE: This step yields antibody coated nanoparticles (e.g. GdPB-A488-Eot3 and MnPB-A488-ANG2).\n3. Sizing, Zeta Potential, and Temporal Stability of the Nanoparticles\nThe size distribution, charge, and stability of the nanoparticles are measured using dynamic light scattering (DLS) methods as described below:\nSizing of the Nanoparticles\n\tSizing of the nanoparticles is achieved using dynamic light scattering as follows:\n\t\nAdd 10 µl of the nanoparticle sample (1 mg/ml) to 990 µl of DI water in a disposable plastic cuvette.\n\t\tNOTE: This is representative value for a good DLS signal.\nCap the cuvette and vortex to mix well. Place the cuvette in a system used to analyze particle size in order to measure the size of the nanoparticles. Carry out particle size analysis at a measurement angle of 173°.\nZeta Potential of the Nanoparticles\n\tZeta potential of the nanoparticles is measured using phase analysis light scattering as follows:\n\t\nAdd 100 µl of the nanoparticle sample (1 mg/ml) to 900 µl of DI water in a disposable plastic capillary cell. This value is representative for a good zeta potential measurement.\nPlace the capillary cell in a system used to analyze zeta potential in order to measure the zeta potential of the nanoparticles using default parameters at 25 °C.\nTemporal Stability of the Nanoparticles",
    "Temporal stability of the nanoparticles is measured using dynamic light scattering as follows:\n\t\nAssess the stability of nanoparticles by measuring the sizes of the nanoparticles in DI water as well as Dulbecco’s Modified Eagle’s Medium (DMEM) as described in section 3.1.\nRepeat the size measurements in DI water and DMEM once/day over a period of 5 days.\n4. Cytotoxicity of the Nanoparticles\nCytotoxicity of the nanoparticles is measured using an XTT cell proliferation assay as follows:\nSeed 10,000-15,000 cells/well of each cell type studied (Neuro2a, BSG D10, EoL-1, and OE21) in a 96-well plate. Ensure that the total volume of seeded cells does not exceed 0.2 ml/well. Incubate seeded cells overnight at 37 °C and 5% CO2.\nContacting nanoparticles with the cells:\n\t\nIncubate the cells with varying concentrations of nanoparticles (0.01 – 0.5 mg/ml). Refer to Table 1 as a representative table that describes the amounts of the nanoparticles (in 50 µl) added to the cells after removing 50 µl of medium/well.\n\t\t\nTo account for any interfering absorbance of the nanoparticles within the assay, add a blank consisting of the appropriate concentration of nanoparticles (0-0.5 mg/ml; in equivalence to the amounts added to the cells) to medium without cells.\nIncubate cells with nanoparticles overnight at 37 °C and 5% CO2. Aspirate media from each well and rinse with staining buffer comprised of 5% fetal bovine serum (FBS) in phosphate-buffered solution (PBS). Add 100 µl of media without phenol red and incubate at 37 °C and 5% CO2 for 16-18 hr.",
    "Prepare the XTT Cell Proliferation Assay working solution by mixing the kit components (XTT Reagent and XTT Activator) as per the manufacturer’s specifications. Aspirate the media from the wells and add 100 µl of RPMI (RPMI w/o phenol red + 10% FBS + 1× Pen-Strep) or appropriate medium for the cell type studied. Add 50 µl of XTT working solution to each well and incubate at 37 °C and 5% CO2 for 2-2.5 hr.\nMeasure the absorbance at 490 nm, with a reference wavelength of 630 nm to correct for fingerprints or smudges. Calculate the corrected absorbance for each well (A490-A630) and average the readings for replicates.\nSubtract the blank readings from each well value to calculate the final corrected absorbance values. Calculate the survival percentage for each sample by normalizing the final corrected absorbance to that of untreated cells without nanoparticles. Plot survival percentage as a function of nanoparticle concentration.\n5. MRI Relaxivities of the PB NPs, GdPB, and MnPB\nMRI relaxivity is measured using T1- and T2-weighted sequences by preparing an MRI “phantom” using a 96-well plate containing nanoparticles as described below:\nPhantom Preparation\n\t\nPrepare a 96-well plate with each well containing 100 µl nanoparticles (PB NPs, GdPB, or MnPB) at the appropriate concentration. Beginning with a concentration of 0.4 mM for each type of nanoparticle, serially dilute the nanoparticles 2× using DI water until a concentration of 2.4 × 10-5 M is reached (this requires 14 dilutions and 15 wells).\nAdd 100 µl of molten 1% agarose solution in DI water into each well and mix well. Allow the gel to solidify at 4 °C for 12 hr.\n\t\tNOTE: This yields a phantom containing serial dilutions of the nanoparticles in solidified agarose.",
    "Place the phantom in a horizontal 3 T clinical magnet under a solid block of 2% agar (150 cm3). Secure the phantom and block of agar within the center of an 8-channel HD brain coil. Measure relaxation times using 0.5 mm thick coronal slices at the mid-height of the 96-well plate11.\nT1- and T2-Weighted Sequences\n\tUse the following representative settings for acquiring the sequences in the clinical magnet.\n\tNOTE: These values are optimized for the nanoparticles used in the present study:\n\t\nAcquire T1-weighted (T1W) MR images using the following fluid attenuated inversion recovery (FLAIR) sequence: Echo train (ET) = 8, Repetition time (TR) = 2,300 msec, Echo time (TE) = 24.4 msec, Matrix size = 512 x 224, Field of view (FOV) = 16 x 16 cm2.\nAcquire T2-weighted (T2W) MR images using the following fast relaxation fast spin echo (FRFSE) sequence: ET = 21; TR = 3,500 msec; TE = 104 msec; Matrix size = 512 x 224; FOV = 16 x 16 cm2.\nAcquire T1W and T2W MR images at 127 MHz (3 T) at the following inversion times: 50, 177, 432, 942, 1,961, and 4,000 msec.\nMeasuring the MRI Relaxivities\n\t\nAfter acquiring T1W and T2W images using the sequences described in section 5.2, measure the signal intensity for each well using ImageJ, henceforth designated as the region of interest (ROI) by selecting each ROI using the oval crop button located on the main toolbar, then selecting Analyze > Measure.\n\t\tNOTE: A pop-up should display the mean signal intensity of each ROI under the column labeled “Mean”.\nFor each ROI, plot the measured signal intensity against its specific inversion time. If needed, invert points (readings) that generate an initial “bubble” or outliers at the beginning of the plot (lower inversion times).",
    "NOTE: These readings are generated at low inversion times because MRI measures the magnitude or absolute value of images rather than their actual (negative) value, which needs to be accounted/corrected for19.\nPrepare an exponential fit for each plot of signal intensity for the ROIs (SI) vs. inversion times (TI) as described in section 5.2. Plot TI on the x-axis, SI on the y-axis; ɑ and Δ are constants determined by regression, and T1 or T2 is the variable to be solved:\nimgsrc://cloudfront.jove.com/files/ftp_upload/52621/52621eq1.jpg\n\t\twhere t = T1, T2.\nSolve for T1 or T2 using the above equation and plot the inverse of the calculated values (1/T1 and 1/T2) against the concentrations of the nanoparticles used in each ROI.\nCalculate the slope of the linear graph which yields the relaxivities r1 and r2.\n\t\tNOTE: The following section of the protocol describes the application of the nanoparticles for fluorescent labeling and generating MRI contrast in targeted cells.\n6. Fluorescent Labeling of Targeted Cells Using the Nanoparticles — Confocal Microscopy\nNOTE: The nanoparticles (PB NPs, GdPB, and MnPB) can be used to fluorescently label a population of targeted cells (monitored by confocal microscopy) as follows:\nSynthesis of the Fluorescent Nanoparticles\n\t\nSynthesize GdPB-A488, GdPB-A488-Eot3, MnPB-A488, MnPB-A488-ANG2 for fluorescent labeling of a population of targeted cells by following the steps detailed in sections 1 and 2.\nPreparation of Cells for Fluorescence Targeting\n\t\nCoat no. 1.5 micro cover glasses by dipping them in a solution of 0.002% poly(L-lysine) hydrobromide for 90 min. Remove the cover glasses from the solution and allow them to dry for 24 hr.",
    "Seeds the cells (e.g. EoL-1, BSG D10, SUDIPG1) on the coated cover glasses placed in a 6-well plate and incubate at 37 °C and 5% CO2 for at least 16 hr. Rinse the cells with a 1× PBS solution and ( optional) fix with 10% formaldehyde in neutral buffer solution for 15 min. Stain cells with 5 µM red-orange cell-permeant dye in PBS at 37 °C for 30 min. Subsequently, rinse cells with PBS.\n>Fluorescent Labeling of Targeted Cells\n\t\nAdd 1% bovine serum albumin (BSA; in DI water) to the cells to minimize non-specific binding on the cells, and incubate at 37 °C for 1 hr.\nIncubate cells with the nanoparticles in 1% BSA for 1 hr. For EoL-1: incubate with 0.2 mg/ml GdPB-A488 or GdPB-A488-Eot3; For BSG D10 and SUDIPG1: incubate with 0.2 mg/ml MnPB-A488 or MnPB-A488-ANG2. Rinse the cells with PBS 3× to remove unbound nanoparticles.\nCarefully invert the cover glass (containing cells and nanoparticles) on a microscope slide, ensuring that there are no trapped air bubbles. Seal the edge between the cover glass and microscope slide by carefully applying clear nail polish. Image the cells using a confocal laser scanning microscope.\n7. Fluorescent Labeling of Targeted Cells Using the Nanoparticles — Flow Cytometry\nThe nanoparticles (PB NPs, GdPB, and MnPB) can be used to fluorescently label a population of targeted cells (monitored by flow cytometry) as follows:",
    "Prepare suspensions of the cells being targeted in PBS. For pure culture studies, the suspensions consist of a single cell type (e.g. BSG D10); resuspend a cell pellet of BSG D10 cells in PBS at 100,000 cells/ml (10 ml total). For mixed culture studies, the suspensions consist of at least two cell types (e.g. EoL-1 and OE21); similar to BSG D10, resuspend cell pellets of EoL-1 and OE21 in PBS at 100,000 cells/ml each (10 ml total).\n\t\nPrepare varying ratios of EoL-1:OE21 1:0 (2 ml EoL-1), 3:1 (1.5 ml EoL-1, 0.5 ml OE21), 1:1 (1 ml each of EoL-1 and OE21), 1:3 (0.5 ml EoL-1, 1.5 ml OE21), 0:1 (2 ml OE21).\nBlock the cells (pure and mixed suspensions) being targeted by the nanoparticles with 2 ml of 5% BSA to minimize non-specific binding.\nAdd 1 ml (1 mg/ml) nanoparticles to the cells and incubate for 1 hr. For BSG D10, incubate cells with MnPB-A488, MnPB-A488-AbC (control antibody), or MnPB-A488-ANG2). For mixtures of EoL-1 and OE21, incubate the mixtures with a fixed amount of GdPB-A488-Eot3.\nRinse the cells free of unbound nanoparticles by spinning down the samples at 1,000 × g for 5 min at least 3× to remove unbound particles. Resuspend the cells in 1 ml PBS and fix with 10% formaldehyde in PBS. Stain cells by incubating with 10 µg/ml 7-Aminoactinomytcin D in PBS on ice for 30 min. Rinse with PBS, then analyze 10,000 gated cells from each sample using a flow cytometer.\n8. Generating MRI Contrast on Targeted Cells Using the Nanoparticles\nThe nanoparticles (PB NPs, GdPB, and MnPB) can be used to generate MRI contrast (in both T1- and T2-weighted sequences) in a population of targeted cells as follows:\nPhantom Preparation",
    "Grow cells (e.g. BSG D10) in T75 flasks until ~80% confluence. Use appropriate growth medium and conditions. For BSG D10, grow the cells in DMEM + 10% FBS + 1× Pen-Strep at 37 °C and 5% CO2.\nRinse cells free of medium with 5 ml PBS and block the cells with 5 ml 1% BSA in PBS for 1 hr to minimize non-specific binding. Add 5 ml (0.5 mg/ml) nanoparticles to the cells. For BSG D10, incubate the cells with MnPB-A488, MnPB-A488-AbC (control antibody), and MnPB-A488-ANG2 for 1 hr.\nRinse cells 3× with 5 ml PBS to remove unbound nanoparticles. Trypsinize the cells by incubating the cells with 2 ml Trypsin EDTA 0.25% solution 1× for 5 min at 37 °C and 5% CO2 to detach them from the flask for phantom preparation. Add 8 ml of DMEM to quench the trypsinization of cells.\nCollect the cells by centrifuging them at 1,000 × g for 5 min; aspirate out the supernatant. Resuspend the cells in 1 ml PBS and add 1 ml 10% formaldehyde in PBS to fix the cells. Add 100 µl of each sample to a separate well of a 96-well plate.\nAdd 100 µl of molten 1% agarose solution in DI water into each well and mix well by pipetting up and down. Allow the gel to solidify at 4 °C for 12 hr.\n\t\tNOTE: This yields a phantom containing cells with attached nanoparticles in solidified agarose.\nPlace the phantom in a horizontal 3 T clinical magnet next to a solid block of 2% agar (150 cm3). Secure the phantom and block of agar within the center of an 8-channel HD brain coil. Measure relaxation times using 0.5-mm thick coronal slices at mid-height of the 96-well plate11.\nT1- and T2-Weighted Sequences",
    "Use the following settings for acquiring the sequences in the clinical MRI magnet:\n\t\nAcquire T1W MR images using the following spin echo sequence: Echo train (ET) = 1, Repetition time (TR) = 650 msec, Echo time (TE) = 11 msec, Matrix size = 320 x 256, Field of view (FOV) = 10 x 10 cm2.\nAcquire T2W MR images using the following FRFSE sequence: ET = 28; TR = 3,000 msec; TE = 101 msec; Matrix size = 384 x 288; FOV = 10 x 10 cm2.\nPost-acquisition Processing\n\t\nFor easier reading, convert the original gray scale images into a color scale image using ImageJ: Select Image > Type > 8-Bit, to convert the image to gray scale.\nCalculate the normalized intensity for each sample after subtracting the signal contribution from the agarose solution.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}