{
  "id": 10141,
  "origin_website": "Jove",
  "title": "Imaging-Guided Bioreactor for Generating Bioengineered Airway Tissue",
  "procedures": [
    "The animal tissue protocol below has been approved by the animal welfare guideline and regulations of the Institute for Animal Care and Use Committee (IACUC) at Stevens Institute of Technology, and it complies with the National Institutes of Health (NIH) guidelines for the use of experimental animals.\n1. Design and construction of imaging-guided rat trachea bioreactor\nDesigning and fabrication of rat trachea bioreactor\n\t\nCreate a computer-aided design (CAD) model of the bioreactor chamber with relevant design, such as inlets, outlets, and tissue culture chamber, using CAD generator software. For this study, use the geometry and dimensions presented in Figure 1A-C. The tutorial of CAD generator software can be found in16,17.\nExport the generated CAD model to a computer numerical control (CNC) controller software and cut the polytetrafluoroethylene (PTFE) plastic using a CNC machine to create the bioreactor chamber. The tutorial of the CNC controller software can be found in18.\n\t\tNOTE: In addition to PTFE, other plastic materials, such as ultra-high molecular weight polyethylene (UHMWPE) and polyetherimide can be used to fabricate the culture chamber.\nSterilize all bioreactor components, such as Luer adapters and screws, to avoid contamination of the tissues and cells cultured in the device. Assemble all bioreactor components to the main tissue culture chamber in a clean environment (Figure 1A).\nConstruction of gradient index (GRIN) lens-based imaging device\n\t\nTo create the in situ imaging device, insert a tube lens into a stackable lens tube and secure it using a retaining ring. Mount the lens-tube assembly onto a scientific CMOS camera via a C-mount adapter.",
    "Use software, such as Micro-Manager, to operate the camera and acquire photos and videos. Aim an object located at a long distance (e.g., 10 m from the camera) and adjust the distance between the tube lens and imaging sensor of the camera until a focused image of the object is formed on the computer screen by the imaging software being used.\nMount a filter lens on a dual-edge super-resolution dichroic mirror and a laser to the device using optical cage system components, including assembly rod, threaded cage plate, and cage cube.\nConnect the objective lens (20x) to the device. Mount a GRIN lens (diameter = 500 µm) at the distal end of the lens tube via the XY translator. Adjust the distance between the GRIN lens and the objective lens to form focused microscopic images (Figure 2A,B).\n2. Isolation of the rat trachea\nSanitize the surgical area and sterilize the surgical instruments using an autoclave at 121 °C for 30 min prior to the surgery.\nPlace a rat in the induction chamber and deliver 2.5% of isoflurane for 15 min using a small vaporizer to anesthetize the animal. Assess the anesthesia depth by pedal reflex. To do this, firmly pinch the toe and confirm that the animal does not respond to the toe pinch.\nAfter anesthesia, remove the isoflurane from the chamber and administer 1 mL of 1,000 unit/mL heparin through the lateral tail vein to prevent blood clotting in the pulmonary vasculature.\nTo euthanize the animal, expose the animal to 5% isoflurane for an additional 15-20 min. Remove the animal from the induction chamber and place it on the surgical board in a face-up supine position.",
    "Fix the rat on the surgical board by immobilizing the legs and tail using adhesive tape. Next, sterilize the rat's neck and chest regions using 70% isopropyl alcohol (IPA). Open the abdominal cavity by making a 3-4 cm incision using scissors in the skin.\n\tNOTE: Be careful not to cut the skin deeply by pointing the tips of the scissors upward.\nTransect the inferior vena cava (IVC) using the scissors and confirm the euthanasia by exsanguination.\nPerform the tracheotomy by making an incision using scissors in the midline of the neck and exposing the trachea. Perform midline thoracotomy by making an incision in the chest wall and cutting between the ribs to reach the trachea end connected to the lung. Next, use a bicep and scissors to cut both ends of the trachea and isolate the trachea.\nAfter isolation, rinse the trachea using 20 mL of 1x phosphate-buffered saline (1x PBS). Transfer the trachea to the bioreactor using sterilized biceps. Secure the two ends of the trachea to the Luer connector using a 4-0 suture thread.\nDeliver 5 mL of culture medium to the bioreactor chamber using the programmable syringe pump through the tubing connected to the bioreactor chamber at a flow rate of 5 mL/min.\n\tNOTE: The culture medium is composed of Dulbecco's modified Eagle's medium (DMEM), recombinant human FGF-basic (0.1 ng/mL), fetal bovine serum (FBS, 10%), and antibiotic-antimycotic (1%).\nTightly close the bioreactor lid with the acrylic plastic lid and screws. Close the bioreactor chamber tubing connections with the male/female Luer plugs to prevent the flow of the culture medium in the tubing.\n3. Imaging-guided removal of the trachea epithelium\nTo visualize the trachea lumen either in bright-field or fluorescent, place the bioreactor on the imaging stage (Figure 3A).",
    "Prepare carboxyfluorescein succinimidyl ester (CFSE) solution (concentration: 100 μM) in the CFSE cell labeling kit by diluting the CFSE solution with 1x PBS.\n\tNOTE: The concentration of the original CFSE solution is 10 mM (in dimethyl sulfoxide (DMSO)).\nInfuse 500 µL of the CFSE solution through the trachea via the syringe pump through the tubing connected to the trachea cannula at a flow rate of 5 mL/min. Stop the pump when the CFSE solution fills the trachea. Wait for 10 min, and then wash the trachea lumen by infusion of 10 mL of 1x PBS using the syringe pump to remove the residual unincorporated CFSE reagent.\nInsert the distal imaging end of the GRIN lens into the trachea via the Luer connector attached to one end of the trachea. Then, gently move the GRIN lens inside the trachea until the trachea surface is focused and take photos and videos in bright-field or fluorescence at 20x magnification.\nFor capturing bright-field images in the Micro-Manager software follow the steps below.\n\t\nIntroduce white light through the cage cube to illuminate the trachea lumen. Click on the Live icon to show the luminal surface of the trachea in real-time. Use Imaging Setting > Exposure (ms) to change exposure time to the desired value. In this study, the exposure time used was in the range of 10 ms and 50 ms.\nTo adjust the contrast and brightness of images, use the Histogram and Intensity Scaling window to move black and white arrows at the endpoint of the interactive histogram display. Alternatively, use the Auto Stretch option that allows the software to adjust the brightness and contrast automatically to optimal levels.",
    "Click on the Snap icon to freeze the image. Then, use Setting > Export Images as Displaced to save the images in the desired format. Alternatively, use Setting > ImageJ to directly export the image to the ImageJ software and save it.\nTo obtain photos and videos in fluorescent mode, illuminate the trachea lumen with CFSE-specific laser light (CFSE: excitation wavelength: 488 nm, emission wavelength: 515 nm) through the cage cube. Follow the steps 3.5.2-3.5.3 to acquire the images. After taking photos and videos, gently remove the GRIN lens from the trachea.\nPerform de-epithelialization as described below.\n\t\nPrepare 2% sodium dodecyl sulfate (SDS) decellularization solution in distilled (DI) water. Instill 50 µL of SDS through the trachea at a flow rate of 6.3 mL/min, by using the syringe pump through the trachea cannula to generate a thin film of the detergent solution on the trachea lumen.\nClose the bioreactor's tubing connections using male/female Luer plugs and transfer the bioreactor to an incubator. Allow the SDS to dwell within the trachea for 10 min at 37 °C. Instill another 50 µL of SDS solution through the trachea and incubate for 10 min.\nRemove lysed epithelium and SDS by irrigating the trachea lumen with 500 µL of 1x PBS via syringe pump at a flow rate of 10 mL/min for 3x. Place the bioreactor on a shaker and mechanically vibrate the bioreactor at 20 Hz frequency and displacement amplitude of approximately 0.3 mm to physically promote detachment of SDS-treated epithelial cells from the trachea lumen.",
    "NOTE: In this study, the shaker was custom-built by assembling a subwoofer speaker, a subwoofer plate amplifier, and an accelerometer. A sinusoidal waveform was generated by a computer and fed into the shaker via the amplifier, while the response of the shaker was monitored via the accelerometer (Figure 3B). In addition, conventional shakers, such as electromagnetic and inertia shakers, can be used to promote the detachment of the cells. To do this, set the frequency and acceleration of the shaker to 20 Hz and 0.5 g, respectively (equivalent to 0.3 mm displacement amplitude).\nInstill 500 µL of 1x PBS twice through the trachea lumen to remove residual SDS and cell debris while the trachea is mechanically vibrated. Following the epithelium removal procedure, evaluate the clearance of the epithelial layer by measuring the intensity of CFSE using the GRIN lens imaging device as in step 3.6 (Figure 3C).\n4. Trachea tissue preparation for further analyses\nTo confirm the epithelium removal, perform further tissue analyses, such as hematoxylin and eosin (H&E) staining, trichrome, pentachrome, and immunostaining. To do this, remove the trachea from the bioreactor, and fix it in 30 mL of 4% neutral buffered paraformaldehyde solution in 1x PBS (pH = 7.4) at 4 °C overnight.\nDehydrate and embed the fixed trachea tissue by following the steps below.\n\t\nAfter fixation, wash the trachea tissue with 10 mL of 1x PBS, transfer the trachea to 30 mL of 70% alcohol, and keep it at 4 °C overnight. Cut the trachea into small cylindrical sections (~5 mm) using a sharp blade and insert the tissue sections in the tissue embedding cassettes (length x width x height: 4 cm x 2.5 cm x 0.5 cm). Keep two trachea sections in each cassette.",
    "Dehydrate the sections in a series of isopropyl alcohol (IPA) solutions - 85%, 90%, 95%, 100% - for 1 h in 30 mL of each solution. Remove the previous solution before adding the next solution.\nUpon completion, submerge the cassettes in 30 mL of clearing agent (e.g., xylene) for 2 h to displace the IPA solution from the tissue sections completely. Perform this step in a fume hood with proper ventilation.\nSubmerge the cassettes in paraffin for 2 h, and then embed them in paraffin at 4 °C overnight. Next, cut the paraffin-embedded tissues into thin sections (5-8 μm) using a microtome device for the H&E, trichrome, pentachrome, and immunostaining.\nTo prepare the tissues for scanning electron microscopy (SEM) analysis, fix the trachea in 30 mL of 2.5% glutaraldehyde solution in 1x PBS (pH = 7.4) at 4 °C overnight. Then, dehydrate the fixed trachea tissue for SEM by following the steps below.\n\t\nAfter fixation, rinse the trachea tissue with 10 mL of 1x PBS. Cut the trachea tissue longitudinally into small semi-cylinder sections (length: ~5 mm) using scissors and insert the tissue sections in the cassettes.\nDehydrate the sections in a series of IPA solutions - 35%, 50%, 70%, 85%, 95%, and 100% - for 10 min in 30 mL of each solution. Remove the previous solution before adding the next solution.\nPerform hexamethyldisilazane (HMDS)-based drying method by submerging the tissues in the following solutions: 100% IPA: HMDS (2:1; v/v) for 10 min, followed by 100% IPA: HMDS (1:2; v/v) for 10 min, and finally 100% HMDS for overnight.\n\t\tNOTE: HMDS is toxic. Work under a fume hood during all drying steps.",
    "Remove the tissues from the HMDS solution and allow them to dry under the fume hood for 1 h. Mount the section on aluminum pin stubs using a carbon double-sided conductive tape or silver conductive paste for SEM imaging.\n5. Homogeneous distribution of exogenous cells onto the denuded tracheal lumen\nPrepare a de-epithelialized rat trachea using the protocol in step 3. Thaw frozen mesenchymal stem cells (MSCs) for 30 s in a 37 °C water bath.\n\tNOTE: In this study, we used mesenchymal stem cells (MSCs) as a model cell to show the distribution of exogenous cells onto the de-epithelialized trachea. Ideally, primary airway epithelial cells, basal cells, or induced-human pluripotent cells (iPSCs) can be used for epithelium regeneration purposes.\nCount the cells with a hemocytometer and prepare a cell solution with a concentration of 5 x 106 cells/mL. Label the cells fluorescently by incubating the cells with 2 mL of CFSE solution (concentration: 100 µM) at room temperature for 15 min. Rinse the cells with 5 mL of 1x PBS for 3x and resuspend the cells in fresh culture medium at a final concentration of 3 x 107 cells/mL.\nPrepare hydrogel pre-gel solution as a vehicle for cell delivery. For this study, use collagen I as a delivery vehicle for MSCs cells and follow the manufacturer's instructions to prepare the pre-gel. For example, to obtain 3.6 mg/mL collagen pre-gel, mix one part of the chilled neutralization solution with nine parts of the rat tail collagen in a 1.5 mL sterile tube. Then, gently pipet the mixture up and down for adequate mixing.\n\tNOTE: Other biocompatible hydrogels may be used instead of collagen I according to the study and user needs.",
    "Once the hydrogel solution is prepared, add the cells quickly to the solution with desired concentration (e.g., 5 x 106 cells/mL). To obtain a uniform cell-hydrogel mixture, mix the cells and gel solution by gently pipetting with a micropipette.\nAttach one end of the trachea within the bioreactor to a programmable syringe pump through a Luer connector. Deliver 5 mL of fresh culture medium at 37 °C into the bioreactor chamber to cover the exterior surface of the trachea using the syringe pump at a flow rate of 5 mL/min.\nAdminister a 10 µL bolus of the cell-hydrogel mixture into the de-epithelialized trachea within the bioreactor using the syringe pump at a flow rate of 5 mL/min to generate a cell-hydrogel layer on the trachea lumen (Figure 4).\nAfter cell injection, place the bioreactor in a sterile cell culture incubator at 37 °C and 5% CO2 for gelation. For collagen I, the gelation occurs in 30 min.\nTo visualize the distribution of implanted cells, sterilize the GRIN lens by wiping with 70% IPA or ethanol and place the bioreactor on the imaging stage. Take photos and videos in both bright-field and fluorescent modes as needed.\nAfter 30 min of cell seeding, infuse 1 mL of culture medium into the trachea lumen using a syringe pump at a flow rate of 1 mL/min.\nCulture the cell-seeded trachea within the bioreactor in an incubator at 37 °C for the desired time. For long-term culture, refresh the culture medium in the trachea lumen and the bioreactor chamber every 24 h. During the cell culture, keep the media inside the lumen static and change it every 24 h, while the media outside the trachea is continuously perfused via a unidirectional flow at 5 mL/min.",
    "After culturing the cells for a certain time period (e.g., 1 and 4 days in this study), remove the trachea from the bioreactor. Use scissors to cut the trachea longitudinally into two semi-cylinder sections (i.e., upper and lower sections) on days 1 and 4 of in vitro culture to expose the inner surfaces for monitoring cell growth and calculating cell density. Use a conventional fluorescent microscope to visualize the cells on the inner surfaces.\nTo acquire the images using Micro-Manager software, follow steps 3.5 and 3.6. Use a fluorescein isothiocyanate (FITC) filter to visualize the CFSE-labeled cells in fluorescence mode. Analyze the images taken by the fluorescent microscope and calculate cell densities on upper and lower sections using the ImageJ software. To calculate the number of cells and the cell density, follow the steps below.\n\t\nOpen an image in ImageJ software and convert the image to a binary image (16-bit) using Image > Type > 16-bit. Set the image scale with the scale bar using Analyze > Set Scale.\nAdjust the threshold of the image to highlight the structures of the cells to count. Use Image > Adjust > Threshold. Use Analyze > Analyze Particles to count the number of the cells. Calculate the density of the cells by dividing the number of cells by the surface area of the image.\nTo assess the viability after cell seeding, use a cell viability kit. For this study, incubate the trachea tissue and the cells in the bioreactor at 37 °C for 6 h and stain the cells with 4 mM calcein-AM and 2 mM ethidium homodimer-1 in 1 mL of 1x PBS at room temperature for 15 min.",
    "After rinsing with 1x PBS, visualize the cells using a fluorescent microscope. Count the live and dead cells using the steps described in step 5.12. Calculate cell viability as the percentage of live cells (stained with calcein-AM) per total cells (both live and dead cells).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}