{
  "id": 19823,
  "origin_website": "Wiley",
  "title": "Specific Localization and Quantification of the Oligo-Mouse-Microbiota (OMM12) by Fluorescence In Situ Hybridization (FISH)",
  "procedures": [
    "This protocol presents a method to fix mouse gut tissue before cryosectioning, then to fluorescently label each single OMM12 strain on mouse tissue, and finally to localize and quantify each OMM12 strain in vivo.\nMaterials\nMouse of interest\n4% (w/v) paraformaldehyde (PFA; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-rec-0003])\n20% (w/v) sucrose in phosphate-buffered saline (PBS)\nTissue-Tek Optimal Cutting Temperature (O.C.T.) compound\nLiquid nitrogen\n50%, 80%, and 96% ethanol\nHybridization buffers (see Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-tbl-0002])\nNail varnish\nFISH probe (see Support Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-prot-0002])\nWashing buffers (see Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-tbl-0003])\nAntifade mounting medium (e.g., Vectashield)\nTable 2.\n                Composition of Hybridization Buffersa[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-tbl2-note-0002_52]\ntable:\n﻿Reagent,Volume (μl),Volume (μl).1,Volume (μl).2,Volume (μl).3,Volume (μl).4,Volume (μl).5,Volume (μl).6,Volume (μl).7,Volume (μl).8,Volume (μl).9,Volume (μl).10,Volume (μl).11,Volume (μl).12,Volume (μl).13\nFormamide (% final),0,5,10,15,20,25,30,35,40,45,50,55,70,\n5 M NaCl,180,180,180,180,180,180,180,180,180,180,180,180,180,\n1 M Tris•HCl,20,20,20,20,20,20,20,20,20,20,20,20,20,\nDeionized distilled water,799,749,699,649,599,549,499,449,399,349,299,249,99,\nFormamide,0,50,100,150,200,250,300,350,400,450,500,550,700,\n10% SDSb[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-tbl2-note-0003_53],1,1,1,1,1,1,1,1,1,1,1,1,1,\nSDS, sodium dodecyl sulfate.\na Buffers should be prepared in tightly closable 2-ml tubes and, preparation should be conducted in a fume hood as formamide is highly toxic and volatile.\nb SDS should be added inside the lid of the 2-ml tube, which will be vortexed immediately before use.\nTable 3.\n                Composition of Washing Buffersa[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-tbl3-note-0001_54]\ntable:\n﻿Reagent,Volume (ml),Volume (ml).1,Volume (ml).2,Volume (ml).3,Volume (ml).4,Volume (ml).5,Volume (ml).6,Volume (ml).7,Volume (ml).8,Volume (ml).9,Volume (ml).10,Volume (ml).11,Volume (ml).12\nFormamide (%)b[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-tbl3-note-0002_55],0.0,5.0,10.0,15.0,20.0,25.0,30.0,35.0,40.0,45.0,50.0,55.0,70.0\n5 M NaCl,9.0,6.3,4.5,3.2,2.2,1.5,1.0,0.7,0.5,0.3,0.2,0.1,0.0\n1 M Tris•HCl,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0\n0.5 M EDTA,0.0,0.0,0.0,0.0,0.5,0.5,0.5,0.5,0.5,0.5,0.5,0.5,0.5\na After addition of reagents, all solutions should be brought to 50 ml using deionized distilled water.\nb Indicates the formamide concentration in the corresponding hybridization buffer.\nDental floss\nSurgical scissors\n2.5-ml sample cup with snap-in lid, 32 × 14 mm (e.g., A. Hartenstein, cat. no. PR02)\nCryotome (e.g., Leica CM1950)\nSuperfrost Plus slides, 75 × 25 × 1 mm (e.g., A. Hartenstein, cat. no. OTS)\n2-ml microcentrifuge tubes\nVortex mixer\n50-ml conical tubes\nAbsorbent paper\nVariable temperature oven, dry heat, protected from light\nConfocal microscope (e.g., Leica TCS SP5) with image acquisition software",
    "Digital Image Analysis in Microbial Ecology (DAIME) software, version 2.2 (available at: https://dome.csb.univie.ac.at/daime[href=https://dome.csb.univie.ac.at/daime]; Daims, Lücker, & Wagner, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-bib-0008])\nAdditional reagents and equipment for mouse euthanasia (see Current Protocols article: Donovan & Brown, 2005[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-bib-0015])\nNOTE: All protocols involving live animals must be reviewed and approved by the appropriate animal care and use committee and must follow regulations for the care and use of laboratory animals.\nPreparation and fixation of mouse gut tissue in 4% paraformaldehyde\n1. Sacrifice mouse by opening the abdomen and carefully exposing intestinal organs (e.g., cecum) without squeezing the organs.\n2. Use dental floss to close intestinal parts of interest with a node, and excise it (e.g., 1 cm cecum tip).\n3. Fix closed organ in 2 ml ice-cold 4% (w/v) PFA in 2.5-ml sample cups with snap-in lid at 4°C overnight.\n4. The next morning, discard 4% (w/v) PFA, and replace with 20% (w/v) sucrose in PBS. Incubate overnight at 4°C.\n5. Remove 20% (w/v) sucrose in PBS, and dab organ on paper tissue to remove excess liquid.\n6. Embed tissue vertically in O.C.T. compound until it is covered (1 to 2 ml), and snap freeze in liquid nitrogen.\n7. Store frozen samples at −80°C.\n8. Generate 7-µm thick cryosections from region of interest (ROI) using a cryotome, and air-dry sections on superfrost plus slides at least one night before hybridization at room temperature.\nFluorescence in situ hybridization of mouse gut sections",
    "In order to increase fluorescence signal, FISH probes can be double labeled at 3’ and 5’ ends. This trick was previously described by Stoecker, Dorninger, Daims, & Wagner (2010[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-bib-0041]). In our case, probes were double labeled with either fluorescein isothiocyanate (FITC), cyanine 3 (Cy3), or Cy5 and then purified by high-performance liquid chromatography (HPLC) and lyophilized by commercial suppliers. Antisense probes should be used as negative controls. Bacterial DNA can be stained by Sytox-Green.\n9. Dehydrate gut sections using increasing concentrations of ethanol (50%, 80%, and 96%) for 3 min each.\n10. Air dry ∼5 min. Meanwhile, prepare all hybridization buffers (see Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-tbl-0002]) at 0%, 10%, 20%, 30%, 35%, 40%, 45%, and 55% formamide in a fume hood. Prepare one 2-ml tube per FISH probe. Be careful to add sodium dodecyl sulfate (SDS) inside the lid of the 2-ml tube, and vigorously vortex right before use.\n11. Deposit nail varnish around each dehydrated section mounted on the superfrost plus slide to build a barrier that keeps liquid on the section.\n12. Prepare one moist chamber per slide: take one 50-ml tube, and insert a piece of absorbent paper at the bottom.\n13. Depending on the amount of sections, take an aliquot of the freshly prepared hybridization buffer out of the 2-ml tube, and mix with FISH probe at a final concentration of 5 ng/µl. Use 50 to 100 µl per section (depending on section size).\n14. Pour remaining hybridization buffer from the 2-ml tube into the moist chamber to humidify it.\n15. Incubate slide within the horizontally oriented, closed, moist chamber for 4 hr at 46°C in the dark. Meanwhile, prepare corresponding washing buffer (see Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-tbl-0003]) in 50-ml tubes using the same formamide concentration as in the hybridization buffers. Prewarm tubes containing washing buffer at 48°C.",
    "16. Mix tube containing washing buffer by inversion.\n17. Quickly place slide into tube containing washing buffer in a fume hood, and incubate slide 10 min at 48°C.\n18. Rinse slide 5 s in ice-cold distilled water to avoid nonspecific probe binding.\n19. Dry slide in a laminar flow hood in the dark for 5 to 10 min until dry.\n20. Mount slide in the dark using antifade mounting medium. To do so, add a drop of mounting medium to each section, and then add a coverslip. Seal with nail varnish, and dry and store in the dark at 4°C before analysis.\nImage acquisition and fluorescence signal analysis\n21. Acquire TIFF images (1024 × 1024) using a confocal microscope within 24 hr.\nIn our case, TIFF images were obtained using Leica LAS AF software.\n22. Import merge and grayscale images in .tif format into DAIME software.\nBe careful to properly label images; for example, label as X_# where X is common to all images (letters or number only) and # is the image number. Moreover, images from different channels (including merge) must be in a separate file.\n23. Set up image scale by clicking on the “ruler” icon.\nThe z-scale corresponds to the number of images.\n24. Open the visualizer option, and click on the “OBJ” icon, then on “2D segmentation.”\n25. Click on the “freehand” icon, and left click to draw a line to define the ROI. Then, close ROI using a right click.\n26. Convert ROI to an object using the corresponding icon.\n27. Sequentially click “Analysis,” “Biofilm tool,” and “Create Slicer template…,” and enter desired slice thickness. Select appropriated slicing direction, and then press OK.\nThe baseline smoothing is 19% by default. Smoothing represents how precisely the slice bands are going to follow the epithelial borderline.",
    "28. Open resulting object series in visualizer, and click the “OBJ” icon. Click the “rainbow” button to better visualize the different slices, and save file as .stk format.\nIf needed, a single slice can be rejected from the analysis. Right click on the slice, and then reject it as a normal object. It can also be rejected in the selected image or in all of them (tick “in all images” option).\n29. Manually check each gray level picture to remove background particles that could bias analysis. To do so, select a gray level channel. Open visualizer and use the “OBJ” icon. After having deleted an object, perform a new 2D segmentation.\nNutrients and other gut contents emit autofluorescence such as in Cy3 and FITC channels. Deletion of autofluorescent particles is feasible using the “Image Calculator” icon to subtract the Cy3 channel from the FITC channel.\n30. Sequentially click “Analysis,” “Biofilm tools,” and then “Slice & quantify biovolume fraction” to quantify relative biovolume using the robust automated threshold selection (RATS) algorithm (Kittler, Illingworth, & Föglein, 1985[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-bib-0024]). Ignore objects up to five pixels (Daims & Wagner, 2007[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-bib-0010]).\nThe user should not consider the analysis results as good under 80% congruency (i.e., 80% of the targeted population only also stained with the Eub probes).\n31. Export and save the final data.\nAs an example, saved files can be opened under Editor, and then copied and pasted into spreadsheet analysis software.\nThe orange icon “LOG” allows the user to see the commands history, which can also be exported as HTML or plain text.\nAn example of the result is presented in Understanding Results.",
    "To establish an OMM12 FISH probe set, probes were designed using ARB software. In order to validate FISH probe strain specificity and optimize fluorescence signal intensity, pure OMM12 bacterial cultures were anaerobically grown, fixed in PFA, and then stored at −20°C. Determination of optimal formamide concentration, and thus optimal hybridization stringency, was achieved by performing FISH using gradients of formamide concentrations on each probe-strain combination. Finally, probe strain specificity was confirmed using pure fixed OMM12 bacterial suspensions. Such an approach can be used to validate other FISH probes.\nAdditional Materials (also see Basic Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-prot-0001])\nOMM12 strain of interest\nBrain heart infusion medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-rec-0002])\nAnaerobic Akkermansia medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-rec-0001])\nAnaerobic gas mixture (7% H2, 10% CO2, 83% N2)\nPBS\nARB software (available at: http://www.arb-home.de[href=http://www.arb-home.de])\nAnaerobic cultivation platform (e.g., Coylab Anerobic Chamber)\nSpectrophotometer\nCentrifuge\n10-well diagnostic slides, 76 × 25 × 1 mm (e.g., Thermo Fisher Scientific)\nAdditional reagents and equipment to perform culture using the Hungate technique (for detailed description see https://www.dsmz.de/fileadmin/Bereiche/Microbiology/Dateien/Kultivierungshinweise/englAnaerob.pdf[href=https://www.dsmz.de/fileadmin/Bereiche/Microbiology/Dateien/Kultivierungshinweise/englAnaerob.pdf])\nFluorescence in situ hybridization probe design\n1. Load full-length 16S rRNA gene sequences of all OMM12 bacterial strains into ARB, and use SILVA SSU NR database as described in Ludwig et al. (2004[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-bib-0029]) and Quast et al. (2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-bib-0037]). See Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-tbl-0001] for probe sequences and further information.\nPreparation of bacterial anaerobic cultures\n2. Inoculate one stock of each OMM12 strain either in 10 ml brain heart infusion medium for strict anaerobes or in 10 ml anaerobic Akkermansia medium for A. muciniphila YL44 (Derrien, Vaughan, Plugge, & de Vos, 2004[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-bib-0013]). Incubate at 37°C without agitation in anaerobic cultivation platform. After 24 hr prepare subcultures: 200 µl culture in 10 ml fresh medium.\n3. Gas first and subcultures using the Hungate technique and an anaerobic gas mixture (7% H2, 10% CO2, 83% N2).",
    "4. Incubate subculture at 37°C until the optical density at 600 nm (OD600) = 1, which depending on the growth rate can take several hours to days.\nAs an exception, YL45 is translucent and will not reach OD600 = 1.\nAnaerobic cultivation of the OMM12 strains is also described in Brugiroux et al. (2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-bib-0005]).\nFixation of bacterial culture in 4% paraformaldehyde\n5. Centrifuge 250 µl of each culture (250 µl YL45 after 48 hr subculture) in a 2-ml tube 5 min at 6800 × g, 4°C.\n6. Discard supernatant and resuspend pellet in 750 µl ice-cold 4% (w/v) PFA.\n7. Incubate 3 hr at 4°C.\n8. Centrifuge 5 min at 6800 × g, 4°C.\n9. Discard supernatant and resuspend pellet in 1 ml ice-cold PBS.\n10. Wash three times in ice-cold PBS, centrifuging 5 min at 10,600 × g, 4°C, between each step.\n11. Resuspend bacterial pellet in 250 µl ice-cold PBS and 250 µl ice-cold 96% ethanol.\n12. Store at −20°C before use.\nOptimization of hybridization stringency\nIn order to increase fluorescence signal, FISH probes can be double labeled at 3’ and 5’ ends. This trick was previously described by Stoecker et al. (2010[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-bib-0041]). In our case, probes were double labeled with either FITC, Cy3, or Cy5 and then purified by HPLC and lyophilized by commercial suppliers. To identify the optimal formamide concentration for each probe, increasing formamide concentrations (0%, 10%, 20%, 30%, 35%, 40%, 45%, and 55%) are tested for maximal signal strength and specificity.\n13. After probe synthesis, resuspend probes in distilled water to generate 100 ng/µl stock solutions and to later prepare 50 ng/µl working solutions. Store all probes at −20°C.\n14. Spot 2 µl/well PFA-fixed bacterial suspension onto diagnostic slides, and dry at 46°C for 5 min.",
    "15. Incubate slide sequentially in 50% ethanol, 80% ethanol, and then 96% ethanol for 3 min each.\n16. Air dry for about 5 to 10 min. Meanwhile, prepare all hybridization buffers (see Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-tbl-0002]) at 0%, 10%, 20%, 30%, 35%, 40%, 45%, and 55% formamide in a fume hood. Prepare one 2-ml tube per FISH probe. Be careful to add SDS inside the lid of the 2-ml tube, and vigorously vortex it right before use.\n17. Prepare one moist chamber per slide: take one 50-ml tube, and insert a piece of absorbent paper at the bottom.\n18. Depending on the amount of spots, take an aliquot of the freshly prepared hybridization buffer out of the 2-ml tube, and mix with FISH probe at a final concentration of 5 ng/µl. Use 20 µl per spot.\n19. Pour remaining hybridization buffer from the 2-ml tube into the moist chamber to humidify it. Incubate diagnostic slide within the horizontally oriented, closed, moist chamber for 4 hr at 46°C in the dark. Meanwhile, prepare corresponding washing buffer (see Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-tbl-0003]) in 50-ml tubes, using the same formamide concentration as in the hybridization buffers. Prewarm tubes containing washing buffer at 48°C.\n20. Mix tube containing washing buffer by inversion.\n21. Quickly place diagnostic slide into tube containing washing buffer in a fume hood, and incubate slide 10 min at 48°C.\n22. Rinse slide 5 s in ice-cold distilled water to avoid nonspecific probe binding.\n23. Dry slide in a laminar flow hood in the dark for 5 to 10 min until dry.\n24. Mount slide in the dark using antifade mounting medium. To do so, add a drop of mounting medium to each spot, and then add a coverslip. Seal with nail varnish, and dry and store in the dark at 4°C before analysis.",
    "Image acquisition and fluorescence signal analysis\n25. Acquire TIFF images (1024 × 1024) using a confocal microscope within 24 hr.\nIn our case, TIFF images were obtained using Leica LAS AF software.\n26. Import TIFF images as .tif format into DAIME software.\nBe careful to properly label TIFF images; for example, label as f%-# where % corresponds to the tested formamide concentration (number only) and # is the image number.\n27. Open the visualizer option, and click on the “OBJ” icon and then on “2D segmentation” using the RATS algorithm (Kittler et al., 1985[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-bib-0024]). Ignore objects up to five pixels (Daims & Wagner, 2007[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.548#cpz1548-bib-0010]).\n28. Click the “FA%” icon.\n29. Export “Mean for each FA conc.,” and use these data for plotting."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}