{
  "id": 10447,
  "origin_website": "Jove",
  "title": "Imaging Integrin Tension and Cellular Force at Submicron Resolution with an Integrative Tension Sensor",
  "procedures": [
    "All methods described here have been approved by the Institutional Animal Care and Use Committee (IACUC, 8-16-8333-I) of Iowa State University.\n1. Synthesis of the integrative tension sensor\nCustomize and order ssDNAs (see the Table of Materials).\n\tNOTE: The ssDNA sequences are as follows. The upper strand is /5ThioMC6-D/GGG AGG ACG CAG CGG GCC/3BHQ_2/. The lower strands are as follows.\n\t12 pN ITS: /5Cy3/GGC CCG CTG CGT CCT CCC /3Bio/\n\t23 pN ITS: /5Cy3/GGC CCG CTG CGT CC /iBiodT/ CCC\n\t33 pN ITS: /5Cy3/GGC CCG CTG CG/iBiodT/ CCT CCC\n\t43 pN ITS: /5Cy3/GGC CCG C/iBiodT/G CGT CCT CCC\n\t54 pN ITS: /5Biosg//iCy3/GGC CCG CTG CGT CCT CCC\n\tHere, /5ThioMC6-D/ represents a thiol modifier C6 S-S (disulfide) at the 5' end. /3BHQ_2/ represents a Black Hole Quencher 2 at the 3' end. /3Bio/, /5Biosg/, and /iBiodT/ are biotinylation at the 3' end, the 5' end, and on the thymine of internal DNA, respectively. /iCy3/ represents a Cy3 inserted into the internal backbone of ssDNA. These codes are used by the specific commercial supplier used here and may be different in other DNA companies.\nConjugate RGD peptide to the SH-ssDNA-quencher.\n\tNOTE: The reagents used are phosphate-buffered saline (PBS), sulfosuccinimidyl 4-(N-maleimidomethyl)cyclohexane-1-carboxylate (sulfo-SMCC), RGD peptide, and tris-(2-carboxyethyl)phosphine hydrochloride, also known as TCEP-HCl.\n\t\nDeprotect the thiol modifier on the upper strand DNA using TCEP solution.\n\t\tNOTE: Thiol-modified DNAs ordered from a commercial source are shipped in oxidized form, with the sulfur atoms protected by a disulfide bond that needs be reduced prior to RGD-DNA conjugation. TCEP is an odorless reduction reagent used for the thiol deprotection.",
    "Dissolve 14.3 mg of TCEP-HCl in 300 µL of water. Adjust the pH of the TCEP solution to ~7.2–7.4 with 1 M NaOH solution (about 150 µL), using pH test papers. Add pure water to make a final volume of 0.5 mL. The final TCEP concentration is 100 mM.\n\t\t\tNOTE: It is recommended to make TCEP solution fresh every time for DNA thiol deprotection. Avoid stocking TCEP solution for a long time.\nAdd 100 µL of 0.5 M ethylenediaminetetraacetic acid (EDTA) solution and 400 µL of water to the TCEP solution.\nAdd 10 µL of the TCEP+EDTA solution to 20 µL of 1 mM thiol-DNA-BHQ2 in PBS. Let the solution react for 30 min at room temperature.\n\t\t\tNOTE: The disulfide bond of 5' thiol modifier C6 S-S conjugation at this ssDNA will be cleaved by TCEP, leaving the thiol group ready for reaction with maleimide in the next steps. The TCEP does not interfere with the following thiol-maleimide reaction; thus, it is not necessary to passivate TCEP after this step.\nConjugate RGD-NH2 with sulfo-SMCC.\n\t\t\nDissolve 5 mg of RGD-NH2 in 100 µL of PBS to obtain 11 mM RGD-NH2.\nAdd 200 µL of pure water to the tube with 2 mg of sulfo-SMCC (premeasured by the supplier). Smash the sulfo-SMCC solid with a pipette tip and vigorously pipette at the same time to facilitate dissolving the SMCC in the water. The concentration of sulfo-SMCC will be 23 mM.\n\t\t\tNOTE: Because the NHS ester in sulfo-SMCC is subject to hydrolysis and has a lifetime of a few minutes, this dissolving step should be completed within 1 min to avoid excessive loss of the NHS ester due to hydrolysis. Use pure water to dissolve sulfo-SMCC because its solubility in PBS or other buffers is poor.",
    "Add 40 µL of sulfo-SMCC solution to the 100 µL RGD-NH2 solution and incubate it for 20 min.\n\t\t\tNOTE: The NHS ester in sulfo-SMCC will react with the amine group in RGD-NH2, forming an amide bond that links RGD and sulfo-SMCC.\nConjugate RGD-SMCC with the SH-ssDNA-quencher.\n\t\t\nMix the solutions prepared in steps 1.2.1 and 1.2.2 and incubate the mixture for 1 h at room temperature. Move the solution to a refrigerator set at 4 °C and let it further react overnight. The thiol conjugated on the upper strand DNA will react with maleimide on sulfo-SMCC, forming a thioether group that links RGD with the upper strand DNA.\nPerform ethanol precipitation to purify RGD-ssDNA-quencher from unreacted sulfo-SMCC, RGD, and TCEP.\n\t\t\nChill 10 mL of 100% ethanol in a 15 mL conical tube in a -20 °C freezer for at least 30 min.\nMix a 3 M NaCl solution, a DNA solution, and chilled ethanol at a volume ratio of 1:10:25. Keep the mixed liquid in a -20 °C freezer for 30 min or until the DNA is precipitated.\nCentrifuge the liquid at 10,000 x g for 30 min. Discard the supernatant.\nAdd PBS to the DNA pellet. Measure the DNA concentration using a spectrometer.\n(Optional) Perform DNA electrophoresis to gain a higher RGD-ssDNA purity.\n\t\tNOTE: With the above protocol, about 70%–90% of the ssDNA will be conjugated with RGD. If higher purity is desired, DNA electrophoresis can also be performed to separate conjugated DNA from unconjugated DNA.\n\t\t\nAssemble a vertical electrophoresis system.\nPrepare a 10% polyacrylamide gel solution by mixing 50 mL of pure water, 20 mL of 40% acrylamide gel, 8 mL of 10x tris-borate-EDTA (TBE) buffer and 800 µL of 10% ammonium persulfate (APS).",
    "Add 80 µL of tetramethylethylenediamine (TEMED) to the gel solution. Pour the solution into the glass chamber of the electrophoresis system. Insert a single-well comb to create a well on top of the gel. Wait for 10 min till the gel is crosslinked.\nMix the DNA solution with 100% glycerol at a volume ratio of 1:1. Remove the comb and load the DNA solution to the gel well.\nRun the gel at a voltage of 200 V. Observe two DNA bands in which the lagging one is the conjugated DNA.\nCut the gel band with the conjugated DNA off and dice it into small pieces.\nCollect the diced gel in two 1.5 mL centrifuge tubes with filters. Add 500 µL of PBS to each tube.\nPut the PBS-soaked gel in a dark place at room temperature for 1 day. DNA will diffuse out of the gel pieces into the PBS.\nCollect the DNA solution by centrifuging the tubes at 1,000 x g for 2 min.\nPerform another round of ethanol precipitation (step 1.2.4) to collect the DNA.\nSynthesize the ITS by hybridizing RGD-ssDNA-quencher and dye-ssDNA-biotin.\n\t\nMix the solutions of the upper strand and the lower strand DNAs at a molar ratio of 1.1:1. Keep the mixture at 4 °C overnight to produce the ITS by DNA hybridization.\n\t\tNOTE: A molar ratio of 1.1:1 for DNA hybridization is used instead of 1:1. Excessive RGD-ssDNA-quencher is used to ensure that all dye-ssDNA-biotin will hybridize with RGD-ssDNA-quencher. RGD-ssDNA-quencher without hybridization will be washed off during surface coating, which will not affect the ITS surface coating quality.\nAliquot and store the ITS solution at -20 °C for long term storage.",
    "NOTE: The storage buffer is PBS and the storage concentration should generally be above 10 µM. For regular use, ITS solution can be stored at 4 °C for a few weeks without noticeable quality deterioration.\n2. Preparation of ITS surfaces by immobilizing the ITS on glass-bottomed Petri dishes\nNOTE: The reagents used are biotinylated bovine serum albumin (BSA-biotin), avidin protein, and ITS. Chill all reagents and PBS buffer to around 0 °C on ice with an ice bucket.\nLoad 200 µL of 0.1 mg/mL BSA-biotin in PBS onto the well of a glass-bottomed Petri dish (29 mm in diameter, with a 14 mm well). Incubate it for 30 min at 4 °C in a refrigerator. BSA-biotin is physically adsorbed on the glass surface.\nSuck out the solution from the well using a pipette and add 200 µL of PBS back to the well to wash the surface. Repeat this 3x to complete the washing.\nIncubate 200 µL of 50 µg/mL avidin protein in the well for 30 min at 4 °C. Wash it 3x with PBS. After this step, the avidin protein binds to the BSA-biotin and becomes immobilized on the glass surface.\nIncubate 200 µL of 0.1 µM ITS in the well for 30 min at 4 °C. Wash the dish with 3x with PBS. Leave PBS in the well until the cell plating. After this step, the ITS with the biotin tag binds to the avidin protein and becomes immobilized on the surface.",
    "NOTE: One precaution critical for ITS coating quality and homogeneity during the ITS immobilization is to never let the Petri dish surface dry up. Keeping all reagents and PBS at 4 °C or around 0 °C on ice with an ice bucket helps to reduce the water evaporation rate during the washing steps, when PBS is drawn out from the well.\n3. Cell plating onto ITS surfaces\nCulture fish keratocytes.\n\tNOTE: Here, goldfish (Carassius auratus) is used as an example, but other fish species may also work.\n\t\nPluck a piece of fish scale from a fish with a flat-tip tweezer. Gently press the scale onto the well of a glass-bottomed Petri dish, with the inner side of the scale contacting the glass. Wait for ~30 s for the fish scale to adhere well to the glass surface of the dish.\nAdd 1 mL of Iscove’s modified Dulbecco’s medium (IMDM) complete medium to fully cover the fish scale. Keep the Petri dish in a dark and humid box for 6–48 h at room temperature.\n\t\tNOTE: IMDM complete medium contains 79% IMDM + 20% fetal bovine serum (FBS) + 1% penicillin. No extra supply of oxygen or CO2 is needed. A few tissue paper rolls soaked with water can be left in the box to maintain high humidity in the box. Fish keratocytes will migrate out of the fish scale as a sheet of cells after a few hours. This can be observed with a tissue culture microscope. The cells are generally viable at 48 h.\nDetach and plate the keratocytes cells on ITS surfaces.\n\t\nRemove the medium from the Petri dish in which the fish scale was cultured. Wash the well 1x with cell detaching solution, and add detaching solution to cover the fish scale and incubate for 3 min.",
    "NOTE: The recipe for the cell detaching EDTA solution is as follows: 100 mL of 10x Hanks' Balanced Salt Solution (HBSS) + 10 mL of 1 M HEPES (pH 7.6) + 10 mL of 7.5% sodium bicarbonate + 2.4 mL of 500 mM EDTA +1 L of H2O. The pH is adjusted to 7.4.\nSuck out all cell detaching solution and add IMDM complete medium. Disperse the keratocytes by gentle pipetting. Adjust the cell solution density to the desired level (1 x 104–1 x 105/mL). Plate the cells on the ITS surface (prepared according to section 2). Incubate the cells at room temperature for 30 min before imaging.\n\t\tNOTE: Cell counting can be done with a hemocytometer after detaching the cells with detaching solution. The cell plating density is relatively low so that the keratocytes have plenty of surface area to migrate.\nPlate CHO-K1 cells and NIH 3T3 cells on ITS surfaces.\n\tNOTE: The medium for CHO-K1 cells is 89% Ham’s F12 + 10% FBS + 1% penicillin. The medium for NIH 3T3 cells is 89% Dulbecco’s modified Eagle’s medium (DMEM) + 10% calf bovine serum (CBS) + 1% penicillin. The culture conditions are 37 °C and 5% CO2.\n\t\nCulture CHO-K1 cells or NIH 3T3 cells to 80%–100% confluence in a Petri dish (or culture flask).\nWarm the cell detaching solution and culture medium to 37 °C.\nRemove all culture medium in the Petri dish with a pipette. Wash the cells 1x with cell detaching solution. Cover the cells with detaching solution and incubate it at 37 °C for 10 min.\nDisperse the cells by pipetting. Collect the cell solution and centrifuge it at 300 x g for 3 min.\nSuck out the supernatant and add complete medium or serum-free medium.",
    "Adjust the cell solution density to the desired level (1 x 105 – 1 x 106/mL). Plate the cells on the ITS surfaces (prepared according to section 2). Incubate the cells at 37 °C for 1–2 h before imaging, or 30 min before video recording.\n4. Imaging, video recording, and real-time integrin tension mapping\nQuasi-real-time imaging of integrin tension in live cells\nIncubate keratocytes on ITS surfaces (prepared according to section 2) for 30 min at room temperature, or incubate CHO-K1 cells or NIH 3T3 cells for 1 h on ITS surfaces in an incubator at 37 °C.\nMount the Petri dish on a fluorescence microscope stage. Perform cellular force imaging with an exposure time of 1 s. The magnification is 40x or 100x.\nTake a video of ITS images with a frame interval of 20 s for keratocytes, or 1–2 min for CHO-K1 cells or NIH 3T3 cells.\nUse MATLAB or another image analysis tool to subtract a previous frame of the ITS video from a current frame to compute the ITS signal newly produced in the latest frame interval. The newly produced ITS signal represents the integrin tension generated in the latest frame interval, thereby reporting the cellular force in a quasi-real-time manner.\nCoimaging of integrin tension and cellular structure in immunostained cells\nAfter step 3.2.2 or step 3.3.6, perform immunostaining to mark the target structural proteins.\n\t\tNOTE: Use different dyes to avoid the fluorescence crosstalk between integrin tension imaging and cell structural imaging. In this manuscript, Cy5 fluorophore was used for phalloidin and Alexa 488 was used for vinculin staining. The concentration of both primary and secondary antibody is 2.5 µg/mL. The concentration for phalloidin is 1.5 units/µL.\nPerform multifluorescent channel imaging to acquire both an integrin tension map and cell structural imaging.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}