{
  "id": 18981,
  "origin_website": "Jove",
  "title": "In vitro Organoid Culture of Primary Mouse Colon Tumors",
  "procedures": [
    "1. Colon Tumor Isolation and Cell Dissociation\nIntestinal tumors can be isolated from any sporadic or treatment-induced colon cancer model. The mice should be euthanized with CO2. Colons are then collected, flushed with cold phosphate-buffered saline (PBS) and opened longitudinally. Identify regions containing tumors using a stereomicroscope, dissect out with a pair of scissors, and wash with cold PBS.\nIncubate intestinal fragments containing tumors in EDTA chelation buffer (2 mM EDTA, 5.6 mmol/L Na2HPO4, 8.0 mmol/L KH2PO4, 96.2 mmol/L NaCl, 1.6 mmol/L KCl, 43.4 mmol/L sucrose, 54.9 mmol/L D-sorbitol, 0.5 mmol/L DL-dithiothreitol in distilled water) for 60 min on ice.\nAfter chelation, most of the normal intestinal epithelial cells will be detached, while tumor cells will remain attached to the mesenchyme. Aspirate off the chelation buffer containing normal epithelial cells and wash the remnant tumor fragments one more time with 5 ml cold chelation buffer.\nAspirate off the chelation buffer, wash tumor fragments with 5 ml cold 1x PBS.\nAspirate off the 1x PBS, incubate tumor fragments in digestion buffer (2.5% fetal bovine serum, 1 unit/ml of penicillin, 1 μg/ml of streptomycin, and 2.5 ng/ml of amphotericin B, 200 U/ml type IV collagenase, 125 μg/ml type II dispase in Dulbecco's Modified Eagle Medium) for 2 hr at 37 °C.\nAllow the tumor fragment to settle under normal gravity for 1 min, and collect the supernatant in a 15 ml falcon tube. Pellet the single cell tumor suspension supernatant by centrifuging at 200 x g for 3 min and wash once with 5 ml PBS by centrifuging at 200 x g for 3 min.\n2. Culture of Intestinal Tumor\nResuspend the tumor cell pellet with 500 μl PBS, count isolated single tumor cells using a hemocytometer.",
    "Pellet tumor cells by centrifuging at 200 x g for 3 min, and resuspend them in 5 mg/ml Matrigel on ice and plate in 24-well plates at 15,000 cells per 50 μl of Matrigel per well.\nLet the Matrigel polymerize for 15 min at 37 °C, and add 500 μl/well basal culture medium (1 unit/ml of penicillin, 1 μg/ml of streptomycin, and 2.5 ng/ml of amphotericin B, 10 mmol/L HEPES, 2mM Glutamax, 1x N2 supplement, 1x B27 supplement, 1 mmol/L N-acetylcysteine in Advanced Dulbecco's Modified Eagle Medium/F12) containing 50 ng/ml murine EGF.\n3. Maintenance of Established Organoids\nChange basal culture medium containing EGF every 2 days and passage organoids 1:5 once a week.\nFor passaging, replace the culture medium with fresh basal culture medium. Mechanically disrupt organoids and Matrigel using a P1000 pipette with tips cut off and transfer into a 15 ml falcon tube. Further mechanical dissociation is achieved using a fire polished Pasteur pipette.\nWash dissociated organoids with 5 ml of basal culture medium and centrifuge at 200 x g for 2 min.\nDiscard the supernatant, resuspend the pellet with Matrigel and add culture medium as described above.\n4. Storage and Recovery of Established Organoids\nFor long-term storage, freeze organoids in liquid N2 which are stable for at least 2 years. For freezing organoids, disrupt using a P1000 pipette with tips cut off and transfer into a 15 ml falcon tube.\nWash dissociated organoids with 5 ml of basal culture medium and centrifuge at 200 x g for 2 min.\nDiscard the supernatant, resuspend the pellet with Dulbecco's Modified Eagle Medium (DMEM) containing 20% fetal bovine serum (FBS) and 10% dimethyl sulfoxide (DMSO).",
    "Transfer cells into 1.5 ml cryotubes, then put the tubes in a Nalgene Mr. Frosty freezing container and store in an -80 °C freezer to achieve a cooling rate of -1 °C/min. After overnight incubation, transfer tubes into liquid N2.\nFor recovery, the frozen organoids are rapidly thawed in a 37 °C water-bath, wash with basal culture medium, spin down, resuspend in Matrigel and culture with conditions described above.\n5. RNA Extraction, Protein Extraction and Immunohistochemistry\nRNA Extraction: Cells are collected as described above for passage. RNA is isolated with PicoPureTM RNA Isolation Kit according to manufacturer's instructions.\nProtein Extraction: Cell pellets are collected as described above and lysed in 100 μl radioimmunoprecipitation assay buffer (RIPA; 50 mmol/L Tris-HCl pH 7.5, 150 mmol/L NaCl, 2 mmol/L EDTA, 1% NP-40, 0.1% SDS) with 1x protease inhibitor.\nImmunohistochemistry: Aspirate off cell culture medium, transfer tumor organoids with P1000 pipette with tips cut off into Cryo-mold and freeze immediately in tissue freezing medium (O.C.T.) with dry ice. Frozen sections were cut at 7 μm and stained as described previously 26.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}