{
  "id": 3272,
  "origin_website": "Cell",
  "title": "Protocol for profiling in vitro intratumor heterogeneity using spatially annotated single-cell sequencing",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nImaging and photolabeling\nTiming: 2 h\nThis section describes how to photolabel three concentric rings in the circular patch of epithelial cells. The same protocol can be used to label the outer layers of this patch, or researchers can customize the photopatterning script to label any region of interest. ROIs can be selected based on bright-field or nuclear stain fluorescence images.\nNote: The photoactivatable dyes used here are cell permeable and retained in the cytoplasm for several hours. The rationale of the photolabeling approach is that we first incubate cells with one photoactivatable dye, after which the cells in the outer population are photoactivated and labeled with a single color. When we subsequently incubate cells with the second photoactivatable dye, the first dye is still present in the cytoplasm of the cells. Therefore, when the middle population is illuminated, both dyes are photoactivated and these cells are labeled with both dyes.\nAspirate culture media from the glass-bottom dish and wash cells with 250 μL phenol-red free culture media.\nPipette 200 μL 40 μM PA-JF646 solution on the glass area of the dish. Ensure that the patch of cells is fully immersed in the solution.\nIncubate the cells for 20 min at 37°C.\nAspirate the PA-JF646 solution, wash cells with 250 μL phenol-red free culture media and add 250 μL phenol-red free culture media to the glass area of the dish.\nPlace the dish on the microscope stage and obtain a brightfield image of the patch of cells.\nCritical: It is essential to properly fix the position of the dish using stage clips, as any movement of the sample between the imaging and photolabeling steps will yield inaccurate results.",
    "Using the photopatterning code, obtain a mask for the DMD to selectively illuminate the outer ring of the patch.\nLoad the mask on the DMD and phototag the outer ring with a 450 nm laser for 150 s (∼100 J/cm2).\nAspirate media and pipette 200 μL 40 μM PA-JF549 solution on the glass area of the dish. Ensure that the patch of cells is fully immersed in the solution.\nIncubate the cells for 20 min at 37°C.\nAspirate the PA-JF549 solution, wash cells with 250 μL phenol-red free culture media and add 250 μL phenol-red free media to the glass area of the dish.\nPlace the dish on the microscope stage and obtain a brightfield image of the patch of cells.\nUsing the photopatterning code, obtain a mask for the DMD to selectively illuminate the middle ring of the patch.\nLoad the mask on the DMD and phototag the middle ring with a 450 nm laser for 150 s (∼100 J/cm2).\nObtain fluorescence images by exciting cells at approximately 549 nm and 646 nm (for PA-JF549 and PA-JF646, respectively) to assess the accuracy and efficiency of the photolabeling process (troubleshooting 2[href=https://www.wicell.org#sec7.3]).\nOptional: To assess the effect of the photolabeling process on the viability of cells, prepare an extra glass-bottom dish of cells and illuminate the cells with a 405 nm laser with the same laser intensity and exposure time that is used in a specific experimental set-up. Continue with the optional steps from the cell isolation section.\nPause point: If one is labeling and isolating cells from multiple glass-bottom dishes, photolabeled dishes can be stored in a tissue culture incubator until all dishes are labeled and ready for sorting.\nCell isolation\nTiming: 2 h",
    "This section describes the process to isolate photolabeled cells and prepare them for scRNAseq. FACS sorting is used to separate the patch of cells in three populations: unlabeled cells (the center of the patch), cells labeled with only PA-JF646 (the outer ring) and cells labeled with both PA-JF549 and PA-JF646 (the middle ring).\nCritical: Keeping cells in HBSS for prolonged periods of time affects cell viability. If one is sorting multiple dishes in a single run, we recommend limiting the time that cells are suspended in HBSS by trypsinizing the next dish only when one is almost done with sorting the previous dish.\nAspirate media and wash cells with 2 mL DPBS.\nPipette 250 μL Trypsin-EDTA without phenol red on the glass area of the dish (where cells were seeded).\nIncubate until the cells are detached (∼20–30 min) at 37°C.\nCritical: From here on, use low retention pipette tips and tubes for handling the cells.\nDissociate the cells by carefully pipetting up and down and transfer cells to a 1.5 mL tube.\nRinse the glass area of the dish with 200 μL trypsin-EDTA without phenol red and transfer to the same tube.\nRinse the glass area of the dish with 200 μL HBSS with calcium and magnesium chloride (pH 7.0) and transfer to the same tube.\nGently pipette cell suspension up and down to further dissociate the cells.\nCentrifuge cells for 4 min at 4000 × g.\nNote: The resulting pellet might be small and hard to see. Marking the outside of the tube before centrifuging helps to localize the pellet more easily.\nAspirate supernatant and thoroughly resuspend cells in 400 μL HBSS to obtain a single cell suspension. Directly place on ice.\nFACS sort the cells according to the machine’s user manual (Figure 2[href=https://www.wicell.org#fig2]; troubleshooting 3[href=https://www.wicell.org#sec7.5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2864-Fig2.jpg",
    "Figure 2. FACS gating strategy\n(A) Positive control (live cells) for DRAQ-7 live/dead staining.\n(B) Negative control (dead cells) for DRAQ-7 live/dead staining.\n(C) DRAQ-7 live/dead staining indicates that illuminating cells for 120 s with near-UV light does not alter cell viability.\n(D) Gating strategy to identify live, single cells.\n(E) Gating strategy to identify center, middle and outer populations (gated on live, single cells).\nSort live, single cells into the 384-well plates containing CEL-seq2 primers, RNA spike-ins and dinucleotide triphosphates (dNTPs) that are supplied by sequencing companies (i.e., Single Cell Discoveries in our study) or core facilities. Briefly centrifuge each plate before carefully removing the aluminum cover.\nSeal the plate with a new aluminum foil.\nCentrifuge for 1 min at 1000 × g to ensure cells are at the bottom of the wells and immediately place 384-well plates on dry ice.\nPlates can be stored for up to 3 months at −80°C until shipment to the sequencing company or facility.\nCritical: For each well, write down to which population the isolated cell belongs. This information is essential for the analysis of scRNAseq data. For most FACS machines, this sorting report can be downloaded after the sort is complete.\nNote: We outlined the FACS gating strategy in Figure 2[href=https://www.wicell.org#fig2]. From the population of live, single cells, we identify cells that are negative for PA-J646, which originate from the center population. From the population of cells that are positive for PA-JF646, we identify cells that are positive for PA-JF549 (the middle population) or negative for PA-JF549 (the outer population).",
    "Note: The number of cells sorted into each population depends on the experimental setup. For our experiments, we sorted each dish of cells into one 384-well plate (i.e., approximately 120–150 cells per population). For statistical analysis, we recommend having approximately equal numbers of cells in the different populations.\nOptional: If assessing the effect of the photolabeling process on cell viability, first follow steps 15–22 and then continue with the steps outlined below:\nResuspend cells in 620 μL ice-cold HBSS buffer and add 3.1 μL 0.3 mM Draq7 viability dye.\nGently pipette to mix and incubate for 5 min at 37°C, while preventing exposure to light.\nFACS sort according to the user manual, live cells should be negative for Draq7 fluorescence (Figure 2[href=https://www.wicell.org#fig2]C).\nSingle cell sequencing\nTiming: 1–3 weeks (depending on the facility used)\nThis section describes how to profile the isolated cells using single cell RNA sequencing.\nFor library preparation and scRNAseq, our laboratory uses the SORT-seq platform25[href=https://www.wicell.org#bib25] offered by Single Cell Discoveries (Utrecht, The Netherlands). This sequencing approach is based on the Cel-seq2 technology.26[href=https://www.wicell.org#bib26] We sequenced our cDNA libraries at 150,000 reads/cell on the Illumina NextSeq 500 platform. In principle, researchers could use any plate-based scRNAseq technology that offers sufficiently high read depth."
  ],
  "subjectAreas": [
    "Rnaseq",
    "Microscopy",
    "Bioinformatics",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Bioinformatics & Computational Biology"
  ]
}