{
  "id": 6639,
  "origin_website": "Bio",
  "title": "Quantification of HIV-2 DNA in Whole Blood",
  "procedures": [
    "Main steps of preparation of HIV-2 qPCR: Extract DNA from PM1 cells as outlined below Steps A1 and A2.Prepare PBDG, cellular controls as indicated in Procedure B “Preparation of PBDG standard” by using extracted DNA of PM1 cells.Extract viral RNA -from HIV-2 isolate- to prepare HIV-2 standards, as mentioned in Procedure B “Preparation of HIV-2 standard”.Extract viral DNA from whole blood as indicated in Step A3.Set up HIV-2 qPCR as outlined below Procedure C.DNA extractionCollect 5 x 106 PM1 cells (Lusso et al., 1995) in 1.5 ml Eppendorf tubes and centrifuge for 5 min at 200 x g. Discard supernatant and wash pellets twice in 1 ml of sterile PBS. Store dried pellet at -20 °C until DNA extraction.Notes: PM1 cell line is a modified CD4+ T-cell clone, which expresses co-receptors such as CCR5 and CXCR4 (Lusso et al., 1995). Maintain PM1 cells in complete RPMI-1640 (Invitrogen) (see Recipes) until passage number 3, after defreezing. Count cells by using Automated Cell Counter. U1s are subclones of U937 chronically HIV-1 infected cells (Folks et al., 1987). These cells are carrying integrated HIV-1 in their genome, thus extracted DNA can be used as a negative control, and to detect the specificity. For negative control, collect 5 x 106 U1 cells (Folks et al., 1987) as the same way as it is mentioned above for PM1 cells. And count cells by using Automated Cell Counter. To extract cellular DNA of PM1 cells use Qiagen QIAamp DNA Mini Kit according to the manufacturer’s instructions. A single elution of 50 μl buffer AE is used.Notes: DNA extractions should be performed in a cell biology-grade clean hood equipped with separate air-handling mechanisms or under a DNA-free hood. Add extra centrifugation step before elution to decrease the EtOH contamination: 20,000 x g for 1 min.",
    "For elution use prewarmed Buffer AE (56 °C) and incubate it for 2 min at room temperature. For negative control, extract DNA from collected U1 cells (Folks et al., 1987) by using Qiagen QIAamp DNA Mini Kit according to the manufacturer’s instructions, then elute in 50 μl buffer AE. Extract viral DNA from 200 μl of whole blood in the presence of 5 μg carrier RNA using Qiagen QIAamp Blood DNA Mini Kit according to the manufacturer’s instruction. Load DNA to spin column and elute in 50 μl elution buffer.Notes DNA extractions should be performed in a biosafety cabinet. Whole Blood sample should be collected in EDTA tubes and stored at -70 °C until DNA extraction. To reduce degradation of DNA, avoid freezing/thawing of the whole blood samples. Extraction should be performed by using low-binding Eppendorf tubes. Store DNA extracts at -20 °C for up to a few weeks.Preparation of StandardsPreparation of HIV-2 standard Prepare the HIV-2 standard by extracting RNA from 1.44 x 1011 RNA-copies/ml of electron microscopy counted HIV-2 particles using Qiagen miRNeasy micro Kit according to the manufacturer’s instructions with minor modifications.Notes:  HIV-2 control stock solution has a concentration of 7.2 x 1010 viral particles/ml. As two RNA genomes are packed in each viral particle the final stock contains: 1.44 x 1011 RNA-copies/ml = 1.44 x 108 copies/μl (7.2 x 1010multiply with two). Extract a sample (HIV-2) with 5 μl from the stock + 95 μl PBS. Extracted RNA should be eluted in 30 μl. In this case, the concentration of sample is 2.4 x 107 copies/μl ((1.44 x 108 x 5)/30). Use 10-fold dilution series to reach 5,000 copies/μl RNA concentration. By using miRNeasy micro Kit purification gives a better yield and allows elution in smaller volume.",
    "To increase the yield of extracted RNA: increase the amount or qiazol reagent from 700 μl to 1000 μl. Double incubation time (10 min instead of 5 min). Use 200 μl of chloroform instead of 140 μl during extraction. To improve the yield of extraction add 5 μl carrier RNA (1 μg/ μl) before and after transferring the aqueous phase. Wash it twice by using 350 μl RWT buffer and between washing steps add DNase to decrease the amount of DNA contamination. Elute RNA in 30 μl of RNase-free water. Perform cDNA synthesis directly after RNA extraction by using SuperScript III One-Step RT-PCR System and Platinum Taq DNA polymerase. Prepare cDNA synthesis in 25 μl reaction volume containing 2x reverse transcription buffer (0.4 mM of each dNTP, 3.2 mM MgSO4), 1 μl of eluted total RNA, 100 ng forward and reverse primers, SuperScriptTM III One-Step RT-PCR System with PlatinumTM Taq DNA Polymerase and RNase/DNase–free sterile water up to the final volume (see Table 2).Table 2. Preparation of cDNA synthesis by reverse transcription and first round nested PCRimgsrc:https://en-cdn.bio-protocol.org/attached/image/20191015/20191015210838_5975.jpgQuantify the HIV-2 gag fragment of RT-PCR (850 base pairs) using the following program: initial cDNA synthesis for 30 min at 50 °C, followed by amplification: initial denaturation for 2 min at 94 °C, 35 cycles of 15 s at 94 °C, 30 s at 50 °C, 45 s at 68 °C and a final elongation step for 5 min at 68 °C.Note: By using primer pair BEN_740F and BEN_1640R plus strand of HIV-2 gag can be amplified. The estimated size of the amplified fragment is 850 base pairs. Visualize PCR products on 1% agarose gels stained with Gel Red, run at 110 V for 45 min in 1x TAE buffer.",
    "Purify PCR Product by using QIAquick PCR purification Kit according to the manufacturer’s instruction. Load DNA to spin column and elute in 50 μl sterile water. Quantify the concentration of PCR product by using NanoDrop ND-1000 spectrophotometer and visualize it on 1% agarose gel with the same running conditions (see Figure 1).Purified HIV-2 gag should be stored at -20 °C until needed.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191015/20191015210926_6624.jpgFigure 1. Detection of cleaned PCR product of HIV-2 gag PCR. An example of successful of PCR purification is visualized on 1% Agarose gel stained with Gel red. L = 1 KB DNA ladder, 1 and 2 = HIV-2 PCR products, with the estimated size of 850 bp.Preparation of PBDG standard Perform host gene standard (PBDG fragment) amplification in two steps (outer followed by nested PCR). Prepare outer PCR in 25 μl solution containing: 10 ng eluted DNA of PM1 cells, Dream Taq DNA polymerase, 5 mM dNTP mix and 100 ng/μl primers (PBGD-CF1 and PBGD-CR2) (see Table 3). Visualize PCR product on 1% agarose gel stained with Gel Red, run at 110 V for 45 min in 1x TAE buffer.Reaction of nested PCR solution should contain: 1 μl of outer PCR product, Dream Taq DNA polymerase, 5 mM dNTP mix and 100 ng/μl primers (PBGD-CF1 and PBGD-CR1). Detect PCR product on 1% agarose gel stained with Gel Red at the same conditions as aforementioned.Table 3. Host gene performed by 2-step PCRimgsrc:https://en-cdn.bio-protocol.org/attached/image/20191015/20191015211012_4962.jpgOuter and Nested PCR cycling parameters: an initial denaturation 2 min at 94 °C followed by 35 cycles of 30 s at 94 °C, 30 s at 55 °C, 45 s at 72 °C and a final elongation step for 5 min at 72 °C.Purify PCR product by using QIAquick PCR purification Kit according to the manufacturer’s instruction.",
    "Load DNA to spin column, elute in 50 μl sterile water and quantify the concentration of PCR product by using NanoDrop ND-1000 spectrophotometer and detect the product on 1% agarose gel with the same running conditions as mentioned before.Notes: For RNA elution use RNase/ DNase/ proteinase free water. cDNA synthesis and One-Step PCR reactions are conducted in 0.2 ml, MicroAmpTM Optical 8-Tubes. Stock and dilutions must be kept on ice after thawing and mixing, and frozen at -20 °C when not in use. Pipette mix or flick mix samples and dilutions, do not vortex to mix. RNA extractions, dilution of RNA and DNA, PCR setups must be done in the amplicon-free room and should be performed using filtered pipette tips. Modified PCR protocol of Damond et al. (2002) is used for HIV-2 qPCR. qPCR for HIV-2 DNA detectionMain steps of the qPCR (see Figure 2 for an example of experiment layout): 1) Prepare Real-Time PCR reaction of HIV-2 from extracted DNA of infected and uninfected individuals and with sterile water instead of DNA, as mentioned in Steps C1, C2 and C3. 2) Prepare PCR reaction for HIV-2 standard from HIV-2 gag fragment corresponding to 106 to 1 DNA copies as mentioned in Step C5. 3) Prepare Real-Time PCR reaction of PBDG from extracted DNA of infected and uninfected individuals and with sterile water instead of DNA as mentioned in Step C6. 4) Prepare PCR reaction for PBDG standard from purified housekeeping gene fragment corresponding to 106 to 100 DNA copies as mentioned in Step C7. 5) All reactions need to be performed using a 96-well plate. 6) Carry out qPCR reaction in the conditions mentioned in Step C10. 7) Calculate the concentration of samples by using the formula in Step C11.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191015/20191015211107_9730.jpgFigure 2. Example of the experimental layout.",
    "Blue colors indicate the qPCR of HIV-2 gag, while yellow colors stand for Real-Time PCR of PBDG gene. Standard curves are generated from eight (for HIV-2) (106 to 1 copies) and from five dilutions (for PBDG) (106 to 100 copies) dilutions. Each sample and control are prepared in duplicates on a 96-well qPCR plate. DNA of U1 cells stands for negative and specificity controls (as these cells are carrying an integrated HIV-1 genome, but no HIV-2 genome).Prepare the following Real-Time PCR reactions for HIV-2 in 30 μl solution (quantities per sample) containing 15 μl Thermo Fisher Maxima probe qPCR Master Mix, 4 μM of Taqman Probe, 100 ng/μl of each primer and 8 μl of template DNA.Notes: Sequences of primers and probe were obtained from Damond et al. (2002) (PMID:12354861).  Extract sample DNA from 200 μl of whole blood as mentioned in Step A3. To improve the yield of extraction use carrier RNA during viral DNA extraction. Since carrier RNA was used in the extraction, it is not possible to quantify the DNA reliably since spectrophotometric quantification will detect both RNA and DNA in the solution. As a negative control, add 8 μl of sterile water instead of DNA.Set up the same reaction by using DNA from uninfected individuals to ensure that the primers are specific for viral DNA detection.Note: Extract DNA from 200 μl of whole blood of uninfected individuals in the same way as it was performed for infected samples (see Step A3). Also, prepare the reaction in the presence of 1 μg PM-1 cell’s DNA to exclude whether or not human DNA contamination has an effect on the sensitivity of real-time PCR.",
    "For quantification, use a series of ten-fold dilutions of the HIV-2 gag fragment corresponding to 106 to 1 DNA copies of the standard, and include it in each experiment in order to generate an external standard curve. Each sample and standard should be quantified in duplicate (see Figures 3 and 4).Note: The most critical step of HIV-2 qPCR is the preparation of standards. Prepare the dilutions by using 1.5 ml low-binding Eppendorf tubes. Mix every tube by pipetting up and down, then centrifuge it before preparing the next dilution.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191015/20191015211143_6815.jpgFigure 3. The serial dilution scheme for HIV-2 standard. Prepare serial dilution in 1.5 ml Eppendorf tubes by pipetting 5 μl from 109 ‘stock’ to 108 copies/μl tube and add 45 μl water. Pipette up and down to mix and shortly centrifuge it. Using a new tip, pipette 5 μl from tube 108 to tube 107. Pipette up and down to mix and centrifuge it for a few seconds. Repeat the same process for the other tubes. Yellow highlighted shows dilutions used to perform HIV-2 standard curve.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191015/20191015211230_3374.jpgFigure 4. Standard curve of HIV-2 gag fragment. A. Sensitivity test for TaqMan Probe for gene of interest. Amplification plot showed the testing results of the tenfold dilution series of host gene (106, 105, 104, 103, 100, 10 and 1 DNA copies per reaction in duplicate). B. The linear regression analysis between the quantities of host gene (106, 105, 104, 103, 100, 10 and 1 DNA copies per reaction in duplicate) and Ct values. Regression equations were calculated with y = -3.305 + 38.692, R2 = 0.999. The red box represents Ct values.Normalize HIV-2 DNA to expression of the housekeeping human gene, PBGD. Prepare the following reaction: 12.",
    "5 μl Thermo Fisher Maxima probe qPCR Master Mix, 50 ng/μl primers, 2 μM of probe and 3 μl of template DNA.Notes:  Primer and probe sequences of PBGD gene were obtained from Mbisa et al. (2009) (PMID 19020818). Use extracted DNA of uninfected and infected individuals as a template DNA. For preparation of DNA, see Step A3. For each run, a standard curve should be generated from purified PBDG fragment ranging from 106 to 100 DNA copies (see Figure 5).Notes:  Prepare the same reaction for PBDG standard as mentioned in Step C6.  Similar to HIV-2 standard preparation, dilutions of PBDG should be performed by using 1.5 ml low-binding tubes. Mixing by pipetting up and down, then centrifugation is necessary before every step of dilution. Distribute the reaction mix in the wells of the 96-well qPCR plate and avoid air bubbles. An example of a plate layout is provided in Figure 2.Cover the qPCR plate with an adhesive plastic film, centrifuge it briefly.Carry out qPCR with an initial denaturation step at 95 °C for 10 min, followed by 40 cycles of denaturation at 95 °C for 15 s, annealing at 60 °C for 30 s and final extension at 72 °C for 30 s.HIV-2 DNA concentrations should be first reported as HIV-2 DNA copies/μl obtained from the qPCR reaction. The numbers of copies of HIV-2 DNA are then normalized to the host gene. The final results are reported as the number of copies/105 cells. The formula to convert the results is: (HIV-2 DNA copies per μl)/(PBDG copies per μl/2 chromosomes per cell) x 105 cells = HIV-2 DNA copies per 105 cells.Note: Perform quantitative real-time PCR (qPCR) by using the Applied Biosystems StepOnePlus Real-Time PCR System.",
    "Extracted DNA from U1 cells, HIV negative and HIV-1 infected individuals can be used as controls.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191015/20191015211337_3669.jpgFigure 5. Standard curve for PBDG (host gene). A. Sensitivity test for TaqMan Probe for PBDG host gene. Amplification plot showed the testing results of the tenfold dilution series of host gene (106, 105, 104, 103 and 100 DNA copies per reaction in duplicate). B. The linear regression analysis between the quantities of host gene (106, 105, 104, 103 and 100 DNA copies per reaction in duplicate) and Ct values. Regression equations were calculated with y = -3.483 + 39.893, R2 = 0.999. The red box represents Ct values."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}