{
  "id": 3555,
  "origin_website": "Cell",
  "title": "Protocol for in vitro establishment of heterogeneous stem-like cultures derived from whole human glioblastoma tumors",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nUA processing into GSC spheroid cultures (neurospheres)\nTiming: 4 h\nStarting from UA resuspension, whose reliability as a GSC source was previously shown,15[href=https://www.wicell.org#bib15],16[href=https://www.wicell.org#bib16] the described method allows to obtain parallel cultures enriched in glioma stem cells (GSCs) preserving GBM heterogeneity by the use of different cocktails and concentration of GFs (Figure 2[href=https://www.wicell.org#fig2]). If required, additional combinations can be assessed with the same methodology.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3124-Fig2.jpg\nFigure 2. Overview of UA processing into multiple GSC cultures\nSchematic showing key passages of GBM UA processing into single cell resuspension and preparation of multiple cell cultures with different selection media (single or GF cocktails).\nFor biobanking, at the end of the described procedure part of cancer cell resuspension has to be collected (i) for histology, (ii) as vital frozen material, and (iii) for DNA and RNA extraction (see below, Figure 2[href=https://www.wicell.org#fig2]).\nAliquot UA in the appropriate number of conical tubes (40 mL/tube), collecting the entire resuspension. See troubleshooting 1[href=https://www.wicell.org#troubleshooting], 2[href=https://www.wicell.org#troubleshooting].\nCentrifuge for 10 min at 270 g, RT (+22°C–25°C).\nDiscard supernatant by vacuum aspiration.\nNote: pellets may look different in distinct conical tubes, owing to uneven UA resuspension distribution. The best pellets are those containing considerable amount of tumor fragments in the intermediate ring (up to 10–15 mL mark) (Figure 3[href=https://www.wicell.org#fig3]); ideally, 4 of such pellets are sufficient for the derivation process and for biobanking, thus the others can be discarded.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3124-Fig3.jpg\nFigure 3. UA resuspension\nConical tube containing UA resuspension, tumor fragments and lysed blood cell bodies after centrifugation and before enzymatic and mechanical dissociation.\nCritical: if tumor fragments are to be collected also for histology, from this point one additional pellet is processed as described in step-by-step method details[href=https://www.wicell.org#step-by-step-method-details], step 58.\nWash pellets with 25 mL/tube PBS 1X.",
    "Centrifuge for 10 min at 270 g, RT (+22°C–25°C).\nDiscard supernatant by vacuum aspiration.\nAdd 25 mL/tube ACK solution for blood red cell lysis.\nVigorously flip the tube 10‒15 times or resuspend by pipetting with a 25 mL disposable pipette.\nIncubate for 10–15 min at RT (+22°C–25°C) in the dark.\nCentrifuge for 10 min at 270 g, RT (+22°C–25°C).\nDiscard supernatant by vacuum aspiration.\nNote: if blood red cells are still detectable (as a residual red coloration of supernatant), ACK treatment can be repeated once.\nWash pellets with 15 mL/tube PBS 1X.\nCentrifuge for 10 min at 270 g, RT (+22°C–25°C).\nDiscard supernatant by vacuum aspiration.\nPull together up to 4 pellets. Adding 5 mL PBS 1X to the first tube and sequentially transferring resuspension in the other tubes can be helpful.\nTransfer pellets in 10 cm cell culture petri dishes. It is recommended to transfer 20 mL/dish.\nAdd 1 mL collagenase type I to 20 mL of total pellet to favor tumor tissue dissociation.\nIncubate for 20 min at 37°C.\nAdd 3 mL PBS 1X to the dish.\nIn the dish, mechanically disrupt tissue fragments by 10–15 up and down pipetting with a sterile 5 mL pipette, then with an 18 G needle in a 1 mL syringe till the tumor resuspension turns velvety.\nNote: mechanical disruption should proceed smoothly; if difficult, dishes can be incubated at +37°C for additional 10 min to prolong collagenase activity; however, long incubation can result in reduced cell viability.\nCollect tumor resuspension with a syringe and filter it through a sterile 100 μm cell strainer, collecting the eluate in a 50 mL conical tube. See troubleshooting 3[href=https://www.wicell.org#troubleshooting].\nNote: in the case of high tumor resuspension density, it’s suggested to further dilute with PBS 1X in order to facilitate the filtration step.",
    "Repeat the above step, passing tumor suspension through a sterile 70 μm cell strainer.\nTo recover as many cells as possible, wash dish and strainers once with 5 mL PBS 1X. At this point the resuspension should mostly contain single, dissociated cells, together with abundant debris, as you can appreciate under the microscope.\nCentrifuge for 10 min at 270 g, RT (+22°C–25°C).\nDiscard supernatant by vacuum aspiration.\nNote: if blood red cells lysis is incomplete (evident as a residual red coloration of supernatant), ACK treatment can be repeated once as describe above.\nPool together and resuspend cell pellets by adding the appropriate volume of GSC Medium; around 1 mL (final volume) of cell resuspension is required for each cell culture condition planned (e.g., for testing conditions depicted in Figure 2[href=https://www.wicell.org#fig2], resuspend the pellet in 8 mL). See troubleshooting 2[href=https://www.wicell.org#troubleshooting].\nNote: for biobanking and nucleic acid collection (both highly recommended) cell pellets have to be resuspended in additional 0.5–1 mL of medium for each sample to be collected (e.g. 8 mL for cell culture + 3–4 mL for vital frozen cells + 1–2 mL to be aliquoted for DNA and RNA extraction, see below, step-by-step method details[href=https://www.wicell.org#step-by-step-method-details], step 59). Moreover, additional 1 mL of medium has to be used for estimating the amount of starting viable tumor cells (see below, step-by-step method details[href=https://www.wicell.org#step-by-step-method-details], steps 39‒55). Pellet resuspension in a final volume up to 15 mL usually does not result in excessive cell dilution as to affect GSC derivation.\nTransfer the cell resuspension in dedicated 75 cm2 flasks, each containing 10–15 mL of GSC standard medium without GFs (1 mL/flask; for testing conditions depicted in Figure 2[href=https://www.wicell.org#fig2], 8 mL are dispensed in 8 flasks).\nTransfer flasks in the incubator at 37°C, 5% CO2 and 20% O2 concentration for 24 h.",
    "After 24 h, collect each flask suspension in a dedicated 15 mL conical tube (e.g., for testing conditions depicted in Figure 2[href=https://www.wicell.org#fig2], 8 different conical tubes are required).\nCentrifuge for 10 min at 120 g, RT (+22°C–25°C).\nDiscard supernatant by vacuum aspiration.\nResuspend each pellet with 10 mL of GSC standard medium with the desired concentration and combination of GFs.\nTransfer cell resuspension in 75 cm2 flasks and maintain in the incubator at 37°C in 5% CO2 and 20% O2 concentration.\nPause point: the protocol can be paused at this point if the user opts for freezing cell resuspension as vital material (see below, step-by-step method details[href=https://www.wicell.org#step-by-step-method-details], step 56).\nDerivation, growth and propagation of GSC spheroid cultures (neurospheres)\nTiming: on average 6–10 weeks\nIn this step, cells are kept in culture and monitored for the emergence of established neurospheres, which are then propagated by passaging. Forming neurospheres (Figure 4[href=https://www.wicell.org#fig4]) are grown by medium addition or replacement. When neurospheres reach around 100 μm diameter or when the spheroid’ core appears dark (indicating the presence of dying cells), and when their amount increase significantly, neurospheres should be passaged by dissociation and splitting in separate flasks, maintaining the same GF cocktail.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3124-Fig4.jpg\nFigure 4. Neurosphere formation\nRepresentative images of progressive neurosphere formation after cell seeding in selective media. Scale bar: 25 μm.\nNote: during the first weeks, cultures contain not only tumor cells but also tumor-associated immune cells and normal nervous tissue cells that will be negatively selected by culture conditions. Thus, it is recommended to monitor cell cultures daily by microscopic observation and to change medium when it turns milky or dying cells are noticed.",
    "Once culture is free of non-tumor cells, the medium must be added or replaced at least once every 3–5 days depending on the acidification rate (shift in DMEM/F12 pH indicator) (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3124-Fig5.jpg\nFigure 5. GSC selection and growth\nSchematic procedure for medium addition and renewal in flasks containing forming GSC spheroids (neurospheres).\nNote: formation of GSC floating spheroids (neurospheres), i.e. cell colonies derived from proliferation of a single GSC, is observed at variable times after cell culture start. If neurospheres do not reach passage 1 after 6 months, the culture is likely devoid of propagation potential and can be considered extinguished. Success rate, spheroid-formation timing, culture doubling time etc. depend on intrinsic GSC biological and genetic features (variable among different tumors) and extrinsic selective pressures (different GFs added to standard medium), and are therefore mostly unpredictable. Assiduous cell culture monitoring by microscopy is recommended.\nFor the addition of medium in growing neurospheres (Figure 5[href=https://www.wicell.org#fig5]):\nStand flasks upright in the sterile biological safety cabinet for 5 min as to allow forming spheroids to deposit at the flask bottom.\nCollect 3/10 mL of exhausted medium from the top by the use of a sterile 5 mL pipette.\nAdd 3 mL of freshly prepared GSC Medium with GFs (at 3X concentration) avoiding pipetting.\nTransfer again flasks in the incubator at 37°C, 5% CO2 and 20% O2 concentration.\nFor renewal of medium in growing neurospheres (Figure 5[href=https://www.wicell.org#fig5]). See troubleshooting 4[href=https://www.wicell.org#troubleshooting]:\nCollect cell resuspensions in 15 mL conical tubes (one tube/flask).\nCentrifuge for 10 min at 120 g, RT (+22°C–25°C).\nDiscard supernatant by vacuum aspiration (it is suggested to leave around 0.5 mL of medium to avoid disturbing pellet).\nCarefully resuspend pellet in 10 mL of fresh GSC Medium with GFs. Carefully avoid repetitive and harsh pipetting to preserve integrity of forming spheroids.",
    "Transfer flasks in the incubator at 37°C, 5% CO2 and 20% O2 concentration.\nCritical: remember that GFs are stable at 37°C for no more than 2 weeks, thus it is absolutely required to change culture medium at least once every 10–15 days to maintain the applied selective pressure. On the other hand, avoid too frequent changes as to minimize manipulation of forming spheroids.\nFor neurosphere dissociation without passaging (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3124-Fig6.jpg\nFigure 6. GSC propagation\nSchematic procedure for neurosphere dissociation and splitting.\nCollect medium containing cells in 15 mL conical tubes (one tube/flask).\nCentrifuge for 10 min at 120 g, RT (+22°C–25°C).\nDiscard supernatant by vacuum aspiration (it is suggested to leave around 0.2 mL of medium to avoid disturbing pellet).\nMechanically disrupt spheroids by vigorous up and down pipetting for 100 times using a p200 pipette. Assess by eye the presence of residual spheroids and, in case, pipette for additional 50‒100 times.\nOptional: in case enzymatic methods are required for dissociating neurospheres, add 0.1 mL of Trypsin (or collagenase type I) v/v with PBS 1X (or pure in case of sticky spheroids), incubate 5 min at RT (+22°C–25°C) (or at 37°C in case of sticky spheroids), and mechanically disrupt spheroids by vigorous up and down pipetting for 100 times using a p200 pipette. Once dissociated, immediately wash with 5 mL PBS 1X, centrifuge for 10 min at 120 g and discard supernatant by vacuum aspiration. See troubleshooting 5[href=https://www.wicell.org#troubleshooting].\nResuspend pellet in 10 mL of fresh GSC Medium with GFs.\nTransfer flasks in the incubator at 37°C, 5% CO2 and 20% O2 concentration.\nCritical: As stated above, each culture displays different and unpredictable spheroid-formation times, so that careful evaluation of each culture is needed. Under passaging or over passaging spheroids increases cell death and slows down the proliferation rate.",
    "For neurosphere passaging (Figure 6[href=https://www.wicell.org#fig6]).\nDissociate neurospheres as above.\nPerform cell counts (if possible also monitoring cell viability by using trypan blue or other vital staining). See troubleshooting 6[href=https://www.wicell.org#troubleshooting], 7[href=https://www.wicell.org#troubleshooting].\nDispense 4–8 × 105 dissociated vital cells in 10 mL of fresh GSC standard medium with GFs.\nTrack the number of passages (every 1:2 or higher split has to be considered as a +1 passage).\nTransfer flasks in the incubator at 37°C, 5% CO2 and 20% O2 concentration.\nCritical: it is suggested to freeze stocks at early passages as described below (see step-by-step method details[href=https://www.wicell.org#step-by-step-method-details], step 56); once formed, it is recommended to freeze non-dissociated spheroids by applying the same protocol. This will increase viability after thawing.\nNote: periodical testing for mycoplasma contamination (see key resources table[href=https://www.wicell.org#key-resources-table] for suggested Mycoplasma detection kit) and cell identity is strictly recommended.\nAssessment of the percentage of viable tumor cells in UA\nTiming: 90 min\nFor further correlation analysis and for normalizing variant allele frequencies (VAF), gene copy number and transcriptomic data obtained in UA, it is recommended to estimate the percentage of viable tumor cells in freshly processed cell resuspensions by flow cytometry. CD56 (neural cell adhesion molecule 1, NCAM1) is suggested to identify tumor cells of neural or neuroendocrine origin,1[href=https://www.wicell.org#bib1],17[href=https://www.wicell.org#bib17] while CD45 (protein tyrosine phosphatase receptor type C, PTPRC) is required to exclude blood derived leukocytes. GBM cells are thus identified as the CD56pos/CD45neg subpopulation (Figure 7[href=https://www.wicell.org#fig7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3124-Fig7.jpg\nFigure 7. GBM cell quantification by flow cytometry\n(A) Sample preparation for flow-cytometry evaluation of the CD56posCD45neg subpopulation (corresponding to GBM cells) in whole UA cell resuspension.\n(B) Gate logic builder for flow cytometric analysis.\nTransfer 1 mL of processed cell resuspension from step-by-step method details[href=https://www.wicell.org#step-by-step-method-details], step 26 in a 15 mL conical tube (to avoid pellet dispersion 50 mL tubes are not recommended).",
    "Add 9 mL of PBS 1X to the cell resuspension.\nEstimate total cell number by the use of an automated cell counter. See troubleshooting 6[href=https://www.wicell.org#troubleshooting].\nCentrifuge for 5 min at 150 g, RT (+22°C–25°C).\nDiscard supernatant by vacuum aspiration.\nResuspend the pellet at the optimal concentration of 2×106 cells/mL in PBS 1X with 1% BSA, in order to avoid non-specific antibody binding through Fc receptors.\nTransfer 0.5 mL/tube of resuspended cells in four 5 mL polystyrene FACS tubes as follows (Figure 7[href=https://www.wicell.org#fig7]A). See troubleshooting 8[href=https://www.wicell.org#troubleshooting]:\n1 NEGATIVE CONTROL TUBE with unstained cells (no antibody will be added).\nNote: This tube is essential to (i) set voltages of the photomultiplier tube (PMT), or the gains of avalanche photodiodes (APDs); (ii) distinguish negative cells from electronic noise, allowing stained positive cells to be visualized; (iii) determine the level of autofluorescence; (iv) appropriately set negative gates.\n1 COMPENSATION TUBE for single CD45 stained cells.\n1 COMPENSATION TUBE for single CD56 stained cells.\nNote: These tubes are essential to reveal the spillover level of the fluorophore into the other detectors. Thus, a compensation matrix has to be applied to correct this effect and ensure that only specific signals are used.\n1 SAMPLE TUBE with both CD45 and CD56 antibodies.\nAdd CD45 and/or CD56 antibodies to the tubes. Suggested titration for CD45 PE-CF594 and CD56 PE-Cy7 (see key resources table[href=https://www.wicell.org#key-resources-table] for details) is 1:20 (e.g., 25 μL of each antibody in 500 μL of PBS 1X-1% BSA and 106 cells).\nVortex tubes and incubate 20 min RT (+22°C–25°C), on a rocking platform, in the dark (required to avoid antibody bleaching).\nAdd 2 mL/tube of PBS 1X.\nCentrifuge for 5 min at 150 g, RT (+22°C–25°C).\nNote: steps 48‒49 are essential to minimize non-specific detection due to excess of antibodies.\nDiscard supernatant by decanting.",
    "Resuspend all pellets in 300 μL of DAPI 0.2X solution for staining viable population (DAPIneg).\nFilter samples in Falcon Round-Bottom Polystyrene Test Tubes with Cell Strainer Snap Cap, 5 mL (or alternatively by CellTrics 50 μm).\nNote: Assistance by an expert flow cytometrist may be required in the following steps.\nImmediately acquire samples by flow cytometry (using a Beckman Coulter CytoFLEX Flow Cytometer, collection of data is performed with the Beckman Coulter software CytExpert 2.4).\nCritical: a prolonged interval between filtering and flow cytometry can cause cell aggregation and hamper analysis.\nApply the following gate logic builder (Figure 7[href=https://www.wicell.org#fig7]B):\nSet the first gate on the physical parameters Forward Scatter (FSC)/Side Scatter (SSC) to exclude debris;\nWithin this population, exclude doublets and aggregates by evaluating the Pulse Width on a physical parameter (FSC or SSC);\nSelect the viable population, which has not incorporated DAPI (DAPIneg);\nCombination of these three gates defines the healthy single cells where CD45/CD56 expression should be analyzed;\nAnalyze data by Beckman Coulter Kaluza Flow Analysis Software 1.3 or equivalent.\nNote: CD45neg/CD56pos/DAPIneg cells are bona fide viable GBM cells; CD45pos/CD56neg identifies leukocytes and CD45pos/CD56pos cells identify Natural Killer (NK) cells (Figure 7[href=https://www.wicell.org#fig7]B).\nGSC spheroid cultures freezing for further derivation\nTiming: 15 min (for alternative freezing or thawing)\nAt the end of derivation protocol, a part of tumor cells resuspended in GSC Medium in step 26 (see step-by-step method details[href=https://www.wicell.org#step-by-step-method-details]) can be frozen in vital condition for further culture derivation; in that case, frozen materials have to be carefully thawed for preserving cell viability (Figure 8[href=https://www.wicell.org#fig8]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3124-Fig8.jpg\nFigure 8. Neurosphere biobanking\nSchematic procedure for vital cell freezing and thawing for further culture derivation.\nFor cell freezing (Figure 8[href=https://www.wicell.org#fig8]).\nAliquot 0.8 mL of tumor cell resuspension in 3–4 cryogenic vials.\nAdd 0.1 mL of additional BSA.",
    "Add 0.1 mL of dimethyl sulfoxide (DMSO) to each cryogenic vial.\nPlace vials on wet ice for no more than 5 min.\nTransfer cryogenic vials in an insulated box placed at ‒80°C freezer to ensure slow freezing of cells.\nAfter 24–48 h, transfer vials to liquid nitrogen storage.\nFor cell thawing (Figure 8[href=https://www.wicell.org#fig8]).\nRapidly thaw frozen cells in a 37°C water bath.\nDilute cells slowly in pre-warmed GSC Medium without GFs.\nCentrifuge for 10 min at 120 g, RT (+22°C–25°C).\nGently resuspend pellet in a 75 cm2 flask containing 10–15 mL of pre-warmed GSC Medium without GFs.\nTransfer flasks in the incubator at 37°C, 5% CO2 and 20% O2 concentration for 24 h.\nCollect medium containing cells in 15 mL conical tubes.\nCentrifuge for 10 min at 120 g, RT (+22°C–25°C).\nResuspend pellet as to obtain 1 mL of cell resuspension for each desired culture.\nTransfer in 75 cm2 flasks containing different concentration and combinations of GFs and maintain in the incubator at 37°C in monitored CO2 and 20% O2 concentration.\nFor the first weeks, follow the same procedure described for fresh material (see above, step-by-step method details[href=https://www.wicell.org#step-by-step-method-details], steps 34‒38).\nNote: frozen cells generally display lower derivation rate than freshly isolated cells; it is strongly recommended to derive cultures immediately after processing and to preserve part of the tumor resuspension for additional derivation procedure.\nBiobanking of related samples for further genetic and molecular analysis\nTiming: 1 h (day 1), 1 h (day 2). 24 h incubation required.\nFor biobanking (strongly recommended) part of the processed tumor resuspension is collected for histology (Figure 9[href=https://www.wicell.org#fig9]) and DNA and RNA extraction (Figure 10[href=https://www.wicell.org#fig10]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3124-Fig9.jpg\nFigure 9. Biobanking of starting material: UA resuspension\nSchematic procedure of FFPE sample preparation starting from UA resuspension. FFPE: formalin-fixed paraffin-embedded.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3124-Fig10.jpg",
    "Figure 10. Biobanking of starting material: DNA and RNA\nSchematic procedure for DNA and RNA sample collection from UA resuspension.\nFor inclusion of tumor fragments for histological analysis (FFPE tissues, Figure 9[href=https://www.wicell.org#fig9]), one of the pellet obtained after the first UA centrifugation (see above, step-by-step method details[href=https://www.wicell.org#step-by-step-method-details], steps 1‒3) is processed as follow:\nAdd 10 mL of fixative (formalin or other fixative of choice).\nIncubate for 15 min, pelleting cells by gravity.\nCritical: it is recommended to avoid centrifugation to better preserve tissue histology.\nDiscard supernatant via sterile pipette.\nRepeat twice till fixative and pellet are clean from blood.\nAdd 10 mL of fixative.\nIncubate for 16–24 h at +4°C.\nDiscard supernatant by decanting.\nWith the help of sterile forceps, collect and gently put fixed tumor fragments into a bio- cassette with foam pads.\nProcess fixed tumor fragments as the other histological samples.\nFor tumor DNA and RNA extraction (Figure 10[href=https://www.wicell.org#fig10]).\nAliquot 0.5 mL of tumor resuspension in 4/5 1.5 mL RNase-free Eppendorf tubes for DNA and RNA extraction (multiple small aliquots are suggested to prevent excessive freeze-thaw cycles).\nCentrifuge for 5 min at 900 g, RT (+22°C–25°C).\nDiscard supernatant by vacuum aspiration.\nStore pellets at ‒80°C or proceed to gDNA and total RNA extraction according to kit manufacturer’s instructions (for gDNA extraction, https://ita.promega.com/-/media/files/resources/protocols/technical-manuals/101/reliaprep-gdna-tissue-miniprep-system-protocol.pdf?rev=4a90105b1f5648c8b647907de054ccfa&la=en[href=https://ita.promega.com/-/media/files/resources/protocols/technical-manuals/101/reliaprep-gdna-tissue-miniprep-system-protocol.pdf?rev=4a90105b1f5648c8b647907de054ccfa&la=en]; for RNA extraction, https://ita.promega.com/-/media/files/resources/protocols/technical-manuals/101/maxwell-rsc-mirna-tissue-kit-protocol.pdf?rev=da4435cb40424d489e500cb9748386e6&sc_lang=en[href=https://ita.promega.com/-/media/files/resources/protocols/technical-manuals/101/maxwell-rsc-mirna-tissue-kit-protocol.pdf?rev=da4435cb40424d489e500cb9748386e6&sc_lang=en]).\nNote: Nucleic acid preservatives can be used at this stage following manufacturer instruction.\nFor normal DNA from PBMC extraction (Figure 11[href=https://www.wicell.org#fig11]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3124-Fig11.jpg\nFigure 11. Biobanking of starting material: PBMCs\nSchematic procedure for PBMC DNA collection starting from peripheral blood sampling. PBMC: peripheral blood mononuclear cells.\nTransfer blood in a 50 mL conical tube.\nAdd 40 mL ACK solution for blood red cell lysis.\nVigorously flip the tube 10‒15 times or resuspend by pipetting with a 25 mL disposable pipette.",
    "Incubate for 15 min at RT (+22°C–25°C) in the dark.\nCentrifuge for 5 min at 750 g, RT (+22°C–25°C).\nDiscard supernatant by vacuum aspiration.\nResuspend pellet in the appropriate volume of PBS 1X (starting from 5 mL of peripheral blood use 3 mL of PBS).\nAliquot in appropriate number of Eppendorf tubes (1 mL/Eppendorf).\nCentrifuge for 5 min at 900 g, RT (+22°C–25°C).\nDiscard supernatant by vacuum aspiration.\nStore pellets at ‒80°C or proceed to PBMC gDNA extraction according to DNA kit manufacturer’s instructions (for PBMC gDNA extraction, https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2Fpurelink_genomic_mini_man.pdf[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2Fpurelink_genomic_mini_man.pdf]).\nNote: Nucleic acid preservatives can be used at this stage following manufacturer instruction."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Cell Isolation",
    "Flow Cytometry",
    "Cancer",
    "Cell Culture"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology"
  ]
}