{
  "id": 5139,
  "origin_website": "Bio",
  "title": "c-Fos and Arc Immunohistochemistry on Rat Cerebellum",
  "procedures": [
    "Perfusion   To prepare solution, please refer to recipes. Let the solution flow by gravity (e.g. hanging bottles on top of the fume hood). About 250 ml/ rat is required.   Prepare all equipment needed (scissors, forceps, clippers to hold hands/feet…etc). Note: Better to work close to the water tab (for rinsing out the coagulated blood during perfusion).   Anesthetize the animal (overdosed with pentobarbital, 0.5 ml-1 ml/rat depending on weight) at least 30 min after behavioral treatment (this time allows protein synthesis).   Pinch the toes to check the animal is fully asleep.   Locate the sternum and poke into it using a scissor.   Cut the chest cavity in V shape above the liver.   Hold the sternum with a clip, and flip over the head to open the rib cage. *(optional) pinching the aorta behind the liver will help blood circulation into the brain. After pinching the aorta, let the forelimbs/hindlimbs relax (if clamped).   Insert a cannula connected to the solution bottle into the apex of the heart near the left ventricle. Hold the cannula so that it is slightly pointing towards the right atrium.   Start the saline flow.   Immediately, cut (~0.3 cm) the right atrium.   Rinse as necessary to remove the coagulated blood. You can try scraping out the debris using a forcep.   Once the solution turns transparent (no more red blood cells), let the PFA flow (if you need immediate fixation, fix with PFA. No need to wait for the solution turning transparent).   Leave until the solution is used up (could be longer than 20 min depending on the flow rate, weight…etc). If you see solution drops coming out of nostrils, it is a good sign.   Extract the brain out of the skull carefully.   Prepare a vial (tube) for each brain filled with cryoprotectant (solution 6).",
    "Store until the brain sinks to the bottom. Replacing the solution every day or so is recommended.   For longer storage, embed in the OCT compound and store at -80 °C until use. Note: If you choose to cut the coronal sections using cryostat:  Cut the tissue at 30 μm (could be in the range of 25-50 μm). Free-floating method: collect the sections in 24 well. Store in PBS (pH 7.4, 0.1 M) under 4 °C. Work immediately, if possible. Otherwise, store in cryoprotectant (solution 6) under -20 °C.      Immunohistochemistry (IHC, Free-floating method) Note: If sections are mounted onto a slide immediately after cut, about 0.3 ml working solution is needed per slide. This method will help you save some antibodies. The disadvantage is that antibody may not be penetrating the tissue as effectively as in free-floating method. Also, slides might be easily dried out. For free-floating method, ~0.5 ml is required per well. For 30 μM-thick sections, about 7-8 sections can undergo identical treatment within a well. Use a dropper with a very thin tip to drain out solutions. Make sure the sections are not damaged during washing/solution change.   Start with washing in PBS (3 times, 5 min each).   Block the tissue with normal donkey serum containing 0.25% Triton-100. 1 h at room temperature (RT).   Prepare primary antibody in the blocking solution.  *Vortex briefly for diluting an antibody. Primary antibody incubation carried out over night at 4 °C. Wrapping the well with parafilm will prevent dehydration. For immediate results, one could incubate at RT for ~2-3 h. Overnight incubation is recommended for sufficient antibody incubation.   Take the well out of refrigerator and let it sit at RT for ~1 h.   Wash with PBS (3 times, 5 min each).   Secondary antibody incubation under RT 1-2 h.",
    "Following incubation, wash with PB (NOT PBS!) for 3 times, 5 min each.   Mount the sections carefully onto slides. Air dry while covered on top (with tinfoil, or any type of lid that prevents light).   Apply a drop of Vectashield (Vector laboratory) before coverslipping.   For storage, keep at -80 °C."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}