{
  "id": 7105,
  "origin_website": "Bio",
  "title": "Using <sup>14</sup>C-acetate Pulse-chase Labeling to Study Fatty Acid and Glycerolipid Metabolism in Plant Leaves",
  "procedures": [
    "Radioactive labeling (pulse)Pour 10 ml labeling medium into a Petri dish. Cut the fully expanded rosette leaves and use cork borer (~8 mm diameter, or smaller, depending on the size of the source leaves) to prepare leaf disks. Float 40-50 leaf disks with the abaxial side down on the labeling medium in Petri dishes.Place the Petri dishes on a rotator (50 rpm/s), add 0.1 mCi of 14C-acetate to the labeling medium to start the labeling at room temperature (22-25 °C) under a light intensity of 80 µmol m-2 s-1.After 1 h of incubation with the radiotracer (pulse), remove the labeling medium and add 15 ml ddH2O to the Petri dish to wash the leaf disks on the rotator for 3-4 times, 5 min each. Note: The labeling medium with 14C-acetate can be reused, if desired. We recommend freezing promptly at  -20 °C, with appropriate labels and storage for isotopes, if it is to be reused. Weigh a 1.5 ml Eppendorf safe-lock microcentrifuge tube. Transfer leaf disks (6-8 disks per sample) to clear filter paper and blot them dry. Transfer the leaf disks in the weighted Eppendorf tube and weigh it again. Calculate the fresh weight (FW) of the leaf disks. The remaining leaf disks are incubated in the labeling medium without isotope under the same conditions as described for the pulse and then used for the chase (Procedure B).Extract lipids from 1 h-pulsed leaf disks:Add lipid extraction buffer with a pipette (700 μl per 100 mg FW) to the Eppendorf tubes with leaf disks mentioned above, and mix by vortexing for 30 min.Add 1 M KCl buffer (0.5 volume of extraction buffer) to the extract, vortex and centrifuge at 12,000 × g at room temperature for 1 min. Lipids stay in the lower chloroform phase.",
    "Transfer the chloroform phase to a new Eppendorf tube and store it at -20 °C for further use.ChaseHarvest leaf disks at different time points (we use 1 day, 2 day, 3 day) and extract lipids as described before.Liquid scintillation countingAliquot 10 μl lipid extract to 0.5 ml Eppendorf tubes, dry them in the fume hood. Add 20 μl hexane to dissolve the lipids, then add 200 μl scintillation liquid and mix by vortexing.Radioactivity associated with total lipids was determined by liquid scintillation counting using a Tri-carb (Perkin-Elmer).Thin layer chromatography (TLC) and phosphor imagingPreparation of TLC plates: submerge a 20 cm × 20 cm Silica Gel 60 (Merck) TLC plate into 0.15 M (NH4)2SO4 solution for 30 s, air dry the plate for at least 2 days.On the day of experiments, bake the TLC plates in an oven at 120 °C for 3 h.Draw a straight line (1 cm from the edge of the plate) across the plate using a pencil. Slowly spot 60-80 μl of lipid extract on the line using a 100 μl pipette under a slow stream of N2 in a fume hood. Keep the lipid spots smaller than 1 cm in diameter.Polar lipids separationWhen the lipid spots completely dried in the fume hood, add 50 ml of the developing solvent 1 into a sealable TLC developing tank and put the TLC plate into the tank with the sample end facing down. Seal the tank and let the solvent ascend to half of the plate.Take out the plate, completely dry it in the fume hood. Pure out the developing solvent 1 from the tank, and let the tank completely dry in the fume hood.",
    "Neutral lipids separationPour 50 ml of the developing solvent 2 into the tank, place the TLC plate back into the tank with the sample end facing down.When the developing solvent 2 front has reached 1 cm from the top of the plate, take out the plate and dry completely in the fume hood.Note: Here we use two-phase TLC to separate polar lipids and neutral lipids. However, polar lipids and neutral lipids can be separated by two individual TLC plates using the developing solvent 1 and the developing solvent 2, respectively. Phosphor imagingWrap the TLC plate with Saran wrap. Place it in the autoradiography cassette with the silica side upward, cover it with phosphor screen and close the cassette.Place the cassette in -80 °C freezer for 1-2 days before taking out the phosphor screen for phosphor imaging captured by a Typhoon FLA 7000 imager (GE Healthcare).Quantify the relative radioactivity associated with individual bands by the ImageQuant software."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}