{
  "id": 18620,
  "origin_website": "Jove",
  "title": "\n\nStep By Step: Microsurgical training method combining two nonliving animal models",
  "procedures": [
    "1. Preparation:\nObtain a tabletop stereo microscope, with a variable 3,5 x to 45x zoom, 200 mm working distance, 55 to 75 mm variable inter-pupillary distance and an accessory led ring light. Any similar microscope is adequate, it can be set up on a small table and is not extremely expensive.\nGather and prepare a set of microsurgical instruments with two microsurgical pickups, one dissecting scissor, and one needle-driver; this is the minimum required, it must be taken into account that these are practice instruments, and high end quality instruments are not needed.\nUse 9/0 monofilament micro-suture for all the practices. Buy commercially available chicken thighs or wings and food colorant at the local supermarket.\nA 20 G angio-catheter is used for the patency tests on the chicken femoral arteries. For the Brachial arteries a thinner 27 G catheter is needed. These can be acquired over the internet at a local Pharmacy or with the instruments set. Buy a commercially available syringe to inject the food colorant.\n2. Macroscopic dissection techniques:\nThe approach to the femoral vessels is straightforward. For chicken thighs, perform a blunt dissection technique just medial to the femoral shaft, separate the femoral muscle from the bone and expose the femoral artery, vein and nerve. The nerve can be further dissected into two separate fascicles for different types of nerve repair practices.\nIn order to access the chicken Brachial artery in the chicken wings, incise the skin longitudinally with a scissor, from the shoulder up to the tip of the wing. Observe the artery running between the biceps and triceps brachii.\n3. Recommended training regimen:\nTraining with the femoral artery.\n\tNOTE: The first step in the training regimen is to practice with the chicken femoral artery.",
    "Place the piece under the microscope and start the microsurgical dissection. Free the femoral artery from the underlying tissues; and divide it horizontally. Perform an adventicectomy. Use the micro-pickups and micro-scissors to trim any adventicia overlying the arterial lumen. Rinse the inner lumen with regular tap water. Write down the starting time\nPerform an end to end anastomosis.\n\t\nStart on the back wall of the artery on the side opposite to the operator. Place the first stitch; start on the left side if working horizontally, on the lower side if working vertically. Pass the needle from the outside of the artery towards the lumen and then from the lumen to the outside of the artery.\nTie the stitch, perform a double knot first, and then two single throws alternating directions. Complete the whole back wall with the above described technique.\nStarting on the right hand side if you are working horizontally or the upper side if you are working vertically, place a single stitch from the outside to the lumen and then from the lumen to the outside. Tie the knot as described above. Complete the front wall repeating the procedure described in 3.1.2.2.\nWrite down the final time this will allow you to keep a time record, so you can control your progression.",
    "NOTE: The authors prefer a one way up technique; but any type of microsurgical suture can be rehearsed. It is recommendable that the trainee completes around 25 microsurgical anastomoses in this manner before he can try other clinical scenarios. These include vein grafting for arterial gaps, end to end nerve repairs, and the use of vein conduits for the treatment of nerve gaps. An important technique in microvascular surgery, that can be learned with this training method is the continuous or running suture, to perform this technique the trainee proceeds as 3.1.2.1 but the stich is not cut, continue to perform stitches as in 3.1.2.1 without cutting them until you complete the whole suture and tie it to the original stitch at the end.\nTraining with the Brachial artery\n\t\nPlace the piece under the microscope. Complete the procedure as described above for the femoral artery.\n\t\tNOTE: The only difference is the size. The Brachial artery is much smaller than the femoral artery and the anastomosis is considerably more challenging.\nPatency tests\n\t\nCross a smooth 20 or 27 G angio-catheter through the anastomosis, to check for obstructions caused by stitches suturing both vessel walls together.\nApply a syringe with commercial food colorant to the end of the angio-catheter, and perfuse dye into the artery to test for jet leakage\nOpen the artery longitudinally to visualize the stitches, their parallelism and the amount of wall taken.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}