{
  "id": 19325,
  "origin_website": "Jove",
  "title": "Neurotoxicity Assessment in Adult Danio rerio using a Battery of Behavioral Tests in a Single Tank",
  "procedures": [
    "Strict compliance with ethical standards guarantees the welfare and proper treatment of the zebrafish used for experimentation. All experimental procedures were carried out under the guidelines established by the Institutional Animal Care and Use Committees (CID-CSIC). The protocols and results presented below were performed under the license granted by the local government (agreement number 11336).\n1. Animal housing for behavioral testing\nPerform all tests (presented in Figure 1) in an isolated behavioral room at 27-28 °C between 10:00 and 17:00.\nWash both control and exposed fish several times in clean fish water [reverse-osmosis purified water containing 90 mg/L aquarium systems salt, 0.58 mM CaSO4·2H2O, and 0.59 mM NaHCO3] before starting the experiments to avoid any potential contamination of the experimental tank.\nAcclimate animals to the behavior room 1 h before starting the experiments.\nEnsure that the animals (≈50:50 male: female ratio) are experimentally naïve and perform all behavioral testing in a blind manner with observers unaware of the experimental group.\nTo obtain meaningful results in behavioral assays, have a total number of 18 subjects per condition (n = 18), ideally obtained between two or more independent experiments. For example, in individual tests, analyze the behavior of 9 animals per condition, per replicate. In group tests, analyze the behavior of a shoal of 6 to 9 animals per condition, per replicate.\nCarry out all tests following a battery test approach (see planning proposals in Figure 2). Ethically more suitable, this method allows to reduce the number of animals needed for the study, complying with the 3R reduction principle7.",
    "Most of the time, behavioral assays are connected to biological assays, so sacrifice the animals following euthanasia guidelines18 before collecting and analyzing samples (OMICs or chemicals). If the endpoint does not prove to be sampling, re-stable the control group at the end of the experiment. Reuse the control animals for breeding or experimental purposes after a few days.\nimgsrc://cloudfront.jove.com/files/ftp_upload/65869/65869fig01.jpg\nFigure 1: Experimental setups. Three configurations of the square tank to study a wide range of behaviors in adult zebrafish. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65869/65869fig01large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/65869/65869fig02.jpg\nFigure 2: Experimental timeline. Two planning proposals for the recording of behavioral assays. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65869/65869fig02large.jpg]\n2. Experimental configurations of the tank\nAnxiety-like behavior: The Novel Tank Test (NTT)\n\t\nAdjust the experimental setup (number of tanks, cameras, and computers) to record the maximum number of fish simultaneously. Individual behavior assays are time-consuming, so optimize time, material, and space.\nPrepare the experimental tanks for NTT: Square tank (20 cm length, 20 cm width, 25 cm height) covered with acrylic panels on lateral walls and bottom to avoid reflection and interference between subjects.\nFill the experimental tanks with 7 L (water column height: 20 cm height) of well-oxygenated fish water at 28 °C.\nAdjust the position of the tank in front of the camera to avoid distorted image.\nCheck the illumination setup. LED backlight (10000 lux) provide a homogenate illumination on all part of the tank for video recording in good conditions.\nTurn on the cameras and adjust them following section 3.\nIntroduce the subjects, one by one, into the bottom of the experimental tanks before starting to record as quickly as possible.\n\t\tNOTE: It is important to start recording with the animal at the bottom of the tank.",
    "Take care not to disturb the animals during recording. Use of a curtain or panel to limit visual interaction not only between tanks but also between the support and the outside.\nAt the end of the recording (standard recording time is 6 min), transfer the animals that have already passed through the test to another tank so as not to mix them with the naïve animals.\nRepeat the procedure with all available subjects. It is advisable to have a total number of 18 subjects per condition to obtain meaningful results in individual trials (from two or more independent replicates).\nRandomize the experimental group assigned to each tank between trials to avoid any potential tank effects (if you are recording several conditions at the same time).\nSocial grouped behavior: The Shoaling Test (ST)\n\t\nThe experimental configuration of ST is the same as that of NTT (the same tanks can be reused directly).\nFollow the steps 2.1.1-2.1.6. to set up the ST.\nIntroduce the shoal (6 to 9 subjects at the same time) at the bottom of the experimental tanks before starting to record as quickly as possible.\n\t\tNOTE: It is important to start recording with the animal at the bottom of the tank.\nFollow the steps 2.1.8-2.1.11. to perform the ST.\nRepeat the procedure with all available subjects. To obtain meaningful results in this assay, make at least two independent replicates with the same bank size in each replicate.\nMaintain the size of the shoal consistent for all the experimental groups and replicates inside the same experiment.\nSocial individual behavior: The Social Preference Test (SPT) \n\t\nAdjust the experimental setup to optimize the experimental space and time of recording.",
    "Prepare the experimental tanks for SPT: Square tank (20 cm length, 20 cm width, 25 cm height) transparent (glass or plastic) to offer lateral visibility. The single focal fish is free to interact with a conspecific virtual zone - a fish's shoal placed into the one-sided external housing tank, or with the unspecific virtual zone - a one-sided external empty housing tank.\nFill the experimental tanks with 5 L (water column height: 15 cm, same height as the water column in the extern housing tanks) of clean fish water at 28 °C.\nAdjust the position of the tank in front of the camera to avoid distorted image.\nCheck that the system receives homogeneous lighting.\nIntroduce the subjects, one by one, into the bottom of the experimental tanks before immediately starting recording with the animal down in the center.\nAvoid visual interactions between observers and animals during recording.\nAt the end of the 6 min recording, transfer the present animals to another tank so as not to mix them with the naïve animals.\nRepeat the procedure with all available subjects. Have a total number of 18 subjects per condition to obtain meaningful results in individual trials (from two or more independent replicates).\n3. Video recording for behavioral tests\nOpen the camera manager to check the availability of the GigE camera on each computer.\nLaunch the GigE camera controlling software (such as uEye Cockpit, described here). Open the Camera option, select Monochrome mode, and adjust the image size (1:2).\nOpen Camera Properties\nUnder Camera, set the Pixel Clock to Maximum, set the Frame Rate to 30 frames per second (fps), and adjust the Exposure (Auto or Manual adjust if the image is too dark).",
    "Under Image, set the Gain to 0 (Auto) and the Black Levels (Auto or Manual adjust to obtain a good contrast).\nUnder Size, adjust the size of the window to the region that needs to be engraved (Width: Width-Left, Height: Height-Top). This step allows to reduce the size of the image and, therefore, the final size of the video.\nClose Camera Properties.\nCreate a general folder for the experiment session to save the camera settings and videos.\nTo save the camera settings, set File > Save Parameters > To File and select the experiment folder recently created.\n\tNOTE: The camera settings file can thus be reloaded in the application to continue working with the same image parameters at any time (e.g. when the camera is suddenly switched off or to reuse the same settings, reducing the setup time and homogenizing the experimental conditions). If, in one moment, the camera freezes between videos, stop recording, exit, and turn off the camera. Turn it back on, reload the camera parameters by going to File > Load Parameters > To File, and restart recording. Check if the current video has been completely acquired to discard or repeat the fish (before repeat, give the animals some time to re-acclimatize).\nRepeat this camera setup procedure (steps 3.1-3.5) on all the cameras.\nWhen all the cameras are correctly configured, open Record Video Sequence.\nSelect Create to save as a new video file, select the experiment folder recently created, and report in the name of the video file the information of the subject, type of experiment, and the date.\nSelect Max. Frames. Type 10800 in the frame box. Standard video is recording 6 min (Video 1) at 30 fps in AVI format; therefore, 6 min x 60 s x 30 fps= 10800 frames in total.",
    "Select Calc. Frame Rate or indicate the frame rate manually (velocity of recording: 30 fps).\nRepeat the video file creation procedure on all the computers.\nIntroduce the subjects, one by one, at the bottom of each experimental tanks. All assays will be run at once.\nStart the records quickly by clicking on Record and wait to get the maximum number of requested frames (step 3.10).\nOnce the videos are recorded, a chat box appears with the message Maximal number of frames achieved!. Select Accept.\nSelect Close to finish the recording and close the video file.\nRemove the fish that have just been observed. Be careful to separate them from the naive fish.\nDirectly select Create and repeat the process to continue recording videos.\nOnce all the recordings are done, select Exit.\nTo turn off the cameras, select Close Camera and Exit the program.\n4. Analysis of recorded videos\nLaunch the analysis software (see Table of Materials).\nTo elaborate on a new template, click on New from Template > Applied a Predefined Template > From Video File, and select a video to start setting up the template. Try to choose a representative video of the experiment with a subject exhibiting good mobility and good conditions of recording.\nIn Parameters, configure the parameters in the following windows (1 to 4/7). Select the model Fish > Adult Zebrafish, the arena Open Field Square > One Arena, the number of Subject per Arena (for the ST, a multi tracking package [track various subjects in one arena] is required), the type of Detection by Center-Point and finally adjust the frame rate to 30 fps. In the following windows (5 to 7/7), do not change parameters; default configuration is OK.",
    "Name the experiment as a template and place it in the same folder as the rest of the stored video. The template will be created as an experiment folder with several subdivisions containing all the setup information.\nUnder Experiment Settings, check the defined setup (from video file, arena, number of subjects, frame per seconds). Here, the system units can be modified.\nUnder Arena Settings, right-click on the center of the screen and select Grab. From File in the display. Choose a good quality video image and Accept to capture this image for the background settings. First, Calibrate the image, generating a calibrated rule. Use the width of the tank as a scale (19 cm). Then, draw the arena. Be careful to make the square just enough to avoid the reflections of the animal when the latter approaches the surface or any eventual confusion of the fish software with the black areas of the tank. Finally, draw the shape zones with the Frame function.\n\t\nFor NTT and ST, divide the front of the tank into two equal virtual zones, top, and bottom (see Figure 1). Draw two equal horizontal boxes. Boxes cover half an arena for each one. Name the Top and Bottom for the upper and lower zones, respectively. Be careful that the boxes have the same width (9-10 cm) and length (8-9 cm), do not exceed arena boundaries (orange square), and do not overlap, checking that each arrow zone indicates exactly its zones.",
    "For SPT, divide the experimental arena conceptually into three equal-sized zones: empty, center, and conspecific (see Figure 1). Draw three equal vertical boxes. Name the box oriented to the shoal tank as Conspecific, the box oriented to the empty tank as Empty, and the middle one as Center. Be careful that the boxes have the same width (6 cm) and length (18-19 cm), do not exceed arena limits, and do not overlap.\nUnder Detection Settings, verify which video to be dealt with in the Video File. Then, check detection quality (fish in yellow, red center point). Click on Auto Detect to adjust the detection, refocusing the animal (choose an image that the animal is swimming in profile on the white background, draw the picture by taking its entire body, and validate the detection with Yes). Open Advanced to improve detection by selecting Dynamic Subtraction, Darker Subject, Background Settings, Background Learning, Subject Size, Noise Reduction, etc.\nUnder Trials Settings, put one trial and delete the others (right-click and delete)\nUnder Data Settings, create Results dialog windows. Parameterize Results per time and per zone. For example, create one Results window for data output by minutes and another for data output by total time (6 min). Request the data output for each zone (request it if the distance in each zone is needed). Link the different Results windows to the Start window with arrows.\nUnder Analyze Settings, select the Parameters to analyze and the type of Statistics for each parameter. These parameters will be automatically calculated based on the data acquired from the tracking.\n\t\nFor NTT and SPT, select options as defined below:\n\t\t\nSelect Distance Moved (select Total) to obtain the distance traveled in the arena (cm) and the distance traveled in the respective zones (cm).",
    "Select In Zones (select Zones, Frequency, Cumulative, and Latency to First) to have the time spent in the zones (s) and the latency to first entrance in the zones (s).\nSelect Zone Transition (select Threshold: 0 cm, Add Zone 1 > Zone 2; Zone 2 > Zone 1, in any zones, Frequency) to obtain the number of entrances in the zones.\nSelect Mobility Sate (fill in High mobile above 70%, Immobile below 3%, minimum 150 frames, and select frequency, cumulative, and latency to first) to have the duration of hypermobility (s), the duration of freezing (s).\n\t\t\tNOTE: See the Discussion section for more details about the approximation of freezing behavior using the automated analysis and the number and duration (s) of freezing episodes.\nSelect Acceleration and Turn Angle (select frequency and cumulative) to evaluate the occurrence of complex behaviors such as darting and erratic (fast acceleration movements).\nFor the ST, in addition to the above exploratory parameters, select the option Distance Between Subjects (select all the subjects, mean, maximum, minimum) to get the average distance between fish (cm), the average distance between the nearest neighbor (cm), and the average distance between the farthest neighbor.\nThe template is ready for its use. Save the last modifications and Close the template without acquiring any data from the video (maintain the template file; it is light and easy to manage and copy). If there are several software licenses, analyze the videos from the same template copied to each computer.\nTo copy and use the template, there are two options:\n\t\nOpen the template file with the behavior analysis software, go to File > Save as to create a new identical file.",
    "In the welcome interface, select New from Template > Applied a Custom Template > From Video File (choose template. EthXV file). Name the new experiment and select its location. The software may take a few minutes to copy the information from the template file.\nGo to Arena Settings to re-adjust the template if the video was recorded with a different camera (follow steps 4.6 and 4.7).\nGo to Detection Settings or Acquisition to check which video is selected and change the video file if necessary.\nUnder Acquisition, select DDS > Ready to Start. It may take a few minutes for the software to process the video.\nWhen the acquisition is finished, go to Track Editor. Select acceleration x16 to read the processed video faster and check if the tracking is correct.\n\tNOTE: Sometimes, there may be \"losses\" in the tracking (due to reflections or confusion of the software itself). They can be edited manually from this part if they are few; otherwise, it is preferable to reprocess the whole experiment, improving the definition of the canvas and the detection.\nUnder Statistics, click on Calculate > Export Data. Data exportation is directly located in the experiment folder.\nUnder Track Visualization or Heatmaps, generate and export (right click, export image, select the folder Export Files of the experiment to save this data with the spreadsheet report) tracking images of the animal.\nGo to File to close the active experiment and repeat this procedure for the next video.\n5. Statistical analysis\nAnalyze the normality (Shapiro-Wilk test) of data in each group.\nAssess homoscedasticity with Levene's test.\nUse one-way ANOVA followed by Dunnett's and Tukey's multiple comparison tests to test differences between groups when criteria of normality and homoscedasticity cannot be rejected.",
    "Use the Kruskal-Wallis test followed by a pairwise comparison using the Bonferroni correction to test differences between groups when criteria of normality and homoscedasticity are rejected.\nPlot the data with graphical software.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}