{
  "id": 3979,
  "origin_website": "Cell",
  "title": "Generation of locus-specific degradable tag knock-ins in mouse and human cell lines",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nsgRNA design and cloning into eSpCas9(1.1)-T2A-mCherry expression vector\nTiming: 1–2 weeks\nWe design sgRNAs using the ChopChop tool (http://chopchop.cbu.uib.no/[href=http://chopchop.cbu.uib.no/]) by searching the intended knock-in site, including the upstream and downstream 100 bp nucleotide sequence, and selecting the appropriate genome for off-target scoring. Optimally, one should select a sgRNA that cuts the target sequence within 10–20 bp of the intended integration site and that has the lowest predicted off-target score. If performing a knock-in using nucleofection with preassembled Cas9/gRNA ribonucleoprotein (RNP) complex (see section 17), order a synthetic crRNA from a commercial vendor (e.g., IDT) and omit steps 1–8 and 16 in the protocol.\nsgRNA design\nDesign and order sgRNA oligos as follows:\nForward: 5’ CACC+”20 bp sgRNA sequence” 3’\nReverse: 5’ AAAC+”reverse complement of the 20 bp sgRNA sequence” 3’\nExample for dTAG-KANSL3 knock-in generation:\nForward: CACC+GGAAGTCCCTCTCCCCACCC\nReverse: AAAC+GGGTGGGGAGAGGGACTTCC\nThe selected sgRNA induces cutting in the Kansl3 gene locus 8 bp after the START codon.\nNote: In contrast to WT-SpCas9, eSpCas9(1.1) is sensitive to gRNA-DNA mismatches at the 5’end and it is, therefore, not advisable to add an extra G in front of the sgRNA sequence to ensure efficient transcription from the human U6 promoter (Zhang et al., 2017[href=https://www.wicell.org#bib9]), as is common practice for WT-SpCas9 vectors. The 20 bp sgRNA sequence itself must start with G or A (A/GN19) (Wang et al., 2019[href=https://www.wicell.org#bib8]; Zhang et al., 2017[href=https://www.wicell.org#bib9]). Consider a delivery vector expressing WT-SpCas9 (such as PX330, Addgene catalog number 42230) or Cas9/gRNA RNP delivery, if the only available sgRNAs in close proximity to the intended knock-in site start with T or C.\nDigestion of eSpCas9(1.1)-T2A-mCherry vector for sgRNA cloning",
    "Perform digestion at 37°C for at least 2 h, followed by purification of the digested vector backbone by gel electrophoresis on a 1% agarose gel using the QIAquick PCR & Gel Cleanup Kit. The expected backbone size is 9264 bp.\nNote: Do not dephosphorylate the backbone as the phospho-groups on the vector backbone overhangs are required for successful cloning of the unphosphorylated sgRNA oligos.\ntable:files/protocols_protocol_698_2.csv\nOligo annealing\nPrepare the following reaction in a PCR tube, heat in thermocycler for 5 min at 95°C and gradually ramp down to 20°C at 5°C/min.\ntable:files/protocols_protocol_698_3.csv\nDilute annealed oligos 1:20 in ddH2O before ligation reaction.\nLigation of the annealed sgRNA oligos into the eSpCas9-mCherry expression vector\nPrepare the following reaction in a 0.2 mL PCR tube. Perform ligation at 20°C–25°C for 1 h using the Quick Ligation kit.\ntable:files/protocols_protocol_698_4.csv\nNote: It is important to set up an empty ligation reaction with water instead of the annealed oligos. This serves as a control for incomplete backbone digestion.\nBacterial transformation (day 1)\nTransform 3 μL of the ligation reaction into a competent E. coli strain (e.g., DH5alpha) according to the protocol supplied by the manufacturer and plate the reaction on agar plates containing ampicillin for antibiotic selection. Competent DH5alpha bacteria can be purchased from many different vendors including ThermoFisher, NEB or Zymo Research.\nPick colonies for plasmid preparations (day 2) (Troubleshooting 1)\nInoculate 1.5 mL of TB medium containing 100 μg/mL ampicillin with a single colony picked with a sterile pipette tip. Incubate and shake cultures at 37°C for 16–18 h.",
    "Note: We use regular 2ml Eppendorf tubes for growing mini prep cultures. Make sure to make a hole in the lid of the tube with an 18G needle to allow sufficient air exchange during incubation. Incubation of the bacterial culture can be performed on a standard laboratory Thermomixer. The sgRNA cloning efficiency is generally high with much higher colony numbers in the cloning as opposed to the empty ligation plates. Picking two or three colonies is usually sufficient for identifying a plasmid with the correct sgRNA.\nIsolation of plasmid DNA (day 3)\nPerform plasmid isolation using for instance a QIAprep spin miniprep kit according to the manufacturer’s instructions (https://www.qiagen.com/us/resources/download.aspx?id=22df6325-9579-4aa0-819c-788f73d81a09&lang=en[href=https://www.qiagen.com/us/resources/download.aspx?id=22df6325-9579-4aa0-819c-788f73d81a09&lang=en]).\nValidation of cloned sgRNAs\nVerify the correctly cloned sgRNA sequence by Sanger sequencing with eSpCas9-forward primer 5' GCATATACGATACAAGGCTG 3'.\nDonor plasmid design and construction\nTiming: 1–2 weeks\nDesign donor plasmid following these guidelines:\nA typical donor plasmid structure is presented in Figure 2[href=https://www.wicell.org#fig2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/698-Fig2.jpg\nFigure 2. Generation of the donor plasmid by In-Fusion assembly\nAny basic vector backbone can be used to construct the donor plasmid. We generally use pUC19 (Addgene catalog number 50005), as it allows blue-white screening of bacterial colonies for insertion of fragments after In-Fusion assembly. The pUC19 vector is linearized by digestion with restriction enzyme Eco53kI to prepare for the In-Fusion reaction, which assembles the donor plasmid consisting of the vector backbone, left and right homology arms (LHA and RHA) for homology directed repair (HDR), a selection marker and the dTAG degron tag. All fragments require a sequence homology of 15 bp for sequential In-Fusion assembly, which can be added by PCR amplification (Figure 2[href=https://www.wicell.org#fig2]).",
    "We generally use homology arms around 400–700 bp in length to generate knock-ins in mouse and human cell lines that are synthesized by IDT (gBlocks Gene Fragments service) or other manufacturers. However, some promoter regions have very high frequency of GC nucleotides, which precludes them from being synthesized. Furthermore, human cell lines from diverse origins can contain multiple single nucleotide polymorphisms (SNPs) in non-protein coding regions, which increases the risk of mismatches in the homology arms of the donor template causing reduced HDR efficiency. In these cases, we advise to amplify the homology arms from genomic DNA of the target cell line by PCR.\nThe efficiency of HDR differs between cell lines and having a good strategy to select for clones with correct integration can drastically decrease the time required for screening. We generally have good success generating endogenous dTAG knock-ins in diverse cell lines by using either an antibiotic selection marker (e.g., blasticidin/BSD, hygromycin, or neomycin) or a fluorescent protein (e.g., eGFP or tagBFP) allowing for fast and efficient selection of in-frame integrations (Figure 2[href=https://www.wicell.org#fig2]). After successful knock-in, the selection marker and the dTAG-fused protein of interest are separated by a P2A protein self-cleavage site within one transcript, leading to production of two separate proteins: the selection marker as well as the dTAG-fusion protein (Figure 3[href=https://www.wicell.org#fig3]). To allow for identification of biallelic integrations, two different selection cassettes can be used at the same time. In our experience, this works for most cell lines, except mouse ES cells, where we recover biallelic integrations with the same selection cassette in most clones.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/698-Fig3.jpg\nFigure 3. Targeting strategy chosen for the Kansl3 locus",
    "A star indicates a silent mutation introduced into the Kansl3 open reading frame to prevent cutting of the modified locus and the targeting vector. CAC codon was changed to CAT (both encode histidine), CGG codon was changed to AGG (both encode arginine). In this case the sequence allowed to mutate two PAM nucleotides. This is often not possible without consequent amino acid change and introducing one mutation is usually sufficient.\nIt is important to ensure that Cas9 is unable to cut and edit the donor plasmid or the genomic locus once integration has occurred. Frequently, if the selected sgRNA overlaps with the start or stop codon, the binding sequence will be disrupted by the inserted DNA sequence. However, if the sgRNA sequence stays intact in the donor DNA after the integration, it is important to introduce silent mutations of the PAM site or the sgRNA seed region (8–10 bp upstream of the PAM site) to prevent Cas9 from cutting the donor plasmid and the final integrated cassette.\nTo simplify cell line validation and subsequent functional experiments, it is useful to include an epitope tag (e.g., HA or FLAG) as a part of the construct (Figure 3[href=https://www.wicell.org#fig3], sequence of edited Kansl3 dTAG knock-in locus available at Mendeley Data).\nTo generate the dTAG-KANSL3 knock-in donor vector, used as an example in this protocol, we selected the 500 bp genomic sequence before and after the start codon of Kansl3 and ordered both homology arms from IDT. The CGG PAM site of the sgRNA in the RHA was changed to CTA to prevent CRISPR editing of the donor construct. The DNA sequences of LHA and RHA are listed in Key Resources Table.",
    "Amplification of the selection cassette PCR amplify either the BSD-P2A-dTAG cassette from pCRIS-PITCH-BSD-P2A-dTAG vector (Addgene catalog number 91792) or eGFP-P2A-dTAG from pUC19-eGFP-P2A-dTAG-Ing3 vector (Addgene catalog number 170754).\nSet up PCR reaction:\ntable:files/protocols_protocol_698_5.csv\nRun PCR according to the following conditions:\ntable:files/protocols_protocol_698_6.csv\nAfter PCR amplification, load the reaction on a 0.8% agarose gel, excise the PCR product with the correct size (909 bp for BSD-P2A-dTAG, 1233 bp for eGFP-P2A-dTAG) and isolate DNA with a gel extraction kit according to manufacturer’s protocol (https://www.qiagen.com/cn/resources/download.aspx?id=a72e2c07-7816-436f-b920-98a0ede5159a&lang=en[href=https://www.qiagen.com/cn/resources/download.aspx?id=a72e2c07-7816-436f-b920-98a0ede5159a&lang=en]).\nLinearization of donor plasmid backbone with Eco53kI\nPrepare reaction in a PCR tube and digest for 2 h at 37°C, followed by 20 min incubation at 65°C to heat-inactivate the restriction enzyme. Add 1 μL Calf Intestinal Alkaline Phosphatase (CIP) to the tube and incubate for one additional hour at 37°C. Proceed with loading the reaction on a 0.8% agarose gel, excise the linearized backbone and isolate backbone DNA from the gel (2686 bp) using the QIAquick PCR and gel cleanup kit. Freeze the linearized pUC19 vector backbone at −20°C and reuse for subsequent In-Fusion assembly reactions.\ntable:files/protocols_protocol_698_7.csv\nIn-Fusion HD cloning reaction for targeting vector assembly and transformation The fragment amounts in the table below correspond to an insert to vector molar ratio of 2:1 and give very good results in In-Fusion assembly.\nPrepare the reaction below in a PCR tube, mix and incubate for 15 min at 50°C.\nTransform 5 μL of the reaction into 1 vial of competent cells (e.g., DH5alpha, Stellar, or TOP10).\nAdd 2–3 drops of IPTG and X-gal solution onto LB-amp plate, spread equally and dry for 30 min.\nPlate bacteria on LB-amp plates containing IPTG and X-gal for blue-white screening. pUC19 vectors that contain an insertion will appear white due to disruption of the lacZ gene.\ntable:files/protocols_protocol_698_8.csv\nOptional: Perform diagnostic colony PCR",
    "Pick 5–10 white colonies and resuspend them in 10 μL of water. Incubate 5 μL of bacterial suspension at 98°C for 5 min and use as a template to set up a diagnostic PCR reaction. Save the other 5 μL of the bacterial suspension for inoculation of the positive clones.\nOne PCR primer should bind on the pUC19 backbone and the other on the inserted fragment. If the homology arms were prepared by PCR from genomic DNA, then this step can simultaneously select for colonies with correctly amplified homology arm sequence. We had good success with designing primers to yield different sized products for amplifying from the LHA, RHA and pUC19 backbone simultaneously.\nSet up diagnostic colony PCR reaction:\ntable:files/protocols_protocol_698_9.csv\nRun PCR according to the following conditions:\ntable:files/protocols_protocol_698_10.csv\nInoculate at least 2 PCR-positive colonies into 1.5 mL LB or TB medium containing 100 μg/mL ampicillin. Incubate culture while shaking at 37°C for 16–18 h.\nIsolate plasmid DNA by using for instance a QIAprep spin miniprep kit according to the manufacturer’s instructions.\nPerform validation of donor plasmids by Sanger sequencing using M13 forward, M13 reverse and an internal primer. For BSD-P2A-dTAG-KANSL3 donor plasmid the following sequencing primers were utilized to span the whole insert: M13 forward 5' TGTAAAACGACGGCCAGT 3', M13 Reverse 5' CAGGAAACAGCTATGAC 3', and blast-dTAG-amp RP 5' AGATCCGCCGCCACCCGACCC 3'.\nDelivery of sgRNA, Cas9, and the donor plasmid into the cells\nTiming: 2 h\nFor mouse ES cells we have achieved very good results expressing sgRNA/Cas9 from a plasmid and delivering all components via lipofection. However, other cell lines are difficult to transfect and furthermore display a lower propensity for integrating exogenous DNA via HDR compared to ES cells. In these cases, nucleofection with preassembled Cas9/gRNA ribonucleoprotein (RNP) complex produces superior knock-in results. We provide protocols for both options here.",
    "Lipofection-based DNA delivery\nPlate 5 X 105 mouse ES cells in 3 mL of media in a well of 6-well plate just before the lipofection.\nFor each transfection, prepare the following and mix each tube gently by flicking:\ntable:files/protocols_protocol_698_11.csv\ntable:files/protocols_protocol_698_12.csv\nIncubate 5 min at RT (no more than 25 min).\nCombine diluted DNA (Tube A) and Lipofectamine (Tube B) (total volume 500 μL). Mix gently by flicking the tube and incubate at RT for 20 min (solution may appear cloudy).\nAdd 500 μL of complexes to each well containing cells and medium. Rock the plate gently.\nChange media the next day.\nAlternatives: If using Lipofectamine 3000 instead of Lipofectamine 2000, note that this is more toxic to mouse ES cells cultured in 2i/LIF conditions.\nDelivery of Cas9/gRNA ribonucleoproteins by nucleofection with Amaxa 4D-nucleofector (Troubleshooting 2)\nReconstitute synthetic Alt-R tracrRNA and crRNA in buffer (generally provided by manufacturer such as duplex buffer from IDT) at a concentration of 100 μM. Store reconstituted synthetic RNAs at −20°C.\nTo anneal tracrRNA/crRNA, mix an equal amount of 100 μM tracrRNA and crRNA in a PCR tube, heat to 95°C for 5 min and leave at 20°C–25°C for 30 min. Prepare 2 μL aliquots of annealed RNAs and place on ice if not immediately used for RNP complex formation. Store unused annealed tracr/crRNA at −20°C for later use.\nFor RNP complex formation, add 10 μg of recombinant SpCas9 protein to 2 μL of annealed tracr/crRNA, incubate for 10 min at 20°C–25°C and place on ice until ready to nucleofect. Prepare the RNP complex fresh before nucleofection.",
    "Note: Recombinant SpCas9 protein can be purchased from IDT, other vendors or prepared in-house. We have used both commercially available Cas9 as well as in-house prepared SpCas9 protein produced in BL21(DE3) E.coli using expression plasmid pET28a-Cas9-His (Addgene catalog number 98158) with similar results.\nNucleofect RNP complex and donor plasmid into recipient cells using Amaxa 4D-nucleofector (Lonza). The choice of nucleofection program and solution is cell line-dependent and requires optimization beforehand. For commonly used cell lines, optimized nucleofection conditions are found on the Lonza website. The nucleofection programs for cell types we have successfully used in the lab are provided in the materials and equipment[href=https://www.wicell.org#materials-and-equipment] section.\nMix 16.4 μL cell line specific nucleofection buffer (e.g., P3 Primary Cell) with 3.6 μL buffer supplement.\nAdd 500 ng pUC19 donor plasmid (in the smallest volume possible) to 20 μL nucleofection buffer mix.\nResuspend 2×105 cells in nucleofection buffer/plasmid mix.\nTransfer cell suspension to tube with assembled RNP complex and mix solutions by carefully pipetting up and down with a P200 pipette tip.\nTransfer nucleofection mix into 16-well Nucleocuvette strip.\nCritical: pipette slowly to avoid introducing air bubbles; tap the cuvette gently to remove any air bubbles.\nPerform nucleofection with desired program.\nTransfer nucleofected cells to 6 well tissue culture plate with pre-warmed culture medium using a P200 pipette tip.\nChange media the next day to remove dead cells\nPause Point: 2–3 days after transfection or nucleofection the plate contains a mixed population of cells with different editing outcomes. The mixed cells can be cryopreserved for later selection and single-cell clone generation if desired.\nSelection, single-cell clone generation, and screening\nTiming: 2–4 weeks\nEnrichment for cells with correct integrations and single-cell sorting\nAntibiotic selection strategy",
    "If the DNA was delivered using lipofection, start antibiotic selection for cassette integration 24 h after transfection. In the case of nucleofected cells, 3–5 days of recovery is required before starting the selection. It is important to set up a control well with untransfected cells and to continue selection until all the cells in this control well have died. Once antibiotic selection is complete, perform single cell sorting of cells with high mCherry (Cas9) expression into 96-well plates (only applicable if plasmid based delivery was used). In our experience, cells with high Cas9 protein levels display best knock-in efficiency. (Troubleshooting 3)\nNote: Single cell sorting can be very stressful for cells and not all cell types are amendable to it. Minimizing the stress during sorting by choosing a big nozzle size, at least 100 μm for murine and 130 μm for human cell lines, can strongly enhance the number of clones recovered. (Troubleshooting 4)\nOptional: If testing several different strategies for knock-in generation, use the pool of cells before single cell cloning to perform PCR-based screening to check for the presence of any successful integration (using protocol steps 19 d-f). We also have found that genomic DNA from the pooled population is useful to test different primers and optimize PCR conditions necessary for the screening step of single cell clones.\nFluorescent protein selection strategy\nOnce the cells have recovered after lipofection or nucleofection (3–5 days), perform single cell sorting of the GFP-positive cells into 96-well plates.",
    "Note: We find it very convenient to use round bottom 96-well plates when generating clones of mouse ES cells, as this makes the emerging colonies easily identifiable under the microscope. As both antibiotic and fluorescent protein pre-selection provides a strong enrichment of cells with at least one correct integration event, and mouse ES cells grow easily as single cell clones, it is sufficient to sort two 96-well plates. Depending on how easily a cell line can grow from single cells, adjust the number of plates sorted accordingly. Furthermore, it is advisable to cryopreserve the pooled knock-in population in case the first round of single cell clones does not yield homozygous knock-in clones.\nScreening of the generated clones\nWe generally pick mouse ES cell single cell clones 9–10 days after single cell sorting when cells cover approximately 60% of the well surface.\nIdentify expanding clones either by eye or with a microscope.\nCritical: visually inspect clones with a microscope and exclude wells with more than one cell colony\nTrypsinize the cells and resuspend in 100 μL of medium. Transfer 10 μL of the cell suspension into a fresh gelatin coated 96-well plate containing 130 μL of fresh media and place into the incubator. Transfer 100 μL of the suspension into a transparent 96-well PCR plate for screening.\nNote: If using a fluorescent reporter strategy, it is worthwhile to utilize the information from index sorting (record of fluorescence signal of the single sorted cells), when deciding which clones to screen/expand. Clones with higher fluorescent signal often indicate modification of both alleles.\nSpin PCR plates to pellet the cells at 300 g for 5 min. Carefully remove the supernatant.",
    "Add 20 μL of lysis buffer (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]) per well. Use sticky film to seal the plates, vortex and quickly spin down to collect the liquid at the bottom of the plate.\nIncubate in the PCR machine with 96-well compatibility using the following program:\ntable:files/protocols_protocol_698_13.csv\nDilute the genomic DNA with 100 μL of TE (10 mM Tris-HCl pH 8.0, 0.1 mM EDTA) and use 2 μL per PCR reaction. Run the PCR reaction below on a 1% agarose gel. Primer sequences can be found in Key Resources Table\nOptional: addition of Q-solution (provided in Qiagen PCR Taq polymerase kit) can improve amplification of some regions. (Troubleshooting 5)\nSet up PCR reaction:\ntable:files/protocols_protocol_698_14.csv\nRun PCR according to the following conditions:\ntable:files/protocols_protocol_698_15.csv\nNote: We usually design one of the primers in the genomic region just outside one of the homology arms and the other one within the second homology arm. This way, a larger band is generated if successful integration has taken place. At the same time, absence of the smaller wild type band indicates biallelic integration (Figure 4[href=https://www.wicell.org#fig4]A). An example of screening Kansl3 knock-in clones is represented in Figure 4[href=https://www.wicell.org#fig4]B. To ensure correct integration in the selected clones, additional primers can be designed to completely cover the integration site.\nAlternatives: Screening of single cell clones with diluted genomic DNA from step 19f can also be performed using quantitative RT-PCR. For this strategy the amplicon should be 70–110 bp in length. We generally prefer regular PCR for screening, as it allows amplifications of several products in one reaction and can yield simultaneous information of presence of unmodified wild type locus as well as different selection marker knock-ins due to size differences in amplicon length.",
    "Purify PCR bands from the gel and analyze by Sanger sequencing to ensure correct integration without mutations. Primers used for PCR amplification can be used for sequencing of the PCR products.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/698-Fig4.jpg\nFigure 4. Screening of the knock-in clones\n(A) Overview of the typical screening strategy.\n(B) Example screening result. Clones 1,2,3 and 6 demonstrate biallelic knock-in. Clone 5 demonstrates monoallelic knock-in. Clone 4 demonstrates a correctly integrated cassette in one allele and a potential cassette duplication event in the second allele.\nFunctional validation of the degron-fused protein\nTiming: 1 week\nThe best way to validate the successful dTAG knock-in cell line is to perform western blotting for an HA or any other epitope tag introduced during the knock-in procedure before and after dTAG ligand treatment. A concentration of 500 nM dTAG-ligand works for most targets and cell lines. In addition, antibody to the protein of interest should be used to ensure complete degradation and to confirm successful modification of both alleles. The degron-tag adds approximately 15 kDa to the protein size and a corresponding molecular shift should be expected. An example western blot validation for Kansl3 dTAG knock-in clones is shown in Figure 5[href=https://www.wicell.org#fig5]A.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/698-Fig5.jpg\nFigure 5. Functional validation of the knock-in clones\n(A) Western blot of HA tag, KANSL3 and GAPDH in three Kansl3 degron knock-in clones and wild type ES cells with and without dTAG-13 treatment for 24 h. An unspecific band is indicated with an asterisk.\n(B) Western blot of HA-tagged KANSL3 and GAPDH in Kansl3 degron knock-in cell line at different times after dTAG-13 addition (Radzisheuskaya et al., 2021[href=https://www.wicell.org#bib7]).\n(C) Bar plots representing mean ± SD fold cell expansion and percent of Trypan blue positive cells after 4 days of dTAG-13 treatment in Kansl3 degron knock-in cell line (Radzisheuskaya et al., 2021[href=https://www.wicell.org#bib7]).",
    "(D) Western blot of HA tag and GAPDH in dTAG-TAK1 expressing glioma stem cells treated with 500 nM dTAG13-NEsG, dTAG-13 or dTAGV-1.\nTo establish the degradation kinetics of your protein of interest we recommend analyzing knock-in cells upon different durations of dTAG-ligand treatment (Figure 5[href=https://www.wicell.org#fig5]B). In most cases the target protein should be degraded after 1–2 h.\nIf depletion of the target protein is known to confer a specific cellular phenotype, dTAG ligand treatment should recapitulate this effect in the case that both alleles are successfully targeted, and the protein is efficiently degraded by the ligand. Since Kansl3 is an essential gene, dTAG treatment of the knock-in cell lines induces decreased cell proliferation and concomitant loss of cell viability (Figure 5[href=https://www.wicell.org#fig5]C).\nHowever, not all protein targets can be efficiently degraded in a short time frame by recruiting CRBN E3 ligase complex using dTAG-13 (Nabet et al., 2020[href=https://www.wicell.org#bib3]). Shown in Figure 5[href=https://www.wicell.org#fig5]D is another dTAG-fusion protein where degradation via the VHL E3 ligase using the alternative dTAGV-1 ligand shows superior degradation results after short-term (2 h) and long-term (4 days) treatment compared to dTAG-13. (Troubleshooting 6)."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Genetics",
    "Crispr"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}