{
  "id": 12308,
  "origin_website": "Jove",
  "title": "The Drosophila Imaginal Disc Tumor Model: Visualization and Quantification of Gene Expression and Tumor Invasiveness Using Genetic Mosaics",
  "procedures": [
    "NOTE: This work utilizes the eyFLP1; act>y+>Gal4, UAS-GFP; FRT82B, tub-Gal80 MARCM 82B Green tester line 11. Crossing the MARCM 82B Green tester virgins to males of strains such as w; UAS-a; UAS-bRNAi, FRT82B cmut genotype will yield progeny in which mitotic recombination will occur between the right arms of the 3rd homologous chromosomes. In this way, clones homozygous mutant for gene c located distal to the FRT82B site will be generated within the EAD and brain neuroepithelium. These clones will express GFP, transgene a and dsRNA for gene b (Figure 1A). Various eyFLP-MARCM tester lines for recombination on the X, 2L, 2R, 3L and 3R have been established and are available within the fly community.\n1. Fly Handling, Crosses, and Staging\nExpand the appropriate MARCM tester stock at room temperature by populating multiple bottles at the same time. Flip the adults into fresh bottles every 2-3 days so that enough virgins can be collected for subsequent crosses.\n\tNOTE: When collecting virgins, avoid a prolonged exposure to CO2 as this compromises female fecundity.\nDepending on the scale of the experiment, set up fly crosses in vials using at least 10 MARCM tester virgins and 4 males (e.g., for imaging of fluorescent reporters and immunostaining) or in bottles with at least 30 virgins and 10 males (e.g., for RNA isolation and quantification of invasiveness).\nRaise progeny at 25 °C under a long day 16 hr/8 hr light-dark cycle. Flip parents into new vials/bottles every 24 hr to facilitate reproducible staging of larvae and to prevent overcrowding.\n\tNOTE: Starting on day 6 after egg laying (AEL), the late third instar control larvae stop feeding, start wandering and enter pupariation. In contrast, the onset of the larval-pupal transition can be delayed or non-existent in larvae with EAD bearing hyperplastic or malignant clonal tumors.",
    "2. Collecting Third Instar Larvae\nFor immunostaining, collect about 20 late third instar larvae (wandering on the wall and those of a comparable body size from the food). Use forceps to gently pick larvae from the vial or bottle and transfer them into an embryo glass dish filled with phosphate-buffered saline (PBS).\n\t\nFor RNA isolation and quantification of invasiveness, collect at least 80 late third instar larvae (wandering on the wall and those of a comparable body size from the food). Use a squirt bottle to squirt PBS into a fly bottle containing larvae until the surface is covered.\nSoften the top layers of food with a spatula and pour the food mash containing larvae into a Petri dish. Using forceps, gently pick larvae and transfer them into an embryo glass dish filled with PBS.\nWash larvae with PBS until all residual food is removed. Inspect the larvae under the fluorescent stereomicroscope with 8 to 16X magnification to discard all \"leopard larvae\" that carry random GFP-positive spots throughout the larval body (Figure 2A, 2B and see Discussion Section).\n\tNOTE: For RNA isolation include a penultimate washing step in 70% EtOH for 1 min.\nPlace the dish containing selected larvae in PBS on ice until dissection. Process larvae within 30 min to avoid adverse effects of cold and starvation.\n3. Dissection of Larvae\nTo dissect the EAD under a stereomicroscope, use one pair of forceps to gently press the middle part of the larva against the glass dish bottom. With the second forceps, grab the larval mouth hooks and pull them away from the body (Figure 2C).",
    "NOTE: The pulling force is often sufficient to break the optic stalks connecting the EAD pair to the brain lobes. If the brain or its parts stay attached to EAD and their presence is not desired for further applications, cut the optic stalks with a help of the two pairs of forceps. For invasive tumors (e.g., rasV12scrib1) the connection between EAD and the brain lobes becomes increasingly obscured with time by overgrowing and migrating clonal cells.\n\t\nTo prepare the EAD/brain complex with an intact ventral nerve cord (VNC) (Figure 2D), use forceps to cut a larva in the middle of the body. Discard the posterior half.\nHold the anterior half of the larval body between the tips of one forceps, flip the larva inside-out by pushing in the mouth hooks with the tip of the second forceps and by rolling the cuticle over it with the first forceps pair.\nUsing forceps carefully remove all extraneous tissues (e.g., salivary glands, fat body, and gut) while leaving the EAD pair or the EAD/brain complex connected to the mouth hooks. Disentangle the mouth hooks from the overlying cuticle. Free the VNC by severing the axonal projections extending to body muscles and epidermis (Figures 1B, 2C, 2D).\n\tNOTE: The mouth hooks allow for safe manipulation of tissue with forceps and facilitate more efficient sinking and easy recognition of tissue during washing. Dissected EAD change morphology relatively fast when kept unfixed in PBS. Limit the dissection time to 20-30 min.\nTo transfer the tissue, coat a P20 micropipette tip by pipetting the remaining body carcasses several times up and down. To transfer the larger EAD/brain complexes, cut the P20 micropipette tip with scissors.",
    "NOTE: The coating procedure is critical to prevent sticking and loss of dissected tissue during transfer. Use of a P20 micropipette minimizes the transfer of PBS into fixative solution, limiting unwanted dilution.\n\t\nFor immunostaining, transfer the dissected EAD into a 0.5 ml tube filled with 400 µl 4% paraformaldehyde (PFA) fixative. Use 1.5 ml tube with 1 ml PFA for larger EAD/brain complexes meant for scoring of invasiveness.\n\t\tCAUTION: PFA is highly toxic. Wear protective gloves and clothing. Avoid contact with skin, eyes or mucous membranes.\nFor RNA isolation transfer the dissected EAD into a new glass dish filled with cold PBS. Use forceps to clean EAD from the ring and lymph glands, to minimize sample contaminations.\nDetach the EAD from the mouth hooks by severing the connection between the antenna discs and mouth hooks using forceps (Figure 2E). To avoid RNA degradation and gene expression artifacts, limit the dissection time to 30 min. Proceed to step 7.\n\t\tNOTE: An experienced researcher can dissect about 60 larvae in 30 min excluding time needed for larvae collection and washing. Total RNA yields depend on the EAD size that vary among genotypes and developmental stages. Dissection of 80-100 control EAD pairs from late third instar larvae should yield 5-8 µg total RNA.\n4. Fixing, Immunostaining, and Mounting\nFix samples in PFA fixative for 25 min while nutating at room temperature. The fixation time can be extended up to 60 min without altering tissue morphology and the antigenicity of proteins.\nRemove the fixative and wash samples with PBST (PBS with 0.1% Triton X-100) three times for 10 min using a nutator. Use sufficient volume of PBST for each washing step (400 µl/0.5 ml tube).",
    "NOTE: Fixed EAD/brain complexes meant for scoring of invasiveness do not require immunostaining. GFP signal remains well visible after fixation. Proceed to step 4.4 for the final dissection.\n\t\nFor immunostaining, block tissue in 200 µl of a blocking solution (PBST with 0.3% BSA) for 20 min with gentle agitation at room temperature.\n\t\t\nIncubate with primary antibodies diluted in 100 µl of a blocking solution overnight at 4 °C while gently shaking. Refer to primary antibody datasheet or published literature for recommended antibody dilution.\n\t\t\tNOTE: The primary antibody dilution might need to be optimized.\nFollowing five 10 min washes in PBST, stain tissue with the fluorescent secondary antibodies diluted in blocking solution while gently shaking for 2 hr at room temperature or overnight at 4 °C in the dark.\nWash samples three times 10 min in PBST.\nReplace PBST with 500 µl of DAPI-staining solution. To label F-actin, add phalloidin conjugated to a fluorescent dye to DAPI-staining solution. After 15 min nutation in the dark, wash tissue once for 10 min with PBST.\n\tNOTE: F-actin labeling can be carried out independently of DAPI staining.\nFor the final dissection step, transfer tissue back into a PBS-filled glass dish using a 1 ml pipette. Using the two pairs of forceps clip off the mouth hooks.\n\t\nSeparate the brains that will be used for quantification of invasiveness from the EAD by cutting the optic stalk as overgrown EAD might hamper the analysis.\nPlace a drop of the mounting medium (15 µl for a 22 mm x 22 mm coverslip) on an objective slide. With the help of forceps tips, distribute the medium into a thin layer. Transfer EAD, brains or the EAD/brain complexes into the mounting medium with a P20 micropipette.",
    "Use the forceps tips or a tungsten rod to distribute tissue and straighten the VNC on the slide.\nTo avoid formation of bubbles while mounting, first touch one edge of a coverslip to the mounting medium and then slowly lower onto the mounting medium with the help of forceps. Use small pieces of filter paper or tissue wipe to absorb excess mounting medium around the coverslip edges.\n\tNOTE: DABCO/Poly(vinyl alcohol) 4-88 mounting medium hardens at 4 °C within an hour. Slides can be stored for months at 4 °C.\n5. Confocal Imaging\nAcquire single confocal sections and stacks using a confocal microscope equipped with 20X, 40X and 60X oil objectives.\nPrevent pixel saturation. Use same image acquisition parameters including image resolution, laser input power, gain, offset, frame averaging, a step size in a z-series and maintain these settings for all genotypes to allow for comparisons of pixel intensities between different genotypes 21,22.\n\tNOTE: For visualization of EAD/brain complex, generate maximum projections and stitch respective, neighboring images. For final image preparation, use post image processing software for panel assembly and to adjust brightness and contrast.\n6. Quantification of Tumor Invasiveness\nDefine a scoring system that will characterize the different levels of tumor invasiveness considering the spatial pattern of invasion and the amount of GFP-positive cells spreading into the brain and VNC. Prepare evaluation sheets for documentation (Figure 3A).\nMount at least 80 fixed intact brains for each genotype on one slide using 40 µl of the mounting medium per 24 mm x 50 mm coverslip.\n\t\nTo allow unbiased scoring, ask a neutral party to anonymize the slides, so that the scoring procedure is unbiased. Evaluate anonymized slides by two lab members independently. Disclose genotypes only after the counting is finished.",
    "Evaluate the degree of malignancy by a blind scoring of mounted brains under a fluorescent stereomicroscope equipped with a GFP filter set. Use a marker to label brains that have been already viewed to avoid double counting (Figure 3B).\nCalculate the percentage of brains falling into each of the defined invasive categories per genotype. Determine the statistical significance using a chi-square test (Figure 3C).\n7. RNA Isolation, DNase Treatment, and Quality Check\nNOTE: All reagents (solutions, plasticware) used in the following steps should be free of RNase activity. Always wear gloves and use a chemical hood for work with organic solvents.\nTransfer the clean EAD with a coated P20 micropipette tip into 1.5 ml tube.\nLet tissue sink to the bottom of the tube, carefully remove PBS and replace it with 100 µl RNA lysis reagent (sufficient for up to 140 EAD).\nLyse tissue by vortexing. At this point, samples can be deep frozen in liquid nitrogen and stored at -80 °C or directly processed with a standard RNA isolation protocol.\n\tNOTE: Samples of similar genotypes from multiple dissection rounds can be pooled once in RNA lysis reagent.\nFill the sample volume to 0.9 ml with RNA lysis reagent. Add 0.2 ml of chloroform and mix samples vigorously for 15-20 sec.\nFollowing 2 to 3 min incubation at room temperature, centrifuge the samples at 10,000 x g for 15 min at 4 °C.\nTransfer colorless upper aqueous phase containing RNA into a fresh tube without disturbing the interphase. Stay away from the interphase as it contains proteins and genomic DNA.\n\tNOTE: The recovered volume should be about 60% of the volume of RNA lysis reagent used for homogenization.\nPrecipitate the RNA by adding 0.5 ml of isopropyl alcohol. Vortex and incubate samples at room temperature for 10 min.",
    "Centrifuge the samples at 10,000 x g for 15 min at 4 °C.\nDiscard the supernatant and wash the RNA pellet once with 600 µl of 75% ethanol. After a short vortex and centrifugation (10,000 x g for 7 min at 4 °C) discard all ethanol and let the RNA pellet air-dry for 5-10 min placing the open tube on a clean tissue wipe.\n\tNOTE: The RNA pellet might be visible as a tiny opaque/white stripe at the bottom of the tube or invisible. The remaining ethanol drops can be carefully removed with P10 micropipette tip.\nDissolve RNA in 50 µl of DEPC-treated water by vortexing or passing solution a few times through a pipette tip.\nTo minimize contamination with genomic DNA, treat total RNA with DNase by adding 50 µl of a mix containing 1 µl of DNase (2 U/µl) and 10 µl of 10x DNase buffer in DEPC-treated water. Vortex and spin down.\nIncubate samples at 37 °C in a water bath or a heating block for 30 to 40 min. After incubation, add 100 µl of DEPC-treated water into each sample.\nTo inactivate the enzymatic activity and clean RNA from DNase, add 200 µl of phenol:chloroform:isoamyl alcohol (25:24:1) solution, vortex for 1 min and centrifuge the samples at 10,000 x g for 7 min at 4 °C.\nCarefully transfer the upper aqueous phase containing RNA into a fresh tube. Add equal volume (200 µl) of chloroform, mix and repeat the centrifugation step from above.\nCollect carefully the upper phase and precipitate RNA by adding 1/10 volume of 3 M sodium acetate, pH 5.2 prepared in DEPC H2O and 2.5 volumes of 100% ethanol. Mix thoroughly by vortexing.",
    "NOTE: Adding 0.5 µl glycogen (20 µg/µl) to a precipitation mix helps to visualize the RNA pellet. To minimize RNA loss, use siliconized, low-binding 1.5 ml microcentrifuge tubes.\nPrecipitate RNA at -20 °C for at least 1 hr.\n\tNOTE: The incubation might be carried out overnight. Samples can be placed at -80 °C as well.\nPellet RNA by centrifugation at 10,000 x g for 30 min at 4 °C. Wash and dry pellet following the description in 7.9.\nDissolve RNA in 10-15 µl of DEPC-treated water. Store RNA at -80 °C.\nDetermine quantity and purity of RNA by measuring OD at 230 nm, 260 nm and 280 nm using a spectrophotometer. Calculate RNA concentration by applying the convention that 1 OD at 260 nm equals 40 µg/ml RNA.\n\tNOTE: The A260/280 ratio of \"pure\" RNA equals 2.0 while an A260/230 ratio should be in the range of 2.0-2.2. RNA samples with an A260/280 ratio between 1.7 and 2.0 are suitable for downstream applications such as cDNA synthesis. For preparation of mRNA-seq libraries the quality and quantity of RNA should be checked using an automated electrophoresis system. The 28S/18S ratio should be above 1.8.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}