{
  "id": 8423,
  "origin_website": "Jove",
  "title": "Implantation of Osmotic Pumps and Induction of Stress to Establish a Symptomatic, Pharmacological Mouse Model for DYT/PARK-ATP1A3 Dystonia",
  "procedures": [
    "All procedures were performed in accordance with applicable international, national, and/or institutional guidelines for care and use of animals. The local authorities at the Regierung von Unterfranken, Würzburg, Germany, approved all animal experiments.\n1. Priming of osmotic pumps\nNOTE: This step has to be performed at least 48 h prior to surgery. ALZET osmotic pumps need to be prefilled in order to ensure that the pumping rate reaches a steady state before implantation.\nPrepare the desired solution for chronic perfusion beforehand. Ensure that the solvent and agent are compatible with the osmotic pumps and catheters. For the project herein, thaw a 10x stock solution of ouabain (stored at -20 °C) at room temperature and vortex for 10 s.\n\tCAUTION: Ouabain is toxic: it should be handled only with gloves and opened only under a sterile hood to avoid inhalation.\nTurn the sterile hood on; disinfect the hood as well as all the instruments and material needed before putting them under the hood.\nPut on surgical gloves before handling the osmotic pumps. Separately prepare the ouabain-solution designated for the pumps of the striatum and the cerebellum.\n\tNOTE: Consider that the concentration of the solution in the pump for the striatum has to be doubled compared to the concentration of the solution in the pump designated for the cerebellum. This is due to the fact that the pump for the striatum is connected to a double cannula, the flow rate, however, is the same as for the pump of the cerebellum, which is connected to a single cannula.\nCalculate the amount of solution needed using the following formula:\n\tmass delivery rate (ko) = volume delivery rate (Q) x concentration of the agent in the vehicle (Cd)",
    "For the present project, the osmotic pumps were primed and filled with either ouabain solution at a concentration of 11.2 ng/h or 0.9% saline for the control group.\nVortex both ouabain solutions for 10 s and sterile filter (i.e., 0.22 µm syringe-end filter) them into separate, new microcentrifuge tubes, using a different filter for each solution.\nWeigh the empty osmotic pumps together with the flow moderator (about 0.4 g).\nFill a 1 mL syringe with a 27 G filling cannula (preferably with a blunt tip) with sterile filtered ouabain-solution or vehicle solution.\nGet all the air bubbles out of the syringe, hold the osmotic pump in an upright position, insert the cannula all the way into the pump and slowly fill the reservoir until excess solution appears on top (avoid rapid filling as this can lead to air bubbles in the pump). Next, insert the flow moderator into the pump (excess solution should appear on top).\nPull the flow moderator out (about 5 mm), carefully take off the white flange with scissors and connect a piece of vinyl tubing to the flow moderator. Ensure that the catheter has a length of approximately 2 cm to allow proper mobility of the animal.\nWeigh the filled osmotic pump once more to ensure that the difference in weight between filled and empty pump is concordant with the expected weight of the solution loaded.\n\tNOTE: For most aqueous solutions this weight is equal to the volume in microliters. If the weight does not correspond to the expected volume, air might be trapped inside the pump, which needs to be emptied and refilled.\nFor the priming of the pumps, prepare two 2 mL microcentrifuge tubes, one tube for the striatum and one for the cerebellum.",
    "Submerge the pumps into the microcentrifuge tubes filled halfway with 0.9% saline solution. Do not submerge the open end of the catheter. Put the microcentrifuge tubes into a thermocycler for 48 h at 37 °C in order to ensure that the pump has reached a steady pumping rate before implantation and the catheters are prefilled.\n2. Cannula and osmotic pump implantation\nPlace the mouse (male, C57Bl/6N, 11-12 weeks of age) into a chamber designed for inhalation anesthesia; set the flow rate of isoflurane to 2-3% and the flow rate of oxygen to 2 L/min.\nAfter the mouse is deeply anaesthetized according to approved protocols, shave the top of the animal’s head, dorsal neck and proximal third of the back.\nPlace the animal into a stereotactic frame and continue the anesthesia with isoflurane via a mouse anesthesia mask designed for the stereotactic instrument (isoflurane flow rate 1.5-2%, 2 L/min oxygen).\nUsing rubber tips or non-rupture ear bars, fix the head of the animal in the stereotactic frame, taking care that the head is leveled.\nIn order to prevent hypothermia, place a heating pad under the animal, insert a rectal temperature probe and set the temperature to 37 °C. Protect the eyes of the animal from drying out by using a drop of ophthalmic ointment on each eye.\nApply an analgesic, such as Carprofen (5 mg/kg bodyweight), subcutaneously before beginning surgery.\nWith a syringe subcutaneously inject up to 0.2 mL of bupivacaine 0.25% and wait 30 s for the local anesthesia to take effect.\nDisinfect the shaved areas thoroughly with an antiseptic, such as octenidine dihydrochloride.",
    "After thorough disinfection of the surgical area, use a scalpel to place an incision at the top of the head and use scissors to continue the incision down to the fore limbs. Expose the skull with the help of bulldog clamps and wipe the periosteum with a sterile cotton-tipped applicator.\nAlign either a pen or the tip of a cannula stained in black ink with bregma and use the appropriate coordinates to mark the three entry points for the brain cannulas on the skull (coordinates for the bilateral holes needed for perfusion of the basal ganglia: anterior/posterior: + 0.74 mm, medial/lateral: +/- 1.50 mm (+ indicating the right side, - the left side relative to bregma); coordinates for the hole at the midline of the cerebellum: anterior/posterior: - 6.90 mm). Next, carefully drill the holes for the double cannula designated for the basal ganglia and the single cannula designated for the cerebellum (Figure 1A).\nDrill a fourth hole for a small screw in-between the striatum and the cerebellum. This screw will eventually be embedded in dental cement and provide additional hold for the cannulas. Using fine forceps and a screw driver, carefully introduce the screw into the small hole until it is firmly fixed in the skull. Do not implant the screw too deeply as this damages the brain tissue.\n\tNOTE: It is recommended to continue with the osmotic pump implantation before inserting the osmotic cannulas. This avoids causing any accidental damage to the cannulas when implanting the pumps.",
    "In order to create a small pocket for the osmotic pump on each side of the animals back, use tissue forceps to separate the subcutaneous tissue layers. Advance the forceps towards one hind leg and open the forceps slightly in order to widen the subcutaneous pocket. Repeat the same procedure for the other side, first removing the forceps from the incision and then pushing them gently towards the second hind leg.\n\tNOTE: The pocket should permit the pump to easily slide in, however, it should not have too much room to move under the skin.\nWith the help of tissue forceps take the first pump together with the connected piece of tubing and slide it into one subcutaneous pocket. Repeat the same procedure with the second pump.\nUsing a minipump holder, introduce a single osmotic cannula with a custom length of 3.0 mm into the hole drilled in the midline of the cerebellum. Detach the cannula head carefully and fix the cannula as well as the small screw with dental cement, taking care as not to cover the connecting piece for the tubing of the osmotic pump. Ensure that the dental cement surrounding the cannula has fully dried before continuing with surgery.",
    "Before inserting a double cannula with a center-to-center distance of 3.0 mm and custom-made length of 4.0 mm into the bilaterally drilled holes above the basal ganglia, attach two short pieces of vinyl tubing (0.5 cm) to the two connecting pieces of the double cannula. Connect the vinyl tubings with a bifurcation adaptor and carefully prefill the entire tubing system including the adaptor and cannula with ouabain solution or vehicle (room temperature, sterile filtered beforehand). This can be done best with a 1 mL syringe and a 27 G filling cannula introduced into the single rear end of the bifurcation adaptor (Figure 1B).\nUsing a minipump holder, carefully insert the double cannula into the bilateral holes. Use a clamp to detach the cannula head and fix the double cannula with dental cement.\nConnect the catheters of the osmotic pumps to the bifurcation adaptor as well as the single cannula, respectively. Ensure that the catheters have a strong hold on the connecting pieces of the cannulas.\n\tNOTE: Both pumps have an equal flow rate, so be careful to connect the osmotic pump with the double concentrated solution to the bifurcation adaptor to ensure that the same concentration reaches both the basal ganglia and the cerebellum.\nClose the incision on the back of the animals with stitches as far as possible in direction of the skull, being careful not to overstretch the skin (Figure 1C).\nSubcutaneously inject 0.5 mL of 0.9% saline, which should have body temperature, into a skin fold on each side of the back of the animals in order to avoid dehydration of the mice, carefully avoiding the pumps.\n3. Motor challenge",
    "Subject ouabain- or vehicle-perfused mice to challenging motor tasks as a form of mild stress exposure 4 h post-surgery and repetitively every 24 h afterwards in order to induce dystonia-like movements. This does not include a behavioral characterization; its purpose is to induce a higher stress level compared to normal cage keeping.\nPlace the mouse onto a 50 cm rough-surfaced, wooden pole with a diameter of 1 cm, nose facing downwards. Ensure that the pole is placed into a large cage with enough bedding in case of falls. It is not necessary to measure the time of descent, but look out for involuntary hyperextensions of front limbs and hindlimbs presented by ouabain-perfused animals while descending the pole. Let mice descend the pole three times and allow 2 min of recovery between descends.\n\tNOTE: Ouabain-perfused mice should present first symptoms like bradykinesia 4 h post surgery. However, 24 h after surgery mice should start to present involuntary hyperextensions of front limbs and hindlimbs as a sign of dystonia-like movements during descend.\nFor the second motor task, place mice on the rotating rod as done for the Rotarod performance test. The Rotarod apparatus is not used as a measure of the latency to fall, the aim is to subject mice to forced activity. Place the mice on the rotating rod three times and allow 2 min of recovery between tests.\n\tNOTE: To increase stress exposure, use an accelerating Rotarod apparatus. For the project described herein, the rod accelerates from 5 to 50 rpm over a set time period of 300 sec.",
    "Let animals recover for 30 min in between the pole test and the Rotarod performance test and again another 30 min before scoring for dystonia-like movements as described under protocol step 4. In between the repetitive stress exposures, allow mice to recover for 24 h-intervals.\n4. Scoring systems for the assessment of dystonia-like movements\nNOTE: The experimenter should be blinded to the group assignment analyzed to prevent bias. The behavioral tests used to characterize the phenotype of the mice are two scoring systems: a dystonia rating scale scoring abnormal, dystonia-like movements and a behavioral score using the tail suspension test. Assess the dystonia-like movements after a recovery time of 30 min following the exposure to mild stress.\nDystonia rating scale\n\tNOTE: Due to the lack of predefined behavioral tasks, the dystonia rating scale was established as an observer-based scoring system similar to the clinical rating scales of human dystonia. It is a modified version of the dystonia rating scale used by Calderon et al.13.\n\t\nRecord posture and gait of animals over a period of 4 min after animals have been placed in a plastic or wooden box.\nScore for frequency and distribution of dystonia-like movements from 0 to 4 points: (0) normal motor behavior; (1) abnormal motor behavior, no dystonia-like movements; (2) mild motor impairment with mild focal dystonia-like movements; (3) moderate motor impairment with severe focal dystonia-like movements; (4) severe impairment, with sustained, generalized dystonia-like movements (Figure 2). Consider the following movements or postures as dystonia-like: hyperextension of front limbs, wide stance or hyperextension of hindlimbs as well as kyphosis. Consider dystonia as focal in case a single body part is affected and as generalized in case the trunk and at least two other body parts are affected.\nTail suspension test",
    "NOTE: The tail suspension test is often used to observe and score for hindlimb clasping. This is however a highly unspecific phenotype indicating a motor impairment. The following protocol proposes a scoring system specific for dystonia-like movements. Due to the generalization of dystonia in DYT/PARK-ATP1A3 patients, dystonia-like movements should be assessed in front limbs, trunk and hindlimbs. A newly-developed scoring system from 0-8 points was developed, a total score < 2 indicated that no dystonia-like movements were present (Figure 3).\n\t\nPick the mouse up by the tail near its base and lift the animal up. Record a 2 min video of the tail suspension test and assign a score in a subsequent, thorough analysis of the recording.\nScore the front limbs from 0 to 4 points, where repeated or sustained tonic retractions of one or both front limbs, as well as a hyperextension combined with crossing of the front limbs, were classified as dystonia-like: (0) no abnormal movements; (1) reduced movement of front limbs with hyperextension of paws seen ≥ 50% of the recorded time; (2) mild dystonia-like movements of front limb(s) < 50% of the recorded time; (3) mild dystonia-like movements of front limb(s) ≥ 50% of the recorded time or severe < 50% of the recorded time; (4) severe dystonia-like movements of front limb(s) ≥ 50% of the recorded time.\n\t\tNOTE: Hindlimb clasping is an abnormal movement that should not be scored as dystonia-like.\nScore the hindlimbs from 0 to 3 points, where retraction and clenching of rear limbs as well as sustained hyperextension were assessed as dystonia-like: (0) no abnormal movements; (1) reduced movement of hindlimbs with hyperextension of paws seen ≥ 50% of the recorded time; (2) dystonia-like movements of one hindlimb; (3) dystonia-like movements of both hindlimbs.",
    "In case of truncal distortion > 80% of the recorded time, an additional point is added to the score.\nPlace the animal back into its cage."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}