{
  "id": 17236,
  "origin_website": "Jove",
  "title": "Image Acquisition Method for the Sonographic Assessment of the Inferior Vena Cava",
  "procedures": [
    "All procedures performed in the studies involving human participants were conducted in accordance with the ethical standards of the Duke University Health System Institutional Research Committee and with the 1964 Declaration of Helsinki and its later amendments or comparable ethical standards. The protocol was performed using input from several peer-reviewed papers in the academic literature2,13,14,15. Imaging was performed on the authors themselves for the normal images and as part of routine educational ultrasound scans done for teaching purposes for the positive images, with preceding verbal consent obtained as per institutional standards. The patients were selected based on certain criteria. Specifically, the inclusion criterion was any patient with hypotension, and the exclusion criterion was patient refusal to undergo an ultrasound exam.\n1. Safety procedures\nUtilize nonsterile nitrile or latex gloves depending on the patient's allergies. Additional safety precautions may be required based on the clinical context. Please refer to the respective institution's infection control policies, and follow any precautions in place.\n2. Probe selection\nFor infants (i.e., children younger than 1 year of age), perform the sonographic evaluation of the IVC with either a low-frequency or high-frequency (>5 MHz) ultrasound transducer, depending on the infant's body size.\n\t​NOTE: IVC evaluation in infants is a specialized pediatric topic beyond the scope of this review. The remainder of this review solely focuses on imaging the IVC in individuals over 1 year of age.\nFor individuals over 1 year of age, visualize the IVC with any low-frequency (≤5 MHz) ultrasound transducer, such as a linear phased-array sector arc probe or curvilinear probe.",
    "NOTE: The linear phased-array sector arc probe is commonly referred to as a phased-array probe. This term is misleading, since all modern ultrasound transducers use phasing to steer the ultrasound beam16,17. However, for the sake of brevity, throughout this review, we will use the term phased-array probe instead of linear phased-array sector arc probe.\n\t\nThe phased-array probe is the optimal probe for both main types of external cardiac ultrasound: transthoracic echocardiography (TTE) and focused cardiac ultrasound (FoCUS)18. When performing either TTE or FoCUS to evaluate the heart, continue using the phased-array transducer for the IVC portion of each exam rather than switching to another low-frequency probe.\n3. Machine preset\nSet the machine to the cardiology convention by using the Cardiac Preset function, which sets the indicator to the left of the screen. Set the screen refresh rate to >20 Hz.\n\tNOTE: The IVC evaluation can be performed in the Abdominal Mode. However, for the same points mentioned in step 2.2.1, it is far more convenient to utilize the same presets for both a FoCUS exam and a POCUS IVC exam.\nSet the mode to B-Mode (2-dimensional grayscale). Set the depth to 6-20 cm, depending on the depth of the IVC in each patient.\n4. Scanning technique\nApply ultrasound gel to the transducer.\nObtain the anterior IVC short-axis (ANT IVC SAX) view.\n\t\nPosition the patient in the supine position with both hips flexed, if tolerated by the patient.\nPlace the ultrasound probe centered on the patient's anterior midline just caudal to the xiphoid process in the coronal plane, with the transducer indicator mark pointing toward the patient's left (Figure 1).\nAdjust the depth so that the IVC and aorta appear in the middle third of the screen and the spine is visible (Video 1).",
    "For setting the axis, fan the ultrasound beam cranially or caudally until both the IVC and the abdominal aorta appear in the short-axis cross-section as rounded structures (Video 1).\nDecrease the gain until the blood in the IVC is either completely black or just a few specks of grey are visible (Video 1).\nOnce all the settings are done, click on Acquire.\nObtain the anterior IVC long-axis (ANT IVC LAX) view.\n\t\nPosition the patient in the supine position with both hips flexed, if tolerated by the patient.\nPosition the probe for obtaining the ANT IVC SAX view as described in step 4.2, center the view on the IVC, and rotate the ultrasound probe 90° counterclockwise, without translating the probe, such that the probe's indicator faces cranially at the end of the rotation (Figure 2).\nAdjust the depth so that the IVC appears in the middle third of the screen and the liver tissue is visible deeper than the IVC (Video 2).\nFor setting the axis, fan the ultrasound beam toward the patient's left or right until the IVC appears as a rectangular, intrahepatic structure spanning from cranial to caudal on the screen. (Video 2).\nDecrease the gain until the blood in the IVC is either completely black or just a few specks of grey are visible (Video 2).\nOnce all the settings are done, click on Acquire.\nOptional: Quantify the IVC anterior-to-posterior (AP) diameter (Figure 3).\n\t\t\nWith a live image of the IVC optimized as per step 4.3.6, click on Freeze. Click on Caliper or Measure, depending on the machine's measurement button.\nMove the trackball to the anterior wall of the IVC approximately 1-2 cm caudal from the hepatic vein confluence. Click on Select.",
    "Move the trackball to the posterior wall of the IVC opposite the point in step 4.3.7.2, such that the line between the two points is roughly perpendicular to the long axis of the IVC. Click on Select, and then click on Acquire.\nObtain the right lateral IVC long-axis (RL IVC LAX) view.\n\t\nPosition the patient in the supine position with the legs flat and the right arm moved away from the patient's side, either overhead or outstretched laterally, so as to allow access to the right flank.\nPlace the probe transducer in the coronal plane with the indicator pointing cranially in the sixth or seventh right intercostal space just anterior to the right mid-axillary line (Figure 4).\nAdjust the depth so that the IVC appears in the middle third of the screen and the liver tissue is visible deeper than the IVC (Video 3).\nFor setting the axis, fan the ultrasound beam anteriorly or posteriorly until the IVC is visualized as a rectangular, intrahepatic structure spanning from cranial to caudal on the screen (Video 3).\nDecrease the gain until the blood in the IVC is either completely black or just a few specks of grey are visible (Video 3). Click on Acquire.\nObtain the right lateral IVC short-axis (RL IVC SAX) view.\n\t\nContinue positioning the patient supine with the legs flat and the right arm moved away from the patient's side, either overhead or outstretched laterally, so as to allow access to the right flank.\nContinue positioning the probe in the position used for obtaining the RL IVC LAX view (see step 4.4), center the view on the IVC, and rotate the ultrasound probe 90° clockwise, without translating the probe, such that the probe's indicator faces anteriorly at the end of the rotation (Figure 5).",
    "Adjust the depth so that the IVC appears in the middle third of the screen and the liver tissue, aorta, and spine are all visible deeper than the IVC (Video 4).\nFor setting the axis, fan the ultrasound beam cranially or caudally until the IVC and abdominal aorta are visible in the short-axis view as rounded structures (Video 4).\nDecrease the gain until the blood in the IVC is either completely black or just a few specks of grey are visible (Video 4). Click on Acquire.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}