{
  "id": 10798,
  "origin_website": "Jove",
  "title": "Microfluidic Buffer Exchange for Interference-free Micro/Nanoparticle Cell Engineering",
  "procedures": [
    "1. Nanoparticles (NPs) Labeling of Mesenchymal Stem Cells and Monocytes\nCulture mesenchymal stem cells (MSCs) in Dulbecco's modified Eagle's medium (DMEM) supplemented with 10% fetal bovine serum (FBS) and antibiotics to ≥80% confluency prior to labeling. Similarly, culture THP-1 cells (ATCC) in Roswell Park Memorial Institute (RPMI) 1640 medium supplemented with 10% FBS to a density of ~106 cells/ml.\nLoad silica NPs (~500 µm) with calcein dye solution (200 µM) using overnight stirring. Fabricate PLGA-calcein AM (CAM) using a protocol described previously.22\nDissolve 250 µg CAM and 100 mg PLGA (50:50) in chloroform at 4 °C.\nGenerate single emulsion NPs using a high speed homogenizer (13,600 x g, 60 sec) at room temperature. Evaporate the chloroform in a chemical hood (≥3 hr) before collection using centrifugation (3,400 x g for 5 min), washing (double distilled water), freeze-drying and storage in -20 °C.\nIncubate CAM-PLGA NPs (1 mg) or calcein silica NPs (150 µg) in 0.01% poly-L-lysine (PLL) solution at room temperature for 15 - 20 min.\nCentrifuge at 3,400 x g for 5 min to remove excess PLL supernatant before NPs resuspension in 1 ml of respective culture medium.\nIncubate the NPs with cells (MSCs or THP-1, ~1 - 2 x 106 cells in total) for approximately 24 hr (0.1 mg·ml−1 labeling concentration).\nDissociate and harvest the labeled adherent MSCs using 2 ml of 0.25% trypsin (5 min, 37 °C) and quench with 6 ml of DMEM. Spin down the cells at (1,000 x g, 4 min) and resuspend to a concentration of 105 - 106 cells/ml for microfluidic processing. Use labeled THP-1 cells (105 - 106 cells/ml) directly for microfluidics purification.\n2. Microfluidic Device Preparation\nDevice Fabrication",
    "Fabricate the microfluidic spiral device (500 µm (w) × 115 µm (h)) with polydimethylsiloxane (PDMS) from a commercial kit using standard soft lithography steps.23\nMix 30 g of base prepolymer and 3 g curing agent thoroughly in a weighing boat. De-gas the mixture in a desiccator for 60 min to remove any air bubbles.\nPour the PDMS mixture onto the silicon wafer master mold patterned with the spiral channel design carefully to a height of ~5 - 10 mm.\nDe-gas the mixture in a desiccator vacuum for 60 min again to remove any air bubbles. Repeat the process until all bubbles are eliminated.\nCure the PDMS mixture in an 80 °C oven for 2 hr until the PDMS is set. Ensure the wafer is not tilted during curing to have a constant device height.\nCut out the PDMS spiral device using a scalpel and carefully peel the PDMS slab from the master mold.\nTrim the edges of the device with a scalpel to ensure smooth surface for bonding.\nPunch two holes (1.5 mm) for the inlets and two holes (1.5 mm) for the outlets on the PDMS device using a 1.5 mm biopsy puncher.\nWash the device with isopropanol (IPA) to remove any debris and dry the device in an 80 °C oven for 5 min.\nClean the bottom surface of the PDMS device (with channel features) using masking tape.\nClean one side of a glass slide (2\" by 3\") using masking tape.\nCarefully place and expose the cleaned surfaces of the PDMS device and glass slide in the chamber of a plasma cleaner and subject them to vacuum for 60 sec. Next, switch on the plasma power to maximum and lower the chamber pressure until the chamber turns pink in color.",
    "Expose the surfaces to air plasma for 60 sec. The plasma creates reactive species on the exposed surfaces of the PDMS and glass which enables tight bonding when brought into physical contact. Turn off the plasma power and release the pressure from the plasma cleaner to retrieve the device and glass slide.\nBond the PDMS device and glass slide together by pressing the plasma-exposed surfaces tightly and ensuring that no bubbles are trapped between the two surfaces.\nHeat the bonded device using a hotplate set at 80 °C for 2 hr to strengthen the bonding.\nDevice Operation\nCut two pieces of tubing (1.52 mm OD) of ~15 - 20 cm for the inlet syringes and attach a syringe tip (gauge 23) on one end of each tubing.\nCut two pieces of tubing (1.52 mm OD) of ~5 - 10 cm for the outlets and attach to the outlet holes of the PDMS device.\nPrior to sample running, manually prime the device with a syringe containing 70% ethanol until it flows out of the outlet tubing. Allow the ethanol sit for 30 sec to 1 min to sterilize the device.\nLoad 30 ml of filtered (0.2 µm pore) sheath buffer (Phosphate-Buffered Saline (PBS) with 0.1% Bovine Serum Albumin (BSA)) into the 60 ml syringe and secure the syringe on a syringe pump. Set the pump to the correct settings (Syringe size: 60 ml, Volume: 60,000 µl).\n\t\tNote: The addition of BSA to PBS is to minimize cell-cell binding and non-specific binding between cells and the PDMS device.\nLoad 3 ml of labeled cells into the 3 ml syringe and secure the syringe on a separate syringe pump. Set the pump to the correct settings (Syringe size: 3 ml, Volume: 3,000 µl).",
    "Check that no air bubbles are trapped in the syringes to ensure a stable flow. Remove any air bubbles by gently ejecting few drops of liquid out of the nozzle.\nConnect the inlet syringe tips and tubing to the syringes, and insert them into the respective inlets of the device (sheath and sample inlet). Ensure that there are no bubbles along the tubing.\nMount the devices onto an inverted phase-contrast microscope for real time imaging during cell sorting process.\nSecure a small waste beaker and two 15 ml tubes close to the device on the microscope stage using adhesives.\nPlace the outlet tubings into the waste beaker.\nSet the flow ratio for sample to sheath buffer to 1:10 and start both syringe pumps to initiate the sorting process (Example: 120 µl/min for sample syringe and 1,200 µl/min for sheath syringe; channel flow velocity ~0.38 m/sec).\nRun the device for 1.5 min for the flow rate to stabilize. This can be confirmed by presence of inertially focused cells near the channel inner wall under bright-field with phase contrast using a high-speed camera (~5,000 - 10,000 frames per second (fps), exposure time: 10-50 µsec).\nPosition the outlet tubings into different tubes to collect the eluents from the cell outlet and waste outlet.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}