{
  "id": 15071,
  "origin_website": "Jove",
  "title": "Use of Freeze-thawed Embryos for High-efficiency Production of Genetically Modified Mice",
  "procedures": [
    "All animal care and procedures performed in this study were undertaken according to the rules and regulations of the Guide for the Care and Use of Laboratory Animals. The experimental protocol was approved by the Animal Care Committee of Laboratory Animals of University of Toyama, University of Tokyo, Jichi University, and Max Planck Florida Institute for Neuroscience. Information about all reagents is showed in the Table of Materials.\n1. CRISPR reagents design\ncrRNA design\n\t\nVisit CRISPR direct19 (https://crispr.dbcls.jp/) to design specific crRNAs with reduced off-target sites.\n\t\tNOTE: There are many other useful tools to design the crRNA20 (https://bioinfogp.cnb.csic.es/tools/wereview/crisprtools/).\nInsert the target nucleotide sequence and make the following changes:\n\t\tPAM sequence requirement = NGG\n\t\tSpecificity check = Mouse (Mus musculus) genome, GRCm38/mm10 (Dec, 2011)\n\t\tNOTE: As an example, to generate Tyrosinase (Tyr) knockout mice, exon 2 (nucleotide sequence from 9476–9692) was targeted.\nClick Design, and for highly specific hits, mark Show Highly Specific Target Only.\nTo reduce potential off-target effects, choose the target sequence with the lowest value in the columns of \"12 mer+PAM\" and \"8 mer+PAM\".\n\t\tNOTE: In these columns, (\"1\") indicates that the sequence has only one perfect match with the intended target site and numbers greater than one indicate the presence of potential off-target sites.\nOrder the resulting oligonucleotides from crRNA synthesis companies (Supplimentary Table 1).\n\t\tNOTE: For the exon 2 Tyr gene, the following target sequence was used: GGACCACTATTACGTAATCC, with +TGG as the PAM sequence (Figure 2A).\nSingle strand oligodeoxynucleotide (ssODN) design for HDR-mediated editing experiments (i.e., knock-in mice generation).\n\t\nDesign the ssODN length to be around 80–180 bp including 30–60 nucleotide (nt) homology arms on both sides.\n\t\tNOTE: An ssODN of 75–85 nt length, including a 30–35 nt homology arm and complementary to the gRNA, showed high knock-in editing efficiency21.",
    "Insert the intended modification and silent mutation at the PAM sequence or, if not possible, at the 5′ neighboring base of PAM to block the recutting after genome editing.\n\t\tNOTE: The crRNA and ssODN used in this study are listed in Supplementary Table 1.\n2. In vitro fertilization, embryo cryopreservation, and freeze-thawing\nIn vitro fertilization\n\t\nSuperovulate C57BL/6J female mice (4 or 8-weeks-old) by IP injection with pregnant mare serum gonadotropin (PMSG) followed by injection with 7.5 IU human chorionic gonadotropin (hCG) after 48 h.\n\t\tNOTE: The number of ovulated oocytes can be increased by about 3x using ultra-superovulation22.\nRemove the cauda epididymides from sexually mature C57BL/6J male mice (3–5-months-old).\n\t\tNOTE: It is possible to collect spermatozoa without sacrificing the male mice.\nExtract clots of spermatozoa with a dissecting needle and incubate them in a 200 µL drop of human tubal fluid (HTF) in CO2 incubator for 1.5 h for capacitation.\nCollect cumulus-oocyte complexes (COCs) from the oviducts 16–18 h after the hCG injection and incubate them in a fresh 200 µL drop of HTF medium covered with paraffin liquid in a CO2 incubator (5% CO2, 37 °C) for no more than 2 h.\n\t\tNOTE: It is preferable to sacrifice the mice by cervical dislocation under anesthesia because euthanasia via CO2 inhalation affects IVF and embryo development23.\nAdd 1–5 µL of sperm suspension from the boundary of the incubation medium to the 200 µL drop of HTF medium containing COCs and incubate them in a CO2 incubator for 3 h.\nWash the oocytes with potassium-supplemented simplex optimization medium (KSOM) 3x to remove remaining sperm and cumulus cells.\nCheck the pronuclear formation and the grade of one-cell embryos using an inverted microscope.\nCryopreservation of one-cell embryos",
    "Incubate one-cell embryos in a 200 µL drop of HTF containing 20% FBS (not covered with paraffin liquid) for 10 min in a CO2 incubator.\nTransfer 20–100 embryos to 50 µL of 1 M dimethyl sulfoxide (DMSO) solution24.\nTransfer 5 µL of a solution containing 100 embryos into the bottom of a cryotube and cool for 5 min at 0 °C using a chiller or on ice.\nAdd 45 µL of DAP213 (2 M dimethyl sulfoxide, 1 M acetamide, and 3 M propylene glycol) solution slowly along the tube wall, cap the tubes, and keep for 5 min in a chiller or on ice at 0 °C.\n\t\tNOTE: Do not fasten the caps too tightly to remove them easily during sample thawing.\nStore tubes rapidly in liquid nitrogen.\nEmbryo thawing\n\t\nOpen the lid of the cryotube, discard the remaining liquid nitrogen, and add 900 µL of 0.25 M sucrose solution preheated to 37 °C.\n\t\tNOTE: The 0.25 M sucrose solution must be warmed to 37 °C in advance because the use of cold solution decreases embryo viability after thawing.\nPipet quickly for 10x and transfer the contents of the cryotube into a plastic dish.\n\t\tNOTE: The pipetting should be performed carefully, so that no bubbles are generated and damage the embryos.\nWash the morphologically normal fertilized oocytes 2x in KSOM medium covered with paraffin liquid and keep them in a CO2 incubator until electroporation.\n3. Assembly and electroporation of CRISPR reagents\nNOTE: For electroporation, we used a platinum plate electrode (height: 0.5 mm, length: 10 mm, width: 3 mm, gap: 1 mm) and a one-step type electroporator that were described previously8 (Table of Materials). A two-step type electroporator can be used too (Table of Materials).\nPreparation and assembly of CRISPR reagents",
    "Order CRISPR reagents (i.e., crRNA, tracrRNA, and Cas9 protein) and ssODN if performing HDR-mediated editing experiments (Table of Materials and Supplementary Table 1).\nPrepare the annealing solution as follows.\n\t\t\nPrepare 1 μg/µL crRNA and 1 μg/µL tracrRNA in Reduced-Serum Minimal Essential Medium solution (Table of Materials), and add 6 µL of each solution to 42 µL of the nuclease-free buffer.\nIncubate the mixture in the dry heater at 95 °C for 3 min and cool at RT for 5 min.\nPrepare 1 μg/µL HiFi Cas9 protein diluted in Opti-MEM I and add 6 µL to the previous mixture for a total volume of 60 µL.\nIn performing HDR-mediated editing experiments, add 6 µL of 1 μg/µL ssODN. Because the final volume should be 60 µL, use 36 µL of nuclease-free water in step 3.1.2.1.\n\t\t\tNOTE: The final concentration of crRNA, tracrRNA, Cas9 protein, and ssODN will be 100 ng/µL.\nTransfer up to 100 embryos to 25 µL of the final mixture (RNP complex) in a one hole slide glass and incubate them at 37 °C for 10 min.\nElectroporation\n\t\nFill the electrode gap with 6 µL of the new mixture of CRISPR reagents and add 20–25 embryos to the mixture.\n\t\tNOTE: It is important to avoid any contact between the embryos and the electroporation electrode, which can damage embryos during electrical pulses.\nPerform the electroporation at the following conditions for an one-step type electroporator:\n\t\tVoltage: 25 V, Pulse direction (Pd) +\n\t\tON: 3 ms, OFF: 97 ms\n\t\tRepeats: 5x\n\t\tNOTE: Electroporation should be performed no more than 1 h after thawing to ensure genome editing occurs before the first DNA replication to prevent mosaicism.\nFor a two-step type electroporator, set the conditions as follows:\n\t\tPoring Pulse = 40V, Pd +",
    "ON = 1 or 2.5 ms; Pulse interval = 50 ms\n\t\tRepeats: 4x, Decay 10%\n\t\tTransfer Pulse = 5 or 7V; Pd +/-.\n\t\tON: 50 ms; Pulse interval = 50 ms.\n\t\tRepeats = 5x; Decay = 40%.\n\t\tNOTE: It is important to adjust the volume in order to maintain impedance within the specific range specified by the manufacturer.\nWash the embryos 3x with modified Krebs-Ringer Bicarbonate Buffer 2 (M2) medium followed by two washes with a drop of KSOM medium covered with paraffin liquid.\nIncubate the washed embryos (in KSOM medium) in a CO2 incubator overnight for further transplantation.\n4. Embryo transfer\nPrepare pseudopregnant female mice. Mate ICR female mice (3–6 months) with vasectomized male mice 1 day before the embryo transfer (ET).\n\tNOTE: Mice should be checked the next morning for a copulatory plug. The mice with a plug are considered pseudopregnant and can be used for ET.\nAspirate air and KSOM (without paraffin liquid) in alternate intervals of 2–3 mm into a glass capillary as a marker for successful implantation.\nIntroduce 20–24 embryos into a 200 μL drop of KSOM (without paraffin liquid) and draw 10–12 embryos into the glass capillary for implantation in each oviduct.\nAnesthetize the female mice by isoflurane (inhalation) or an IP injection of a solution combining medetomidine/midazolam/butorphanol (0.3 mg/kg, 4.0 mg/kg, and 5.0 mg/kg respectively). Position the anesthetized mouse on its ventral side on a heating pad. Protect the eyes of the anesthetized mouse with a moisturizing gel.\nShave along the lower part of the dorsal midline and disinfect the area with povidone iodine followed by with 70% ethanol.\nMake a long ~1 cm incision parallel to the dorsal midline.\nTake out the oviduct and place on a sterile plastic drape. Keep it moist using warm sterile saline.",
    "Place the oviduct under the stereoscopic microscope.\nMake a hole into the wall of the oviduct between the infundibulum and ampulla a few millimeters upstream of the ampulla by microspring scissors.\nInsert the tip of the glass capillary containing the embryos into the hole and blow gently into the mouthpiece of the capillary holder to expel the embryos until an air bubble is visible in the ampulla.\n\tNOTE: Transfer between 10–12 embryos per oviduct.\nWithdraw the glass capillary from the oviduct wall and push the reproductive organ gently back into the body cavity.\nRepeat the previous process to introduce the embryos into the other oviduct.\nUpon completing the ET procedure, suture the peritoneum with a simple interrupted suture pattern (5­0, absorbable, braided synthetic sutures) and then the skin with a simple interrupted pattern or a buried subcuticular interrupted stitch pattern (6­0 non­absorbable, monosynthetic sutures).\nKeep the mouse warm on a 37 °C warming plate until it recovers from anesthesia.\nMonitor the health of the animal daily for 7 days after surgery.\n5. Genotyping and sequence analysis\nGenomic DNA extraction\n\tNOTE: We used NucleoSpin tissue DNA extraction kits to extract the genomic DNA from mice ear tissue following the manufacturer’s recommendations.\n\t\nAdd 180 µL of Buffer T1 and 25 µL of Proteinase K solution to the sample and mix by vortexing for 10 s.\nIncubate at 56 °C for 2 h or until complete lysis is obtained. Vortex for 10 s every 30 min of the incubation.\nAdd 200 µL of Buffer B3, vortex vigorously for 30 s, and incubate at 70 °C for 10 min.\nAdd 210 µL of 100% ethanol to the sample and vortex vigorously.\nFor each sample, place one tissue column into a collection tube and apply the sample to the column.",
    "Centrifuge for 1 min at 11,000 x g, discard the flowthrough, and place the column back into the collection tube.\nAdd 500 µL of Buffer BW to wash the sample (1st wash), centrifuge for 1 min at 11,000 x g, discard the flowthrough and place the column back into the collection tube.\nAdd 600 µL of Buffer B5 to the column (2nd wash), centrifuge for 1 min at 11,000 x g, discard the flowthrough, and place the column back into the collection tube.\nCentrifuge the column for 1 min at 11,000 x g to dry the silica membrane and place the NucleoSpin tissue column into a 1.5 mL microcentrifuge tube.\nAdd 100 µL of Buffer BE, incubate at room temperature for 1 min, then centrifuge 1 min at 11,000 x g.\nPCR amplification and purification\n\t\nDesign the primers using the primer3 plus website (https://primer3plus.com/) in order to amplify a 400–500 bp sequence surrounding the targeted locus.\nDesign a new PCR protocol and test it empirically.\nPurify the PCR product to remove the unwanted enzymes, nucleotides, primers, and buffer components. A standard purification method can be used as follows.\n\t\t\nAdd 50 µL of phenol to 50 µL of the PCR products and mix by vortexing.\nCentrifuge for 1 min at 11,000 x g and transfer the upper transparent layer to a new tube.\nAdd 120 µL of 99.5% ethanol and 20 µL of 5 M ammonium acetate and vortex for 30 s.\nKeep at RT for 10 min and centrifuge at 11,000 x g for 10 min.\nDiscard the supernatant and wash the DNA pellet with 1 mL of 70% ethanol.\nDry the pellet at RT for 10 min and dissolve in 10 µL of RNase free water.\n\t\t\tNOTE: PCR column-based purification kits are recommented because phenol is toxic to humans.",
    "Sanger sequencing\n\t\nRun DNA quantification analysis (see Table of Materials) to quantify the purified PCR amplicon.\nSend PCR product(s) and sequencing primer(s) to a sequencing service provider.\nAnalyze the sequence using the available online websites.\n\t\tNOTE: In this study, CRISP-ID25 (http:/crispid.gbiomed.kuleuven.be/) was used for sequence analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}