{
  "id": 18546,
  "origin_website": "Jove",
  "title": "In Vivo and Ex Vivo Approaches to Study Ovarian Cancer Metastatic Colonization of Milky Spot Structures in Peritoneal Adipose",
  "procedures": [
    "All mice were housed, maintained and euthanized according to Institutional Animal Care and Use Committee (IACUC) guidelines and under the supervision of the University of Chicago Animal Resource Center.\n1. Preparing Animals for Experimental Studies\nAllow animals to acclimate to new housing and environment, to recover from potential physiologic effects of transport and handling.\n\tNote: The following technique is applicable to all commercially available strains of mice. The number of animals to be used for an experiment is dependent on the study design and should be done with consultation from a statistician.\n2. Identification and Isolation of Peritoneal Fat Depots.\nEuthanize animals via CO2 overdose and a secondary physical method to confirm death. \nAs harvesting peritoneal fat depots constitutes internal organ removal (secondary method), make a midline incision close to the inguinal papillae through the peritoneal wall to expose the internal organs (Figure 1A).\nFor the Omental Fat (OM), expose the omental/pancreatic complex by extending the spleen from the peritoneal cavity with forceps (Figure 1C). Release omentum from the pancreas and spleen by closely trimming all tissue connections. Ensure that any remaining pancreatic tissue is excised 4.\nFor the Gonadal Fat (GF), use forceps to lift the gonadal fat surrounding the ovaries and excise by cutting tissue connections (Figure 1A upper right) 4.\nFor the Uterine Fat (UF), use forceps to lift the uterine fat surrounding the uterine horns and excise by cutting tissue connections (Figure 1A lower right) 4.\nFor the Mesenteric Fat (MF), cut the junction between the small intestine and the pylorus. Use forceps to firmly grip the free end of the small intestine, and slowly “peel” it away from the mesenteric fat. Release the mesenteric fat from the mesenteric root using dissecting scissors (Figure 1A lower left) 4.",
    "For the Splenoportal Fat (SF), lift the distal end of the spleen using forceps to expose the thin fatty band of tissue connecting the hilum of the spleen to the pancreas. Excise the splenoportal fat by first releasing it from the pancreas, and then carefully dissecting it from the spleen (Figure 1B) 4.\n3. Milky Spot Identification Using Giemsa Staining\nExcise omenta (refer to step 2.3) from C57BL/6 mice and fix in 5% neutral buffered formalin at 4 °C for 16 hr (O/N).\nFor paraffin embedding the fixed tissue, choose a mold that is appropriate for the size of the tissue. Pour molten paraffin from the paraffin reservoir to fill the mold. Open the cassette and using warm forceps, transfer the tissue into the mold.\n\t\nCarefully orient the tissues during paraffin embedding to produce longitudinal sections. Place the labeled tissue cassette over the molding and press firmly in place. Allow the mold to cool for at least 30 min.\nCut serial sections (4 µm thick) from the formalin-fixed paraffin embedded (FFPE) tissue block. Place a precleaned slide under the sections as the ribbon of tissue comes off the paraffin block.\nSerially section the whole omentum; collect and stain every third section for Giemsa stain (refer to 3.6). Allow the glass slide with the sections to air dry, preferably O/N at RT. Dried slides are ready for fixation. Stain the first section for hematoxylin and eosin for comparisons to Giemsa stained slides.\nDeparaffinize the slides by two sequential 5 min incubations in xylenes. Rehydrate slides by two sequential incubations in the following: 100% ethanol, 95% ethanol, and finally tap water.\n\t\nTake adequate precautions to avoid the slides from drying. Perform all steps at RT.",
    "Completely immerse the slides in a Coplin jar containing 5% Giemsa solution (w/v prepared in tap water) and incubate for 4 min at RT. Rinse slides in tap water for 60 sec, air-dry and mount with coverslip using mounting media.\nImage the stained slides using a Whole Slide Scanner and process with manufacturer software. Quantify the milky spot volume in the Giemsa-stained omental sections using ImageJ software4.\n4. Propagation and Preparation of Ovarian Cancer Cells for In vivo and Ex vivo Studies\nPre-warm 15 ml of cell growth medium to 37 °C in a heat bath. Prepare an appropriately sized tissue culture flask (e.g., 75 cm2 surface area) by labeling with name of cell line, passage number, date and person who prepared the frozen stock, and the date and person who is thawing/plating the cells.\n\tNote: In studies of metastasis such detailed information is crucial, as the date of freeze down and passage number can affect the metastatic phenotype.\nUsing the sterile environment of the biological safety hood, pipette 10 ml of medium into the T-75 culture flask. Remove a vial of cells from the liquid nitrogen system and check the label to confirm the cell type. Thaw only one vial of cells at a time by warming in 37 °C heat bath.\nUsing sterile technique, pipette 1x106 thawed cells into the culture flask. Place the flask in the incubator to allow cells to attach. Gently rock the flask back and forth to form a uniform cell suspension.\n\t\nPlace flask in tissue culture incubator and maintain at 37 °C in 5% CO2 environment. Allow cells to adhere O/N.",
    "Aspirate media, and replace with fresh pre-warmed growth media. Place the flask in the incubator and allow cells to grow. Monitor cell growth daily by visual inspection every 2-3 days using an inverted microscope. Use standard cell culture techniques to passage cells upon reaching 70-80% confluence.\n\tNote: For experimental assays harvest the cells at 70% confluence to ensure that cells are actively proliferating.\nAspirate the culture medium and rinse with 10 ml of sterile phosphate buffered saline (PBS). Aspirate PBS and add 0.25% trypsin/EDTA (2 to 3 ml for a 75 cm2 surface area) and incubate 5 min at 37 ºC. Visually confirm that the cells have detached and add an equal volume of growth medium, and gently pipette cells up and down to obtain a single cell suspension.\n\tNote: It is critical that the growth medium contain serum as it inactivates trypsin. Prepare at least 2- to 4-fold more cells than the number required for a given experiment to compensate for loss of cells during subsequent steps\nDetermine the percentage of viable cells in the suspension via trypan blue exclusion assay using a hemacytometer or an automated cell counter.\n\tNote: Here, only use cell preparations in which ≥ 96% of cells are viable.\nTransfer the cell suspension from the flask to a 50 ml conical tube. Pellet cells by centrifuging 5 min at 1,100 x g, at 4 oC.\nAspirate the supernatant and resuspend the cell pellet in PBS to a concentration of 2x106 cells per ml.\n5. Intraperitoneal Injection of Cells",
    "Note: In our experiments, mice are handled in a laminar airflow or biosafety cabinet within our barrier facility in order to limit the risk of pathogen exposure,  In order to demonstrate this technique clearly, the procedures in the accompanying video were conducted in a laboratory approved for animal work. This particular technique does not require the animals to be under anesthesia. Under approved protocols, perform this technique on live animals. Use appropriate strains of mice for this study. For example: use immunocompromised, athymic nude mice for the study of human ovarian cancer cell (SKOV3ip.1, and HeyA8) colonization; use immunocompetent C57BL/6 mice for study of mouse ovarian cancer cells (ID8) colonization.\nLoad 500 µl of the single cell suspension into the syringe and put in the sterile capped 25 G needle. This reduces cell shearing prior to injection.\nPick the mouse up by the scruff of the neck and hold the tail using the palm and forefinger and fix the left hind leg between the ring and little finger (when the mouse is restrained with the left hand).\n\tNote: To avoid traumatizing abdominal organs, restrain the mouse well so that it cannot move during the injection.\nImagine a line across abdomen just above the knees, and locate a point on the animal’s right side and close to the midline. The point of entry is cranial to and slightly medial of the last nipple.\n\tNote: Inserting the needle on the mouse’s right side avoids the cecum and reduces the risk of puncturing the intestines11.\nInsert the needle at the lower lateral region of the mice’s abdomen to a depth of approximately 0.5 cm. Pull back on the plunger to confirm that the needle has not penetrated a blood vessel or other peritoneal organs.",
    "If any fluid is aspirated discard the syringe (and sample)11. A greenish-brown or yellow aspirate indicates needle penetration into the intestines or bladder, respectively.\nInject the sample using slow, steady pressure. Withdraw the needle and return the mouse to its cage. Do not recap syringe before disposal in sharps container.\nSacrifice mice via CO2 asphyxiation and vital organ removal at specific time points post injection.\n6. Milky spot colonization In vivo\nQuantitation of cancer cell localization to milky spots using flow cytometry\n\t\nIsolate peritoneal fat depots from mice (as described in step 2.3 - 2.7) injected with fluorescently tagged cancer cells and immediate place tissues in ice-cold PBS.\n\t\t\nFor this particular technique, weight-match all adipose fat tissues to omentum. Transfer tissues to separate 5 ml tubes containing 1.5 ml of serum-free DMEM and 0.1% (w/v) bovine serum albumin. Pool tissues harvested from three independent mice to ensure a sufficient yield of cells for flow cytometry.\nMince tissues using surgical scissors and add 1.5 ml of serum-free DMEM containing 0.4% (w/v) collagenase I. Incubate the tissue suspension at 37 °C for 30 min with rotational mixing.\n\t\t\nAs an optional step, further disassociate tissue by mastication. In this case, transfer the tissue-collagenase suspension to a microstomacher bag, masticate for 10 min on low, rotating the orientation of the bags after 5 min.\nFilter samples through a nylon mesh filter (60 µm pore) to remove larger debris. Collect cells via centrifugation at 250 x g for 5 min at 4 °C and discard the supernatant fraction.\nResuspend the cell pellet in 100 µl of PBS combined with 900 µl of ACK lysis buffer and incubate at RT for 1 min. Centrifuge cells at 250 x g for 5 min and discard supernatant.",
    "Resuspend the cell pellet in 250 µl of ice-cold PBS. Filter the samples through a 60 µm pore nylon mesh to ensure single cell suspension. Rinse the filter with 250 µl of ice-cold PBS.\nQuantitate the number of fluorescently tagged cells in the population using a flow cytometer equipped with a 561-nm yellow-green laser and a 585 nm/15 nm bandpass filter. Set the gate for tdTomato-positive cells based on analysis of parental cells and/or appropriate negative controls 4.\nQuantitation of microscopic and macroscopic metastases\n\t\nAt the desired experimental endpoint(s), isolate, and immediately place tissues in the appropriate fixation media. Fix larger samples, such as intact gonadal, uterine, and mesenteric fat depots in 10% neutral buffered formalin for 48 hr at 4 °C. Fix smaller samples (omental and splenoportal fat, as well as tissue equivalents of uterine and mesenteric fat) in 5% neutral buffered formalin at 4 °C for 2-16 hr.\n\t\t\nAlternatively, snap freeze tissues by placing them in a freezing medium such as OCT and drop into an appropriate amount of liquid nitrogen.\nTransfer fixed tissues to 70% ethanol and store at 4 °C until embedding in paraffin. Embed and process tissue as described in 3.2 and 3.3.\n\t\t\nUse the H&E stained section to evaluate tissues for the presence or absence of microscopic metastases (i.e., clusters of 50 cells). Confirm the presence of microscopic metastases by a secondary method such as an IHC stain for cytokeratin 8/18 to detect ovarian cancer cells.\n7. Milky Spot Colonization Ex Vivo\nEstablishment of basic ex vivo omental organ culture conditions",
    "Place each omentum into a single culture plate insert and place within one well of a twelve-well tissue culture plate containing 500 µl of DME/F12 media containing 20% FCS. Maintain organ cultures at 37 °C in a 5% CO2 environment for 24 to 48 hr and/or additional time points. Use three independent omenta (triplicate samples) for each condition (e.g., media type/time point).\nTo confirm the integrity of tissues at the experimental endpoints, fix and process samples as described in Step 3. Counting healthy versus necrotic adipocytes on H&E sections can assess tissue integrity. A minimum of ~120 cells from 5 biological samples is required to formulate a percentage of live tissue present10.\nTo measure tissue function, place omenta (n = 3) in separate wells of a 24-well plate containing 500 µl of DME/F12 media with 20% FCS. Allow omenta to condition the media at 37 °C in a 5% CO2 environment for 24 hr, and then remove 250 µl for use in an IL-6 ELISA assay10.\nEx vivo co-culture of the mouse omentum with SKOV3ip.1-GFP cells\n\t\nGrow and prepare fluorescently tagged cells as described in section 4 and resuspend at a concentration of 2 × 106 cells per ml.\nApply ~6 µl of the tissue adhesive to the membrane of the culture insert and allow it to air dry. Wash the membrane twice with sterile water to remove any excessive adhesive. Air dry the membranes under a laminar hood.\nCarefully excise the omenta and attach it to the adhesive-coated membrane using sterile forceps. Allow the tissue to adhere to the membrane for 1 min prior to adding media. Add 500 µl of the cell suspension on top of each omentum in each culture insert. Fill the area around the transwell chamber with 2.5 ml of DME/F-12 10.",
    "Incubate omenta with cell suspension for 6 hr at 37 °C in a 5% CO2 environment. Carefully remove and wash the omenta with ~10 ml of PBS. Visualize fluorescent cancer cell foci using an appropriate fluorescent imaging system 10.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}