{
  "id": 4231,
  "origin_website": "Cell",
  "title": "Purification of GFP-tagged nuclei from frozen livers of INTACT mice for RNA- and ATAC-sequencing",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPulverize frozen liver extracts\nTiming: 3–4 h for 12 tissue preparations\nIn our experience, the best preparations of nuclei from snap-frozen liver samples are obtained by pulverizing the tissue into fine powder before starting the purification of the nuclei.\nIsolation of mouse liver tissues.\nSacrifice the mouse humanely following an approved ethical protocol.\nPin down the mouse and open the abdominal cavity.\nIsolate all liver lobes using scissors and forceps.\nCut the liver lobes into smaller pieces (approx. 5×5 mm) and wash liver pieces in 1× PBS.\nSnap-freeze liver pieces in liquid nitrogen.\nPause point: At this point, liver tissue pieces can be stored at −80°C for later downstream processing allowing for e.g., initial histological assessment of the liver.\nGrinding of liver tissue.\nUnscrew the lid of the grinding jar and pre-chill the jar, lid, and the grinding ball in liquid nitrogen.\nPut the grinding ball back into the jar, add the liver pieces into the jar and close the lid firmly.\nGrind the liver tissue at 30 Hz for 1 min at the Tissuelyser until the tissue is completely pulverized.\nCarefully transfer the pulverized tissue into e.g., a 15 mL conical tube and be sure to scrape of remaining pulverized tissue remnants from the side of the jar and from the grinding ball.\nCritical: It is extremely important that all items are kept very cold during tissue handling. It might be necessary to wear extra protection of your hands due to the handling of these very cold items.",
    "Pause point: At this point, the pulverized tissues can be stored at −80°C for later downstream processing. In order to have sufficient time for performing the following steps (i.e., isolation and purification of GFP-labeled nuclei as well as the first steps in the preparation of the nuclei for sequencing) within a working day, we normally pause the protocol at this point.\nIsolation of nuclei from pulverized liver tissue\nTiming: 2–3 h for 12 nuclei preparations\nThe following steps describe how to purify high-quality nuclei from pulverized liver tissue using a glass dounce homogenizer.\nHomogenize the liver (see troubleshooting 1[href=https://www.wicell.org#sec6.1]).\nPrecool centrifuges to 4°C.\nResuspend ∼0.5 g pulverized tissue in 4 mL ice-cold 1× PBS by tapping e.g., in a 5 mL conical tube.\nNote: If processing livers with high fat content, the nuclei yield per gram of liver will be lower and a greater amount of pulverized liver tissue can be used as starting material. We have tested that the 15 mL douncer can hold up to approx. 1 g of tissue using 8 mL LSB and still perform equally well. However, it is important not to overload the douncer with more than 1 g of pulverized liver (see troubleshooting 1[href=https://www.wicell.org#sec6.1]). Then rather perform multiple rounds of douncing and combine before proceeding with the IP.\nCentrifuge at 2,000×g for 3 min at 4°C.\nRemove supernatant and resuspend pellet in 4 mL LSB.\nTransfer to douncer and dounce 10 times with loose pestle.\nAdd 300 μL of a 5% IGEPAL solution to make the solution ∼0.35% IGEPAL, mix tubes and let stand at 4°C for 3–5 min.\nDounce 5 times more with tight pestle.\nFilter the homogenate through a 100 μm CellTrics filter unit on a 15 mL canonical tube.",
    "Wash the douncer with 1 mL LSB and add through the filter to homogenate in step h.\nSpin filtered homogenate at 600×g for 10 min at 4°C.\nResuspend pellet in 9× volume of HSB. Mix by pipetting.\nAliquot up to 1.8 mL in 2 mL tubes.\nNote: Normally 9× volume equals to 0.9–1.8 mL HSB per sample. If more than 1.8 mL is needed per sample divide the volume into two 2 mL tubes.\nNote: It is recommended to double check that the nuclei pellets have gone completely into suspension. If not, mix samples again by pipetting right before spinning.\nSpin 15 min at 15,000×g at 4°C.\nCarefully remove as much supernatant as possible.\nResuspend pellets in total 1 mL WB, incl. RNasin per sample.\nNote: After pelleting the nuclei in HSB, these might be hard to resuspend and need to be pipetted extensively, but still carefully, for complete resuspension.\nNote: The dense sucrose cushion is recommended to remove debris and provide pure and intact nuclei. To avoid transferring the debris on the tube sides, we recommend resuspending first in 500 μL WB, incl. RNasin, transfer this volume to a new tube and then add additional 500 μL WB, incl. RNasin.\nCritical: Carry out above steps on ice or in a cold room at 4°C.\nInspection and counting the number of whole liver nuclei (see Figures 1[href=https://www.wicell.org#fig1]A and 1B, expected outcomes[href=https://www.wicell.org#expected-outcomes], and troubleshooting 2[href=https://www.wicell.org#sec6.3] and 3[href=https://www.wicell.org#sec6.5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/988-Fig1.jpg\nFigure 1. Nuclei purification from pulverized fresh and frozen liver tissue\n(A and B) Nuclei were isolated from (A) fresh and (B) frozen livers, stained with Trypan blue and investigated using a microscope. Scale bars represent 200 μm.",
    "(C and D) Nuclei were immunoprecipitated using anti-GFP antibody and magnetic Dynabeads, stained with Trypan blue and investigated using a microscope. Scale bars represent 100 μm.\nTake out 10 μL aliquot, dilute it 1:20 in WB and mix 1:1 with Trypan blue.\nInspect and count the nuclei under a brightfield microscope using a 10–20× objective.\nDilute the nuclei suspension to 10 mill nuclei per mL in WB, incl. RNasin.\nCollect 15 mill nuclei (1.5 mL) for IP of hepatocyte nuclei.\nOptional: Collect 1 mill nuclei for whole liver nuclei RNA-seq and 25,000 for whole liver nuclei ATAC-seq and store on ice until further processing. These whole liver nuclei can in the end be used for control purposes, e.g., for determining enrichment/depletion of marker gene expression compared to the bead-bound nuclei by qPCR or RNA-seq.\nCritical: An appropriate counting of the nuclei is important for the downstream processes. We recommend counting nuclei manually using a standard hemocytometer. Alternatively, the nuclei can be counted using an automated cell counter. Since the absolute nuclei numbers often vary between the different methods, it is important to use the same strategy for each experiment.\nNote: Nuclei of high quality will appear round and intact with well-defined edges under the brightfield microscope at 40–60× magnification, whereas nuclei of poor quality lose their intactness and begin to show evidence of membrane blebbing (for examples of nuclei with different quality refer to https://kb.10xgenomics.com/hc/en-us/articles/360020348651-How-can-I-assess-the-quality-of-my-nuclei-for-Single-Cell-ATAC-or-Single-Cell-Multiome-ATAC-GEX-Sequencing-[href=https://kb.10xgenomics.com/hc/en-us/articles/360020348651-How-can-I-assess-the-quality-of-my-nuclei-for-Single-Cell-ATAC-or-Single-Cell-Multiome-ATAC-GEX-Sequencing-]).",
    "Note: For other conditions or types of labeled nuclei, the number of input nuclei can be scaled proportionally to the fraction of GFP+ nuclei. For example, when purifying GFP-labeled myeloid nuclei originating from frozen livers of healthy MAC INTACT mice (consisting of 7%–10% GFP+ nuclei), we used approximately 80 mill whole liver nuclei as input for the IP but kept the reaction volume and amount of antibody and Dynabeads as described below.\nImmunoprecipitation of GFP-labeled nuclei\nTiming: 3–4 h for 12 nuclear preparations\nThe following steps describe how to pull down GFP-labeled nuclei from purified whole liver nuclei.\nWashing of Dynabeads.\nAliquot and wash 100 μL of Protein G Dynabeads (per sample) 2× with 800 μL Wash Buffer in a 2 mL tube on a DynaMag™-2 Magnet.\nOptional: Protein G Dynabeads can also be batch-washed in 15 mL tubes using e.g., a DynaMag™-15 magnet (ThermoFisher Scientific; 12301D). To have enough beads for 12 nuclear preparations, use 1350 μL beads and 12 mL WB.\nResuspend beads in 100 μL per sample of WB, incl. RNasin.\nPipette 20 μL of beads into new 2 mL tube (labeled “Preclear”).\nPre-clearing of nuclei.\nTransfer the nuclei suspension into the preclear tube and mix.\nEnd-to-end rotate at 4°C for 10–15 min.\nIP of GFP-labeled nuclei.\nWhile nuclei sample is preclearing, prepare 2 mL tubes with 3 μg of anti-GFP antibody (i.e., 15 μL) and 200 μL WB, incl. RNasin in each tube.\nPlace precleared sample on magnet for 4–5 min.\nWhile standing on the magnet, pipet the supernatant from the precleared sample into the tube with antibody.\nEnd-to-end rotate at 4°C for 30 min.\nResuspend the remaining 80 μL of washed beads and add to tube with antibody and nuclei.\nEnd-to-end rotate at 4°C for 20 min.\nPlace sample on magnet for 4–5 min.",
    "While standing on the magnet, completely remove the supernatant.\nOptional: the supernatant contains the nuclei that was not captured in the IP reaction (primarily non GFP-labeled nuclei) and can be saved as controls for later analyses. However, from frozen liver tissues this fraction also contains a considerable number of unbound GFP+ nuclei.\nRemove samples from magnet; add 1.8 mL of WB and let sit for 30 s.\nNote: RNasin is omitted from the WB during the washes to reduce costs.\nPipette extensively (but carefully) up and down to resuspend. After initial resuspension, pipette up and down an additional 5 times.\nRepeat step g-j twice.\nFinally take the tube of the magnet, add 1 mL WB, incl. RNasin and let sit over the nuclei for 2 min before resuspending.\nCritical: carry out all steps on ice or in the cold room at 4°C, including the steps involving a magnet or an end-to-end rotator.\nInspection and counting of bead-bound nuclei (see also Figures 1[href=https://www.wicell.org#fig1]C and 1D, expected outcomes[href=https://www.wicell.org#expected-outcomes] and troubleshooting 4[href=https://www.wicell.org#sec6.7]).\nTake out 10 μL aliquot of bead-bound nuclei, dilute it 1:5 in WB and mix 1:1 with Trypan blue.\nCount the number of nuclei using a brightfield microscope using a 10–20× objective.\nCalculate the fraction of recovered nuclei by comparing the number of bead-bound nuclei with the number of whole liver nuclei initially added to the IP reaction (i.e., 15 mill nuclei).\nOptional: Determine purity and yield of GFP+ nuclei (see Figure 2[href=https://www.wicell.org#fig2], expected outcomes[href=https://www.wicell.org#expected-outcomes] and troubleshooting 5[href=https://www.wicell.org#sec6.9])\nAdd 1 μL DAPI to a 10 μL aliquot of bead-bound and whole liver nuclei (diluted to approx. 7500 nuclei / μL)\nCount 100–200 nuclei with a fluorescence microscope equipped with appropriate filters for detecting GFP and DAPI using a 10–20× objective.",
    "Quantify the number of bead-bound GFP+ nuclei vs. DAPI-stained nuclei in both samples.\nDetermine the purity by considering the fraction of GFP+ nuclei vs total DAPI-stained nuclei in the bead-bound sample.\nTo determine the yield, compare the actual number of recovered GFP+ nuclei with the expected number of recovered GFP+ nuclei, which can be calculated as follows: Expected # of GFP+ nuclei = Total # of nuclei added to IP x % GFP+ nuclei in the original whole liver sample.\nNote: The unbound Dynabeads will result in some green auto fluorescence; however, since the beads are much smaller than the complexes of nuclei and beads, these should be easily distinguishable when counting.\nNote: If handling a larger number of nuclei preparations, the easier option for determining purity and yield will be to take some images using the fluorescence microscope coupled to a computer and do the quantification with e.g., ImageJ (https://imagej.nih.gov/ij/download.html[href=https://imagej.nih.gov/ij/download.html]) at a later time point.\nPause point: At this point, it is possible to save (extra) nuclei for later processing or alternative applications by using a slow-freezing protocol. For further details, please refer to Corces et al., 2019[href=https://www.wicell.org#bib3]; Corces et al., 2017[href=https://www.wicell.org#bib4], which describe how purified nuclei can be frozen and subsequently used for ATAC-seq and other downstream applications without adversely affecting data quality. However, for the current protocol, we recommend continuing with the procedure until nuclei are stored in TRIzol (for RNA analyses), in NUN buffer (for protein analyses) or until the transposition reaction followed by the DNA purification has been performed (for ATAC-seq analyses).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/988-Fig2.jpg\nFigure 2. GFP+ nuclei detection in whole liver and bead-bound nuclei preparations",
    "(A and B) Whole liver and (C and D) bead-bound nuclei were isolated from frozen livers, stained with DAPI and subsequently (A and C) DAPI and (B and D) GFP signals were investigated using a fluorescence microscope. Scale bars represent 100 μm.\nDownstream applications\nIn the following sections we describe three different downstream applications for the purified nuclei. The different procedures can be performed independently, and in any order. However, since the procedure for preparation of nuclei for RNA-seq has a safe pause point at an early step in the procedure, we normally begin with this procedure.\nPrepare nuclei for RNA-seq\nTiming: ∼20 min until nuclei are stored in TRIzol, 2–3h for 12 complete RNA purifications, and 1 additional day if preparing RNA for sequencing\nThe following steps describe how to isolate high-quality RNA from bead-bound and whole liver nuclei.\nHarvest nuclei for RNA isolation.\nWhole liver nuclei.\nSpin down 1 mill nuclei at 600×g for 5 min at 4°C.\nRemove supernatant and leave 20–30 μL WB, incl. RNasin behind to resuspend pellet again.\nVortex nuclei to resuspend, add 500 μL of TRIzol and vortex until nuclei are completely dissolved.\nFor bead-bound nuclei.\nTake a volume out corresponding to 1 mill nuclei.\nUse a magnet to remove supernatant leaving 20–30 μL WB, incl. RNasin behind to resuspend pellet again.\nCritical: Failure to properly resuspend the nuclei pellet will cause nuclei to remain aggregated when adding TRIzol.\nBriefly spin down to collect nuclei and WB in the bottom of the tube.\nFor one tube at a time vortex, immediately add 500 μL of TRIzol and vortex until completely dissolved\nRNA column purification procedure\nAdd 0.2 volume (100 μL) of chloroform and vortex vigorously for 30 s to mix phases.",
    "Incubate 15 min at 20°C–25°C and spin at 10,000×g for 10 min at 4°C.\nTransfer the upper phase (approx. 200 μL) to a 1.5 mL tube and place on ice.\nCritical: Do not touch the interphase!\nAdd 0.6 volume (120 μL) 96% ethanol, briefly vortex, and briefly spin down.\nLoad the indicated volume onto an EconoSpin microcolumn, spin 13.000×g for 30 s at 20°C–25°C.\nNote: Close the lid on the column gently.\nWash the column once with 500 μL diluted RPE buffer at 20°C–25°C. Spin at 13,000×g for 30 s at 20°C–25°C and discard the flow through.\nCritical: Confirm that ethanol has been added to the RPE buffer before use.\nNote: A multistep pipette can be used if handling multiple samples.\nMake a DNase I mix, by combining 10 μL DNase I stock solution with 70 μL Buffer RDD. Mix by gently inverting the tube and shortly spin down the tube before use.\nNote: It is possible to prepare a DNase mastermix if multiple samples are processed.\nAdd the DNase I mix (80 μL) directly to the microcolumn membrane, and place on the benchtop (20°C–30°C) for 15 min.\nAdd 500 μL diluted RPE buffer to the microcolumn with the DNase I incubation mix. Close the lid gently, and centrifuge at 13,000×g for 30 s at 20°C–25°C to wash the spin column membrane free of DNaseI.\nDiscard the flow-through and collection tube.\nPlace the microcolumn in a new 2 mL collection tube and wash the microcolumn one additional time with 500 μL diluted RPE buffer.\nSpin at 13,000×g for 30 s at 20°C–25°C and discard the flow through.\nPlace the microcolumn back in the collection tube and spin dry at 13,000×g for 2 min at 20°C–25°C.",
    "Transfer the column to a new 1.5 mL tube and incubate the column with lid open for 5–10 min at 20°C–25°C to completely evaporate residual ethanol.\nCritical: Be careful not to touch the sides of the microcolumn while transferring the column between tubes!\nElute in 16 μL RNAse-free water by adding to the center of the column and incubate for 2 min at 20°C–25°C.\nSpin at 9,000×g for 2 min at 20°C–25°C and collect eluate.\nNote: If lid breaks, transfer the eluate to a new 1.5 mL tube.\nPause point: Proceed for downstream applications or store at −80°C.\nMeasure RNA concentration\nMeasure the RNA concentration and quality on 1 μL of sample on the Nanodrop.\nNote: The ratios A260/A280 and A260/A230 should be ≥ 1.8 and ideally ≥2.\nNote: If 1 mill nuclei are used for the RNA-analyses, the expected RNA concentrations are >50 ng/μL. A lower number of nuclei can be used for RNA analyses depending on the downstream purposes.\nOptional: Determine RNA integrity.\nIt is normally recommended to measure the quality of the RNA e.g., using the RNA integrity number (RIN) computed by the Bioanalyzer. However, since the RIN score is based on the ratio of the 18S to 28S ribosomal RNA molecules this is not a suitable measure for nuclear RNA. In fact, we usually obtained RIN scores around 2–3 for the nuclear RNA, which still performed impeccably in the RNA sequencing preparations. Instead, we used the Bioanalyzer profiles to manual inspect the RNA integrity, since we observed a clear difference in the amount of degraded RNA with the presence of RNasin in the buffers (Figures 3[href=https://www.wicell.org#fig3]A and 3B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/988-Fig3.jpg\nFigure 3. RNasin in INTACT buffers prevents degradation of nuclear RNA",
    "Nuclei were isolated and immunoprecipitated without or with the presence of RNasin in the buffers, as indicated in the protocol. RNA was subsequently column-purified, and RNA integrity was assayed using a Bioanalyzer 2100.\n(A) When RNasin was not added to the buffers, the bioanalyzer run showed traces of highly fragmented RNA.\n(B) When RNasin was added to the buffers, the RNA became less degraded. Note that peaks corresponding to 18S and 28S rRNA fragments are absent from the nuclear RNA trace and therefore the RNA integrity score is not a reliable measure for assessing quality of nuclear RNA.\nPrepare RNA for sequencing\n100–200 ng of RNA can be prepared for sequencing using the VAHTS Stranded mRNA-seq Library Kit for Illumina according to the manufacture’s recommendations (https://v4.cecdn.yun300.cn/100001_2005225118%2FNR602.pdf[href=https://v4.cecdn.yun300.cn/100001_2005225118%2FNR602.pdf]), except that no enrichment of mRNA was performed. Instead, 5 μL of (diluted) RNA was added directly to 13.5 μL of Frag/Prime Buffer (1.13 in the original manual) to fragment the RNA before proceeding with the cDNA synthesis.\nNote: A lot of manufacturers offer kits for preparation of RNA for sequencing and can be used as alternatives here.\nPrepare nuclei for ATAC-seq\nTiming: 2 h for 12 transpositions reactions, 1 additional day if preparing genomic DNA for sequencing.\nThe following steps describe how to perform a Tn5 transposase reaction (Buenrostro et al., 2015[href=https://www.wicell.org#bib1]) on purified bead-bound and whole liver nuclei and subsequently prepare the DNA for sequencing. In the following, we enrich specifically for DNA fragments in nucleosome-free regions (NFR) since we are particularly focused on the accessible regions and transcription factor binding events in these regions. If also interested in mono-, di- and multi-nucleosome fragments the protocol should be adjusted accordingly.\nPerform transposition reaction.\nThaw 5× TTBL from the TruePrep DNA Library Prep Kit V2 at 20°C–25°C. Mix by inverting.",
    "For whole liver nuclei.\nSpin down 25,000 nuclei at 600×g for 5 min at 4°C.\nRemove supernatant completely.\nFor bead-bound nuclei.\nTake a volume out corresponding to 25,000 nuclei.\nUse a magnet to remove supernatant completely.\nPrepare a transposition reaction mastermix (50 μL per sample):\ntable:files/protocols_protocol_988_6.csv\nResuspend the nuclear pellet directly in the transposition reaction mixture by gently pipetting for 20 times.\nPut the tube in the thermal block at 37°C for 30 min at 1000×rpm with heat lid on at 105°C.\nPurify DNA fragment\nAdd 5 volumes (250 μL) of Buffer ERC and 5 μL Na-acetate (3 M, pH = 5.2) from the MinElute Reaction Cleanup Kit to the transposition reaction mix.\nCritical: Check that the color of the mixture is yellow similar to the Buffer ERC.\nMix by vortexing and incubate for 5 min at 20°C–25°C.\nTransfer the cleaned-up reaction mix by:\nFor bead-bound nuclei, place mixture on the magnet and transfer supernatant to a MinElute column.\nFor whole liver nuclei, transfer the whole reaction mix to a MinElute column.\nProceed with Qiagen MinElute Reaction Cleanup according to manufactures recommendations (https://www.qiagen.com/us/resources/download.aspx?id=8f6b09b2-6dcd-4b55-bb4a-255ede40ca3b&lang=en[href=https://www.qiagen.com/us/resources/download.aspx?id=8f6b09b2-6dcd-4b55-bb4a-255ede40ca3b&lang=en]) and elute DNA in 21 μL elution buffer.\nPause point: The samples can be stored at −20°C until ready for amplification.\nNote: The transposition reaction reagents from Vazyme are not compatible with the OMNI ATAC reagents described in (Corces et al., 2017[href=https://www.wicell.org#bib4]).\nPCR Enrichment and purification\nPlace the sterile PCR tube on ice and add each component in order:\ntable:files/protocols_protocol_988_7.csv\nNote: The TruePrep Index Kit from Vazyme provides 8 kinds of N5XX and 12 kinds of N7XX. Choose according to the number of samples and strategy of Index selection. Due to adaptor hopping, unique combinations of N5XX and N7XX should be selected for each sample, if possible.",
    "Note: We recommend running the sample index PCR step using only half of the transposed DNA sample volume. The remaining sample volume can be stored at −20°C up to a month and may be used for another round of sample index PCR if necessary.\nPlace the PCR tube in the PCR instrument.\nSet heat lid on (105°C) and run the PCR as follows:\ntable:files/protocols_protocol_988_8.csv\nNote: For most preparations, 11 cycles of PCR are sufficient. If there is not sufficient DNA for sequencing, use the other half of the transposed DNA volume to perform another round of sample index PCR with more cycles.\nPerform cleanup of libraries after the PCR using MinElute PCR Purification Kit according to the manufacturer’s recommendations (https://www.qiagen.com/us/resources/download.aspx?id=8f6b09b2-6dcd-4b55-bb4a-255ede40ca3b&lang=en[href=https://www.qiagen.com/us/resources/download.aspx?id=8f6b09b2-6dcd-4b55-bb4a-255ede40ca3b&lang=en]) and elute in 21 μL elution buffer.\nCritical: Use different reagents for pre- and post-amplification samples and consider working in designated pre- and post-amplification areas to avoid contamination with amplified PCR-products.\nExamine PCR libraries and perform size fractionation of pooled libraries.\nRun 1 μL of each library (diluted 1:3 in water) using the High Sensitivity DNA kit according to the manufacturer’s recommendations (https://www.agilent.com/cs/library/usermanuals/Public/G2938-90321_SensitivityDNA_KG_EN.pdf[href=https://www.agilent.com/cs/library/usermanuals/Public/G2938-90321_SensitivityDNA_KG_EN.pdf]) (Figures 4[href=https://www.wicell.org#fig4]A and 4B and troubleshooting 6[href=https://www.wicell.org#sec6.11]).\nEstimate the molarity of each library in the desired size range and pool samples for sequencing.\nFill up the volume to a total 50 μL with nuclease-free water before the next step.\nMix AMPure® XP beads by vortexing and add 32.5 μL (0.65×) of beads to the purified PCR products (50 μL). Mix thoroughly by gently pipetting for 10 times and incubate at 20°C–25°C for 5 min.\nPlace the reaction tube on the magnetic stand after a brief centrifugation. Let the tube rest until the solution completely clarifies (around 5 min)\nTransfer the supernatant carefully to a new tube and discard the beads.",
    "Mix AMPure® XP beads by vortexing and add 55 μL (1.1×) of beads to the supernatant. Mix thoroughly by gently pipetting for 10 times and incubate at 20°C–25°C for 5 min.\nPlace the reaction tube on the magnetic stand after a brief centrifugation. Let the tube rest until the solution completely clarifies\nRemove the supernatant carefully and store the beads.\nAdd 200 μL of fresh prepared 80% ethanol to wash the beads. Incubate at 20°C–25°C for 30 s and discard the supernatant. Repeat for a total of two washes.\nOpen the tube lid and air-dry the beads at 20°C–25°C for 5 min.\nCritical: Do not overdry the beads.\nNote: Keep the tube on the magnetic stand while washing and air-drying\nRemove the tube from magnetic stand and add 20 μL of nuclease-free water to elute the DNA. Mix by vortexing or gently pipetting.\nPlace the reaction tube in the magnetic frame after a brief centrifugation. Let the tube rest until the solution completely clarifies.\nCarefully remove 18 μL of supernatant to a new tube\nPause point: The size selected libraries can be stored at −20°C until ready for library quality control.\nRun 1 μL of the pooled size selected library (diluted 1:3 in H2O) using the High Sensitivity DNA kit according to the manufacturer’s recommendations (https://www.agilent.com/cs/library/usermanuals/Public/G2938-90321_SensitivityDNA_KG_EN.pdf[href=https://www.agilent.com/cs/library/usermanuals/Public/G2938-90321_SensitivityDNA_KG_EN.pdf]) and estimate the molarity (Figures 4[href=https://www.wicell.org#fig4]C and 4D).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/988-Fig4.jpg\nFigure 4. Optimal and suboptimal ATAC-seq libraries",
    "ATAC-seq library quality and quantity were assayed using a Bioanalyzer 2100 (A and B) on the individual libraries after the PCR and initial clean up and (C and D) on the pooled libraries after size fractionation. The peaks of the DNA trace display the periodicity of the chromatin structure representing nucleosome-free regions (NFR), as well as mono-, di-, and multi-nucleosome fragments. (A and B) Examples of DNA traces where (A) a high number of DNA fragments are present in the peak corresponding to the NFR and (B) most DNA represents multi-nucleosome fragments. (C and D) Following pooling of individual libraries and subsequent size fractionation, a further enrichment of DNA fragments in NFR can be achieved, even for suboptimal libraries as observed in B (see also troubleshooting 6[href=https://www.wicell.org#sec6.11]).\nPrepare nuclei for protein analyses\nTiming: 2–3 h for 12 preparations\nHarvest of protein.\nSpin down 2 mill nuclei at 600×g for 5 min (whole liver nuclei) or use a magnet (bead-bound nuclei).\nCompletely remove all the supernatant.\nResuspend pellet in 20 μL WB, then add an equal volume of 20 μL NUN extraction buffer and pipet extensively up and down.\nNote: After 3–4 rounds of pipetting the solution starts to clump.\nVortex, spin down shortly and incubate on ice for 20 min.\nSpin 10 min at 21,000×g at 4°C.\nTransfer supernatant to a new tube.\nTake a small aliquot out for determination of the protein concentration.\nPause point: The nuclear extracts can be stored at −80°C until ready for downstream applications.\nDetermine nuclear protein concentration using e.g., the BCA Protein Assay Kit according to the manufacturer’s recommendations (https://assets.thermofisher.com/TFS-Assets/LSG/manuals/MAN0011430_Pierce_BCA_Protein_Asy_UG.pdf[href=https://assets.thermofisher.com/TFS-Assets/LSG/manuals/MAN0011430_Pierce_BCA_Protein_Asy_UG.pdf]).",
    "Note: 2 mill hepatocyte nuclei yield around 40 μg protein using this procedure and therefore the expected protein concentration should be around 1 μg/μL. If more protein is needed for the downstream applications, the number of input nuclei should be adjusted accordingly."
  ],
  "subjectAreas": [
    "Genomics",
    "Rnaseq",
    "Cell Separation/Fractionation",
    "Cell Isolation",
    "Cell Biology",
    "Molecular Biology",
    "Sequencing"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}