{
  "id": 4790,
  "origin_website": "Bio",
  "title": "Expression and Partial Purification of His-tagged Proteins in a Plant System",
  "procedures": [
    "Plant growth conditionsThe preparation of N. benthamiana plants is a key step in obtaining satisfactory protein expression; plants should be as vigorous as possible to help in their recovery after infiltration and consequent protein production. In this protocol ~6 week old N. benthamiana plants are used for Agrobacterium tumefaciens infiltration.Grow plants at 26 °C under long-day conditions (16 h light/8 h dark) with 170-190 µmol m-2 s-1 light intensity and optimal humidity of 70%.Sow seeds in water-soaked soil mix (Promix HP mycorrhizae; 400 ml pots; Video 1) and grow for 2 weeks before transplanting to final destination pots (400 ml).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Detailed description of the procedures for sowing seeds (0 sec), transplanting seedlings (50 sec) and performing the vacuum infiltration (1 min 45 sec) Transplant seedlings carefully to preserve as much of the root as possible (Video 1). After transplantation fertilize once with Miracle Grow All-purpose Plant Food (Scotts) according to manufacturer’s recommendation and water as needed. These pots should be grown for another 4 weeks until they are ready for transformation. During the first week of growth young seedlings are kept covered. Multiple fertilization rounds at this stage can cause excessive growth which will produce plants that are too big for infiltration. It can also increase overlap between pots in the trays which will generate problems in the manipulation of the material. Starting at the fifth week it is particularly important to monitor plant development in order to plan for the infiltration procedure. Ideally plants will have 4-5 fully expanded leaves ~7 cm in diameter at 5-6 weeks for infiltration (Video 1). When ready for infiltration, if possible, transport plants a few hours in advance to the work site and spray the leaves with abundant water, keeping the plants covered to prevent leaf wilting.",
    "Constructs, Agrobacterium cultures and vacuum infiltrationThe proteins of interest described in this protocol were tagged with 6 histidines at their C- terminus. This construct was cloned into the pART27 binary vector under the control of the 35S promoter (Gleave, 1992). Vectors were transformed into the Agrobacterium strain GV3101 for N. benthamiana transient transformation.Agrobacterium preparationAgrobacterium cultures (construct of interest, empty vector and P19) should be started from fresh colonies or glycerol stocks in LB media supplemented with appropriate antibiotics and cultured at 30 °C and 230 rpm. Volumes of at least 200 ml should be used and cultured until reaching OD600 of 1-2 (~ 48 h).When cultures present increased turbidity, measure OD600 and calculate the necessary dilution so that a final volume of at least 250 ml of OD600 0.7 will be obtained in infiltration buffer for each construct. If necessary allow cultures to grow longer to reach the required amount of cells. When co-infiltrating with P19, a suppressor of gene silencing (Voinnet et al., 2003), the final calculated OD600 of each individual construct should be at least 0.7 (total OD600 will be the sum of both individual ODs). Ideally the final OD600 ratio between construct of interest and P19 should be of 0.7:1.Spin down cells at 22 °C and 5,000 x g for 10 min.Discard LB media supernatant by decanting, eliminating as much of the supernatant as possible.Resuspend cell pellet using infiltration buffer.Add 500 µl of acetosyringone (4'-Hydroxy-3',5'-dimethoxyacetophenone; 150 mM in DMSO) for every 500 ml of suspended cells in infiltration buffer.Incubate bacteria for 3-4 h at room temperature before infiltration.Vacuum infiltration procedure (see Video 1 for details on this section)Cover the top part of the N. benthamiana pots with aluminum foil.",
    "This is to prevent excessive soil loss during the procedure and to keep infiltration buffer as clean as possible, for multiple infiltrations. A square sheet of foil, larger than the plant pot, slit from one of the sides to the center makes an easy to use, disposable cover.Place the infiltration buffer with cells in a beaker or container that will allow full immersion of the N. benthamiana leaves when dipped. Dip the plant aerial part into the cell suspension making sure all the leaves are immersed in the infiltration buffer. Be careful not to break petioles or damage the plant.Place beaker with plant in a vacuum chamber or desiccator capable of tolerating vacuum pressures. Depending on the size of the container available, multiple plants can be infiltrated simultaneously.Use a vacuum pump strong enough to produce a vacuum that will pull most of the gas out of the leaves (at least 90 kPa). When vacuum is applied gas bubbles can be observed coming out of the leaves. For every infiltration apply vacuum for 3 min, releasing the vacuum gently, and repeat operation for a total of three times.Remove the plants from the infiltration buffer. Leaves that were successfully infiltrated should have a translucent or water-soaked appearance. Remove any leaves that were not successfully infiltrated. Leaves that were not fully submerged usually don’t infiltrate very well.Place plants in a covered tray with plenty of water at the bottom. Return plants to growth chambers.Remove covers from trays 24-48 h after infiltration, according to how well plants recovered.Protein extraction and partial purificationThe partial protein purification described here is based on the affinity of the 6x histidine C-terminal tag to nickel-containing resins. The affinity is based on the charges of the two mentioned groups.",
    "In plants, this approach has proven to be useful; however it is difficult to obtain pure preparations of the protein of interest using this technique alone. The method described here is able to enrich for the protein of interest but does not produce completely pure fractions. For this reason an “empty vector” protein extraction should be done in parallel to ensure that every downstream experiment using the partially purified protein has a proper negative control.Protein ExtractionIn 3-5 days harvest N. benthamiana leaves for protein extraction by flash-freezing them in liquid nitrogen. Depending on the protein being expressed, shorter incubation periods after infiltration could be attempted.Pre-grind leaves (empty vector control and construct of interest co-transformed with P19) in a mortar and pestle with liquid nitrogen. This powder can be stored at -80 °C. Pre-grinding can facilitate further processing for protein extraction.Add 3 metal beads (2.38 mm) to a 2 ml tube. Without allowing pre-ground leaves to thaw (work on dry ice and in a cold room if available), place ~ 1 ml of ground material into a 2 ml tube. This volume can be scaled up proportionally if necessary.Using a bead beater (Retsch ball mill) grind material frozen in liquid nitrogen for 2.5 min, at 25 Hz. To 1 ml of extraction buffer add 10 μl of 100x Halt™ Protease Inhibitor Cocktail (0.99x) and 0.14 μl of β-mercaptoethanol (1.98 mM) (final concentrations of 49.5 mM sodium phosphate, 0.99 M NaCl and 9.9 mM imidazole).Incubate at 4 °C with gentle agitation for 1 h. Use rotating agitator, or similar device that allows the buffer to move in the tube and completely mix the sample.After one hour remove metal beads with a magnet, always keeping samples on ice.Pellet plant debris by centrifugation at 4 °C and 20,800 x g for 10 min.",
    "Collect ~ 1.1 ml of supernatant into a new 2 ml tube.Centrifuge again at 4 °C and 20,800 x g for 10 min, to pellet any carryover leaf debris.Collect 1 ml of supernatant and transfer to a fresh tube. Depending on the volume being processed it can be a 2 ml tube or larger. Always keep samples on ice.Measure protein content of the collected supernatant using Bradford assay (Bio-Rad Protein Assay Dye reagent concentrate). It is recommended to use a 96 well plate format with a bovine serum albumin standard curve. The protein measurement here is important to normalize the amount of protein loading onto the affinity beads, 2-3 mg of total protein/ml should be expected. At this stage protein crude extracts can be tested for the presence of the protein of interest using immunoblotting techniques (westerns or dot blots). This is recommended when setting up conditions for protein expression.Nickel NTA bead preparationRe-suspend Ni-NTA beads and collect 100 µl into a 1.5 ml tube (50 µl of resin, resin usually compose half the volume of the product).Spin down at 500 x g for 1 min and remove supernatant.Wash 3 times with 500 µl extraction buffer, using same centrifugation conditions described above. Final suspension is done in 500 µl extraction buffer.After washes add 10 µl of resin (110 µl of suspension) to every 1 ml of crude protein supernatant.Partial protein purificationIncubate for 1 h at 4 °C under gentle agitation to allow tagged proteins to bind to the Ni-NTA beads. During this time undesired precipitation of proteins may occur, in this case an alternative procedure is to bind the tagged proteins to the resin by running the supernatant multiple times through a column containing the beads instead of the batch procedure described.",
    "Spin down to collect beads at 4 °C and 500 x g for 1 min. The beads will form a pellet on the bottom of the tube.Collect 250 µl of beads and supernatant and place into a small spin column for table top centrifuge with a 2 ml collection tube. Any column that will fit in an Eppendorf-like tube can be used here, since its purpose is just to serve as a support for the Ni-NTA beads. Column material used shouldn’t bind proteins. This step greatly facilitates the procedure and speeds up the washes and elution steps.Spin down at 4 °C and 500 x g for 1 min.Wash beads 5 times with 250 µl extraction buffer + protease inhibitors and β-mercaptoethanol (see step C1f). The wash consists of adding the referred volume and discarding the flow through after centrifugation (4 °C and 500 x g for 1 min). Alternatively flow through of the washes can be kept to monitor the presence of the protein of interest using immunoblotting techniques.Wash 4 times with 200 µl washing buffer Elute 6 times in 50 µl of elution Buffer into a fresh tube.Place elution fraction (~ 300 µl) in a 500 µl Vivaspin Column (MWCO of 5,000) for buffer exchange. In this case buffer exchange was necessary due to incompatibility of imidazole and downstream assays, this procedure might not always be necessary.Spin down at 4 °C and 20,800 x g for 5 min and add 300 µl of 50 mM ammonium formate (pH 4.5) to ~100 µl of sample (4 times dilution, each time). Repeat the procedure for a total of 4 times resulting in the recovery of 200 µl of material containing less than 1 mM imidazole. The protein concentration yield is approximately 0.",
    "025 mg/ml for every 1 ml of plant tissue starting material."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}