{
  "id": 18649,
  "origin_website": "Jove",
  "title": "Glutamate and Hypoxia as a Stress Model for the Isolated Perfused Vertebrate Retina",
  "procedures": [
    "1. Preparation of Bovine Eyes\nObtain bovine eyes directly after the animal is slaughtered.\nTransport the protected eyes in “Sickel-solution” a special medium containing 120 mM NaCl, 2 mM KCl, 0.1 mM MgCl2, 0.15 mM CaCl2, 1.5 mM NaH2PO4, 13.5 mM Na2HPO4 and 5 mM glucose at RT.\nPerform the preparation of the retina under dark adapted conditions with a dim red light.\nRemove the anterior part of the eye. Perform an equatorial incision ca. 4 mm posterior to the limbus. Thereafter remove cornea, iris, ciliary body and lens in one piece. Keep the retinas in Sickel-solution.\nMechanically loosen the vitreous attachments to the retinal surface and remove the vitreous from the open eye cup.\nAfterwards divide the eye into four quadrants and punch out round areas of ca. 7 mm diameter using a trephine.\nGently separate the retina from the pigment epithelium and place it on a recording device inside a box protected from light. The recording device consists of a plastic maintainer with a mesh in the middle; place the retina on the mesh and then fix with a plastic ring directly on the electrodes.\n\tNOTE: The plastic maintainer has two channels to allow a constant flow of the medium.\n2. Recording the Electroretinogram (ERG)\nIn order to record the electroretinogram, use two silver/silver-chloride electrodes on either side of the retina and perfuse the retina at a constant perfusion velocity of ca. 1 ml/min and constant temperature of 37 °C. Use the “Sickel-solution” saturated with oxygen.\nBefore starting the measurement, dark adapt the retina (protect it from light during all measurements) and use stimulus intervals of five min. Use a 1 Hz single white xenon flash for stimulation with an intensity set to 6.3 mlx at the retinal surface.",
    "Use calibrated neutral density filters and a light stimulus of 10 µsec controlled by a timer in order to have optimal responses.\nTo measure and process the data, filter the ERG and amplify it (100 Hz high pass filter, 50 Hz notch filter, 100,000 x amplification) using a Grass RPS312RM Amplifier. Try to filter out possible disturbing frequencies that may disturb the signal. In order to process the data, use an analog-to-digital data acquisition board on a desktop computer (PC compatible).\nAfter the dark adaptation period under constant perfusion, measure the amplitudes of the electrical signal until stable b-wave amplitudes are recorded.\n\tNOTE: Amplitudes are considered stable if five single measurements reach a mean value and deviate less than 10%. A good example of single measurements is given in Figure 1.\nTo start the testing, replace pure oxygen by either pure nitrogen (number of single experiments, n = 5) to test for hypoxia or 250 µm glutamate (n = 5).\nRecord the electrical responses every 5 min for 45 min.\nAfter the testing period, perfuse the retinas with standard medium saturated with oxygen for 75 min and look at the changes of the b-wave amplitude. This is the washout phase. Measure the b-wave amplitude from the trough of the a-wave to the peak of the b-wave.\nTo investigate the effect of hypoxia or glutamate on the photoreceptor potential under scotopic conditions, suppress the b-wave by adding 1 mM to the nutrient solution.\nAfter recording a stable photoreceptor potential for 30 min, carry out the procedure as before, exposing the retinas 45 min to the different irrigation solutions with 1 mM aspartate. Use the same washout period (step 2.8) as mentioned earlier.\n3. Data Analysis",
    "In order to statistically evaluate the data, ensure a normal distribution for all data, e.g. using the Kolmogorov-Smirnov test15.\nCalculate the reduction of the a- and b-wave amplitudes in percentages after the exposure phase in comparison to the last measurement before the exposition. Compare the reduction of the ERG-amplitudes after 45 min – at the end of the exposition period – to ERG measured before application.\nCompare the a- and b- wave at the end of the washout phase to the corresponding amplitude before exposition to examine a possible recovery.\nFor statistical analysis, use the software JMP statistical software or SPSS software. Calculate data throughout as the mean ± standard deviation. Estimate significance by the appropriate statistical test.\n\tNOTE: These tests might be different depending on the experimental scope. In this setting, use the Student’s paired t-test.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}