{
  "id": 6577,
  "origin_website": "Bio",
  "title": "Genotyping of the OATP1B1 c. 521 T>C Polymorphism from the Formalin-Fixed Paraffin-Embedded (FFPE) Tissue Specimens: An Optimized Protocol",
  "procedures": [
    "Extraction of DNA from formalin-fixed, paraffin-embedded (FFPE) liver tissue using FFPE DNA Isolation Kit #D3067 (Zymo Research, Irvine, CA)Preparation of buffersPrepare buffers according to the manufacturer’s instructions (Quick-DNATM FFPE Kit[href=https://files.zymoresearch.com/protocols/_d3067_quick-dna_ffpe_miniprep.pdf]).Add 260 μl of Proteinase K Storage Buffer to Proteinase K included in the kit to reconstitute lyophilized Proteinase K to a final concentration of 20 mg/ml. Vortex the solution and store at -20 °C.Add 48 ml of 100% ethanol to 12 ml of the Genomic DNA Wash 2 concentrate.Resuspend lyophilized RNase A in 300 μl ddH2O to a final concentration of 6.66 mg/ml and store at 4 °C.Deparaffinization of tissueWarm heat block up to 55 °C prior to starting experiment.Add 400 μl of Deparaffinization solution to each Eppendorf tube containing tissue. Tubes are tapped multiple times to make sure tissue was completely in solution.Incubate tissue with Deparaffinization solution for 1 min at 55 °C. Vortex tube briefly after the 1 min incubation. Centrifuge down Eppendorf tubes in order to separate tissue sample from the Deparaffinization solution at 15,000 x g (1 min, 23 °C). Carefully, pipette out the solution, making sure to not remove any tissue.Digestion of tissuePrepare the master mix. The final volume is 100 μl (Table 1). A bulk stock of the master mix can be made up for multiple tissues.Table 1. Master Mix Reagentsimgsrc:https://en-cdn.bio-protocol.org/attached/image/20190817/20190817065453_2057.pngAdd 100 μl of Master Mix to each Eppendorf tube containing deparaffinized tissue and incubate for at least 3 h or overnight at 55 °C for tissue digestion. Incubation time of deparaffinized tissue in the Master Mix is subjective to the size of the tissue. For larger tissues, it is best to leave in Master Mix overnight to ensure complete digestion of tissue.",
    "At the end of incubation, centrifuge the Eppendorf tube containing samples briefly (~1 min) to collect any condensed vapor from the incubation on the lid.Set the heat block temperature to 94 °C and add water in each hole of the heat block in order to equilibrate the temperature of the heat block. Add micro-tube cap locks to each Eppendorf tube to prevent accidental expansion of tube and incubate samples at 94 °C for 20 min.Allow samples to cool down to room temperature (~5 min) and briefly centrifuge down.Add 5 μl of reconstituted RNase directly to the solution (RNase final concentration of 0.32 mg/ml). Pipette tips are changed between samples to prevent any DNA contamination. Vortex sample tubes briefly (~10 s) to make sure the solution is well mixed and incubate at room temperature for 5 min.Purification of DNAAdd 350 μl of Genomic Lysis Buffer (350 μl) to each tube and vortex the tubes briefly (~10 s).After vortexing, spin down the sample tubes for 1 min.Add 135 μl of isopropanol to each tube. Mix the DNA solution and isopropanol thoroughly by inverting the tube multiple times.Centrifuge down the isopropanol and DNA mixture at 12,000 x g (1 min) to spin down any insoluble debris in the Eppendorf tube. Transfer the supernatant containing the DNA to a Zymo-Spin Column attached to a collection tube and centrifuge down the column and collection tube at 10,000 x g (1 min).Transfer the spin column to a new collection tube and add 400 μl Genomic DNA wash 1 buffer to the column and centrifuge down the column and collection tube at 10,000 x g (1 min). Transfer the spin column to a new collection tube.",
    "Add 700 μl of Genomic DNA wash 2 buffer to the spin column and centrifuge down the spin column and collection tube at 12,000 x g (1 min). Decant the flow-through from Step A4g and add 200 μl of Genomic DNA wash 2 buffer to the spin column and centrifuge down the spin column and collection tube at 12,000 x g (1 min). Transfer the spin column containing the DNA to a new Eppendorf tube after centrifugation. In order to elute DNA from column, add 50 μl of DNA elution buffer to the spin column and incubate at room temperature for 5 min.Centrifuge down the spin column containing the DNA elution buffer for 30 s at 21,130 x g.Measure the DNA concentration by NanoDrop (ND-1000). Store the DNA at -20 °C in a screw-capped tube or in tubes sealed with parafilm. The expected yield of genomic DNA should be around 15 and 2 μg from tissue blocks and biopsy tissues, respectively (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190817/20190817063311_4924.jpgFigure 1. Comparing the yield and purity of DNA using tissue blocks and biopsy samples. A. Yield of DNA (μg) measured in liver tissue blocks (n = 44) and liver biopsy samples (n = 38). Data represent mean ± standard error of mean. The concentration of DNA was measured by a NanoDrop. * indicates a P-value < 0.05 by Student’s t-test. B. Comparison of 260/280 ratios between liver tissue blocks (n = 44) and liver biopsy samples (n = 38). Data represent mean ± standard error of mean. The 260/280 ratios were determined at the same time the DNA concentration was measured on the NanoDrop.PCR using DNA from FFPE tissuesAmplify DNA using PCR Dilute the DNA extracted from the FFPE tissue to a concentration of 50 ng/μl in nuclease-free water.",
    "A 20 μl volume will be used for each PCR reaction. Make up a fresh bulk PCR stock of the forward and reverse primers, Phusion Buffer, Phusion DNA polymerase, dNTPs and nuclease-free water. DNA polymerase should be added last to this bulk PCR mix. To a 0.65 ml empty Eppendorf tube, add 19 μl of the bulk PCR mix to each tube. Add 1 μl of the 50 ng/μl (50 ng total) template DNA to the Eppendorf tube (Table 2). Table 2. Consists of one PCR reactionimgsrc:https://en-cdn.bio-protocol.org/attached/image/20190817/20190817065518_7197.pngPCR is carried out in a thermocycler using the conditions below:Initial denaturation: 94 °C, 5 min40 cycles: Denaturation: 94 °C, 30 sAnnealing: 54 °C, 2 minExtension: 72 °C, 1 minFinal extension: 72 °C, 10 minStore the PCR product at -20 °C or continue on to the next step.Cast a 2% agarose gel containing ethidium bromide in 0.5x Tris-Borate-EDTA (TBE) buffer. After casting the gel, allow the gel to sit at room temperature for at least 60 min before using for sufficient polymerization. Add 4 μl of the 6x blue/orange loading dye to the 20 μl PCR reaction (final concentration 1x). Visualize the PCR products on a 2% agarose gel in 0.5x Tris-Borate-EDTA (TBE) buffer stained with ethidium bromide. Excise the DNA band of interest (i.e., 339 bp for our experiment) for each FFPE tissue sample (Figure 2) with a sterile razor blade and place the band in an empty Eppendorf tube. Make sure to change blades between each PCR to avoid cross contamination of samples.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190817/20190817063435_2062.jpgFigure 2. Optimizing template DNA amount for PCR. A range of DNA template concentrations (10-200 ng) from two different surgical resection liver tissues were used in PCR.",
    "PCR products and the 100 base pair (bp) DNA ladder were run on a 2% agarose gel containing ethidium bromide and visualized with the BioRad Molecular XRS Imager. The white box indicates our 339 bp DNA band of interest.Recovery of PCR product using Zymoclean Gel DNA Recovery Kit #D4007 (Zymo Research, Irvine, CA)Add three volumes (350 μl) of ADB buffer to the Eppendorf tube containing the DNA agarose band and incubate at 55 °C for 20-30 min to completely dissolve the agarose.Transfer the dissolved agarose DNA to a Zymo-Spin Column attached to a collection tube and centrifuge for 1 min at 13,000 x g at 23 °C.Discard the flow-through from the collection tube and wash the spin column two times with DNA wash buffer (200 μl) (95% ethanol). Centrifuge at 13,000 x g for 30 s at 23 °C for each wash. The flow-through in the collection tube can be discarded after each wash. To elute purified DNA, add 6 μl of DNA elution buffer directly to the column with an Eppendorf tube attached and centrifuge for 1 min at 13,000 x g at 23 °C. The flow-through contains the purified DNA in the Eppendorf tube attached to column. DNA can be stored at -20 °C.Sequence purified DNA productTo measure the concentration of the purified PCR product, use a NanoDrop (Figure 1).Add 1 μl of 2.3 pmol/μl reverse primer to 40 ng of PCR product in a 0.65 ml Eppendorf tube. Add additional nuclease-free water to make the final volume 4 μl. Wrap PCR samples in parafilm. These conditions were used by the OUHSC Laboratory for Molecular Biology and Cytometry Research DNA sequencing core.Use Finch TV software (Geospiza, Inc.) to view the sequencing results. An example of sequencing results can be seen in Figure 3 for c.",
    "521 T>C single nucleotide polymorphism.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190817/20190817063452_4260.jpgFigure 3. Sequencing for OATP1B1 c. 521 T>C polymorphism. The 339 bp amplification was subjected to Sanger-sequencing. Shaded area indicates the position of the c. 521 T>C. Representative sequencing results for C. 521 TT (A), TC (B) and CC (C) are shown."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}