{
  "id": 6794,
  "origin_website": "Bio",
  "title": "Preparation, FPLC Purification and LC-FT-ICR-MS of Proteins",
  "procedures": [
    "A workflow of the protocol from preparation of cellular extracts to identification and quantitation of the protein isoforms and their post-translational modifications by FT-ICR-MS is shown in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200330/20200330094222_6553.jpgFigure 1. Schematic workflow of the steps of this protocol Protein sample preparationFollowing culturing and harvesting of desired cell line, resuspend cells in 10 ml of Buffer A in conical tube.Place cells on ice and lyse cellular suspension by sonication, alternating on/off pulses at 30 s (30 s on/30 s off) until cells are fully lysed as indicated by their appearance using a light microscope.Clarify lysates by centrifugation at 10,000 x g for 15 min at 4 °C.Transfer supernatant to a separate conical tube and add ammonium sulfate to final concentration of 70%.Note: A useful calculator for determining volume can be found at  https://www.encorbio.com/protocols/AM-SO4.htm[href=https://www.encorbio.com/protocols/AM-SO4.htm]. Incubate solution with constant agitation at 4 °C for at least one hour.Pellet precipitated protein via centrifugation at 10,000 x g at 4 °C.Resuspend pellet in 10 ml Buffer A and filter through 0.45 µm filter.Store at 4 °C until ready to inject into sample loop for purification or until mass spectrometry if purification is not being pursued.Note: If going straight to mass spectrometry, resuspend the suspension in 50 mM ammonium bicarbonate pH 8.0 (or MS compatible buffer of your choosing) instead of Buffer A.FPLC method creation and setupMachine Pre-startupCheck all the volumes of all buffers being used during FPLC run to ensure no air enters lines/pumps during run.Note: All buffers must be a minimum of 300 ml.50-ml Falcon tube with 20% ethanol for back-rinsing solution (lower right corner of ÄKTA machine)Filtered nano-pure water20% ethanolBuffer A/BMake sure the correct lines are in the correct buffers.",
    "A1 = Purification Buffer AA2 = Nano-pure water (filtered)B1 = Purification Buffer BB2 = 20% ethanol (filtered)Empty waste container prior to each run to prevent over filling and back pressure on the system.Priming inlets and purging pump headsTurn on ÄKTA Pure FPLC and Allow a short time for pumps and lamp to initialize for ~30 s.Make sure that all inlet tubing that is to be used during the method run is placed in the correct buffer.In the Process Picture of the Open System Control module:Click on the buffer inlets.Select the position of the inlet to be filled. Select the positions in reverse alphabetical order and start with the highest number. For example, if all the four inlets in the Inlet valve AB are to be filled, fill them in the following order B2, B1, A2, A1.Connect a 60 ml syringe to the purge valve of one of the pump heads of the pump that is being prepared (see page 91 in ÄKTA Pure Operating Instructions guide). Make sure that the syringe fits tightly into the purge connector.Open the purge valve by turning it counter-clockwise about three quarters of a turn. Draw liquid slowly into the syringe until the liquid reaches the pump.Close the purge valve by turning it clockwise. Disconnect the syringe and discard its contents.Repeat Steps B2c-B2d for each piece of inlet tubing that is to be used during the run.Creating a custom method in Method EditorOpen the Method Editor window.Click [Create New Method] → Select [Machine Number] → Check [Predefined Application] and choose application for affinity, ion exchange, etc. chromatography or [Empty Method] if you prefer to define your own parameters from scratch → Click [OK]. Predefined Application is the suggested choice for method creation.Method Settings:Choose column from list or leave as “any”.",
    "If set at “any” make sure to determine the column pressure limits and set in this window accordingly.Choose the correct column position that you will be using in the column valve.This is usually set as “1” unless using multiple chromatographies.Choose correct buffer inletsA1 and B1 are default and typically used for buffers A and B.Equilibration:Choose total volume (Column volume = CV) or condition for equilibration.Set equilibration to 10 CV buffer A or stable UV for 15 s, either method is fine.Choose the % buffer B for equilibration.Set at 0%Sample Application:Choose loop type (i.e., Superloop or Capillary loop).Choose loop position on loop valve (1-5).Set total sample volume that will be injected (1-99 ml).Choose fractionation desired:Fraction collector for collection of elution fractions.If fraction collector is chosen set the volume of fractionation desired.Column Wash:Wash column either by volume or condition stable UV.Stable UV is preferred to ensure that all unbound proteins are washed from the column.ElutionSet Elution method to Gradient elution.Linear = set target %B and length of gradient in CVTarget %B should be set to 100 and CV set to 25Set fractionation to fraction collector.1)Set type of fractionation to fixed volume.2)Set fractionation volume to 1 ml.Optional: Up-flow elution can be selected if you wish the sample to be eluted from the bottom of the column to the top.Equilibration:Standard set to equilibrate the system and column back to buffer A.FPLC Run InitializationConnecting a column (see page 109 in ÄKTA Pure Operating Instructions guide):Connect a suitable tubing to a Column valve port (Example: 1A).Open the System Control module.In the Process Picture:1)Click on the [Column] → Select [Column down flow].2)Click on the [Pumps] → Enter a low System flow (e.g., 0.25 ml/min.) → Click [Set flow rate].",
    "3)When buffer leaves the tubing in a continuous mode and the top part of the column is filled with buffer, connect the tubing to the top of the column.4)When buffer leaves the tubing at the bottom of the column in a continuous mode, connect the column to the Column valve. Use the port opposite to the one already connected to the column, in this example port 1B if 1A is used.Note: Make sure that the column location matches the location set in the method that was created for the run. Sample injection:Sample injection using a Superloop (see page 122 in ÄKTA Pure Operating Instructions guide):1)Attach the Superloop to the instrument using a Column holder.2)In the Process Picture, click the [Injection valve] → Select [Manual Load].3)In the Process Picture, click the [Loop valve] → Select the position the loop is connected to, for example [Position 2].4)Fill a syringe with your filtered protein sample from Step A7.5)Approximately 0.5 μg of protein sample was used.6)Connect the syringe to Injection valve port (Syr on V9-Inj of ÄKTA machine).7)Load sample into the Superloop by emptying the syringe into the injection valve.Note: Leave the syringe connected to the Syr port until the end of the run. Open the Method Editor module and open the method you will be using for the elution run.1)In Method settings, make sure to set column position that you have your column connected to, e.g., 1.2)In Sample Application, set your total sample volume for injection and the loop type and position.3)Select the method to run and click the [Run] icon.Collect fractions utilizing fraction collector filled with disposable glass tubesSample preparation for subsequent chromatographic runsCombine peak fractions together and transfer to 15-ml Amicon centrifugal filtration units with molecular weight cut-off of 3.5 kDa.",
    "Note: Spin samples based on manufacturer’s guidelines until sample is concentrated. Fill filtration column with Buffer A and repeat centrifuge step as above.Note: Repeat this step 5-10 times. Pipet out protein sample from on top of the filter, transfer to a new collection tube and add enough volume of Buffer A to fill your chosen sample loop for additional chromatography runs.10 ml if using the 10 ml Superloop.Optional: Perform second round of cation exchange chromatography this time using a shallow gradient Note: Create identical method except elute over 45 ml as opposed to 25 as completed for first round of Cation exchange chromatography for better separation of elution peaks. Repeat Steps C1-C3 for following elution of protein for final round of Heparin chromatography.Run the same Elution method that was used for round 1 cation exchange chromatography (e.g., 25 CV elution gradient).See Figure 2 for representative chromatograph from heparin affinity run.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200330/20200330094323_1390.jpgFigure 2. FPLC separation of chromatin proteins by heparin affinity chromatography. Proteins are fractionated by heparin affinity chromatography and elution is monitored by absorbance at 280 nm.Save individual peak fractions for MS analysis of intact protein via FT-ICR-MS.You may choose to concentrate fractions to higher protein concentrations to accommodate mass spectrometry methods.Repeat Step C1-C3 for following elution of protein from heparin to exchange buffer into a MS-compatible buffer (i.e., 50 mM ammonium bicarbonate).Optional: You may choose to vacuum dry protein samples for reconstitution into buffer of choice as an alternative to diafiltration. It may, however, be necessary to remove salts prior to vacuum drying to prevent salt crystal formation.Analyze the protein composition of the via SDS-PAGE to determine respective masses of purified proteins in individual FPLC peaks.See Figure 3 for representative image of protein content in peaks in Figure 2.",
    "Note: In-gel analysis is for qualitative evaluation of protein content in respective peaks. All peaks are analyzed as intact, undigested proteins in-solution for subsequent FT-ICR-MS analysis.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200330/20200330094612_8924.jpgFigure 3. SDS-PAGE analysis of purified native chromatin extracts following heparin affinity chromatography. Eluted individual peak fractions from heparin resins were analyzed for protein identity prior to MS identification.LC-FT-ICR Mass SpectrometryCreating a Mass Spectrometry custom method in Method Editor.Turn on computer and open Compass SolariXcontrol software.Software will upload the last method used by the instrument.Open [Method Editor] window.In the Method Editor window click [Ion Transfer].In [Source Optics] set parameters to:Capillary Exit to 180 VDeflector Plate to 280 VFunnel 1 to 110 VSkimmer 1 to 30 VFunnel RF Amplitude to 210 VppIn [Octopole] set parameters to:Frequency to 5 VMHzRF Amplitude to 150 VppIn [Quadrupole] parameters set:Q1 mass to 250 m/zIn [Collision Cell] set parameters to:Collision Voltage to -1.5 VDC Extract Bias to 0.6 VRF Frequency 2 MHzCollision RF Amplitude to 1,500 VppIn [Transfer Optics] set parameters to:Time of Flight to 1 msFrequency 4 MHzRF Amplitude to 440 VppIn [Gas Control] set parameters to:Flow 15%Check [Enable] boxIn the Method Editor window click [API Source].In [API Source] set parameters to:Source type to ESICapillary is set to 4,500 VEnd Plate Offset to -500 VIn [Source Gas Tune] set parameters to:Check [Dry Gas Flow] boxCheck [Dry Gas Heater] boxCheck [Nebulizer Gas Flow] boxIn [Divert Valve] parameters set:Check [Position] to WasteIn the Method Editor window click [Mode].In [Acquisition Mass Control] set parameters to:Detection Mode to BroadbandTD (Acquisition) to 2 MLow Mass to 150.59 m/zHigh Mass to 3,000.00 m/zIn [Accumulation] set parameters to:Average Spectra to 1Source Accumulation to 0.010 sIon Accumulation Time to 0.800 sIon Cooling Time to 0.010 sTime of Flight to 1 msIn the Method Editor window click [Analyzer].",
    "Set parameters to:Transfer Exit Lens to -16 VAnalyzer Entrance to -10 VSide Kick to 7 VSide Kick Offset to -1.5 VFront Trap Plate to 1 VBack Trap Plate to 0.9 VSweep Excitation Power to 15%Save method as [nameMS].Creating a Chromatography custom method in Method EditorTurn on computer and open HyStar 3.4 software.Click [Method] → Select [New Method] if you prefer to define your own parameters from scratch → Click [OK] or open any Method and Click [Edit].In the Method Editor window click [General].In [Author] write your nameIn [Description] describe your methodIn the Method Editor window click [LC Parameters].In [Total Runtime] set parameters to:Total Runtime to 90 minIn [Data Acquisition] set parameters to:Start delay to 0 minRuntime to 90 minCheck [Dry Gas Heater] boxIn [LC Pump] set parameters to:Flow Rate 0.02 ml/minPressure limits to Min 0 and Max 400 barSolvent to 7Solvent A1 to 100%Solvent B1 to 0%In the Method Editor window click [LC Timetable].In [Device] drop down menu select [Pump-Agilent G1376A Micro].Set [Time] to 0 minIn [Function] drop down menu select [Flow Rate].Set Flow Rate to 0.02 ml/minIn [Device] drop down menu select [Pump-Agilent G1376A Micro].Set [Time] to 0 minIn [Function] drop down menu select [Solvent Mix].Set Solvent Mix to 100% A1 and 0% B1In [Device] drop down menu select [Pump-Agilent G1376A Micro].Set [Time] to 1 minIn [Function] drop down menu select [Solvent Mix].Set Solvent Mix to 100% A1 and 0% B1In [Device] drop down menu select [Pump-Agilent G1376A Micro].Set [Time] to 75 minIn [Function] drop down menu select [Solvent Mix].Set Solvent Mix to 20% A1 and 80% B1In [Device] drop down menu select [Pump-Agilent G1376A Micro].Set [Time] to 78 minIn [Function] drop down menu select [Solvent Mix].Set Solvent Mix to 0% A1 and 100% B1In [Device] drop down menu select [Pump-Agilent G1376A Micro].",
    "Set [Time] to 79 minIn [Function] drop down menu select [Solvent Mix].Set Solvent Mix to 0% A1 and 100% B1In [Device] drop down menu select [Pump-Agilent G1376A Micro].Set [Time] to 80 minIn [Function] drop down menu select [Solvent Mix].Set Solvent Mix to 100% A1 and 0% B1In [Device] drop down menu select [Pump-Agilent G1376A Micro].Set [Time] to 90 minIn [Function] drop down menu select [Solvent Mix].Set Solvent Mix to 100% A1 and 0% B1In the Method Editor window click [Signals 1-8]From [Signal No. 1] select MS (apex series) MS and Interval BPC, AllFrom [Signal No. 2] select MS (apex series) MS and Interval TIC, AllSave method as [nameLC]See Figure 4A for representative HPLC spectrum.LC-FT-ICR-MS data acquisitionTurn on computer and open Compass SolariX Control and HyStar 3.4 software.Open [nameMS] Method in Compass SolariX Control software.Open [nameLC] Method in HyStar 3.4 software.Check all the volumes of all buffers being used during HPLC run to ensure no air enters lines/pumps during run.Note: All solvents must be a minimum of 100 ml. Make sure the correct lines are in the correct solventsA1 = Solvent A (0.1% formic acid in water)B1 = Solvent B (0.1% formic acid in acetonitrile)Empty waste container prior to each run to prevent over filling and back pressure on the system.Initializing Agilent 1100 HPLC system.Turn on the Agilent 1100 HPLC system (right hand side).Allow a short time for pumps and lamp to initialize (~30 s).Ensure that the machine and computer are communicating.Priming inlets and purging pump heads.Open the System Control module.In the Process Picture at the bottom of the window:1)Click on [Purge].2)Select the position of the inlet to be filled. Select the positions in reverse alphabetical order and start with the highest number.",
    "For example, if all the four inlets in the Inlet valve AB are to be filled, fill them in the following orderL B2, B1, A2, A1.3)Click on [Start Purge].Connect a ProSwift column (1 x 50 mm) between Agilent LC system outlet and MS instrument inlet.Place sample into a correct position in Agilent 1200 serie Autosampler (e.g., 1-B,1).Add sample to Sample Table.Click [Sample Table] in HyStar 3.4 software.Click on [Add new sample].1)In [Vial] box define position of your sample in the Autosampler (e.g., 1-B,1).2)In [Sample ID] define name of your sample.3)Set [Injection] to 1.4)Set [Volume] to 5 µl.5)In [Data path] define where results will be stored.6)For [LC Method Part] box select [nameLC].7)For [Autosampler Method Part] box select [Standard].8)For [MS Method Part] box select [nameMS].In the sample table check the line with your sample and click [Start].Following the analytical run, close all software.For representative m/z spectrum at different retention times see Figures 4B and 4C.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200330/20200330094645_1651.jpgFigure 4. FT-ICR-MS chromatograpm and mass spectra of intact proteins. A. HPLC chromatograph following reverse phase purification. B-C. Intact mass of 26.4-28.1 min retention time corresponding to Cren7 protein isoforms B and Sso7D isoforms C. All peak m/z shifts correspond to +14 Da indicating variable degrees of methylation."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}