{
  "id": 15112,
  "origin_website": "Jove",
  "title": "A FACS-based Protocol to Isolate RNA from the Secondary Cells of Drosophila Male Accessory Glands",
  "procedures": [
    "1. Drosophila Lines Used and Collection of Males\nFor this protocol, use males expressing GFP in the SCs and not the main cells. Here, an AbdB-GAL4 driver (described in reference18), recombined with UAS-GFP (on chromosome 2) is used. Other appropriate drivers can also be used. For isolation of SCs under different mutant conditions, cross the mutation into lines containing the SC-specific GFP line.\nCollect two batches of about 25 healthy, virgin males for each genotype and age them at 25 °C for 3-4 days in vials with freshly made Drosophila food.\nNOTE: As age, mating status, nutrition and social environment each affect reproductive biology, strict protocols must be followed to control for these parameters. Virgin males are aged for 3-4 days after pupal eclosion at 25 °C with a 12 h/12 h light/dark cycle, on standard corn meal-agar-yeast food, in groups of 20-25 males per vial.\n2. Solutions and Material Preparation\nPrepare the following solutions.\nPrepare Serum Supplemented Medium (SSM): Schneider's Drosophila medium complemented with 10% heat inactivated fetal bovine serum and 1% Penicillin-Streptomycin.\nPrepare aliquots of 1x trypsin enzyme (e.g., TrypLE Express Enzyme) and store at room temperature.\nPrepare aliquots of papain [50 U/mL] (stored at -20 °C and thawed only once).\nPrepare 1x phosphate buffer saline (PBS, stored at room temperature).\nPrepare multiple flame-rounded pipet tips for the physical dissociation of accessory glands.\n\tNOTE: Use low retention tips for handling accessory glands as they tend to adhere to untreated plastic. The process of flame-rounding reduces the tip opening and smoothens the edges of the tip. This ensures an efficient dissociation after peptidase digestion without shearing the cell membranes.",
    "Cut one 200 µL tip with a sharp blade and gently pass it over a flame to round out its tip so that the opening is wider but smooth for handling during step 3.7.\nNarrow the opening of multiple 1,000 µL tips by passing the tip opening near a flame for less than one second. Rotate the tip slightly to avoid over-melting or clogging. Sort the tips made from narrower to wider. This can be done by timing the speed of aspiration. Try to dissociate a small scale sample of AGs to test the efficiency of the narrowest tips.\nNOTE: These tips are critical for mechanical agitation (steps 5.2 and 5.3). Quality flame-rounded pipet tips allow for complete dissociation while preserving cell viability. As such, these tips are washed thoroughly with water at the end of the procedure for reuse. This allows for day to day reproducible dissociation.\n3. Dissection of Accessory Glands\nPut 20 to 25 male Drosophila in a glass dish on ice.\nDissect 1 male in SSM. Take off its reproductive tract and clear the accessory gland pair from all other tissues apart from the ejaculatory duct.\nNOTE: Remove testes because the released sperm can create clumps and disturb the dissociation process. Remove the ejaculatory bulb, which makes handling difficult when it floats.\nWith forceps, transfer accessory glands to a glass plate filled with SSM at room temperature. Repeat steps 3.2-3.3 20 times to obtain a batch of 20 pairs of glands in SSM.\nNOTE: These steps will be achieved in 15 to 20 min. AGs should look healthy, and the peristaltic movements of the muscle layer around glands should be visible. GFP can be monitored using a fluorescent microscope.\nTransfer accessory glands to 1x PBS for a 1-2 min wash at room temperature.",
    "NOTE: For better dissociation, it is imperative to rinse the glands with PBS. The duration of this step, however, should be limited as the cells show signs of stress in PBS; dissociated secondary cells in PBS rapidly swell and die.\nDilute 20 µL papain [50 U/mL] into 180 µL of 1x trypsin enzyme to obtain the dissociation solution (to scale up or down keep 9 µL of trypsin enzyme and 1 µL of papain for each male). With forceps, transfer accessory glands to this solution.\nIsolate the tip of accessory glands (containing secondary cells) from the proximal part. Use fine forceps to pinch firmly the middle of a glandular lobe and cut with the sharp tip of a second forceps. Remove the proximal part of accessory glands and the ejaculatory duct to improve dissociation and reduce cell sorting time.\nNOTE: Dissecting the distal part from 20 pairs of glands will take 15 to 20 min and digestion by peptidases will thus start at room temperature.\nAfter all gland tips have been dissected, transfer them into a 1.5 mL tube using a special 200 µL pipet tip prepared at Step 2.2.1. It should be wide, rounded and wet prior to handling glands.\nNOTE: To pipet accessory gland tissue, tips should always be pre-wet with appropriate solution (trypsin enzyme or SSM, keep one tube of each for this purpose). Carefully rinse tips between samples to avoid contamination.\n4. Tissue Digestion\nPlace the microtube in a 37 °C shaker for 60 min, rocking at 1,000 rpm.\nNOTE: Both agitation and digestion time are critical for successful dissociation. Shorter or motionless digestion will give poor dissociation, probably because the outer muscle layer and inner viscous seminal fluid protect accessory gland cells from peptidases.",
    "Add 1 mL of SSM at room temperature to stop the digestion and proceed immediately to step 5.\n5. Mechanical Dissociation of the Cells\nUsing a wide rounded 1,000 µL tip, pre-wet with SSM, transfer the sample to a 24-well plate. Monitor GFP fluorescence under the microscope: most gland tips should look intact and a few SC should be detached.\nUsing a rounded narrow pipet tip generated at Step 2.2.2, pipet up and down 3 to 5 times to disrupt the accessory gland tissue.\nNOTE: Monitor fluorescence to make sure that big tissue patches have been broken up. Repeat step 5.2 if this is not the case.\nUsing a very narrow rounded pipet tip (generated at Step 2.2.2), pipet up and down 1-2 times.\nNOTE: Only individual cells should be visible after Step 5.3. Using 24-well plates is recommended because they enable an easy monitoring of the process. When a few samples were processed and gave satisfactory result (healthy looking secondary cells perfectly dissociated), the pipetting steps will be performed in the microtube.\nWait at least 15 min to let the cells settle at the bottom of the well and remove the excess SSM to reduce the sorting time.\nNOTE: Letting cells settle proved superior to alternative methods like centrifugation, and allows a last visual inspection of cells just before FACS.\nPipet the cells into a clean 1.5 mL tube and pool identical samples (two batches of 20 males for each condition). Rinse wells with SSM to recover last cells, and pipet them into the tube (use a small volume).",
    "In 1.5 mL microtubes, add 300 µL of Cell Lysis Solution and 1 µL of Proteinase K [50 µg/µL] (solutions provided in the RNA purification kit, see Step 7). Prepare two tubes for each sample (one for MCs and one for SCs).\n6. FACS (Fluorescence-activated Cell Sorting)\nAdd viability marker to each sample to be sorted a few minutes before sorting (0.3 mM Draq7).\nCAUTION: Draq7 should be handled with caution.\nSort a homogeneous population of live secondary cells (GFP-positive, Draq7-negative cells). In another microtube, sort a population of main cells (smaller, GFP-negative, Draq7-negative cells). Use the following FACS gating strategy:\n\tNOTE: Set the cell sorter pressure at 25 PSI and pass cells through a 100 µm nozzle. The sorting rate is around 2,000 cells/s.\n\t\nExclude debris and select total cells based on FSC-SSC (Figure 2E) in order to exclude debris.\nExclude dead cells. Excite Draq7 with a 640 nm laser and collect emitted fluorescence with a 795/70 band-pass filter. Gate Draq7-positive cells out (Figure 2F).\nRemove doublets using a double gating on SSC-H vs SSC-W and FSC-A vs FSC-H (Figure 2H).\nNOTE: Exclude cell doublets stringently using double gating, to reduce main cell contamination.\nSort ~550 GFP-positive cells into a 1.5 mL microtube with Lysis buffer and Proteinase K. This population is considered secondary cells (SC, Figure 2G). Excite GFP at 488 nm and collect emitted fluorescence with a 526/52 band-pass filter.\nSort ~1,000 GFP-negative cells, homogeneous and small in size, into a 1.5 mL microtube with Lysis buffer and Proteinase K. This population is considered main cells (MC, Figure 2G).\nVortex all samples.\nNOTE: From 40 males (~40 x 80 SC = 3,200 secondary cells), 600 to 800 live singlet secondary cells are obtained (around 20-25% retrieval). Stop sorting around 550 SC and 1,000 MC to normalize samples.",
    "7. RNA Extraction\nNOTE: We used Epicentre MasterPure RNA Purification Kit for RNA extraction, with the following adaptations. Other kits might be used as long as the yield is high enough to prepare a library for sequencing from ~500 cells (2 ng RNAs was used here).\nHeat samples at 65 °C for 15 min and vortex every 5 min to complete cell lysis.\nPlace samples on ice for 5 min. Follow manufacturer's recommendations for nucleic acids precipitations (parts \"Precipitation of Total Nucleic Acids\" and \"Removal of Contaminating DNA from Total Nucleic Acid Preparations\").\nSuspend RNA pellet in 10 µL of RNase-free TE buffer.\nAdd RNase inhibitor (optional).\nStore samples at -80 °C.\n8. Quality Controls of RNA Quantity, Quality and Specificity\nEstimate RNA quality and concentration. Due to the small volume and concentration, use RNA 6000 Pico chips here. Good quality RNA is defined as non-degraded, visible as a low baseline with sharp peaks corresponding to rRNAs.\nRT-qPCR to control the identity of sorted cells\nPerform reverse transcription with 2 ng of total RNAs using random hexamers as primers. Perform RT on secondary cell RNA and main cell RNA.\n\t\tNOTE: cDNAs can be diluted, aliquoted, and kept frozen for later use.\nPerform real time quantitative PCR using appropriate primer pairs to quantify housekeeping genes (alpha-Tubulin, 18S rRNA), secondary cell specific genes (MSA, Rab19, Abd-B) and main cell specific gene (Sex peptide).\n9. Sequencing (cDNA Library Preparation, Sequencing and Data Analysis)\nUse 2 ng of total RNAs to synthesize cDNAs with polydT primers. Use SMARTer technology to amplify them for amplification.\nUse a Nextera XT kit to prepare the library.\nSequence using multiplexed, 100 nucleotides single reads sequencing (even though 50 nucleotides reads are appropriate for most purposes) to yield around 30 million reads for each sample.\n10. Data Analysis",
    "Run FastQC.\nUse the STAR aligner to map the reads on the UCSC dm6 Drosophila reference genome and generate .bam files. Use Integrative Genomics Viewer (IGV) to visualize reads on the genome browser.\nUse HTSeq to perform gene counts.\nUse the Trimmed Mean of M-values (TMM) method to normalize gene counts22. Use edgeR to perform statistical analysis of differential expression, MA plots and PCA.\nFor gene expression analysis and statistics, use General Linear Model, quasi-likelihood F-test with False Detection Rate (FDR) and Benjamini & Hochberg correction (BH).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}