{
  "id": 10579,
  "origin_website": "Jove",
  "title": "A Microfluidic Platform for Longitudinal Imaging in Caenorhabditis elegans",
  "procedures": [
    "The protocol below uses WormSpa5, a previously-described microfluidic device for longitudinal imaging of worms. Fabrication of WormSpa (starting with CAD files that can be obtained from the authors upon request) is straightforward but requires some expertise. In most cases, fabrication can readily be done by a core facility or by a commercial company that provides such services. When fabricating the device, make sure to specify that the height of the features is 50 µm.\n1. Experimental Setup\nMount the microfluidic device on an inverted fluorescence microscope with a motorized stage.\nPlace an orbital shaker close to the microscope, but make sure the vibration from the shaker does not directly affect the microscope. For example, put the shaker on a shelf fixed on a wall that makes no contact with the optical table.\nPlace a syringe pump on the orbital shaker. Tape the pump to the shaker so that it does not jiggle while shaking.\n2. Preparation of the Microfluidic Environment\nNOTE: During the experiment, four syringes are connected to the microfluidic device via syringe tubes, as outlined in Figure 1. This step describes the preparation of these syringes. Unless mentioned otherwise, keep the syringe tubes as short as possible without making them taut.\nPrepare an outlet syringe and a syringe tube. This syringe (S1 in Figure 1) will later be connected to the outlet of the device through the syringe tube, and used for temporary storage of fluid coming out of the device.\n\t\nMake an adapter needle by removing plastic parts of a 20 G x 1/2 inch syringe tip, keeping only the needle (the metal part). Do so by holding the plastic and metal parts with pliers and pulling them apart. Remaining plastic residue on the needle can be burnt off with a Bunsen burner.",
    "Bend the needle according to the geometry of the experimental setup while holding its two ends with pliers. In the design described here, bending the needle in its middle to an angle of ~110° is most convenient.\nPlug the adapter needle half way into the tube. The other half will later be plugged into the device. The syringe tube should be compatible with a 20 G syringe tip without a leak (for example, tubing with inner diameter of 0.86 mm and outer diameter of 1.32 mm). The recommended tube length is ~50 cm.\nConnect a 10 mL luer-lock syringe to the other (open) end of the syringe tube via a 20 G x 1/2 inch syringe tip.\nPrepare buffer-inlet syringes and syringe tubes. One of these syringes (S2 in Figure 1) is used as a reservoir for the fluid that goes into the device and to control the injection flow. The other syringe (S3 in Figure 1) is required for buffer exchange, as explained in Step 3.2.\n\t\nConnect a 10 mL luer-lock syringe (S2) directly to a 3-way valve and connect another syringe (S3) to the same valve via a syringe tube (Figure 1): connect S3 to the tube via a syringe tip, and connect the tube to the valve via another syringe tip.\n\t\tNOTE: The order in which these materials are connected does not matter.\nConnect a syringe tube to the remaining port of the 3-way valve. Prepare another adapter needle as in Step 2.1.2, and plug the needle half-way into the other (open) end of the syringe tube.\nSet the valve such that the syringe tube in Step 2.2.2 and S2 are connected while S3 is closed (Figure 1).",
    "Prepare a worm-inlet syringe and a syringe tube. This syringe (S4 in Figure 1) is used for loading worms into the device.\n\t\nConnect a long syringe tube to a 10 mL luer-lock syringe (S4). Determine the length of this tube from the volume of the fluid that will be used for loading; for example, 100 cm of tubing supports over 2 mL of liquid (also, see step 4.2).\nPrepare another adapter needle as in Step 2.1.2, and plug one half of the needle to the other (open) end of the syringe tube.\nRinse all the syringes and tubing with S-medium12 twice. Fill the syringes and the tubes with S-medium, taking care to remove all air bubbles.\nConnect the outlet syringe tube to the device outlet.\n\t\nPlug in the adapter needle at the end of the syringe tube to the outlet port.\nInject a small volume of S-medium through the outlet to fill up the device, until a little S-medium comes out of both the buffer inlet and the worm inlet.\nConnect the buffer-inlet syringe tube to the buffer-inlet port of the device, while plugging the worm-inlet with a pin (stainless steel dowel pin with a 1/32-inch diameter).\nInject a constant flow of buffer into the device. Load the buffer-inlet syringe S2 onto a syringe pump13, and set the pump such that the medium in S2 is continuously injected into the device at a flow rate of 3 µL/min.\n3. Loading Bacteria into the Microfluidic Device\nPrepare Escherichia coli OP50 suspended in S-medium12.\n\t\nFollowing a standard protocol, inoculate a 250 mL flask with 50 mL of LB and a single colony, and incubate overnight at 37 °C.\nCentrifuge the overnight culture at 4000 rpm for 10 minutes and resuspend the pellet in 30 mL of S-medium.",
    "Filter the suspension through a 5 µm syringe filter. Measure the bacterial concentration by its optical density at 600 nm (OD600), and adjust the concentration to an OD600 of 3. This high density is required to keep the worms well-fed.\nExchange the buffer in the device with the OP50 suspension.\n\t\nPrepare a clean syringe (S5) filled with the OP50 suspension. Hold the syringe vertically and tap it several times to collect all the air bubbles at the top.\nTurn the 3-way valve of the buffer-inlet syringes to close the connection to the device, and connect the two syringes, S2 and S3. Disengage S2 from the syringe pump.\nDisconnect S2 from the valve and connect S5 to the valve. Push out all the air collected at the top of S5 to S3 through the valve until a little bit of the OP50 buffer goes into S3. In doing so, make sure that no air bubble remains in S5 or the valve.\nTurn the 3-way valve back to the original position to close the connection between S3 and S5 and connect S5 to the device. Load S5 onto the syringe pump. Turn on the orbital shaker that holds the pump. Set the shaking speed to approximately 200 rpm.\nSet the flow rate to be 100 µL/min. The time it takes for the new buffer to arrive to the worms in the device depends on the length of the buffer-inlet syringe tube (around 5 minutes with the tubing described above). A higher flow rate can be employed if a quicker buffer exchange is required.\nOnce the OP50 buffer spreads throughout the device, set the flow rate back to 3 µL/min.\n4. Loading Worms into the Microfluidic Device",
    "Prepare a small low binding microcentrifuge tube (650 µL) and fill it with 100 µL of OP50 suspension. Transfer around 20 - 30 age-synchronized young adult worms (46 hours post L1 larval arrest at 25 °C) from an NGM (nematode growth medium) agar plate to the tube by picking them one by one with a worm pick. Age-synchronization can be done following a standard protocol12.\nFill the worm-inlet syringe and syringe tube (S4 in Figure 1) with the OP50 suspension. Inject ~500 µL of the fluid into the microcentrifuge tube with worms. Draw the suspension with worms into the worm-inlet syringe tube. Make sure that the syringe tube is long enough (>1 m) and that drawn worms stay in the syringe tube and do not make all the way to the syringe S4.\nConnect S4 to the worm-inlet. Inject all the worms in the worm-inlet syringe tube into the microfluidic device. Disconnect S4 and the syringe tube. Plug the worm-inlet with a pin.\nDisengage the buffer-inlet syringe S2 from the mechanical pump ( Figure 1) and manually control S1 and S2 to push all the worms into separate channels. Pressing S2 will move worms into the channels, while pressing S1 will move them in the reverse direction. Once a channel is loaded, the worm in each channel will block the entry of other worms.\nLet worms adjust to the new environment for 2 - 3 hours.\n5. Setting Up an Imaging Protocol\nFind all worms that are securely located in the device, and set an imaging position for each of them in the image acquisition software that controls your microscope. Note that in some cases (e.g. when higher magnification is desired, or when using cameras with a smaller CCD sensor) multiple imaging positions are required for each channel.",
    "NOTE: While this can be done manually, some acquisition software packages can load a text file that lists the positions where images should be taken. Since these positions are ordered regularly in WormSpa, a user can write a small script (e.g., in Python or commercial software) that automatically creates such a list. The precise format of this script would depend on the file format expected by the acquisition software (see an example in Supplementary Material 1).\nSet the required frequency of time-lapse imaging. For example, imaging of immune gene response to infection is done at a frequency of 10 minutes per frame. Make sure that all necessary channels (e.g. bright-field and the GFP fluorescence) are acquired at every time point.\n6. Host Response to Pseudomonas Infection\nNote: This step is specific for studying host-pathogen interactions. Alternatively, one can prepare a buffer that contains other environmental cues of interest (biotic and abiotic stressors, drugs, signaling molecules, etc.).\nPrepare Pseudomonas aeruginosa PA14 suspended in SK-medium14.\n\t\nInoculate a 250 mL flask with 50 mL of LB and a single colony, and incubate overnight at 37 °C.\nInoculate another 250 mL flask with 50 mL of LB and an aliquot of the culture, and incubate overnight at 37 °C.\nCentrifuge the overnight culture at 4000 rpm for 10 minutes and resuspend the pellet in 10 mL of SK-medium. Measure the bacterial concentration and adjust the concentration to OD600 = 4.\nTransfer the suspension to a clean flask, and incubate at 37 °C for 24 hours and at 25 °C for another 24 hours while shaking. This step mimics the plate-incubation step in the standard killing assay14.\nFilter the suspension through a 5 µm syringe filter. This is to prevent bacterial aggregates from clogging the device.",
    "Replace the OP50 suspension in the device with the PA14 suspension, following the same procedure as in Step 3.2. Keep imaging for 10 hours.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}