{
  "id": 8968,
  "origin_website": "Jove",
  "title": "Measuring Trans-Plasma Membrane Electron Transport by C2C12 Myotubes",
  "procedures": [
    "NOTE: See Figure 1 for a schematic overview of key steps.\n1. WST-1 Reduction Assay\nGrow and differentiate C2C12 adherent cells using standard cell culture procedures7 in a 96-well plate utilizing rows A-F.\n\t\nUse a differentiation medium consisting of Dulbecco's Modified Eagle's Medium (DMEM) supplemented with 2% horse serum, 100 U/mL penicillin, and 0.1 mg/mL streptomycin. Incubate the cells at 37 °C with 5% CO2.\nWhen monitoring ascorbate involvement in tPMET, supplement differentiation media with 100 µM ascorbic acid. Allow cells to incubate in differentiation media for ~24-48 h.\nPrepare stock WST-1 and PMS solutions.\n\t\nTo make a 10 mM stock of WST-1, dissolve 0.033 g of WST-1 (Formula Weight (FW): 651.34 g/mol) in 5 mL of phosphate buffered saline (PBS). Store at 4 °C.\nTo make a 5 mM stock of PMS, dissolve 0.0023 g of PMS (FW: 306.34 g/mol) in 1.5 mL of deionized H2O (diH2O). Store at -20 °C and protect from light.\nAdd 0.0108 g of glucose for a final concentration of 5 mM to 11.4 mL of PBS or HEPES buffered saline (HBS; 20 mM HEPES sodium salt, 140 mM NaCl, 5 mM KCl, 2.5 mM MgSO4, 1 mM CaCl2). Add 480 µL of 10 mM WST-1 for a final concentration of 400 µM and 48 µL of 5 mM PMS for a final concentration of 20 µM.\nWhen monitoring ascorbate involvement in tPMET, divide the solution into two 6 mL aliquots. To one aliquot, add 6 µL of diH2O and to the other aliquot add 6 µL of 2 kU/mL AO for a final concentration of 2 U/mL.",
    "When monitoring superoxide involvement in tPMET, divide the solution into two 6 mL aliquots. To one aliquot, add 55 µL of 0.1 M KPO4 buffer and to the other aliquot add 55 µL of 6.5 kU/mL SOD for a final concentration of 60 U/mL.\nWash the cells with PBS. Aspirate the media and add 150 µL PBS. Then aspirate the PBS.\n\tNOTE: The assay is done with plated, attached cells. Thus, there is no centrifugation or use of trypsin in the washing process.\nAdd 100 µL of WST-1 solution (-) SOD or (-) AO to columns 1-6 and add 100 µL of WST-1 solution (+) SOD or (+) AO to columns 7-12 in the 96-well plate. Use rows G and H as background controls (i.e., to monitor change in absorbance in the reagent alone in wells without cells).\nMeasure the absorbance values using the spectrophotometer every 10 min for 1 h at 438 nm.\nAfter reading, aspirate the media and wash each well with 150 µL of PBS. Then aspirate the PBS.\nCalculate the change in absorbance for each well by subtracting the initial absorbance for a well from the absorbance at any time point for that well. Correct this change for the change in absorbance (if any) observed in the background wells (i.e., wells with assay solution but no cells).\nFor analysis, normalize the absorbance data to the 60 min control measurement or wash wells with PBS or HBS and then perform a bicinchoninic acid (BCA) protein assay.\nAdd 2 mg/mL bovine serum albumin (BSA) standard (range from 0.5-2 µL for the standard curve, depending on the degree of confluence of the cells) to the empty wells (rows G and H), then add the BCA reagent to all wells.",
    "Quantify the data via nmol of WST-1 reduction per µg of protein. Use 37 mM-1 cm-1 22 as the extinction coefficient for reduced WST-1 at 438 nm.\n2. DPIP Reduction Assay\nGrow and differentiate C2C12 adherent cells with the same procedure as step 1.1.\nPrepare stock 10 mM DPIP solution as follows. Dissolve 0.029 g of DPIP (FW: 290.08 g/mol) in 10 mL of diH2O. Confirm the concentration of DPIP by measuring absorbance at 600 nm with a spectrophotometer. Use 1 mM-1 cm-1 23 as the extinction coefficient for reduced DPIP at 600 nm. Store at 4 °C.\nAdd 0.0108 g of glucose to 11.880 mL of PBS for a final concentration of 5 mM. Add 120 µL of 10 mM DPIP for a final concentration of 100 µM.\nWhen monitoring ascorbate involvement in tPMET, divide the solution into two 6 mL aliquots. To one aliquot, add 6 µL of diH2O and to the other aliquot add 6 µL of 2 kU/mL AO for a final concentration of 2 U/mL.\nWhen monitoring superoxide involvement in tPMET, divide the solution into two 6 mL aliquots. To one aliquot, add 55 µL of 0.1 M KPO4 buffer and to the other aliquot add 55 µL of 6.5 kU/mL SOD for a final concentration of 60 U/mL.\nAspirate the media and wash cells in 150 µL of PBS. Aspirate the PBS and add 100 µL of DPIP solution (-) SOD or (-) AO to columns 1-6 and add 100 µL of DPIP solution (+) SOD or (+) AO to columns 7-12 in the 96-well plate. Use rows G and H will as background controls (i.e., to monitor change in absorbance in the reagent alone in wells without cells).",
    "Measure the absorbance at 600 nm using spectrophotometer every 10 min for 1 h. Quantify the change in absorbance relative to the control at 60 min similar to steps 1.9-1.13.\n3. Determination of Whether Reduced Electron Acceptors Are Substrates for AO or SOD\nTo 5.436 mL of PBS or HBS, add 240 µL of 10 mM WST-1 for a final concentration of 400 µM and 24 µL of 5 mM PMS for a final concentration of 20 µM.\n\t\nFor DPIP, add 60 µL of 10 mM DPIP, for a final concentration of 100 µM, to 5.940 mL of PBS or HBS.\nAdd 100 µL of solution to each well in a flat-bottom 96-well plate in the absence of cells and measure the absorbance in a spectrophotometer at 438 nm, for WST-1, or 600 nm, for DPIP.\nAdd 1 µL of 10 mM ascorbate to half of the wells for a final concentration of 100 μM. Monitor the absorbance until it stabilizes.\nUpon stabilization, add 1 µL of 200 U/mL AO for a final concentration of 2 U/mL to each well or add 1 µL of 6 kU/mL SOD for a final concentration of 60 U/mL to each well and monitor the absorbance for 1 h.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}