{
  "id": 18785,
  "origin_website": "Jove",
  "title": "Network Analysis of the Default Mode Network Using Functional Connectivity MRI in Temporal Lobe Epilepsy",
  "procedures": [
    "1. Subjects\nThe study population of 36 subjects includes 3 groups: right TLE (n=11), left TLE (n=12), and healthy controls (n=13). Obtain written informed consent from all subjects. The study follows the guidelines of the University of California, Los Angeles (UCLA) Institutional Review Board.\nThe epilepsy subject groups should be patients who are candidates for anterior temporal lobe resection as determined by video-EEG monitoring, brain MRI, PET imaging, and neuropsychological testing. Patients should continue their usual medications during the fMRI scan and should not be scanned immediately following a seizure. Make sure that all subjects have normal brain MRIs and are free from neurologic illness (other than epilepsy in the patient groups) or are using neurologic medications.\n2. Imaging\nUse a 3 Tesla MRI system for imaging. Obtain axial slices for functional images using an echo planar imaging (EPI) sequence and for anatomic images using a spoiled gradient recalled (SPGR) sequence.\nPerform functional imaging using the following parameters: TR = 2,000 msec, TE = 30 msec, FOV = 210 mm, matrix = 64 x 64, slice thickness 4 mm, 34 slices. Use the following parameters for high-resolution structural imaging: TR = 20 msec, TE = 3 msec, FOV = 256 mm, matrix = 256 x 256, slice thickness 1 mm, 160 slices.\nEach imaging session should last 20 min. Ask participants to relax with eyes closed. No special auditory input is required.\n3. Preprocessing of BOLD Data\nPreprocess the fMRI data using FSL (fMRIB Software Library) software version 4.1.6 (Oxford, UK, www.fmrib.ox.ac.uk/fsl)13,14. Preprocessing steps should include the following: Use FSL MCFLIRT to remove head movement artifact15. Use FSL BET to remove nonbrain tissue16 with BET option -F for BOLD files. This helps one run further analysis steps on the brain tissue alone.",
    "In FEAT, run a minimally processed analysis with registration. Select “First-level analysis” and change “Full analysis” to “Pre-stats” from the top two buttons.\n\t\nUnder Pre-stats tab, uncheck “BET brain extraction” and select “None” for “Motion correction” (as these were already done above). Register the functional (BOLD) images to the anatomical (SPGR) images, and then to a standard (MNI) image. This results in the generation of transformation matrices, which are used later during analysis to warp the seeds selected in standard space into the subject’s brain space.\nUse the generated transformation matrix (named “standard2example_func.mat”) and transform CSF and white matter ROIs into individual BOLD space.\n\t\nExtract the time series from the CSF and white matter ROIs using the fslmeants command, using the ROI in individual subject space as a mask. Normalize the extracted time series using the software “R”. These time series are used as regressors in the GLM later to remove the corresponding artifactual signals from the analysis.\nThe next step is removal of subject motion related artifacts. For regression of the motion parameters, set the following within FSL FEAT before running it.\n\t\nWithin the data tab, use motion-corrected and brain-extracted file as inputs, set the TR value to correspond to your dataset. Set high-pass filtering using a 100 sec filter. The high pass filtering will remove signals of no interest, which are of very low frequency. A low pass filter to remove high frequency signals will be applied later in step 4.1.\nWithin the Pre-stats tab, choose \"None\" under \"Motion correction\" as it was already done. Uncheck \"BET brain extraction\" as it was already done. Perform spatial smoothing using a 5 mm full-width half-maximum (FWHM).",
    "Within the stats tab, regress the 6 motion parameters and their temporal derivatives. Select “None” for convolution and check “Apply temporal filtering.” Use the output of FSL MCFLIRT to get text files of movement parameters, which can be then input into the FEAT analysis model to regress these in a General Linear Model (GLM)\nAlso add the CSF and white matter signals that were extracted and normalized in previous steps to the GLM. Select “None” for convolution, add temporal derivative, and uncheck “Apply temporal filtering”.\n4. Statistical Methods\nThe residuals from preprocessing described above should be used for seed-based correlation. These residuals should be first passed through a low-pass filter of 0.1 Hz, then demeaned by subtracting the mean, dividing by the standard deviation, and then scaled by adding 100. Seeds should be defined with a diameter of 6 mm in the standard MNI space using MRICron software.\nThe posterior and the anterior seeds should correspond to the following coordinates: (1) Rsp/ PCUN region (x=2, y=-60, z=36) and (2) ventromedial prefrontal cortex (vmPFC; x=3, y=60, z=-1). These seed locations have been defined within healthy controls and are transformed to the subject space in the next step17-19.\n\t\nThe seeds should subsequently be transformed to each subject's individual functional brain space from the standard MNI space. For this, use the transformation matrix generated above (named “standard2example_func.mat”) to transform the seed from standard (MNI) space to the individual functional (BOLD) space.\nUse the fslmeants command to extract the time series from the previously demeaned and scaled residual, using the seed in the individual subject space as a mask. Normalize the extracted time series using the software “R”.",
    "Partial correlations between the seed voxels and all other brain voxels should be calculated separately for each subject for each run. For this, within the FSL FEAT GUI, select “First-level analysis”, and then “Stats + Post-stats”. Within the Data tab, the previously demeaned and scaled residual should be used as input into FEAT.\nSet the High pass filter cutoff to 10,000, as the residual is already high passed at 100 sec. Within the Stats tab, unselect \"Use FILM prewhitening\", and use the previously extracted and normalized seed time series in the GLM. Within the Post-stats tab, set the desired Z-stat threshold to a value of 2.0.\nPrior to running group analysis combining runs within subjects, a Fisher's Z transform should be performed on the COPE (Contrast of Parameter Estimates) file generated from the previously run correlation analysis (step 4.3). Copy registration data from the “reg” directory of the FEAT analysis done in step 3.1 into the correlation run of step 4.3. \nRun a higher-level analysis by combining runs within each subject. For this, within the FSL FEAT GUI, select “Higher-level analysis”, and then “Stats + Post-stats”. Within the “Data” tab, choose \"Inputs are lower-level FEAT directories\" and enter subject's runs from step 4.4. Within the “Stats” tab, choose “Mixed effects: Simple OLS”. Set up model as mean effect; enter value of 1 for each of the subject's run.\nTo combine data over runs between subjects, an Ordinary Least Squares (OLS) simple mixed effects analysis should be used. For this, within the FSL FEAT GUI, choose”Higher-level analysis”, and “Stats + Post-stats”. Within the Data tab, choose \"Inputs are lower-level FEAT directories\" and enter subjects' combined runs from step 4.5.",
    "Within the Stats tab, choose “Mixed effects: Simple OLS”' Set up a model as 3 groups; enter value of 1 for the group each subject belongs, 0 otherwise. Group analysis should be done on each voxel using a one-way ANOVA with three levels which corresponded to the three groups (right TLE, left TLE, and healthy controls).\nTo threshold the Z statistic images use cluster forming threshold of Z > 2.0 and corrected cluster significant threshold of p=0.05 20. To obtain correct z-values on the correlation map, a reverse Fisher's Z transform should be performed on the results.\nThe following specific contrasts should be compared (1) right TLE > controls; (2) left TLE > controls; (3) right TLE > left TLE; (4) left TLE > right TLE; (5) control > right TLE; (6) control > left TLE; (7) TLE (combined right and left) > control; and (7) control > TLE (combined right and left).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}