{
  "id": 6586,
  "origin_website": "Bio",
  "title": "Development of an Efficient Transformation System for Halotolerant Yeast <em>Debaryomyces hansenii</em> CBS767",
  "procedures": [
    "Notes: Perform all steps involving microbial culture under sterilie environment in laminar air flow. Use autoclaved water in all the steps. Streak DBH9 strain on an YPD agar plate from frozen glycerol stock (-70 °C). Incubate streaked plate at 25 °C in an incubator for 3-4 days or till colonies appear. Note: Always start with freshly streaked culture for enhanced transformation efficiency. Inoculate a single colony of DBH9 from the plate in 10 ml YPD broth in a flask and incubate for appx. 24 h at 25 °C at 200 rpm for growth (saturated culture).Check the absorbance of the culture (after 10 times dilution in water) using spectrophotometer at 600 nm. Re-inoculate 120 µl of above grown saturated culture (if O.D. of culture is 3.0) into 30 ml of YPD broth in a flask (so that an initial A600nm of 0.045 is acheived).Note: The volume of re-inoculation may vary with O.D. of culture. Grow the re-inoculated culture at 25 °C at 200 rpm for ~16 h till the A600nm reached 2.6-2.8 (appx. 4.3 x 107 cells ml-1).Confirm the absorbance using spectrophotometer. Note: A drastic reduction in the number of transformants has been observed when the A600nm of the harvested cells was > 2.8. Harvest cells from the liquid culture by centrifugation in a centrifuge at 4,500 x g using centrifuge tube for 10 min at room temperature (RT). Discard the flow-through.Re-suspend cells pellet in 6 ml of 50 mM sodium phosphate buffer, pH 7.5 (containing 25 mM DL-Dithiothreitol). Note: Vortex the cell suspension at low rpm for 5-10 s for re-suspension.Incubate cells suspension in a 30 °C water bath (pre-warm) for 15 min. Again harvest cells from the suspension by centrifugation at 4,500 x g using centrifuge tube for 10 min at RT.Discard the flow-through.",
    "Wash the cells by re-suspending cell pellet in 15 ml sterile water and harvest the cell pellet by centrifugation at 4,500 x g for 10 min at RT. Discard the flow-through.Repeat Steps 14-15.Re-suspend the cell pellet in 1.0 ml ice-cold 1 M sucrose and transfer the entire chilled cell suspension to pre-chilled 2.0 ml safe-lock tube.Harvest the cell pellet again by centrifugation at 4,500 x g for 10 min at 4 °C in a microcentrifuge. Discard the flow-through.Finally to the cell pellet, add 175 µl ice-cold 1 M sucrose to make the final volume of chilled cell suspension to 200 µl in a safe-lock tube.Uniformly re-suspend the cells by pipetting. To this chilled cell suspension, add 0.25-1.5 µg DNA (pDH4 plasmid) and transfer the entire mixture to 0.2 cm electroporation cuvette. Electroporate the mixture using Gene Pulser at a setting of 2.3 kV, 50 mFd and 100 Ω. Note: Perform Steps 17-22 strictly on ice. To the electroporation cuvette, immediately add 800 µl of 1 M sucrose solution (stored at room temperature).Spread 200 µl of the cells transformed with pDH4 on SD minimal medium (containing 0.3 M sucrose) plates using L-spreader. Incubate these plates at 25 °C for 3-4 days for appearance of transformants positive for histidine prototrophy (as replicating vector pDH4 has DhHIS4 gene as the selection marker). Note: We haven’t used DhHIS4 as the selection marker in other yeast lines. An extra sample is always used as a control where no DNA will be added.Around 3,500 colonies would appear on the plate transformed with 0.25 µg of pDH4 plasmid DNA. No colony will appear in control transformation without DNA."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}