{
  "id": 2468,
  "origin_website": "Cell",
  "title": "Making Droplet-Embedded Vesicles to Model Cellular Lipid Droplets",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nFormation of Giant Unilamellar Vesicles (GUVs)\nTiming: 3 h\nElectroformation of GUVs which will serve as the necessary bilayers for the production of DEV.\nWash the two ITO coated glass plate and the PDMS spacer with water.\nDry the two ITO coated glass plate and the PDMS spacer and wash it with ethanol.\nCritical: When chloroform is used, work under a laminar flow hood and wear gloves.\nWash the two ITO coated glass plate with chloroform.\nNote: ITO coated glasses and PDMS chamber can be reused dozens of times to generate GUVs.\nDilute a DOPC 99.5% (w/w) and Rh-DOPE 0.5% (w/w) mixture in 200 μL of chloroform at 2 mg/mL for DOPC.\nHomogenize the phospholipid mixture by vortexing.\nCollect 20 μL with a microsyringe and make little droplet spots (2 μL) on the ITO coated glass inside the PDMS chamber (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/196-Fig2.jpg\nFigure 2. GUV Formation\n(A) Step by step schematic illustration of the GUV formation protocol. From the left to the right: Deposit of the phospholipid mixture diluted in chloroform on the conductive face of the ITO coated glass plate (step 6); Lipid mixture is dried under vacuum during 30 min (step 8); Electroformation chamber is formed and sucrose solution is added (step 9), then submitted to a AC current of 1.4 Vpp (step 10); GUVs are collected into Eppendorf tube (step 11).\n(B) Picture of the sucrose solution injection into the electroformation chamber. Left: beginning of the injection. Right: end of the injection (step 9).\n(C) Electroformation chamber connected to the signal generator in order to apply AC current (step 10).\n(D) Illustration of the collect of the sucrose solution containing the GUV with a Pasteur pipette (step 11).",
    "Note: The phospholipid mixture can be stored at −20°C by saturating the upper volume of the tube with argon before closing the tube. If there is no evaporation or oxidation, the mixture can be reused for a few weeks.\nSeal the electroformation chamber with the other ITO coated glass plate as shown in (Figure 1[href=https://www.wicell.org#fig1]F).\nDesiccate the lipid film during 1h in a vacuum chamber (Figure 2[href=https://www.wicell.org#fig2]A).\nClip the chamber with fold back clips as shown in (Figure 1[href=https://www.wicell.org#fig1]F) and add very slowly 3 mL of sucrose solution in the chamber (Figures 2[href=https://www.wicell.org#fig2]A and 2B, Methods Video S1[href=https://www.wicell.org#mmc1]).\nCritical: While injecting sucrose into the chamber, try to minimize the number of air bubbles that form in the sucrose volume. This may alter the formation of GUV.\nApply 100 Hz AC voltage at 1.4 Vpp by using conductive alligator clip between the generator and the aluminum strips. Maintain it for at least 2h (Figures 2[href=https://www.wicell.org#fig2]A and 2C).\nCollect GUVs gently with a Pasteur pipette in two Eppendorf tubes of 1,5mL (Figures 2[href=https://www.wicell.org#fig2]A and 2D, Methods Video S2[href=https://www.wicell.org#mmc2]).\n        Your browser does not support HTML5 video.\n      \nMethods Video S1. The Sucrose Solution Is Injected in the GUV Electroformation Chamber without Making Air Bubbles, Related to Step 9\nStore them at 4°C.\nNote: GUVs stored at 4°C can be used during approximately two weeks.",
    "Note: To check if the electroformation process is successful, one can observe the GUVs solution under confocal microscopy (see section observation of DEVs for more details) by using the following dilution: 20 μL of the sucrose-GUV solution into 80 μL of HKM buffer on a Menzel coverslip. This dilution allows GUVs to settle down on the coverslip, since the HKM buffer is lighter than the sucrose encapsulated by the GUVs. By using a 10× objective dozens of GUVs, between 5 μm and 40 μm in size, can be observed per target region.\n        Your browser does not support HTML5 video.\n      \nMethods Video S2. Gentle Collection of GUV Solution Thanks to a Pasteur Pipette, Related to Step 11\nFormation of Droplet-Embedded Vesicles (DEVs)\nTiming: 20 min\nProduction of DEVs by contacting the bilayers of the GUVs with an oil emulsion.\nPrepare two empty Eppendorf tubes of 0.5 mL cleaned with air stream.\nAdd 70 μL of HKM buffer in the first Eppendorf tube (Figure 3[href=https://www.wicell.org#fig3]A). Make sure your HKM buffer is clean and dust-free by filtering it with 0.45μm filter. To double check if the buffer does not contain huge dusts, one can place a small volume of buffer (e.g., 5 μL) on a Menzel coverslip and observe it under the microscope.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/196-Fig3.jpg\nFigure 3. DEVs Formation by Mixing an Oil Nano-Emulsion with a GUV Solution\n(A) Step by step schematic illustration of how to make the nano-emulsion with triolein and HKM. From the left to the right: HKM and oil are added in an Eppendorf tube (steps 14 and 15); the Eppendorf tube is vortexed resulting in a coarse emulsion (step 18); the solution is sonicated until a cloudy nano-emulsion is obtained and then homogenized by vortexing (steps 19–21).\n(B) The micropipette tip cone is truncated, used in (step 17).",
    "(C) Picture of a truncated micropipette tip cone (right) compared to a normal tip cone (left), (step 17).\n(D) Oil-buffer solution before (left, step 15) and after sonication (right, step 21), resulting in a cloudy solution indicating the formation of the nano-emulsion.\n(E) Step by step protocol of the mixing of GUVs solution with the nano-emulsion to form DEVs. From left to right: the nano-emulsion is injected into the GUV solution with the truncated cone (steps 22 and 23). The double arrow heads designate the back and forth mixing with the micropipette to gently mix the emulsion with the GUVs (step 24). Before observation, the previous solution is homogenized with a rotating tube mixer to allow further mixing (step 25). After 5 min, the DEV solution is ready for observation. (step 26).\nAdd 5 μL of triolein oil into the HKM volume and close the Eppendorf tube (Figure 3[href=https://www.wicell.org#fig3]A).\nOptional: Different oil types can be used and be fluorescently stained for subsequent imaging by fluorescence microscopy.\nIn the other Eppendorf tube, add gently 50 μL of previously produced GUVs solution (from step 12) and keep it within easy reach.\nPrepare a 200 μL micropipette to collect the 50 μL and cut the cone of the micropipette 5 mm from the tip to obtain a large aperture. This modified cone is further referred as truncated cone. (Figures 3[href=https://www.wicell.org#fig3]B and 3C, Methods Video S3[href=https://www.wicell.org#mmc3]).\nVortex the first Eppendorf tube for 10 s to make a coarse emulsion (Figure 3[href=https://www.wicell.org#fig3]A).\nSonicate this emulsion with the water bath sonicator for 10 s until the solution starts to be cloudy. Do not sonicate too long to avoid the formation of a gel phase. (Figure 3[href=https://www.wicell.org#fig3]A).\nVortex again during 10 s (Figure 3[href=https://www.wicell.org#fig3]A).",
    "Sonicate again during 10 s to obtain a nano-emulsion (Figure 3[href=https://www.wicell.org#fig3]A). At this stage, you are supposed to get a milky solution (Figure 3[href=https://www.wicell.org#fig3]D), if necessary, vortex and sonicate it again.\nCollect rapidly a volume of 50 μL of the nano-emulsion with the truncated cone (Figures 3[href=https://www.wicell.org#fig3]B, 3C, and 3E).\nPour this volume very gently into the second Eppendorf tube containing the GUVs solution (Figure 3[href=https://www.wicell.org#fig3]E, Methods Video S4[href=https://www.wicell.org#mmc4]).\n        Your browser does not support HTML5 video.\n      \nMethods Video S3. Truncating a Micropipette Cone before Mixing the GUV Solution and the Nano-Emulsion, Related to Step 17\nMix back and forth very gently with the same truncated pipette tip to homogenize the GUVs and nano-droplets mixture (Figure 3[href=https://www.wicell.org#fig3]E, Methods Video S4[href=https://www.wicell.org#mmc4]).\nNote: This step brings GUVs into contact with the nano-oil droplets. It promotes the formation of DEV and it is a crucial step for a high yield of DEVs.\nThen, immediately place the Eppendorf tube on a rotating tube mixer during 5 min. This allows further mixing of the GUVs and the nano-emulsion while avoiding precipitation and aggregation of the DEVs and GUVs at the bottom of the Eppendorf tube. (Figure 3[href=https://www.wicell.org#fig3]E).\nDEV solution is ready for observation.\n        Your browser does not support HTML5 video.\n      \nMethods Video S4. Gentle Mixing of the Nano-emulsion and the GUV Solution by Making Back and Forth Aspiration with a Micropipette, Related to Step 24\nObservation of Droplet-Embedded Vesicles (DEVs)\nTiming: 10 min\nHow to observe the DEVs produced in the previous step using a confocal microscope\nTake a Menzel glass coverslip for confocal microscopy observation.\nWith a pipette, place an 80 μL of the BSA solution on the coverslip and wait for 10 s (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/196-Fig4.jpg\nFigure 4. Observation of DEVs under the Confocal Microscope",
    "(A) Step by step illustration of the DEV observation by microscopy. From left to right: the BSA solution is placed on the glass coverslip (step 28) and then discarded after 10 s. The HKM buffer solution is used to rinse the BSA-treated spot; rinsing is performed three times for the efficient removal of the excess BSA (step 30). An 80 μL HKM solution is then deposited on the washed coverslip and an 20 μL of DEV solution added to it (step 31). The coverslip is placed under the microscope for observation (step 35).\n(B) Picture of the deposited droplet of HKM (step 31) on the coverslip before adding the DEVs and the observation.\n(C) Picture of the coverslip of the DEVs in the HKM solution ready for observation (end of step 31).\n(D) Representative microscope image of DEVs at 10 min, after DEVs settled down (end of step 35) on the glass coverslip (brightfield 10× objective). DEVs and GUVs without droplet can be seen in the same area. Nano-emulsion oil droplets, not incorporated in GUVs, are indicated by black arrowheads.\n(E) Confocal brightfield and fluorescence images of a DEV, side view. The DEV is maintained thanks to a micropipette. Rh-PE is used to report for phospholipids. Objective 10×. Scale bar is 10 μm.\n(F) Brightfield and fluorescence side view of a DEV obtained with 63× oil objective. See that the droplet is embedded in between the two leaflets of the bilayer. Note that the phospholipid signal on the droplet monolayer is dimmed because light refraction due to index mismatch between the oil and the buffer (Chorlay and Thiam, 2020[href=https://www.wicell.org#bib2]); this observation mainly happens with a 63× oil objective. Scale bar is 10 μm.\nRemove the BSA solution with the pipette. (Figure 4[href=https://www.wicell.org#fig4]A).",
    "To remove the excess of BSA from the coverslip, rinse the BSA spot on the coverslip with 80 μL of HKM buffer and discard this solution (Figure 4[href=https://www.wicell.org#fig4]A, Methods Video S5[href=https://www.wicell.org#mmc5]). Repeat this process three times.\nDeposit again 80 μL of the HKM buffer on the glass coverslip, on the BSA-treated spot (Figures 4[href=https://www.wicell.org#fig4]A and 4B) and place the coverslip on the microscope for observation (Figure 4[href=https://www.wicell.org#fig4]C).\nPrepare a 20 μL micropipette to collect 10 μL of the DEV solution with pipette tip also cut 5 mm from the tip.\nCollect gently 10 μL of the DEVs solution with the micropipette and pour it in the HKM solution on the glass coverslip (Figure 4[href=https://www.wicell.org#fig4]A).\nOptional: You can add oil markers such as Bodipy to the DEV solution to visualize the oil droplets by fluorescence microscopy.\nWait 5 min for the DEVs to settle down on the coverslip and for the excess non-GUV-incorporated nano-droplets to float at the top of the sample, cleared from the observation regions of the DEVs (Chorlay and Thiam, 2018[href=https://www.wicell.org#bib1]; Thiam et al., 2013[href=https://www.wicell.org#bib7]).\nDEVs that settle down on the coverslip can be pre-visualized by an 10× objective (Figure 4[href=https://www.wicell.org#fig4]D).\nNote: DEVs can be easily recognized thanks to the dark contrast in brightfield of their oil droplets (due to their refractive index) (Figure 4[href=https://www.wicell.org#fig4]E).\n        Your browser does not support HTML5 video.\n      \nMethods Video S5. Washing the Excess of BSA on the Coverslip before Observation with HKM Buffer, Related to Step 30"
  ],
  "subjectAreas": [
    "Cell Membrane",
    "Microscopy",
    "Cell Biology",
    "Biophysics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}