{
  "id": 4135,
  "origin_website": "Cell",
  "title": "Protocol for Single-Cell Analysis of Tumor-Infiltrating B Cells Isolated from Human Breast Cancer Tissue Before and After Neo-adjuvant Chemotherapy",
  "procedures": [
    "Step-by-Step Method Details\nStep-by-Step Method Details\nGeneration of Single-Cell Suspension Using Tumor Tissues\nTiming: ∼4 h\nThis step provides a detailed procedure for tissue dissociation and cell suspension preparation.\nTake out the tissue from the MACS Tissue Storage buffer. Wash tissue samples with excess cold PBS on ice to prevent the contamination of peripheral blood.\nCut tissue samples into small pieces (1–2 mm diameter) with autoclaved surgical instruments (Huang et al., 2018[href=https://www.wicell.org#bib4]; Su et al., 2018a[href=https://www.wicell.org#bib11]) on ice.\nTransfer the tissue pieces into MACS C Tube containing pre-warmed (37°C) digestion solution.\nAttach C Tube upside down onto the sleeve of the gentleMACS Dissociator and choose the program: h_tumor_01.\nAfter completion of the program, detach C Tube and incubate sample for 2 h at 37°C under continuous rotation using the MACSmix Tube Rotator. During digestion, vortex the tissue pieces in solution every 15 min.\nRepeat step 4 and apply the suspension to 100 μm and 70 μm cell strainer placed on a 50 mL tube successively on ice. Wash the cell strainers twice with 20 mL sterile cold PBS.\nPre-cool the spin to 4°C. Centrifuge at 350 ×g for 10 minutes at 4°C and discard supernatant. Resuspend cells with cold PBS and place the tube on ice.\nIsolation of Tumor-Infiltrating B Cells\nTiming: ∼3 h\nThis step provides a detailed procedure for viable B cell isolation from the cell suspension of tumor tissue.\nCount cells with hemocytometer.\nTransfer 10 μL of the cell suspension under the cover slip on the hemocytometer. Wait until capillary action draw the fluid inside and the chamber is fulfilled.\nObserve the hemocytometer under the microscope. Count the cells in four sets of 16 squares. For cells located on the line, only count ones on the left-hand or top boundary line.",
    "No. of cells/mL = (Cell count)/4(number of chambers counted) × 104.\nResuspend cells up to 107 cells per 80 μL of cold PBS with 2% FBS and 2 mM EDTA, and add 20 μL of Fc receptor blocking reagent (Cat# 130-059-901, Miltenyi Biotec). Mix the cells and incubate for 10 min at 4°C. Use a small number of cells for single channel control and isotype staining.\nAdd Pacific Blue™ anti-human CD45 (Cat# 304022, Biolegend) and PE anti-human CD19 (Cat# 392506, Biolegend) antibodies to the suspension and incubate at 4°C for 30 min in the dark (Su et al., 2018b[href=https://www.wicell.org#bib12]).\nWash with cold PBS by centrifugation at 350 ×g for 5 min at 4°C.\nTo exclude dead cells, use calcein AM (Cat# C3100MP, ThermoFisher Scientific) to stain live cells, and TO-PRO-3 (Cat# T3605, ThermoFisher Scientific) to stain dead cells. Only cells that are both positive for calcein AM and negative for TO-PRO-3 could be gated as viable (Figure 1[href=https://www.wicell.org#fig1]A) (Puram et al., 2017[href=https://www.wicell.org#bib8]). Prepare calcein AM solution by dissolving 50 μg reagent with 50 μL DMSO. Prepare TO-PRO-3 solution by diluting 10 μL reagent with 20 μL DMSO. Restore the solution to 20∼25°C before use.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/90-Fig1.jpg\nFigure 1. B Cell Isolation from Paired Breast Cancer Tissues of Patients before and after Receiving Neo-adjuvant Chemotherapy (NAC)\n(A) Gating strategy of tumor-infiltrating B cells in FACS.\n(B) Number of B cells isolated from paired breast cancer tissues of five patients.\nPrepare calcein AM and TO-PRO-3 staining solution by diluting the solution with PBS (1:1000 for both). Incubate the cells in calcein AM and TO-PRO-3 staining solution at 20∼25°C for 15 min in the dark.\nWash with cold PBS and centrifuge at 350 ×g for 5 min at 4°C. Resuspend the cells in 500 μL of cold PBS on ice.",
    "Perform fluorescence activated cell sorting (FACS) with flow cytometer (BD Biosciences) using 488 nm (calcein AM, 530/30 filter), 640 nm (TO-PRO-3, 670/14 filter), 405 nm (Pacific blue™, 450/50 filter) and 561 nm (PE, 586/15 filter) lasers. Standard forward scatter height versus area criteria were used to discard doublets and capture singlets. Collect the calcein AMhigh TO-PRO-3low CD45+ CD19+ cells with tube containing sterile cold PBS with 10% FBS on ice. The time for cell sorting should not exceed 4–5 h.\nPipette the sorted cell suspension and remove 20 μL to a new tube and add 20 μL of 0.4% Trypan Blue (Cat# 15250061, ThermoFisher Scientific). Mix by gentle pipetting and use 10 μL to fill the hemocytometer.\nCount the number of live (seen as bright cells) and dead cells (stained blue) with microscope. No. of cells/mL = (Cell count)/4(number of chambers counted) × 2 (Dilution with Trypan Blue) × 104.\nDivide the live cell count by the total cell count to calculate the viability.\nStorage of B Cells\nTiming: ∼20 min\nThis step provides a detailed procedure for storage of B cells for single-cell analysis or other application.\nPre-cool the spin to 4°C. Centrifuge the isolated viable B cells at 350 ×g for 5 min at 4°C. Discard the supernatant.\nResuspend the cells with the 1 mL of freezing medium (90% FBS supplemented with 10% DMSO).\nRemove the cell suspensions into cryovials.\nPut the vials in a gradient cooling box and store at -80°C.\nAfter 24 h, transfer the vials containing cells to liquid nitrogen.\nThawing and Resuspension of Frozen Cells\nTiming: ∼20 min\nThis step provides a detailed procedure for thawing and resuspension of frozen cells.\nAfter confirming the treatment information of patients, pick the paired samples of breast cancers before and after neo-adjuvant chemotherapy.",
    "Remove the cryovials from liquid nitrogen and thaw in the water bath at 37°C.\nPre-cool the spin to 4°C. Transfer thawed cells to a 50 mL conical tube and dilute cells with 30 mL of DMEM containing 10% FBS. Centrifuge at 350 ×g for 5 min at 4°C.\nRemove most of the supernatant and leave ∼1 mL.\nAdd 9 mL of cold Dulbecco’s PBS + 0.04% BSA containing 10% FBS.\nDetermine the cell viability and concentration with 0.4% Trypan Blue with Countess II Automated Cell Counter. Take out 20 μL of cell suspension and place in an Eppendorf tube. Add 20 μL of 0.4% Trypan Blue and mix gently.\nCount cells with Countess II Automated Cell Counter. Load 10 μL of the mixure into a disposable Countess chamber slide. Insert the slide into the instrument and press “Capture” to read the concentration and viability.\nCentrifuge cell suspension at 350 ×g for 5 min at 4°C.\nDiscard the supernatant and resuspend cells with cold DPBS + 0.04% BSA at concentration of 1 × 105–2 × 105 cells/mL (Savas et al., 2018[href=https://www.wicell.org#bib9]) on ice.\nLoad the cell suspension to v3 reagent kit (10 × Genomics, Pleasanton, CA, USA) for single-cell RNA sequencing following the 10 × Genomics Chromium single-cell protocol for the v3 reagent kit."
  ],
  "subjectAreas": [
    "Immunology",
    "Single Cell",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}