{
  "id": 12921,
  "origin_website": "Jove",
  "title": "Force and Position Control in Humans - The Role of Augmented Feedback",
  "procedures": [
    "The protocol described here followed the guidelines of the ethics committee of the University of Freiburg and was in accordance with the declaration of Helsinki (1964).\n1. Ethical Approval - Subject Instruction\nBefore the actual experiment, instruct all subjects about the purpose of the study and potential risk factors. When applying transcranial magnetic stimulation (TMS), there are some medical risks including any history of epileptic seizures, metal implants in eyes and/or head, diseases of the cardiovascular system and pregnancy. Exclude any subject affirming to one of these risk factors from the study.\nInclude only healthy individuals in the study. Exclude individuals with any neurological, mental and/or orthopaedic diseases.\n2. Subject Preparation\nSubject placement\n\t\nThroughout the entire experiment, seat subjects in a comfortable chair. Fix the head of the participant using a cast embracing the neck, ensuring a stable head position and avoiding any movements of the head relative the TMS coil.\nPlace the right arm of the subjects in a custom-built arm rest to minimize movements of the wrist. Fix the subject's right index finger to a splint mounted to the arm of a robot. Align the axis of rotation of the robot arm with the metacarpophangeal joint of the right hand so that the joint centre matches the rotational centre of the robot.\nForce recordings\n\t\nMeasure the force applied by the subjects by a torquemeter mounted in the robot arm and measure the position of the robot arm (corresponding to the position of the index finger) by a potentiometer connected to the rotational axis of the robot 22.\nElectromyography (EMG)\n\t\nUse a bipolar configuration of surface electrodes to measure electrophysiological responses elicited by TMS as well as muscular activation produced by the subjects.",
    "Before attaching the electrodes to the skin over the first dorsal interosseus muscle (FDI) and the abductor pollicis brevis (APB) of the right hand, shave the skin of the subjects, then slightly abrade it using sandpaper or abrading gel and disinfect it with propanol.\nFollowing this, attach self-adhesive EMG electrodes to the skin over the muscle bellies of the FDI and APB. Place an additional reference electrode on the olecranon of the same arm.\nCable-connect all electrodes to an EMG amplifier and to an analogue-digital converter. Amplify the EMG signals (x 1,000), bandpass-filter (10 - 1,000 Hz) and sample at 4 kHz. Store the EMG signals for offline analysis.\nTMS\n\t\nUse a figure of eight coil attached to a TMS stimulator to stimulate the contralateral motor cortical hand area.\nFind the optimal position of the coil relative to the scalp for eliciting motor evoked potentials (MEPs) in the FDI muscle by a mapping procedure:\n\t\t\nPlace the coil approximately 0.5 cm anterior to the vertex and over the midline with the handle pointing at 45° anticlockwise relative to the sagittal plane, inducing a posterior-anterior flow of the current in the centre of the coil.\nAt the beginning, choose a small stimulation (e.g., below 30% maximum stimulator output, MSO) intensity to get the subjects accustomed to the magnetic pulses.\nSubsequently, increase the stimulation intensity in small steps, for example 2 - 3% maximum stimulator output (MSO) and move the coil in the frontal-rostral and medio-lateral direction in order to find the optimal site (hotspot) for stimulating the FDI muscle. The hotspot is defined as the place where the greatest MEP can be observed at a given stimulation intensity.",
    "After finding the FDI hotspot, determine resting motor threshold (MT) as the minimum intensity required to evoke MEP peak-to-peak amplitudes in the EMG larger than 50 µV in three out of five consecutive trials 18. Inspect the size of the MEPs displayed online on the computer screen.\nAfter eliciting MEPs with 1.0*MT, constantly decrease the stimulation intensity of the TMS machine in steps of 2% MSO until the MEP can no longer be observed and an EMG suppression of the ongoing muscle activity becomes apparent.\n\t\tNote: In order to depict the TMS induced EMG suppression it is necessary to apply a high number of stimulations (see section 5. \"Data Processing\")\n3. Feedback Presentation\nDivide the participants into three groups (pF, fF, CON).\nInstruct subjects from the position feedback group (pF) in half of the trials to receive feedback about the position of the index finger (position feedback) when moving the index finger by pressing against the robotic device.\nIn the other half of the trials, instruct subjects to receive feedback about the applied force while moving the robotic device (force feedback).\n\tNote: In reality, however, they always receive the same feedback (position feedback).\nInstruct subjects from the force feedback group (fF) to receive force feedback in half of the trials and receive position feedback in the other half.\n\tNote: In fact, this group is solely provided with force feedback.\nDo not instruct the control group (CON) about the source of the feedback. Note: The control group receives force feedback in one half of their trials and position feedback in the other half.\nRandomly alter the order of the sessions, that is, whether trials start with force or position feedback, in all groups.",
    "Visually display the force and the position feedback on a computer screen placed 1 m in front of the subjects.\nIn each condition, present a target line corresponding to 30% of the subject's individual maximal voluntary force, or the finger angle of the index finger at 30% maximally voluntary contraction (MVC), on the computer screen and instruct the subject to match the target line as closely as possible.\n4. Maximal Isometric Force\nAfter the subject is prepared (EMG), perform three isometric maximum voluntary contractions (MVC), consisting of a gradual increase in isometric force from zero to maximum over a 3 sec time span and the maximal force held for 2 sec 20,21.\nVerbally encourage the subject to achieve maximal force. After each trial, allow the subjects to rest for 90 sec to avoid fatigue.\n5. Experimental Procedure\nFatiguing Motor Task- Sustained contractions.\n\tNote: The fatiguing task consists of two sustained contractions executed on separate days.\n\t\nInstruct the subjects to match the target line of 30% MVC for as long as possible with a line corresponding to the applied force or the position of their finger corresponding to a force level of 30% MVC.\n\t\tNote: The target line during the position feedback condition (pF-group) therefore corresponds to the finger angle when subjects match the force level of 30% MVC.\nAsk the subjects to hold the contractions until task failure, which is defined as the point where the subjects are no longer able to hold the target force inside a 5% window of the target force over a period of 5 sec (fF-group). For the pF-group, define task failure as when the participants are unable to maintain the finger angle within 5 % of the required target angle for 5 sec 12,23.",
    "Ensure that the two sustained contractions are separated by at least 48 hr.\nTMS-protocol\n\tNote: The subthreshold TMS experiment is carried out on separate day to the fatiguing contractions. This is important as fatigue has an influence on the EMG suppression evoked by subTMS 24,25 so differences between force and position cannot be clearly identified. Separating the fatiguing contractions from the TMS measurements has the advantage that differences in the EMG suppression can now be clearly be attributed to the different interpretation of the feedback but has the limitation that the results can not directly be linked to the differences in the time to fatigue of the sustained contractions.\n\t\nConduct the part of the experiment using TMS (see also section 3. \"Feedback presentation\") on a separate occasion than the fatiguing experiments. Initially, follow the exact same procedure as for the fatiguing contraction (e.g., MVC contractions) but this time, ask the subjects to hold the contractions only as long as the TMS stimulation lasts. Thus, the contractions are not fatigable and only held for approximately 100 sec during each TMS trial.\nProvide a break of 3 min between trials to minimize any bias of fatigue.\n6. Data Processing\nTMS\nApply a total of 100 sweeps, 50 sweeps with and 50 sweeps without stimulation, with an inter-stimulus interval ranging from 0.8 to 1.1 s 20,21,25,26. This short interstimulus interval makes sure that the subjects do not need to hold the contractions for too long so fatiguing effects can be minimized.\nTo analyse if the TMS stimulation caused a facilitation (MEP) or an EMG suppression, subtract the rectified and then average 50 sweeps with stimulation (stimulated EMG) from the 50 sweeps without stimulation (control EMG) 20,21,25-27.",
    "Note: The onset of the EMG suppression is defined as the time point where the averaged EMG for the sweeps with the stimulation is less than the control EMG for at least 4 msec in a time frame of 20 to 50 msec after the TMS pulse. The end of the suppression is defined as the instant when the stimulated EMG is greater than the control EMG for at least 1 msec and the extent of the suppression is calculated as percentage change (control-stimulated/meancontrol*100).\nUse the sweeps without TMS stimulation for the calculation of the background EMG activation and average them over the same time window as the trials with stimulation 20,21,25,26.\nEMG\nDetermine the maximal EMG activity by calculating the root-mean-square value recorded in a 0.5s time window around the peak force measured during the MVC tests 20,21.\nFor the sustained contractions, analyse the EMG by building 8 sec long bins where the root-mean-square of the rectified EMG is calculated and normalized to the EMG activity obtained during the MVC trials 20,21.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}