{
  "id": 6365,
  "origin_website": "Bio",
  "title": "Evaluation of Anticancer activity of Silver Nanoparticles on the A549 Human Lung Carcinoma Cell Lines through Alamar Blue Assay",
  "procedures": [
    "Alamar blue assayHarvest the cells when they are in log phase of growth and count the cells using a hemocytometer when the cells in the flask are confluent (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20181227/20181227202840_6903.jpgFigure 2. Cell counting. A. Load the hemocytometer chamber by pipetting the cell suspension under the coverslip. B. Place the hemocytometer under the microscope and count the cells.Seed the cells in a 96-well plate at a cell density of 1 x 104 cells per well in 100 µl complete medium, so that 70-80% confluency will be attained after 1 day (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20181227/20181227202901_0398.jpgFigure 3. Cell seeding. A. Dilute and seed the wells to a cell density of 1 x 104 cells. B. The figure represents a complete seeded micro-well plate.Keep the seeded plate in a CO2 incubator at 37 °C, 5% CO2, 95% humidity for 24 h to facilitate growth and adherence of cells to the plate surface (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20181227/20181227202917_4162.jpgFigure 4. Incubate the 96-well plate in a CO2 incubatorWash each well twice with 1x PBS and treat the cells with different concentrations of silver nanoparticles in 100 µl complete medium. Include proper controls of blank medium, untreated seeded wells. Incubate the cells for another 24 h in an incubator (Figure 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20181227/20181227202937_7128.jpgFigure 5. Treatment of cells with silver nanoparticlesAdd Alamar blue aseptically in an amount equal to 10% volume of the wells (Figure 6).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20181227/20181227202958_0020.jpgFigure 6. Add Alamar blue to each wellIncubate it for 2-4 h in a CO2 incubator. The optimum incubation time varies with cell type and seeding density.Determine the cell toxicity and proliferation by recording the absorbance at wavelength 570 nm and 600 nm after incubation. Complete media without cells, including Alamar blue, should be considered as blank (Figure 7).Spectrophotometric determination of cell proliferation through Alamar blue assayThe difference in percentage reduction of cells between treated and control cells:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20181227/20181227203346_1955.",
    "jpgwhere,E1 = Molar extinction coefficient (E) of oxidized Alamar blue at 570 nm, 80586E2 = Molar extinction coefficient of oxidized Alamar blue at 600 nm, 117216A1 = Absorbance of sample wells at 570 nmA2 = Absorbance of sample wells at 600 nmB1 = Growth control absorbance at 570 nmB2 = Growth control absorbance at 600 nmFluorescence-based measurement of cell toxicity through Alamar blue assayObserve the fluorescence at excitation and emission wavelength of 560 and 590 nm respectively.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20181227/20181227203409_3635.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20181227/20181227203013_9206.jpgFigure 7. Absorbance recorded through Elisa plate reader MTT assayFreshly harvest the cells in cell culture flask and count the cells using a hemocytometer when the cells in the flask become confluent.Seed the cells in a 96-well microplate at a cell density of 1 x 104 with 100 µl complete medium per well.Incubate the plate at 5% CO2, 37 °C, 95% humidity for 24 h till the culture in the plate is 70%-80% confluent.Wash each well with 1x PBS and treat the cells with varying concentrations of silver nanoparticles. Take proper controls, including blank and untreated wells. Keep the plate in the incubator for another 24 h.Add MTT reagent to an amount equal to 10% of the total volume of wells. For a total volume of 100 µl, add 10 µl of MTT reagent to the wells, including the controls.Incubate the plate for 2-4 h again (Incubation time varies with the type of cell lines used for the study).After the formation of formazan crystals during incubation, add 100 µl of solubilization buffer to the wells. Stir gently to ensure proper solubilization.Record the absorbance at 570 nm using spectrophotometer or ELISA plate reader. Measure the reference wavelength higher than 650 nm to calculate the background noise of cell debris and undissolved particles.Spectrophotometric determination of cell proliferation through MTT assayimgsrc:https://en-cdn.bio-protocol.org/attached/image/20181227/20181227203442_7882.",
    "jpgMerits and LimitationsMTT method is an endpoint analysis method, though it is one of the most widely investigated methods, it has limitations owing to its cytotoxic nature. It has been reported that the formed formazan crystals puncture the cell membrane during exocytosis, thus harming the cell. On the contrary, Alamar blue allows certain advantages over MTT assay including time course measurement analysis, increased sensitivity and accuracy, no cell lysis and is suitable for post-measurement functional studies. A basic disadvantage of using tetrazolium and resazurin dye for the evaluation of cytotoxicity is there need to incubate the cells with these reduction dyes to produce the signals. This tends to result in an increased probability of occurrence of artifacts due to the interaction between the test compound, chemical used for the assay and the cell biochemistry."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}