{
  "id": 8622,
  "origin_website": "Jove",
  "title": "Using Zebrafish Larvae to Study the Pathological Consequences of Hemorrhagic Stroke",
  "procedures": [
    "Zebrafish were raised and maintained at The University of Manchester Biological Services Unit under standard conditions as previously described21. Adult zebrafish husbandry was approved by the University of Manchester Animal Welfare and Ethical Review Board. All experiments were performed in accordance with U.K. Home Office regulations (PPL:P132EB6D7).\nNOTE: Transgenic lines used in this study include macrophage-specific lineage mpeg1:mCherry (constructed in-house as previously described22), neutrophil-specific mpo:GFP23,erythroid-specific gata1:dsRed24 and ubiq:secAnnexinV-mVenus, a reporter for cell death (re-derived in house25)on wild-type, nacre (mitfaw2/w2) and mutant (bbhm292) backgrounds. Figure 1 shows the experimental timeline.\nimgsrc://cloudfront.jove.com/files/ftp_upload/59716/59716fig1.jpg\nFigure 1: Graphic of experimental timeline to characterize brain injury, locomotor and neuroinflammatory outcomes. ICH, intracerebral hemorrhage; bbh, bubblehead. Figure has been reproduced from Crilly et al.20 with permission under a Creative Commons license. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/59716/59716fig1large.jpg]\n1. Day 0: Egg production and collection\nCollect fertilized embryos from natural spawning in breeding boxes produced from 1 male and 1-2 female adult zebrafish.\n\tNOTE: For atorvastatin protocol any wildtype/transgenic animals can be used however hemorrhage rates differ slightly between strains.\nIncubate 100 embryos at 28 °C in standard E3 embryo medium per Petri dish and stage according to standard guidelines26.\nAt ~6 hours post fertilization (hpf) remove dead and unfertilized embryos from the dish using a Pasteur pipette.\n2. Day 1: Atorvastatin treatment at 24 hpf\nDechorionate embryos for atorvastatin treatment using sharp ultra thin dissection forceps27. Numbers required for experimentation can be adjusted accordingly.\nAdd 30 mL of E3 embryo medium to two clean Petri dishes. Use one dish for 100 embryos.\n\tNOTE: If plates are designed for cell culture, dechorionated zebrafish at this early stage often stick to the bottom. To avoid this, rinse the plates thoroughly in clean water before use.",
    "Remove 60 µL of embryo water from the treatment plate and add 60 µL of 0.5 mM atorvastatin (ATV). At a 0.5 mM stock concentration, the above dilution will result in a final concentration of 1 µM which will result in ~20% of larvae non-hemorrhaged (ICH-) and ~80% of larvae hemorrhaged (ICH+). Use the other plate for untreated controls\n\tNOTE: Atorvastatin is solubilized in distilled water (3 mg into 10 mL) to make a 0.5 mM stock solution. Incubate overnight at room temperature in the dark with agitation as solubilization takes some time. Complete solubilization can take up to 1 week. Do not use DMSO. Solution is aliquoted and stored at -20°C. Do not freeze thaw.\nUsing a Pasteur pipette, transfer 100 embryos in as little water as possible to the treatment plates.\nIncubate the plates at 28 °C.\n\tNOTE: ICH will occur between 33 and 48 hpf. Atorvastatin does not need to be removed as incubation longer than 24 h does not cause any further developmental issues.\n3. Day 2: Separating ICH- and ICH+ populations at 50 hpf\nSeparate ICH+ fish from ICH- populations and transfer to new dishes for ease.\n\t\nIf using the ATV model at a concentration of 1 µM, 75-100% of larvae will exhibit hemorrhage (ICH+) at this time point.\n\t\tNOTE: The response of the larvae differs between strains, if larvae are not hemorrhaging at the desired frequencies, use a fresh batch of atorvastatin or a higher concentration. If larvae have not exhibited hemorrhage by 48 hpf then consider them ICH-.\nIf using the bbh model, all homozygous mutants will exhibit hemorrhage by 48 hpf. If using a heterozygous incross, the ICH- heterozygous and wildtype siblings can be used as control animals for experiments.",
    "If necessary, anaesthetize the larvae by adding 0.02% MS222 to the E3 media. Using a Pasteur pipette, sort the larvae for presence of blood in the head into fresh E3 media. See Figure 2.\n\tNOTE: Blood in the head may appear in the fore, mid or hindbrain or in combination, and bleed volume can vary between animals. In the bbh mutants, ICH is often associated with severe edema recognizable by larger heads, wider space between the eyes and a more diffuse bleed. However not all ICH+ bbh larvae exhibit edema.\nimgsrc://cloudfront.jove.com/files/ftp_upload/59716/59716fig2.jpg\nFigure 2: ICH+ brain hemorrhage phenotypes. Examples of larval ICH phenotypes maintained on a transgenic gata1:DsRed reporter nacre background observed with a brightfield stereomicroscope (top panels) and fluorescence (bottom panel) at ~48 h post-fertilization. No hemorrhages were observed in ICH-larvae (left panels). A distinct accumulation of red blood cells in the forebrain and hindbrain (arrows) were observed in ICH+ larvae (right panels). Scale bars represent 250 µm. Figure has been reproduced from Crilly et al.20 with permission under a Creative Commons license. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/59716/59716fig2large.jpg]\n4. Day 3: Cell death and leukocyte analysis at 72 hpf\nScreen the larvae using a fluorescence microscope to ensure the expression of fluorescent protein.\n\tNOTE: In this study, transgenic ubiq:secAnnexinV-mVenus larvae were used to report brain cell death and double transgenic mpo:GFP;mpeg1:mCherry or ubiq:secAnnexinV-mVenus;mpeg1:mCherry used for leukocyte analysis.\nFill the lightsheet mounting chamber with E3 media containing 0.02% MS222.\nAnaesthetize the larvae using 0.02% MS222. Transfer larvae for mounting (n = 1-6) to a dry Petri dish surface in a single droplet. Remove as much liquid as possible.",
    "NOTE: 1.5% low melt agarose is prepared using 0.15 g of low melt agarose dissolved in 10 mL of E3 medium without methylene blue in a microwave and kept at 45 °C until use.\nAdd a drop of 1.5% low-melt agarose (maintained as liquid in a 45 °C heat block) to the larvae and using a 800 µm mounting capillary, and draw the larvae up head first. If positioning is not accurate the larvae can be expelled from the agarose and mounted again. Leave the capillary to cool before inserting into the lightsheet chamber.\n\tNOTE: Alternatively, a confocal microscope could be used for this procedure. For this, larvae should be mounted laterally in agarose on a glass bottom dish.\nAcquire z-stack images of the head between the eye lenses (~300 µm) and process to maximum intensity projection image.\n\t\nAnalyze brain region from images collected for total number of fluorescent cells and total intensity fluorescence20.\nCreate a time lapse video of multiple projection composites over 18-24 h to track leukocyte mobility and interaction with dying cells.\n\tNOTE: If long term live imaging is performed, only one larva is mounted in the capillary.\nWhen imaging is completed expel the larvae from the mounting capillary into a lethal overdose of 4% MS222 to euthanize.\n5. Day 3: Selecting larvae for motility assay at 72 hpf\nAnaesthetize larvae in the petri dishes with 0.02% MS222.\nRandomly select n = 24 larvae for motility assay and transfer into fresh E3 media and allow animals to recover from anesthetic.\n\tNOTE: Anesthetic at this point removes selection bias for slow swimmers that are easy to catch.\n6. Day 3-5: Assaying locomotion at 72, 96 and 120 hpf\nTransfer larvae selected at 72 hpf into E3 medium without methylene blue.",
    "NOTE: For assaying at 3 dpf allow the larvae ample time to recover from anesthetic (>1 h).\nPlate one larva in 1 mL per well of a 24-well plate using a pipette.\n\tNOTE: Cut the end of the pipette tip to avoid damaging the larvae. Plate size can be changed according to experimental design.\nLoad plates into the camera chamber and assay motion for 10 min using a white light startle routine to increase spontaneous swimming.\n\tNOTE: Swimming behavior was tracked using a camera chamber and tracking software (see the Table of Materials).\nRepeat experiment with the same larvae at 96 and 120 hpf. Move larvae from individual housing in assay plate to a Petri dish and incubate at 28 °C in between assays.\nAt assay completion, euthanize larvae in a lethal overdose of 4% MS222."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}