{
  "id": 13133,
  "origin_website": "Jove",
  "title": "Pavlovian Conditioned Approach Training in Rats",
  "procedures": [
    "All procedures have been approved by the University Committee on the Use and Care of Animals (UCUCA; University of Michigan, Ann Arbor, MI).\n1. Equipment and Software\nObtain commercial operant chambers and devices. See Materials Table.\nConduct training in rat operant conditioning chambers (24.1 cm width × 20.5 cm depth x 29.2 cm height), situated in sound-attenuating cabinets with ventilation fans to provide ambient noise.\nEquip each chamber with a pellet magazine (receptacle), located centrally in the 21.6 cm wide front wall of the operant chamber 3 cm above the stainless steel grid floor. Ensure that the pellet magazine contains an infrared sensor that is capable of detecting head entries into the device.\nConnect the pellet magazine to a pellet dispenser, which delivers banana-flavored food pellets (45 mg).\nIn a counter-balanced manner, position one retractable lever (CS) approximately 2.5 cm on either side of the pellet receptacle (left or right) 3 cm above the stainless steel grid floor.\nEnsure that the lever contains an LED cue light within it to make the extended lever more visually conspicuous.\nIf using a retractable lever, calibrate the lever by placing a 10 g calibration weight on top of the lever, and then adjusting the calibration screw (located on top of the device) with a hex nut wrench until the weight by itself is able to depress the lever.\nEquip a red house-light at the top of the chamber on the wall opposite the magazine receptacle.\n\tNote: A red house light is used to increase the conspicuousness of the illuminated lever.\n2. PCA Training\nPair-house adult male Sprague Dawley rats (250-300 g) upon arrival and leave them undisturbed for at least two days in the housing colony, which is maintained on a 12 hr light/dark cycle.",
    "Gently handle each rat for at least 1 min per day for two days in order to acclimate the rats to human contact. Provide rats ad libitum access to food and water in the housing colony.\nFamiliarize rats with the banana-flavored food pellets by placing food pellets in their home cages (approximately 15 pellets per rat) for two days, starting three days prior to PCA training.\n\tNote: If rats are pair-housed, it is useful to divide the pellets evenly on two sides of the home cage.\nPretraining Program\n\tNote: All of our programing is performed using MEDState Notation (for Med Associates, software), and the manual is available online (mednr.com/pdf/doc003_MedPCProgramr.pdf). Programs are written as unformatted text documents (e.g., ASCII or DOS text) using MedState Notation, saved with the proper extension (i.e., [filename].mpc), then translated using the MED-PC program, Trans IV. All of these steps are provided in more detail in the aforementioned programming manual.\n\t\nCreate a pretraining program that delivers fifty food pellets on a variable time (VT) 30 sec schedule 5 min after the start of the program (i.e., one food pellet is delivered on average every 30 sec, but the actual delivery varies randomly between 0-60 sec).\nWrite the pretraining program such that the red house light is on, but the lever remains retracted for the duration of the (approximately 25 min) program.\nPerform pretraining and all subsequent experimentation during the light cycle.\nOne day prior to PCA training, place each rat into an operant chamber, close and latch the chamber door, and close the sound-attenuating cabinet door.\nStart the pretraining program as soon as possible after placing each rat in its chamber.\nRemove each rat from its chamber as soon as possible after the program ends.",
    "Record the number of pellets consumed and exclude rats that do not consume all of the pellets from further testing.\nCreate a PCA training program that delivers 25 trials in approximately 40 min, beginning 1 min after the start of the program.\n\t\nWrite the program so that during each trial the lever is extended into the chamber and illuminated for 8 sec.\nProgram lever retraction to be followed immediately by the response-independent delivery of one food pellet into the pellet magazine.\nSeparate each trial on a VT 90 sec schedule (i.e., lever extension and subsequent food pellet delivery occurs on average every 90 sec, but the actual delivery varies randomly between 30-150 sec).\nPlace each rat into a conditioning chamber, close and latch the chamber door, and close the sound-attenuating cabinet door.\nStart the PCA training program as soon as possible after placing each rat in its chamber.\nRemove each rat from its chamber as soon as possible after the program ends.\nExclude rats that do not consume all of the pellets from further testing.\n3. Data Processing\nTransfer output information to a spreadsheet (e.g., a spreadsheet document).\nCreate a profile that extracts identifying information (subject number, start date, start time, and box number) as well as output information (number and latency of lever presses and magazine entries).\n\tNote: In the experiments, non-CS magazine entries are also extracted by the profile. Define non-CS magazine entries as entries into the magazine that occur outside of the 8 sec CS period and during the VT 90 sec (i.e., 60-120 sec) period during which the lever is not extended.\nFurther process the data by capping the lever press and magazine entry latencies at 8 sec (i.e., the duration of CS presentation). This can be achieved in spreadsheet through the IF function: IF(X >8,8,X).",
    "Calculate scores for response bias (i.e., total number of lever presses and magazine entries for a session; [lever presses - magazine entries] / [lever presses + magazine entries]), latency score (i.e., average latency to perform a lever press or magazine entry during a session; [magazine entry latency - lever press latency]/8), and probability difference (i.e., proportion of lever presses or magazine entries; [lever press probability - magazine entry probability])5.\n\tNote: With these formulas, all scores should range between 1.0 and -1.0.\nCalculate a PCA index score for each rat by averaging its response bias, latency score, and probability difference within each individual session.\n\tNote: The PCA index score should range between 1.0 and -1.0.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}