{
  "id": 7053,
  "origin_website": "Bio",
  "title": "Bacterial Adhesion Kinetics in a High Throughput Setting in Seconds-minutes Time Resolution",
  "procedures": [
    "Bacterial cultureInoculate frozen stock culture of bacteria (e.g., GFP tagged PA01) onto LB-Carbenicillin plate and incubate 24 h at 37 °C.Pick one colony from the plate and inoculate an Erlenmeyer flask, containing 50 ml of M9 medium, 0.4% glucose, 200 µg/ml Carbenicillin. Incubate at 37 °C, 120 RPM, 16 h.Preparation for kinetics and kinetic measurement of bacterial adhesionPrepare plate (first 6 columns) according to the following table using NaCl solution, de-ionized water, 8 channel pipetor and reservoir, in 50 μl volume per well. These concentrations will be halved when the bacterial culture is added.Note: Using final salt concentrations greater than 500 mM is not recommended as it causes dye aggregation. Table 1. Plate plan for bacterial adhesion in various salt concentrations experiment imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210120/20210120190649_3575.jpg To 984 μl of di-ionized water, add 16 μl of Allura red AC solution. Pipet 50 μl per well to wells 1-6 of row H, these well will serve as blanks.Transfer PAO1 culture into 12 x 1.5 ml microcentrifuges (1.5 ml per tube), centrifuge once to separate the culture (5,000 x g, 1 min, 25 °C). Resuspend each pellet in 500uL of de-ionized water. Transfer the resuspended bacteria into an 18 mm glass test tube. Note: Bacterial adhesion behavior is effected by long incubation periods in de-ionized water, thus it is important to minimize the amount of time bacteria are in water. Turn on the plate-reader, enter the following protocol: Temperature, 25 °C, start kinetics (60 min, read every 30 s), Read parameters: Fluorescence (Excitation 485/20nm, Emission 528/20nm, Bottom, Gain 60). Validate the protocol and start reading to allow the lamp to heat (180 s), do not start the kinetics yet. Note: If you wish to follow culture density in parallel to adhesion, you can measure OD650nm to avoid dye absorbance at 600nm.",
    "This reading values of correspond to 80% of the OD600nm measurement. Culture density data is interesting, (in this experiment, there is a reverse correlation between adhesion culture density as attached bacteria contribute less to optical density at OD650nm). But these measurements should be interpreted with caution because bacterial aggregation, for instance, will elevate optical density dramatically. If you choose to incorporate an OD650nm reading, set the reading frequency to 1 measurement every 1 min. Determine culture density using a new plate, by adding 100 μl of the culture to well A1 of a multi-titter plate, and read for OD600nm against blank.Add the required amount of de-ionized water and dye to prepare 6 ml of bacterial culture OD600nm = 0.1, dye concentration of 1.6 mg/ml (see Table 2 for calculation example)Table 2. Calculation example imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210120/20210120190335_4308.jpg Using multichannel pipetor add 50 μl of the bacterial suspension (diluted, with dye) to wells 1-6 of rows A-G.Note: Adhesion kinetics is fast, try to finish pipetting as fast as possible, within 30 s or so, or you will lose a lot of data. Load the plate onto the plate reader and start kinetics.Note: Black plates are often used in fluorescence, to prevent crosstalk between wells. In the case of the method presented here, read fluorescence is emitted from a shallow layer adjacent to the bottom of the well, eliminating crosstalk which originated from light traveling diagonally through the wall into adjacent wells, similar to elimination of crosstalk by black side plates. Post kinetic preparation and post kineticsWhile the plate reader is running the kinetics program, mix 12 ml of 0.8 mg/ml dye solution in a multichannel pipetor reservoir. This solution will be used to read fluorescence of the attached bacteria in the absence of unattached bacteria, as a control for the kinetic measurement.",
    "When the kinetic measurement ends, use the pipetor to gently remove the liquid from all wells.Add 100 μl of the 0.8 mg/ml dye solution to each well and read fluorescence once more using the same parameters (not kinetics).Note: Make sure to keep wells empty for the shortest possible time, GFP matures in the presence of high oxygen concentration leading to a dramatic increase in fluorescence if left dry for too long.  Optional step: Perform crystal violet staining on the same sample according to O'Toole 2011.Export kinetic and post kinetic reading results to Excel, sort and average according to treatment, calculate standard deviation, graph."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}