{
  "id": 6977,
  "origin_website": "Bio",
  "title": "Surgical Induction of Endometriosis in Female Mice",
  "procedures": [
    "Selection of donors in diestrus: estrous cycle determinationPlace the mouse on the cage grid, and gently pull the tail backwards to induce the mouse gripping the grid and pulling forward. With the other hand, grasp the mouse by the scruff of the neck and pin the tail between the palm and the fourth finger of the hand holding the scruff.Place the pipette tip at the opening of the vaginal canal and flush the vagina 5 times with 20 μl of saline solution in and out.Place the resulting fluid onto a gelatinized slide.Let the drop air-dry.Stain with 0.01% methylene blue for 2 min.Wash twice in distilled water for 2 min.Let air-dry.Take images of stained cells using the 40x objective of a light microscope to determine the stage of the estrous cycle (Figure 2):In proestrus, most cells are nucleated.In estrus, mostly cornified epithelial cells are present.In metestrus, cornified epithelial cells and leukocytes are found.In diestrus, leukocytes are predominant, and some nucleated and cornified epithelial cells are present.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200916/20200916185139_6080.jpgFigure 2. Vaginal cytology from mice in each stage of the estrous cycle. A. Proestrus. B. Estrus. C. Metestrus. D. Diestrus. Nucleated epithelial cells, cornified epithelial cells, and leukocytes are indicated by black, green and red arrows, respectively. Scale bar = 50 μm.Obtention of endometrial and control tissues: excision of uterine fragments and abdominal fatEuthanize the donor mouse in diestrus by cervical dislocation.Make a midline incision on the abdomen using a scalpel and excise the uterus (Figures 3A and 3B).Place the uterus in a Petri dish containing cold saline solution (4 ºC, on ice) (Figure 3C).Place abdominal fat of a size similar to the uterus in another Petri dish containing cold saline solution (Figure 3D).Strip one excised uterine horn and open it longitudinally with microdissection scissors, exposing the endometrium (Figures 3E and 3F).",
    "Note: Keep the other uterine horn unopened and in cold saline solution until used to induce endometriosis on a second recipient mouse. Use a new scalpel to cut the uterine horn or the fat in four squares with each side measuring 2 x 2 mm (Figures 3G and 3H).Keep the uterine fragments in cold saline solution until needed.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200916/20200916185243_7006.jpgFigure 3. Excision of uterine fragments and abdominal fat. A. A midline incision (dashed line) is made on the abdomen of the euthanized donor mouse. B. The uterus (blue arrow) and the abdominal fat (black arrow) are exposed through the incision. C. The uterus is excised and placed in a Petri dish containing cold saline solution. D. Abdominal fat tissue is also excised and placed in another Petri dish containing cold saline solution. E. The uterine horns are stripped. F. One uterine horn is opened longitudinally, exposing the endometrium. G. The opened uterine horn is cut in four fragments of 2 x 2 mm that are used for the endometriosis surgery. H. Abdominal fat is also cut in similar-sized fragments that are used for the control surgery.Surgical induction of endometriosis: peritoneal implantation of ectopic endometriumAnesthetize the recipient mouse with 4% V/V isoflurane in medical oxygen (2 L/min) in the induction chamber.Once anesthetized, place the mouse on top of a heating pad and maintain anesthesia with 2.5% V/V isoflurane in medical oxygen (2 L/min) using a nose cone.Apply ophthalmic ointment to avoid drying of the eyes.Shave the abdomen of the mouse using an electric hair-clipper.Clean the skin with a piece of cotton soaked in iodine-povidone solution (Figure 4A).Make a 1 cm midline incision on the skin using a scalpel, ending approximately 0.5 cm cranial to the vaginal ending.",
    "Insert closed rounded tip scissors between the skin and the abdominal wall and open them to detach the skin from the muscle. Make a 1 cm incision on the abdominal wall using the small scissors and use blunt forceps to expose its inner surface (Figure 4B).Suture the uterine fragments into the abdominal wall (two on each side of the incision) with loose square knots of 6-0 black silk. Uterine fragments must be sutured with the endometrial surface facing the peritoneal cavity (Figures 4C and 4D).Close the muscular abdominal wall with three loose square knots of 6-0 black silk (Figure 4E).Close the skin with three square knots of 6-0 black silk.Clean the skin with a piece of cotton soaked in povidone-iodine solution (Figure 4F).Leave the animal lying over one side in a clean cage partially placed over a heating pad until it recovers.Notes:Whenever the use of analgesics and antibiotics does not interfere with the purpose of the experiment, give meloxicam (2 mg/kg, subcutaneously, injection volume 10 ml/kg) and gentamicin (1 mg/kg, intraperitoneally, injection volume 3 ml/kg) right after surgery and 24 h later. To induce endometriosis to a second recipient mouse, repeat the procedure from Step B4 using the remaining uterine horn excised from the same donor mouse.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200916/20200916185319_6547.jpgFigure 4. Surgical induction of endometriosis. A. The abdomen of an anesthetized recipient mouse is shaved and cleaned with iodine-povidone solution. B. The inner surface of the abdominal wall is exposed through a 1 cm incision. C and D. Two fragments of uterine tissue or fat from a donor mouse are sutured on each side of the incision. E. The muscular abdominal wall is closed with three loose square knots. F. The skin is closed with three square knots and cleaned with iodine-povidone solution.",
    "Control mice: peritoneal implantation of abdominal fatTo obtain control mice repeat the procedure from Section C, substituting the Step C9 by suturing the fat fragments into the abdominal wall (two on each side of the incision) with loose square knots of 6-0 black silk.Confirmation of endometriosis: histology of endometriotic lesionsNote: Establish the time of necropsy according to the purpose of the experiment. Control mice should not develop endometriotic lesions.Perform a vaginal lavage as described in Section A if the stage of the estrous cycle at the time of sample collection needs to be considered.Euthanize the mouse by cervical dislocation. Use dissection scissors to make a dorsal incision in the back of the mouse at the level of the pelvis and peel the skin (Figure 5A).Remove the spine from S1 to L1 by making a first cut at the level of the most caudal rib and a second cut 1 cm caudal to the first one. Then, cut both sides along the spinal column (Figure 5A).Note: Spinal cord and dorsal root ganglia can be isolated from the extracted fragment of spinal column and used for biochemical and immunohistochemical analyses. Carefully pull out the intestines to allow the examination of the abdominal wall (Figure 5B).Excise the cystic endometriotic lesions and remove the surrounding fat tissue using dissection scissors and forceps. Special care should be taken to avoid lancing the fluid-filled cysts (Figure 5C).Place the endometriotic lesions in reaction tubes with paraformaldehyde 4% and allow tissue fixation for 4 h at 4 °C.Wash 3 x 5 min with 0.01 M PBS at room temperature.Keep samples in sucrose 30% with 0.1% sodium azide for 6 days to cryoprotect the tissue.Take the samples out of the sucrose solution, remove sucrose excess with filter paper, embed in cryomolds filled with O.C.T. and store at -80 °C.",
    "Section samples at 20 μm with a cryostat and mount onto gelatinized slides. Store at -20 °C.Stain with hematoxylin and eosin:Leave the slides in staining baskets and allow them to thaw.Sink in 100% ethanol for 5 min.Sink in 96% ethanol for 5 min.Sink in 70% ethanol for 5 min.Wash with distilled water.Immerse in Papanicolaou's solution 1a Harris' hematoxylin solution for 5 min.Wash in distilled water for 2 min.Immerse in Eosin G or Y 0.5% alcoholic for 30 s.Sink in 70% ethanol for 5 min.Sink in 96% ethanol for 5 min.Sink in 100% ethanol for 5 min.Clear with Xylene Cyanol FF for 5 min.Mount coverslip with mounting medium for microscopy.Allow to dry horizontally for 3 days.Capture images of stained sections using a macro zoom microscope for assessment of diameter and histological features (Figure 5D). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200916/20200916185410_2038.jpgFigure 5. Endometriotic lesions recovered 32 days after surgical induction of endometriosis. A. Removal of the spine from S1 to L1 (dashed lines). B. Uterine fragments implanted into the abdominal wall develop into cysts. C. Endometriotic cyst of approximately 2.5 mm diameter. D. Hematoxylin and eosin stained section of an endometriotic lesion showing the presence of stroma (orange arrow) and glandular epithelium (blue arrow). Scale bar = 1 mm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}