{
  "id": 9414,
  "origin_website": "Jove",
  "title": "Laser Capture Microdissection of Neurons from Differentiated Human Neuroprogenitor Cells in Culture",
  "procedures": [
    "1. Expansion of Human NPCs (Figure 1)\nRevive the frozen stock of human NPCs from fetal brain (Lonza, Walkersville, MD, USA) and culture them in suspension in T-75 flasks as neurospheres (Figure 1A) in neurobasal medium containing proliferation supplements, EGF (10 ng/ml) and FGF (10 ng/ml).\nAfter 3 days in culture, transfer the neurospheres to a 15 ml tube and centrifuge at 500 rpm for 5 min.\nDiscard the supernatant leaving behind ~100 μl medium above the cell pellet and transfer into an Eppendorf tube. A 100 μl cell pellet is enough to split into 2 T-75 flasks. If less, reduce the number of flasks as neuroprogenitor cells fail to proliferate if split thin.\nTriturate the pellet with a 200 μl tip 50x while keeping the 200 μl tip against the bottom of the tube. Divide the cell suspension equally into two parts and add them to 2 T-75 flasks (1-2 split), one for continued expansion and another for differentiation.\nContinue the culture of the neuroprogenitor cells for expansion (first flask) by changing the medium every 4-5 days until the neurospheres reach their original size of 300-500 μm. Change medium by centrifugation (500 rpm; 5 min), discard the old medium and add new medium.\n2. Differentiation of Human NPCs into a Neuron-rich Culture (Figure 2)\nFor differentiation of neuroprogenitor cells into a neuron rich culture, place a single coverslip into each well of a 24-well plate and coat with 100 μg/ml of poly-L-lysine by adding 500 μl into each well. Incubate the dishes for 30 min at RT.\nAspirate the poly-L-lysine solution and rinse the plate with sterile water.\nNext, coat the wells of the plate with 500 μl of 5 μg/ml mouse laminin and incubate for 30 min. Following incubation, wash the wells with PBS.",
    "4 days after splitting the cells (step 1.4), transfer the small neurospheres in the flask labeled 'For differentiation' into the coated dishes at a density of ~500 neurospheres per well of a 24-well plate.\nAfter 6 hr, when the neurospheres attach to the dish, remove the proliferation medium and add differentiation medium consisting of neurobasal medium, B27 supplement, NGF (20 ng/ml), BDNF (10 ng/ml), DBC (100 mM), and retinoic acid (2 μM).\n3. Immunofluorescence Staining of Differentiated NPCs (Figure 3)\nFollowing culture of neuroprogenitor cells in neuronal differentiation medium for two weeks, a neuron-rich culture is obtained. Rinse the neurons once in PBS and then fix them in 4% paraformaldehyde for 30 min. Once fixed, rinse the cells three times with PBS.\nIncubate the cells with permeabilization buffer (5% BSA and 0.2% Triton X-100 in PBS) at RT for 60 min.\nIncubate the dishes O/N at 4 °C in a shaker with the following combination of polyclonal and monoclonal antibodies in 3% BSA in PBS: NeuN (1:250) and synapsin (1:250); acetyl cholinesterase (1:500) and synaptophysin (1:250); BDNF (1:500) and GAP43 (1:250); STAT3 (1:500) and GFAP (1:1,000).\nWash the coverslips three times with PBS and then incubate them with anti-rabbit-Cy3 and anti-mouse-FITC secondary antibodies at RT in dark for 90 min. Following incubation, wash the coverslips three times with PBS.\nPlace 10 μl of mounting medium onto a glass slide, take out the coverslip from the culture dish with forceps, and place it upside down on the mounting medium. Gently, wipe away any excess mounting medium and seal the edges with nail polish.\nExamine the immunostained neurons in a fluorescence microscope.\n4. Laser Capture Microdissection of Neurons (Figure 4)",
    "Differentiate NPCs into a neuron-rich culture on PEN membrane slides coated with poly-L-lysine and mouse laminin following the procedures described for Figure 2.\nPerform all subsequent steps under RNAse-free conditions.\nStain the cultures using HistoGene Stain (Arcturus) to visualize the cells.\nFind the areas of pure neuronal populations devoid of astrocytes using the road map image of the entire slide with the Veritas LCM system. Mark the neurons using the drawing tools.\nPerform laser capture of these areas using computer-controlled precision and automation in a two-step process. First, IR (Infrared) is fired at multiple spots with a laser power setting of 70 mW and a pulse of 2,500 μsec to get the membrane attach to the cap. Next, the marked area is excised using an UV cutting tool at a low level setting of 10 mV.\nCombination of these processes selectively captures the marked areas from the PEN membrane onto CapSure LCM macro caps. When the cap is lifted, the membrane with the neurons adheres to the cap.\nIsolate total RNA from LCM samples using a PicoPure RNA isolation kit (Arcturus) and treat with DNase.\nAmplify the isolated RNA using RiboAMP RNA amplification kit following instructions from the kit.\nPerform Real time RT-PCR analysis using TaqMan probes to detect human neurofilament heavy chain (hNFHc).\nAbbreviations:\nAD, Alzheimer's disease; BDNF, brain-derived neurotrophic factor; CREB, cyclic AMP response element binding protein; DBC, Dibutyryl cyclic AMP; EGF, epidermal growth factor; FGF, fibroblast growth factor; GFAP, glial fibrillary acidic protein; LCM, laser capture microdissection; NGF, Nerve growth factor; NPC, neuroprogenitor cell; PEN, polyethylene naphthalate.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}