{
  "id": 5649,
  "origin_website": "Bio",
  "title": "Cell Type-specific Metabolic Labeling of Proteins with Azidonorleucine in <em>Drosophila</em>",
  "procedures": [
    "Preparation of ANL-containing fly food medium (Figure 1)Thaw baker’s yeast.Add semolina and Agar-Agar to 0.33 L water. Stir from time to time until swelling is completed.Heat mashed raisins, yeast, sugar beet syrup and honey in 0.66 L water. Boil the mixture for 5 min while stirring constantly. Add the semolina-Agar-Agar-mixture and boil once again. Don’t forget to stir constantly, as the mixture might braise at the bottom of the pot.Cool down the ONM to 50 °C. Stir every 15-20 min for 1 min.Add the Nipagin and stir for at least 1 min until the Nipagin is homogenously distributed in the food.Add 2 ml of ANL stock solution to 100 ml ONM in a beaker for a final concentration of 4 mM ANL. Mix for 1 min using an immersion blender.Aliquot ANL-containing ONM (2-4 ml) into fly vials and let cool down completely at room temperature.Plug the vials.ANL-containing ONM can be stored for approximately two weeks at 4 °C. Discard vials once the ONM detaches from the vial wall.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170712/20170712190636_4613.jpgFigure 1. Preparation of ANL-containing fly food medium. A. Ingredients for ONM are shown: R (mashed raisins); S (semolina); BS (sugar beet syrup); H (honey). B. Semolina and Agar-Agar are added to water and allowed to swell, SAA. C. Raisins and Baker’s yeast (Y), sugar beet syrup (BS), and honey (H), are added into water and boiled for 5 min. D. Afterwards, the SAA mixture is added and boiled once more. After cooling down to 50 °C with stirring from time to time, Nigapin and ANL are added and mixed thoroughly. E and F. Media is then aliquoted and allowed to cool down completely before storage at 4 °C.Cell type-specific expression of dMetRSL262G-variants in Drosophila larvae and fliesCollect virgin female flies of the respective activator strain.",
    "Note: The number of flies and hence the number of offspring depends on your experimental design including the type of analysis (e.g., MS/MS) and the effectiveness and degree of cell selectivity of the Gal4-activator in use. Cross virgin female flies of the activator strain to male flies of a UAS-dMetRSL262G-effector strain (Erdmann et al., 2015).Note: Crosses can as well be set up reciprocally, that is, you may use virgin female flies of a UAS-dMetRSL262G-effector strain and cross them to males of your activator strain.Cell type-specific labeling of proteins with ANL–examplesLong-term labeling of proteins in larval body wall muscles:Raise appropriate crosses on ANL-containing ONM such that ANL is present during all developmental stages of the progeny.Mid- to late 3rd larval stage is reached after approximately 5 days when crosses are raised at 25 °C and after approximately 10-12 days when kept at 18 °C.Perform dissection of larval body walls according to ‘Click Chemistry (CuAAC) and detection of tagged de novo synthesized proteins’. See also Bellen and Budnik (2000).Note: Biochemical approaches on whole larval extracts have proven difficult to perform time and again, perhaps due to lytic activities. We therefore recommend separating body walls (mainly comprising muscles, epithelia, cuticle, trachea and sensory neurons) from all other tissues.Long-term labeling of proteins in fly heads (e.g., if dMetRSL262G is expressed in the CNS, compound eyes and/or antenna):Raise crosses on ANL-containing ONM so that ANL is present throughout development of the progeny.Remove parental flies before eclosure of the offspring.Prepare fly heads from adult progeny according to ‘Click Chemistry (CuAAC) and detection of tagged de novo synthesized proteins’.Short-term labeling of proteins in larval body wall muscles or brains:Raise crosses on ANL-free ONM for 1-2 days at 25 °C.Transfer parental flies onto fresh ANL-free ONM for 4-6 h. Remove parental flies.",
    "Keep vials for 72 ± 2 h at 25 °C.Wash early 3rd instar larvae out of the food with warm tap water and rinse them into a mesh basket.Transfer 3rd instar larvae onto ANL-containing ONM using a paintbrush.Keep larvae at 25 °C for 24 h.Prepare the larval body walls or larval brains according to ‘Click Chemistry (CuAAC) and detection of tagged de novo synthesized proteins’.Short-term labeling of proteins in fly heads:Raise appropriate crosses on ANL-free ONM either at 25 °C or 18 °C depending on your experimental design.Discard parental flies before progeny ecloses.Transfer progeny flies on ANL-containing ONM for a period of time according to your experimental design. For certain analyses it may also be considered to place flies back onto ANL-free food.Prepare fly heads according to ‘Click Chemistry (CuAAC) and detection of tagged de novo synthesized proteins’."
  ],
  "subjectAreas": [
    "Systems Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}