{
  "id": 6514,
  "origin_website": "Bio",
  "title": "Analysis of Functional Virus-generated PAMP RNAs Using IFNα/β ELISA Assay",
  "procedures": [
    "The procedure showing the analysis scheme for viral PAMP RNAs is summarized in Figure 2.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190617/20190617005700_5406.jpgFigure 2. Flow chart for viral PAMP RNAs analysis Analysis for total and classical viral PAMP RNAs Preparation of total RNA samples from infected cells.Day -1 Seed 8 x 106 BHK-21 cells on to 100 mm cell culture dish and culture in DMEM with 10% FBS. Maintain the cells at 37 °C with 5% CO2 overnight. Day 0 Discard the BHK-21 cell growth media and wash the cell monolayer once with PBS. Infect the cells with the viruses of interest. As a demonstration, dilute RRV-T48 and RRV-T48A534V separately in serum free DMEM for the infection. Infect the BHK-21 cell monolayer by the viruses at Multiplicity of Infection (MOI) 1.0 with a minimum coverage volume (approximately 400 μl for each well in a 6-well plate). Incubate the cells for 1 h at 37 °C with 5% CO2 and then maintain the cells in DMEM with 10% FBS for another 6 h. Extract the total RNA from the infected BHK-21 cells using TRIzol Reagent according to the manufacturer’s protocol (Invitrogen TRIzolTM Reagent USER GUIDE)[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2Ftrizol_reagent.pdf&title=VXNlciBHdWlkZTogVFJJem9sIFJlYWdlbnQ=]. Use 1 U DNase I per 1 μg total RNA to treat the extracted RNA for 60 min at 37 °C.Optional (viruses with non-paired polyA tail): Isolation of non-classical PAMPs. Aliquot 100 μg of the treated RNA into a clean Eppendorf® DNA LoBind microcentrifuge tube (RNase free). Remove the polyA(+) fraction from the total RNA using PolyATtract mRNA Isolation Systems Kit according to the manufacturer’s protocol (Promega).[href=https://www.promega.com.au/products/rna-purification-and-analysis/rna-purification/polyattract-mrna-isolation-systems/?catNum=Z5210] Purify the total, polyA(+) and polyA(-) RNA samples with RNeasy Mini Kit according to the manufacturer’s protocol (Qiagen)[href=https://www.qiagen.com/us/products/discovery-and-translational-research/dna-rna-purification/rna-purification/cell-free-rna/rneasy-mini-kit/#resources] and elute the product within 20 μl RNase free water.",
    "UV inactivates the infectious viral RNAs, presented in the obtained samples, for 5 min in a UVC5000 Ultraviolet Crosslinker at 2000 μJ/cm². Optional: Store the RNA at -80 °C for longer period if needed.Analysis of viral PAMP RNAsDay -1 Seed 1 x 106 Cop5 cells into 12-well plate and cultured in IMDM with 10% FBS and 2 mM L-glutamine. Maintain the cells at 37 °C with 5% CO2 overnight.Day 0Transfect 1 μg of treated total, polyA(+) or polyA(-) RNAs respectively into confluent cultures of Cop5 cells in 12-well plates using Lipofectamine2000 reagent. Briefly, dilute 3 μl of the Lipofectamine2000 reagent in 100 μl serum free IMDM and incubate for 2-5 min at room temperature. Dilute 1 μg RNA samples in 100 μl serum free IMDM and incubate for 2-5 min at room temperature. Combine the 100 μl diluted Lipofectamine2000 reagent with the 100 μl diluted RNA samples and incubate the RNA-lipid mixture for 5 to 10 min at room temperate to form the RNA-lipid complex. Discard the BHK-21 cell growth media and wash the cell monolayer once with PBS. Add 1 ml serum free IMDM to the cells. Add the RNA-lipid complex drop-wise on top of the medium and gently rock the plate after adding to the mix. Incubate the transfected cells at 37 °C with 5% CO2 for 24 h. Day 1 Collect the supernatant from the transfected Cop5 cells to a 1.5 ml tube. Centrifuge samples at 3,000 x g for 5 min at 4 °C to remove the cell debris. Collect the supernatant to a new tube.Determine the amount of IFN-β produced by the transfected Cop5 cells using VeriKine Mouse IFN Beta ELISA kit according to the manufacturer’s protocol together with standard curve.",
    "Analysis for non-classical viral PAMP RNAsDay -1Seed 1 × 106 Cop5 cells into a 12-well plate and culture in IMDM with 10% FBS and 2 mM L-glutamine. Maintain the cells at 37 °C with 5% CO2 overnight.Day 0Transfect 1 μg of the plasmids encoding for viral replicase of interest into the confluent cultures of Cop5 cells in 12-well plates using Lipofectamine2000 reagent. Use plasmid that expresses inactive replicase (active-site mutant) as a negative control. As a demonstration, transfect RRV-T48, RRV-T48A534V and SFV4 replicase constructs into the Cop5 cells for the following analysis.Incubate the transfected cells at 37 °C with 5% CO2 for 48 h. Day 2Collect the supernatant from the transfected Cop5 cells to a 1.5 ml tube. Centrifuge samples at 3,000 x g for 5 min at 4 °C to remove the cell debris. Collect the supernatant to a new tube.Determine the amount of IFN-β produced by the transfected Cop5 cells using VeriKine Mouse IFN Beta ELISA kit according to the manufacturer’s protocol (pbl Assay science)[href=https://www.pblassaysci.com/assay-kits/mouse-ifn-beta-elisa-kit-tcm-serum-42400#documentation] together with standard curve. For each independent experiment, normalized the IFN-β levels measured in supernatants from cells transfected with RRV replicase expression plasmids to the amount of IFN-β produced by cells transfected by plasmid expressing SFV replicase."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}