{
  "id": 5932,
  "origin_website": "Bio",
  "title": "Analysis of Exosome Transfer in Mammalian Cells by Fluorescence  Recovery after Photobleaching",
  "procedures": [
    "In the protocol described below, we analyze the transfer of exosomes from MSC with or without stabilized expression of HIF-1α to HUVECs.    Production of MSC and HIF-MSC Cells were transduced with a lentiviral vector coding for HIF-1α and the green fluorescent protein (GFP), named pWPI-HIF-1α-GFP, or a control vector pWPI-GFP (https://www.addgene.org/[href=https://www.addgene.org/]) as previously described (Ciria et al., 2017).    Production of MSC-CD63-RFP and HIF-MSC-CD63-RFP   Retroviral particles were obtained from supernatants of HEK293T packaging cell lines transduced with a vector expressing Red Fluorescent Protein (RFP) fused to the tetraspanin CD63: pCT-CD63-RFP (CYTO120R-PA-1).   Filter the supernatants with retroviral particles through a 0.45 μm filter.   Titration of lentiviral supernatants is performed in fresh HEK293T cells with our local Viral Vector production Unit (http://inbiomed.org[href=http://inbiomed.org/]).   MSC and HIF-MSC freshly seeded at 5 cells/cm2 are transduced for 8 h at a multiplicity of infection of 10 in MSC or HIF-MSC culture medium.   After this time, wash off the medium containing lentiviral particles and replace with fresh medium   Repeat this procedure (Step A5) daily for 3 days.    MSCs and HIF-MSCs containing the pCT-CD63-RFP vector are selected with puromycin. Culture cells in MSC culture medium with 4 μg/ml puromycin for 24 h. After this time, wash out puromycin and replace with fresh culture medium.    Evaluate the transduction efficiency in MSC and HIF-MSC by using flow cytometry (cells should be GFP and RFP positive). After selection, purity of transduced populations is routinely higher than 90%.     24 h co-culture of MSC or HIF-MSC with HUVEC (Figure 1A)   Sterilize 25-mm glass coverslips by soaking in 70% ethanol for 5 min.    Air-dry coverslips in the cell culture hood for 10 min and then place into 9 cm2 wells.   Seed a total of 15 x 103 MSC-CD63-RFP or HIF-MSC-CD63-RFP cells and 105 HUVEC in co-culture or separately onto the 25-mm sterilized glass coverslips.",
    "Co-culture medium is a 1:1 mixture of HUVEC and MSC growth medium.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180116/20180116224929_2411.jpg Figure 1. Co-culture scheme. A. Co-culture of HUVEC and MSC or HIF-MSC onto cover slip; B. Montage of co-culture cover slip into Live Imaging Chamber.     FRAP   After 24 h of co-culture, filter conditioned medium through a 0.22 μm filter to remove cell debris and large EVs, and then add the filtered medium back into the same well. Most of tetraspanin CD63 is concentrated in the exosomes; however, there are EVs of various sizes that also contain CD63. Thus, to reduce the presence of vesicles other than exosomes, a selection is made by size filtering the culture medium after 24 h of culture.   Mount co-cultures in live imaging chambers and observe by confocal microscopy (Figure 1B). As HUVEC are not fluorescently labeled, detection of red fluorescence in these cells could only result from incorporation of red nanovesicles secreted from MSC-CD63-RFP and HIF-MSC-CD63-RFP cells that emit both green and red fluorescence.   A single HUVEC is photo-bleached with a 460-480 nm laser as described in Gonzalez-King et al., 2017. Of note, photobleaching conditions have to be established for each cell type and for the fluorescent molecules used.   Always take images in the same ‘z’ plane of the cell. Thus, it is recommended that before starting image, ensure that red fluorescence (due to red fluorescent exosomes uptake during the 24 h of co-culture) is no longer present. To do this, examine the photobleached cells in different ‘z’ planes before imaging.   After photo-bleaching of a single HUVEC, two-dimensional pseudo-color images (255 color levels) are acquired using a 40x Plan-Apochromat-Lambda Blue 1.4 NA oil objective with a size of 1,024 x 1,024 pixels and Airy 1 pinhole diameter, at 10 min intervals during 3 h.",
    "The excitation wavelengths for fluorochromes are 488 nm (argon laser) for the detection of GFP fluorescence and 561 nm (DPSS laser) for detection of DsRed. To avoid variability, images must be taken under the same conditions established at the beginning of the experiment. During the analysis, maintain slides at 37 °C with a heating apparatus supplied with a 95% air/5% CO2 humidified gas mixture."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}