{
  "id": 10433,
  "origin_website": "Jove",
  "title": "High Throughput Traction Force Microscopy Using PDMS Reveals Dose-Dependent Effects of Transforming Growth Factor-β on the Epithelial-to-Mesenchymal Transition",
  "procedures": [
    "NOTE: The following protocol will guide researchers in fabricating and using the multi-well TFM dish shown in Figure 1.\n1. Preparation of PDMS silicone substrates\nPreparation of PDMS silicone rubber mixture based on a composite mixture of two commercially available kits.\n\t\nAdd Part A and Part B of PDMS kit (e.g., GEL-8100, see the Table of Materials) in a 1:1 weight ratio into the 50 mL tube.\n\t\tNOTE: The mixture is mixed on a rotator at a speed slow enough for the mixture to flow back and forth during revolution to ensure complete mixing.\nAdd the required amount of curing agent for the desired modulus of the substrate.\n\t\tNOTE: The amount of curing agent to be added to the mixture depends on the desired modulus of the substrate and may typically range from 0.1% to 1.8%. Refer to Table 1 and Figure 3 for a guide to specific crosslinker concentrations and resulting moduli.\nMix the formulation on the rotator for 30-45 min; ensure the rotation is slow enough for thorough mixing.\nBottom layer: coating PDMS substrates on the glass slide\n\t\nPlace the custom-built chuck illustrated in Figure 2 on the spin-coater. Clean the glass with ethanol or isopropanol, and dry with a lint-free wipe. Place the glass slide in the chuck and turn on the vacuum to hold the slide in place.\nApply uncured PDMS approximately 1 cm from the edges and work in towards the center. Apply enough (3-4 mL) PDMS to ensure the whole surface will be covered.\n\t\tNOTE: To ensure that the PDMS is evenly spread on the surface of the glass, a pipette tip may be helpful to spread the PDMS mixture from the center to the edges.\nSpin the glass with the PDMS mixture on a spin-coater with the following protocol.",
    "To spread the uncured PDMS on the slide, accelerate at 50 rpm/s from 0 to 200 rpm; hold at 200 rpm for 1 min.\nTo achieve a 100 µm thick PDMS layer, accelerate at 50 rpm/s to 300 rpm and hold for 1 min at 300 rpm. Different desired thicknesses other than 100 µm will require specific speed values.\nTo remove, decelerate at 50 rpm/s to 0 rpm. Disable vacuum and remove the coated slide, taking care not to touch the coated surface.\n\t\t\tNOTE: It is important to include the acceleration and deceleration steps to ensure a smooth continuous surface.\n\t\t\tCAUTION: To ensure that the sample does not fly off the chuck, the custom-made holder should be used to hold the slide, and not rely simply on vacuum and the existing flat chuck. The details and specifications of this holder are given in Figure 2.\nPlace the spin-coated sample in the oven at the manufacturer recommended temperature (100 °C) for 2 h.\n\t\tNOTE: The surface of the oven where the sample is placed should be solid (i.e., not a wire rack) and level surface to ensure the uniform heating and thickness of the sample. A ceramic or steel plate makes an ideal surface.\nTop bead layer\n\t\nAdd bead solution in the appropriate ratio to the remaining PDMS mixture.\n\t\tNOTE: This ratio depends on the concentration of the stock bead solution and the desired bead density on the sample. Typical final values are 9.2 x 1011 beads/mL and 0.05-0.2 beads/µm2, and an excess of beads is generally preferable to an inadequate amount.\nMix the bead solution with the uncured PDMS. This may be accomplished by placing the tube on a rotator for approximately 30 min, vortexing for 1-2 min, or sonication for 30 min. These methods may be combined.",
    "NOTE: In our application, we find that sonication is effective in breaking bead aggregates, and rotation is effective in mixing. Synthesized fiduciary beads may aggregate in storage. Prior to use, they may be resuspended in hexane and sonicated. If there are significant large aggregates, one can filter the bead suspension through a 5 µm syringe filter. This filtration step is optional; it helps to coat the sample with monodispersed beads, but a significant fraction of beads may be lost in the filter.\nTake out the slide from the oven, allow to cool to room temperature, and place it on the spin-coater.\nAdd 3-4 mL of the bead and uncured PDMS mixture onto the surface of the coated sample.\n\t\tNOTE: The mixture with beads added is less viscous due to the hexane. Make sure not to touch the surface of the substrate as it may damage the already-coated PDMS substrate. Additionally, the bead mixture may initially not wet the surface; take care that the mixture does not immediately flow off the cured PDMS surface.\nSpin the sample with the following protocol.\n\t\t\nTo spread the bead and uncured PDMS mixture, accelerate at 100 rpm/s from 0 to 500 rpm; hold at 500 rpm for 1 min.\nTo achieve a thin layer of bead-embedded PDMS (~1 µm), accelerate at 200 rpm/s from 500 to 5000 rpm; hold at 5000 rpm for 10 s.\nTo remove, decelerate at 100 rpm/s to 0 rpm. Disable vacuum and remove coated slide, taking care not to touch the coated surface.\nPlace the spin-coated sample in the oven at 100 °C for 1 h.\n\t\tNOTE: Temperatures above 100 °C or durations longer than 1 h can reduce the bead fluorescence. Make sure that the oven temperature is set to 100 °C and not higher.",
    "The protocol can be paused here. To store the sample, cover the surface to avoid dust and light exposure. Make sure that nothing touches the surface. The sample is shelf-stable at room temperature indefinitely.\nAssembling the plate\n\t\nAdd Part A (base) and Part B (curing agent, e.g., Sylgard) of a PDMS elastomer kit in a 10:1 weight ratio into the 50 mL tube.\nMix the mixture on the rotator for 30-45 min.\n\t\tNOTE: For one plate, mix 5 mL of base with 0.5 mL of curing agent. Up to 1 mL of hexane can be added to reduce the viscosity of the mixture.\nApply the mixture to the bottom of the divider and spread the mixture.\n\t\tNOTE: The divider should be placed upside-down.\nLay the substrate onto the divider upside-down.\nPlace the sample upside-down in the oven at 65 °C for 2 h.\nTake out samples from the oven and clean the bottom of the glass with 70% ethanol or isopropanol to remove any PDMS residue.\n\t\tNOTE: The protocol can be paused here. To store the sample, place a lid on the substrate and wrap the device in aluminum foil to avoid exposure to the light. The sample is shelf-stable at room temperature indefinitely. The divider utilized in this method is in a 96-well format; however, researchers may employ other formats (384-well, 2-well, 4-well, 8-well, etc.) depending on desired experiment setups and availability of dividing structures. Some further optimization may be required.\n2. Surface functionalization\nDissolve 80 µL of a Sulfo-SANPAH aliquot in 40 mL of 0.1 M HEPES buffer (pH 7-9).",
    "NOTE: Prepare Sulfo-SANPAH aliquots by dissolving 100 mg of Sulfo-SANPAH powder in 2 mL of sterile dimethyl sulfoxide (DMSO). Prepare 0.1 M HEPES buffer by diluting 50 mL of HEPES in 450 mL of sterile deionized water and filter through a 0.22 µm pore filter.\nAdd 200 µL of diluted Sulfo-SANPAH solution to each well of the 96-well plate.\nExpose the plate to UV (300-460nm) light at appropriate distance and duration.\n\tNOTE: After UV exposure, the color of the solution should be darker. UV exposure distance and duration depend on the UV lamp power. In our application, we expose for 10-15 min at a distance of 5 cm.\nRemove the Sulfo-SANPAH solution from the wells and add 200 µL of 5 µg/mL fibronectin solution to each well.\n\tNOTE: Researcher-specified protein can be used for surface coating. Some commonly used proteins are collagen, fibronectin, and laminin. We have found Sulfo-SANPAH to be the most effective method, and plasma cleaning while sometimes employing in PDMS is discouraged as it creates a silicon dioxide layer and visibly damages the surface.\nIncubate the plate at 4 °C overnight.\n\tNOTE: Different incubation methods can be applied depending on the protein used for coating.\nRemove the fibronectin solution and wash each well with phosphate-buffered saline (PBS) twice.\nPlace a lid on the sample.\nAdd 200 µL of PBS to each well.\n\tNOTE: The protocol can be paused here. The fibronectin-coated samples can be stored at 4 °C for up to 2 weeks.\n3. UV sterilization\nSterilize the sample under UV light in a biological safety cabinet for 30 min.\n\tNOTE: Longer UV exposure times may negatively impact the bead fluorescence. All subsequent steps must be performed under sterile conditions.\n4. Cell culture",
    "Remove PBS from each well and add 200 µL of cells suspended in culture media to each well.\n\t\nPlate the cells at the desired cell density. Cell density depends on the desired experiment. For single cell studies, cells should be minimum of 50 µm apart and cells near the edges of the imaging window should be not be included in the TFM measurement. For monolayer cells, the imaging window should have the viewing field covered with a confluent layer of cells.\nPrepare the complete growth culture media for NMuMG cells by supplementing DMEM with 5% FBS, 10 mM HEPES, 10 µg/mL insulin, 1% penicillin-streptomycin, 1 mM L-glutamine, and 0.5 µg/mL amphotericin B.\nPrepare insulin stock by reconstituting in acidified water (2.5 mL of glacial acetic acid in 130 mL of deionized water) to a concentration of 10 mg/mL. Store the stock solution at 4 °C. Wait until the solution is clear, and then filter through a 0.22 µm pore filter.\nTGF-β addition\n\t\nTo prepare of TGF-β stock, dissolve 2 µg of TGF-β in 100 µL of 10 mM citric acid (pH 3.0) and filter sterilize with 0.22 µm pores. Vortex the tube and aliquot into the desired volumes. Store the aliquots at -80 °C.\nAdd 1.5 µL of TGF-β stock solution to 10 mL of the complete cell culture media to constitute the cell culture media with the final TGF-β concentration of 3 ng/mL.\n\t\tNOTE: To make 10 mM pH 3.0 citric acid, dilute the acid in water and adjust pH to 3.0 by adding HCl.\n5. Data acquisition\nFor each position, acquire at least one image of fiduciary particles and cells. Focus on the bead layer.",
    "NOTE: Pixel size should be optimized based on size of the fiduciary particles and image processing method being used. In this application, the authors use a 10x 0.4 NA objective, and images are acquired with 1024 x 1024 resolution, with 455 nm/pixel. In general, it is helpful to retain a resolution of at least approximately 1-5 pixels per bead; here, beads are polydisperse and have an individual size of 300-500 nm. It is critical that the fluorescent fiduciary beads be in focus for images to be used for TFM calculations. The focus and imaging quality of the beads should be prioritized over imaging the cells themselves. There should be no cross-talk between different channels, particularly any fluorescence not from the fiduciary beads which appears in the imaging spectra of the beads.\nOnce all the positions of interest have been recorded, add detachment solution to each well to acquire force-free reference images of the fiduciary particles.\n\t\nTo prepare cell detachment solution, mix an aqueous solution containing 2% TritonX-100, 50 mM sodium azide, and 500 mM potassium hydroxide.\n\t\tNOTE: The above is provided as an example of an effective detachment solution. Different detachment solutions at researchers' discretion may be used to detach the cells off the substrate surface.\n6. Image analysis\nPerform appropriate image analysis as desired.\n\tNOTE: Analysis software was developed in-house. Image analysis may be done with custom-made software or software available online.\n7. Bead synthesis\nNOTE: The following protocol is based on the synthesis method described by Klein et al.10.\nUnder a fume hood, prepare the three-neck flask with a water-cooled reflux condenser.\n\tCAUTION: Set up a synthesis in a well-ventilated chemical fume hood.\nAdd 0.5 mL of PDMS stabilizer and fluorophore to the flask.",
    "Equip one neck with a rubber septum with a nitrogen inlet needle and an outlet needle and equip the other neck with a rubber septum for adding reagent with a syringe.\nAdd 100 mL of anhydrous hexane in 250 mL to the flask and add a small magnetic stir bar.\nPlace the flask in the mineral oil bath at 75 °C and purge it with nitrogen gas for 1 h.\nAdd 6 mL of methylmethacrylate to a 25 mL round bottom flask.\nAdd 0.100 g of 2,2'-azobisisobutyronitrile (AIBN) to the round bottom flask and purge the mixture with nitrogen gas for 1 h.\n\tNOTE: Flush methylamethacrylate through prepacked column to remove inhibitors before use. Add methylamethacrylate and AIBN mixture to the three-neck flask.\nThe solution initially becomes cloudy and turns milky. Let the reaction run for 3 h after the solution becomes cloudy.\nAfter 3 h, place the flask in an ice water bath.\nVacuum-filter the solution with coarse filter paper.\nCentrifuge the filtrate and re-suspend the particles in hexane.\n\tNOTE: The volume of the hexane to be added depends on the desired concentration of the bead solution. Sonication facilitates re-dispersion of the bead particles in hexane solution. Beads produced by the authors have polydisperse diameters of approximately 300-500nm. Due to the use of cross-correlation pattern tracking to determine displacements, monodisperse beads are not required.\n8. Rheology measurement protocol",
    "NOTE: Rheology is not required for every researcher or experiment, but is necessary to quantify the moduli for new formulations of PDMS. In this protocol, we employ a shear rheometer to measure the effects of crosslinker, frequency, and strain on moduli of PDMS samples. Depending on the available tools and expertise, moduli may also be measured using many other mechanical analysis approaches. Additionally, researchers using this protocol may elect to use our published moduli presented in Table 1, Figure 3 and Figure 4.\nUse a rheometer with a 25 mm diameter parallel plate geometry. Other geometries may be used.\nInitialize the system and calibrate the device and measuring system (parallel plate, d = 25 mm). After measuring the zero gap, begin loading the PDMS sample.\nAs soon as the PDMS elastomer and crosslinking agent have been mixed, pipet the mixture onto the bottom plate of rheometer.\n\t\nMove the spindle down to completely contact the top of the PDMS sample.\nCarefully trim the loaded sample excess from the bottom plate.\nIn a strain sweep test, apply increasing strains for each composition with different crosslinking density to ensure the polymer structure remains in the linear viscoelastic regime during all shear measurements.\n\tNOTE: Strain values relevant for cell studies are typically in the range of 0.1-10%. We have found PDMS to be linear up to approximately 100% strain.\nMeasure the dynamic shear storage modulus (G'), and loss modulus (G′′) of the PDMS network in a time sweep test with frequency of 1 Hz and oscillatory shear strain of 0.5% at 100 °C.\nTo determine the viscoelasticity and time dependency of the final PDMS network, apply a frequency sweep test with frequency ranging 0.1-100 Hz and oscillatory shear strain of 0.5%.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}