{
  "id": 18461,
  "origin_website": "Jove",
  "title": "Intravenous Endotoxin Challenge in Healthy Humans: An Experimental Platform to Investigate and Modulate Systemic Inflammation",
  "procedures": [
    "University College London REC (UK) approved the study that generated the data presented in the representative results section (Reference 5060/001).\nETHICAL APPROVAL:\nThe majority of studies using IV endotoxin challenges have been conducted in healthy subjects. As this research has no health benefit, the importance of the study objectives should clearly outweigh any inherent risks. This is relevant when considering the interactions with novel agents used to modify inflammation and that have the potential to exaggerate host responses to endotoxin (e.g., fever, changes in blood pressures, symptoms).\nPrior to the commencement of any study employing IV endotoxin, approval must be sought and obtained from an appropriate Research Ethics Committee (REC) / Institutional Review Board (IRB). IV endotoxin administration has been employed for over forty years to gain important mechanistic insights into human biology with no serious or lasting adverse effects to our, or other author's, knowledge19. Given the model's potential to yield vital information pertaining to multiple inflammatory conditions that are major causes of mortality and morbidity, we believe it is ethically acceptable to expose healthy volunteers and defined demographic or clinical groups to endotoxin, provided appropriate risk minimization strategies are in place. This may require independent outside review by qualified experts and or pilot studies to ensure safe conduct of the investigations, particularly when employing new agents and their interaction with endotoxin- induced inflammation.\nPreparation \n1. Determine the Demographic and Clinical Characteristics of Participants",
    "NOTE: The majority of studies employing IV endotoxin challenge recruit healthy young male volunteers < 30 year old. Studies have additionally been undertaken on healthy women23, older volunteers24,25 and patient subgroups26 depending on the experimental question. Elderly participants (i.e., greater than 60 years of age) may have a greater and more sustained response (higher fever, greater decrease in blood pressure), and interactions of endotoxin-induced inflammation with any co-morbid conditions or medications must be considered in the design of these studies. Please see discussion for further considerations in participant selection.\n2. Recruit Participants \nArrange suitable advertisement as required.\nNOTE: Financial compensation for participant’s time and inconvenience is commonly offered. This must be established prior to recruitment and approved by a REC/IRB.\nIssue a REC/IRB approved Participant Information Leaflet (PIL) explaining the nature of the study, an overview of the protocol, expected side effects, and risks associated with IV endotoxin to respondents meeting inclusion criteria.\nNOTE: This should be issued in advance of consenting to allow an informed decision to be made to participate and for any questions or concerns to be addressed by the researcher.\n3. Obtain Formal Informed Consent\nObtain written consent from all participants prior to undertaking any study-related procedure, including health screening.\nSeek verbal confirmation of participant retention and understanding of the information in the PIL.\nDiscuss side effects of IV endotoxin administration.",
    "NOTE: At higher doses (2 - 4 ng/kg) these include rigors (chills), headache, photophobia, myalgia, arthralgia, nausea, and rarely, vomiting. Peak symptom intensity occurs around 1 - 2 hr post-injection, abating afterwards to baseline by 6 - 8 hr. No severe or sustained adverse effects secondary to endotoxin at these doses have been reported. Rarely, a volunteer may find the degree of symptoms unacceptable during the height of the response. The symptoms can be ameliorated with administration of paracetamol/acetaminophen or non-steroidal agents by mouth or IV (e.g., aspirin, ibuprofen). Such agents may alter the inflammatory response and their use should be recorded.\nRe-affirm the ability of participants to withdraw from the study at any point without giving an explanation.\n4. Undertake a 'Health Screen' on Potential Participants\nNOTE: This is to ensure the absence of undisclosed medical conditions that place them at greater risk of harm from IV endotoxin. As a secondary aim information relevant to the experimental question may be identified. \nIdentify a suitable clinical environment and an appropriately trained medical professional to conduct the health screen.\nTake a full clinical history including past medical and social histories, past and on-going medication/treatments, novel health foods or over the counter pharmaceuticals, allergy status and an enquiry into the presence of current symptoms that may suggest new or recent illness.\nPerform a formal clinical examination of, as a minimum, the cardiovascular and respiratory system.\nArrange and review core investigations including routine observations (weight, heart rate, blood pressure, respiratory rate, oxygen saturations, temperature), blood work (full blood count, renal, hepatic and coagulation functional tests), and 12-lead electrocardiogram.\nNOTE: Additional tests may be required according to the experimental protocol.\nHave the participants with unremarkable history, examination and investigations proceed to IV endotoxin challenge, dependent on REC/IRB-approved inclusion/exclusion criteria.",
    "NOTE: It is best practice for newly detected symptoms, signs or test abnormalities to be reported to and investigated by the participant’s routine physician. These individuals should be excluded until any concern has been appropriately addressed.\n5. Inform Participants Proceeding to IV Endotoxin Challenge to; \nNotify the investigator of any new symptoms or illness.\nNOTE: This will normally preclude their entry into the study.\nAsk the participants arrive at a pre-stated time and location. Advise the participants to wear comfortable clothes and bring entertainment.\nAsk the participants to fast from midnight (clear fluids permitted).\nAsk the participants to refrain from alcohol and caffeine for 24 hr prior to injection and/or a pre-defined period afterwards (optional and protocol dependent)。\nProcedure\n6. Endotoxin Challenge (Prior to Endotoxin Administration)\nPrepare a bed with the head at 45°.\nNOTE: Ensure this is located in an appropriate location to gain clinical assistance and resuscitation equipment. For instance, a Clinical Research Facility, anesthetic room or intensive care unit.\nEnsure the required clinical and experimental equipment is accessible and functioning.\nNOTE: This includes a sphygmomanometer, thermometer, pulse oximeter and, if being employed, 3-lead cardiac monitoring. Verify completeness of local resuscitation equipment and accessibility of oxygen.\nReconstitute Clinical Center Reference Endotoxin\n\t\nAdd 5 ml of Sterile Water for Injection, USP (SWI) to a previously un-reconstituted vial of CCRE using full aseptic non-touch technique (ANTT) throughout. Vials contain 10,000 endotoxin units (EU) (approximately 1 µg) in the form of a white, lyophilized powder.\nPlace the vial of CCRE with 5 ml SWI added on a vortex shaker for 1 hr to ensure endotoxin adherent to the glass surface of the vial is fully dissolved.\nNOTE: CCRE does not go into solution readily, despite appearing to have fully-dissolved.",
    "Draw the correct weight-adjusted volume of endotoxin (now 2,000 EU/ml or roughly 200 ng/ml) into a 1 ml syringe.\nNOTE: Use glass or polypropylene syringes to minimize adherence (and loss) of endotoxin to equipment.\nParticipant\n\t\nConfirm consent to proceed with IV endotoxin administration. Enquire about new illness, symptoms and compliance with protocol specific instructions.\nNOTE: If there is medical concern or non-compliance endotoxin, delay the administration.\nAsk the participant to lie in the prepared bed, confirming they are comfortable. Ensure they have voided bladder and bowel.\nObtain vascular access.\n\t\nInsert an intravenous cannula under ANTT for the administration of endotoxin, and if included in the protocol, intravenous fluids.\nPlace a second intravascular line for on-going blood draw to avoid repeated venous stab. Insert this intravenously and connect to a 3-way tap (with or without an extension) to facilitate blood draw and flushing.\nNOTE: Alternatively, for continuous blood pressure monitoring and sample acquisition, site an intra-arterial line. This requires greater expertise for insertion and there is an increased risk of local complications.\n\t\t\nFor on-going blood draw using intravenous cannula, use an 18 gauge or larger bore cannula along with a siting in the antecubital fossa to avoid hemolysis and clotting. IV fluid administration will help maintain patency.\nNOTE: Selection of intravascular cannula insertion type and site should take place according to individual practitioner and participant preference. Intra-arterial lines are traditionally placed in the radial or femoral artery with prior instillation of local anesthetic (e.g., 1% Lidocaine).\nDraw blood for baseline tests upon insertion of either the first or second line. Discard the first 5 ml of blood (occupying dead-space within the cannula and connectors) prior to obtaining blood for sampling. Flush the line with 10 ml of 0.9% sodium chloride after blood draw.",
    "NOTE: The volume of blood drawn and handling of the samples will be determined by the experimental protocol and local laboratory procedures.\nAttach clinical monitoring as appropriate (e.g., 3-lead cardiac monitoring is usually employed with higher dose challenges 2 - 4 ng/kg).\nRecord baseline routine clinical observations as stated in 4.4 on an appropriate vital sign chart. Subjective symptom scoring (e.g., using visual analogue scores for headache, myalgia, etc.) should additionally be performed to monitor the participant experience.\nEndotoxin Administration\n\t\nFlush the intravenous cannula with 0.9% sodium chloride to ensure the cannula is correctly sited and patent.\nAdminister the pre-prepared, weight-adjusted dose of reconstituted CCRE via the same intravenous cannula. Inject the bolus (< 2 min) dose into a 3-way tap at the hub of the IV line.\nFlush with 10 ml 0.9% sodium chloride to ensure all CCRE enters the circulation.\nNOTE: To administer a continuous infusions inject the endotoxin into a known volume of diluent, e.g., 100 ml of 0.9% sodium chloride to achieve a pre-determined concentration, and infuse the resultant solution at a set rate (volume/time).\n7. Monitoring, Observation and Sample Draw\nMonitor participants undergoing IV endotoxin for a minimum of 6 hr after bolus dosing or for the duration of an infusion. Have a qualified, experienced clinician perform this step.\nRecord and review vital signs and any clinical observations at a minimum of once/hr. Continuous monitoring such as 3-lead cardiac monitoring may additionally be undertaken.\nNOTE: Investigators should note that at higher bolus doses (2 - 4 ng/kg) vasovagal reactions may provoke cardiac pauses. These are most frequent 30 min to 2 hr after injection and are not malignant (see discussion for further details).\nUndertake subjective symptom scoring at the discretion of the investigator.",
    "Administer 2 - 3 L of crystalloid (for instance 0.9% sodium chloride or Hartmann's solution) over 6 - 8 hr after bolus administration of 2 - 4 ng/kg.\nNOTE: No acceptable standard exists for administration of the above mentioned fluids.  Safety of participants is paramount. This provides routine maintenance fluid and volume replacement (for the period kept nil by mouth and increased insensible losses due to raised body temperature and respiratory rate). They may also counter the risk of cardiac arrhythmias (see discussion).\nObtain pre-determined samples required to answer the experimental question.\nNOTE: These traditionally include, but are not limited to, blood and urine. The timing, number and volume of samples should be the minimum required to obtain accurate data and have been approved by the REC/IRB. More frequent sampling may be required at certain time points (e.g., every 30 min) to ensure peak (or trough) values are not missed. Calculations of blood volume taken must account for blood discarded during withdrawal of dead space.\nProcess samples as required.\n8. End of Procedure\nHave the attending clinician ensure that the participant's symptoms have settled and that their observations are trending to normal (all altered parameters, e.g., elevated heart rate and temperature, demonstrating consistent reduction toward baseline values) prior to sanctioning the end of observation and subsequent discharge.\nNOTE: After bolus injection of 2 - 4 ng/kg CCRE symptoms normally fully abate by 6 - 8 hr. Individual observations follow overlapping but discrete time-courses. These have normally returned to baseline by 10 - 12 hr. Continuous infusion requires a longer period of observation as symptoms and vital signs will not subside immediately post cessation of endotoxin administration.\nRemove all monitoring equipment and intravascular lines ensuring hemostasis.",
    "Confirm the participant is happy to return home and has the contact details of investigator in case of any concern.\nNOTE: It is considered best practice to contact the participant the following day to check their health status and monitor for any sequelae."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}