{
  "id": 16521,
  "origin_website": "Jove",
  "title": "Kinetx: A Combined Flow Cytometry Assay and Analysis Software Framework to Quantitatively Measure and Categorize Platelet Activation in Real-time.",
  "procedures": [
    "This protocol used human whole blood and platelets from healthy donors with no underlying health conditions and not taking any medication known to interfere with platelet function after written informed consent and was approved by the University of Reading Research Ethics Committee.\n1. Collection of blood and preparation of platelet-rich plasma\nCollect the peripheral blood in a vacutainer containing 3.2% sodium citrate\nDiscard the first 3 mL.\nLet the blood rest at 30 °C for 30 min prior to centrifugation.\nPrepare the platelet-rich plasma (PRP) by centrifugation at 140 x g for 20 min at room temperature before incubation at 37 °C for the assay duration, which was finished within 60 min of centrifugation.\n2. Instrument preparation\nNOTE: A non-pressurized fluidics system is essential for real-time flow cytometry as platelets are stimulated simultaneously as the flow cytometer records events.\nUse a non-pressurized flow cytometer to carry out real-time flow cytometry.\nTo perform the assay at 37 °C, attach a mouse dissection mat to the stage to place the 96-well plate. Heat the mat to 37 °C for the duration of the assay.\nPlace a 96-well plate on top of the heated mat to allow for continuous incubation at 37 °C (Figure 1)\n3. Assay preparation\nFibrinogen binding and P-selectin expression\n\t\nCoat a polypropylene 96-well round-bottomed, non-treated microtitre plate with 5% bovine serum albumin (BSA) in Hepes buffered saline (HBS; 10 mM Hepes pH 7.4; 150 mM NaCl, 5 mM KCl, 1 mM MgSO4·7H20) overnight at 4 °C .\nPrepare the antibody mix in HBS containing 5 mM glucose (HBS-G). Add fluorescein isothiocyanate (FITC)-labelled anti-fibrinogen antibody, (FITC-FGN; dilution 1: 37.5 (v/v)) and allophycocyanin (APC)-labelled anti-P-selectin (APC-CD62P; dilution 1: 37.5 (v/v)) to HBS-G (final volume: 225 µL) and incubate in a 96-well plate at 37 °C .",
    "Immediately before collecting events, add PRP to the HBS-G-antibody mix at a dilution of 1:600 (v/v).\n\t\tNOTE: A low volume of PRP is required to ensure the event limit is not exceeded and reduce platelet aggregation in the sample. Platelet dilution was examined in pilot studies and does not affect activation rate.\nIncubate the activation mix containing FITC-FGN, (dilution 1: 37.5 (v/v)) and APC-CD62P (dilution 1: 37.5 (v/v)) and agonist at 37 °C. The agonists include thrombin (thr; 0.0012-1 U/mL) in the presence of Gly-Pro-Arg-Pro peptide (GPRP; 1.18 mM), cross-linked collagen related peptide (CRP-XL; 0.004-10 µg/mL), adenosine diphosphate (ADP; 0.04-4 µM), epinephrine (epi; 20-200 µM), 9,11-Dideoxy-11α,9α-epoxymethanoprostaglandin F2α (U46619; 0.02-5 µM), and thrombin receptor activator peptide 6 (TRAP-6; 0.04-10 µM).\nCalcium flux\n\tNOTE: This assay was performed using a commercial calcium assay kit (Table of Materials)\n\t\nCoat a polypropylene 96-well round-bottomed, non-treated microtitre plate with 5% BSA in Hepes buffered saline overnight at 4 °C.\nTo prepare the calcium assay dye, add 100 mL of calcium assay buffer and 2 mL probenecid stock solution (250 mM) to one bottle of calcium reagent to obtain 2x calcium reagent loading solution.\nTo prepare Fluo-4/HBS-G, dilute the calcium assay dye with HBS-G at a 1:1 ratio, filter through a 0.22 µM filter. Add 225 µL of Fluo-4/HBS-G to the appropriate wells of a 96-well plate at 37 °C.\nIncubate PRP at 37 °C for 30 min at a 1:1 dilution with Fluo-4/HBS-G.\nPrepare the activation mix in Fluo-4/HBS-G and incubate at 37 °C. The agonists include thrombin (1 U/mL) in the presence of GPRP, CRP-XL (0.5 µg/mL) ADP (1 µM), epinephrine (20 µM), U46619 (1 µM), and TRAP-6 (1 µM).",
    "Immediately before collecting events, add PRP/Fluo-4/HBS-G to the 225 µL of Fluo-4/HBS-G mix at a final PRP dilution (after agonist addition) of 1: 600 (v/v; 0.5 mL in 300 mL of the final volume).\n4. Assay procedure and data collection\nSet the flow cytometer to a flow rate on 'slow' with an average number of 1000 events per second (eps) and a maximum of 3000 eps. Set the threshold to 20000 to avoid recording cell debris.\nGate the platelet population using forward scatter (FSC), and side scatter (SSC) plots. For data collection, plot FSC-A vs. SSC-A to accurately gate the platelet population and FL1 or FL4 vs. time to record the fluorescent events over time.\nThe flow cytometer takes 14 s to begin recording events; after this, let the instrument record events in each well for another 5 s before adding 75 µL of the activation mix rapidly using a gel loading tip to ensure spontaneous mixing (Figure 1).\nCollect the events for 5 min and set up the plots to record the 488 (FL1; 533/30 filter - FITC-fibrinogen/FLUO-4) channel vs. time and the 633 (FL4; 675/25 filter - APC-P-selectin) channel vs. time.\nSave the plot data for the 488 and 633 channels from each well as CSV files.\n5. Data analysis\nDownload the latest version of Kinetx12.\n\tNOTE: The download includes all code required to analyze the data generated from the assay and is accompanied by a test set of experimental data from ten donors and outputs generated from their analysis (these results can be regenerated and validated via the following procedures) (Figure 2).\nSet up R environment\n\t\nUse the programming language R via the RStudio environment. Install R13, RStudio14 and the following packages: ggplot2, dplyr, plotrix, minpack.lm, tidyverse, psych. Ensure that all pre-requisite packages have been successfully installed.",
    "Create Metadata: Place a text file (called wellData.txt) inside the same directory as the data. It describes the agonists, their concentrations, any antibodies, and the assay (function or calcium) used to generate each CSV file.\nPlace a second text file ('IsotypeData.txt') in the same directory and defines the isotypes. The files provided in the download ('data/wellData.txt' and 'data/IsotypeData.txt') can act as a template, being easily adaptable to alternative agonists, inhibitors, and concentrations.\nAnalyze the data: Kinetx comprises three functions as defined in steps 5.2.5-5.2.7.\nkinetxProcess.R: This function processes the raw functional flow cytometry data. To run type kinetxProcess('data location','where to put outputs','FL1' (for FITC-anti-fibrinogen, or 'FL4' (for APC-CD62P)\nkinetxProcessCalcium.R: This function analyzes and labels the calcium flux data. To run type kinetxProcessCalcium('data location','where to put outputs','FL1')\nkinetxSummary.R: This function summarizes the data. To run type kinetxSummary('data location','where to put outputs','FL1').\nTo run all of the above functions (5.2.5-5.2.7) on the test data, use the script (test.R).\n\t\tNOTE: The first two functions produce figures for each donor that shows the raw data plus the fitted curves. All outputs and a spreadsheet that summarises the data are placed in the output location."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}