{
  "id": 13511,
  "origin_website": "Jove",
  "title": "Bioengineering of Humanized Bone Marrow Microenvironments in Mouse and Their Visualization by Live Imaging",
  "procedures": [
    "All animal experiments were performed under PPL 70/8904, approved by the U.K. Home Office and in accordance with Cancer Research UK guidelines. The use of human umbilical cord blood (UCB) and primary human acute myeloid leukemia (AML) samples was approved by the East London Ethical Committee after receiving consent and was carried out in accordance with the Declaration of Helsinki.\n1. Bioengineering Collagen-based Scaffolds with Human Hematopoietic and Stromal Cells\nNOTE: The entire protocol should be performed in sterile conditions and with sterile material. Cell culture medium 1 corresponds to hMSC medium (MEM-α, P/S, and 10% hMSC-FBS); cell culture medium 2 corresponds to EC medium (M199, 20% FBS, P/S, 10mM HEPES, 50 µg/mL heparin, 2 mM glutamine and 50 μg/mL ECGS) and cell culture medium 3 corresponds to hematopoietic cell medium (H5100 and P/S).\nPrepare umbilical cord blood mononuclear cells (CB-MNCs) or primary AML (bone marrow or peripheral blood MNCs) using a Ficoll-Paque density gradient, according to well-established protocols53.\n\t\nFor AML, deplete the T cells using OKT.3 antibody. Incubate 4 µg of OKT.3 per 1 x 106 AML MNCs for 30 min at room temperature before washing the cells in PBS. If required, cryopreserve the MNCs in FBS with 10% DMSO at 2 x 108 cells per mL.\nPrepare hMSC (culture medium 1) and EC (culture medium 2) cell cultures. Plate hMSC cells (see the Table of Materials) on regular cell culture flasks in hMSC medium. Plate ECs (see the Table of Materials) on collagen 1-coated surfaces in EC medium.\nAt 85-90% cell confluence remove the medium, wash twice with PBS, and add trypsin-EDTA solution (20 µL per cm2).",
    "After 5 min, check that cells are detached. Recover the cells by diluting 1:3 with cell culture medium. Centrifuge at 300 x g for 5 min and re-suspend in the corresponding medium for each cell type and count the cells using a Neubauer chamber.\nUse cells at 2 x 106 - 107 cells per mL. If both cell types need to be used together, mix the hMSC and EC suspensions in a 1:1 ratio.\nTransfer the cell suspension to an insulin syringe.\nUsing a scalpel, cut the sterilized gelatin sponge (e.g., gelfoam) initial scaffold (20 mm x 60 mm x 7 mm) into 24 pieces of similar size (6.6 mm x 7.5 mm x 7 mm; Figure 1A and B).\nReconstitute gelatin scaffolds by immersion in PBS (5 min).\nOne by one, gently put the scaffolds on a sterile tissue to remove excess PBS. Transfer the scaffolds to one well of a 24-well plate (ultra-low attachment surface) and use the syringe to inject 50 µL containing 105 - 106 cells (hMSC alone or in combination with hEC; Figure 1C).\nRepeat step 1.7 with each scaffold until all required scaffolds are seeded with stromal cells.\nIncubate for 1 h inside a cell culture incubator (37 °C and CO2 5%).\nFill each well with 3 mL of cell culture medium 1 (Figure 1D) and return the scaffolds to a cell culture incubator (37 °C and CO2 5%) for overnight incubation. Use cell culture medium 2 if ECs are used in the scaffolds.\nThaw CB-MNCs and isolate CD34+ cells from them following an appropriate CD34+ section kit protocol. Suspend the selected CD34+ cells in medium 3 and count them in a Neubauer chamber.\n\tNOTE: Here, cells were used at a concentration of 2 x 106 cells per mL.",
    "If AML patient-derived primary samples are used, thaw the cells, dilute them 1:10 in FBS, centrifuge them for 5 min at 300 x g, resuspend the cells in PBS-2% FBS, add anti-human CD3 antibody (2 - 4 µg per 106 cells), and incubate at room temperature for 30 min. Centrifuge for 5 min at 300 x g and resuspend in hematopoietic cell medium supplemented with cytokines (20 ng/mL granulocyte-colony stimulating factor (G-CSF), 20 ng/mL IL-3, and 20 ng/mL thrombopoietin (TPO)).\nRepeat steps 1.7 - 1.9 but in this case seed 1 x 105 human hematopoietic cells instead of stromal components, as above.\n\t\nFill the well with 3 mL of cell culture medium 3 (Figure 1D) and return the scaffolds to a cell culture incubator (37 °C and CO2 5%) for overnight incubation. Use a 1:1 mix of cell culture media 2 and 3 If ECs are used in the scaffolds.\nFor only recombinant human bone morphogenetic protein-2 (rhBMP-2) carrier scaffolds, gently put the scaffolds one by one on a sterile tissue to remove excess PBS. Transfer the scaffolds to one well of a u-bottom, 96-well plate (Figure 1E) and add 5 µL of rhBMP-2, thoroughly covering the scaffold.\n\t\nAdd 20 µL of thrombin followed by 20 µL of fibrinogen, thoroughly covering the scaffold each time (Figure 1F). Repeat the procedure for each scaffold until all required scaffolds are treated and then incubate for 5 - 10 min at 37 °C. Check if coagulation has successfully formed.\n2. Surgical Implantation of Bioengineered Scaffolds\nNOTE: Here, either male or female, 6- to 12-week-old NSG mice were used. As the animals are immunodeficient, all procedures should be done in sterile conditions. Steps 2.10 - 2.13 are related to survival strategies and post-surgical care.",
    "60 - 120 min before surgery, subcutaneously administer pain medication (carprofen, 5 mg/kg bodyweight/mouse).\nInduce anesthesia in a chamber with 0.5% isoflurane and 2 L/min O2.  Mice should be monitored continuously during the procedure. Transfer the animal to the surgical area in prone position in order to have easy access to the back. Keep the animal under anesthesia using a nose cone supplying 1.5% isoflurane and 2 L/min O2. Keep the mouse under anesthesia during the surgical procedure and frequently check the animal state.\nWhile it is under anesthesia, use ophthalmic gel on the eyes of the mouse to prevent dryness, and keep the mouse at 37 °C.\nShave the surgical area on the back of the mouse using an electric trimmer. To sterilize the skin, dip a cotton tip in diluted clorexidine (diluted 1:10 in PBS) and use this tip to clean the skin surface. Repeat this procedure twice.\nUsing sterile forceps and a scalpel (or scissors), make a 0.5- to 0.7-cm anterior-to-posterior full incision of the skin. Use the forceps inserted under the subcutaneous tissue to make a pocket.\nInsert the scaffold subcutaneously, making sure that it is placed deep within the pocket (Figure 1G and H). Close the incision with surgical glue (Figure 1I and J).\nTo treat post-surgical pain, subcutaneously administer buprenorphine (0.1 mg/kg bodyweight).\nDuring recovery, place the animal on its side in a pre-warmed cage and monitor recovery until normal behavior is observed.\nDilute pain medication in water (carprofen, 0.1 mg/mL of water) and provide it to animals as drinking water for 4 days after surgery.\nCheck the animal and the wound frequently during the 48-h post-surgery period for possible adverse effects.\n3. Mouse Treatments, Euthanasia, and Sample Retrieval for Imaging\nNOTE: Analysis of the scaffolds is performed between 8 and 24 weeks post-implantation.",
    "60 min before imaging, keep the implanted mouse warm in a heating box at 37 °C and intravenously administer 100 µL of human immunoglobulin to block unspecific sites.\n30 min before imaging, intravenously administer 10 µg (per mouse) of specific antibodies to label the cells of interest.\n5 min before imaging, intravenously administer 15 µL (diluted in 100 µL of PBS) of 655-nm fluorophore-labeled, vessel-pooling agent (655-VPA) to visualize vascular structures.\nEuthanize the mouse via cervical dislocation.\nUsing sharp scissors, make a longitudinal skin incision on the back of the mouse, near the original implantation site.\nWith the help of tweezers and scissors, carefully separate the skin from the subcutaneous pocket where the scaffold has been implanted.\nHold the scaffold with tweezers and gently explant it from the skin by cutting the residual membrane and tissue surrounding the scaffold using scissors. See examples of scaffolds to be recovered in Figure 2.\nSecure the scaffold with fast-acting adhesive glue to an imaging plate (a 35 mm x 10 mm Petri dish) and fill with saline solution (PBS) at room temperature.\nFor BMP scaffolds, before filling the plate with PBS, use a surgical microdrill to thin the bone surface under a microsurgical microscope; this allows fluorophore visualization and high-resolution image capture. Use either the 1.2- or 1.6-mm burrs, depending upon the size of the scaffold.\n\tNOTE: The user will realize how much to drill depending upon the thickness of the bone. In general, as the BMP scaffolds are vascularized, the bone will slightly change color and become more red when approaching the correct thickness for imaging.\nInsert the plate onto the stage of the confocal microscope.\n4. Live-imaging Using Two-photon Microscopy",
    "NOTE: When using non-descanned detectors (NDD), always use the NDD slider for imaging to direct the fluorescence to the NDD. The microscope configuration is provided in Figure 3.\nSwitch on the microscope and the computer, start the software by clicking \"Start System,\" and go to the \"Acquisition\" mode.\nTick the \"Show manual tools\" box. In the \"Laser\" menu switch \"on\" the two-photon laser and allow it to warm up and stabilize.\nIn the \"Imaging Setup\" menu, simultaneously activate \"Channel Mode\" and \"Switch track every Frame.\" In the \"Light Path\" menu, select \"Non Descanned'\" and \"Main Beam Splitter MBS 760+.\" Tick to activate the four NDDs and set the configuration as illustrated in Figure 3.\n\tNOTE: With this configuration, the collagen signal from bone structures (second harmonic generation, SHG) is collected at 380 - 485 nm, FITC-hCD31+ human endothelial cells and AF488- hCD45+ human hematopoietic cells at 500-550 nm, and 655-VPA at 640 - 690 nm.\nIn the \"Channels\" menu, set the \"laser wavelength\" to 890 nm and the power to 50%. Set the \"Gain (Master)\" to 500-600, the \"Digital Offset\" to 0, and the \"Digital Gain\" to 15 for each channel. Adjust these values once the acquisition has started.\nIn \"Acquisition Mode,\" set up the required parameters to obtain high-resolution images without damaging the tissue and bleaching the fluorophores. Set \"Scan Mode\" to \"Frame,\" \"Frame Size\" to \"x512 y512,\" Line Step\" to 1, \"Speed\" to 9, \"Averaging number\" to 8, \"Bit Depth\" to \"8 Bit,\" \"Mode\" to \"line,\" \"Direction\" to \"bidirectional,\" and \"Method\" to \"mean.\"\n\t\nSet the \"Zoom\" to 1 for the initial scan of the image, and increase it if required to focus on particular areas.",
    "Place the plate containing the scaffold on the microscope stage under the 20X, 1.0 NA water-immersion lens and lower the lens until it touches the saline solution. Set the focus of the lens on the scaffold using the microscope eyepieces, using a lamp as the light source.\nActivate the \"Z-stack\" menu, select the \"First/Last\" function, and set the required interval between two sub-sequential slices (e.g., 2-µm Z-stack). Keep the intervals constant within the Z-stack.\nSelect \"Live\" to image a live scan of the sample and adjust the \"Digital Gain\" and \"Digital Offset\" for optimal exposure. To visualize multiple channels at the same time, select the \"Split\" function.\nIn the \"Stage\" menu, while in \"Live\" mode, scan the image and \"Mark\" regions of interest (ROI), such as the location of human hematopoietic cells and vascular structures. When the scan of the sample is complete, move to the first ROI to start imaging.\nIn \"Live\" mode, set the top and bottom of the 3D Z-stack surrounding the area of interest using the \"Set first\" and \"Set last\" functions. Once finished, set the center, \"C.\" Start the acquisition of the ROI with the \"start experiment\" button. See examples of images in Figure 4, Figure 5, and Figure 6.\nOnce acquisition is complete, save the image in the designated folder. Move to the next ROI and repeat step 4.10. Once the experiment is complete, remove the imaging plate from the microscope, carefully detach the sample from the plate, and clean any residual glue.\nPrepare the sample for the next analysis technique.\n5. Sample Processing for Histology and Immunostaining",
    "NOTE: Samples are processed according to the protocol described in the JoVE general laboratory techniques54 describing sample fixation, embedding, and sectioning processes. Bone-forming samples should be treated for 7 days in an EDTA-based decalcifying agent between the fixation and embedding processes. The blocking/permeabilization solution is 10 mM PBS pH 7.4 buffer with 1% Triton X-100, 1% bovine serum albumin (BSA), and 10% normal goat serum (NGS).\nPut the slices in xylene for 10 min), xylene for 5 min, 100% ethanol for 5 min, 70% ethanol for 5 min, 50% ethanol for 5 min, and H2O for 5 min.\nTransfer the slices to a citrate-based antigen unmasking working solution.\nBoil the slices for 15 min and allow them to cool to room temperature.\nWash the slices in 10 mM PBS pH 7.4 solution with 1% Triton X-100 (5 min, 3 times).\nTransfer the samples to the blocking/permeabilization solution and incubate for 30 min.\nAdd primary antibody diluted in blocking/permeabilization solution and incubate overnight at 4 °C.\nWash the slices in 10 mM PBS pH 7.4 solution with 1% Triton X-100 (5 min, 3 times).\nAdd secondary antibody diluted in blocking/permeabilization solution for 1 h in the dark at room temperature.\nWash with H2O (5 min, 3 times).\nTo reduce background fluorescence, immerse the slices in Sudan Black working solution for 10 min, in the dark and at room temperature.\nWash the slices in H2O (5 min, 3 times).\nMount the slices using fluorescent mounting medium with DAPI (0.5 µg/mL).\nStore the slices at 4 °C and check that the mounting medium is dry before conducting fluorescent imaging. See example images in Figure 7."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}