{
  "id": 8949,
  "origin_website": "Jove",
  "title": "Quantification of Drosophila Grooming Behavior",
  "procedures": [
    "1. Preparation\nPrepare an aspirator for moving live Drosophila from a culture vial to the grooming chamber. Aspirators allow transfer of conscious animals to the behavioral chambers to ensure that anesthesia does not affect subsequent behavioral observation.\nUsing scissors cut 1.5 feet of tygon tubing ID ⅛\", OD ¼\".Cut at least 1 inch off of the tip of a 1 mL disposable micropipette tip. Hold a 1 cm square piece of mesh (opening 0.196 inch) over the cut tip.\n\t\tNOTE: Most 1mL tips have a gradation line where the tip sits in the package box, typically cut to that line.\nSnugly place a fresh 1 mL micropipette tip over the mesh/cut tip. Observe the mesh form a tight barrier between the two tips. The inside of the new tip creates a holding chamber for flies.\nCut the extreme tip of the new micropipette tip to widen the opening enough to allow passage of a single fly. The hole will roughly match the opening of the grooming chamber (approximately 1.5-2 mm in diameter).\nSnugly fit the nested tips onto the end of the tygon tubing. Push the tips into the tube to ensure a tight fit to allow for vacuum pressure.\nOn the other end of the tubing, cut the tip of a 200 μL micropipette tip and fit the narrow cut end into the tubing. This is the \"mouth\" side of the aspirator.\nPrepare dust aliquot tubes. Weigh approximately 5 mg of Brilliant Yellow dye on tared weighing paper. Pour the dust into a 0.6 mL microcentrifuge tube and tightly close the cap.\n\tNOTE: We advise the use of nitrile gloves during aliquot preparation, as some latex gloves are permeable to the dye.\nRepeat step 1.2) for all samples in the experiment (one for every fly in each chamber).",
    "Prepare ethanol (EtOH) tubes: Pipet 1 mL of 100% EtOH into 1.5 mL microcentrifuge tubes. Label tubes for genotypes or conditions.\nRepeat step 1.4) for all samples in the experiment (one for every fly in each chamber). Cap and save the EtOH tubes for completion of the grooming assay. Also include at least one \"Blank\" sample which will only be 1 mL EtOH without a fly for negative controls.\nAssemble each grooming chamber by screwing the sliding top plate (with the smaller holes) but leaving the bottom plate (with the larger holes) removed for addition of dust.\nPlace each necessary grooming chamber flat on a table with the top face down. Fly entry side is face-down.\nLoad 5 mg Brilliant Yellow dye aliquot into each chamber by tapping the tube against the surface of the chamber above the desired well. Tap the chamber against the table to ensure that all of the dust falls through the mesh to the top plate.\nScrew the bottom plate onto each chamber such that the wider ends of the conical openings face outward and the holes do not rest over the wells. Secure the bottom plate tightly so that it does not slide and release dye.\nFlip the chamber over and knock it flat against a table a few times so that the dust falls through the mesh to rest on the bottom plate.\nSlide the top plate of the chamber into the \"open position\" so that the small holes align with the fifteen wells, allowing the introduction of flies into individual wells.\n2. Fly-dusting and Grooming\nLoad one fly into the mouth aspirator by gently sucking through one end of the aspirator as if using a straw. Deposit the flies by lightly blowing and directing the opening toward the target.",
    "Aspirate one fly into each well used for the experiment. After loading a well, slide the top plate so that the fly is trapped in the chamber and place tape over the opening of that well during loading of the whole chamber to prevent the fly's escape while loading other wells. If multiple flies are aspirated into a single well, leave that opening uncovered until only one fly remains.\nAfter all of the necessary wells are filled with flies, flip the chamber such that the bottom plate is upward so that the dust has the potential to coat the flies by falling through the mesh.\nTightly secure the top and bottom plates by tightening the screws, and vortex the chamber to dust the flies for 4 s.\nKnock the chamber (top plate facedown) against a table twice so that dye falls through to the other side. Then, flip the chamber over (top plate face-up) and knock the chamber twice to ensure dye settles on the floor of the bottom chamber away from the fly held in the top chamber.\nFor control flies which are not allowed to groom, immediately proceed to Step 3 of the protocol. For flies that will complete the assay, proceed to Step 2.7.\nRest the chamber flat on a table or countertop with the top plate upward for thirty minutes to allow the flies to groom. Place the chamber in a noise and vibration-free space to keep your environment constant for all grooming experiments (lighting levels, humidity, and temperature). A tabletop incubator at RT or 25 °C with humidity controls is ideal.\n3. Preparation of Samples and Absorbance Analysis\nKeeping the chamber level with the top plate upward, gently unscrew the bottom plate and remove it from the chamber, taking care not to lose dye.",
    "Place the chamber on a Fly CO2 pad with low airflow until the flies are anaesthetized.\nUnscrew the top plate from the chamber. Carefully use forceps to grab a leg and move one dusted fly from each chamber and deposit it in a 1.5 mL microcentrifuge tube containing EtOH. The transfer time for 15 chambers each containing one fly is approximately 3-5 min. Experimenters should factor in transfer times if/when staggering experiments with multiple chambers to ensure efficient staging of experiments.\nOnce each microcentrifuge tube contains 1 fly, close the cap and invert the tube three times to agitate and mix the solution of dye and ethanol.\nIncubate tubes containing ethanol and flies for 5 h at RT to ensure full removal of the dye from the fly into solution. After the 5 h, briefly vortex each tube (2 s) to ensure clearance of the dye from the flies.\nAliquot 50 µL of the experimental 1.5 mL tube into a well of a 96-well plate if available, taking note of the location of each sample on the plate. Add 200 µL of EtOH to dilute the sample 5x. The dilution avoids ceiling effects of heavily dusted flies or large grooming defects.\nUse a plate reader to analyze each sample at 397 nm. Alternatively, measure absorbance for individual samples and blanks on a standard spectrophotometer in the visible spectrum if a plate reader is unavailable.\nRead and record the sample through the plate reader and save the spreadsheet with the recorded samples on the plate.\n4. Quantification of Results\nCompile results for all samples and measure the variance for each genotype or condition.",
    "NOTE: Dye accumulation at time 0 min and at time 30 min are regarded as separate conditions using statistical analysis by one-way ANOVA and Bonferroni correction or other corrections for multiple parallel comparisons.\nCalculate grooming percentage difference for each genotype/condition using the following equation: [(dye accumulation mean value at time 0' - dye accumulation mean value at time 30') / dye accumulation mean value at time 0] x 100.\nExpress the percentage for each genotype and condition in bar plots and compare across genotypes and conditions.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}