{
  "id": 16466,
  "origin_website": "Jove",
  "title": "Quaternary Structure Modeling Through Chemical Cross-Linking Mass Spectrometry: Extending TX-MS Jupyter Reports",
  "procedures": [
    "1. Submit workflow at https://txms.org.\nGo to https://txms.org and click \"Use Cheetah-MS.\"\nTo submit workflow, you need to provide two PDB files and one MS/MS mzML or MGF file. You can also click on the \"load sample data\" to see the demo version of the workflow.\n\tNOTE: Please look at the manual page of the webserver for detailed information on how to submit a job. The web server supports different non-cleavable cross-linker agents, up to 12 post-translational modifications (PTMs), options related to computational modeling and MS data analysis. Small help buttons are also designed on the submit page to show more information regarding each option.\n2. Run Cheetah-MS.\nNOTE: Convert the vendor-specific formats to mzML or MGF using the ProteoWizard MSConvert software19.\nUpload the MS data to https://txms.org. Then, click on \"Choose file\" and select the MS data, which must be in the mzML/MGF data formats18.\n\tNOTE: Example data are available on https://txms.org. These data are also directly accessible through zenodo.org, DOI 10.5281/zenodo.3361621.\nUpload two PDB files to https://txms.org. Click on \"Choose file\" and select the PDB files to upload.\n\tNOTE: If no experimental structures exist, create models using, for example, SWISS-MODEL20 if homologue structures are available, or trRosetta21,22 or Robetta23,24 web servers for de novo structure predictions.\nSubmit a new workflow. Click on \"Submit\" to receive a job identifier tag. Then, follow the form to the results section using this tag.\n\tNOTE: Computing the result takes time, so please wait until the workflow finishes, and store the job identifier tag to return to the results page. The computation is carried out on remote computational infrastructure. If you want to run TX-MS locally, please refer to Hauri et al.10.",
    "Inspect the Jupyter Notebook report using the online viewer. Then, scroll down to \"Report\" in the results section using the job identifier tag.\n3. Install JupyterHub.\nInstall docker as instructed at https://docs.docker.com/install/.\nDownload the JupyterHub docker container with the Jupyter openBIS25 extension. The general command is \"docker pull malmstroem/jove:latest,\" but might differ on other platforms.\n\tNOTE: For a general discussion on how to download containers, please refer to https://www.docker.com/get-started. It is also possible to download the container from zenodo.org, DOI 10.5281/zenodo.3361621.\n\tNOTE: The Jupyter openBIS extension source code is available here: https://pypi.org/project/jupyter-openbis-extension/.\nStart the docker container: docker run -p 8178:8000 malmstroem/jove:latest.\n\tNOTE: The port that JupyterHub uses by default is 8000. This port is configurable, and the commands above need to be adjusted accordingly if changed. Port 8178 is an arbitrary choice and can be changed. The example URLs provided below need to be adjusted accordingly.\nGo to the following address: http://127.0.0.1:8178. Log in using the username \"user\" and the password \"user.\"\n\tNOTE: The address http://127.0.0.1 implies that the docker container is running on the local computer. If the docker container is run on a server, use the server's IP address or URL (e.g., https://example.com). The docker container is based on Ubuntu Bionic 18.04, JupyterHub 0.9.6, and Jupyter openBIS extension 0.2. It is possible to install this in other operating systems, but this was not tested.\n4. Download the report.\nCreate a new notebook by clicking New| Python 3 using the menu located near the top right part of the page. This will open a new tab with a notebook called Untitled (or something similar).\nClick \"Configure openBIS Connections\" in the Jupyter tool menu.\nFill in the name: txms; URL: https://txms.org; user: guest; password: guestpasswd.\nClick \"Connect.\"\nChoose the new connection and click \"Choose Connection.\"",
    "Search for the report template (e.g., /CHEETAH/WF70) and click Download.\n\tNOTE: You need to adjust the report template based on the results and report you obtained from running your job on the Cheetah-MS web server.\nRerun the report by clicking Cell | Run All.\n5. Extend the report.\nAdd a new cell at the bottom: Cell | Insert Below.\nType in the wanted code. For an example, please see the Representative Results section below.\nExecute the cell by pressing \"Shift-Enter.\""
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}