{
  "id": 3858,
  "origin_website": "Cell",
  "title": "3D time-lapse microscopy paired with endpoint lineage analysis in mouse blastocysts",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nEmbryo isolation\nTiming: 1 h\nPregnant mice are euthanized and the uterus is dissected. Embryos are flushed from the uterine horns and collected for the experiment.\nEuthanize pregnant females at E3.5 according to approved institutional animal care and use committee protocol.\nNote: Embryo staging can be done by checking plugs or by counting the number of cells. If checking plugs, E0.5 represents the day the plug was observed and if counting the number of cells, embryos of 32–64 total cells represent the E3.25-E3.5 blastocyst stage (Saiz et al., 2016[href=https://www.wicell.org#bib19]).\nPlace mouse onto absorbent pad in dissection area in a supine position (abdomen facing up). Spray the animal with 70% ethanol (Figure 3[href=https://www.wicell.org#fig3]A)\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/580-Fig3.jpg\nFigure 3. Uterine horn dissection for blastocyst collection\n(A) Mouse placed in supine position.\n(B) Visible uterus after adipose tissue and viscera have been removed. Uterus is outlined in dashed white line.\n(C) Dissected uterus in PBS. Dashed lines indicate approximate region where cuts should be made.\n(D) Uterine horn after it has been dissected from the oviduct and cervix.\nUsing scissors, make a transverse incision in the skin and peritoneum crossing the midline of the animal.\nUsing forceps, move skin, fatty tissue, and intestines to reveal the uterus (Figure 3[href=https://www.wicell.org#fig3]B).\nDissect the uterus by cutting just below the cervix and between the oviduct and ovaries. Transfer tissue to a 60-mm dish with PBS.\nOptional: Fatty tissue attached to the uterus can be removed at this stage with scissors. This can make subsequent steps of the dissection easier and it will be more difficult to trim away the fat once the uterine horns have been removed from the animal.",
    "Dissect each uterine horn by cutting at the uterotubal junction (UTJ) and just before the horn meets the cervix (Figures 3[href=https://www.wicell.org#fig3]C and 3D).\nUsing a transfer pipette, add ~300 μL warm M2 to a 35-mm dish. Place one uterine horn from the PBS to the drop of M2.\nFill a 1 mL syringe with warm M2. Insert the needle tip into the uterine horn near where the UTJ cut was made. Gently flush the uterine horn with 0.5 mL M2. You should observe some swelling of the tissue as it is filled with media.\nRemove and dispose of the tissue that was just flushed with media and repeat the flushing step with the second uterine horn.\nAllow approximately 1 min for embryos to settle to the bottom of the dish. Using a dissection microscope, scan the plate for embryos. [Troubleshooting 1]\nNote: If dissecting multiple animals on the same day, this time can be used to flush the remaining uterine horns into fresh M2 medium.\nTransfer embryos from the M2 media into one drop of KSOM in the embryo culture dish.\nWash embryos by sequentially passing them into each of the KSOM drops.\nOptional: Remove zona pellucida (ZP) by acid wash (described in detail in Nagy, 2006[href=https://www.wicell.org#bib14]). ZP removal is particularly important for staining with some primary antibodies. Embryos denuded of ZP tend to stick to surfaces and may be more difficult to work with in subsequent steps of this protocol.\nPlace culture dish containing embryos into a 37°C 5% CO2 incubator.\nEmbryo mounting and imaging\nTiming: 10–15 h\nEmbryos are mounted onto an optical plate in individual drops of culture media and live imaged by confocal microscopy.\nTurn on microscope, camera, light source, and stage incubator.",
    "Prepare the embryo imaging plate by arranging drops of ~0.2 μL KSOM onto the imaging plate. The number of drops should be equal to the number of embryos that will be imaged in the experiment (Figures 4[href=https://www.wicell.org#fig4]A and 4B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/580-Fig4.jpg\nFigure 4. Embryo imaging plate\n(A) KSOM drops arranged in grid on coverslip area and covered in mineral oil.\n(B) Magnified image of coverslip area in (A) through view of stereomicroscope.\nNote: Work quickly during this step as the volume of individual drops is small enough that they can evaporate if left to sit.\nNote: Large drops should be avoided. Embryos are more likely to move around during the live imaging in larger drops and the drops themselves can detach from the plate, resulting in loss of data.\nCover the drops with mineral oil and place the plate in a 37°C 5% CO2 incubator for at least 30 min to allow KSOM to equilibrate.\nMount embryos for imaging by transferring one embryo to each drop of the imaging plate.\nCritical: Position embryos such that the embryonic-abembryonic axis (Gardner, 1997[href=https://www.wicell.org#bib7]) of the blastocyst runs parallel to the plane of the coverslip (Figures 5[href=https://www.wicell.org#fig5]A–5C). This will be instrumental for the alignment and re-imaging section of the protocol.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/580-Fig5.jpg\nFigure 5. Blastocyst imaging orientation\n(A) Schematic of blastocyst with embryonic-abembryonic axis in dashed red line.\n(B) Schematic of ideal blastocyst orientation for imaging on a coverslip.\n(C) Example bright-field image of a blastocyst.\nSet imaging plate onto the microscope stage. Perform imaging according to biosensors/fluorescent reporters used in experiment (troubleshooting 2 and 3).",
    "Note: Conditions will have to be optimized according to different experimental parameters and individual microscope assemblies. The following conditions were determined during optimization of live imaging from the original study, which included embryos expressing ERK-KTR-mClover and H2B-mRuby2 imaged in the YFP and mCherry channels (Pokrass et al., 2020[href=https://www.wicell.org#bib17]).\nExposure Time: 200–250 ms\nLaser Power: 22%–25% of maximum\nZ-stacks: 5 μm steps\nImaging Interval: 15 min\n1 h before end of the imaging interval, continue to step 20.\nPrepare 96-well round bottom plate for immunofluorescence\nTiming: 30 min\nA 96-well round bottom plate is coated with 1% agar and 0.9% NaCl to prevent embryos from sticking to surfaces during the immunofluorescence staining.\nPrepare plate coating solution by microwaving 10 mL molecular biology-grade water with 1% agar and 0.9% NaCl until dissolved.\nPipette 50 μL coating solution to wells of a 96-well round bottom plate.\nGently tap plate on bench top to settle solution to the bottom of all wells.\nCover plate with lid or aluminum foil and set in 4°C refrigerator. The plate can sit for several hours but should be used within 24 h of its preparation.\nEmbryo retrieval and immunofluorescence\nTiming: 1–2 d\nFollowing live imaging, embryos are fixed and immunolabeled for lineage markers. This immunofluorescence protocol is performed in a 96-well plate format in which embryos are serially passed from left-to-right into wells containing the appropriate solutions.\nCritical: Fixing embryos immediately at the end of the live imaging period is essential for in silico alignment of embryos from the live imaging and endpoint datasets.\nNote: The H2B-mRuby2 signal from ERK-KTR embryos is retained during fixation and can be used as the nuclear marker for both live and immunofluorescence imaging.\nNote: This method was learned from the Hadjantonakis lab and adapted from previously published protocols (Frankenberg et al., 2013[href=https://www.wicell.org#bib6]).",
    "Thaw 1 mL of 4% formaldehyde in PBS.\nCritical: Quality of formaldehyde solution is crucial for fixation. 4% formaldehyde can be stored for up to 1 year at −20°C. Use aliquots thawed the day of the experiment for best results.\nWhile formaldehyde thaws, label the coated 96-well round bottom plate according to Table 1[href=https://www.wicell.org#tbl1].\ntable:files/protocols_protocol_580_5.csv\nImmunofluorescence Plate\nFill columns 1–6 with solutions indicated in Table 1[href=https://www.wicell.org#tbl1]. That is, pipet 100 μL 4% formaldehyde to column 1, 100 μL PBX to column 2, and so on.\nNote: You will need as many rows as you have embryos in the experiment. Experiments with >8 embryos will accordingly need additional 96 well plates.\nImmediately at the end of the imaging time course, bring the imaging plate and immunofluorescence plate to the dissection microscope.\nTransfer embryos from the imaging plate into column 1 of the immunofluorescence plate containing 4% formaldehyde at a ratio of one embryo per well. Incubate for 10 min at 20°C–25°C.\nNote: It is important to keep track of individual embryos. A simple numbering system is effective.\nWash embryos once by passing them into PBX.\nPause Point: Fixed embryos can be stored for up to a week at 4°C protected from light. Transfer fixed embryos to a well with 4% BSA in PBS and cover with mineral oil to prevent evaporation.\nIncubate embryos in permeabilization buffer for 5 min at 20°C–25°C.\nWash embryos once in PBX.\nBlock 1 h at 20°C–25°C.\nIncubate in primary antibody diluted in blocking buffer at least 16 h at 4°C. Cover wells containing primary antibody with mineral oil to prevent evaporation and cover plate with lid or aluminum foil.\nNote: Primary antibodies were diluted as follows: Rabbit anti-NANOG (1:500), Goat anti-GATA6 (1:2,000), Mouse anti-CDX2 (1:100). Antibody dilutions should be optimized according to individual experimental parameters.",
    "On the following day, fill columns 7–11 with solutions according to Table 1[href=https://www.wicell.org#tbl1].\nWash embryos three times in PBX.\nBlock 1 h at 20°C–25°C.\nIncubate embryos in secondary antibody diluted in blocking buffer for 60–90 min at 20°C–25°C. Cover wells with mineral oil and protect from light.\nNote: Secondary antibodies were diluted as follows: Donkey anti-Rabbit (1:400), Donkey anti-Goat (1:1,000), Donkey anti-Mouse (1:1,000).\nDuring secondary antibody incubation, prepare a final wash plate. Add 50 uL plate coating solution to columns 1–3 of a fresh 96-well round bottom plate. Put at 4°C and add solutions according to Table 2[href=https://www.wicell.org#tbl2] after plate coating solution has solidified.\ntable:files/protocols_protocol_580_6.csv\nFinal Wash Plate\nWash embryos twice in PBX.\nAfter the last wash, leave embryos in PBX and prepare imaging plate as in step 15; however, using PBS instead of KSOM for the mounting medium.\nWash embryos once in PBS, then transfer to imaging plate.\nNote: Careful pipetting the embryos. They can easily get stuck to glass when transferred to solutions without detergent like PBS. Using a pipette that has previously held PBX can prevent embryo loss.\nNote: To the extent that is possible, arrange embryos on the imaging plate in the same position and orientation they were in for the live imaging.\nPerform imaging according to experimental protocol (Troubleshooting 4).\nAlignment inspection and embryo re-imaging\nTiming: 2–6 h\nUsing an image processing program like Fiji (Schindelin et al., 2012[href=https://www.wicell.org#bib20]), load the nuclear marker images representing the last frame of the time-lapse imaging and the fixed images of each embryo.",
    "Examine both image stacks closely for each embryo and determine if they can be aligned by eye (Figures 6[href=https://www.wicell.org#fig6]A and 6B). Good alignment represents the agreement between both datasets such that the same cells can be unambiguously identified based of off morphological and cytological features in the live and fixed image stacks. [Troubleshooting 5]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/580-Fig6.jpg\nFigure 6. In silico alignment examples\nImages were collected as described in step-by-step methods and inspected for nuclear overlap. 3 planes of a representative blastocyst are shown at different sample depths from both the time-lapse and immunofluorescence data. Optical section labels correspond to sample depth in the time-lapse image stacks.\n(A) Example of good alignment.\n(B) Example of poor alignment.\nNote: If using an H2B nuclear marker, it can be helpful to use the nucleolus precursor bodies (Kyogoku et al., 2014[href=https://www.wicell.org#bib10]) as landmarks within individual nuclei.\nNote: Rotating image sets in the XY dimension can aid the visual determination of alignment.\nRecord which embryos failed to align.\nTake the imaging plate back to the dissection microscope. For any embryos that could not be aligned, gently reposition them using a mouth pipette. It is best to rotate the blastocysts along the embryonic-abembryonic axis.\nRe-image the embryos manipulated in the previous step. Check alignment and repeat as necessary until images that can be used for alignment are obtained.\nNote: Pay attention to photobleaching in re-imaged embryos. Try to keep the total number of times any embryo is imaged to three or fewer.\nOnce images suitable for alignment have been obtained, proceed with analysis of time-lapse and fixed imaging data.\nImage analysis\nTiming: 1–3 h per embryo\nLoad time-lapse and immunofluorescence image data in Fiji as stacks.",
    "Using the nuclear marker channel in each stack, perform any image translation or rotation required to identify corresponding cells in each data set (Figure 7[href=https://www.wicell.org#fig7]A). It may be helpful to crop the images.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/580-Fig7.jpg\nFigure 7. Image analysis in Fiji\n(A) Time-lapse and immunofluorescence images as stacks.\n(B) Duplication of the nuclear marker channel from the immunofluorescence image stack.\n(C) Several planes of the duplicate stack in (B) with multi-points to indicate cell number in analysis.\n(D) Example ROIs to analyze KTR intensity in the nucleus and cytoplasm. ERK-KTR (cyan) and H2B (red) have been merged to facilitate identification of nuclear and cytoplasmic cell compartments.\n(E) Example ROI to analyze immunofluorescence signal in fixed cells. Overlay of GATA6 (red) and NANOG (cyan) is shown.\nDuplicate the nuclear marker channel of the immunofluorescence image stack (Figure 7[href=https://www.wicell.org#fig7]B). This will serve as a record of which cells have been analyzed.\nUsing the multi-point tool, give all cells that will be analyzed a number on the duplicate nuclear marker stack (Figure 7[href=https://www.wicell.org#fig7]C).\nIn the Fiji menu select “Analyze -> Set Measurements…” to preset the parameters that will be recorded by the measure command.\nNote: Area, mean value, centroid, and stack position are helpful to have in most experiments.\nBegin analyzing cell 1 (from the numbering in step 48) on the time-lapse stack. Starting from the last frame of the experiment, work backwards to identify the starting position of the cell. If using the ERK-KTR, measure independent intensities for the cell’s nucleus and cytoplasm for each time point of interest in the experiment by drawing regions of interest (Figure 7[href=https://www.wicell.org#fig7]D).",
    "Note: Use the nuclear marker signal to identify the nucleus and cytoplasm for each cell. Make measurements in the plane where the nucleus has the greatest diameter and do not exclude nucleolar areas in the ROI. Individual blastomeres have small cytoplasmic compartments. Measuring a narrow region that immediately borders the nucleus is recommended to avoid unintentionally measuring signal from neighboring cells.\nContinue analyzing the remaining cells in the time-lapse stack. Save the measurements in your preferred spreadsheet software.\nAfter completing measurements from the time-lapse data, measure nuclear intensities of the lineage markers stained for in the immunofluorescence protocol by drawing nuclear ROIs. Measure cells according to the same numbering convention as in step 50 (Fig 7[href=https://www.wicell.org#fig7]E).\nSave the immunofluorescence data analysis and proceed with analyzing remaining embryos from the experiment."
  ],
  "subjectAreas": [
    "Cell Differentiation",
    "Single Cell",
    "Microscopy",
    "Signal Transduction"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}