{
  "id": 7449,
  "origin_website": "Bio",
  "title": "A Combinatorial <em>in-silico</em>, <em>in-vitro</em> and <em>in-vivo</em> Approach to Quantitatively Study Peptide Induced MHC Stability",
  "procedures": [
    "Prediction of immunogenic epitopes of PPRV using bioinformatic tools (Figure 1)Obtain amino acid sequence of different PPRV proteins from various databases, such as National Centre for Biotechnology Information (NCBI), Protein Data bank (PDB), UniProt, Structural Classification of Proteins (SCOP), and CATH: Protein Structure Classification database. It can be done by searching the protein by its name in the respective databases and downloading the desired sequence in Fasta Format. For example, the sequence of H protein of PPRV is obtained by selecting protein database of NCBI and the input query is ‘PPRV H protein’. Then select the hit with 609 amino acids, a putative complete amino acid sequence for the H protein, and copy the sequence in Fasta format.Use open access Immune Epitope Database (IEDB) or IDEB online database to insert the sequences of the viral proteins as the query (Vita et al., 2015          and 2019).Customize the peptide lengths for mouse class I MHC molecule (H-2Kb), and predict immunogenic epitopes.Bin the predicted epitopes according to the binding affinity to H-2Kb, and select the epitopes with percentile ranks of <2 and IC50 values lower than 50 nM, which are considered high affinity binders.Validate the high affinity binders using IEDB-AR (a companion site to IEDB that provides multiple options for analyzing the predicted T cell epitopes), and further scrutinize them on the basis of general characteristics of naturally occurring immunogenic peptides such as the 9mer, FAPGNYPAL of SEV complexed with H-2Kb.Select the top ranking 9mers (as these are the most naturally occurring high affinity class I MHC restricted accessible epitopes) and scrutinize them for the presence of hydrophobic carboxy terminal residues.Rank the selected peptides based on the affinity scores, and obtain commercially synthesized peptides with free N and C termini, and high purity (95-98%). Use them further for experimental analysis.",
    "Molecular docking of the peptides with class I MHC molecules for determining binding affinities (Figure 3)Perform molecular docking of high affinity epitopes with H-2Kb (in PDB file), using their individual sequence as the input for homology modelling by a HPEPDOCK online server tool (e.g., file 1S7Q for modelling of PPRV epitopes with H-2Kb Protein) (Zhou et al., 2018).The server predicts and generates an ensemble of docked structures. Analyze the energy parameters for the docked structures of H-2Kb and peptide. Set a cut-off value to select peptides based on those of the known epitopes of similar length with the H2-Kb (e.g., SEV nucleoprotein derived peptide, FAPGNYPAL for 9mers and chicken ovalbumin peptide, SIINFEKL for 8mers). Select the docking structures with energy parameters lower than or equal to the standard epitopes.Further scrutinize the selected docking structures based on the following parameters:N terminus of SEV-9 peptide is deeply embedded into H2-Kb, while C-terminus is held by salt-bridge near the surface of H-2Kb.Residues 4 or 5 of SEV-9 peptide are bulging out of the groove and not interacting with H-2Kb via Van der Waal’s forces.Polar interactions of peptide termini with H-2Kb stabilize the SEV-9 peptide.Residues 5 or 6 serve as the most probable primary anchor residues, while amino acids at positions 8 or 9 might act as the secondary anchors in the SEV-9 Peptide.All the parameters are documented in a tabular form to select the most stable docking structures.Repeat Step B3 for all the docked structures.Select the most stable docked structures from each of the high affinity epitopes, and compare their docking scores, i.e., docking energy and other parameters described in Step B3c. Plot a line curve or bar diagram to rank the epitopes according to immunogenicity and stabilizing H-2Kb.Visualize the selected docked structures using UCSF chimera tool and binding analysis tool.",
    "Assess for class I MHC stabilization and finding contacts between class I MHC molecule and the predicted epitope.Identify anchors based on the parameters described in Step B3.Image docked structures using the pre-set option available in the chimera console. Use the same coloring scheme for all the structures and ribbon views for a better visualization.Generation of heterotrimeric tetramers of H-2Kb (Figures 4 and 5)To generate soluble H-2Kb/peptide complexes, overexpress H-2Kb heavy chain and β2m as recombinant proteins in E. coli, and refold the monomers in the presence of a high concentration of the conditional ligand FAPG(Anp)YPAL. The heavy chain sequence is mutated to remove the cytosolic and transmembrane regions, and is expressed with biotin acceptor peptide sequences at the C-terminus of the H-2Kb heavy chain, for site-specific labelling (Garboczi et al., 1992;      Sehrawat et al., 2012;      Pichugin et al., 2018). These short sequences can be easily biotinylated using BirA in a site-specific manner at lysine (K) residues. The four biotin binding sites of avidin/streptavidin then generate tetramers of H-2Kb/peptide complexes. To use these complexes for flow cytometry, different fluorochrome conjugated commercially available avidin/streptavidin can be used. In brief the following procedure is used.Expression and purification of recombinant proteins (H-2Kb and β2m) from inclusion bodies.Recombinant proteins of H-2Kb and β2m were purified from inclusion bodies collected from induced cultures of E. coli.Prepare 6 Liter (L) of LB medium in 2 L flasks each with 1 L of medium. Autoclave these flasks and after cooling down at room temperature (RT), add 10 ml of sterile 40% glucose solution and 10 g of ampicillin to each flask.Take 20 µl of bacterial stock and dilute it in 6 ml of LB medium; then, add 1 ml of the starter culture of bacterium to each flask.",
    "Keep it in a shaker incubator at 37°C for approximately 8-10 h until the OD600 reaches 0.8. Intermittent sampling followed by measuring OD600 is suggested for capture growing bacteria in log phase.Collect 1 ml of sample from each flask for the expression control.When OD600 reaches 0.8, add 1 ml of freshly prepared IPTG solution (100 mg/ml in PBS, 1 mM) to individual flasks.Incubate for 3 h at 37°C in a shaker incubator.Cool down the cultures for 15-20 min on ice.Harvest the bacterial cultures by pelleting 1 L cultures at 4°C by centrifuging at 11,000 × g for 10 min.Resuspend the pellet in 13 ml of resuspension buffer, and transfer to a 50 ml centrifuge tube.Homogenize the bacterial suspension in the resuspension buffer using a sonicator on ice (20% amplitude 15 s OFF/15 s ON pulse, total 30 cycles).Add 100 µl of lysozyme (stock 50 mg/ml), 250 µl of DNase I (stock 2 mg/ml) and 50 µl of MgCl2 (stock 0.5 M).Vortex thoroughly and add 12.5 ml of lysis buffer, followed by a brief vortexing.Incubate at RT until viscosity decreases and then add 350 µl of Na·EDTA from 0.5 M stock.Freeze and thaw the mixture by putting the tube in liquid nitrogen and then transferring it in a water bath at 37°C for 30 min. Add 200 µl MgCl2 and wait until viscosity decreases. Then add 350 µl Na EDTA and keep it on ice from now onwards.Pellet the solution at 11,000 × g for 20 min at 4°C and discard the supernatant.Resuspend the pellet in 10 ml of washing buffer with Triton X100 and homogenize again in a sonicator.Pellet the solution at 11,000 × g for 20 min at 4°C and discard the supernatant.Resuspend the pellet in 10 ml washing buffer without Triton X100 and homogenize using a sonicator.",
    "Pellet down the mixture at 11,000 × g for 20 min at 4°C and discard the supernatant.Collect the pellet and dissolve it in 5 ml of 8 M Urea; determine the protein concentration.Make aliquots of 1 ml in separate vials and store at -80°C until future use.Refolding of H-2Kb monomer with photo-cleavable peptide.Prepare H2-Kb in 3 vials of 6.2 mg each (final concentration 3 µM) and β2m of 4.4 mg (final conc. 6 µM). All the preparation are diluted by guanidine solution up to 500 µl.Cool down 200 ml of refolding buffer in a 500 ml glass flask on ice and add 2 ml of PMSF (stock 100 mM).Dissolve 12 mg of photo-cleavable H-2Kb restricted peptide (stock 10 mg/ml in DMSO) in the refolding buffer.Inject 1 vial of β2m dropwise to the refolding solution while this is being continuously vigorously stirred with the help of a magnetic bar on the rotating stirrer for rapid and efficient dilution.Inject 1 vial of purified H-2Kb heavy chain drop by drop directly to the refolding solution.Place the flask at 4°C for 8 h with slow stirring of the solution in a cold chamber.Repeat Steps C2d to C2g three times.After the third injection of β2m and H-2Kb, leave the flask with slow stirring for another 24 h.After complete refolding of the solution, concentrate the protein up to 1 ml using a concentrator.Load the concentrated protein in AKTA on a S200 column for gel filtration.Collect different fractions of the refolded peak as revealed by 12% reducing SDS-PAGE. The fractions showing two distinct bands of ~35 kDa and 13 kDa are pooled and concentrated up to 1 ml (Figure 5).In vitro biotinylation of H-2Kb/peptide complexes.The in vitro biotinylation was done strictly as mentioned in the biotinylation kit (Avidity).",
    "Add 100 µl of solution A and 100 µl of solution B to 700 µl of purified H-2Kb complexes.Add 100 µl of d-biotin and 10 µl of BirA enzyme to the solution and incubate the mix overnight at RT.Purify the biotinylated H-2Kb/peptide complex by running the sample on a S200 gel filtration column using AKTA.Collect all the biotinylated fractions and concentrate the pooled volume to 1 ml or less.Check the concentration of the biotinylated H-2Kb/peptide complex and aliquot in smaller volumes for storage.For long term storage, add glycerol to a final concentration of 16%, make aliquots of 50 µl in 1.5 ml microcentrifuge tubes, and store them at -80°C for experimental uses and tetramerization.Peptide-MHC binding assay using acellular assays (Figure 6)Take an ELISA plate, coat it with 50 µl of streptavidin at a concentration of 2 µg/ml in PBS, and incubate at 4°C overnight.Next day, wash the plates with 200 µl PBST to remove unbound streptavidin.Block these wells with 200 µl of 3% BSA in PBS and incubate for 2 h at RT.Remove the blocking buffer and wash with 200 µl PBST (three times).Add 50 µl of biotinylated H-2Kb monomer (1 µg/ml) containing photo-cleavable peptide to the streptavidin coated wells and incubate for 1 h at RT.Remove the unbound monomer and wash with 200 µl PBST (three times).Add identified peptides to different wells, along with a positive control peptide (in this case we have used SIINFEKL). Label the wells appropriately.Expose this plate in a chamber with high wavelength UV365 radiations for 30 min to achieve the displacement of UV-cleavable ligand with the respective peptides.Wash these wells again with 200 µl PBST (three times).Add 50 µl of mouse anti-β2 microglobulin antibody to all the wells for 1 h at RT.Wash these wells again with 200 µl PBST (three times).",
    "Add 50 µl of anti-mouse IgG antibody conjugated with alkaline phosphatase enzyme and incubate for 30 min at RT.Wash these wells again with 200 µl PBST (three times).Add 200 µl of p-nitrophenol phosphate (1 mg/ml) to the wells and wait for colour development due to the formation of a chromogenic product.As soon as the color develops and is visible with eye, stop the reaction with 50 µl of NaOH 1M, and measure absorbance at 405 nm in a plate reader.Take the readings and determine the best peptide that binds to H-2Kb.Cell surface stabilization of MHC I using RMA/S Cell Lines (Figure 7)RMA/S cells are defective in antigen processing due to a mutation in TAP molecules that enables peptide transport to the ER for its loading onto the newly synthesized class I MHC molecules. RMA/S cells display lower levels of empty class I MHC molecules that can be efficiently loaded with exogenous peptides (Schumacher et al., 1990; Esquivel et al., 1992). Peptides entering via pinocytosis or phagocytosis can also be efficiently loaded on empty class I MHC molecules by the vacuolar pathway. Therefore, the differential display of class I MHC molecules by RMA/s cells in the absence or presence of exogenous peptides can be utilized to measure the peptide induced stabilization of such molecules. To study MHC stabilization on RMA/S cells, the following procedure is used.Revive RMA/s cells and culture them in RPMI media supplemented with 10% FBS in a humidified incubator with 5% CO2 at 37°C. Use RMA/S cells after three passages of sub-culturing to study the stabilization of class I MHC molecule.Take 2 × 105 cells in 200 µl serum free RPMI media and starve these cells for 3 h at 37°C in a humidified incubator with 5% CO2.",
    "Make different dilutions of peptides in serum free RPMI (Such as 6.25, 12.5, 25, 50 and 100 µg/ml).After 3 h, wash these cells with 200 µl pre-warmed serum free RPMI, and add 200 µl of the prepared dilutions of peptides to the respective wells.Incubate these cells for another 7-8 h in a humidified incubator at 37°C supplemented with 5% CO2.Centrifuge the cells at 300 × g at RT and discard the supernatant.Add 200 µl of FACS buffer and resuspend these cells.Centrifuge the cells at 300 × g at RT and discard the supernatant.Add 50 µl of FACS buffer and resuspend these cells.Dilute H-2Kb antibody 1:200, add 50 µl to each well, and incubate for 20 min in the dark at RT. Keep three wells for staining control (H-2Kb only, PI only, and unstained).Add 200 µl of FACS buffer and centrifuge at 300 × g for 5 min at RT. Repeat this step three times and resuspend the cells in 100 µl FACS buffer.Prepare PI at a concentration of 2 µg/ml in FACS buffer and add 100 µl to all wells, except for the staining controls where PI is not required.Instantly acquire the cells in a flow cytometer, and analyze the results using FlowJo software.UV displacement of conditional ligand to generate fluorescent H-2Kb tetramersTake 50 µl of concentrated biotinylated H-2Kb monomer (>250 µg/ml) refolded with the photo-cleavable peptide in a 96-well plate on ice, and dilute with gel filtration buffer to 100 µl.Add 5 µl of specific peptides to each wells containing monomers with UV-cleavable ligand.Expose these plates to UV radiation (365 nm) in a UV-chamber for 30 min on ice. The distance of the plate to the UV lamp should be 2-5 cm.",
    "Centrifuge the plate at 3,000 × g for 5 min at 4°C, and collect 80 µl of the exchanged samples from the plate in microcentrifuge tubes.Add 1 µl of streptavidin-APC conjugate in 19 µl of peptide exchanged monomer for tetramerization of the monomers; incubate for 2 h on ice.Collect tetramers and use them to identify peptide specific CD8+ T cells, by co-staining with anti-CD8 antibody.Detection of peptide specific CD8+ T cells in PPRV (Sunguri) infected mice (Figure 8)Divide C57BL/6 WT mice in two groups with at least three animals per cage.Infect mice of one cage intraperitoneally with a high dose of PPRV (5 × 106 pfu). The animals in the other cage will serve as control.After 7 days, infect the same mice with a similar dose of PPRV virus to further expand the frequencies of PPRV specific cells.Collect blood from each mouse from both groups and stain them to identify peptide specific CD8+ T cells in the blood.Prepare a cocktail of PerCP Cy5.5 conjugated anti-mouse CD8 antibody (1:200 dilution) and peptide specific H-2Kb streptavidin-APC tetramer (1:100 dilution).Transfer 5 µl of the cocktail to a fresh labelled microcentrifuge tube. Keep some tubes for staining control (e.g., CD8 control, H-2Kb-tetramer control, and unstained samples).Add 25 µl blood from each mouse to the respective tubes and mix by gentle vortexing.Incubate the tubes in the dark on ice for 30 min.Add 220 µl of RBC lysis buffer to all the tubes, vortex gently, and wait for the RBCs to lyse.After 5 min, add PBS and mix gently.Instantly acquire the stained cells using a flow cytometer, and analyze for peptide specific CD8+ T cells.Detection of peptide specific CD8+ T cells in the PPRV-peptide immunized micePlace 600 µl of complete Freund’s adjuvant in a 1.",
    "5 ml microcentrifuge tube and add 6 µl of peptide (stock conc. 10 mg/ml).Extensively vortex the tubes and collect the peptide emulsion in a 1 ml tuberculin syringe. Check the quality of emulsion by pouring a small drop of the emulsion in cold water. If the emulsion is good, as indicated by an intact drop, proceed with the injection to the mouse. If it is not good, keep the emulsion for another round of vigorous vortexing.Inject 50 µl of the emulsion in each C57BL/6 WT mice subcutaneously, and wait for at least 15 days. Keep another three mice without any injection as control.Prepare a fresh peptide emulsion in incomplete Freund’s adjuvant with the same volumes as in step 1, and subcutaneously inject in the previously immunised mice.Collect blood samples from these mice at least 3 days after the second injection. The blood collected is used to detect peptide specific CD8+ T cells.Prepare a cocktail of PerCP Cy5.5 conjugated anti-mouse CD8 antibody (1:200 dilution) and peptide specific H-2Kb streptavidin-APC tetramer (1:100 dilution).Place 5 µl of the antibody cocktail in a fresh labelled microcentrifuge tube and keep some tubes for staining control (e.g., Anti-CD8 control, H-2Kb-tetramer control and unstained samples).Add 25 µl blood from each mouse to the respective tubes, and mix by gentle vortexing.Incubate the tubes in the dark on ice for 30 min.Add 220 µl of RBC lysis buffer to all the tubes, vortex gently, and wait for the RBCs to lyse.After 5 min, add PBS and mix gently.Instantly acquire the stained cells using a flow cytometer, and analyze for peptide specific CD8+ T cells."
  ],
  "subjectAreas": [
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}