{
  "id": 13301,
  "origin_website": "Jove",
  "title": "Efficient Differentiation of Human Pluripotent Stem Cells into Liver Cells",
  "procedures": [
    "1. Preparation of Differentiation Media\nNOTE: Refer to the Table of Materials for manufacturer information regarding the materials and reagents used.\nPreparation of base chemically defined media (CDM)\n\tNOTE: CDM2, CDM3, CDM4 and CDM5 are chemically defined media that are used as base medias for differentiating hPSCs to liver cells at various stages. The composition of these medias can be found in Table 1.\n\t\nTo make CDM2 or CDM3, prepare a stock solution containing polyvinyl alcohol (PVA). Dissolve 0.5 g of PVA powder in 50 mL of Iscove’s Modified Dulbecco’s Medium (IMDM) to generate a 10 mg/mL PVA stock.\nNOTE: Since PVA does not dissolve easily, prepare the PVA/IMDM mixture in a conical flask with continuous stirring at ~50 °C on a heating pad; stirring can be easily achieved using a magnetic stirrer.\nAfter PVA is homogeneously dissolved in IMDM, remove the PVA solution from the heating pad and allow it to cool down to room temperature.\nUse a sterile, 0.2 µm filter to filter the PVA solution.\nPrepare the CDM2 and CDM3 by combining the filtered PVA from step 1.1.1 and various commercially bought components as outlined in Table 1 and the Table of Materials. Use sterile, 0.2 µm filter units to filter all media.\nNOTE: Base medium can be stored at 4 °C but for no longer than 2 months.\nPrepare the remaining base media CDM4 and CDM5 following Table 1.\nPreparation of differentiation media\nTo prepare stock solutions for the small molecules and growth factors, reconstitute them as per the manufacturers’ recommendations. For storage, aliquot into sterile tubes to reduce freeze-thaw cycles and keep at -20 °C or as recommended.\nNOTE: Composition of differentiation medium to be used at various differentiation stages is described in Table 2 and in the following steps.",
    "To prepare the differentiation medium, first thaw the frozen small molecules and/or growth factors at room temperature. Next, aliquot out the required amount of base medium. Last, prepare the final differentiation media by adding the specified small molecules and growth factors to the base medium at the appropriate concentrations (Table 2).\nNOTE: Freshly-prepared differentiation medium should ideally be used on the same day; otherwise it can be stored at 4 °C and used within three days.\nUsing a pipette tip, mix the differentiation medium several times to ensure supplements are homogeneously distributed before adding the medium to cells (e.g., add 1 mL of differentiation medium to each well of a 12-well plate.)\n2. Seed hPSCs onto Plates at Defined Densities for Differentiation\nCoat cell culture plastics that will be used for seeding with hPSCs.\nThaw the matrix (e.g., Geltrex) at 4 °C overnight before the day of use.\nThe next day, dilute the matrix 1:100 by adding 500 μL of the matrix into 50 mL of cold Dulbecco’s Modified Eagle’s Medium (DMEM)/F12. Since the matrix is a hydrogel that irreversibly polymerizes upon exposure to room temperature, when working with the matrix, always keep the matrix tubes and media on ice.\nNOTE: The matrix dissolved 1:100 in DMEM/F12 can be stored at 4 °C but should be used within 2 months.\nTo coat a culture plate with the matrix, pipette the diluted matrix into the required number of wells using just enough volume of matrix solution to cover the surface of the well (e.g., add 0.5 mL of matrix to one well of a 12-well plate or 1 mL to one well of a 6-well plate). If needed, shake the plate gently to make sure that the matrix solution has fully covered the bottom of the well.",
    "Leave the matrix-coated plate in a 37 °C incubator for at least 60 min. At this temperature, the matrix polymerizes to form a thin film at the bottom of the well.\nNOTE: Matrix-coated plates can be kept in the 37 °C incubator and used within 3 days as long as the matrix has not dried up.\nAspirate the remaining matrix solution from the coated wells immediately prior to seeding the wells with hPSCs.\nPassaging and seeding the coated plates with hPSCsNOTE: The dissociation agent contains enzymes that dissociate cells and it is important to leave hPSCs in the dissociation agent for as short of a timespan as possible.\nTo seed matrix-coated culture plates with hPSCs prior to differentiation, grow undifferentiated hPSCs to >70% confluency in commercially-available mTeSR1 medium (Table of Materials) according to the manufacturer’s protocol. It is critical to passage hPSCs before they become fully confluent, as hPSCs may spontaneously differentiate at high confluence.\nNOTE: hPSCs must be karyotyped to ensure that there are no chromosomal abnormalities before using them for experiments. The hPSCs used for this differentiation protocol were maintained in mTeSR1 media and passaged as clumps with EDTA to minimize karyotypic abnormalities. Karyotypically-abnormal hPSCs should not be used for differentiation, as they may proliferate abnormally quickly; thus the cell-seeding densities recommended here are not appropriate for karyotypically-abnormal cells.\nTo seed hPSCs for differentiation, aspirate mTeSR1 from largely-confluent hPSC cultures plate and add commercially bought dissociation agent (Table of Materials) to dissociate the hPSCs, using just enough dissociation agent to cover the surface of the well or dish on which the cells are growing (e.g., add 0.5 mL of the dissociation agent per well of a 12-well plate, 1 mL per well of a 6-well plate or 3 mL per 10 cm dish).",
    "Incubate hPSCs in the dissociation agent at 37 °C for 5 min or until some colonies begin detaching. Gently tap the bottom of the well/plate several times; after several minutes of dissociation, most hPSC colonies should freely come into suspension.\nTo dislodge dissociated hPSCs from the plate, add 2 mL/well of DMEM/F12 if working with a 6-well plate (or 1 mL/well if working with a 12-well plate) to dilute the dissociation agent. Use a 5 mL serological pipette to gently pipette up and down multiple times to wash off all cells from the surface of the well; collect resuspended single cells in a 50 mL conical tube. Wash the plate a second time with the same volume of DMEM/F12 to ensure recovery of all hPSCs.\nTo the 50 mL conical tube containing the cells, add DMEM/F12 to dilute the original volume of the dissociation agent by 1:5-1:10 (e.g., if the original volume of the dissociation agent was 1 mL, adjust the total volume of cell suspension to 10 mL with DMEM/F12 to dilute the dissociation agent at 1:10)\nCentrifuge the collected hPSCs in a 50 mL conical tube at 350 x g for 3 min at 4 °C to pellet cells.\nWhile waiting for the cells to pellet, aspirate matrix from the plate in which the hPSCS will be seeded. Next, add sufficient amounts of mTesR1 supplemented with 1 μM of commercially-obtained thiazovivin (a pharmacological ROCK inhibitor)  to recipient wells to cover them (e.g., add 0.5 mL mTeSR1 per well of a 12-well plate or 1 mL of mTeSR1 per well of a 6-well plate).\nNOTE: Thiazovivin at a low concentration is included at this step to enhance single cell survival and hence the subsequent seeding density of hPSCs.",
    "After centrifuging hPSCs, carefully aspirate the supernatant, leaving the pelleted hPSCs at the bottom of the conical tube. The supernatant contains dissociation agent which will inhibit subsequent adhesion of hPSCs and thus, it is important to aspirate the large majority of the supernatant before proceeding.\nResuspend the cell pellet in mTeSR1 supplemented with 1 μM of thiazovivin. With a p1000 pipette, gently triturate 2-3 times to evenly resuspend the cell pellet into a single cell suspension. Do not over-triturate the cell pellet as excessive mechanical force will damage hPSCs and lead to poor cell survival.\nAfter resuspension of the hPSCs, immediately pipette 10 μL of the suspension into a hemocytometer and count the number of cells. It is important to pipette cells for counting as quickly as possible, as gravity will lead to hPSCs naturally settling into the bottom of the 50 mL tube, which will confound accurate cell counting.\nAdjust the volume of the resuspended hPSCs with thiazovivin-supplemented mTeSR1 to achieve the desired cell concentration for plating. For example, after adjusting the volume of resuspended hPSCs, add 0.5 mL of the cell suspension per well to seed 160,000-250,000 cells into each well of a 12-well plate, thus achieving a total volume of 1 mL in each well (0.5 mL of media was added to the well in step 2.2.7). If larger or smaller wells are being used, scale cell numbers/media volumes up or down accordingly.\nNOTE: It is important to seed hPSCs at the indicated cell density. Overly-confluent hPSCs will not differentiate efficiently and under-confluent hPSCs will not survive well during differentiation.",
    "Shake the plate in a cross pattern (left, then right; forward, then backward) several times to make sure cells are evenly distributed across the plate/well. Do not swirl the plate in a circular motion, as the cells will settle in the center of the plate/well. Typically, hPSCs will begin adhering to the surface of the well within ~3-30 min. Allow cells to grow for at least 24 h before initiating differentiation.\n3. Differentiation of hPSCs into Endodermal Cells and Liver Progenitors\nAfter hPSCs have been plated for at least 24 hours (as described in step 2.2.12), before proceeding with differentiation, check the morphology of cells under a phase-contrast microscope, with specific emphasis on the diameter and density of plated hPSC colonies.\nNOTE: Ideally, clumps should be readily spaced and of appropriate size and density throughout the well before step 3.2. Large (approximately >400 μm) or small colonies (approximately <200 μm) of hPSCs are not usable for differentiation (Figure 4). Differentiation signals will not act evenly throughout large hPSC colonies, leading to inefficient differentiation. Colonies that are too small do not survive well during the first 3 days of hPSC differentiation in this differentiation protocol. If the density of seeded hPSCs is correct, the hPSC colonies will often form “bridges” of cells between them and the overall confluence will be ~30-50% before adding day 1 differentiation medium (Figure 4).\nIf colony sizes are ideal in step 3.1, proceed to day 1 of differentiation, which entails differentiation of hPSCs into anterior primitive streak (APS).\nPrepare day 1 APS differentiation medium by mixing all reagents outlined in Table 2 using CDM 2 (Table 1 and section 1.2) as the base medium. Pipet to mix several times to ensure even distribution of the components in the media.",
    "Aspirate to remove the thiazovivin supplemented mTeSR1 from the plated hPSCs and briefly wash hPSCs with IMDM media. Do not wash with phosphate buffered saline (PBS) instead of IMDM, as PBS lacks calcium ions (Ca2+) and is thus toxic to hPSCs; it will disrupt cell morphology.\nAfter the brief IMDM wash, add day 1 medium to the hPSCs. Record the time and place cells back into the 37 °C incubator\nContinue with the subsequent differentiation steps by preparing (Table 2) and adding the respective differentiation medium to the cells on the respective days (at 24 h intervals) of differentiation around the same time of the day (Figure 1). Replace with fresh media daily, even if consecutive days of differentiation use the same differentiation media. Between media changes, wash cells once with IMDM media to remove dead cells and remnant of previous medium components.\nAs differentiation progresses beyond the liver bud stage, cell numbers increase and hence, add more media to each well of the plate to ensure that the amount of differentiation factors and nutrients is not limiting. For example, add 1 mL differentiation medium to each well of 12-well initially on days 1 to 6 of differentiation but add 1.5-2 mL of subsequent differentiation media on later days of differentiation (days 7 to 18 of differentiation).\n4. Characterization of Endodermal Cells and Liver Progenitors by Immunostaining\nPrepare blocking buffer: 10% donkey serum + 0.1% Triton X100 in deionized phosphate buffered saline (DPBS).\nPrepare staining buffer: 1% donkey serum + 0.1% Triton X100 in DPBS.\nAspirate medium from cells in 12-well plate.\nAdd 4% paraformaldehyde (in DPBS) for 15 min at room temperature to fix cells and then wash the cells twice with DPBS.\nAdd blocking buffer for 1 h at room temperature to block and permeabilize the fixed cells.",
    "Aspirate the blocking solution and add primary antibody diluted in staining buffer. (See Table of Materials for dilution ratios of antibodies.)\nStain the cells overnight at 4 °C.\nWash cells thrice with 0.1% Triton X100 in DPBS.\nAdd secondary antibody stain in the staining buffer for 1 h at room temperature. (See Table of Materials for dilutions of secondary antibodies.)\nRemove the secondary antibody and add DAPI for 5 min at room temperature to conduct nuclear counterstain.\nWash twice with 0.1% Triton X100 in DPBS to remove excess antibody and DAPI.\nConduct fluorescence microscopy with a Zeiss Observer D1. Alternatively, store plate in 4 °C until imaging is performed. For expected results, see Figure 3.\n5. Characterization of Liver Progenitors by Fluorescence Activated Cell-sorting (FACS) Analysis\nNOTE: Use FACS to precisely quantify the percentage of AFP+ differentiated LB cells that emerge by day 6 of differentiation. Follow the same steps to quantify the percentage of ALB+ differentiated hepatocytes by day 18 of differentiation.\nConjugate an anti-AFP antibody.\nAdd R-phycoerythrin to anti-AFP antibody at a concentration of (0.55 µg/µL) using R-phycoerythrin conjugation kit (see Table of Materials).\nNOTE: Ensure that the antibodies are purified and are reconstituted in buffers that do not contain amines. Ensure that amount of antibody used in a labeling reaction must be less than the amount of PE (i.e., 60 µg of antibody with 100 µg of PE). Poor conjugation of antibodies may lead to unreliable outcomes.\nAdd 1 µL of modifier reagent for 10 µL of antibody to be labeled. Mix gently.\nRemove the R-PE mix (100 µL) and pipette the above mixture directly into the lyophilized R-PE material.\nPlace the cap back and leave the vial standing for 3 h in the dark at room temperature.",
    "After incubating for 3 h or more, add 1 µL of quencher reagent for 10 µL of antibody used. The conjugate can be used after 30 min.\nStore conjugated antibody at 4 °C.\nWash differentiated or undifferentiated hPSCs in 6-well format with DMEM/F12.\nBriefly treat with dissociation agent (1 mL/well in a 6-well plate) for 5 min at room temperature until cells detach. Harvest and stain both undifferentiated hPSC and differentiated liver progenitor cells identically and analyze in parallel in the same experiment to ensure specificity of antibody staining.\nGently tap Petri dish to detach cells. Use a p1000 pipette to detach cells off the plate and collect cells in a 50 mL conical tube. Ensure that cells have mostly detached before proceeding with the next step. Subsequently, wash wells twice more with 1xDPBS buffer to collect residual cells.\nIn the 50mL conical tube, dilute dissociation agent in ~5 volumes of 1x DPBS buffer. Triturate rigorously 3-4 times with a p1000 pipette to ensure all cells are dissociated into single cells.\nNOTE: It is imperative to generate single cells prior to centrifugation or clumps subsequently cannot be dissociated with ease. However, do not over-triturate as this may damage cell integrity. Count the number of cells and use the recommended proportion of cells to antibody ratio, which has been previously optimized for minimal background and maximal signal detection.\nCentrifuge conical tube containing the cell suspension at 300 x g for 5 min at 4 °C.\nAspirate the supernatant with care not to disturb the cell pellet.",
    "Resuspend cell pellet thoroughly in fixation/perm buffer to generate a single-cell suspension and fix on ice at 4 °C for 20 min. Note to transfer to a 2 mL microcentrifuge tube. Furthermore, usage of a 2 mL microcentrifuge tube at this step enables the cell pellet to deposit at the V-shaped-corner of the tube, minimizing cell loss during washes.\nWash each pellet with 1.8 mL of perm/wash buffer twice. Resuspend cell pellet thoroughly in perm/wash buffer by pipette mixing 6 times with a p1000 pipette. Then, centrifuge, remove supernatant and repeat the wash process with 1.8 mL of perm/wash buffer.\nResuspend cell pellet in perm/wash buffer so that there will be 100 µL/individual stain and subsequently transfer the cell suspension into a 2 mL microcentrifuge tube.\nNOTE: It is imperative to generate a single-cell suspension at this step prior to antibody staining. Aggregates of cells will not be stained and thus will confound FACS analysis. Furthermore, usage of a 2 mL microcentrifuge tube at this step enables the cell pellet to deposit at the V-shaped-corner of the tube, minimizing cell loss during washes.\nAfter resuspending cells in FACS buffer, aliquot them into individual 2 mL tubes (for both unstained control and antibody-stained samples).\nStain with anti-AFP-PE 0.33 µL per 150,000 cells for 30 min at room temperature in the dark. For example, for a 100 µL individual stain, stain as follows: 0.33 µL of a-AFP PE and 100 µL of perm/wash buffer. Resuspend cells with p200 pipette well to ensure even staining.\nNOTE: Only pipette-mix and do not vortex as this may reduce protein stability.",
    "Wash, resuspend the cells twice in 1-2 mL of perm/wash buffer (1.9 mL/individual stain) and centrifuge at 800 x g for 5 min at 4 °C. Wash cells with no less than 1-2 mL of perm/wash buffer to ensure sufficient washing.\nNOTE: Only pipette mix and do not vortex as this may reduce protein stability. After centrifuging, aspirate supernatant carefully to prevent cells from dislodging and remove as much supernatant as possible to minimize antibody carry-over and ensure a more complete wash.\nResuspend each washed pellet in 300 μL of perm/wash buffer and strain it through a 100 μm filter into a FACS tube to strain out large clumps of cells prior to FACS analysis.\nAnalyze cells on a FACS Aria flow cytometry on the PE channel. Analyze a minimum of 10,000 events for each individual stain, and parse events by virtue of FSC-A/SSC-A analysis, select cell singlets by gating on FSC-W/FSC-H followed by SSC-H/SSC-W.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}