{
  "id": 19608,
  "origin_website": "Jove",
  "title": "Live Imaging of the Mitochondrial Glutathione Redox State in Primary Neurons using a Ratiometric Indicator",
  "procedures": [
    "All animal experiments conformed to national and institutional guidelines, including the Council Directive 2010/63/EU of the European Parliament, and had full Home Office ethical approval (University of Heidelberg Animal Welfare Office and Regierungspraesidium Karlsruhe, licenses T14/21 and T13/21). Primary hippocampal and cortical neurons were prepared from newborn mouse or rat pups according to standard procedures and were maintained for 12-14 days as previously described13.\n1. Preparation of solutions\nStock solutions for imaging buffer\n\t\nPrepare each stock solution according to Table 1 and keep them at 4 °C. For long-term storage (>3 months), keep aliquots at -20 °C.\ntable:\n﻿0,1,2,3,4\nComponent,MW,Concentration (M),Amount (g),Volume (mL)\nNaCl,58.44,5,14.61,50\nKCl,74.55,3,1.12,5\nMgCl2·6H2O,203.3,1.9,2,5\nCaCl2·2H2O,147.01,1,1.47,10\nGlycine,75.07,0.1,0.375,50\nSucrose,342.3,1.5,25.67,50\nSodium pyruvate,110.04,0.1,0.55,50\nHEPES,238.3,1,11.9,50\nGlucose,180.15,2.5,45,100\nTable 1: Stock solutions for imaging buffer. \nStock solutions of drugs and dyes\n\t\nDissolve diamide (DA; used for calibration of maximal 405:488 ratio) in water to obtain a 0.5 M stock solution (e.g., 1 g in 11.615 mL of water). Aliquot and store at -20 °C.\nDissolve dithiothreitol (DTT; used for calibration of minimal 405:488 ratio) in water to obtain a 1 M stock solution (e.g., 5 g in 32.425 mL of water). Aliquot and store at -20 °C for a maximum of 3 months.\nDissolve N-methyl-D-aspartate (NMDA; used to induce excitotoxicity and mitochondrial oxidation) in water to obtain a 10 mM stock solution (e.g., 25 mg in 16.991 mL of water). Store the aliquots at -20 °C. For long-term storage (>6 months), keep the aliquots at -80 °C.\nTetramethylrhodamine ethyl ester perchlorate (TMRE; a small-molecule indicator of the mitochondrial membrane potential)\n\t\t\nDissolve TMRE powder in methanol to obtain a 20 mM stock (e.g., 25 mg in 2.427 mL of methanol).\nDilute the 20 mM stock 1:1,000 in methanol to obtain a 20 µM stock.",
    "Aliquot the 20 mM and 20 µM stock solutions, seal with parafilm, and store protected from light at -20 °C.\n\t\t\tNOTE: Both stock solutions are stable for several years. Use the 1,000x stock solution (20 µM) for experiments.\nImaging buffer\n\t\nPrepare 100 mL of imaging buffer by adding all components from Table 2 to 80 mL of sterile water in a measuring cylinder. Bring the volume up to 100 mL with sterile water. Mix by carefully shaking the measuring cylinder until the solution appears homogeneous.\n\t\tNOTE: It is recommended to use an osmometer to check the osmolarity of the buffer. It should be as close as possible to the growth medium of the cells. Here, this is 315 mOsmol/L. Increase or decrease the sucrose concentration as needed to match the osmolarity of the imaging buffer and growth medium.\nAdjust the pH to 7.4. Make aliquots and keep them at 4 °C for up to two weeks. For long-term storage, keep the aliquots at -20 °C. Let the imaging buffer reach room temperature before use.\ntable:\n﻿0,1,2,3\nComponent,Stock solution (M),Final concentration (mM),Volume (mL)\nNaCl,5,114,2.3\nKCl,3,5.29,0.176\nMgCl2,1.9,1,0.053\nCaCl2,1,2,0.2\nGlycine,0.1,0.005,0.005\nSucrose,1.5,52,3.5\nSodium pyruvate,0.1,0.5,0.5\nHEPES,1,10,1\nGlucose,2.5,5,0.2\nTable 2: Composition of imaging buffer. The indicated volumes are used for the preparation of 100 mL of imaging buffer.\nSolutions for stimulation and calibration\n\tNOTE: Always prepare fresh stimulation solutions by adding stock solutions of indicated drugs to the imaging buffer just before the experiment. Solutions for stimulation and calibration will be added to the imaging chamber sequentially during an experiment (see sections 3-5). Depending on the type of experiment, different solutions are required to reach the same end concentration in the respective final volume in the imaging chamber.",
    "Prepare 3x NMDA solution (90 µM; final concentration in the chamber: 30 µM) by adding 63 µL of a 10 mM NMDA stock to 6.937 mL of imaging buffer. Add 500 µL of the resulting solution to the chamber (final volume: 1.5 mL).\nPrepare 2x DA solution for steps 3 and 4 (1 mM; final concentration in the chamber: 0.5 mM) by adding 14 µL of a 0.5 M DA stock to 6.986 mL of imaging buffer. Add 1 mL to the chamber (final volume: 2 mL).\nPrepare 4x DA solution for step 5 (2 mM; final concentration in the chamber: 0.5 mM) by adding 28 µL of a 0.5 M DA stock to 6.972 mL of imaging buffer. Add 500 µL to the chamber (final volume: 2 mL).\nPrepare 1x DTT solution (5 mM; final concentration in the chamber: 5 mM) by adding 45 µL of 1 M DTT stock to 8955 µL of imaging buffer. Add 1 mL of this solution to the chamber after aspirating the imaging buffer (final volume: 1 mL).\n2. Loading of cells with TMRE\nNOTE: In this protocol, TMRE is used in non-quench mode15 at a final concentration of 20 nM. In general, the lowest possible concentration of TMRE that still provides sufficient signal intensity on the microscope of choice should be used. Due to uneven evaporation, the volume of medium in different wells can differ in long-term primary cultures. To ensure a consistent TMRE concentration in all wells, do not add TMRE directly to the wells. Instead, replace the medium in each well with the same amount of TMRE-containing medium. The protocol below is designed for primary neurons in 24-well plates containing ~1 mL of medium per well.",
    "Working in a tissue culture laminar flow hood, collect 500 µL of medium from each well into a single conical tube.\nPer well, add 0.5 µL of 20 µM TMRE stock into the conical tube (e.g., 12 µL for 24 wells).\nCarefully aspirate the remaining medium from the first well and replace it with 500 µL of TMRE-containing medium. Continue, well-by-well, with the remaining wells.\n\tNOTE: Take care not to let the cells dry out and not to disturb the cells.\nReturn the cells to the incubator and wait for at least 60 min for dye equilibration.\n\tNOTE: Loading time can be extended to several hours without adverse effects.\nTo ensure consistent TMRE concentrations and equilibration throughout the imaging experiment, make sure to include a final concentration of 20 nM TMRE in the imaging buffer and all stimulation solutions.\n3. Optimization of scanning confocal microscope settings\nNOTE: This step aims to find the best compromise between image quality and cell viability during live imaging. This section describes the optimization of settings for roGFP imaging. If multiparametric imaging is performed, similar optimization, including checking for a stable baseline without signs of bleaching or phototoxicity, needs to be performed for the additional indicators. \nStart the confocal microscope and load standard settings for GFP imaging (488 nm excitation, 505 - 550 nm emission).\nSet the detector to 12 bits or 16 bits.\n\tNOTE: Usually, 8 bits are not sufficient for quantitative imaging.\nActivate the sequential scan mode and add second sequence/track (405 nm excitation, 505 - 550 nm emission).\nFor both channels, select a pseudocolor lookup table that indicates over- and under-exposed pixels (e.g., GLOW OU).\nSelect an objective that is suitable for the object of interest.\n\tNOTE: 10x-40x are suitable for single-cell analysis, 63x-100x are suitable for single-mitochondrion analysis.",
    "Mount a coverslip with cells into the imaging chamber, add 1 mL of imaging buffer, and place the chamber on the microscope.\nUse the eyepiece and transmitted light to focus the cells.\n\tNOTE: Do not use epifluorescence light to locate and focus cells. Even at low power, this will adversely affect the cells.\nRecord images with different pixel formats. Based on these images, select the lowest pixel number that gives an acceptable resolution of the structure of interest.\n\tNOTE: Typically, 512 x 512 pixels work well for single-cell imaging with 20x and 40x objectives, and 1024 x 1024 or 2048 x2048 pixels typically work well for single-mitochondrion imaging with a 63x objective.\nRecord images with different pinhole sizes. Based on these images, select the largest pinhole size that gives an acceptable resolution of the structure of interest.\n\tNOTE: Typically, 3-7 airy units work well.\nRecord images with different laser intensities.\n\t\nAdjust the detector gain and threshold accordingly. Based on these images, select the lowest laser intensity that gives acceptable signal intensity and signal-to-background ratio.\n\t\t\nTo determine the signal-to-background ratio, measure the signal intensity in a region of interest (ROI) that contains cells or mitochondria (ROI1) and in an ROI without cells or mitochondria (ROI2). Then, divide the intensity of ROI1 by the intensity of ROI2.\n\t\t\tNOTE: Aim for a signal-to-background ratio of >3 and signal intensities of individual ROIs of 200-1,000 for 405 nm excitation with 1-3% laser power and intensities of individual ROIs of 300-1,500 for 488 nm excitation with 1% laser power.\nRecord images with different scan speeds and number of frame averages. Record 4-5 images for each combination of settings. Based on these image series, select the highest speed and lowest average settings that give acceptable image noise and image-to-image variability.",
    "NOTE: A scan speed of 600 Hz and 1-2 frames for averaging work well in most cases.\nUsing a new coverslip, record a time-lapse series with the optimized settings.\n\tNOTE: The duration and image interval of the series should resemble those of the planned experiments.\nAt the end of the time-lapse series, add 1 mL of 2x DA solution to the recording chamber. Image for additional 2 min.\nAspirate the imaging buffer using a peristaltic pump or handheld pipette. Add 1 mL of 1x DTT solution. Image for additional 5 min.\nAnalyze the time-lapse experiment (see section 5).\n\t\nVerify that none of the two channels gets over- or under-exposed during DA- and DTT-treatment with the optimized settings.\nEnsure that none of the two channels shows considerable bleaching during the time-lapse recording; aim for <2% loss of intensity between the first and last images.\nVerify that the 405:488 ratio does not change considerably during imaging.\nRepeat the whole procedure in an iterative manner, using several coverslips, until settings that consistently provide acceptable results have been defined.\n4. Assessment of basal redox status\nStart the microscope and load the optimized settings from section 3.\nSet frame average to 3-5.\nMount a coverslip with cells into the imaging chamber, add 1 mL of imaging buffer, and place the chamber on the microscope.\nUse the eyepiece and transmitted light to focus the cells.\n\tNOTE: Do not use epifluorescence light to locate and focus cells. Even at low power, this will adversely affect the cells.\nSwitch to scanning mode and use the 488 nm channel in live view to focus and locate cells for imaging.\nUse the multipoint function to select 3-5 fields of view on the coverslip.\nRecord a baseline image.\nAdd 1 mL of 2x DA solution to the chamber.",
    "After 1, 2, and 3 min, use live view to confirm/adjust the focus and then record an image.\n\tNOTE: Cells are typically fully oxidized after 2 min.\nReplace the buffer in the imaging chamber with 1 mL of 1x DTT solution.\nAfter 3 and 5 min, use live view to confirm/adjust the focus and then record an image.\n\t​NOTE: Cells are typically fully reduced after 4-5 min.\n5. Live imaging of acute treatments\nNOTE: The protocol below describes imaging of the mitochondrial redox response to NMDA treatment. Image intervals and duration of the experiment might need to be adjusted for other treatments.\nStart the microscope and load the optimized settings from section 3.\nSet the time-lapse interval to 30 s and duration to 25 min.\nMount a coverslip with cells into the imaging chamber, add 1 mL of imaging buffer, and place the chamber on the microscope.\n\tNOTE: To avoid thermal focus drift, leave the cells on the microscope stage for 10-15 min before starting time-lapse imaging.\nUse the eyepiece and transmitted light to focus the cells.\n\tNOTE: Do not use epifluorescence light to locate and focus cells. Even at low power, this will adversely affect the cells.\nSwitch to the scanning mode and use the 488 nm channel in live view to focus and locate cells for imaging.\nOptional: To increase the number of recorded cells per run, use the multipoint function to image 2-3 fields of view per coverslip.\nStart the time-lapse acquisition and record 5 images as 2 min baseline recording.\nAdd 500 µL of 3x NMDA solution to the chamber (final concentration 30 µM) and record additional 20 images as a 10 min NMDA response.",
    "​NOTE: Neurons are very sensitive to changes in osmolarity. Therefore, make sure to minimize evaporation of the imaging buffer. For longer treatments, the imaging chamber should be covered with a lid.\nAdd 500 µL of 4x DA solution to the chamber and record 6 more images (3 min maximum calibration).\nAspirate the buffer from the imaging chamber and replace it with 1 mL of 1x DTT solution. Record 10 more images (5 min minimum calibration).\nEnd the recording and save the image series.\n6. Data analysis\nData import and image preprocessing in FIJI\n\t\nUse the Bio-Formats Importer to open a group of images from step 4 or an image file from step 5. Click on Plugins | Bio-Formats | Bio-Formats Importer. In the dialog box, use View stack with: Hyperstack, set Color mode: default, select Autoscale, and do not split into separate windows.\n\t\tNOTE: Autoscale optimizes the display of the data on the computer screen. It does not change pixel intensities.\nIf individual images from step 4 were opened, click on Image | Stacks | Tools | Concatenate to merge them into a single-image stack.\nIf there is XY-drift during the image series, click on Plugins | StackReg to register the images. In the dialog box, select Rigid Body or Translation.\nChange the image format to 32 bit by clicking on Image | Type | 32-bit.\nSplit the color channels into separate windows by clicking on Image | Color | Split Channels.\nSelect channel 1 (405 nm) and adjust the threshold to select the mitochondria for analysis by clicking on Image | Adjust | Threshold. In the dialog box, select Default, Red, Dark background, and Stack histogram and wait for the selected pixels to appear red. Click Apply. Select Set Background Pixels to NaN and Process all images.",
    "NOTE: To avoid potential observer bias, automated threshold determination should be used. FIJI offers several automated methods (such as Default, Huang, Intermodes, Otsu) that can be selected from a dropdown menu in the threshold dialog box. Typically, the Default method gives a good result. It is recommended to compare several methods during the first analysis to find the best thresholding method for the given set of images. Once a method has been chosen, it needs to be applied to all images.\nRepeat step 6.1.6 for channel 2 (488 nm).\nCreate a ratio image to visualize the 405:488 nm ratio by clicking on Process | Image calculator. In the dialog box, select Image 1: channel 1, Operation: Divide, Image 2: channel 2, Create new window, Process all images.\nChange the lookup table of the ratio image to pseudocolor. For example, to change to Fire, click on Image | Lookup Tables | Fire.\nImage analysis\n\t\nOn the ratio image, draw ROIs around individual cells or mitochondria. After drawing each ROI, add it to the ROI Manager. Analyze | Tools | ROI Manager | Add. (keyboard shortcut: 'T') Select Show All.\n\t\tNOTE: Because background pixels have been set to 'not a number' (NaN) in steps 6.1.6 and 6.1.7, they will not affect the result of the measurement. Therefore, it is acceptable to include some background pixels in the ROI.\nMeasure the 405:488 ratios of individual cells by clicking on ROI Manager | ctrl+A to select all ROIs | More | Multi Measure. In the dialog box, select Measure all slices and One row per slice.\nExport the measurements to spreadsheet software.\nSelect the 405 nm image. Measure the intensities of all ROIs as in step 6.2.2. using the ROIs that are stored in the ROI manager.\nExport the measurements to spreadsheet software.",
    "Select the 488 nm image. Measure intensities of all ROIs as in step 6.2.2. using the ROIs that are stored in the ROI manager.\nExport the measurements to spreadsheet software.\nSave ROIs for future reference by clicking on ROI Manager | ctrl+A to select all ROIs | More | Save.\nRecommended: Generate intensity vs. time plots of the 405 and 488 nm traces. Verify that there is no marked bleaching in either of the channels (signal intensity at the end of the imaging series should be ≥98% of the first image) and that the two traces move into opposite directions during sensor responses (e.g., the 405 nm trace should increase during oxidation while the 488 nm trace should decrease).\nData normalization\n\t\nFor each ROI from the ratio image, determine the maximum value during DA treatment (Rmax) and the minimum value during DTT treatment (Rmin).\nCalculate the normalized ratio as follows:\nimgsrc://cloudfront.jove.com/files/ftp_upload/63073/63073eq01.jpg\n\t\tNOTE: This will set the maximum ratio to 1.0 and the minimum ratio to 0.\nAnalysis of mitochondrial morphology\n\t\nTo obtain measurements of mitochondrial morphology in parallel to roGFP intensities in step 6.2.6, go to Analyze | Set Measurements and check Shape descriptors and Fit ellipse.\n\t\tNOTE: In addition to mean intensity, the measurements in the results window will include the length of the major axis (Major), the length of the minor axis (Minor), the aspect ratio (AR; major axis divided by minor axis; round mitochondria have an AR ~1, elongated mitochondria have a greater AR), as well as measurements of circularity (Circ.) and roundness (Round).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}