{
  "id": 2721,
  "origin_website": "Cell",
  "title": "A Protocol for FRET-Based Live-Cell Imaging in Microglia",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nSeeding of Cells in Imaging Dishes (Day 1)\nTiming: 30 min\nCultivate cells in an imaging-compatible dish.\nDetach cells from culture:\nAspirate the medium from the flask;\nAdd 3 mL PBS (Ca2+/Mg2+ free) to the flask and gently swirl it to remove traces of serum from the culture medium;\nAspirate the PBS from the flask;\nAdd 500 μL trypsin 0.5% and tilt the flask up and down and from side to side to ensure coverage of the whole flask surface;\nIncubate cells at 37°C for 5 min to allow complete detachment from the flask (cells should be round and free-floating under the microscope);\nCollect the detached cells:\nAdd 5 mL supplemented medium to the flask using a serological pipette and use that volume to gently pipette up and down along the flask surface to collect all the detached cells. Transfer the cell suspension to a 15 mL falcon tube;\nCentrifuge the cells for 5 min, 400 × g at 22°C–25°C;\nDiscard the supernatant and gently resuspend the cells in 1 mL supplemented medium;\nCount the cells in suspension using a cell counter or a Neubauer chamber.\nSeed the cells in the imaging dish:\nAdd 2 mL supplemented medium to the imaging dish;\nAdd 2.5×104 cells to this dish (for an area of 35 mm - approximately 7×103 cells/cm2) and, using a 1 mL micropipette, gently aspirate up and down the cell suspension in the dish, taking care not to introduce bubbles, to avoid later clustering of attached cells;\nIncubate the cells 12–16 h at 37°C (5% CO2) to allow attachment and spreading;",
    "Optional: Regarding step 4c. The 12–16 h incubation of cells after seeding is not mandatory before transfection. We tend to see better transfection results when cells are allowed more recovery time post-seeding. If necessary, cells can be transfected as soon as they become attached and spread (at least 2 h post-seeding).\nNote: Regarding cell cultivation, any imaging dish with optically clear glass or plastic coverslips can be used without the need for extra cleaning. We recommend #1.5 coverslips to ensure less variance in thickness. We use the Ibidi μ-Dish 35 mm with polymer coverslip bottom for imaging. Dishes with glass coverslip bottoms can also be used with good imaging results. However, we have observed that these cells prefer plastic surfaces (increased growth and survival).\nNote: Regarding step 1. The volumes indicated refer to cells seeded in T25 flasks (which we usually use to culture the cells). For bigger containers, scale up accordingly.\nTransfection of Cells with FRET Biosensor (Day 2)\nTiming: 4.5 h\nTransfect cells with a plasmid encoding a FRET probe (CFP/YFP FRET pairs in this example, but can be adapted to other FRET pairs, as appropriate) and incubate for 16–20 h to allow proper biosensor expression.\nPrepare the plasmid-containing lipid particles for delivery:\nFor every imaging dish containing cells to be transfected, prepare a 1.5 mL tube with 200 μL JetPrime buffer.\nPipette 900 ng plasmid DNA into this tube and briefly vortex it. (Troubleshooting[href=https://www.wicell.org#troubleshooting])\nAdd 1.8 μL JetPrime transfection reagent to the tube (with the buffer and DNA) and immediately vortex it for 10 s;\nIncubate the mixture at 22°C–25°C for 10 min;\nTransfect the cells and allow particle-cell interaction:\nAspirate the medium from the imaging dish containing the seeded cells;\nAdd 2 mL of fresh supplemented medium to it;",
    "Use a micropipette to add, dropwise, the entire volume of the plasmid-containing particles (prepared in step 5d) to the dish;\nIncubate cells at 37°C (5% CO2) for 4 h;\nReplace the medium:\nAspirate the medium from the imaging dish;\nAdd 2 mL fresh supplemented medium;\nAllow probe expression:\nIncubate the cells at 37°C (5% CO2) for 16–20 h.\nCritical: Related to step 5b. Never transfect more than 1 μg DNA per plasmid per dish. When using higher amounts, we have observed that probe expression and intracellular distribution are compromised, invalidating the imaging of cells.\nCritical: Do not skip step 7. Although cells are not overly damaged if the medium is not refreshed, they will be worse for imaging.\nCritical: Do not shorten the incubation period in step 8a. Proper expression and maturation of the FRET probe require this period. Although different probes can have different maturation periods, a bare-minimum of 12–15 h is necessary for achieving decent imaging.\nNote: The ratio of DNA to transfection reagent we use is 1:2, following the manufacturer's instructions (i.e., for every 1 μg plasmid DNA used in step 5b, we add 2 μL of JetPrime transfection reagent).\nNote: We use JetPrime transfection reagent because, in our hands, it achieves the best transfection efficiency. However, other lipid-mediated or classical transfection reagents can be used instead (with varying degrees of effectiveness).\nLive Imaging of Probe-Transfected Cells (Day 3)\nTiming: 2 h\nAcquire images of cells transfected with the FRET probe of interest in an inverted fluorescence microscope with appropriate filter sets for CFP-YFP FRET. (Troubleshooting[href=https://www.wicell.org#troubleshooting])\nOptional: Before beginning any experiment, first inspect if cells are transfected and if probe expression is adequate (inspection should be quick to avoid bleaching the cells) - use any fluorescence microscope with standard FITC or GFP dichroics.",
    "Bring cultures to a laminar flow hood:\nIf using individual dishes, use one at a time;\nRemove the medium:\nAspirate the medium from the imaging dish;\nAdd 2 mL saline (PBS or HBSS) - add the solution gently;\nRepeat at least two times;\nAdd 2 mL of imaging solution (see Materials and Equipment for recipe), pre-warmed.\nIncubate cells with imaging solution:\nAllow cells to acclimate for 5–10 min at 22°C–25°C;\nDepending on the application (for instance, pre-incubation with agonists, antagonists, activators, and blockers), return the cultures to an incubator. For long-term storage, supplement the media to avoid starvation/acidification of the culture;\nTake the culture dish to the microscope (the experimenter can image the cells directly from the dish, but we highly recommend not to skip steps 9–11);\nSet up the microscope for image acquisition:\nTurn on the temperature controller and, if adequate, CO2/O2 regulators (should be performed before - at least 30 min - incubating cells with imaging solution);\nChoose the desired microscope objective and bring cells into focus (Figure 2[href=https://www.wicell.org#fig2]);\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/222-Fig2.jpg\nFigure 2. Acquisition Panel with Imaging Settings (Part 1)\nActivate the mark-and-find option (A) and use the GFP filter (B) to select cells with high expression of FRET probe. Mark the desired positions by adding them one by one (C).\nChoose cells with high expression of FRET probe using the GFP filter;\nIf more than one field of view (or multiple cells) will be simultaneously recorded, mark and find the desired ones;\nSet up software imaging parameters, exposure time, filter combination, binning adjustment (if applicable), focus and time-lapse routine (Figures 3[href=https://www.wicell.org#fig3], 4[href=https://www.wicell.org#fig4], and 5[href=https://www.wicell.org#fig5]);\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/222-Fig3.jpg\nFigure 3. Acquisition Panel with Imaging Settings (Part 2)",
    "Once positions have been identified, define illumination intensity (A) and the exposure time (B). Set the acquisition of FRET donor images by selecting the FRET filter (C) and setting the excitation to CFP (D) and emission to CFP (E).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/222-Fig4.jpg\nFigure 4. Acquisition Panel with Imaging Settings (Part 3)\nSet the acquisition of FRET images by selecting the FRET filter (A) and setting the excitation to CFP (B) and emission to YFP (C). If appropriate, define binning (D). Turn the autofocus system on (E) and select Adaptive Focus Control (F). Once cells are in focus, define the AFC point by ticking the option \"Use AFC\" (G).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/222-Fig5.jpg\nFigure 5. Acquisition Panel with Imaging Settings (Part 4)\nActivate temporal acquisition of images (A). Set the time-lapse conditions by specifying the frame-rate (B) and the duration of imaging (C). Everything is now ready to start imaging (D).\nLight intensity: We use a Leica EL6000 alignment-free external light source at 80% power; (Troubleshooting[href=https://www.wicell.org#troubleshooting])\nExposure: Set exposure in the LAS AF software. Here, pixel intensity values (from 0 to 65535 – 16-bit range) should be at least 800 and a maximum 25000. Such intensity values (using standard CFP/YFP FRET pair under the specified Leica FRET dichroics [CFP ex: BP 427/10; CFP em: BP 472/30; YFP em: BP 542/27], with a high numerical aperture objective, and with the ORCA-Flash4.0 LT+ Digital CMOS camera) are achieved with an exposure time between 50–200 ms — begin with 50 ms and, if required, gradually increase the exposure (up to 200 ms) to reach the minimum pixel intensity value;\nFilter combination:\nSet DONOR channel – light path to CFP excitation and collect CFP fluorescence; (Troubleshooting[href=https://www.wicell.org#troubleshooting])\nSet ACCEPTOR (FRET) channel – light path to CFP excitation and collect YFP fluorescence;",
    "Focus mode: Set the focus to adaptative mode (we can record microglia only for short periods – 5/10 min – without using the adaptative focus mode);\nTime-lapse routine: Set the time interval between image sequences and the recording interval;\nPerform the imaging of selected cells:\nIn case cells are to be stimulated during imaging acquisition, perform a baseline recording of 5–10 min before adding the stimulus to serve as the internal control for repetitive measures; (Troubleshooting[href=https://www.wicell.org#troubleshooting])\nAfter baseline recording, pause the acquisition and apply the solution containing the stimulus; (Troubleshooting[href=https://www.wicell.org#troubleshooting])\nCritical: Do not skip step 10.\nCritical: Exposure time must be the same for the DONOR and FRET channels; otherwise, the dynamic range of the probe will be disrupted, and analyses will be compromised.\nCritical: Always use adaptative focus (an in-build \"plug and play\" routine in the Leica FRET system – see Figures 4[href=https://www.wicell.org#fig4]E−4G) or similar routines for long-term recordings – Relative to focus mode in step 12c.\nCritical: Perform experiments at 32°C–35°C (obligatory for long-term recordings) – recordings performed at 22°C–25°C tend to be less reproducible.\nCritical: Do not use the light source at 100% power – Relative to step 12c.i.\nCritical: Relative to step 12c.ii. Do not use exposure times higher than 300 ms. Consider using binning if the fluorescence of the FRET probe is too dim. Although applying binning may improve the FRET probe's signal-to-noise ratio, it will also detrimentally affect the image's spatial resolution. With the ORCA-Flash4.0 LT+ Digital CMOS camera, a 2 X 2 binning is a good option to increase the signal-to-noise ratio without losing too much spatial resolution.\nNote: Regarding step 13. To improve reproducibility between experiments, the time interval from choosing appropriate cells to beginning the experiment should take less than 30 min.",
    "Note: If adding any solution to the cells during the recording period (for instance, a pharmacological stimulator or inhibitor), start the experiments without using the lid of the culture dish and do not use the mini chamber for gas regulation. For long-term applications, this might be problematic because appropriate pH control requires the use of CO2.\nNote: If necessary, add phenol red to the imaging solution to visualize media acidification, but this may decrease the signal-to-noise ratio.\nImage Processing and Analysis (Day 4)\nTiming: 2.5 h\nProcess time-lapses to extract relevant qualitative and quantitative information from image series. The routine (see Figure 6[href=https://www.wicell.org#fig6]) shows an example of an image series of a CFP/YFP FRET experiment (Figure 7[href=https://www.wicell.org#fig7]). Troubleshooting[href=https://www.wicell.org#troubleshooting]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/222-Fig6.jpg\nFigure 6. Routine for the Manual Processing of a Live-Cell Imaging CFP/YFP FRET Experiment\nManual FRET analysis routine consists of opening the microscope data (A), subtracting the image background (B), adjusting brightness and contrast for the mask (C), thresholding (D) and generating the binary mask (E), masking DONOR and FRET channels (F), producing the ratio image (G), converting the image to 16-bit scale (H), applying a multicolor LUT (I), setting up quantification parameters (J), and quantifying the ROIs using the ROI manager (K).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/222-Fig7.jpg\nFigure 7. HCM3 Microglia Expressing the RhoA FRET Activity Biosensor Raichu-RhoA Were Recorded in Saline Before (Saline) and upon Exposure to 200 nM Aβ1-42 Oligomers\nTime-lapse images showing DONOR images (A), FRET images (B), binary masks (C), masked DONOR images (D), masked FRET images (E), ratio FRET/DONOR images (F), and IMD images (G). The look-up table ramps indicate the scaling of ratio images in (F) and (G). Scale bars: 20 μm.\nExport time-lapse images with metadata; Troubleshooting[href=https://www.wicell.org#troubleshooting]\nOpen images using FIJI software (Figure 6[href=https://www.wicell.org#fig6]A);",
    "Carefully inspect the time series of DONOR and FRET channels for fluorescence aberrations and photobleaching; Troubleshooting[href=https://www.wicell.org#troubleshooting]\nProcessing – Here, we outline a completely manual downstream routine; Troubleshooting[href=https://www.wicell.org#troubleshooting]\nSubtract background - DONOR and FRET channels separately:\nDraw an ROI in a cell-free zone;\nMeasure (shortcut \"m\") the fluorescence;\nSubtract the values from each corresponding channel (Figure 6[href=https://www.wicell.org#fig6]B):\nGo to: Process -> Math -> Subtract -> insert corresponding value;\nAdjust brightness and contrast (Figure 6[href=https://www.wicell.org#fig6]C):\nGo to: Image -> Adjust -> Brightness/Contrast -> Hit “Auto” – do not hit “Apply;”\nSave DONOR and FRET images as .tiff;\nMask channels:\nDuplicate the entire FRET channel stack;\nThreshold the desired ROI (usually a cell of interest in the field) of the duplicated FRET channel stack – (FIJI offers several auto local threshold routines):\nGo to: Image -> Adjust -> Auto Local Threshold (Figure 6[href=https://www.wicell.org#fig6]D) – 8-bit image required;\nConvert the thresholded ROI into binary (white foreground – black background) image – (this step is automatic if using an auto local threshold routine) – Figure 6[href=https://www.wicell.org#fig6]E;\nSave the binary stack as .tiff and rename it to \"mask;\"\nGenerate masked 32-bit float images of DONOR and FRET channels (Figure 6[href=https://www.wicell.org#fig6]F):\nGo to: Process -> Image calculator -> choose image 1 (DONOR or FRET – repeat for both channels); image 2 (mask); operation = multiply; checkbox in create new window and in 32-bit float;\nRename to \"masked DONOR,\" \"masked FRET\" and save stacks as .tiff;\nGenerate a ratio image (Figure 6[href=https://www.wicell.org#fig6]G):\nGo to: Process -> Image calculator -> choose image 1 (masked FRET); image 2 (masked DONOR); operation = divide; checkbox in create new window and in 32-bit float;\nConvert ratio image to 16-bit (Figure 6[href=https://www.wicell.org#fig6]H):\nGo to: Image -> Type -> 16-bit, rename to “FRET-DONOR” and save as .tiff;",
    "Apply a gradient LUT (Figure 6[href=https://www.wicell.org#fig6]I) and adjust image contrast (Figure 6[href=https://www.wicell.org#fig6]C);\nDraw ROIs (user-defined) in cells or structures to be quantified;\nTranspose ROI coordinate vectors to the ROI manager – use the shortcut \"t;\"\nSet the measurements to be extracted form ratio images:\nGo to: Analyze –> Set measurements (Figure 6[href=https://www.wicell.org#fig6]J);\nExtract quantitative measures using the \"multiple measure\" function of the ROI manager (Figure 6[href=https://www.wicell.org#fig6]K) – experimenter may save ROI locations for future reference;\nCopy and paste values to a spreadsheet or Save as .csv for further quantitative analyses and statistics;\nDisplay representative time series as intensity-modulated display (IMD) images (optional):\nFind the IMD FRET plugin at https://doi.org/10.17632/y6z2zmsx4f.1[href=https://doi.org/10.17632/y6z2zmsx4f.1]\nDownload \"IMDFret.txt\" file;\nIn FIJI go to: Plugins -> Macros -> Install -> Open DONOR, FRET and intensity-modulated (IM - duplication of the brightest channel) images -> Run IMDFret plugin;\nSelect numerator, denominator, and IM image;\nAdjust the max/min ratio (multiples of 2 are a good option) as well as the max/min intensity;\nIn the generated color-coded IMD stack, red-yellow represents high FRET, and blue-green represents low FRET - If required, re-adjust brightness and contrast using the sliders;\nCritical: Do not skip step 16\nNote: Regarding step 17a.iii. Alternatively, perform background subtraction using an average value with an in-built FIJI routine:\nGo to: Process -> Subtract background -> try different values of Rolling ball radius;\nNote: Regarding step 17k. If subcellular structures to be quantified are moving, it might be needed to register the FRET and DONOR channels before generating the ratio image:\nGo to: Plugins -> Registration -> Register Virtual Stack Slices (https://imagej.net/Register_Virtual_Stack_Slices[href=https://imagej.net/Register_Virtual_Stack_Slices])"
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Microscopy",
    "Cell Culture",
    "Cell Biology",
    "Cell-Based Assays",
    "Neuroscience",
    "Signal Transduction",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}