{
  "id": 13164,
  "origin_website": "Jove",
  "title": "Incremental Temperature Changes for Maximal Breeding and Spawning in Astyanax mexicanus",
  "procedures": [
    "This procedure has been approved by Institutional Animal Care guidelines of the University of Maryland, College Park (Currently IACUC 469 #R-NOV-18-59; Project 1241065-1).\nimgsrc://cloudfront.jove.com/files/ftp_upload/61708/61708fig1.jpg\nFigure 1. Calendars during a breeding week and a non-breeding week. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61708/61708fig1large.jpg]\n1. Monday\nAt 9-10 AM, perform water tests and steps 1.1.1-4 below.\n\t\nRecord the room, tank, and reservoir temperatures using a thermometer.\nRecord the ammonia, nitrate, and nitrate levels with a colorimetric test kit.\nRecord the pH from the monitoring system as well as the colorimetric test kit.\nRecord the conductivity from the carboy monitor and the main system monitor.\nBeginning at 10 AM, feed all fish.\n\t\nFeed all fish in the adult system with tetra flakes, crushing the flakes in the tanks with young fish. Feed only as many flakes as a tank of fish can consume completely in 3-5 minutes, about a “finger pinch”.\nCheck the incubator used to house fingerbowls of developing embryos and change the water if needed.\n\t\nOpen the embryo incubator and check the water levels in all reservoirs. If they are running low on water, add system water. Check incubator temperature settings. Raise embryos at 73-77 °F (23-25 °C).\nClean live feed.\n\t\nTo clean the blackworms, remove the uncovered Tupperware basins containing their cultures from the live feed refrigerator and pour off the excess water above the worm clusters into the sink. Using distilled water, suspend and rinse the worms repeatedly until the pour-off water is clear.\nAdd enough clean water so that the worm clusters are about half covered. Replace remaining worms in the live feed refrigerator, uncovered.\nFeed fish.",
    "At least 30 min after the first feeding, feed fish in the tanks in which breeding is desired with egg yolk flakes, blackworms, or both. Add a “fingerpinch” of yolk flakes per tank. Add enough blackworm clusters to allow each fish in the tank to consume about 5-10 worms.\nAt 10 AM- 1 PM, set the water temperature to 74 °F.\nScrub the breeding tanks as needed and set the breeding nets.\nClean the tanks and place the nets at least one hour after the last feeding. Clean all tanks that nets are placed in beforehand. Set breeding nets carefully so as not to interfere with the air supply to the tank.\n2. Tuesday\nCollect the embryos and wash all breeding nets.\n\t\nAt 9-10 AM, remove the breeding nets from the bottom of adult system tanks. Gently rinse the embryos into a hand-held net using the hose attached to the carboy, and invert the hand-held net into a fingerbowl of clean system water to expel the embryos.\nCollect and wash each set of embryos, and then place in a fingerbowl of clean system water containing 0.00003% methylene blue (blue water). If there is an exceptionally large number of embryos from a single tank, separate them into multiple bowls. The concentration of living embryos should be about 100 per 200 mL of blue water in each fingerbowl.\nEstimate the time of fertilization by staging the embryos under a microscope using the published A. mexicanus developmental time table17.\nMonitor the fingerbowls containing embryos frequently. Remove dead or deformed embryos and debris, such as uneaten food or feces, with a Pasteur pipette. Change the blue water in fingerbowls frequently.",
    "Place the fingerbowls in an incubator for 5-7 days. At this time, the yolk has been used up and feeding cultures with living brine shrimp is necessary for further development.\nTake spawning data.\n\t\nFor every tank that drops embryos, record the following information.\n\t\t\nRecord the date and the tank number.\nRecord the approximate number of embryos dropped (Figure 2):\n\t\t\tHigh (500+)\n\t\t\tMedium (200-500)\n\t\t\tLow(<200)\nRecord the quality of embryos dropped (Figure 2):\n\t\t\tHigh (>75% alive)\n\t\t\tMedium (25-50% alive)\n\t\t\tLow (<25% alive)\nEstimate the original spawning time by consulting the Astyanax mexicanus staging table17.\nRecord the temperature that the system was set at when the fish spawned.\nFeed all fish.\nSet the water temperature to 76 °F.\nPrepare live feed.\nFeed fish #2.\nScoop excess food and debris from tanks and scrub before resetting nets.\n3. Wednesday\nRepeat steps 2.1-2.2. Collect embryos and wash all breeding nets.\nTake spawning data as before.\nPerform water tests as before.\nFeed all fish.\nSet the water temperature to 78 °F.\nPrepare the live feed.\nCheck on embryos in the incubator.\n\t\nClean and change the water of the embryos in fingerbowls that will eventually be used to replenish the general adult breeding stock. Use methylene blue-treated system water.\nFeed fish again.\nClean tanks as needed and reset nets.\n4. Thursday\nRepeat steps 2.1-2.2. Collect embryos and wash and store breeding nets.\nTake spawning data as before.\nSet water temperature to 76°F.\nClean the live feed.\nClean all individual tanks.\nCheck on embryos in the incubator.\nFeed fish #2.\n5. Friday\nFeed all fish.\nSet water temperature to 74 °F.\nClean the live feed.\nCheck on embryos in the incubator.\n6. Saturday\nFeed fish.\n7. Sunday\nFeed fish.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}