{
  "id": 19742,
  "origin_website": "Wiley",
  "title": "A Comprehensive Guide for Assessing Covalent Inhibition in Enzymatic Assays Illustrated with Kinetic Simulations",
  "procedures": [
    "The protocol below provides a generic set of steps to accomplishing this type of measurement. A practical example with specific reagents, and assay conditions for progress curve analysis of covalent Cathepsin K inhibitors can be found in Mons et al. (2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0058]).\nMaterials\n1× Assay/reaction buffer supplemented with co-factors and reducing agent\nActive enzyme, 4× solution in assay buffer\nSubstrate with continuous read-out, 4× solution in assay buffer\nPositive control: vehicle/solvent as DMSO stock, or 2% solution in assay buffer\nNegative control: known inhibitor or alkylating agent as DMSO stock, or 2× solution in assay buffer\nInhibitor: as DMSO stock, or serial dilution of 2× solution in assay buffer with 2% DMSO\n384-well low volume microplate with nonbinding surface (e.g., Corning 3820 or 4513) for incubation and read-out\nOptical clear cover/seal (e.g., Perkin Elmer TopSeal-A Plus, #6050185, Corning 6575 Universal Optical Sealing Tape or Duck Brand HP260 Packing Tape)\n1.5 ml (Eppendorf) microtubes to prepare stock solutions\nOptional: 96-well microplate to prepare serial dilution of inhibitor concentration\nMicroplate reader equipped with appropriate filters to detect product formation (e.g., CLARIOstar microplate reader)\nOptional: Automated (acoustic) dispenser (e.g., Labcyte ECHO 550 Liquid Handler acoustic dispenser)",
    "Before you start, optimize assay conditions in the uninhibited control to ensure compliance with assumptions and restrictions for progress curve analysis—most importantly linear product formation in the uninhibited control for the duration of the experiment (kctrl = 0) — by activating the enzyme before reaction initiation (e.g., preincubation with reducing agent for proteases, or ATP for kinases and ligases), testing the enzyme activity on the (fluorogenic) substrate in absence of inhibitor, and adjusting the enzyme and substrate concentration ([S] 0>10[E]0) to reach maximum 10% substrate conversion at the end of the measurement window ([P]t < 0.1[S]0). Further optimization typically involves tuning the reader settings for optimal sensitivity, measurement of a calibration curve for product concentration (Dharadhar et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0020]; Janssen et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0031]), and calculation of the Z′-score from the uninhibited and inhibited controls (ideally 8 replicates) in a separate experiment (Zhang, Chung, & Oldenburg, 1999[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0086]) to validate that enough product is formed for a good signal/noise ratio (Z′ > 0.5) at the end of the measurement. Consult Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-tbl-0003] in the troubleshooting section near the end of the article for common optimization and troubleshooting options. The read-out of product formation must be homogeneous/continuous. Product formation of substrates with a less sensitive read-out (e.g., fluorescence polarization) may generate a relatively low product signal relative to the unprocessed substrate, and substrate depletion is unavoidable to generate a sufficient Z′-score (Zhang et al., 1999[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0086]). Algebraic analysis of two-step irreversible inhibition with substrate depletion ([P]t < 0.1[S]0) can be performed with Data Analysis Protocol 1D after completion of Basic Protocol I, steps 2-6.",
    "1. Add inhibitor or control to each well with the uninhibited control for full enzyme activity containing the same volume vehicle/solvent instead of inhibitor (we use DMSO in this protocol). Add a constant volume of serially diluted inhibitor in assay buffer supplemented with DMSO (e.g., 10.2 µl of 2× solution containing 2% DMSO), or add inhibitor and controls by (acoustic) dispensing of the pure DMSO stocks, with DMSO backfill to a constant volume (e.g., 0.2 µl), followed by addition of assay buffer to each well (e.g., 10 µl) and gentle shaking (300 rpm) to homogenize the solution.\nTypically, measurements are performed in triplicate (or more replicates) with at least 8 inhibitor concentrations. Inhibitor concentrations might need optimization, but a good starting point is 0.1-10×IC50; the highest inhibitor concentration should correspond to maximum 90% initial (noncovalent) inhibition (vi > 0.1vctrl), as it can be difficult to accurately detect the increase from 90% to 100% inhibition.\n2. Add substrate in assay buffer to each well (e.g., 5 µl of 4× solution) and homogenize the solutions by gentle shaking (300 rpm).\nThe order of substrate or inhibitor addition is not important per se, as long as enzyme is the last reagent to be added, and DMSO stocks are added prior to buffered (aqueous) solutions. Optionally, gently centrifuge the plate (1 min at 1000 rpm) to ensure that assay components are not stuck at the top of the well.",
    "3. Add active enzyme in assay buffer to each well (e.g., 5 µl of 4× solution), with minimal delay between addition to the first and the last well. Optionally, gently centrifuge the plate (1 min at 1000 rpm) if bubbles are formed (especially for buffers containing surfactants), as these will induce assay artifacts, and to ensure assay components are in solution together rather than stuck to the wall at the top of the well.\nManual addition of enzyme solution and physically moving the plate to the plate reader introduces a delay that may slightly affect the accuracy of the measurement, as it can be variable (depending on the total number of wells, distance to the machine and walking pace of the researcher). This should not be significant if the delay is short compared to the total reaction time, but it can affect the outcome in the data analysis when t0 is actually 1-2 min. One method to monitor the delay between reaction initiation (onset of product formation and inhibition) and the start of product detection in step 6 is evaluation of the Y-intercept values (as discussed in Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-tbl-0003]). Alternatively, enzyme addition with an injector built into the plate reader minimizes the delay between reaction initiation (onset of product formation and inhibition) and starting the measurement.\n4. Seal the wells by applying an optical clear cover.\nContinuous kinetic measurements are subject to assay artifacts such as drift due to evaporation. In our experience, application of an optical clear cover/seal prior to measurement improves the assay robustness and resolves significant aberrant nonlinearity unrelated to enzyme activity.\n5. Measure product formation in microplate reader by detection of the product read-out.",
    "A typical assay measurement window is 60-240 min, with a measurement interval of 1-2 min. The inhibitor-binding reaction does not have to reach completion (100% inhibition for irreversible inhibitors, equilibrium for reversible inhibitors) within this window, but data will be more reliable when completion is reached before the end of the measurement (Fig. 5B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0005]).\n6. Proceed to Basic Data Analysis Protocols to calculate the appropriate kinetic parameters for each covalent binding mode: Data Analysis Protocol 1A for two-step irreversible inhibitors, Data Analysis Protocol 1B for one-step irreversible inhibitors, Data Analysis Protocol 1C for two-step reversible inhibitors, or Data Analysis Protocol 1D for two-step irreversible inhibitors with substrate depletion.\n \n         \ntable:\n﻿Unnamed: 0_level_0,Data Analysis Protocol,Data Analysis Protocol,Data Analysis Protocol\nEXP Conditions,2-step IRREV,1-step IRREV,2-step REV\nkctrl = 0,1A,1B,1C\nkdegE > 0,1A,1B,–\n[P]t > 0.1[S]0,1D,–,–\nExemplary assay concentrations.\n         \ntable:\n﻿Unnamed: 0,Concentration during incubation t,Concentration during incubation t.1,Concentration during incubation t.2\n,[stock],V (µl),[conc]t\nEnzyme,4 nM,5,0.99 nM\nInhibitor,20 nM,10.2,10.10 nM\nSubstrate,4 µM,5,0.99 µM\nTotal,,20.2,\nData Analysis 1A: Progress Curve Analysis for Two-Step Irreversible Covalent Inhibition",
    "The progress curve of time-dependent product formation of each inhibitor concentration is fitted to exponential Equation II (Fig. 5C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0005]) constraining final velocity to 100% inhibition (vs = 0) at reaction completion (Fig. 6A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0006] and 6B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0006]). The inhibitor concentration–dependent observed rate of inactivation kobs reflects the rate from initial velocity vi (rapid noncovalent equilibrium) to final velocity vs (inactivation at reaction completion). The plot of inhibitor concentration–dependent kobs reaches maximum rate of inactivation kinact in the presence of saturating inhibitor concentration ([I] >> KIapp) with the Y-intercept at 0 when the progress curve in absence of inhibitor is strictly linear (Fig. 6C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0006]). Importantly, the inhibitor concentration that results in half-maximum enzyme inactivation (kobs = ½×kinact) has to be corrected for competition by the substrate during incubation but maximum rate of inactivation kinact is unaffected.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/72c5d2b6-cb77-41d1-bec0-3fd5e420992f/cpz1419-fig-0006-m.jpg</p>\nFigure 6",
    "Data Analysis 1A: Progress curve analysis for two-step irreversible covalent inhibition. Simulated with KinGen (A-C) or KinDeg (D-F) for inhibitor C with 1 pM enzyme and 100 nM substrate S1. (A) Schematic enzyme dynamics during incubation for two-step irreversible covalent inhibition. (B) Time-dependent product formation in absence of inhibitor Fctrl or in presence of inhibitor. The progress curve for each inhibitor concentration is fitted individually to Equation II (Fig. 5C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0005]) (constraining vs = 0) to obtain the observed rate of inactivation kobs. (C) Inhibitor concentration–dependent kobs reaches kinact at saturating inhibitor concentration (kmax = kinact). Half-maximum kobs = ½kinact is reached when inhibitor concentration equals the apparent inactivation constant KIapp. (D) Schematic enzyme dynamics during incubation for two-step irreversible covalent inhibition with spontaneous loss of enzyme activity. Simulated with kdegE = kdegES = kdegEI = 0.0003 s−1. (E) Time-dependent product formation in absence of inhibitor Fctrl is not linear because kctrl > 0. The progress curves for each inhibitor concentration and uninhibited control are fitted individually to Equation II (Fig. 5C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0005]) (constraining vs = 0) to obtain the observed rates of inactivation kobs. (F) Inhibitor concentration–dependent kobs with spontaneous enzyme degradation increases with kctrl, but the span from kmin (= kctrl) to kmax (= kinact + kctrl) still equals kinact. Fit with algebraic correction for nonlinearity (black line, kctrl > 0). Ignoring the nonlinearity (gray line, constrain kctrl = 0) results in underestimation of KIapp (overestimation of potency) and overestimation of kinact.\nWarnings and remarks",
    "A linear plot of inhibitor concentration-dependent kobs (with Y-intercept = kctrl) and an initial velocity independent of inhibitor concentration (vi = vctrl) are indicative of a one-step binding mechanism: the inhibitor concentration is not saturating ([I] ≤ 0.1KIapp and [I] ≤ 0.1Kiapp). This can be resolved by increasing the inhibitor concentration, reducing the substrate concentration, or processing the data with Basic Data Analysis Protocol 1B. Inhibitors with a high noncovalent potency ([I] >> Kiapp) might exhibit tight-binding behavior: complete inactivation is reached at reaction initiation (vi = 0), even at the lowest inhibitor concentration, without violating the pseudo-first order reaction conditions ([I]0 ≥ 10[E]0). This can be resolved by lowering the inhibitor concentration, but only if the assay robustness is sufficient to also lower the enzyme concentration, and/or by increasing the concentration of competing substrate, thus increasing the apparent inhibition constant Kiapp. Unfortunately, algebraic correction for progress curve analysis of one-step inhibitors (Copeland, 2013b[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0012]) with inhibitor depletion ([I]0 < 10[E]0) is not compatible with two-step inhibition. Numeric fitting is a possibility to fit progress curves with depletion of substrate as well as inhibitor (Kuzmič, 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0042]). Alternatively, tight-binding two-step irreversible covalent inhibition can be assessed with Method IV if covalent adduct formation is relatively slow.",
    "Spontaneous enzyme degradation/denaturation causes a nonlinearity in the uninhibited control (kctrl > 0) that violates the assumption that time-dependence in the inhibitor-treated samples is a direct effect of the inhibitor (Fig. 6D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0006] and 6E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0006]). The first-order enzymatic degradation rate contributes to kobs independent of inhibitor concentration (kdegE = kdegES = kdegEI). Consequently, the Y-intercept of the kobs against inhibitor concentration plot now corresponds to observed rate kctrl in absence of inhibitor, and kmax is higher (kmax = kinact + kctrl) (Fig. 6F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0006]). Performing a simple algebraic correction for the observed nonlinearity due to spontaneous enzyme degradation results in good estimates for kinact and KIapp (Fig. 6F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0006]). Ignoring the nonlinearity in the uninhibited control by restraining kctrl = 0 implies that all time-dependent loss of enzyme activity should be attributed to inhibitor-mediated inactivation, resulting in an underestimation of inactivation constant KIapp (overestimation of potency) and overestimation of kinact. This effect is less pronounced when spontaneous enzyme degradation is much slower than the maximum rate of covalent adduct formation (kinact >> kctrl). It is important to note that stabilization of the enzyme species by (noncovalent) inhibitor binding also decreases the contribution of kctrl to the observed rate kobs at saturating inhibitor concentrations (kmax = kinact). This impairs the accuracy of the algebraic correction unless kctrl is relatively small (kmax approaches kinact if kinact >> kctrl).\nThis algebraic correction does not accurately correct for nonlinearity due to substrate depletion ([P]t > 0.1[S]0): substrate depletion is dependent on the total product formation and does not (significantly) contribute to kmax at saturating inhibitor concentration because enzyme inhibition reduces the total amount of product formed (kmax = kinact). Please consult Data Analysis 1D for algebraic correction of nonlinearity due to substrate depletion.",
    "Processing of raw data obtained with Basic Protocol I for two-step irreversible covalent inhibitors.\n1. Plot signal F against incubation time t.\nPlot signal (in AU) on the Y-axis against incubation time (in s) on the X-axis for each inhibitor concentration and the controls (Fig. 6B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0006]). Product formation in the uninhibited control Fctrl should be linear. Consult Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-tbl-0003] for troubleshooting of nonlinearity of the uninhibited control. Optionally, perform background correction to correct for assay artifacts such as bleaching and drift that cause a negative final velocity (vs < 0 AU/s) in the fully inhibited control. This correction can be subtraction of the background in presence of substrate (and inhibitor) but absence of enzyme, or subtraction of the fully inhibited control.\n2. Fit signal Ft against t to obtain kobs\nFit signal Ft against incubation time t to Equation II (Fig. 6B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0006]/E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0006]). Constrain final velocity vs = 0 (in AU/s) for background-corrected product formation, or vs = value for full inhibition control. A lack of initial noncovalent complex (vi = vctrl) is indicative of one-step binding behavior.\n         \nformula:\n\\begin{equation} {F_{\\rm {t}}} = \\;{{\\rm{v}}_{\\rm{s}}}t + \\frac{{{{\\rm{v}}_{\\rm{i}}} - {{\\rm{v}}_{\\rm{s}}}}}{{{k_{{\\rm{obs}}}}}}\\left[ {1 - {e^{ - {k_{{\\rm{obs}}}}t}}} \\right] + {F_0} \\end{equation}\nEquation II for nonlinear regression of user-defined explicit equation Y = (vs*X) + (((vi-vs)/kobs)*(1-EXP(-kobs*X))) + Y0 with Y = signal Ft (in AU) and X = incubation time t (in s) to find Y0 = Y-intercept F0 = background signal at t = 0 (in AU), vi = initial slope vi (in AU/s), vs = final slope vs (in AU/s) and kobs = observed reaction rate kobs (in s−1).\n3. Plot kobs against [I].",
    "Plot the mean and standard deviation of kobs (in s−1) on the Y-axis against inhibitor concentration (in M) after reaction initiation by enzyme addition (in the final solution) on the X-axis (Fig. 6C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0006]/F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0006]). The plot of kobs against [I] should reach a maximum kobs at saturating inhibitor concentration. Note that a linear curve is indicative of one-step binding behavior at non-saturating inhibitor concentrations ([I] << 0.1KIapp in Fig. 3F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0003]) with vi = vctrl (low initial inhibition). Proceed to Basic Data Analysis Protocol 1B, step 4, after it has been validated that the linear curve is not resultant from saturating inhibitor concentrations ([I] >> 10KIapp in Fig. 3G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0003]) as identified by vi << vctrl (significant initial inhibition), by repeating the measurement with a higher competitive substrate concentration (increase KIapp) and/or lower inhibitor concentration.\n4. Fit kobs against [I] to obtain kinact and KIapp.\nFit kobs against inhibitor concentration to Equation VII to obtain maximum inactivation rate constant kinact (in s−1) and apparent inactivation constant KIapp (in M). Constrain kctrl = kobs of the uninhibited control (Fig. 6F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0006]). Calculate inactivation constant KI (in M) and irreversible covalent inhibitor potency kinact/KI (in M−1s−1) with Sample Calculation 1&2.\n         \nformula:\n\\begin{equation} {k_{{\\rm{obs}}}} = {k_{{\\rm{ctrl}}}} + \\frac{{{k_{{\\rm{inact}}}}\\left[ {\\rm{I}} \\right]}}{{{{\\rm{K}}_{\\rm{I}}}^{{\\rm{app}}} + \\left[ {\\rm{I}} \\right]}} \\end{equation}\nEquation VII for nonlinear regression of user-defined explicit equation Y = Y0 + ((kmax*X)/((KIapp) + X)) with Y = observed reaction rate kobs (in s−1) and X = inhibitor concentration (in M) to find Y0 = rate of nonlinearity in uninhibited control kctrl (in s−1), kmax = maximum reaction rate kinact (in s−1) and KIapp = Apparent inactivation constant KIapp (in M).\n5. EXTRA: Plot and fit vi against [I] to obtain Kiapp.",
    "Inhibition constant Ki can be calculated from the initial velocity vi (obtained in step 3), reflecting the rapid (initial) noncovalent enzyme-inhibitor equilibrium. Plot the mean and standard deviation of vi (in AU/s) on the Y-axis against inhibitor concentration on the X-axis (similar to Fig. 8D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0008]). Fit vi against [I] to four-parameter nonlinear regression Hill Equation VIII (Copeland, 2013e[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0015]) to obtain apparent inhibition constant Kiapp (in M). Constrain the top to the uninhibited vi (maximum velocity = vctrl) and the bottom to the fully inhibited vi (vimin = minimum velocity. For (background-)corrected product formation vimin = 0). Calculate inhibition constant Ki (in M) with Sample Calculation 3.\n         \nformula:\n\\begin{equation} {{\\rm{v}}_{\\rm{i}}} = {\\rm{v}}_{\\rm{i}}^{{\\rm{min}}} + \\frac{{{{\\rm{v}}^{{\\rm{ctrl}}}} - {\\rm{v}}_{\\rm{i}}^{{\\rm{min}}}}}{{1 + {{\\left( {\\frac{{\\left[ {\\rm{I}} \\right]}}{{{{\\rm{K}}_{\\rm{i}}}^{{\\rm{app}}}}}} \\right)}^h}}} \\end{equation}\nEquation VIII for nonlinear regression of four-parameter dose-response equation Y = Bottom + (Top-Bottom)/(1 + (X/IC50)^HillSlope) with Y = initial product formation velocity vi (in AU/s), X = inhibitor concentration (in M), Bottom = velocity in fully inhibited control vimin (in AU/s), and Top = maximum velocity in uninhibited control vctrl (in AU/s) to find Hillslope = Hill coefficient h (unitless) and IC50 = apparent inhibition constant Kiapp (in M).\n6. Optional: Validate experimental kinetic parameters with kinetic simulations.\nProceed to Kinetic Simulations 1 to compare the experimental progress curves to the progress curves simulated with scripts KinGen and KinDeg (using experimental rate constant kinact = k5) to confirm that the calculated kinetic constants are in accordance with the experimental data.\nData Analysis 1B: Progress Curve Analysis for One-Step Irreversible Covalent Inhibition",
    "The progress curve of time-dependent product formation of each inhibitor concentration is fitted to exponential Equation II (Fig. 5C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0005]) constraining final velocity to inactivation (vs = 0) at reaction completion (Fig. 7A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0007] and 7B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0007]). The initial velocity vi equals the uninhibited product formation velocity (vi = vctrl), as noncovalent inhibitor binding does not contribute to enzyme inhibition by one-step irreversible inhibitors. A linear plot of inhibitor concentration–dependent kobs is indicative of a one-step binding mechanism with kchemapp as the slope (Fig. 7C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0007]). Two-step irreversible covalent inhibitors also have a linear kobs against inhibitor concentration plot at non-saturating concentrations ([I] ≤ 0.1KIapp) with kchemapp = kinact/KIapp.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/2b52715d-2e71-4855-b9f0-1ac960509561/cpz1419-fig-0007-m.jpg</p>\nFigure 7",
    "Data Analysis 1B: Progress curve analysis for one-step irreversible covalent inhibition. Simulated with KinGen (A-C) or KinDeg (D-F) for inhibitor D with 1 pM enzyme and 100 nM substrate S1. (A) Schematic enzyme dynamics during incubation for one-step irreversible covalent inhibition. (B) Time-dependent product formation in absence of inhibitor Fctrl or in presence of inhibitor. The progress curve for each inhibitor concentration is fitted individually to Equation II (Fig. 5C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0005]) (constraining vs = 0) to obtain the observed rate of inactivation kobs. vi = vctrl for one-step irreversible inhibitors and two-step irreversible inhibitors at non-saturating concentrations ([I] << Kiapp). (C) Inhibitor concentration–dependent kobs increases linearly with inhibitor concentration, with kchemapp as the slope. (D) Schematic enzyme dynamics during incubation for one-step irreversible covalent inhibition with spontaneous loss of enzyme activity. Simulated with kdegE = kdegES = kdegEI = 0.0003 s−1. (E) Time-dependent product formation in absence of inhibitor Fctrl is not linear because kctrl > 0. The progress curves for each inhibitor concentration and uninhibited control are fitted individually to Equation II (Fig. 5C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0005]) (constraining vs = 0) to obtain the observed rates of inactivation kobs. (F) Inhibitor concentration–dependent kobs with spontaneous enzyme degradation/denaturation increases by kctrl. Fit with algebraic correction for nonlinearity (black line, kctrl > 0) or ignoring nonlinearity (gray line, constrain kctrl = 0). Ignoring the nonlinearity (assuming Y-intercept = 0) results in overestimation of kchemapp (steeper slope).\nWarnings and remarks",
    "The slope has to be corrected for substrate competition to obtain the inactivation constant kchem (in M−1s−1). Substrate will occupy a fraction of the unbound enzyme to reach the noncovalent E + S <-> ES equilibrium (how much depends on [S]/KM), thus reducing the unbound enzyme concentration. It may seem counterintuitive to correct for substrate competition, as the pseudo-first-order rate of covalent adduct formation (kobs = kchemapp[I]) does not seem to involve unbound enzyme (provided inhibitor is present in large excess), but formation of EI* is limited by the available unbound enzyme at that moment and it is not possible to form covalent adduct EI* when competing substrate blocks access to the enzyme active site.\nIt is important to have linear product formation in the uninhibited control (kctrl = 0) or to perform an algebraic correction for nonlinearity in the uninhibited control (kctrl > 0) caused by spontaneous first-order enzyme degradation/denaturation (Fig. 7D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0007]-F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0007]). Failure to correct for the contribution of enzyme degradation when fitting the observed rate of inactivation kobs against inhibitor results in overestimation of kchemapp (Fig. 7F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0007], gray line). The contribution of nonlinearity kctrl becomes less pronounced at elevated inhibitor concentrations as kctrl becomes significantly smaller than kobs (kctrl << kchemapp[I]). (De)stabilization of enzyme upon inhibitor binding (kdegEI*) does not affect kobs, as EI* formation is already irreversible, thus removing the species from the available pool of catalytic enzyme. To our knowledge, methods to algebraically correct for substrate depletion have not been reported.",
    "Processing of raw data obtained with Basic Protocol I for one-step irreversible covalent inhibitors and two-step irreversible inhibitors at non-saturating inhibitor concentrations ([I] ≤ 0.1Kiapp).\n1. Plot signal F against incubation time t.\nPlot signal (in AU) on the Y-axis against incubation time (in s) on the X-axis for each inhibitor concentration and the controls (Fig. 7B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0007]). Product formation in the uninhibited control Fctrl should be linear. Consult Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-tbl-0003] for troubleshooting of nonlinearity of the uninhibited control. Optionally, perform background correction to correct for assay artifacts such as bleaching and drift that cause a negative final velocity (vs < 0 AU/s) in the fully inhibited control. This correction can be subtraction of the background in presence of substrate (and inhibitor) but absence of enzyme, or subtraction of the fully inhibited control.\n2. Fit Ft against t to obtain kobs.\nFit signal Ft against incubation time t to Equation II (Fig. 7B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0007]/E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0007]). Constrain final velocity vs = 0 (in AU/s) for background-corrected product formation, or vs = value for full inhibition control. Initial velocity vi should be a shared value because noncovalent inhibition does not significantly contribute to the initial inhibition for inhibitors displaying one-step behavior.\n         \nformula:\n\\begin{equation} {F_{\\rm {t}}} = \\;{{\\rm{v}}_{\\rm{s}}}t + \\frac{{{{\\rm{v}}_{\\rm{i}}} - {{\\rm{v}}_{\\rm{s}}}}}{{{k_{{\\rm{obs}}}}}}\\left[ {1 - {e^{ - {k_{{\\rm{obs}}}}t}}} \\right] + {F_0} \\end{equation}\nEquation II for nonlinear regression of user-defined explicit equation Y = (vs*X) + (((vi-vs)/kobs)*(1-EXP(-kobs*X))) + Y0 with Y = signal Ft (in AU) and X = incubation time t (in s) to find Y0 = Y-intercept F0 = background signal at t = 0 (in AU), vi = initial slope (in AU/s), vs = final slope (in AU/s) and kobs = observed reaction rate kobs (in s−1).\n3. Plot kobs against [I].",
    "Plot the mean and standard deviation of kobs (in s−1) on the Y-axis against inhibitor concentration (in M) after reaction initiation by enzyme addition (in the final solution) on the X-axis (Fig. 7B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0007]/E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0007]). The plot of kobs against inhibitor concentration [I] is linear for one-step irreversible inhibitors and for two-step irreversible inhibitors at non-saturating inhibitor concentrations ([I] << 0.1Kiapp).\n4. Fit kobs against [I] to obtain kchemapp.\nFit kobs against inhibitor concentration to Equation IX to obtain apparent inhibitor potency kchemapp (in M−1s−1) from the linear slope. Constrain Y-intercept kctrl = kobs of the uninhibited control (Fig. 7F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0007]). Calculate kchem (in M−1s−1) reflecting inhibitor potency for one-step irreversible covalent inhibition with Sample Calculation 4. Calculate kinact/KIapp (in M−1s−1) and kinact/KI (in M−1s−1) for two-step irreversible inhibitors at non-saturating inhibitor concentrations ([I] ≤ 0.1Kiapp) with Sample Calculation 5 and 6.\n         \nformula:\n\\begin{equation} {k_{{\\rm{obs}}}} = {k_{{\\rm{ctrl}}}} + k_{{\\rm{chem}}}^{{\\rm{app}}}\\left[ {\\rm{I}} \\right] \\end{equation}\nEquation IX for nonlinear regression of straight line Y = YIntercept + Slope*X with Y = observed reaction rate kobs (in s−1) and X = inhibitor concentration (in M) to find YIntercept = rate of nonlinearity in uninhibited control kctrl (in s−1) and Slope = apparent inactivation rate constant kchemapp (in M−1s−1).\n5. Optional: Validate experimental kinetic parameters with kinetic simulations.\nProceed to Kinetic Simulations 1 to compare the experimental progress curves to the progress curves simulated with scripts KinGen and KinDeg (using experimental rate constant kchem = k3) to confirm that the calculated kinetic constants are in accordance with the experimental data.\nData Analysis 1C: Progress Curve Analysis for Two-Step Reversible Covalent Inhibition",
    "The progress curve of time-dependent product formation of each inhibitor concentration (Fig. 8A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0008] and 8B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0008]) is fitted to exponential Equation II (Fig. 5C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0005]). The inhibitor concentration-dependent observed rate for reaction completion kobs reflects the rate from initial velocity vi (rapid noncovalent equilibrium) to final velocity vs (slow steady-state equilibrium). Contrary to irreversible inhibition, steady-state velocity vs is not constrained to inactivation (vs > 0) because the reversible steady-state equilibrium is reached at reaction completion. Maximum rate of reaction completion kmax is reached in the presence of saturating inhibitor concentration ([I] >> Kiapp), and the covalent association rate constant k5 is obtained from the span between kmin and kmax. Interestingly, the Y-intercept kmin is equal to covalent dissociation rate constant k6; therefore, the kobs of uninhibited control (kctrl) is excluded from the fit (Fig. 8C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0008]). Steady-state inhibition constant Ki*app can be calculated from the fitted values of Kiapp, k5, and k6, but this is not the preferred approach, as a small error in k6 has huge implications for the calculation of Ki*. Other methods such as jump dilution assays generate more reliable estimates of k6, which is especially important for very potent two-step reversible covalent inhibitors: relatively small k6-values cannot accurately be estimated from the Y-intercept (Copeland, 2013e[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0015]; Copeland et al., 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0016]). Generally, more reliable estimates of the apparent steady-state inhibition constant Ki*app are generated from the dose-response curve of steady-state velocity vs against inhibitor concentration (Fig. 8D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0008]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/22c3a2e0-db32-4ac6-9389-1e9e79576581/cpz1419-fig-0008-m.jpg</p>\nFigure 8",
    "Data Analysis 1C: Progress curve analysis for two-step reversible covalent inhibition. Simulated with KinGen for inhibitor B with 1 pM enzyme and 100 nM substrate S1. (A) Schematic enzyme dynamics during incubation for two-step reversible covalent inhibition. (B) Time-dependent product formation in absence of inhibitor Fctrl or in presence of inhibitor. The progress curve for each inhibitor concentration is fitted individually to Equation II (Fig. 5C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0005]) to obtain the observed rate of inactivation kobs and steady-state velocity vs. (C) Inhibitor concentration-dependent kobs equals kmax at saturating inhibitor concentration (kmax = k5 + k6) and approaches k6 in absence of inhibitor (kmin = k6). Half-maximum kobs = kmin + ½(kmax - kmin) = k6 + ½k5 is reached when inhibitor concentration equals the apparent inhibition constant Kiapp. Steady-state inhibition constant Ki*app has to be calculated from the fitted values of k5, k6 and Kiapp, thus being very sensitive to errors and (non)linearity in the uninhibited background (illustrated in Fig. 9[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0009]). (D) Steady-state inhibition constant Ki*app is equal to the IC50 of steady-state velocity vs.\nWarnings and remarks",
    "It is crucial to have strictly linear product formation in the uninhibited control (kctrl = 0) because it is not possible to perform an algebraic correction for spontaneous enzyme degradation/denaturation (Fig. 9A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0009]). Unfortunately, potent reversible covalent inhibitors are likely to violate this condition. Contrary to irreversible covalent inhibitors that become more potent with a faster kinact, reversible covalent inhibitors are more potent if they have a longer residence time τ, which is driven by a slow dissociation rate k6 (Fig. 1B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0001]) (Copeland, 2010[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0010]; Copeland et al., 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0017]). Violation of this assumption (kctrl > 0) can be identified by fitting the uninhibited product formation Fctrl to Equation II (Fig. 5C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0005]): initial velocity victrl should not be larger than steady-state vsctrl. The consequence of nonlinearity in the uninhibited control is ‘contamination’ of reaction rate kobs and final velocity vs (based on the reversible reaction to reach steady-state equilibrium: vs > 0) with the rate of enzyme degradation kctrl (based on an inactivation reaction: vs = 0). Y-intercept approaching kctrl instead of k6 even though the uninhibited control is not included in the fit is an indication that spontaneous enzyme degradation dominates kobs at low inhibitor concentrations (Fig. 9C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0009]). This ‘red flag’ should not be ignored, as it will result in over/underestimation of kinetic parameters. To our knowledge, models to perform an algebraic correction have not been reported. Calculating steady-state inhibition constant Ki* from final velocity vs also results in an underestimation of the steady-state potency because the contribution of spontaneous enzyme degradation to final velocity vs is dominant at low inhibitor concentrations (Fig. 9D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0009]). Underestimation of the steady-state potency of reversible covalent inhibitors that have a relatively slow k6 is more severe than for the less potent counterpart with a faster k6.",
    "We were able to find reasonable estimates of Ki* when the contribution of nonlinearity was significantly smaller than covalent adduct dissociation (kctrl << k6). Preincubation time–dependent inhibition (Method III) is a more suitable method to analyze two-step reversible inhibition affected by enzyme instability: it is possible to algebraically correct for enzyme instability in this method (Data Analysis 3C).",
    "<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/a07d5e6e-3ba9-49b1-87ab-d2f93700ead5/cpz1419-fig-0009-m.jpg</p>\nFigure 9\nData Analysis 1C: Progress curve analysis for two-step reversible covalent inhibition is not compatible with spontaneous enzyme degradation/denaturation. Simulated with KinDeg for inhibitor B with 1 pM enzyme and 100 nM substrate S1. (A) Schematic enzyme dynamics during incubation for two-step reversible covalent inhibition with spontaneous loss of enzyme activity due to degradation/denaturation. (B) Time-dependent product formation in absence of inhibitor Fctrl is not linear because kctrl > 0. The progress curve for each inhibitor concentration is fitted individually to Equation II (Fig. 5C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0005]) to obtain the observed rate of inactivation kobs and steady-state velocity vs. Simulated for kctrl = 0.00003 s−1. (C) Inhibitor concentration–dependent kobs is driven by spontaneous enzyme degradation at low inhibitor concentrations, thus lowering the Y-intercept (kmin approaches kctrl). Ignoring the nonlinearity in the uninhibited control kctrl results in poor fits with underestimation of k6 even if kctrl is slower than k6. Simulated for kctrl = kdegE = kdegES = kdegEI = kdegEI* with kctrl = 0.000003 s−1 (left), kctrl = 0.00003 s−1 (middle) and kctrl = 0.0003 s−1 (right). (D) Final velocity vs has been ‘contaminated’ by the contribution of irreversible inactivation to the time-dependent inhibition, and approaches vs = 0 at low inhibitor concentrations. Final velocity vs no longer reflects the steady-state equilibrium: IC50 is larger than Ki*app (underestimation of steady-state potency) unless kctrl is much smaller than k6.",
    "Processing of raw data obtained with Basic Protocol I for two-step reversible covalent inhibitors.\n1. Plot signal F against incubation time t.\nPlot signal (in AU) on the Y-axis against incubation time (in s) on the X-axis for each inhibitor concentration and the controls (Fig. 8B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0008]). Product formation in the uninhibited control Fctrl should be linear. Consult Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-tbl-0003] for troubleshooting of nonlinearity of the uninhibited control. Optionally, perform background correction to correct for assay artifacts such as bleaching and drift that cause a negative final velocity (vs < 0 AU/s) in the fully inhibited control. This correction can be subtraction of the background in the presence of substrate (and inhibitor) but absence of enzyme, or subtraction of the fully inhibited control.\n2. Fit Ft against t to obtain kobs and vs.\nFit signal Ft against incubation time t to Equation II (Fig. 8B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0008]) to obtain final product formation velocity vs (in AU/s) and the observed reaction rate kobs (in s−1) from initial equilibrium vi to steady-state equilibrium vs. Do not constrain initial velocity vi or final velocity vs. Also fit the progress curve of the uninhibited control (Fctrl) to validate that product formation is strictly linear (victrl = vsctrl), because algebraic correction for nonlinearity in the uninhibited control is not possible (Fig. 9[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0009]). The observed rate kobs (in s−1) reflects the exponential reaction rate from initial noncovalent equilibrium (vi) to final steady-state equilibrium (vs).\n         \nformula:\n\\begin{equation} {F_{\\rm {t}}} = \\;{{\\rm{v}}_{\\rm{s}}}t + \\frac{{{{\\rm{v}}_{\\rm{i}}} - {{\\rm{v}}_{\\rm{s}}}}}{{{k_{{\\rm{obs}}}}}}\\left[ {1 - {e^{ - {k_{{\\rm{obs}}}}t}}} \\right] + {F_0} \\end{equation}",
    "Equation II for nonlinear regression of user-defined explicit equation Y = (vs*X) + (((vi-vs)/kobs)*(1-EXP(-kobs*X))) + Y0 with Y = signal Ft (in AU) and X = incubation time t (in s) to find Y0 = Y-intercept F0 = background signal at t = 0 (in AU), vi = initial slope (in AU/s), vs = final slope (in AU/s), and kobs = observed reaction rate kobs (in s−1).\n3. Plot and fit vs against [I] to obtain Ki*app.\nApparent steady-state inhibition constant Ki*app (in M) can be calculated from the final velocity vs (obtained in the previous step) reflecting enzyme activity after reaching the steady-state inhibitor equilibrium (reaction completion). Plot the mean and standard deviation of vs (in AU/s) on the Y-axis against inhibitor concentration (in M) on the X-axis and fit to four-parameter nonlinear regression Hill Equation X (Copeland, 2013e[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0015]) to obtain apparent steady-state inhibition constant Ki*app (in M) (Fig. 8D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0008]). Constrain the top to uninhibited velocity vctrl (maximum velocity = vSmax) and the bottom to the fully inhibited vs (vsmin, minimum velocity). For (background-) corrected product formation, vsmin = 0. Accurate values are only obtained when uninhibited product formation is strictly linear (kctrl = 0) or when the rate of spontaneous inactivation kctrl is much smaller than the covalent dissociation k6 (Fig. 9[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0009]). Validate that vs is not driven by spontaneous enzyme degradation (kctrl << k6) by also fitting without constraints for vSmax. Calculate steady-state inhibition constant Ki* (in M) with Sample Calculation 7.\n         \nformula:\n\\begin{equation} {{\\rm{v}}_{\\rm{s}}} = {\\rm{v}}_{\\rm{s}}^{{\\rm{min}}} + \\frac{{{{\\rm{v}}^{{\\rm{ctrl}}}} - {\\rm{v}}_{\\rm{s}}^{{\\rm{min}}}}}{{1 + {{\\left( {\\frac{{\\left[ {\\rm{I}} \\right]}}{{{\\rm{K}}_{\\rm{i}}^{{\\rm{*app}}}}}} \\right)}^h}}} \\end{equation}",
    "Equation X for nonlinear regression of four-parameter dose-response equation Y = Bottom + (Top-Bottom)/(1 + (X/IC50)^HillSlope) with Y = final product formation velocity vs (in AU/s), X = inhibitor concentration (in M), Bottom = velocity in fully inhibited control vsmin (in AU/s) and Top = maximum velocity in uninhibited control vctrl (in AU/s) to find Hillslope = Hill coefficient h (unitless) and IC50 = apparent steady-state inhibition constant Ki*app (in M).\n4. Optional: Plot and fit kobs against [I] to obtain Kiapp, k5, and k6.",
    "This is an optional data processing step to obtain kinetic parameters by fitting to the observed rate kobs (obtained in Data Analysis 1C, step 2), and is used to validate Ki*app values found in the previous step, to check if nonlinearity in the uninhibited control kctrl (in s−1) affects the fit, and/or to generate experimental k5 and k6 values to use in kinetic simulations. Plot the mean and standard deviation of kobs (in s−1) on the Y-axis against inhibitor concentration (in M) on the X-axis (Fig. 8C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0008]). Exclude kobs of uninhibited control (kctrl) from the fit. Fit kobs against inhibitor concentration to Equation XI to obtain rate constants for the covalent association k5 (in s−1) and covalent dissociation k6 (in s−1), as well as apparent noncovalent inhibition constant Kiapp (in M) reflecting the rapid (initial) noncovalent equilibrium. Use the inhibitor concentration after reaction initiation by enzyme addition (in the final solution). Accurate values are only obtained when uninhibited product formation is strictly linear (kctrl = 0). Y-intercept approaching kctrl despite the uninhibited control not being included in the fit is a red flag that should not be ignored, as this is indicative of spontaneous enzyme degradation rather than k6 dominating kobs at low inhibitor concentrations, for which algebraic corrections are not available (Fig. 9[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0009]). Calculate noncovalent inhibition constant Ki (in M) with Sample Calculation 3 and proceed to calculate steady-state inhibition constant Ki* (in M) with Sample Calculation 8. Optionally, perform step 6 of Data Analysis 1A to obtain apparent noncovalent inhibition constant Kiapp (in M) from the initial velocity vi (obtained in Data Analysis Protocol 1C step 2).\n         \nformula:\n\\begin{equation} {k_{{\\rm{obs}}}} = {k_6} + \\frac{{{k_5}{\\rm{\\;}}\\left[ {\\rm{I}} \\right]}}{{{{\\rm{K}}_{\\rm{i}}}^{{\\rm{app}}} + \\left[ {\\rm{I}} \\right]}} \\end{equation}",
    "Equation XI for nonlinear regression of user-defined explicit equation Y = Y0 + ((kmax*X)/((Kiapp) + X)) with Y = observed reaction rate kobs (in s−1) and X = inhibitor concentration (in M) to find Y0 = covalent dissociation rate constant k6 (in s−1), kmax = covalent association rate constant k5 (in s−1) and Kiapp = Apparent inhibition constant Kiapp (in M).\n5. Optional: Validate experimental kinetic parameters with kinetic simulations.\nProceed to Kinetic Simulations 1 to compare the experimental progress curves to the progress curves simulated with scripts KinGen and KinDeg to confirm that the calculated kinetic constants are in accordance with the experimental data. Experimental estimates of k5 and k6 are generated in the previous step of this protocol.\nData Analysis 1D: Algebraic Correction for Substrate Depletion in Progress Curve Analysis for Two-Step Irreversible Covalent Inhibition\nScientists from BioKin and Pfizer (Kuzmič et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0045]) derived an algebraic model for two-step irreversible covalent inhibitors to correct for nonlinearity caused by substrate depletion (Fig. 10A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0010]). Substrate depletion causes a nonlinearity in the uninhibited control because the unbound substrate concentration is no longer constant ([S]t < [S]0) when a significant fraction of the substrate has been converted into product ([P]t > 0.1[S]0). The contribution of substrate depletion to the progress curve is directly related to the enzyme activity, as >10% substrate conversion is more likely to be exceeded when enzyme activity is high (Fig. 10B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0010]). Algebraic correction is performed by globally fitting all progress curves in presence of inhibitor to Equation III with shared values for kinact and KIapp (Fig. 10C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0010] and 10D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0010]). Substrate depletion should be the only factor contributing to nonlinearity, because the uninhibited control is not included in the global fit. Violation of this (and other) assumption requires data analysis by numerical solving (Kuzmič, 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0042]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/aff989d4-424d-49f0-bbf4-c4da7b31be6a/cpz1419-fig-0010-m.jpg</p>\nFigure 10",
    "Data Analysis 1D: Algebraic correction for substrate depletion in progress curve analysis for two-step irreversible covalent inhibition. Simulated with KinSubDpl for inhibitor C with 100 pM enzyme and 10 nM substrate S1. (A) Enzyme dynamics for two-step irreversible covalent inhibition. Algebraic correction for substrate depletion is restricted to a Hit-and-Run model (E + S → E + P) for product formation. (B) Substrate depletion ([P]t > 0.1[S]0, blue area) results in a decrease of product formation in the uninhibited control (solid line) compared to product formation, assuming substrate conversion does not affect product formation rates (dashed line, simulated with KinGen). The contribution of substrate depletion to nonlinearity increases with higher enzyme activity (less inhibition). (C) Time-dependent product formation in the absence of inhibitor Fctrl or in presence of inhibitor with time-dependent loss of enzyme activity due to substrate depletion. Inhibitor-treated progress curves are globally fitted to Equation III with shared values for kinact and KIapp. (D) Equation III. Algebraic model to correct for substrate depletion at low substrate concentrations (Kuzmič et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0045]). F0 = Y-intercept = background signal at reaction initiation (in AU). rP = product coefficient for detected signal F per formed product [P] (in AU/M). ksub = reaction rate constant for Hit-and-Run model of enzymatic product formation E + S → E + P (in M−1s−1).\nWarnings and remarks",
    "The authors demonstrate their algebraic model to correct for substrate depletion with the EGFR inhibitor afatinib in a homogeneous kinase activity assay. A bisubstrate kinase activity assay is different from our simulations with a single substrate, but this algebraic model can be applied in both systems: product formation in single-substrate as well as bisubstrate reactions can be simplified to a Hit-and-Run model (E + S → E + P) with rate constant ksub = kcat/KM (in M−1s−1) as long as the substrate concentration is far below its KM ([S] < 0.1KM) (Fig. 10A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0010]). The accuracy of kinact and KI was very good with low substrate concentrations ([S] ≤ 0.01KM). A slightly higher substrate concentration ([S] ≥ 0.1KM) resulted in underestimation of kinact and overestimation of KI, but a good estimation of overall second-order inactivation rate constant kinact/KI. Importantly, a calibration/titration (Dharadhar et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0020]; Janssen et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0031]) should be performed prior to data analysis to determine product coefficient rP (in AU/M) that transforms the detected signal Ft (in AU) into product concentration [P]t (in M).",
    "Processing of raw data obtained with Basic Protocol I for two-step irreversible covalent inhibitors with nonlinearity in the uninhibited control resultant from substrate depletion ([P]t < 0.1[S]0).\nBefore you start, validate compliance with essential assay reaction conditions such as the Hit-and-Run model. This algebraic correction for substrate depletion (Kuzmič et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0045]) has additional requirements for assay conditions, and is only compatible with two-step irreversible inhibition (Fig. 10[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0010]). Validate that the product formation reaction complies with the Hit-and-Run model E + S → E + P (Fig. 10A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0010]): substrate concentration must be far below the KM ([S]0 < 0.1KM) to calculate the pseudo-first order reaction rate constant for enzymatic product formation ksub = kcat/KM (M−1s−1). Observed nonlinearity in the uninhibited control should be fully attributed to substrate depletion. Convert the maximum signal Fctrl (in AU) into product concentration (in M) using the product coefficient rP (in AU/M product) as determined in a separate product calibration experiment (Dharadhar et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0020]; Janssen et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0031]). Validate that the total substrate conversion to product exceeds 10% of the initial substrate concentration ([Pctrl]t > 0.1[S]0), and that substrate depletion is the only factor that contributes to the observed nonlinearity: uninhibited product formation should be linear when incubation times are shorter ([P]t < 0.1[S]0) or enzyme concentration is lower. Alternatively, perform kinetic analysis by numeric solving if one or more assumptions are violated (Kuzmič, 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0042]).\n         formula:\n\\begin{equation*} {\\left[ {\\rm{P}} \\right]_t} = \\frac{{{F_{\\rm {t}}} - {F_0}}}{{{r_{\\rm{P}}}}} \\end{equation*}\nCalculate: Pt=(Ft-F0)/rp with Pt = product concentration at the end of the incubation [P]t (in M), Ft = signal in uninhibited control at the end of the incubation time Ft (in AU), F0 = substrate background signal F0 (in AU) and rp = product coefficient rP (in AU/M product).\n1. Plot signal F against incubation time t.",
    "Plot signal (in AU) on the Y-axis against incubation time (in s) on the X-axis for each inhibitor concentration (Fig. 10C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0010]). Label the columns with the inhibitor concentration (in M).\n2. Perform background correction.\nCorrect for assay artifacts such as fluorescence bleaching and drift that cause a declining signal in the fully inhibited control. This correction can be subtraction of the time-dependent background in absence of enzyme but in presence of substrate (and inhibitor), or subtraction of the fully inhibited control. Consult the guidelines of your data fitting software for instructions on background corrections (GraphPad Prism; see Internet Resources).\n3. Globally fit Ft against t to obtain kinact and KIapp.\nGlobally fit the progress curves of time-dependent signal Ft for all inhibitor concentrations to Equation III. Exclude the dataset of the fully inhibited control from the fit. Constrain [E]0 (in M), [S]0 (in M), and [I] = [I]0 (in M) to their theoretical values. Originally, [I]0 was locally optimized (Kuzmič, 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0042]), but we used fixed values of [I]0 in GraphPad Prism. Constrain product coefficient rP (in AU/M product) to the value determined in a separate product calibration experiment. Constrain kinact, KI, and ksub to a shared value for all datasets that must be greater than 0, and provide initial values that are in the anticipated range. Note that Equation III is in agreement with equation C.16 of the original publication (Kuzmič et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0045]), but [I]0 and kinact were unintentionally displaced in Equation III. Calculate inactivation constant KI (in M) and irreversible covalent inhibitor potency kinact/KI (in M−1s−1) with Sample Calculations 1 and 2.\n         \nformula:",
    "\\begin{eqnarray} {F_{\\rm {t}}} &amp;&amp;= {F_0} + {r_{\\rm{P}}}{\\left[ {\\rm{S}} \\right]_0}\\left\\{ {1 - {e^{ - \\beta \\left( {1 - {e^{ - \\alpha t}}} \\right)\\;}}} \\right\\}\\nonumber\\\\ \\alpha &amp;&amp;= \\frac{{{k_{{\\rm{inact}}}}{\\rm{\\;}}\\left[ {\\rm{I}} \\right]}}{{{{\\rm{K}}_{\\rm{I}}}^{{\\rm{app}}} + \\left[ {\\rm{I}} \\right]}}\\nonumber\\\\ \\beta &amp;&amp;= \\left( {\\frac{{{{\\left[ {\\rm{E}} \\right]}_0}\\;{k_{{\\rm{sub}}}}}}{{{k_{{\\rm{inact}}}}}}} \\right)\\left( {\\frac{{{{\\rm{K}}_{\\rm{I}}}^{{\\rm{app}}}}}{{\\left[ {\\rm{I}} \\right]}}} \\right)\\nonumber\\\\ \\end{eqnarray}\nEquation III for nonlinear regression of user-defined explicit equation:\n         \na = kinact*I0/(I0+KIapp)\nb = (E0*ksub/kinact)*(KIapp/I0)\nP = S0*(1−exp(−b*(1−exp(−a*X))))\nY = Y0+(rp*P)\nwith Y = time-dependent signal Ft (in AU), X = incubation time t (in s), rp = product coefficient rP (AU/M product), E0 = maximum unbound enzyme concentration at reaction initiation [E]0 (in M), S0 = maximum unbound substrate concentration at reaction initiation [S]0 (in M) and I0 = maximum unbound inhibitor concentration [I] (in M) to find globally shared values for ksub = product formation rate constant ksub = kcat/KM (in M−1s−1), kinact = maximum rate of inactivation kinact (in s−1) and KIapp = apparent inactivation constant KIapp (in M).\n4. Optional: Validate experimental kinetic parameters with kinetic simulations.\nProceed to Kinetic Simulations 1 to compare the experimental progress curves to the progress curves simulated with script KinSubDpl (using experimental rate constant kinact = k5) to confirm that the calculated kinetic constants are in accordance with the experimental data.",
    "The below protocol provides a generic set of steps to accomplishing this type of measurement.\nMaterials\n1× Assay/reaction buffer supplemented with co-factors and reducing agent\nActive enzyme, 4× solution in assay buffer\nCompetitive substrate with continuous or quenched read-out, 4× solution in assay buffer\nPositive control: vehicle/solvent as DMSO stock, or 2% solution in assay buffer\nNegative control: known inhibitor or alkylating agent as DMSO stock, or 2× solution in assay buffer\nInhibitor: as DMSO stock, or serial dilution of 2× solution in assay buffer with 2% DMSO\nOptional: Development/quenching solution\n384-well low volume microplate with nonbinding surface (e.g., Corning 3820 or 4513) for incubation and/or read-out\nOptical clear cover/seal (e.g., Perkin Elmer TopSeal-A Plus, #6050185, Corning 6575 Universal Optical Sealing Tape or Duck Brand HP260 Packing Tape) for continuous read-out, or a general microplate cover/lid (e.g., Corning 6569 Microplate Aluminum Sealing Tape) for non-continuous read-out\n1.5 ml (Eppendorf) microtubes to prepare stock solutions\nOptional: 96-well microplate to prepare serial dilution of inhibitor concentration\nOptional: Microtubes to perform incubations (e.g., Eppendorf Protein Lobind Microtubes, #022431018)\nMicroplate reader equipped with appropriate filters to detect product formation (e.g., CLARIOstar microplate reader)\nOptional: Automated (acoustic) dispenser (e.g., Labcyte ECHO 550 Liquid Handler acoustic dispenser)",
    "Before you start, optimize assay conditions in the uninhibited control to ensure compliance with assumptions and restrictions (Fig. 13[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0013]) as outlined for Basic Protocol I. It is crucial to ensure that uninhibited product formation is linear with incubation time for the duration of the measurement: no enzyme degradation (kdeg = 0) or other factors contributing to a nonlinearity in product formation in the uninhibited control (kctrl = 0) are allowed, as correction for nonlinearity is not possible in Data Analysis 2. This method is compatible with homogeneous (continuous) assays but also with assays that require a development/quenching step to visualize formed product.\n1. Add inhibitor or control (e.g., 0.2 µl) and assay buffer (e.g., 10 µl) to each well with the uninhibited control for full enzyme activity containing the same volume of vehicle/solvent instead of inhibitor as outlined in step 1 of Basic Protocol I.\nTypically, measurements are performed in triplicate (or more replicates) with at least 8 inhibitor concentrations spanning the IC50(t). Inhibitor concentrations might need optimization, but a good starting point is [I] = 0.1-5 × IC50(t) at the shortest incubation time t. Alternatively, larger-volume incubations can be performed in (Eppendorf) Protein Lobind microtubes, from which aliquots are transferred to a microplate after the indicated incubation time. Whether incubation in tube or plate is performed is a matter of personal preference, compatibility with lab equipment and automation, and convenience of dispensing small volumes\n2. Add substrate in assay buffer to each well (e.g., 5 µl of 4× solution) and homogenize the solutions by gentle shaking (1 min at 300 rpm).",
    "The order of substrate or inhibitor addition is not important per se, as long as DMSO stocks are added prior to buffered (aqueous) solutions and the enzyme is the last reagent to be added, to avoid unintentional preincubation (Fig. 13A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0013]). Inhibitor binding mode must be competitive with substrate. Optionally, gently centrifuge the plate or microtubes (1 min at 1000 rpm) to ensure assay components are not stuck at the top of the well.\n3. Add active enzyme in assay buffer to each well (e.g., 5 µl of 4× solution) or tube as outlined in step 3 of Basic Protocol I.\nThe accuracy of the measurement improves if the incubation time is monitored precisely.\n4. Seal the wells by applying an (optical clear) cover or lid, or close the caps of microtubes to prevent evaporation of assay components during incubation.\n5. Optional: Transfer aliquots (e.g., 20 µl) from the reaction mixture to the microplate after each time point, if incubation is performed in large volumes (in Protein Lobind microtubes or 96-well NBS plate) rather than incubation of replicates in a 384-well microplate.\n6. Quenching: Add development solution to the reaction mixture in the microplate to quench the product formation reaction for assay formats that require a development/quenching step to visualize formed product.\nIncubation time t is the elapsed time between reaction initiation by enzyme addition (step 3) and (optional) quenching of the enzyme activity by addition of development/quenching solution (step 6).\n7. Measure formed product after incubation by detection of the product read-out in microplate reader.",
    "Follow manufacturer's advice on waiting time after addition of development solution before read-out. A typical assay measurement window is >2 hr, measuring cumulative product formation every 5-30 min (Fig. 11[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0011]). The best results are obtained when inhibitor concentrations cover at least 50% of the DRC at all incubation times (Fig. 12C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0012]) and there is a significant decrease from the earliest to the last IC50(t) value (Fig. 12D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0012]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/09e5ac73-6bd4-4754-b1d1-50e65b300c87/cpz1419-fig-0012-m.jpg</p>\nFigure 12\nData Analysis 2: Incubation time–dependent potency IC50(t) for two-step irreversible covalent inhibition. Simulated with KinGen for inhibitor C with 1 pM enzyme and 100 nM substrate S1. (A) Schematic enzyme dynamics during incubation for two-step irreversible covalent inhibition. (B) Time-dependent cumulative product formation in absence of inhibitor Fctrl or in presence of inhibitor Ft is detected with longer measurement intervals compatible with quenched assays. (C) Incubation time-dependent potency IC50(t) reflects the inhibitor concentration that reduces cumulative product formation during incubation by 50% compared to the uninhibited control. (D) Incubation time–dependent potency IC50(t) against incubation time is fitted to Equation IV. IC50(0) approaches apparent noncovalent inhibition constant Kiapp but IC50(0) is never included in the fit because product formation does not start until initiation of the incubation (F0 = Fctrl = 0). (E) Implicit algebraic Equation IV (Krippendorff et al., 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0040]).\n8. Proceed to Basic Data Analysis Protocol 2 to calculate relevant kinetic parameters for two-step irreversible covalent inhibition\n \n         \ntable:\n﻿Unnamed: 0_level_0,Data Analysis Protocol,Data Analysis Protocol,Data Analysis Protocol\nEXP Conditions,2-step IRREV,1-step IRREV,2-step REV\nkctrl = 0,2,–,–\nExemplary assay concentrations.\n         \ntable:\n﻿Unnamed: 0,Concentration during incubation t,Concentration during incubation t.1,Concentration during incubation t.2\n,[stock],V (µl),[conc]t\nEnzyme,4 nM,5,0.99 nM\nInhibitor,20 nM,10.2,10.10 nM\nSubstrate,4 µM,5,0.99 µM\nTotal,,20.2,\nData Analysis 2: Incubation Time–Dependent Potency IC50(t) for Two-Step Irreversible Covalent Inhibition",
    "Krippendorff and co-workers report an algebraic model to calculate kinact and KI of irreversible covalent inhibitors from the incubation time–dependent potency IC50(t) after multiple incubation times (Krippendorff et al., 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0040]). Detection of cumulative product formation after several incubation times is compatible with continuous assays, but more importantly also with stopped/quenched assays that require a development step to visualize product formation (Fig. 12A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0012] and 12B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0012]). Incubation time–dependent potency IC50(t) is calculated for each incubation time from fractional product formation Ft/Fctrl (Fig. 12C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0012]) and plotted against the incubation time (Fig. 12D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0012]). Finally, the authors derived implicit algebraic Equation IV (Fig. 12E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0012]) to calculate kinact and KI from the incubation time–dependent potency IC50(t). This method is restricted to substrate-competitive irreversible (multi-step) covalent inhibitors: kinact and KI do not have a biological meaning for reversible inhibitors or for one-step covalent inhibitors.\nWarnings and remarks\nThis method requires software (e.g., GraphPad Prism) that allows fitting a model defined by an implicit equation (where Y appears on both sides of the equal sign). Product formation in the uninhibited control should be strictly linear (kctrl = 0): normalization of cumulative product formation (Ft/Fctrl) does not correct for spontaneous loss of enzyme activity or substrate depletion. It is relatively easy to miss violations of this assumption because nonlinearity in the uninhibited control (kctrl > 0) is not evident from visual inspection of the dose-response curves (Fig. 12B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0012]). Violation of this assumption results in a significant underestimation of kinact and KI values, also when nonlinearity is relatively small (kctrl << kinact) (Fig. 13A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0013]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/3b4cd22c-1dec-4acc-99fb-bb0e1a19d24c/cpz1419-fig-0013-m.jpg</p>\nFigure 13",
    "Experimental Restrictions to fitting Equation IV (Fig. 12E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0012]) in Data Analysis 2. (A) Enzyme degradation/denaturation simulated with KinDeg for inhibitor C with 1 pM enzyme, 100 nM substrate S1, and kctrl = kdegE = kdegES = kdegEI = kdegEI* with kctrl = 0 s−1 (black) or kctrl = 0.0003 s−1 (gray). The rate of inactivation kinact is significantly underestimated and the potency of inactivation constant KI is overestimated when kctrl > 0. (B) Preincubation time–dependent potency IC50(t′) simulated with KinGen for inhibitor C with 1 pM enzyme and 100 nM substrate S1. The rate of inactivation kinact is overestimated, resulting in overestimation of the inactivation efficiency kinact/KI when preincubation-dependent IC50(t′) (gray) is fitted instead of incubation-dependent IC50(t) (black). Accurate values for preincubation-dependent potency can be obtained by performing Data Analysis 3A (Fig. 15[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015]). (C) Ligand binding assay simulated with KinGen for inhibitor C with 1 pM enzyme and 100 nM ligand L1. The rate of inactivation kinact is overestimated while the potency of inactivation constant KI is underestimated, resulting in overestimation of the inactivation efficiency kinact/KI when time-dependent IC50(t) from ligand binding inhibition (gray) is fitted instead of substrate cleavage (black).",
    "Another important assumption is that the onset of product formation and enzyme inhibition occur simultaneously: inhibition and product formation are both initiated by addition of enzyme, without preincubation of enzyme and inhibitor prior to substrate addition. Unfortunately, numerous publications refer to preincubation of enzyme and inhibitor as ‘incubation’, resulting in the understandable but incorrect fitting of preincubation time–dependent potency IC50(t′) to the Krippendorff model (Kuzmič, 2020b[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0044]). Preincubation-dependent potency IC50(t′) is calculated from product formation velocity vt′, reflecting the enzyme activity after preincubation rather than cumulative product formation Ft/Fctrl. Enzyme activity vt′ is not ‘contaminated’ by product formed prior to read-out because product formation is initiated after the preincubation. Furthermore, substrate does not compete with inhibitor for enzyme binding during preincubation. Fitting IC50(t′) values to the Krippendorff model resulted in an overestimation of kinact and an overestimation of the overall inactivation potency kinact/KI (Fig. 13B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0013]).\nThis method is not compatible with ligand binding competition assays (such as the Lanthascreen kinase binding assay) where inhibitor binding competes with ligand (tracer) binding to form enzyme-ligand complex EL as the detectable product (Fig. 13C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0013]). The enzyme-ligand equilibrium after incubation in presence of inhibitor reflects the current inhibitor competition and is unaffected by binding equilibria prior to read-out (not cumulative). Furthermore, unbound enzyme is not released after formation of product EL, thereby limiting the product formation to a single turnover per enzyme. Fitting IC50(t) values obtained in ligand-binding assays (simulated with kcat = 0) to the Krippendorff model result in overestimation of kinact and/or unstable parameters.",
    "Processing of raw data obtained with Basic Protocol I or Basic Protocol II for two-step irreversible covalent inhibitors.\n1. Plot signal F against incubation time t.\nPlot cumulative signal (in AU) on the Y-axis against incubation time (in s) on the X-axis for each inhibitor concentration and for the controls (Fig. 12B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0012]). Label the columns with the inhibitor concentration (in M). It is not possible to algebraically correct for spontaneous loss of enzyme activity. Validate that the product formation in the uninhibited control Fctrl is linear (vi = vs) by performing steps 1-3 of Basic Data Analysis Protocol 1A with kobs = kctrl. Consult Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-tbl-0003] for troubleshooting of nonlinearity of the uninhibited control.\n2. Perform background correction.\nCorrect for assay artifacts such as fluorescence bleaching and drift that cause a declining signal in the fully inhibited control. This correction can be subtraction of the time-dependent background in absence of enzyme but in presence of substrate (and inhibitor), or subtraction of the fully inhibited control.\n3. Transpose to plot signal F against inhibitor concentration [I].\nFor each incubation time, transpose the X and Y values to plot signal Ft (in AU) on the Y-axis against inhibitor concentration (in M) on the X-axis. Also include product formation in the uninhibited control Fctrl ([I] = 0).\n4. Normalize Ft/Fctrl.\nNormalize Ft (in AU) to lowest value = 0 (in AU) and highest value = uninhibited product formation Fctrl (in AU) to obtain fractional product formation in presence of inhibitor Ft/Fctrl (Fig. 12C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0012]). Consult the guidelines of your data fitting software for instructions on data normalization to the positive and negative controls (GraphPad; see Internet Resources).\n5. Plot and fit Ft/Fctrl against [I] to obtain the incubation time–dependent potency IC50(t).",
    "Plot the dose-response curve of fractional signal Ft/Fctrl against inhibitor concentration (in M), and fit to four-parameter nonlinear regression Hill Equation XII (Copeland, 2013e[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0015]) to obtain the incubation time–dependent potency IC50(t) (in M) (Fig. 12C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0012]). Use the inhibitor concentration during incubation: after reaction initiation by enzyme addition but before (optional) addition of development solution (Basic Protocol II, step 3).\n         \nformula:\n\\begin{equation} \\frac{{{F_{\\rm {t}}}}}{{{F^{{\\rm{ctrl}}}}}} = \\frac{1}{{1 + {{\\left( {\\frac{{{\\rm{I}}{{\\rm{C}}_{50}}\\left( t \\right)}}{{\\left[ {\\rm{I}} \\right]}}} \\right)}^h}}} \\end{equation}\nEquation XII for nonlinear regression of four-parameter dose-response equation Y = Bottom + (Top-Bottom)/(1 + (IC50/X)^HillSlope) with Y = fractional product signal Ft/Fctrl (unitless), X = inhibitor concentration [I] (in M), Bottom = normalized fully inhibited product signal = 0 (unitless), and Top = normalized uninhibited product signal Fctrl /Fctrl = 1 (unitless) to find Hillslope = Hill coefficient h (unitless) and IC50 = incubation time–dependent potency IC50(t) (in M).\n6. Plot and fit IC50(t) against t to obtain kinact and KI.",
    "Plot the mean and standard deviation of IC50(t) (in M) on the Y-axis against incubation time t (in s) on the X-axis (Fig. 12D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0012]). The rate of covalent bond formation at saturating inhibitor concentration kinact and inactivation constant KI are obtained by solving implicit Equation IV (Krippendorff et al., 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0040]) (Fig. 12E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0012]). Use the substrate concentration during incubation (Basic Protocol II, step 3): after reaction initiation by enzyme addition but before (optional) addition of development/quenching solution. It is important that the Michaelis constant KM be accurate for the reaction conditions (buffer, temperature, substrate), as this value is directly used to correct inactivation constant KI for substrate competition. Consult the guidelines of your data-fitting software (GraphPad; see Internet Resources for website) for instructions on solving implicit equations (where Y appears on both sides of the equal sign). Proceed to Sample Calculation 2 to calculate irreversible covalent inhibitor potency kinact/KI (in M−1s−1) with propagation of error.\n         \nformula:\n\\begin{equation} {\\rm{I}}{{\\rm{C}}_{50}}\\left( t \\right) = {\\rm{\\;}}{{\\rm{K}}_{\\rm{I}}}\\left( {1 + \\frac{{{{\\left[ {\\rm{S}} \\right]}_0}}}{{{{\\rm{K}}_{\\rm{M}}}}}} \\right)\\left( {\\frac{{2 - 2{{\\rm{e}}^{ - {\\rm{\\eta }}{k_{{\\rm{inact}}}}t}}}}{{{\\rm{\\eta }}{k_{{\\rm{inact}}}}t}} - 1} \\right){\\rm{\\;\\;}}with{\\rm{\\;\\;\\eta }} = \\frac{{{\\rm{I}}{{\\rm{C}}_{50}}\\left( t \\right)}}{{{{\\rm{K}}_{\\rm{I}}}\\left( {1 + \\frac{{{{\\left[ {\\rm{S}} \\right]}_0}}}{{{{\\rm{K}}_{\\rm{M}}}}}} \\right) + {\\rm{I}}{{\\rm{C}}_{50}}\\left( t \\right)}} \\end{equation}\nEquation IV for nonlinear regression of user-defined implicit equation Y=(KI*(1+(S/KM)))*(((2-(2*EXP(- (Y/((KI*(1+(S/KM)))+Y))*kinact*X)))/((Y/((KI*(1+(S/KM)))+Y))*kinact*X))-1), with Y = incubation time–dependent potency IC50(t) (in M), X = incubation time t (in s), S = maximum unbound substrate concentration at reaction initiation [S]0 (in M), and KM = Michaelis constant KM (in M) to find kinact = inactivation rate constant kinact (in s−1) and KI = inactivation constant KI (in M).\n7. Optional: Validate experimental kinetic parameters with kinetic simulations.",
    "Proceed to Kinetic Simulations 1 to compare the experimental read-out to the product formation simulated with scripts KinGen and KinDeg (using experimental rate constant kinact = k5) to confirm that the calculated kinetic constants are in accordance with the experimental data and found IC50(t) values.",
    "Before you start, optimize assay conditions in the uninhibited control to ensure compliance with assumptions and restrictions, as outlined in the Critical Parameters: Assumptions on Experimental Assay Conditions section and Basic Protocol I. Consult Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-tbl-0003] in the troubleshooting section for common optimization and troubleshooting options. Specific adjustments for Method III are that substrate concentration should be relatively low ([S]0 << KM) to minimize disruption of the noncovalent E + I <-> EI equilibrium or reduction of reaction rates by competition (Fig. 14A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0014]); adjustment of the enzyme concentration might be required to ensure that maximum 10% of the substrate is processed during the read-out ([P]t < 0.1[S]0) and product formation is linear in the uninhibited control. Furthermore, incubation time t must be relatively short to minimize additional time-dependent enzyme inhibition after substrate addition. As a rule of thumb, incubation must be much shorter than the shortest preincubation (t << t′), unless the product formation read-out is continuous (more details in Data Analysis 3, step 3). Validate that enough product is formed for a good signal/noise ratio (Z′ > 0.5) by calculating the Z′-score from the uninhibited and inhibited controls (ideally 8 replicates) in a separate experiment (Zhang et al., 1999[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0086]). This method is compatible with homogeneous (continuous) assays but also with assays that require a development/quenching step to visualize formed product. Note that this protocol was designed for preincubation and read-out in a 384-well microplate.\n1. Add inhibitor or control (e.g., 0.2 µl) and assay buffer (e.g., 10 µl) to each well with the uninhibited control for full enzyme activity containing the same volume vehicle/solvent instead of inhibitor as outlined in step 1 of Basic Protocol I.",
    "Gently shake to mix DMSO with the aqueous buffer. Typically, measurements are performed in triplicate (or more replicates) with at least 8 inhibitor concentrations for at least 5 preincubation times. Inhibitor concentrations might need optimization, but a rational starting point is to use inhibitor concentrations below 5 times the IC50 at the shortest preincubation time t′: inhibition is expected to improve in a time-dependent manner and the best results are obtained when full inhibition is not achieved already at the shortest preincubation time (Fig. 14C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0014]). Alternatively, larger-volume preincubations (e.g., >200 µl) can be performed in (Eppendorf) microtubes from which aliquots (e.g., 20.2 µl) are transferred to a microplate after the indicated preincubation time. Whether preincubation is performed in a tube or microplate is a matter of personal preference, compatibility with lab equipment and automation, and convenience of dispensing small volumes.\n2. Add active enzyme in assay buffer to each well (e.g., 10 µl of 2× solution) or tube to start preincubation of enzyme with inhibitor and homogenize the solution by gently shaking (1 min at 300 rpm). Alternatively, dispensing the enzyme at a high flow rate will also mix the components.\nThe order of enzyme and inhibitor addition is not important per se, as long as DMSO stocks are added prior to buffered (aqueous) solutions. Inhibitor must be present in excess during preincubation ([I]0 > 10[E]0). Optionally, gently centrifuge the plate or microtubes (1 min at 1000 rpm) to ensure assay components are not stuck at the top of the well.\n3. Seal the wells with a cover or lid, and close the caps of microtubes to prevent evaporation of assay components during preincubation.\n4. Optional: Transfer aliquots (e.g., 20.2 µl) from the reaction mixture to the microplate after completion of preincubation if performed in larger volumes.",
    "5. Add substrate in assay buffer (e.g., 2 µl of 11× solution) to (at least) three designated replicates after preincubation time t′.\nTypically, preincubation can run anywhere from several minutes to hours depending on the enzyme stability and anticipated inhibitor potency, with superior accuracy if the preincubation time is monitored precisely. Substrate should be added in a negligible volume (Vsub < 0.1Vt′) to minimize disruption of the noncovalent equilibria by dilution (Vt = Vt′) (Fig. 14A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0014]). Because at steady-state the equilibrium can be disrupted by dilution in too much competitive substrate, keep the substrate volume Vsub and substrate concentration low ([S]0 < 0.1KM) for successful analysis of two-step reversible inhibitors (Data Analysis 3C). Optionally, homogenize the solutions by gentle shaking (300 rpm) and centrifuge the plate or microtubes (1 min at 1000 rpm) to ensure that assay components are not stuck at the top of the well.\n6. Quenching: Add development solution to the reaction mixture in the microplate to quench the product formation reaction if read-out of product formation requires a development/quenching step to visualize formed product after incubation time t.\nFollow manufacturer's advice on waiting time after addition of development solution before read-out. Incubation time t is the elapsed time between onset of product formation by substrate addition (step 5) and addition of development/quenching solution (step 6). A possible advantage to the use of a quenched assay is the possibility to store the samples after addition of quenching/development solution (step 6) and measure product formation (step 7) in all samples after completion of the final preincubation rather than performing multiple separate measurements (after each preincubation time).\n7. Measure formed product after incubation by detection of the product read-out in microplate reader.",
    "Incubation time (after substrate addition) is relatively short (t << LN(2)/kobs) to minimize additional (time-dependent) inhibition of enzyme activity during incubation (Fig. 14B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0014]).\n8. Repeat Basic Protocol III, steps 4-7 for at least another four preincubation times.\nPreincubation time t′ is the elapsed time between onset of inhibition by mixing enzyme and inhibitor (step 2) and addition of substrate (step 5). A typical preincubation assay consists of multiple hours of measuring enzyme activity every 5-30 min, depending on enzyme stability and inhibitor reaction rates. Best results are obtained if the incubation time t used to calculate enzyme activity is kept constant at all preincubation times.\n9. Proceed to Basic Data Analysis Protocol 3 to convert the raw experimental data into preincubation time–dependent enzyme activity.",
    "Processing of raw experimental data obtained with Basic Protocol III for all inhibitor binding modes illustrated in Figure 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0001].\n1. Plot signal F against incubation time t.\nPlot signal F (in AU) on the Y-axis against the incubation time (in s) on the X-axis for each inhibitor concentration and for the controls (Fig. 14B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0014]). Do this separately for each preincubation time. Proceed to step 3 of this protocol for continuous read-out assays that require a longer incubation time to produce enough product for a good signal/noise ratio.\n2. Fit Ft against t to obtain vt′.\nFit signal F (in AU) against incubation time t (in s) to Equation XIII (Fig. 15B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015]/Fig. 16B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016], left) to obtain preincubation time–dependent product formation velocity vt′ (in AU/s) from the linear slope. Consult Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-tbl-0003] for troubleshooting if product formation is not linear.\n         \nformula:\n\\begin{equation} {F_{\\rm {t}}} = {F_0} + {{\\rm{v}}_{\\rm{t^\\prime}}}t  \\end{equation}\nEquation XIII for nonlinear regression of straight line Y = YIntercept + Slope*X with Y = signal Ft (in AU) and X = incubation time t (in s) to find YIntercept = background signal at reaction initiation F0 (in AU) and Slope = preincubation time–dependent product formation velocity vt′ (in AU/s).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/48e79f58-6885-41f9-a228-c7497e3385c0/cpz1419-fig-0015-m.jpg</p>\nFigure 15",
    "Data Analysis 3A: Preincubation time–dependent inhibition without dilution for two-step irreversible covalent inhibition. Simulated with KinGen (A-D) or KinDeg (E-I) for inhibitor C with 1 pM enzyme and 100 nM substrate S1. (A) Schematic enzyme dynamics during preincubation in absence of substrate and during incubation after substrate addition for two-step irreversible covalent inhibition. (B) Time-dependent product formation after preincubation in absence of inhibitor Fctrl or in presence of inhibitor (t′ = 1800 s). Left: Enzyme activity after preincubation vt′ is obtained from the linear slope if the incubation time is relatively short (t << t′): gray area is excluded from the fit. Right: Enzyme activity after preincubation vt′ is obtained from the initial velocity of the exponential association progress curve of each inhibitor concentration. (C) Preincubation time–dependent enzyme activity vt′ is fitted to Equation V (Fig. 14D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0014]) (constraining vs = 0) for each inhibitor concentration to obtain observed rates of inactivation kobs. Alternatively, vt′ can be normalized to a fraction of the uninhibited enzyme activity vctrl. (D) Inhibitor concentration–dependent kobs reaches kinact at saturating inhibitor concentration (kmax = kinact). Half-maximum kobs = ½kinact is reached when inhibitor concentration equals the inactivation constant KI: no correction for substrate competition because vt′ reflects the enzyme activity after preincubation in absence of competing substrate. (E) Schematic enzyme dynamics during preincubation in absence of substrate and during incubation after substrate addition for two-step irreversible covalent inhibition with spontaneous enzyme degradation/denaturation. Simulated with kdegE = kdegES = kdegEI = 0.0003 s−1. (F) Uninhibited enzyme activity after preincubation vt′ctrl is not linear. Preincubation time–dependent enzyme activity vt′ is fitted to Equation V (Fig. 14D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0014]) (constraining vs = 0) for each inhibitor concentration to obtain observed rates of inactivation kobs, as well as fitting uninhibited activity vt′ctrl to obtain the rate of nonlinearity kctrl.",
    "(G) Inhibitor concentration-dependent kobs with spontaneous enzyme degradation increases with kctrl but the span from kmin (= kctrl) to kmax (= kinact + kctrl) still equals kinact. Fit with algebraic correction for nonlinearity (black line, kctrl > 0). Ignoring the nonlinearity (gray line, constrain kctrl = 0) results in underestimation of KI (overestimation of potency) and overestimation of kinact. (H) Normalized enzyme activity vt′/vctrl is fitted to Equation V (Fig. 14D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0014]) (constraining vs = 0) for each inhibitor concentration to obtain corrected observed rates of inactivation kobs. (I) Inhibitor concentration-dependent kobs has been corrected for enzyme degradation by fitting normalized enzyme activity vt′/vctrl and does not require further corrections.",
    "<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/666e55c7-4810-4b79-9a49-4715df030805/cpz1419-fig-0016-m.jpg</p>\nFigure 16",
    "Data Analysis 3B: Preincubation time–dependent inhibition without dilution for one-step irreversible covalent inhibition. Simulated with KinGen (A-D) or KinDeg (E-I) for inhibitor D with 1 pM enzyme and 100 nM substrate S1. (A) Schematic enzyme dynamics during preincubation in absence of substrate and during incubation after substrate addition for one-step irreversible covalent inhibition. (B) Time-dependent product formation after preincubation in absence of inhibitor Fctrl or in presence of inhibitor (t′ = 1800 s). Left: Enzyme activity after preincubation vt′ is obtained from the linear slope if the incubation time is relatively short (t << t′): gray area is excluded from the fit. Right: Enzyme activity after preincubation vt′ is obtained from the initial velocity of the exponential association progress curve of each inhibitor concentration. (C) Preincubation time–dependent enzyme activity vt′ is fitted to Equation V (Fig. 14D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0014]) (constraining vs = 0) for each inhibitor concentration to obtain observed rates of inactivation kobs. vi = vctrl for one-step irreversible inhibitors and two-step irreversible inhibitors at non-saturating concentrations ([I] << Kiapp). Alternatively, vt′ can be normalized to a fraction of the uninhibited enzyme activity vctrl. (D) Inhibitor concentration–dependent kobs increases linearly with inhibitor concentration, with kchem as the slope. No correction for substrate competition because vt′ reflects the enzyme activity after preincubation in absence of competing substrate. (E) Schematic enzyme dynamics during preincubation in absence of substrate and during incubation after substrate addition for one-step irreversible covalent inhibition with spontaneous enzyme degradation/denaturation. Simulated with kdegE = kdegES = kdegEI* = 0.0003 s−1. (F) Uninhibited enzyme activity after preincubation vt′ctrl is not linear: kctrl > 0. Preincubation time–dependent enzyme activity vt′ is fitted to Equation V (Fig. 14D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.",
    "419#cpz1419-fig-0014]) (constraining vs = 0 and shared value for vi = uninhibited enzyme activity without preincubation v0ctrl) for each inhibitor concentration to obtain observed rates of inactivation kobs, as well as fitting uninhibited activity vt′ctrl to obtain the rate of nonlinearity kctrl. (G) Inhibitor concentration–dependent kobs with spontaneous enzyme degradation/denaturation increases by kctrl. Fit with algebraic correction for nonlinearity (black line, kctrl > 0) or ignoring nonlinearity (gray line, constrain kctrl = 0). Ignoring the nonlinearity (assuming Y-intercept = 0) results in overestimation of kchem (steeper slope). (H) Normalized enzyme activity vt′/vctrl is fitted to Equation V (Fig. 14D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0014]) (constraining vs = 0 and Y-intercept = vi/v0ctrl = 1) for each inhibitor concentration to obtain corrected observed rates of inactivation kobs. (I) Inhibitor concentration-dependent kobs has been corrected for enzyme degradation/denaturation by fitting normalized enzyme activity vt′/vctrl and does not require further corrections.",
    "3. Alternative for continuous: Fit Ft against t to obtain vt′.\nThis is an alternative method to obtain vt′ from the initial velocity for assays with a continuous readout, using the initial velocity in progress curve analysis (Method I). Fit signal Ft against incubation time t to exponential association Equation XIV (Fig. 15B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015]/Fig. 16B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016], right) to obtain preincubation time–dependent product formation velocity vt′ (in AU/s) from the initial velocity. This resolves issues with low signal/noise ratios for continuous read-out assays where vt′ is not linear (due to additional covalent modification during the incubation) by allowing longer incubation times to produce sufficient signal.\n         \nformula:\n\\begin{equation} {F_{\\rm {t}}} = \\;{{\\rm{v}}_{\\rm{s}}}t + \\frac{{{{\\rm{v}}_{\\rm{t^\\prime}}} - {{\\rm{v}}_{\\rm{s}}}}}{k}\\left[ {1 - {e^{ - kt}}} \\right] + {F_0} \\end{equation}\nEquation XIV for nonlinear regression of user-defined explicit equation Y = (vs*X) + (((vi-vs)/kobs)*(1-EXP(-kobs*X))) + Y0 with Y = signal Ft (in AU) and X = incubation time t (in s) to find Y0 = Y-intercept F0 = background signal at t = 0 (in AU), vi = initial slope = preincubation time–dependent product formation velocity vt′ (in AU/s), vs = final slope (in AU/s) and kobs = nonlinearity reaction rate k (in s−1).\n4. Proceed to Data Analysis Protocols to obtain the appropriate kinetic parameters for each covalent binding mode: Data Analysis Protocol 3Ai or 3Aii for two-step irreversible inhibitors, Data Analysis Protocol 3Bi or 3Bii for one-step irreversible inhibitors, and Basic Data Analysis Protocol 3C for two-step reversible inhibitors.",
    "Selection of a data analysis method for inhibitors with an irreversible binding mode depends on the desired visual representation as well as personal preference. Generally, Basic Data Analysis Protocols 3Ai and 3Bi have less data processing/manipulation and are more informative for comparison of various inhibitors on a single enzyme target, as they are compatible with assessment of inhibitor potency simultaneous with visual assessment of time-dependent enzyme stability kctrl (Figs. 15F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015] and 16F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016]). Alternative Data Analysis Protocols 3Aii and 3Bii involve normalization of the enzyme activity that aids visual assessment of inhibitory potency of a single inhibitor on multiple enzyme targets (that might have a variable stability) (Figs. 15H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015] and 16H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016]).\n \n         \ntable:\n﻿Unnamed: 0_level_0,Data Analysis Protocol,Data Analysis Protocol,Data Analysis Protocol\nEXP Conditions,2-step IRREV,1-step IRREV,2-step REV\nkctrl = 0,3Ai,3B,3C\nkdegE = 0,3Ai/3Aii,3Bi/3Bii,3C\nExemplary assay concentrations during preincubation and during incubation.\n         \ntable:\n﻿Unnamed: 0,Concentration during preincubation t′,Concentration during preincubation t′.1,Concentration during preincubation t′.2,Concentration during incubation t,Concentration during incubation t.1,Concentration during incubation t.2\n,[stock],V (µl),[conc]t′,[stock],V (µl),[conc]t\nEnzyme,2 nM,10,0.99 nM,-,-,0.90 nM\nInhibitor,20 nM,10.2,10.10 nM,-,-,9.19 nM\nSubstrate,-,-,-,11 µM,2,0.99 µM\nTotal,,20.2,,,22.2,\nData Analysis 3A: Preincubation Time–Dependent Inhibition Without Dilution for Two-Step Irreversible Covalent Inhibition",
    "Time-dependent product formation is fitted to a straight line for each inhibitor concentration to obtain the enzyme activity after preincubation vt′ (in AU/s) from the linear (initial) slope (Fig. 15A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015] and 15B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015], left). It is important that the incubation time be relatively short (t < 0.1t½) to minimize artifacts caused by significant formation of covalent adduct EI* after substrate addition (ΔEI*) because vt′ should reflect the enzyme activity at the end of preincubation. As a rule of thumb, incubation time t should be much shorter than the shortest preincubation time t′. A short incubation time may result in insufficient product formation for a robust signal, which can be resolved by increasing the incubation time and obtaining enzyme activity vt′ from the initial velocity of the exponential association progress curve, provided that the assay is compatible with progress curve analysis (continuous read-out) (Fig. 15B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015], right). Enzyme activity after preincubation vt′ is fitted to bounded exponential decay Equation V (Fig. 14D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0014]) (constraining vs = 0) for each inhibitor concentration to obtain the observed rate of reaction completion kobs from enzyme activity without preincubation (Y-intercept at vi) to reaching the final enzyme inactivation (plateau at vs = 0) (Fig. 15C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015]). Enzyme activity without preincubation in presence of inhibitor vi is lower than the uninhibited enzyme activity vctrl for two-step (ir)reversible inhibitors, because vi reflects the rapid noncovalent equilibrium (Kiapp) after substrate addition (Copeland, 2013b[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0012]). The plot of inhibitor concentration-dependent kobs reaches maximum rate of inactivation kinact in presence of saturating inhibitor concentration ([I] >> KI) with the Y-intercept at kctrl = 0 when uninhibited enzyme activity vctrl is independent of preincubation time (Fig. 15D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015]). Inhibitor concentrations should correspond with the inhibitor concentration during preincubation (rather than after substrate addition).",
    "Correction of inactivation constant KI for substrate competition is not necessary because preincubation is performed in absence of substrate.",
    "Warnings and Remarks\nThe rapid noncovalent E + I <-> EI equilibrium does not significantly contribute to inhibition at non-saturating inhibitor concentrations ([I] << Kiapp), resulting in one-step binding behavior (Fig. 3F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0003]). This will be apparent from the observation that initial velocity vi is independent of inhibitor concentration (vi = vctrl) along with a linear plot of kobs against [I]. This is resolved either by increasing the inhibitor concentration or performing Data Analysis 3B. Increasing the substrate concentration can resolve issues with assay sensitivity associated with short incubation times, as this will result in a higher product signal. However, substrate addition in a relatively large volume (Vsub > 0.1Vt′) and/or addition of a competitive substrate concentration ([S] > 0.1KM) causes (partial) disruption of the reversible equilibrium, although this does not affect the accuracy of kobs for irreversible inhibitors. In fact, disruption of the noncovalent complex can be employed to detect covalent adduct formation of two-step irreversible inhibitors that exhibit tight-binding behavior (Copeland, 2013c[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0013]; Murphy, 2004[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0061]) resulting from very potent noncovalent inhibition, as will be discussed in Method IV.\nUninhibited enzyme activity vctrl decreases when preincubation is long enough for significant spontaneous enzyme degradation (t′ >> 0.1t½) (Fig. 15F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015]). A simple algebraic correction for spontaneous enzyme degradation results in good estimates for kinact and KI if all enzyme species have the same first-order enzymatic degradation rate (kdegE = kdegES = kdegEI) (Fig. 15G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015]). Alternatively, normalizing the enzyme activity vt′ to uninhibited enzyme activity vt′ctrl at each preincubation time corrects for enzyme degradation (Fig. 15H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015]), and kobs obtained from normalized enzyme activity vt′/vctrl results in good estimates of kinact and KI without further correction (Fig. 15I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015]).",
    "Processing of experimental data obtained with Basic Protocol III that has been processed according to Basic Data Analysis Protocol 3 for two-step irreversible covalent inhibitors.\n1. Plot vt′ against preincubation time t′ for each inhibitor concentration.\nPlot the mean and standard deviation of vt′ (in AU/s) on the Y-axis against preincubation time t′ (in s) on the X-axis for each inhibitor concentration and the uninhibited control (Fig. 14C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0014]/Fig. 15C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015]). Validate that inhibitor concentrations are not too high: inhibition should be less than 100% at the shortest t′ for at least six inhibitor concentrations. Check whether the uninhibited enzyme activity is independent of preincubation time (v0ctrl = vt′ctrl, Fig. 15C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015]): an algebraic correction for enzyme instability (kctrl > 0, Fig. 15F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015]) can be performed in step 4 of this protocol by accounting for nonlinearity in the uninhibited control in the secondary kobs plot (Fig. 15G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015]). Alternatively, proceed to Alternative Data Analysis Protocol 3Aii to correct for enzyme instability (v0ctrl > vt′ctrl) by normalization of the enzyme activity vt′/vt′ctrl (Fig. 15H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015]-I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015]).\n2. Fit vt′ against preincubation time t′ to obtain kobs.\nFit the mean and standard deviation of vt′ against preincubation time t′ (Fig. 15C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015]/F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015]) to Equation V. Constrain vs = value in fully inhibited control to obtain the observed reaction rate kobs (in s−1) from initial velocity vi (Y-intercept) to full inactivation (Plateau = 0). A lack of initial noncovalent complex (vi = v0ctrl) is indicative of one-step binding behavior.\n         \nformula:\n\\begin{equation} {{\\rm{v}}_{{\\rm{t^\\prime}}}} = {{\\rm{v}}_{\\rm{s}}} + ({\\rm{v_i}} - {{\\rm{v}}_{\\rm{s}}})\\;{e^{ - {k_{{\\rm{obs}}}}\\rm t^\\prime}} \\end{equation}",
    "Equation V for nonlinear regression of exponential one-phase decay equation Y = (Y0-Plateau)*EXP(-k*X) + Plateau with Y = preincubation time–dependent product formation velocity vt′ (in AU/s), X = preincubation time t′ (in s), and Plateau = final velocity in the fully inhibited control vs (in AU/s) to find Y0 = Y-intercept = initial velocity vi (in AU/s) and k = observed reaction rate kobs (in s−1).\n3. Plot kobs against [I].\nPlot the mean and standard deviation of kobs (in s−1) on the Y-axis against inhibitor concentration (in M) during preincubation (before addition of substrate) on the X-axis (Fig. 15D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015]/G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015]). The plot of kobs against [I] should reach a maximum kobs at saturating inhibitor concentration. Note that a linear curve is indicative of one-step binding behavior at non-saturating inhibitor concentrations ([I] << 0.1KI in Fig. 3F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0003]) with vi = v0ctrl (shared Y-intercept in the previous step). Proceed to Basic Data Analysis Protocol 3Bi step 4 after it has been validated that the linear curve is not resultant from saturating inhibitor concentrations ([I] >> 10KI in Fig. 3G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0003]) as identified by vi << v0ctrl, by repeating the measurement with lower inhibitor concentrations.\n4. Fit kobs against [I] to obtain kinact and KI.\nFit kobs (in s−1) against inhibitor concentration during preincubation (in M) to Equation XV to obtain maximum inactivation rate constant kinact (in s−1) and inactivation constant KI (in M). Constrain kctrl = kobs of the uninhibited control (Fig. 15G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015]). Inactivation constant KI does not have to be corrected for substrate competition because preincubation is conducted in absence of competing substrate. Calculate irreversible covalent inhibitor potency kinact/KI (in M−1s−1) with propagation of error with Sample Calculation 2.\n         \nformula:\n\\begin{equation} {k_{{\\rm{obs}}}} = {k_{{\\rm{ctrl}}}} + \\frac{{{k_{{\\rm{inact}}}}{\\rm{\\;}}\\left[ {\\rm{I}} \\right]}}{{{{\\rm{K}}_{\\rm{I}}} + \\left[ {\\rm{I}} \\right]}}\\;\\; \\end{equation}",
    "Equation XV for nonlinear regression of user-defined explicit equation Y = Y0 + ((kmax*X)/((KI) + X)) with Y = observed reaction rate kobs (in s−1) and X = inhibitor concentration during preincubation (in M) to find Y0 = rate of nonlinearity in uninhibited control kctrl (in s−1), kmax = maximum reaction rate kinact (in s−1) and KI = Inactivation constant KI (in M).\n5. Optional: Validate experimental kinetic parameters with kinetic simulations.\nProceed to Kinetic Simulations 1 to compare the experimental read-out to the product formation simulated with scripts KinGen and KinDeg (using experimental rate constant kinact = k5) to confirm that the calculated kinetic constants are in accordance with the experimental data. Also perform simulations with KinVol and KinVolDeg to confirm that addition of substrate does not significantly affect the noncovalent interactions.",
    "Processing of experimental data obtained with Basic Protocol III that has been processed according to Basic Data Analysis Protocol 3 for two-step irreversible covalent inhibitors.\n1. Plot vt′ against preincubation time t′ for each inhibitor concentration.\nPlot the mean and standard deviation of vt′ (in AU/s) on the Y-axis against preincubation time t′ (in s) on the X-axis for each inhibitor concentration and the uninhibited control (Fig. 14C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0014]/Fig. 15C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015]). Validate that inhibitor concentrations are not too high: inhibition should be less than 100% at the shortest t′ for at least six inhibitor concentrations.\n2. Normalize vt′ to obtain vt′/vctrl.\nNormalize vt′ (in AU/s) of each inhibitor concentration and the controls to lowest value = 0 (or full inhibition control) and highest value = uninhibited product formation vt′ctrl (in AU/s) to obtain normalized enzyme activity vt′/vctrl (Fig. 15H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015]). Perform this correction separately for each preincubation time.\n3. Plot and fit vt′/vctrl against preincubation time t′ to obtain kobs.\nPlot the mean and standard deviation of vt′/vctrl on the Y-axis against preincubation time t′ (in s) on the X-axis (Fig. 15H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015]). Fit to exponential decay Equation XVI to obtain kobs (in s−1) from initial velocity vi/v0ctrl to full inactivation (Plateau = 0). A lack of initial noncovalent complex (vi/v0ctrl = 1) is indicative of one-step binding behavior.\n         \nformula:\n\\begin{equation} \\left( {\\frac{{{\\rm v_{t^\\prime }}}}{{\\rm v_{t^\\prime }^{{\\rm{ctrl}}}}}} \\right) = \\left( {\\frac{{{\\rm v_i}}}{{\\rm v_0^{{\\rm{ctrl}}}}}} \\right){e^{ - {k_{{\\rm{obs}}}}\\rm t^\\prime}} \\end{equation}\nEquation XVI for nonlinear regression of exponential one-phase decay equation Y = (Y0-Plateau)*EXP(-k*X) + Plateau with Y = normalized preincubation time–dependent product formation velocity vt′/vctrl (unitless), X = preincubation time t′ (in s), and Plateau = normalized final velocity vs/vsctrl = 0 (unitless) to find Y0 = Y-intercept = normalized initial velocity vi/v0ctrl (unitless) and k = observed reaction rate kobs (in s−1).",
    "4. Plot kobs against [I].\nPlot the mean and standard deviation of kobs (in s−1) on the Y-axis against inhibitor concentration (in M) during preincubation (before addition of substrate) on the X-axis (Fig. 15I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015]). The plot of kobs against [I] should have a Y-intercept = 0, and reach a maximum kobs at saturating inhibitor concentration. Note that a linear curve is indicative of one-step binding behavior at non-saturating inhibitor concentrations ([I] << 0.1KI in Fig. 3F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0003]) with vi = v0ctrl (shared Y-intercept = 1 in the previous step). Proceed to Basic Data Analysis Protocol 3Bii step 5 after it has been validated that the linear curve is not resultant from saturating inhibitor concentrations ([I] >> 10KI in Fig. 3G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0003]) as identified by vi << v0ctrl (shared Y-intercept = 0 in the previous step), by repeating the measurement with lower inhibitor concentrations.\n5. Fit kobs against [I] to obtain kinact and KI.\nFit kobs against inhibitor concentration during preincubation to Equation XVII to obtain maximum inactivation rate constant kinact (in s−1) and inactivation constant KI (in M) (Fig. 15I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0015]). Do not correct for enzyme instability (kctrl > 0), as this correction has already been performed by normalizing vt′ to vt′/vctrl in step 2 of this protocol. Inactivation constant KI does not have to be corrected for substrate competition because preincubation is conducted in absence of competing substrate. Calculate irreversible covalent inhibitor potency kinact/KI (in M−1s−1) with propagation of error with Sample Calculation 2.\n         \nformula:\n\\begin{equation} {k_{{\\rm{obs}}}} = \\frac{{{k_{{\\rm{inact}}}}{\\rm{\\;}}\\left[ {\\rm{I}} \\right]}}{{{{\\rm{K}}_{\\rm{I}}} + \\left[ {\\rm{I}} \\right]}}\\;\\; \\end{equation}",
    "Equation XVII for nonlinear regression of user-defined explicit equation Y = Y0 + ((kmax*X)/((KI) + X)) with Y = observed reaction rate kobs (in s−1), X = inhibitor concentration during preincubation (in M) and Y0 = 0 (in s−1) to find kmax = maximum reaction rate kinact (in s−1) and KI = Inactivation constant KI (in M).\n6. Optional: Validate experimental kinetic parameters with kinetic simulations by proceeding to Basic Data Analysis Protocol 3Ai, step 5.\nData Analysis 3B: Preincubation Time–Dependent Inhibition Without Dilution for One-Step Irreversible Covalent Inhibition\nTime-dependent product formation is fitted to a straight line for each inhibitor concentration to obtain the enzyme activity after preincubation vt′ (in AU/s) from the linear slope (Fig. 16A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016] and 16B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016], left). Incubation must be short enough to minimize formation of covalent adduct EI* after substrate addition (t << t½); otherwise kchem will be overestimated. Similar to Data Analysis 3A, preincubation-dependent enzyme activity vt′ can also be obtained from the initial velocity of the exponential association progress curve, provided that the read-out is continuous (Fig. 16B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016], right). Enzyme activity after preincubation vt′ is fitted to bounded exponential decay Equation V (Fig. 14D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0014]) to obtain observed rate of reaction completion kobs from uninhibited enzyme activity without preincubation (Y-intercept at vi = vctrl) to reaching the final enzyme inactivation (constraining vs = 0) (Fig. 16C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016]). Inhibited enzyme activity without preincubation is equal to uninhibited enzyme activity (vi = vctrl), as rapid noncovalent inhibitor binding does not contribute to enzyme inhibition by one-step irreversible inhibitors. The slope of the linear plot of kobs against inhibitor concentration during preincubation is equal to kchem (Fig. 16D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016]), which should not be corrected for substrate competition as preincubation is performed in absence of competing substrate.\nWarnings and remarks",
    "Substrate addition in a relatively large volume (Vsub > 0.1Vt′) and/or addition of a competitive substrate concentration ([S] > 0.1KM) does not significantly affect the accuracy of kobs because one-step irreversible inhibition does not involve a rapid noncovalent equilibrium that can be disrupted (also see Method IV). Increasing the substrate concentration can resolve issues with assay sensitivity: higher substrate concentration results in a higher product concentration after the same incubation time (vctrl = Vmax[S]/([S]+KM)), which in turn will result in a better signal to noise ratio.\nUninhibited enzyme activity vctrl decreases with longer preincubation due to spontaneous enzyme degradation (Fig. 16E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016] and 16F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016]). This especially affects assays where preincubation is long enough for significant enzyme degradation (t′ > 0.1t½). Algebraic correction for spontaneous enzyme degradation (kdegE = kdegES) in the secondary kobs plot is relatively simple (Fig. 16G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016]). Alternatively, correction for enzyme degradation is performed by normalizing enzyme activity vt′ to uninhibited enzyme activity vt′ctrl at each preincubation time (Fig. 16H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016] and 16I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016]). Stabilization of enzyme upon inhibitor binding (kdegEI* < kdegE) does not affect kobs, as EI* formation is already irreversible thus removing the species from the available pool of catalytic enzyme.",
    "Processing of experimental data obtained with Basic Protocol III that has been processed according to Basic Data Analysis Protocol 3 for one-step irreversible covalent inhibitors and two-step irreversible inhibitors at non-saturating inhibitor concentrations ([I] ≤ 0.1KI).\n1. Plot vt′ against preincubation time t′ for each inhibitor concentration.\nPlot the mean and standard deviation of vt′ (in AU/s) on the Y-axis against preincubation time t′ (in s) on the X-axis for each inhibitor concentration and the uninhibited control (Fig. 14C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0014]/Fig. 16C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016]). Validate that inhibitor concentrations are not too high: inhibition should be less than 100% at the shortest t′ for at least six inhibitor concentrations. Check whether the uninhibited enzyme activity is independent of preincubation time (v0ctrl = vt′ctrl, Fig. 16C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016]): an algebraic correction for enzyme instability (kctrl > 0, Fig. 16F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016]) can be performed in step 4 of this protocol by accounting for nonlinearity in the uninhibited control in the secondary kobs plot (Fig. 16G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016]). Alternatively, proceed to Alternative Data Analysis Protocol 3Bii to correct for enzyme instability (v0ctrl > vt′ctrl) by normalization of the enzyme activity vt′/vt′ctrl (Fig. 16H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016]-I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016]).\n2. Fit vt′ against preincubation time t′ to obtain kobs.\nFit the mean and standard deviation of vt′ against preincubation time t′ (Fig. 16C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016]/F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016]) to Equation V. Constrain vs = value in fully inhibited control to obtain the observed reaction rate kobs (in s−1) from initial velocity vi (Y-intercept) to full inactivation (Plateau = 0). A lack of initial noncovalent complex (vi = v0ctrl) is indicative of one-step binding behavior.\n         \nformula:\n\\begin{equation} {{\\rm{v}}_{{\\rm{t^\\prime}}}} = {{\\rm{v}}_{\\rm{s}}} + \\left( {{{\\rm{v}}_{\\rm{i}}} - {{\\rm{v}}_{\\rm{s}}}} \\right)\\;{e^{ - {k_{{\\rm{obs}}}}{\\rm{t^\\prime}} }} \\end{equation}",
    "Equation V for nonlinear regression of exponential one-phase decay equation Y = (Y0-Plateau)*EXP(-k*X) + Plateau with Y = preincubation time–dependent product formation velocity vt′ (in AU/s), X = preincubation time t′ (in s), and Plateau = final velocity in the fully inhibited control vs (in AU/s) to find Y0 = Y-intercept = initial velocity vi = uninhibited initial velocity v0ctrl (in AU/s, shared value) and k = observed reaction rate kobs (in s−1).\n3. Plot kobs against [I].\nPlot the mean and standard deviation of kobs (in s−1) on the Y-axis against inhibitor concentration (in M) during preincubation (before addition of substrate) on the X-axis (Fig. 16D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016]/G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016]). The plot of kobs against inhibitor concentration [I] is linear for one-step irreversible inhibitors and for two-step irreversible inhibitors at non-saturating inhibitor concentrations ([I] << 0.1KI).\n4. Fit kobs against [I] to obtain kchem.\nFit kobs against inhibitor concentration during preincubation (in M) to Equation XVIII to obtain inhibitor potency kchem (in M−1s−1) from the linear slope. Constrain Y-intercept kctrl = kobs of the uninhibited control (Fig. 16G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016]). Inhibitor potency kchem does not have to be corrected for substrate competition because preincubation is conducted in absence of competing substrate. Calculate kinact/KI (in M−1s−1) for two-step irreversible inhibitors at non-saturating inhibitor concentrations ([I] ≤ 0.1KI) with propagation of error with Sample Calculation 9.\n         \nformula:\n\\begin{equation} {k_{{\\rm{obs}}}} = {k_{{\\rm{ctrl}}}} + {k_{{\\rm{chem}}}}\\left[ {\\rm{I}} \\right] \\end{equation}\nEquation XVIII for nonlinear regression of straight line Y = YIntercept + Slope*X with Y = observed reaction rate kobs (in s−1) and X = inhibitor concentration during preincubation (in M) to find YIntercept = rate of nonlinearity in uninhibited control kctrl (in s−1) and Slope = inactivation rate constant kchem (in M−1s−1)\n5. Optional: Validate experimental kinetic parameters with kinetic simulations.",
    "Proceed to Kinetic Simulations 1 to compare the experimental read-out to the product formation simulated with scripts KinGen and KinDeg (using experimental rate constant kchem = k3) to confirm that the calculated kinetic constants are in accordance with the experimental data. Also perform simulations with KinVol and KinVolDeg to confirm that addition of substrate does not significantly affect the reaction rates by dilution and/or competition.",
    "Processing of experimental data obtained with Basic Protocol III that has been processed according to Basic Data Analysis Protocol 3 for one-step irreversible covalent inhibitors and two-step irreversible inhibitors at non-saturating inhibitor concentrations ([I] ≤ 0.1KI).\n1. Plot vt′ against preincubation time t′ for each inhibitor concentration.\nPlot the mean and standard deviation of vt′ (in AU/s) on the Y-axis against preincubation time t′ (in s) on the X-axis for each inhibitor concentration and the uninhibited control (Fig. 14C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0014]/Fig. 16C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016]). Validate that inhibitor concentrations are not too high: inhibition should be less than 100% at the shortest t′ for at least six inhibitor concentrations.\n2. Normalize vt′ to obtain vt′/vctrl.\nNormalize vt′ (in AU/s) of each inhibitor concentration and the controls to lowest value = 0 (or full inhibition control) and highest value = uninhibited product formation vt′ctrl (in AU/s) to obtain normalized enzyme activity vt′/vctrl (Fig. 16H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016]). Perform this correction separately for each preincubation time.\n3. Plot and fit vt′/vctrl against preincubation time t′ to obtain kobs\nPlot the mean and standard deviation of vt′/vctrl on the Y-axis against preincubation time t′ (in s) on the X-axis (Fig. 16H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016]). Fit to exponential decay Equation XVI to obtain kobs (in s−1) from initial velocity vi/v0ctrl to full inactivation (Plateau = 0). A lack of initial noncovalent complex (vi/v0ctrl = 1) is indicative of one-step binding behavior.\n         \nformula:\n\\begin{equation} \\left( {\\frac{{{{\\rm{v}}_{{\\rm{t^\\prime}}}}}}{{{\\rm{v}}_{{\\rm{t^\\prime}}}^{{\\rm{ctrl}}}}}} \\right) = {e^{ - {k_{{\\rm{obs}}}}{\\rm{t^\\prime}}}} \\end{equation}\nEquation XVI for nonlinear regression of exponential one-phase decay equation Y = (Y0-Plateau)*EXP(-k*X) + Plateau with Y = normalized preincubation time–dependent product formation velocity vt′/vctrl (unitless), X = preincubation time t′ (in s), Y0 = Y-intercept = normalized initial velocity vi/v0ctrl =1 (unitless), and Plateau = normalized final velocity vs/vsctrl = 0 (unitless) to find k = observed reaction rate kobs (in s−1).",
    "4. Plot kobs against [I].\nPlot the mean and standard deviation of kobs (in s−1) on the Y-axis against inhibitor concentration (in M) during preincubation (before addition of substrate) on the X-axis (Fig. 16I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016]). The plot of kobs against inhibitor concentration [I] is linear for one-step irreversible inhibitors and for two-step irreversible inhibitors at non-saturating inhibitor concentrations ([I] << 0.1KI).\n5. Fit kobs against [I] to obtain kchem.\nFit kobs against inhibitor concentration during preincubation to Equation XIX to inhibitor potency kchem (in M−1s−1) from the linear slope (Fig. 16I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0016]). Do not correct for enzyme instability (kctrl > 0), as this correction has already been performed by normalizing vt′ to vt′/vctrl in step 2 of this protocol. Inhibitor potency kchem does not have to be corrected for substrate competition because preincubation is conducted in absence of competing substrate. Calculate kinact/KI (in M−1s−1) for two-step irreversible inhibitors at non-saturating inhibitor concentrations ([I] ≤ 0.1KI) with propagation of error with Sample Calculation 9. Alternatively, inhibitor potency kchem (in M−1s−1) or kinact/KI (in M−1s−1) can be directly calculated from a single kobs (s−1) and [I] (in M) with Sample Calculation 10.\n         \nformula:\n\\begin{equation} {k_{{\\rm{obs}}}} = {k_{{\\rm{chem}}}}\\left[ {\\rm{I}} \\right] \\end{equation}\nEquation XIX for nonlinear regression of straight line Y = YIntercept + Slope*X with Y = observed reaction rate kobs (in s−1), X = inhibitor concentration during preincubation (in M), and YIntercept = 0 (in s−1) to find Slope = inactivation rate constant kchem (in M−1s−1).\n6. Optional: Validate experimental kinetic parameters with kinetic simulations by proceeding to Basic Data Analysis Protocol 3Bi step 5.\nData Analysis 3C: Preincubation Time–Dependent Inhibition Without Dilution for Reversible Covalent Inhibition",
    "Time-dependent product formation is fitted to a straight line for each inhibitor concentration to obtain the enzyme activity after preincubation vt′ (in AU/s) from the linear slope (Fig. 17A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0017] and 17B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0017]). Again, it is important that the incubation time be much shorter than the shortest preincubation time t′ (t << t′), but enzyme activity vt′ can also be calculated from the initial velocity of the exponential association progress curve, provided that the assay is compatible with progress curve analysis (continuous read-out). Enzyme activity after preincubation vt′ is fitted to bounded exponential decay Equation V (Fig. 14D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0014]) for each inhibitor concentration to obtain observed rate of reaction completion kobs from rapid noncovalent equilibrium (Y-intercept at vi < vctrl) to slowly reaching steady-state equilibrium (plateau at vs > 0) (Fig. 17C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0017]). Enzyme activity without preincubation in presence of inhibitor vi is lower than the uninhibited enzyme activity vctrl for two-step (ir)reversible inhibitors because vi reflects the rapid noncovalent equilibrium (Kiapp) after substrate addition (Copeland, 2013b[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0012]). Contrary to irreversible inhibition, the plateau (vs > 0) does not approximate enzyme inactivation but reaches the steady-state equilibrium (Ki*) instead. Steady-state inhibition constant Ki* can be calculated from the fitted values of Ki, k5 and k6 (Fig. 17D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0017]), but this is not the preferred approach as a small error in k6 has huge implications for the calculation of Ki* (as illustrated in Fig. 9[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0009]). Generally, more reliable estimates of the steady-state inhibition constant Ki* are generated from the dose-response curve of steady-state velocity vs against inhibitor concentration during preincubation (Fig. 17E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0017]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/a60a083a-cec6-46a7-b270-71ff59098a8b/cpz1419-fig-0017-m.jpg</p>\nFigure 17",
    "Data Analysis 3C: Preincubation time–dependent inhibition without dilution for two-step reversible covalent inhibition. Simulated with KinGen (A-E) or KinDeg (F-J) for inhibitor B with 1 pM enzyme and 100 nM substrate S1. (A) Schematic enzyme dynamics during preincubation in absence of substrate and during incubation after substrate addition for two-step reversible covalent inhibition. (B) Time-dependent product formation after preincubation in absence of inhibitor Fctrl or in presence of inhibitor (t′ = 1800 s). Enzyme activity after preincubation vt′ is obtained from the linear slope if the incubation time is relatively short (t << t′): gray area is excluded from the fit. Alternatively, enzyme activity after preincubation vt′ is obtained from the initial velocity of the exponential association progress curve of each inhibitor concentration. (C) Preincubation time–dependent enzyme activity vt′ is fitted to Equation V (Fig. 14D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0014]) for each inhibitor concentration to obtain observed rates of inactivation kobs and steady-state velocity vs (plateau > 0). Alternatively, vt′ can be normalized to a fraction of the uninhibited enzyme activity vctrl. (D) Inhibitor concentration-dependent kobs equals kmax at saturating inhibitor concentration (kmax = k5 + k6) and approaches k6 in absence of inhibitor (kmin = k6). Half-maximum kobs = kmin + ½(kmax - kmin) = k6 + ½k5 is reached when inhibitor concentration equals the inhibition constant Ki. Steady-state inhibition constant Ki* has to be calculated from the fitted values of k5, k6, and Ki, thus being very sensitive to errors and (non)linearity in the uninhibited background (illustrated in Fig. 8G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0008]). No correction for substrate competition because vt′ reflects the enzyme activity after preincubation in absence of competing substrate. (E) Steady-state inhibition constant Ki* corresponds with the IC50 of steady-state velocity vs obtained by fitting the dose-response curve to the Hill equation (Copeland, 2013e[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0015]).",
    "No correction for substrate competition because vt′ reflects the enzyme activity after preincubation in absence of competing substrate. (F) Schematic enzyme dynamics during preincubation in absence of substrate and during incubation after substrate addition for two-step reversible covalent inhibition with spontaneous enzyme degradation. Simulated with kdegE = kdegES = kdegEI = kdegEI* = 0.0003 s−1. (G) Uninhibited enzyme activity after preincubation vt′ctrl is not linear. Fitting preincubation time–dependent enzyme activity vt′ to Equation V (Fig. 14D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0014]) for each inhibitor concentration gives observed rates of inactivation kobs, as well as the rate of nonlinearity kctrl for uninhibited activity vt′ctrl. Inhibitor concentration-dependent kobs and steady-state velocity vs will be driven by spontaneous enzyme degradation if enzyme activity is not normalized. (H) Enzyme activity vt′ is normalized to the uninhibited enzyme activity vt′ctrl after each preincubation time before fitting to Equation V (Fig. 14D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0014]). (I) Inhibitor concentration-dependent kobs has been corrected for enzyme degradation/denaturation by fitting normalized enzyme activity vt′/vctrl and does not require further corrections (even if kctrl > k6). (J) Steady-state velocity vs has been corrected for enzyme degradation/denaturation by fitting normalized enzyme activity vt′/vctrl and does not require further corrections (even if kctrl > k6). Final velocity vs obtained from uncorrected vt′ is ‘contaminated’ by the contribution of irreversible inactivation to the time-dependent inhibition, and does not result in accurate estimates of steady-state inhibition constant Ki* (illustrated in Fig. 8H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0008]).",
    "Warnings and remarks\nSteady-state inhibition constant Ki* reflects the reversible E + I <-> EI + EI* equilibrium that can be disrupted by substrate addition in a relatively large volume (Vsub > 0.1Vt′) and/or addition of a competitive substrate concentration ([S] > 0.1KM). Simulations with high substrate concentration ([S] = 10KM) show that the IC50 of the dose-response curve for steady-state velocity vs was slightly higher than steady-state inhibition constant Ki*, but still significantly lower than Ki*app, as covalent dissociation will not be significant as long as the incubation time is significantly shorter than the dissociation half-life (t << t½diss). Altogether, fitting exponential association rather than increasing the substrate concentration is the desired solution to resolve issues with assay sensitivity associated with short incubation times. Alternatively, reasonable estimates of the steady-state inhibition constant Ki* were obtained from the endpoint preincubation time–dependent potency IC50(t′) with minimal substrate competition ([S] << KM) and preincubation times exceeding the required time to reach reaction completion at all inhibitor concentrations (t′ > 5t½).",
    "As mentioned before, spontaneous loss of enzyme activity due to first-order degradation and/or denaturation of enzyme species (kdegE = kdegES = kdegEI) results in a preincubation time–dependent decrease of uninhibited enzyme activity vctrl (Fig. 17E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0017] and 17F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0017]). The biggest advantage of Method III over Method I (Data Analysis 1C) is that it is possible to perform an algebraic correction for the enzyme instability in kinetic analysis of two-step reversible covalent inhibitors with Data Analysis 3C. Enzyme activity vt′ is normalized to uninhibited enzyme activity vt′ctrl at each preincubation time (Fig. 17G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0017]), and the normalized enzyme activity after preincubation vt′/vctrl is fitted to bounded exponential decay Equation V (Fig. 14D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0014]) for each inhibitor concentration to obtain observed rate of reaction completion kobs and steady-state velocity vs. Kinetic analysis of kobs (Fig. 17H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0017]) and steady-state velocity vs (Fig. 17I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0017]) against inhibitor concentration during preincubation result in good estimates of the kinetic parameters without further correction, even when kctrl is faster than the covalent dissociation rate k6 (kctrl > k6). We strongly advise that enzyme activity be normalized prior to analysis of reversible covalent inhibition even when kctrl is not directly obvious from the product formation in the uninhibited control vt′ctrl.",
    "Processing of experimental data obtained with Basic Protocol III that has been processed according to Basic Data Analysis Protocol 3 for two-step reversible covalent inhibitors.\n1. Plot vt′ against preincubation time t′ for each inhibitor concentration.\nPlot the mean and standard deviation of vt′ (in AU/s) on the Y-axis against preincubation time t′ (in s) on the X-axis for each inhibitor concentration and the uninhibited control (Fig. 14C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0014]/Fig. 17C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0017]). Validate that inhibitor concentrations are not too high: inhibition should be less than 100% at the shortest t′ for at least six inhibitor concentrations. Enzyme activity is never truly independent of preincubation time (v0ctrl > vt′ctrl, Fig. 17G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0017]) and kinetic analysis of reversible inhibitors is very sensitive to small deviations (illustrated in Fig. 9[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0009]). Therefore, correction for enzyme instability is always performed by normalization of the enzyme activity vt′/vt′ctrl in the next step (Fig. 17F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0017]-J[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0017]).\n2. Normalize vt′ to obtain vt′/vctrl.\nNormalize vt′ (in AU/s) of each inhibitor concentration and the controls to lowest value = 0 (or full inhibition control) and highest value = uninhibited product formation vt′ctrl (in AU/s) to obtain normalized enzyme activity vt′/vctrl (Fig. 17H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0017]). Perform this correction separately for each preincubation time.\n3. Plot and fit vt′/vctrl against preincubation time t′ to obtain kobs and vs/vsctrl.\nPlot the mean and standard deviation of vt′/vctrl on the Y-axis against preincubation time t′ (in s) on the X-axis (Fig. 17H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0017]). Fit to exponential decay Equation XX to obtain kobs (in s−1) from initial velocity vi/v0ctrl reflecting rapid noncovalent equilibrium (Y-intercept vi/v0ctrl ≤ 1) to the final velocity vs/vsctrl reflecting steady-state equilibrium (Plateau vs/vsctrl ≥ 0).\n         \nformula:\n\\begin{equation} \\left( {\\frac{{{{\\rm{v}}_{{\\rm{t^\\prime}}}}}}{{{\\rm{v}}_{{\\rm{t^\\prime}}}^{{\\rm{ctrl}}}}}} \\right) = \\left( {\\frac{{{{\\rm{v}}_{\\rm{s}}}}}{{{\\rm{v}}_{\\rm{s}}^{{\\rm{ctrl}}}}}} \\right) + \\left( {\\frac{{{{\\rm{v}}_{\\rm{i}}}}}{{{\\rm{v}}_0^{{\\rm{ctrl}}}}} - \\frac{{{{\\rm{v}}_{\\rm{s}}}}}{{{\\rm{v}}_{\\rm{s}}^{{\\rm{ctrl}}}}}} \\right){e^{ - {k_{{\\rm{obs}}}}{\\rm{t^\\prime}} }} \\end{equation}",
    "Equation XX for nonlinear regression of exponential one-phase decay equation Y = (Y0-Plateau)*EXP(-k*X) + Plateau with Y = normalized preincubation time–dependent product formation velocity vt′/vctrl (unitless), X = preincubation time t′ (in s) to find Y0 = Y-intercept = normalized initial velocity vi/v0ctrl (unitless), Plateau = normalized final velocity vs/vsctrl = 0 (unitless), and k = observed reaction rate kobs (in s−1).\n4. Plot and fit vs/vsctrl against [I] to obtain Ki*.\nSteady-state inhibition constant Ki* (in M) can be calculated from vs/vsctrl (obtained in the previous step) reflecting remaining fractional enzyme activity after reaching the steady-state inhibitor equilibrium (reaction completion) (Fig. 17J[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0017]). Plot the mean and standard deviation of vs/vsctrl on the Y-axis against inhibitor concentration (in M) during preincubation (before addition of substrate) on the X-axis (Fig. 17J[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0017]), and fit the dose-response curve to four-parameter nonlinear regression Hill Equation XXI (Copeland, 2013e[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0015]) to obtain steady-state inhibition constant Ki* (in M). The maximum product formation velocity at reaction completion corresponds with the uninhibited enzyme activity vsctrl/vsctrl = 1 and minimum velocity vsmin/vsctrl = 0 for (background-)corrected enzyme activity in the full inhibition control. Steady-state equilibrium constant Ki* (in M) does not does not have to be corrected for substrate competition because preincubation is conducted in absence of competing substrate.\n         \nformula:\n\\begin{equation} \\left( {\\frac{{{{\\rm{v}}_{\\rm{s}}}}}{{{\\rm{v}}_{\\rm{s}}^{{\\rm{ctrl}}}}}} \\right) = \\frac{1}{{1 + {{\\left( {\\frac{{\\left[ {\\rm{I}} \\right]}}{{{\\rm{K}}_{\\rm{i}}^{\\rm{\\star}}}}} \\right)}^h}}} \\end{equation}\nEquation XXI for nonlinear regression of four-parameter dose-response equation Y = Bottom + (Top-Bottom)/(1 + (X/IC50)^HillSlope) with Y = fractional steady-state product formation velocity vs/vsctrl (unitless), X = inhibitor concentration during preincubation (in M), Bottom = velocity in fully inhibited control vsmin/vsctrl = 0 (unitless), and Top = uninhibited enzyme activity vsctrl/vsctrl = 1 (unitless) to find Hillslope = Hill coefficient h (unitless) and IC50 = steady-state inhibition constant Ki* (in M).",
    "5. Optional: Plot and fit kobs against [I] to obtain Ki, k5, and k6.\nThis is an optional data processing step to obtain kinetic parameters by fitting to the observed rate kobs (obtained in Data Analysis 3C, step 3), and can be used to validate Ki* values found in the previous step or to find values for k5 and k6 to use in kinetic simulations (next step in this protocol). Plot the mean and standard deviation of kobs (in s−1) on the Y-axis against inhibitor concentration during preincubation (in M) on the X-axis (Fig. 17I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0017]). Exclude the uninhibited control (kctrl = 0 for normalized enzyme activity) from the fit because Y-intercept = k6 rather than kctrl. Fit kobs against inhibitor concentration to Equation XXII to obtain rate constants for the covalent association k5 (in s−1) and covalent dissociation k6 (in s−1) as well as noncovalent inhibition constant Ki (in M) reflecting the rapid (initial) noncovalent equilibrium. Noncovalent equilibrium constant Ki does not does not have to be corrected for substrate competition because preincubation is conducted in absence of competing substrate. Proceed to Sample Calculation 8 to calculate steady-state inhibition constant Ki* (in M) from experimental values of Ki, k5, and k6.\n         \nformula:\n\\begin{equation} {k_{{\\rm{obs}}}} = {k_6} + \\frac{{{k_5}{\\rm{\\;}}\\left[ {\\rm{I}} \\right]}}{{{{\\rm{K}}_{\\rm{i}}} + \\left[ {\\rm{I}} \\right]}} \\end{equation}\nEquation XXII for nonlinear regression of user-defined explicit equation Y = Y0 + ((kmax*X)/((Ki) + X)) with Y = observed reaction rate kobs (in s−1) and X = inhibitor concentration during preincubation (in M) to find Y0 = covalent dissociation rate constant k6 (in s−1), kmax = covalent association rate constant k5 (in s−1) and Ki = inhibition constant Ki (in M).\n6. Optional: Validate experimental kinetic parameters with kinetic simulations.",
    "Proceed to Kinetic Simulations 1 to compare the experimental read-out to the product formation simulated with scripts KinGen and KinDeg to confirm that the calculated kinetic constants are in accordance with the experimental data. Also perform simulations with KinVol and KinVolDeg to confirm that addition of substrate does not significantly affect the noncovalent interactions/equilibria or reaction rates by dilution and/or competition. Experimental estimates of k5 and k6 are generated in the previous step of this protocol.",
    "The protocol below provides a generic set of steps to accomplish this type of measurement. Specific reagents, and assay conditions for preincubation time–dependent inhibition with dilution of two-step irreversible covalent acetylcholinesterase inhibitors, can be found in Kitz & Wilson (1962[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0039]).\nMaterials\n1× Assay/reaction buffer supplemented with co-factors and reducing agent\nActive enzyme, 200× solution in assay buffer\nSubstrate with continuous or quenched read-out, 1× solution in assay buffer\nPositive control: vehicle/solvent as DMSO stock, or 2% solution in assay buffer\nNegative control: known inhibitor or alkylating agent as DMSO stock, or 200× solution in assay buffer\nInhibitor: as DMSO stock, or serial dilution of 200× solution in assay buffer with 2% DMSO\nOptional: Development/quenching solution\n1.5 ml (Eppendorf) microtubes to prepare stock solutions\n384-well low volume microplate with nonbinding surface (e.g., Corning 3820 or 4513) for preincubation\nGeneral microplate cover/lid (e.g., Corning 6569 Microplate Aluminum Sealing Tape) to seal 384-well plate during preincubation\n96-well low volume microplate with nonbinding surface (e.g., Corning 3650 or 3820) for quenching and read-out\nOptional: 96-well microplate to prepare serial dilution of inhibitor concentration\nOptional: Microtubes to perform preincubations (e.g., Eppendorf Protein Lobind Microtubes, #022431018)\nOptional: 384-well low volume microplate with nonbinding surface (e.g., Corning 3820 or 4513) for read-out\nMicroplate reader equipped with appropriate filters to detect product formation (e.g., CLARIOstar microplate reader)\nOptional: Automated (acoustic) dispenser (e.g., Labcyte ECHO 550 Liquid Handler acoustic dispenser)\nBefore you start, optimize assay conditions in the uninhibited control to ensure compliance with assumptions and restrictions, as outlined in Basic Protocol I. Consult Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-tbl-0003] in the troubleshooting section for common optimization and troubleshooting options.\nSpecific adjustments for Method IV",
    "Substrate should be added in a large volume (Vsub >> Vt′) and/or at a high concentration ([S]0 >> KM) to quench time-dependent enzyme inhibition (Fig. 18A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0018]). Enzyme concentration after dilution [Etotal]t should be adjusted to correspond to maximum 10% substrate conversion until the end of the incubation in the uninhibited control ([P]t < 0.1[S]0), and substrate should be present in excess ([S]0 > 10[Etotal]t). Preincubation-dependent enzyme activity should be calculated from initial, linear product formation after substrate addition. Validate that enough product is formed for a good signal/noise ratio (Z′ > 0.5) by calculating the Z′-score from the uninhibited and inhibited controls (ideally 8 replicates) in a separate experiment (Zhang et al., 1999[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0086]). This method is compatible with homogeneous (continuous) assays but also with assays that require a development/quenching step to visualize formed product. Note that preincubation in very small volumes (<10 µl) is not representative/reliable and the volume after 100-fold dilution in substrate will often exceed the maximum well volume of assay plates. Therefore, preincubation is typically performed in a larger volume (tube or plate) from which aliquots are removed at the end of the preincubation. In this protocol, we perform incubations in triplicate (20 µl per replicate) in a 384-well plate, from which 2-µl aliquots are removed and quenched in 198 µl substrate in a 96-well plate that is also used for read-out. Optionally, it is possible to then transfer 20 µl to a 384-well plate for read-out, but multiple transfers of assays solutions will introduce errors. Alternatively, preincubation can be performed in microtubes or a 96-well plate.",
    "1. Add inhibitor or control (e.g., 0.2 µl) and assay buffer (e.g., 10 µl) to each well with the uninhibited control for full enzyme activity containing the same volume vehicle/solvent instead of inhibitor, as outlined in step 1 of Basic Protocol III.\nGently shake to mix DMSO with the aqueous buffer. Typically, measurements are performed in triplicate (or more replicates) with at least 8 inhibitor concentrations for at least 5 preincubation times. Inhibitor concentrations might need optimization, but a rational starting point is to use inhibitor concentrations below 5 times the IC50 at the shortest preincubation time t′: inhibition is expected to improve in a time-dependent manner, and the best results are obtained when full inhibition is not achieved already at the shortest preincubation time (Fig. 18C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0018]). Whether preincubation is performed in a tube or microplate is a matter of personal preference, compatibility with lab equipment and automation, and convenience of dispensing small volumes.\n2. Add active enzyme in assay buffer to each well (e.g., 10 µl of 200× solution) or tube to start preincubation of enzyme with inhibitor and homogenize the solution by gently shaking (1 min at 300 rpm). Alternatively, dispensing the enzyme at a high flow rate will also mix the components.\nThe order of enzyme and inhibitor addition is not important per se, as long as DMSO stocks are added prior to buffered (aqueous) solutions. Inhibitor must be present in excess during preincubation ([I]0 > 10[E]0). Optionally, gently centrifuge the plate or microtubes (1 min at 1000 rpm) to ensure assay components are not stuck at the top of the well.\n3. Seal the wells with a cover or lid, and close the caps of microtubes to prevent evaporation of assay components during preincubation.",
    "4. Remove a single aliquot in volume Vt′ (e.g., 2 µl) from the reaction mixture, and transfer to a 96-well microplate already containing a large volume (volume Vsub) of substrate (e.g., 198 µl of 1× solution in assay buffer) after preincubation time t′.\nSubstrate should be added in a large volume (Vt << Vt′) and/or at a high concentration ([S] >> KM) to quench time-dependent addition enzyme inhibition during incubation by dilution ([I]t << [I]t′) or competition (increasing KIapp or decreasing kchemapp). Dilution to inhibitor concentration far below the equilibrium concentration ([I]t << Kiapp) promotes dissociation of noncovalently bound inhibitor after substrate addition (Fig. 18A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0018]). The accuracy of the measurement improves if the preincubation time is monitored precisely. Optionally, homogenize the solutions by gentle shaking (300 rpm) and centrifuge the plate (1 min at 1000 rpm) to ensure assay components are not stuck at the top of the well.\n5. Quenching: Add development solution to the reaction mixture in the microplate to quench the product formation reaction if read-out of product formation requires a development/quenching step to visualize formed product after incubation time t.\nFollow manufacturer's advice on waiting time after addition of development solution before read-out. Incubation time t is the elapsed time between onset of product formation by substrate addition (step 4) and addition of development/quenching solution (step 5). A possible advantage to the use of a quenched assay is the ability to store the samples after addition of quenching/development solution (step 5) and measure product formation (step 6) in all samples after completion of the final preincubation rather than performing multiple separate measurements (after each preincubation time).\n6. Optional: Transfer aliquot (e.g., 20 µl) to a 384-well microplate for read-out.",
    "Typically, the total volume after dilution in substrate solution (Vt = Vsub + Vt′) exceeds the maximum well volume of a 384-well microplate. Transfer an appropriate amount of reaction mixture (at least two technical replicates) to a microplate. This step can be skipped if read-out is performed in a 96-well plate.\n7. Measure formed product after incubation by detection of the product read-out in microplate reader.\nIncubation time t (after substrate addition) is arbitrary as long as product formation is linear in uninhibited as well as inhibited samples (Fig. 18B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0018]).\n8. Repeat Basic Protocol IV, steps 4-7, for at least another four preincubation times.\nPreincubation time t′ is the elapsed time between onset of inhibition by mixing enzyme and inhibitor (step 2) and addition of substrate (step 4). A typical preincubation assay is multiple hours measuring enzyme activity every 5-30 min, depending on enzyme stability and inhibitor reaction rates. Best results are obtained if the incubation time t used to calculate enzyme activity is kept constant at all preincubation times.\n9. Proceed to Basic Data Analysis Protocol 4 to convert the raw experimental data into preincubation time–dependent enzyme activity.",
    "Processing of raw experimental data obtained with Basic Protocol IV for irreversible inhibitors.\n1. Plot signal F against incubation time t.\nPlot signal F (in AU) on the Y-axis against the incubation time (in s) on the X-axis for each inhibitor concentration and for the controls (Fig. 19B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019], Fig. 20B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020]). Do this separately for each preincubation time.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/56f60954-445c-4c1a-a21a-cb2c0eaa73a8/cpz1419-fig-0019-m.jpg</p>\nFigure 19",
    "Data Analysis 4A: Preincubation time–dependent inhibition with dilution/competition for two-step irreversible covalent inhibition. Simulated with KinVol (A-D) or KinVolDeg (E-I) for inhibitor C with 100 pM enzyme in Vt′ = 1 ([Etotal]t′ = 100, [Etotal]t = 1) and 10 µM substrate S1 ([S] = 10KM) in Vsub = 99. (A) Schematic enzyme dynamics during preincubation in absence of substrate and during incubation after dilution in excess substrate for two-step irreversible covalent inhibition. (B) Time-dependent product formation after preincubation (t′ = 1800 s) in absence of inhibitor Fctrl or in presence of various inhibitor concentrations. Enzyme activity after preincubation vt′ is obtained from the linear slope. (C) Preincubation time–dependent enzyme activity vt′ is fitted to Equation VI (Fig. 18D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0018]) for each inhibitor concentration with global shared value for vi (vi = vctrl) to obtain observed rates of inactivation kobs. Alternatively, vt′ can be normalized to a fraction of the uninhibited enzyme activity vctrl. (D) Half-maximum kobs = ½kinact is reached when inhibitor concentration during preincubation equals the inactivation constant KI: no correction for substrate competition because vt′ reflects the remaining unbound/noncovalent enzyme activity after preincubation in absence of competing substrate. (E) Schematic enzyme dynamics during preincubation in absence of substrate and during incubation after dilution in excess substrate for two-step irreversible covalent inhibition with spontaneous enzyme degradation/denaturation. Simulated with kdegE = kdegES = kdegEI = 0.0003 s−1. (F) Uninhibited enzyme activity after preincubation vt′ctrl decreases with longer preincubation. Enzyme activity vt′ is fitted to Equation VI (Fig. 18D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0018]) for each inhibitor concentration during preincubation with globally shared value for vi (vi = v0ctrl) to obtain observed rates of inactivation kobs, as well as fitting uninhibited activity vt′ctrl to obtain the rate of nonlinearity kctrl.",
    "(G) Inhibitor concentration-dependent kobs with spontaneous enzyme degradation increases with kctrl but the span from kmin (= kctrl) to kmax (= kinact + kctrl) still equals kinact. Fit with algebraic correction for nonlinearity (black line, kctrl > 0). Ignoring the nonlinearity (gray line, constrain kctrl = 0) results in underestimation of KI (overestimation of potency) and overestimation of kinact. (H) Normalized enzyme activity vt′/vctrl is fitted to Equation VI (Fig. 18D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0018]) for each inhibitor concentration during preincubation (constrain vi/v0ctrl = 1) to obtain corrected observed rates of inactivation kobs. (I) Inhibitor concentration-dependent kobs has been corrected for enzyme degradation by fitting normalized enzyme activity vt′/vctrl and does not require further corrections.",
    "<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/7980b2ab-b8b3-4bae-bc1e-7e63075594f6/cpz1419-fig-0020-m.jpg</p>\nFigure 20",
    "Data Analysis 4B: Preincubation time–dependent inhibition with dilution/competition for one-step irreversible covalent inhibition. Simulated with KinVol (A-D) or KinVolDeg (E-I) for inhibitor D with 100 pM enzyme in Vt′ = 1 ([Etotal]t′ = 100, [Etotal]t = 1) and 10 µM substrate S1 ([S] = 10KM) in Vsub = 99. (A) Schematic enzyme dynamics during preincubation in absence of substrate and during incubation after dilution in excess substrate for one-step irreversible covalent inhibition. (B) Time-dependent product formation after preincubation (t′ = 1800 s) in absence of inhibitor Fctrl or in presence of various inhibitor concentrations. Enzyme activity after preincubation vt′ is obtained from the linear slope. (C) Preincubation time–dependent enzyme activity vt′ is fitted to Equation VI (Fig. 18D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0018]) for each inhibitor concentration with global shared value for vi (vi = vctrl) to obtain observed rates of inactivation kobs. Alternatively, vt′ can be normalized to a fraction of the uninhibited enzyme activity vctrl. The highest inhibitor concentration should be excluded: v600 = 0. (D) Inhibitor concentration-dependent kobs increases linearly with inhibitor concentration during preincubation, with kchem as the slope. No correction for substrate competition because vt′ reflects the remaining unbound enzyme activity after preincubation in the absence of competing substrate. (E) Schematic enzyme dynamics during preincubation in absence of substrate and during incubation after dilution in excess substrate for one-step irreversible covalent inhibition with spontaneous enzyme degradation/denaturation. Simulated with kdegE = kdegES = kdegEI = 0.0003 s−1. (F) Uninhibited enzyme activity after preincubation vt′ctrl decreases with longer preincubation. Enzyme activity vt′ is fitted to Equation VI (Fig. 18D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0018]) for each inhibitor concentration during preincubation with globally shared value for vi (vi = v0ctrl) to obtain observed rates of inactivation kobs, along with fitting uninhibited activity vt′ctrl to obtain the rate of nonlinearity kctrl.",
    "(G) Inhibitor concentration-dependent kobs with spontaneous enzyme degradation/denaturation increases by kctrl. Fit with algebraic correction for nonlinearity (black line, kctrl > 0) or ignoring nonlinearity (gray line, constrain kctrl = 0). Ignoring the nonlinearity (assuming Y-intercept = 0) results in overestimation of kchem (steeper slope). (H) Normalized enzyme activity vt′/vctrl is fitted to Equation VI (Fig. 18D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0018]) for each inhibitor concentration during preincubation (constrain vi/v0ctrl = 1) to obtain corrected observed rates of inactivation kobs. (I) Inhibitor concentration-dependent kobs has been corrected for enzyme degradation by fitting normalized enzyme activity vt′/vctrl and does not require further corrections.",
    "2. Fit Ft against t to obtain vt′.\nFit signal Ft against incubation time t to Equation XIII (Fig. 19B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019], Fig. 20B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020]) to obtain preincubation time–dependent product formation velocity vt′ (in AU/s) from the linear slope (Fig. 18B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0018]). Linear product formation is indicative of effective disruption of additional covalent modification during incubation by dilution in excess substrate (Fig. 18A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0018]). If product formation is not linear: consult Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-tbl-0003] for troubleshooting or proceed to Basic Data Analysis Protocol 3.\n         formula:\n\\begin{equation*} {F_t} = {F_0} + {{\\rm{v}}_{{\\rm{t^\\prime}}}}t \\end{equation*}\nEquation XIII for nonlinear regression of straight line Y = YIntercept + Slope*X with Y = signal Ft (in AU) and X = incubation time t (in s) to find YIntercept = background signal at reaction initiation F0 (in AU) and Slope = preincubation time–dependent product formation velocity vt′ (in AU/s).\n3. Proceed to Data Analysis Protocols to obtain the appropriate kinetic parameters for each covalent binding mode: Data Analysis Protocol 4Ai or 4Aii for two-step irreversible inhibitors and Data Analysis Protocol 4Bi or 4Bii for one-step irreversible inhibitors.\nSelection of a Data Analysis Method for inhibitors with an irreversible binding mode depends on the desired visual representation as well as personal preference. Generally, Basic Data Analysis Protocols 4Ai and 4Bi have less data processing/manipulation and are more informative for comparison of various inhibitors on a single enzyme target, as they are compatible with assessment of inhibitor potency simultaneous with visual assessment of time-dependent enzyme stability kctrl (Fig. 19F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019] and 19G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019] and Figs. 20F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020] and 20G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020]). Alternative Data Analysis Protocols 4Aii and 4Bii involve normalization of the enzyme activity that aids visual assessment of inhibitory potency of a single inhibitor on multiple enzyme targets (that might have a variable stability) (Fig. 19H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019] and 19I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019] and Fig. 20H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020] and 20I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020]).\n \n         \ntable:",
    "﻿Unnamed: 0_level_0,Data Analysis Protocol,Data Analysis Protocol,Data Analysis Protocol\nEXP Conditions,2-step IRREV,1-step IRREV,2-step REV\nkctrl = 0,4Ai/4Aii,4Bi/4Bii,–\nkdegE > 0,4Ai/4Aii,4Bi/4Bii,–\nExemplary assay concentrations during preincubation and during incubation.\n         \ntable:\n﻿Unnamed: 0,Concentration during preincubation t′,Concentration during preincubation t′.1,Concentration during preincubation t′.2,Concentrations during incubation t,Concentrations during incubation t.1,Concentrations during incubation t.2\n,[stock],V (µl),[conc]t′,[stock],V (µl),[conc]t\nEnzyme,200 nM,10,99 nM,–,1,1.0 nM\nInhibitor,2000 nM,10.2,1010 nM,–,1,10 nM\nSubstrate,–,–,–,10 µM,198,9.9 µM\nTotal,,20.2,,,200,\nData Analysis 4A: Preincubation Time–Dependent Inhibition With Dilution/Competition for Two-Step Irreversible Covalent Inhibition\nKinetic analysis of enzyme activity with dilution/competition after preincubation in the presence of a two-step covalent inhibitor is similar to data analysis of preincubation without dilution/competition (Data Analysis 3A), with the exception that longer incubation times are possible to calculate enzyme activity vt′ from the slope (Fig. 19A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019] and 19B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019]), and enzyme activity without preincubation vi should be equal to the uninhibited enzyme activity vctrl (Fig. 19C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019]). Contrary to Method III, this does not imply that the inhibitors show one-step behavior: it merely confirms that extensive dilution/substrate competition successfully induced inhibitor dissociation from noncovalent EI complex to unbound enzyme. It is essential to plot the rate of covalent adduct formation kobs against the inhibitor concentration during preincubation (Fig. 19D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019]) to obtain kinetic parameters: kobs is based on the formation of EI* during preincubation, and the inhibitor concentration during preincubation is much higher than the inhibitor concentration after dilution in substrate ([I]t′ >> [I]t).\nWarnings and remarks",
    "Insufficient dilution/competition will partially disrupt noncovalent EI complex, resulting in a time-dependent decrease of enzyme activity due to formation of EI* after substrate addition (Fig. 19B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019]) and deviation from vi = vctrl, as noncovalent complex EI contributes to inhibition without preincubation (Fig. 19C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019]). Increasing substrate concentration and/or dilution in a larger volume might resolve this. Alternatively, enzyme activity with partial disruption of noncovalent EI analyzed with Data Analysis 3A still results in reliable estimates of kobs. Please note that, although detection based only on covalent adduct formation allows analysis of two-step inhibitors displaying tight-binding behavior (very high noncovalent affinity resulting in full inhibition at all inhibitor concentrations), these inhibitor concentrations are saturating if they comply with the rapid equilibrium approximation (Ki ≈ KI); thus, it would only be possible to determine the lower limit of kinact and the upper limit of KI (Fig. 2G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0002]).\nCorrection for enzyme (in)stability during preincubation by correcting for the rate of spontaneous degradation kctrl has been reported (Obach, Walsky, & Venkatakrishnan, 2007[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0062]) for dilution experiments with irreversible covalent inhibitors (Fig. 19E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019]-G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019]). Alternatively, enzyme activity after preincubation vt′ can be normalized to the uninhibited enzyme activity after preincubation vt′ctrl (Fig. 19H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019] and 19I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019]).",
    "Processing of experimental data obtained with Basic Protocol IV that has been processed according to Basic Data Analysis Protocol 4 for two-step irreversible inhibitors.\n1. Plot vt′ against preincubation time t′ for each inhibitor concentration.\nPlot the mean and standard deviation of vt′ (in AU/s) on the Y-axis against preincubation time t′ (in s) on the X-axis for each inhibitor concentration and the uninhibited control (Fig. 19C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019]). Validate that inhibitor concentrations are not too high: inhibition should be less than 100% at the shortest t′ for at least six inhibitor concentrations. Check whether the uninhibited enzyme activity is independent of preincubation time (v0ctrl = vt′ctrl, Fig. 19C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019]): an algebraic correction for enzyme instability (kctrl > 0, Fig. 19F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019]) can be performed in step 4 of this protocol by accounting for nonlinearity in the uninhibited control in the secondary kobs plot (Fig. 19G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019]). Alternatively, proceed to Alternative Data Analysis Protocol 4Bii to correct for enzyme instability (v0ctrl > vt′ctrl) by normalization of the enzyme activity vt′/vt′ctrl (Fig. 19H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019] and 19I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019]).\n2. Fit vt′ against preincubation time t′ to obtain kobs.\nFit the mean and standard deviation of vt′ against preincubation time t′ (Fig. 19C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019]/F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019]) for each inhibitor concentration to bounded exponential decay Equation VI (Fig. 18D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0018]) with shared value for initial velocity vi to obtain the observed reaction rate kobs (in s−1) from initial velocity vi (Y-intercept) to full inactivation (vs in fully inhibited control). A lack of initial noncovalent complex (vi = v0ctrl) is indicative of effective disruption of noncovalent interactions by dilution in excess substrate. Validate this by fitting without constraints for vi. Proceed to Basic Data Analysis Protocol 3Ai if deviations (vi < v0ctrl) are observed.\n         \nformula:\n\\begin{equation} {{\\rm{v}}_{{\\rm{t^\\prime}}}} = {\\rm{v}}_0^{{\\rm{ctrl}}}\\;{e^{ - {k_{{\\rm{obs}}}}{\\rm{t^\\prime}}}} \\end{equation}",
    "Equation VI for nonlinear regression of exponential one-phase decay equation Y = (Y0-Plateau)*EXP(-k*X) + Plateau with Y = preincubation time–dependent product formation velocity vt′ (in AU/s), X = preincubation time t′ (in s) and Plateau = final velocity vs = 0 or vs in fully inhibited control (in AU/s) to find Y0 = Y-intercept = initial velocity vi = uninhibited velocity v0ctrl (in AU/s, shared value) and k = observed reaction rate kobs (in s−1).\n3. Plot kobs against [I].\nPlot the mean and standard deviation of kobs (in s−1) on the Y-axis against inhibitor concentration (in M) during preincubation (before addition of substrate) on the X-axis (Fig. 19D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019]/G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019]). The plot of kobs against [I] should reach a maximum kobs at saturating inhibitor concentration. Note that a linear curve is indicative of one-step binding behavior at non-saturating inhibitor concentrations ([I] << 0.1KI in Fig. 3F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0003]) with vi = v0ctrl (shared Y-intercept in the previous step). Proceed to Basic Data Analysis Protocol 4Bi step 4 after it has been validated that the linear curve is not resultant from saturating inhibitor concentrations ([I] >> 10KI in Fig. 3G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0003]) as identified by vi << v0ctrl, by repeating the measurement with lower inhibitor concentrations.\n4. Fit kobs against [I] to obtain kinact and KI.\nFit kobs against inhibitor concentration during preincubation to Equation XV to obtain maximum inactivation rate constant kinact (in s−1) and inactivation constant KI (in M). Constrain kctrl = kobs of the uninhibited control (Fig. 19G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019]). Inactivation constant KI does not have to be corrected for substrate competition because preincubation is conducted in absence of competing substrate. Calculate irreversible covalent inhibitor potency kinact/KI (in M−1s−1) with propagation of error with Sample Calculation 2.\n         \nformula:\n\\begin{equation} {k_{{\\rm{obs}}}} = {k_{{\\rm{ctrl}}}} + \\frac{{{k_{{\\rm{inact}}}}{\\rm{\\;}}\\left[ {\\rm{I}} \\right]}}{{{{\\rm{K}}_{\\rm{I}}} + \\left[ {\\rm{I}} \\right]}}\\;\\; \\end{equation}",
    "Equation XV for nonlinear regression of user-defined explicit equation Y = Y0 + ((kmax*X)/((KI) + X)) with Y = observed reaction rate kobs (in s−1) and X = inhibitor concentration during preincubation (in M) to find Y0 = rate of nonlinearity in uninhibited control kctrl (in s−1), kmax = maximum reaction rate kinact (in s−1), and KI = Inactivation constant KI (in M).\n5. Optional: Validate experimental kinetic parameters with kinetic simulations.\nProceed to Kinetic Simulations 1 to compare the experimental read-out to the product formation simulated with scripts KinVol and KinVolDeg (using experimental rate constant kinact = k5) to confirm that the calculated kinetic constants are in accordance with the experimental data.",
    "Processing of experimental data obtained with Basic Protocol IV that has been processed according to Basic Data Analysis Protocol 4 for two-step irreversible inhibitors.\n1. Plot vt′ against preincubation time t′ for each inhibitor concentration.\nPlot the mean and standard deviation of vt′ (in AU/s) on the Y-axis against preincubation time t′ (in s) on the X-axis for each inhibitor concentration and the uninhibited control (Fig. 19C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019]). Validate that inhibitor concentrations are not too high: inhibition should be less than 100% at the shortest t′ for at least six inhibitor concentrations.\n2. Normalize vt′ to obtain vt′/vctrl.\nNormalize vt′ (in AU/s) of each inhibitor concentration and the controls to lowest value = 0 (or full inhibition control) and highest value = uninhibited product formation vt′ctrl (in AU/s) to obtain normalized enzyme activity vt′/vctrl (Fig. 19H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019]). Perform this correction separately for each preincubation time.\n3. Plot and fit vt′/vctrl against preincubation time t′ to obtain kobs.\nPlot the mean and standard deviation of vt′/vctrl on the Y-axis against preincubation time t′ (in s) on the X-axis (Fig. 19H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019]). Fit to exponential decay Equation XVI to obtain kobs (in s−1) from initial velocity vi/v0ctrl to full inactivation (Plateau = 0). A lack of initial noncovalent complex (vi = v0ctrl) is indicative of effective disruption of noncovalent interactions by dilution in excess substrate. Validate this by fitting without constraints for vi. Proceed to Basic Data Analysis Protocol 3Aii if deviations (vi < v0ctrl) are observed.\n         \nformula:\n\\begin{equation} \\left( {\\frac{{{{\\rm{v}}_{{\\rm{t^\\prime}}}}}}{{{\\rm{v}}_{{\\rm{t^\\prime}}}^{{\\rm{ctrl}}}}}} \\right) = {e^{ - {k_{{\\rm{obs}}}}{\\rm{t^\\prime}} }} \\end{equation}",
    "Equation XVI for nonlinear regression of exponential one-phase decay equation Y = (Y0-Plateau)*EXP(-k*X) + Plateau with Y = normalized preincubation time–dependent product formation velocity vt′/vctrl (unitless), X = preincubation time t′ (in s), Y0 = Y-intercept = normalized initial velocity vi/v0ctrl = 1 (unitless), and Plateau = normalized final velocity vs/vsctrl = 0 (unitless) to find k = observed reaction rate kobs (in s−1).\n4. Plot kobs against [I].\nPlot the mean and standard deviation of kobs (in s−1) on the Y-axis against inhibitor concentration (in M) during preincubation (before addition of substrate) on the X-axis (Fig. 19I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019]). The plot of kobs against [I] should reach a maximum kobs at saturating inhibitor concentration. Note that a linear curve is indicative of one-step binding behavior at non-saturating inhibitor concentrations ([I] << 0.1KI in Fig. 3F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0003]) with vi = v0ctrl (shared Y-intercept = 1 in the previous step). Proceed to Basic Data Analysis Protocol 4Bii step 5 after it has been validated that the linear curve is not resultant from saturating inhibitor concentrations ([I] >> 10KI in Fig. 3G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0003]) as identified by vi << v0ctrl (shared Y-intercept = 0 in the previous step), by repeating the measurement with lower inhibitor concentrations.\n5. Fit kobs against [I] to obtain kinact and KI.\nFit kobs against inhibitor concentration during preincubation to Equation XVII to obtain maximum inactivation rate constant kinact (in s−1) and inactivation constant KI (in M) (Fig. 19I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0019]). Do not correct for enzyme instability (kctrl > 0), as this correction has already been performed by normalizing vt′. Inactivation constant KI does not have to be corrected for substrate competition because preincubation is conducted in absence of competing substrate. Calculate irreversible covalent inhibitor potency kinact/KI (in M−1s−1) with propagation of error with Sample Calculation 2\nformula:",
    "\\begin{equation} {k_{{\\rm{obs}}}} = \\frac{{{k_{{\\rm{inact}}}}{\\rm{\\;}}\\left[ {\\rm{I}} \\right]}}{{{{\\rm{K}}_{\\rm{I}}} + \\left[ {\\rm{I}} \\right]}}\\;\\; \\end{equation}\nEquation XVII for nonlinear regression of user-defined explicit equation Y = Y0+((kmax*X)/((KI) + X)) with Y = observed reaction rate kobs (in s−1), X = inhibitor concentration during preincubation (in M), and Y0 = 0 (in s−1) to find kmax = maximum reaction rate kinact (in s−1) and KI = Inactivation constant KI (in M).\n6. Optional: Validate kinetic parameters with kinetic simulations by proceeding to Basic Data Analysis Protocol 4Ai step 5.\nData Analysis 4B: Preincubation Time–Dependent Inhibition With Dilution/Competition for One-Step Irreversible Covalent Inhibition\nKinetic analysis of enzyme activity with dilution/competition after preincubation in presence of a one-step covalent inhibitor is almost identical to data analysis of preincubation without dilution in excess substrate (Data Analysis 3B), with the exception that longer incubation times are possible to calculate enzyme activity vt′ from the slope (Fig. 20A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020]-C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020]). It is essential to plot the rate of covalent adduct formation kobs against the inhibitor concentration during preincubation (Fig. 20D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020]) to obtain kinetic parameters: kobs is based on the formation of EI* during preincubation, and the inhibitor concentration during preincubation will be much higher than the inhibitor concentration after dilution in substrate ([I]t′ >> [I]t).\nWarnings and remarks",
    "Dilution/competition does not disrupt any noncovalent EI complex, as this is non-existent for one-step inhibitors, but the rate of covalent adduct formation kobs should be negligible after dilution in excess substrate, to prevent formation of covalent EI*. Insufficient dilution and/or competition (Δ[EI*]t > 0) can result in time-dependent decrease of enzyme activity due to formation of EI* after substrate addition (Fig. 20B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020]). Increasing substrate concentration and/or dilution in a larger volume might resolve this if necessary, but simply performing analysis with Data Analysis Protocol 3B also results in reliable estimates of kobs. Inhibitor concentrations that reach reaction completion during the shortest preincubation time should be excluded from the fit (highest concentration in Fig. 20C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020]) as these fits are not reliable.\nCorrection for enzyme (in)stability during preincubation by correcting for the rate of spontaneous degradation kctrl has been reported (Obach et al., 2007[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-bib-0062]) for dilution experiments with irreversible covalent inhibitors (Fig. 20E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020]-G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020]). Alternatively, enzyme activity after preincubation vt′ can be normalized to the uninhibited enzyme activity after preincubation vt′ctrl (Fig. 20H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020] and 20I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020]).",
    "Processing of experimental data obtained with Basic Protocol IV that has been processed according to Basic Data Analysis Protocol 4 for one-step irreversible covalent inhibitors and two-step irreversible inhibitors at non-saturating inhibitor concentrations ([I] ≤ 0.1KI).\n1. Plot vt′ against preincubation time t′ for each inhibitor concentration.\nPlot the mean and standard deviation of vt′ (in AU/s) on the Y-axis against preincubation time t′ (in s) on the X-axis for each inhibitor concentration and the uninhibited control (Fig. 20C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020]). Validate that inhibitor concentrations are not too high: inhibition should be less than 100% at the shortest t′ for at least six inhibitor concentrations. Check whether the uninhibited enzyme activity is independent of preincubation time (v0ctrl = vt′ctrl, Fig. 20C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020]): an algebraic correction for enzyme instability (kctrl > 0, Fig. 20F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020]) can be performed in step 4 of this protocol by accounting for nonlinearity in the uninhibited control in the secondary kobs plot (Fig. 20G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020]). Alternatively, proceed to Alternative Data Analysis Protocol 4Bii to correct for enzyme instability (v0ctrl > vt′ctrl) by normalization of the enzyme activity vt′/vt′ctrl (Fig. 20H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020] and 20I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020]).\n2. Fit vt′ against preincubation time t′ to obtain kobs.\nFit the mean and standard deviation of vt′ against preincubation time t′ (Fig. 20C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020]/F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020]) for each inhibitor concentration to bounded exponential decay Equation VI (Fig. 18D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0018]). Constrain initial velocity vi to a shared value to obtain observed reaction rate kobs (in s−1) from initial velocity vi (Y-intercept) to full inactivation (vs = 0 or value in fully inhibited control).\n         \nformula:\n\\begin{equation} {{\\rm{v}}_{{\\rm{t^\\prime}} }} = {\\rm{v}}_0^{{\\rm{ctrl}}}{e^{ - {k_{{\\rm{obs}}}}{\\rm{t^\\prime}} }} \\end{equation}",
    "Equation VI for nonlinear regression of exponential one-phase decay equation Y = (Y0-Plateau)*EXP(-k*X) + Plateau with Y = preincubation time–dependent product formation velocity vt′ (in AU/s), X = preincubation time t′ (in s), and Plateau = final velocity vs = 0 or vs in fully inhibited control (in AU/s) to find Y0 = Y-intercept = initial velocity vi = uninhibited velocity v0ctrl (in AU/s, shared value) and k = observed reaction rate kobs (in s−1).\n3. Plot kobs against [I].\nPlot the mean and standard deviation of kobs (in s−1) on the Y-axis against inhibitor concentration (in M) during preincubation (before addition of substrate) on the X-axis (Fig. 20D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020]/G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020]). The plot of kobs against inhibitor concentration [I] is linear for one-step irreversible inhibitors and for two-step irreversible inhibitors at non-saturating inhibitor concentrations ([I] << 0.1KI).\n4. Fit kobs against [I] to obtain kchem.\nFit kobs against inhibitor concentration during preincubation (in M) to Equation XVIII to obtain inhibitor potency kchem (in M−1s−1) from the linear slope. Constrain Y-intercept kctrl = kobs of the uninhibited control (Fig. 20G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020]). Inhibitor potency kchem does not have to be corrected for substrate competition because preincubation is conducted in absence of competing substrate. Calculate kinact/KI (in M−1s−1) for two-step irreversible inhibitors at non-saturating inhibitor concentrations ([I] ≤ 0.1KI) with propagation of error with Sample Calculation 9.\n         \nformula:\n\\begin{equation} {k_{{\\rm{obs}}}} = {k_{{\\rm{ctrl}}}} + {k_{{\\rm{chem}}}}\\left[ {\\rm{I}} \\right] \\end{equation}\nEquation XVIII for nonlinear regression of straight line Y = YIntercept + Slope*X with Y = observed reaction rate kobs (in s−1) and X = inhibitor concentration during preincubation (in M) to find YIntercept = rate of nonlinearity in uninhibited control kctrl (in s−1) and Slope = inactivation rate constant kchem (in M−1s−1).\n5. Optional: Validate experimental kinetic parameters with kinetic simulations.",
    "Proceed to Kinetic Simulations 1 to compare the experimental read-out to the product formation simulated with scripts KinVol and KinVolDeg (using experimental rate constant kchem = k3), to confirm that the calculated kinetic constants are in accordance with the experimental data.",
    "Processing of experimental data obtained with Basic Protocol IV that has been processed according to Basic Data Analysis Protocol 4 for one-step irreversible covalent inhibitors and two-step irreversible inhibitors at non-saturating inhibitor concentrations ([I] ≤ 0.1KI).\n1. Plot vt′ against preincubation time t′ for each inhibitor concentration.\nPlot the mean and standard deviation of vt′ (in AU/s) on the Y-axis against preincubation time t′ (in s) on the X-axis for each inhibitor concentration and the uninhibited control (Fig. 20C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020]). Validate that inhibitor concentrations are not too high: inhibition should be less than 100% at the shortest t′ for at least six inhibitor concentrations.\n2. Normalize vt′ to obtain vt′/vctrl.\nNormalize vt′ (in AU/s) of each inhibitor concentration and the controls to lowest value = 0 (or full inhibition control) and highest value = uninhibited product formation vt′ctrl (in AU/s) to obtain normalized enzyme activity vt′/vctrl (Fig. 20H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020]). Perform this correction separately for each preincubation time.\n3. Plot and fit vt′/vctrl against preincubation time t′ to obtain kobs.\nPlot the mean and standard deviation of vt′/vctrl on the Y-axis against preincubation time t′ (in s) on the X-axis (Fig. 20H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020]). Fit to exponential decay Equation XVI to obtain kobs (in s−1) from initial velocity vi/v0ctrl (shared value) to full inactivation (Plateau = 0).\n         \nformula:\n\\begin{equation} \\left( {\\frac{{{{\\rm{v}}_{{\\rm{t^\\prime}} }}}}{{{\\rm{v}}_{{\\rm{t^\\prime}} }^{{\\rm{ctrl}}}}}} \\right) = {e^{ - {k_{{\\rm{obs}}}}{\\rm{t^\\prime}} }} \\end{equation}\nEquation XVI for nonlinear regression of exponential one-phase decay equation Y = (Y0-Plateau)*EXP(-k*X) + Plateau with Y = normalized preincubation time–dependent product formation velocity vt′/vctrl (unitless), X = preincubation time t′ (in s), Plateau = normalized final velocity vs/vsctrl = 0 (unitless), and Y0 = Y-intercept = normalized initial velocity vi/v0ctrl = 1 (unitless) to find k = observed reaction rate kobs (in s−1).\n4. Plot kobs against [I].",
    "Plot the mean and standard deviation of kobs (in s−1) on the Y-axis against inhibitor concentration (in M) during preincubation (before addition of substrate) on the X-axis (Fig. 20I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020]). The plot of kobs against inhibitor concentration [I] is linear for one-step irreversible inhibitors and for two-step irreversible inhibitors at non-saturating inhibitor concentrations ([I] << 0.1KI).\n5. Fit kobs against [I] to obtain kchem.\nFit kobs against inhibitor concentration during preincubation to Equation XIX to obtain inhibitor potency kchem (in M−1s−1) from the linear slope (Fig. 20I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.419#cpz1419-fig-0020]). Do not correct for enzyme instability (kctrl > 0), as this correction has already been performed by normalizing vt′ to vt′/vctrl in step 2 of this protocol. Inhibitor potency kchem does not have to be corrected for substrate competition because preincubation is conducted in absence of competing substrate. Calculate kinact/KI (in M−1s−1) for two-step irreversible inhibitors at non-saturating inhibitor concentrations ([I] ≤ 0.1KI) with propagation of error with Sample Calculation 9. Alternatively, inhibitor potency kchem (in M−1s−1) or kinact/KI (in M−1s−1) can be directly calculated from a single kobs (s−1) and [I] (in M) with Sample Calculation 10.\n         \nformula:\n\\begin{equation} {k_{{\\rm{obs}}}} = {k_{{\\rm{chem}}}}\\left[ {\\rm{I}} \\right] \\end{equation}\nEquation XIX for nonlinear regression of straight line Y = YIntercept + Slope*X with Y = observed reaction rate kobs (in s−1), X = inhibitor concentration during preincubation (in M), and YIntercept = 0 (in s−1) to find Slope = inactivation rate constant kchem (in M−1s−1).\n6. Optional: Validate experimental kinetic parameters with kinetic simulations by proceeding to Basic Data Analysis Protocol 4Bi step 5."
  ],
  "subjectAreas": [
    "Chemical Biology"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}