{
  "id": 19227,
  "origin_website": "Jove",
  "title": "Sequencing of Bacterial Microflora in Peripheral Blood: our Experience with HIV-infected Patients",
  "procedures": [
    "Handling of HIV infected blood samples requires some important recommendations.\n \n All specimens of blood must be transported in robust leak-proof containers. Care must be taken when collecting the specimen to avoid contamination of the container’s exterior and of \n any paperwork accompanying the specimen.\n \n All persons processing infected blood must wear gloves. Gloves must be changed and hands washed after completion of specimen processing.\n \n Processing of HIV-infected blood samples must be done in a class II biohazard cabinet hood. \n \n Mechanical pipetting aids should be used. \n \n Use of needles or other sharps (including glass e.g. pipettes or capillary tubes) must be limited to situations in which there is no alternative.\n \n Laboratory surfaces must be decontaminated with an appropriate chemical disinfectant after a spill of blood and when work activities are completed.\n \n Contaminated materials used must be decontaminated before reuse or must be disposed of correctly via the clinical waste route.\n \n Every incident of occupational exposure to potentially infectious blood or fluids (i.e., those requiring universal precautions) \n should be treated as a medical emergency as interventions must be initiated promptly to be effective.\n \n The protocol requires 5 days for its completion. The timeframe is detailed in Figure 1.\n \n Bacterial species are identified using the methods described in  Figure 2.\n1. Sample Collection\n9 ml of whole  blood is drawn into EDTA containing tubes.\nTubes are centrifuged at 2000 rpm for 10 minutes at RT to obtain plasma.\nPlasma is collected in a sterile 2 ml Eppendorf-tube.\n2. DNA Extraction from Plasma Samples\nAdequately disinfect hood, pipettes and material needed for the experiment in order to guarantee sterility.\nPosition all materials under UV lights for at least 30 minutes.\nWipe gloves with a disinfectant.",
    "Soak a few paper towels in ethanol and place them under the hood. Every time a tip is discarded wipe the pipette on the wet paper towels.\nDNA is extracted using a commercial kit following manufacturer’s instructions (Easy-DNA Kit, Invitrogen, Carlsbad CA, USA).\n350 μL of plasma are placed in a sterile 2ml eppendorf tube.\n350 μL of filtered ultrapure water are used as negative control.\nAdd 10 μL of lysozyme (1mg/ml) to the samples.\nIncubate for 30 minutes at 37°C.\nAdd 500 μL of Lysis Solution and mix gently to the samples.\nIncubate for 7 minutes at 65°C.\nAdd 900 μL of chloroform to the samples.\nVortex vigorously until the samples are uniformly viscous.\nAdd 200 μL of Precipitation Solution and vortex vigorously.\nCentrifuge samples at 10500 rpm for 10 minutes at RT to separate the phases and form the interface.\nTransfer the upper aqueous phase to a fresh microcentrifuge tube containing 1 ml of ethanol 100%.\nCentrifuge samples at 10500 rpm for 10 minutes at 4°C.\nRemove ethanol.\nAdd 1ml of ethanol 70%.\nCentrifuge samples at maximum speed for 10 minutes at 4°C.\nRemove ethanol. The residual ethanol should be removed with a pipettator.\nResuspend the pellet in 50 μL of  ultrapure water.\nRead DNA concentration with a spectrophotometer.\n3. 16S rRNA Gene PCR\n PCR amplification is performed as previously described 9.\nAmplify DNA in a 100 μL reaction mixture consisting of 10 μL of 10X PCR buffer, 5 μL of 25 mM MgCl2, 5 μL of 2 mM total dNTPs, \n  1 μL of 50 μM primer RW01 (AACTGGAGGAAGGTGGGGAT), 1 μL of 50 μM primer DG74 (AGGAGGTGATCCAACCGCA),  34 μL of H20 and 0.5 \n  μL of Taq polymerase (AmpliTaq Gold, Applied Biosystem, Foster City, CA, USA).",
    "Transfer the PCR mix in filters in order to avoid possible contamination by bacterial Taq polymerase.\nCentrifuge filters (Microcon, Millipore, Billerica, MA, USA) for 30 minutes at 500 rcf at 4°C.\nAliquot the PCR mix according to the number of samples which need to be amplified (positive and negative PCR controls, \n  samples and extracted water).\nUse the following thermal cycler conditions: 94°C for 10 minutes; 40 times for 1 minute each time at 94°C, 55°C and 72°C, \n  and 10 min at 72°C.\nVisualize the PCR product on a 2% agarose gel. Use 100 bp DNA ladder. PCR product size is about 360 bp (Figure 3).\n4. PCR Product Purification\nOnly PCR positive samples should be purified. Purification is performed using a commercial kit following manufacturer’s instructions (PureLink PCR microkit, Invitrogen, Carlsbad CA, USA).\nAdd 4 volumes of Binding Buffer containing isopropanol per 1 volume of PCR product.\nTransfer PCR product with Binding Buffer to a column.\nCentrifuge for 1 minute at 10000 rcf at RT.\nWash column with Wash Buffer containing ethanol.\nCentrifuge for 1 minute at 10000 rcf at RT.\nCentrifuge at maximum speed for 1 minute at RT to dry the silica membrane and remove any residual Wash Buffer with ethanol.\nAdd 10 μL of ultrapure water.\nIncubate for 1 minute at RT.\nCentrifuge at maximum speed for 2 minutes at RT to collect the purified DNA.\n5. Cloning\nLysogeny Broth (LB) Plate Preparation\nDissolve 25 gr of LB mix in approximately 800 ml of water.\nBring the final volume to 1 L.\nAdd 15 gr of Bactoagar.\nAutoclave for 20 minutes.\nAfter autoclaving, vigorously swirl the solution in the flask to mix molten agar.\nCool the solution to 50°C.\nAdd  Ampicillin (50 μg/ml) and swirl until it dissolves.\nPour plates to a depth of approximately 3mm.",
    "Leave the plates out at room temperature.\nSpread X-Gal (40mg/ml) and IPTG (100 mM) on each LB plate and incubate at 37°C until ready for use.\nCompetent  Cells Transformation\nTransformation is performed using a commercial kit following manufacturer’s instructions (Topo TA cloning kit, Invitrogen, Carlsbad CA, USA).\nPrepare the cloning reaction mix (1-4 μL of fresh PCR product, 1 μL of salt solution, 1 μL of vector and water if necessary).\nMix reaction gently and incubate for 5-10 minutes at RT.\nPlace the reaction on ice.\nAdd 2 μL of the cloning reaction into a vial of competent cells and mix gently.\nIncubate on ice for 30 minutes.\nHeat-shock the cells for 30 seconds at 42°C.\nImmediately transfer the tube into ice.\nAdd 250 μL of medium.\nCap the tube tighly and shake the tube horizontally at 37°C for 1 hour.\nSpread 50 μL from each transformation on a prewarmed selective plate.\nIncubate overnight at 37°C.\nFollowing incubation, white and blue colonies develop on plates. White colonies are positive for PCR product insertion and blue colonies are negative for PCR product insertion.\n6. Sequencing Analysis\nSequencing Reaction\nA mix is made using these reagents: 2,5 μl DNA, 1 μl primer (5pmol/ μl) 1,1 μl BigDye (Applied Biosystem, Foster City, CA, USA ).\nThermal cycler conditions: 96°C for 1 minutes; 25 times for 96°C for 10 sec, 55°C for 15 sec and 60°C for 4 min.\nColumn Purification\nFor each reaction, prepare one MicroSpin Column (Qiagen, , Milan, Italy).\nInvert column and vortex to mix resin.\nSnap off the bottom of column, loosen lid ¼ turn, and place column in a microcentrifuge tube.\nCentrifuge 3200 rpm for 1 minute.\nTransfer column to a clean microcentrifuge tube.\nCarefully pipet the entire PCR sequencing reaction into the center of the column.",
    "Centrifuge 3200 rpm for 1 minute.\nPurified DNA will eluite into tube (20 μl of ultrapure water).\nSequencing Analysis\nLoad the purified sample (20 μl) into 96-multiwell plate.\nLoad the plate into the sequencer. Automated DNA Sequencers generate a four-color chromatogram showing the results of the sequencing \n  run.\nInput the nucleotide sequence as a query against the public sequence databases. The search is performed on the NCBI databases and \n  servers, with Basic Local Alignment Search Tool (BLAST).\nConsider only bacteria with 98-100% homologies.\n7. Representative Results\nimgsrc://cloudfront.jove.com/files/ftp_upload/2830/2830fig1.jpg\nFigure 1. Timeline of the procedure.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2830/2830fig2.jpg\nFigure 2. Flow charts of the entire bacterial identification procedure.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2830/2830fig3.jpg\nFigure 3. 2% agarose gel showing broad range 16S rRNA gene PCR products. Lane 1 contains a 100bp DNA ladder, lane 2 contains \n the PCR positive control, lane 3 shows the negative PCR control. Lane 4 shows samples from an HIV-positive patient, and lane 5 contains water.\n Lane 6 shows samples from a healthy individual and a negative PCR reaction; lane 7 contains water. Only HIV positive patients displays a \n positive PCR amplification. Ultrapure water used as a negative control during the extraction step, indicates that no contamination occurred.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2830/2830fig4.jpg\nFigure 4. 0.7% agarose gel showing plasmid extracted with miniprep procedure. Lane 1 contains a 1 Kilobase DNA ladder, lane 2 \n contains the blue control colony, lanes 3 through 12 contain white colonies. The plasmid from the blue colony does not contain the PCR product\n insert. All 10 white colonies contain plasmid with the correct insert.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2830/2830fig5.jpg",
    "Figure 5. Shows an example of bacterial sequencing analysis in plasma from one HIV-positive individual. Our results show that microbial translocation in HIV disease involves a polimicrobic flora, which is not seen in HIV-negative subjects, suggesting substantial failure of gut immunity in controlling bacteria translocation.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}