{
  "id": 15390,
  "origin_website": "Jove",
  "title": "Merging Absolute and Relative Quantitative PCR Data to Quantify STAT3 Splice Variant Transcripts",
  "procedures": [
    "NOTE: Peripheral blood eosinophils were received without identifying information in accord with a protocol approved (#2013-1570) by the University of Wisconsin-Madison Center for Health Sciences Institutional Review Board. Signed informed consent from the donor was obtained for the use of each sample in research.\n1. Creating Plasmids as Template Standards\nCreate primers for an amplicon spanning both STAT3 splice sites, with 5'- KpnI and NheI restriction sites (and 5'-extensions) as per Table 1a.\n\tNOTE: KpnI and NheI sites were chosen to enable inserts to be ligated into a modified pET-28a vector with kanamycin resistance25,26. KpnI site had been added into the multiple cloning site.\nUsing freshly donated eosinophils, prepare duplicate samples of 2.5 x 106 cells/ml in cell culture medium (Roswell Park Memorial Institute (RPMI)1640 medium). Incubate for 1 hr at 37 °C under 5% CO2 and 10% humidity.\n\t\nPrepare complementary (c)DNA from samples (at least 1 x 106 cells per preparation) as per manufacturer's instructions using the RNA extraction and cDNA synthesis kits.\nFrom template cDNA prepared in step 1.2.1, amplify STAT3 splice variants using amplification PCR as per Table 2a.\nResolve amplicons in 2% agarose Tris-acetate-ethylenediaminetetraacetate (TAE) gel27. Excise bands from the gel and purify according to gel excision kit instructions.\nCut amplicons and plasmid with appropriate restriction enzymes (overview of restriction in reference27), using volumes, incubation times and temperatures recommended by enzyme provider; and purify as in step 1.4. Ligate restricted amplicons into plasmid under provider-recommended conditions.\nPrepare a negative control (restricted plasmid DNA without insert but with ligase) and a positive control (unrestricted plasmid with kanamycin resistance). Perform standard plasmid transformations of competent E. coli DH5α28 using ligation mixtures27.",
    "Incubate transformed E. coli in 1 ml Luria-Broth (LB) medium (prepared as instructed27) shaking for 1 hr at 37 °C. Spread transformants on LB plates containing 50 µg/ml kanamycin and incubate at 37 °C overnight.\nPick several colonies from the STAT3 α and STAT3 β plates using sterile toothpicks27. Transfer each to 2 ml LB. Grow cultures overnight at 37 °C in a shaking incubator.\nPurify plasmids from bacterial cultures by following instructions provided in a DNA purification kit. Store plasmids at -20 or -80 °C.\nSequence plasmids from several colonies by preparing 20 µl sequencing reactions. Pipette 3 µl sequencing reaction buffer, 2 µl sequencing reaction mix, 12 µl ultrapure water, 1 µl plasmid as template and 2 µl sequencing primer.\n\tNOTE: If using pET-28a vector, use sequencing primer 5'-TAA TAC GAC TCA CTA TAG GGG-3'.\n\t\nAssess electrophoretograms of plasmids encoding each variant: Sα, Sβ, ΔSα and ΔSβ25.\nMeasure concentration of pure plasmid DNA in ng/µl. If reading absorbance at 260 nm using a spectrophotometer, calculate DNA concentration using the Beer-Lambert law29:\nimgsrc://cloudfront.jove.com/files/ftp_upload/54473/54473eq1.jpg\n\tWhere c = concentration, A = absorbance, ε (extinction coefficient) = 0.02 (µg/ml)-1 cm-1 for double-stranded DNA and L = path length of light (usually 1 cm).\nUsing the molecular weights of STAT3 splice variant cDNA amplicons and the vector, calculate the copy number per µl.\n\tNOTE: Molecular weight per base pair (bp) is estimated as 650 Da.\nimgsrc://cloudfront.jove.com/files/ftp_upload/54473/54473eq2.jpg\n2. Analyzing Primer Specificity for Absolute qPCR\nPrepare 1 in 10 dilution series of STAT3 plasmids, with ~108 to 103 copies per µl (20 µl) using ultrapure water. Measure concentration of most concentrated (~108 copies per µl, see step 1.11).",
    "Use diluted plasmids to prepare four \"non-target\" mixes (i.e., STAT3ΔSβ negative control containing equal concentrations of STAT3 Sα, ΔSα, Sβ but no ΔSβ) at 106 copies per µl each. Prepare a \"target\" mix with equal concentrations of all four templates each at 106 copies per µl.\nPrepare primer pair solutions for each splice variant (see Table 1b and Figure 1) by making ~60 µl of primers each at a 7 µM concentration (final concentration in sample will be 560 nM).\nDilute DNA polymerase/dsDNA-binding dye mix 7:5 with pure H2O.\nSet up Assay 1 in a 96-well PCR plate as shown in template (Table 3).\n\t\nAdd 21 µl diluted DNA polymerase/dsDNA-binding dye mix, then 2 µl of primer mix and 2 µl of template (as per Table 2b). Instead of template, add 2 µl filtered H2O to the no template control (NTC) well. Set up reactions in duplicate to assess repeatability30.\nSeal qPCR plate with adhesive cover and centrifuge for 5 min at 1,200 x g at 12 °C.\nIf using software listed on Materials, set up experiment as described.\n\t\nTurn on qPCR machine and insert sealed qPCR plate. Click File > New > Next > Select \"New detector\", choose reporter, quencher and provide name. Set up a \"new detector\" for each splice variant.\nSelect Next and set up standards as prompted on the Set Up Sample Plate page, ensuring quantities are entered into the table and appropriate detectors are selected. Click finish.\nSet up cycling as per Table 2b. Ensure that fluorescence reading (to determine Ct) occurs during the 72 °C step of each cycle. Select Run.\nWhen run is complete, click the Results tab > Amplification plot tab. Evaluate output amplification plot to assess data quality (look for an exponential plot, as in Figure 2).",
    "NOTE: Ensure amplification plots are mostly exponential and that the cycle threshold can be set at the exponential part of the plot. Ensure NTCs are not amplified and other standard points demonstrate a low Ct value with a high ΔRn.\nTo export results to spreadsheet software, click File > Export > Results.\n3. Assessing Absolute qPCR Assay Specificity and Repeatability\nRepeatability\n\t\nUse the data from Step 2.7.5 to calculate standard deviation of Ct (threshold cycle for fluorescence) values.\nimgsrc://cloudfront.jove.com/files/ftp_upload/54473/54473eq3.jpg\n\t\tWhere N = number of samples (2 if done in duplicate), imgsrc://cloudfront.jove.com/files/ftp_upload/54473/54473eq4.jpg = sample's Ct and imgsrc://cloudfront.jove.com/files/ftp_upload/54473/54473eq5.jpg = sample Ct mean. Check that the standard deviation of Ct values of duplicates is ≤0.2. Check that Ct values in all but NTC wells are smaller than 38.\nIf repeatability is poor optimize cycling parameters by either increasing or decreasing annealing time.\nPlot log copy number (as determined in Step 1.12 and prepared in Step 2.1) vs Ct value to create a standard curve; yielding the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/54473/54473eq6.jpg\n\tWhere y is Ct, m is the gradient, x is log(copy number) and b is the intercept value.\n\tNOTE: The R2 value of the linear regression will be ≥0.95 for good data.\nCalculate amplification efficiency using standard curve and the equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/54473/54473eq7.jpg\n\tNOTE: Aim for efficiency ≥75%.\nCalculate specificity from qPCR assay 1 using Too's formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/54473/54473eq8.jpg\n\tWhere ΔCtToo = Cttarget - Ctnon-target , describing the difference in threshold cycle number for specific and non-specific amplification\n\tNOTE: Specificity should exceed four orders of magnitude (i.e., specificity factor ≥4).\n\t\nIf specificity is poor, optimize by lowering primer concentration. Set up assays (as described in steps 2.5-2.7) with final primer concentrations ranging from 100 nM to 500 nM.\n4. Performing Relative qPCR Assays\nTreat Cells with Cytokines to Promote Transcription.",
    "For freshly donated eosinophils, prepare duplicate samples of 2.5 x 106 cells/ml in cell culture medium (RPMI 1640 medium) and treat with 50 ng/ml interleukin-3 (IL3) and/or 50 ng/ml tumor necrosis factor α (TNFα) for periods of 3, 6, 9 and 20 hr at 37 °C under 5% CO2 and 10% humidity.\nPrepare cDNA from eosinophil samples (at least 1 x 106 cells per preparation) as per manufacturer's instructions using the RNA extraction and cDNA synthesis kits.\nPrepare serial dilutions of two sample cDNA aliquots (control or resting samples), with a dilution range from \"1\" to \"1 in 1024\" dilution.\n\t\nFor the 1 in 4 dilution, pipette 1 µl cDNA and 3 µl ultrapure water.\nFor the 1 in 16 dilution, pipette 1 µl of the 1 in 4 dilution and 3 µl ultrapure water, etc.\nSet up PCR in 96-well plate with 25 µl reactions as described steps 2.3-2.5 but with several primer concentrations for pan-STAT3 and GUSB (see template in Table 4).\nAdd \"new detector\" for GUSB and follow steps 2.6-2.7, using the cycling parameters described in Table 2c.\nGenerate standard curves (see steps 3.2 and 3.3) to determine which primer concentrations result in 95-100% amplification efficiency.\nSet up plate with prepared cDNA samples (from Step 4.2) and optimized primer concentrations (see Table 2c for cycling parameters, reagents and Table 5 96-well plate template).\nPerform steps 2.6-2.7. Repeat assay at least once and check data quality.\nCalculate the average Ct value of duplicate sample Cts for both STAT3 and housekeeping gene GUSB.\nObtain ΔCt values for each sample.\nimgsrc://cloudfront.jove.com/files/ftp_upload/54473/54473eq9.jpg\nDesignate resting sample (usually has lowest concentration of transcript of interest) as Sample 0. Calculate ΔΔCt31 for each sample (here designated as sample X):\nimgsrc://cloudfront.jove.com/files/ftp_upload/54473/54473eq10.jpg\nCalculate fold-increase for each sample:\nimgsrc://cloudfront.jove.com/files/ftp_upload/54473/54473eq11.jpg\nReproducibility",
    "Calculate the coefficient of variation (CV) of copy number for pan-STAT3 and GUSB.\nimgsrc://cloudfront.jove.com/files/ftp_upload/54473/54473eq12.jpg\n\t\tWhere N = number of samples, = sample's calculated copy number and = sample mean. Check that CV of each sample (multiple assays) is ≤10%.\n5. Analyzing Absolute qPCR Data for Unknown Samples\nCompare Ct values obtained in relative qPCR (as described in step 4.9) for housekeeping gene GUSB to ensure samples' cDNA concentrations are within one order of magnitude.\n\t\nDilute cDNA accordingly (e.g., if sample 1 has a Ct value of ~17.5, and other samples' Ct values are ~21, sample 1 is roughly 2(21-17.5) = 11 times more concentrated. Perform a 1:1 dilution with ultrapure water within the same range without diluting more than necessary).\n\t\tNOTE: Vastly different starting concentrations will bias the linear regression analysis (step 4.12).\nSet up absolute qPCR assay of samples. Prepare assay 2a template plate for Sα and Sβ as per Table 6; and prepare assay 2b for ΔSα and ΔSβ as per Table 7. Carry out assays as described in steps 2.6-2.7.3 (and Table 2b). Repeat assays at least once.\nCheck data quality and export as described in steps 2.7.4-2.7.5.\nSet up absolute qPCR 96 well plate with 25 µl reactions using pan-STAT3 primers (primers in Table 1c, template in Table 8) at 400 µM and a mix of all four plasmids or a single plasmid at listed total concentrations.\n\tNOTE: Efficiency does not matter for absolute qPCR, but optimizing efficiency of these primers is important for relative qPCR (Step 4).\nSeal qPCR plate with adhesive cover and centrifuge for 5 min at 1,200 x g at 12 °C.\nSet up \"new detector\" for pan-STAT3 as in steps 2.7.1-2.7.3.",
    "Set up cycling for pan-STAT3 as per Table 2c (same conditions as relative qPCR). Ensure that fluorescence reading (to determine Ct) occurs during the 72 °C step of each cycle. Repeat assay at least once to ensure reproducibility.\nCheck data quality and export (see steps 2.7.4-2.7.5).\n\t\nIf amplification plots are not exponential (see Figure 2), dilute sample cDNA (1:10) and repeat assay as described (step 5.7).\nUsing the equation of the standard curve (see 3.2, Figure 3) and the Ct values of samples, calculate the copy number of each splice variant and of pan-STAT3 in each sample.\nimgsrc://cloudfront.jove.com/files/ftp_upload/54473/54473eq13.jpg\nPlot log (absolute qPCR copy number values obtained for pan-STAT3) vs log (cumulative absolute qPCR copy number values for STAT3 splice variants).\n\tNOTE: Ideal linear regression and slope values would both be ~1.\nCalculate repeatability (Step 3.1) and reproducibility (Step 4.13).\n6. Merging Absolute and Relative qPCR Data\nMultiply the proportion of variant with the total STAT3 fold-increase to calculate fold-increase of each splice variant.\nCalculate the standard deviations (see Step 3.1.1) of the absolute and relative values to account for propagation of error. Determine standard error of measurement (SEM) as shown:\nimgsrc://cloudfront.jove.com/files/ftp_upload/54473/54473eq14.jpg"
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}