{
  "id": 17608,
  "origin_website": "Jove",
  "title": "Segmentation and Linear Measurement for Body Composition Analysis using Slice-O-Matic and Horos",
  "procedures": [
    "The following study and protocols were reviewed and approved by the Institutional Review Board of Emory University.\n1. L3 CT Segmentation\nObtain the axial CT Digital Imaging and Communications in Medicine (DICOM) image.\n\t\nIn the image viewer, identify the L3 vertebra.\n\t\t\nIf possible, select two horizontal window views, and select coronal or sagittal view on the left for reference, and axial view on the right.\nClick on Cross Link to link the left and right windows.\nScroll down the images from cranial to caudal direction. Identify L1 vertebra, which is the first vertebra without a rib attachment.\nCount from L1 to L3 and use the coronal or sagittal view to identify the slice of the middle of L3. This is identified as the point at which both transverse processes are able to be maximally and equally visualized.\nSelect the L3 slice. From the Exam tab, select Send Exam and save the image as a DICOM file.\n\t\t\tNOTE: Step 1 is a pre-processing step and is listed here to demonstrate how to obtain an L3 image. If the researcher already has an L3 image, they can go to step 2. If the image viewer does not enable cross-referencing, the researcher can skip 1.1.1 to 1.1.2. If the imaging does not include thoracic region, identify L5, which is anterior to the sacrum, and count from L5 to L3, keeping in mind that the presence of a sixth lumbar vertebra is a normal variant.\nOpen the DICOM image with Slice-O-Matic Software.\nDrag the DICOM file to anywhere on the Slice-O-Matic window.\nSelect Modes | Region Growing to begin segmentation.",
    "If the version of Slice-O-Matic has Alberta Protocol options at the top of the Modes list of options, then one can also select Step 3: Segmentation to begin segmentation. If using Step 3: Segmentation, complete step 5, and then proceed to step 11.\nSelect Tools | Tag Lock. This will enable the user to \"lock\" tagged colors to ensure they are not accidently colored over or erased later on.\nSkeletal Muscle Identification: Click on 1 (Red) under the Region Growing area on the left side of the screen.\n\t\nClick on the Off button by Lower Limit to turn it to On. Click on the arrows by Mouse Wheel to set Disabled to Lower Limit. Drag the slider on Lower Limit to set Hounsfield Unit (HU) threshold as close to -29 as possible, then use the mouse wheel to set HU threshold exactly to -2913.\nClick on the Off button by Upper Limit to turn it to On. Click on the arrows by Mouse Wheel to set Lower Limit to Upper Limit. Drag the slider on Upper Limit to set HU threshold as close to 150 as possible, then use the mouse wheel to set HU threshold exactly to 15013.\nIntramuscular Adipose Tissue (IMAT) Identification: Click on 2 (Green) under the Region Growing area on the left side of the screen.\n\t\nClick on the Off button by Lower Limit to turn it to On. Click on the arrows by Mouse Wheel to set Disabled to Lower Limit. Drag the slider on Lower Limit to set HU threshold as close to -190 as possible, then use the mouse wheel to set HU threshold exactly to -19013.",
    "Click on the Off button by Upper Limit to turn it to On. Click on the arrows by Mouse Wheel to set Lower Limit to Upper Limit. Drag the slider on Upper Limit to set HU threshold as close to -30 as possible, then use the mouse wheel to set HU threshold exactly to -3013.\nVisceral Adipose Tissue (VAT) Identification: Click on 5 (Yellow) under the Region Growing area on the left side of the screen.\n\t\nClick on the Off button by Lower Limit to turn it to On. Click on the arrows by Mouse Wheel to set Disabled to Lower Limit. Drag the slider on Lower Limit to set HU threshold as close to -150 as possible, then use the mouse wheel to set HU threshold exactly to -15013.\nClick on the Off button by Upper Limit to turn it to On. Click on the arrows by Mouse Wheel to set Lower Limit to Upper Limit. Drag the slider on Upper Limit to set HU threshold as close to -50 as possible, then use the mouse wheel to set HU threshold exactly to -5013.\nSubcutaneous Adipose Tissue (SAT) Identification: Click on 7 (Cyan) under the Region Growing area on the left side of the screen.\n\t\nClick on the Off button by Lower Limit to turn it to On. Click on the arrows by Mouse Wheel to set Disabled to Lower Limit. Drag the slider on Lower Limit to set HU threshold as close to -190 as possible, then use the mouse wheel to set HU threshold exactly to -19013.",
    "Click on the Off button by Upper Limit to turn it to On. Click on the arrows by Mouse Wheel to set Lower Limit to Upper Limit. Drag the slider on Upper Limit to set HU threshold as close to -30 as possible, then use the mouse wheel to set HU threshold exactly to -3013.\nUse the + and - keys on the keyboard to zoom in and out of the CT image. Adjust the zoom as necessary throughout segmentation to clearly and accurately tag tissues.\nBegin segmenting by selecting 1 for Skeletal Muscle tissue (SM).\n\t\nSet the brush option to Paint.\nUse the brush tools found directly under Region Growing to adjust to the desired size of the brush and begin painting over the Psoas, Paraspinal Muscle groups, oblique, and rectus muscle groups.\n\t\tNOTE: If fluids or organs outside the muscle fascia is tagged in red as muscle, be sure to clear the tagging using the None color selection.\nOnce all the muscles are tagged, select 1 in the TAG Lock menu at the bottom left of the screen. This will ensure no muscle is accidently re-tagged or erased as segmentation proceeds.\nSelect 2 under Region Growing and paint over all fat tissues (IMAT) within the muscle fascia. Be sure to use the None color selection if any fat or structures outside the muscle fascia are mistakenly tagged as IMAT.\n\tNOTE: The edges of the muscle fascia usually appear lighter than the visceral or subcutaneous fat surrounding it. Be sure to tag all the fat within the lighter edges of the muscle fascia as IMAT and not VAT or SAT. If the linea alba is not tagged as muscle, the entirety of the linea alba should be analyzed as IMAT.",
    "Once all IMAT is tagged, select 2 from the TAG Lock menu at the bottom left of the screen.\nSelect 5 from the Region Growing menu to tag the VAT tissue.\n\t\nWhen tagging VAT, depending on the image, it may be easier to use Grow 2D instead of Paint.\nIf using Grow 2D, use the smallest Paint Brush option. If using Grow 2D be sure to look back over all tagged VAT and make sure no intralumenal tissue inside intestines or organs is mistakenly tagged, since that fat is usually from either digesting food or other structures which are not VAT.\nIf using Paint be sure to not paint inside the lumen of organs or the intestines.\nOnce all VAT is tagged, select 5 from the TAG Lock menu at the bottom left of the screen.\nSelect 7 from the Region Growing menu to tag SAT tissue.\n\t\nWhen tagging SAT, depending on the image, it is usually easier to use Grow 2D instead of Paint.\nIf using Grow 2D, use the smallest Paint Brush option.\nIf using Grow 2D be sure to go back over the edges of the image with the None tool selected to be sure no tissue within the muscle fascia is tagged as SAT and to be sure no skin is tagged as SAT.\n\t\t​NOTE: Skin is usually lighter in appearance than SAT and is usually around 2-3 pixels thick, but be aware that skin's appearance and thickness may vary from image to image.\nIf using Paint, be sure to take care around the edges, particularly around the skin to ensure no tissue is incorrectly tagged.",
    "When finished tagging tissues, go to Tools | Tag Surface/Volume. This will display the Surface area and volume of each of the tissues tagged, typically the interest is in the surface area.\n\t\nClick on Display in Window to fully open the Tag Surface/Volume window. This will also display HU values.\nRecord the surface area and HU threshold values.\n\t\tNOTE: If the Tag Surface/Volume window does not appear in the bottom left of the screen, it may be because there is not enough room to display it. In this case, be sure the Slice-O-Matic window is maximized and then select Tools | Tag Lock to remove the Tag Lock window. This should make enough space to display the Tag Surface/Volume window.\nWhen complete, go to File | Save TAG Files. This will save a TAG file where the DICOM file is located.\n2. L3 MRI Segmentation\nObtain the axial MRI (T2-weighted sequences) DICOM image\n\t\nIn the image viewer, identify the L3 vertebra.\n\t\t\nIf possible, select two horizontal window views, and select coronal or sagittal view on the left for reference, and axial view on the right.\nClick on Cross Link to link the left and right windows.\nScroll down the images from cranial to caudal direction. Identify L1 vertebra, which is the first vertebra without a rib attachment.\nCount from L1 to L3 and use the coronal or sagittal view to identify the slice of the middle of L3. This is identified as the point at which both transverse processes are able to be maximally and equally visualized.\nSelect the L3 slice. From the Exam tab, select Send Exam and save the image as a DICOM file.",
    "NOTE: Step 1 is a pre-processing step and is listed here to demonstrate how to obtain an L3 image. If the researcher already has an L3 image, they can go to step 2. If the image viewer does not enable cross-referencing, the researcher can skip 1.1.1 to 1.1.2. If the imaging does not include the thoracic region, identify L5, which is anterior to the sacrum, and count from L5 to L3, keeping in mind that the presence of a sixth lumbar vertebra is a normal variant.\nOpen the DICOM image with Slice-O-Matic software.\nDrag DICOM file to anywhere on the Slice-O-Matic window.\nSelect Modes | Region Growing to begin segmentation.\n\tNOTE: Due to poor differentiation of adipose tissues in MRI images, only SM is segmented.\n\t\nParaspinal muscles Segmentation: Click on 1 (Red) under the Region Growing area on the left side of the screen.\n\t\t\nIn the Preview Mode, histograms of the image would show multiple peaks, with the first peak representing air, and the subsequent second, third, and fourth peaks representing muscle, bone, and fat, respectively.\nClick on the Off button by Lower Limit to turn it to On.\nClick on the arrows by Mouse Wheel to set Disabled to Lower Limit.\nDrag the slider on Lower Limit to set Hounsfield Unit (HU) threshold to 0.\nClick on the Off button by Upper Limit to turn it to On.\nClick on the arrows by Mouse Wheel to set Lower Limit to Upper Limit.\nDrag the slider on Upper Limit to set HU to include the paraspinal muscle.",
    "Begin Segmenting Paraspinal Muscle by selecting 1 for Skeletal Muscle tissue (SM). Set the brush option to Paint. Use the brush tools found directly under Region Growing to adjust to the desired size of the brush and begin painting over the Paraspinal Muscle groups.\n\t\t\tNOTE: If anything is tagged in red as muscle on fluids or organs outside the muscle fascia, be sure to clear the tagging using the None color selection.\nSegmentation of remaining muscle groups: Move the mouse anteriorly to linea alba. In the preview mode, adjust the Upper Limit to include linea alba. This upper limit of the intensity is then adopted for all remaining muscle groups.\n\t\t\nBegin segmenting by selecting 1 for Skeletal Muscle tissue (SM). Set the brush option to Paint. Use the brush tools found directly under Region Growing to adjust to the desired size of the brush and begin painting over the Paraspinal Muscle groups.\n\t\t\tNOTE: If anything is tagged in red as muscle on fluids or organs outside the muscle fascia, be sure to clear the tagging using the None color selection.\nWhen finished tagging tissues, go to Tools | Tag Surface/Volume. This will display the surface area and volume of each of the tissues tagged, typically the interest is in the surface area.\nClick on Display in Window to fully open the Tag Surface/Volume window. This will also display HU values.\nRecord the surface area and HU threshold values.\n\tNOTE: If the Tag Surface/Volume window does not appear in the bottom left of the screen, it may be because there is not enough room to display it. In this case, be sure the Slice-O-Matic window is maximized and then select Tools | Tag Lock to remove the Tag Lock window. This should make enough space to display the Tag Surface/Volume window.",
    "When complete, go to File | Save TAG Files. This will save a TAG file where the DICOM file is located.\n3. Linear Measurement for CT and MRI\nObtain the axial CT or MRI DICOM image.\n\t\nIn the image viewer, identify the L3 vertebra.\n\t\t\nIf possible, select two horizontal window views, and select coronal or sagittal view on the left for reference, and axial view on the right.\nClick on Cross Link to link the left and right windows.\nScroll down the images from cranial to caudal direction. Identify L1 vertebra, which is the first vertebra without a rib attachment.\nCount from L1 to L3 and use the coronal or sagittal view to identify the slice of the middle of L3, as identified by the point at which both transverse processes are equally identified.\n\t\t\t​NOTE: Step 1 is a pre-processing step and is listed here to demonstrate how to obtain an L3 image. If the researcher already has an L3 image, they can go to step 2. If the image viewer does not enable cross-referencing, the researcher can skip 1.1.1 to 1.1.2. If the imaging does not include the thoracic region, identify L5, which is anterior to sacrum, and count from L5 to L3.\nImport the image into a medical imaging viewer and open it.\n\t\nFor Horos: open the app and click on Import.\nNavigate to where the DICOM image is located, select it and click on Open. The file and image should appear under the Patient Name list.\nDouble click on Patient Name, then double click on the image to begin linear segmentation.\nIdentify the psoas muscles and the paraspinal muscles.\nSelect the ruler tool and measure the horizontal (180°) and vertical (90°) diameters of the four muscles mentioned above.",
    "NOTE: The lines must be horizontal and vertical to the image, not diagonal. The horizontal and vertical lines drawn should create a rectangular box that encompasses the entirety of each muscle. Do not simply measure the longest distance of the muscle. If using an image viewer that allows for a box drawing tool, that tool can be used instead of the simple ruler tool. This is provided that the box drawing tool displays at least the height and length of the box.\nRecord all eight measurements (Right Psoas Width, Right Psoas Length, Left Psoas Width, Left Psoas Length, Right Paraspinal Width, Right Paraspinal Length, Left Paraspinal Width, Left Paraspinal Length) for further analysis.\n\t\nCalculate the individual muscle surface area by multiplying the horizontal and vertical value of that muscle.\nObtain the total muscle surface area psoas muscles and paraspinal muscles by adding the left muscle to the right muscle, respectively.\nCalculate the linear muscle index by dividing the combined surface area (mm2) by patient height squared (m2)."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}