{
  "id": 5230,
  "origin_website": "Bio",
  "title": "Sequencing of Ebola Virus Genomes Using Nanopore Technology",
  "procedures": [
    "Reverse transcription (RT) using the SuperScript III First-Strand-Synthesis SystemCombine 4 μl RNase free water, 1 μl primer (2 μM, CGGACACACAAAAAGAAAGAAG), 1 μl dNTPs, 5 μl RNA, mix by flicking, spin down, incubate for 5 min at 65 °C, put in PCR cooler for > 1 min.Prepare mastermix (6 μl 5x FS buffer, 1.5 μl DTT, 1.5 μl RNase out, 1.5 μl Superscript III. All components are provided as part of the RT kit), add 7 μl to samples, mix by flicking, spin down, incubate for 50 min at 50 °C , 5 min at 85 °C, hold at 4 °C, add 1 μl RNase H, mix by flicking, spin down, incubate for 20 min at 37 °C, hold at 4 °C.PCR using iProof polymeraseSet up mastermix for 14 reactions (Table 2; this includes 2 extra reactions that are not used) using the cDNA from step A2 as template, dispense 12 x 44.2 μl into 0.2 ml PCR tube strips on PCR cooler block, add 2.5 μl forward primer (10 μM) and 2.5 μl reverse primer (10 μM) according to table 1, flick, spin down, cycle (Table 3, first PCRs). Set up mastermix for 28 reactions (Table 2; this includes 4 extra reactions that are not used) using the PCR products from step B1 as template, dispense 24 x 44.2 μl into PCR tube strips on PCR cooler block, add 0.8 μl PCR product from step B1 as template (see Table 1 to determine which PCR product from step B1 to use as template), add 2.5 μl forward primer (10 μM) and 2.5 μl reverse primer (10 μM) according to Table 1, flick, spin down, cycle (Table 3, second PCRs). For an overview of the whole procedure see Figure 1.Table 1. Primer sequences.",
    "Each pair of primer sequences (1 forward and 1 reverse primer) correspond to a single reaction.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161101/20161101231451_0883.jpgTable 2. PCR master miximgsrc:https://en-cdn.bio-protocol.org/attached/image/20161101/20161101231523_5363.jpgTable 3. PCR cycling conditionsimgsrc:https://en-cdn.bio-protocol.org/attached/image/20161101/20161101231547_9504.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20161101/20161101000221_0855.jpgFigure 1. Schematic of PCR amplification prior to library preparationAgencourt PCR-purificationVortex AMPure XP beads for 10 sec.Out of the 24 PCR products, generate two pools of PCR products (Figure 1; the first pool contains PCR products 1.1-6.2, and the second pool PCR products 7.1-12.2), each containing 12 x 40 μl, for a total of 480 μl each, and pipet into 1.5 ml Eppendorf tube.Add 720 μl beads to the pools, mix by pipetting 10 times, incubate for 5 min.Place tube onto magnet, wait 5 min.Take off supernatant completely, being careful not to aspirate any beads, add 1,200 μl 70% EtOH (do NOT pipet directly onto beads), let sit for at least 30 sec, take off completely with a P1000 pipette.Repeat wash step with 800 μl 70% EtOH, take off supernatant with a P1000 pipette, spin down for 3 sec, put back on magnet, take off any remaining supernatant with a P10 pipette.Dry beads for about 2 min with open lids, keep lids open from now on.Take tube off magnet, add 60 μl Qiagen elution buffer, resuspend bead-pellet in elution buffer, incubate for 10 min at room temperature.Place back onto magnet, wait 1 min (until beads have pelleted), take off 50 μl of eluate. Pool the eluates from the two purified PCR product pools, for a total of 100 μl containing all PCR products.Optional: Quality control on agarose gelPrepare 1x TAE by adding 10.2 ml 50x TAE into 500 ml water.Combine 50 ml 1x TAE and 0.5 g agarose, bring to boil in microwave. Pour agarose gel, let solidify on a cold pack.",
    "Load 15 μl of DNA ladder and 5 μl of pooled sample mixed with 1 μl 6x loading dye onto agarose gel, run for about 20 min at 100 V.Combine 50 ml FastBlast DNA stain and 200 ml water, incubate the agarose gel for 3 min in the diluted DNA stain, then rinse and destain the gel with several changes of water, rocking the gel continuously for 10 to 20 min.Visualize the gel using a white laptop screen as lightbox. Several discrete bands should be visible, corresponding to the various PCR product lengths (strong band at ~2.1 kb, moderate band at ~2.7 kb, weak bands at 1.3, 3.4, and 4.0 kb).Library preparationCombine 80 μl of pooled, purified PCR products from step C9 and 5 μl DNA CS, add 10 μl 10x NEBNext end repair buffer and 5 μl NEBNext end repair enzyme mix, mix by pipetting, incubate at RT for 30 min.Clean up with 180 μl Agencourt beads as described in section C, but use 300 μl EtOH for washing, add 30 μl elution buffer, take off 25 μl eluate, put in PCR tube. Add 3 μl 10x NEBNext dA-tailing buffer and 2 μl NEBNext dA-tailing enzyme mix, incubate for 30 min at 37 °C.Thaw 2x wash buffer, elution buffer, EP buffer at RT, thaw HP adapter, Adapter mix and Fuel mix in the cooler box.Prepare His-beads:Mix 550 μl 2x wash buffer and 550 μl nuclease-free water by inverting 10x, briefly spin down.Vortex His-Beads for ~30 sec.Pipet 10 μl His-Beads into a LoBind tube, add 250 μl 1x wash buffer.Place on magnet, wait for pellet to form, aspirate off supernatant, add 250 μl wash buffer, wait 30 sec, aspirate off supernatant.Take tube off magnet, resuspend pellet in 100 μl 2x wash buffer.",
    "After 30 min, in a LoBind tube, add (directly to the bottom of the tube) 8 μl nuclease-free water, 30 μl DNA from step E3, 10 μl Adapter mix, 2 μl HP Adapter, and 50 μl Blunt/TA ligase master mix, mix by pipetting, if necessary briefly spin down, incubate 10 min at RT.Add 100 μl washed beads (directly to bottom of tube), carefully mix by pipetting, incubate for 5 min at RT.Place on magnet, wait 2 min for pellet to form, aspirate supernatant, wash 2 x for 30 sec each with 250 μl 1x wash buffer.With the lid close, briefly centrifuge, put back onto magnet, wait 1 min with lid closed, aspirate off any remaining wash buffer.Take off magnet, resuspend pellet in 25 μl elution buffer (adding the elution buffer directly to the pellet), wait 10 min with lid closed, put back on magnet, wait 1 min, take off 15 μl eluate (≥ pre-sequencing mix).Loading of library (Figure 2)Mix 318.5 μl EP buffer and 6.5 μl Fuel mix by vortexing, spin down.Prime flow cell two times with 150 μl of EB/Fuel mix.Mix 6 μl library, 141 μl EP, 3 μl Fuel mix by inverting 10 times, briefly spin down, load, and initiate flow cell run. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161101/20161101000242_2859.jpgFigure 2. Priming/loading of the flowcell"
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology",
    "Systems Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}