{
  "id": 1795,
  "origin_website": "Cell",
  "title": "Simultaneous recording of behavioral and neural responses of free-moving nematodes C. elegans",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nC. elegans is known to exhibit behavioral changes and neural responses to a variety of stimuli (Bargmann et al., 1993[href=https://www.wicell.org#bib2]; Gray et al., 2004[href=https://www.wicell.org#bib4]; Hilliard et al., 2005[href=https://www.wicell.org#bib5]; Mori and Ohshima, 1995[href=https://www.wicell.org#bib7]; Ward et al., 2008[href=https://www.wicell.org#bib10]). This tracking imaging system using a PDMS microfluidic device allows us to simultaneously observe animal behavior and neural responses to stimuli. This protocol targets the experience-dependent salt chemotaxis of C. elegans. It can also be applied to other stimuli (e.g., water-soluble chemicals, odors, osmotic stimuli, etc.) if they can be channeled through the microfluidic system (Albrecht and Bargmann, 2011[href=https://www.wicell.org#bib1]). The protocol is divided into four stages: 1: conditioning, 2: assembly of the microfluidic device and introduction of the nematodes, 3: administration of the stimuli and recording of movement and neural responses, and 4: quantification of behavior and neural responses.\nConditioning of animals\nTiming: 1 day\nThis assay aims to measure the behavior and neural activity of nematodes in response to salt concentration change stimuli, and to investigate whether these responses are altered by the salt concentration that the nematodes have previously experienced. Therefore, initially, the nematodes are conditioned with various salt concentrations.\nWash nematodes from one 6 cm plate (make sure that there is still food left, and the nematodes are not starving, and more than 200 adult nematodes are present) into a 1.5 mL Eppendorf tube using 1 mL of M9 buffer.\nAfter the nematodes have settled to the bottom of the tube, remove the supernatant, and wash again with 1 mL of M9 buffer.\nAfter the nematodes settle to the bottom of the tube, remove the supernatant, and transfer the nematodes to an NGM condition plate (0, 50, or 100 mM NaCl) with a lawn of E. coli.",
    "Incubate at 20°C overnight (at least 6 h or more) for conditioning.\nCritical: When transferring nematodes to an NGM condition plate, do not bring in too much M9 buffer to minimize its effect on the salt concentration of the plate. A standard amount is about 10–20 μL.\nAlternatives: If you are using strains with extrachromosomal arrays which are not 100% heritable for your experiment, you can pick up about 100 nematodes carrying the arrays and transfer them to an NGM condition plate.\nAssembly of the microfluidic device\nTiming: 1–2 h\nIn this experiment, nematodes were placed in a PDMS microfluidic chamber and stimulated by switching the solution flowing in the chamber. A chip made of PDMS is sandwiched between two glass plates, and the stimulating solution flows through holes in the glass plates and the chip (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1245-Fig2.jpg\nFigure 2. Schematic diagram of how to assemble a microfluidic device\n(A) Summary of each tube connecting to the microfluidic chip.\n(B) Pictures from each stage of assembly. First, sandwich the microfluidic chip between two glass plates. At this time, the holes in the microfluidic chip and the holes in the glass plate are placed so that they overlap. Next, insert steel pins into each hole and hold the glass plates in place with binder clips. Then, connect polyethylene tubes to each pin.\nWash a glass plate, a perforated glass plate, and a PDMS microfluidic chip with 100% ethanol and air-dry them.\nCritical: Store the glass plates and PDMS chips in ethanol to avoid their getting moldy.",
    "Place the PDMS chip between the glass plates (Figure 2[href=https://www.wicell.org#fig2]B left). Align the holes in the perforated glass plate with the holes for inserting the polyethylene tube (φ 0.58 mm) in the PDMS chip. Then insert the stainless steel tubes into the four holes of the chip.\nFix the glass plate with a binder clip (Figure 2[href=https://www.wicell.org#fig2]B right top).\nVacuum pump for 15 min to evaporate.\nMix 0 mM NaCl solution and 100 mM NaCl solution to make 50 mL of 50 mM NaCl solution and 25 mM NaCl solution.\nAdd 0.5 μL of 0.5 μM fluorescein solution to 25 mM NaCl solution (final concentration: 1 nM).\nPut 40 mL each of 50 mM NaCl buffer and 25 mM NaCl buffer into respective 50 mL Terumo syringe set it on the feed pump, and connect polyethylene tube to the syringes (Figure 3[href=https://www.wicell.org#fig3]A, NaCl solution 1 and 2).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1245-Fig3.jpg\nFigure 3. Overview diagram of the experimental setup\n(A) Overview of the microfluidic device and each polyethylene tube connected to it. There are two syringes for NaCl solution (① and ②, 1 m length each), one syringe for nematodes introduction (③, 0.5 m length), and one peristaltic pump for waste fluid connected (④, 0.5 m length).\n(B) Schematic diagram of the imaging system. An infrared camera is used to acquire bright field images and an EM-CCD camera is used to acquire fluorescence images. The bright field images are used to control the tracking stage so that the nematode is kept in the center of the field of view.",
    "Put 10 mL of 50 mM NaCl buffer into a 10 mL syringe and connect the tube (Figure 3[href=https://www.wicell.org#fig3]A, nematode introduction syringe). This syringe is used for nematode introduction to the microfluidic chamber. Flow path from the nematode introduction syringe is opened and closed using a three-way stopcock.\nConnect a syringe with the NaCl solution to one side of the flow path and a polyethylene tube to the other side that will be later connected to PDMS. Attach another syringe to the third flow path and use it to remove air from the tube.\nConnect the polyethylene tubes from each syringe and pump (①–④) to the steel tubes of the PDMS microfluidic device, and turn on all pumps and open all tubes to allow the solution to flow (Figures 2[href=https://www.wicell.org#fig2]B and 3[href=https://www.wicell.org#fig3]A).\nThere are four polyethylene tubes in total. Two tubes are for NaCl solution (Figure 3[href=https://www.wicell.org#fig3]A ① and ②), one for introducing nematodes (Figure 3[href=https://www.wicell.org#fig3]A ③), and one for waste fluid (Figure 3[href=https://www.wicell.org#fig3]A ④).\nWhen the chamber is filled with NaCl solution, close all the tubes. The flow rate of each pump should be set to 100 μL/min.\nCritical: Make sure that the solution has completely filled the microfluidic chamber. If air bubbles are present in the chamber, they may cause failure of solution exchange or prevent nematode movement during imaging. If air bubbles in the chamber are hard to be removed, turn off the peristaltic pump attached to the waste.\nIntroduction of nematodes into the microfluidic chamber\nTiming: 10–15 min\nPut 1 mL of 50 mM NaCl solution in a 1.5 mL Eppendorf tube and put 10–20 nematodes picked from the conditioning plate.\nTake nematodes with a P1000 micropipette and put it into the NaCl solution in a nematodes-introduction syringe (10 mL Terumo syringe) (Figure 3[href=https://www.wicell.org#fig3]A ③).",
    "Open the tube from the nematode-introduction syringe (Figure 3[href=https://www.wicell.org#fig3]A ③), turn on the peristaltic pump for waste fluid (Figure 3[href=https://www.wicell.org#fig3]A ④), and introduce nematodes into the microfluidic chamber. After the nematode enters the chamber, close the tube from the nematode-introduction syringe and turn off the waste pump.\nCritical: The number of nematodes to be introduced into the microfluidic chamber should be about 10. If the number of nematodes is too small, it may be difficult to find suitable ones for imaging. On the other hand, if there are too many nematodes, they may collide with each other, making it difficult to track them.\nStimulation of animals and measurement of behaviors and neural activities\nTiming: 30 min\nAn infrared camera and an EM-CCD camera are used to acquire bright field images and fluorescence images, respectively (Figure 3[href=https://www.wicell.org#fig3]B). Based on the bright field images, the tracking stage is controlled according to the animal's movement, and the behavior and neural activity of the moving animal are acquired.\nTurn on the peristaltic pump for waste and open the tube of 50 mM NaCl solution.\nLaunch the tracking stage, the nematode tracking software, and the fluorescence imaging software (MetaMorph). Then, select the head of the nematode and start tracking. At the same time, start capturing brightfield and fluorescence images.\nNote: The nematode tracking software uses the pattern around the selected point as a template, and tracks the animal based on it. Therefore, if the template is set to include the pharynx and part of the intestine, which have a characteristic shape, the tracking will be successful (Methods video S1[href=https://www.wicell.org#mmc1]). In addition, it is better to select a worm that is not moving too fast or too slow (about 50–100 μm/s) to obtain good quality data.",
    "25 s after the start of imaging, close the tube of 50 mM NaCl solution and simultaneously open the tube of 25 mM NaCl solution.\nCritical: Depending on the position of each nematode in the microfluidic chamber, there is a time lag between the opening and closing of the tube and actual delivery of the stimulus (salt concentration change) to the nematode. In this experiment, fluorescein was added to a 25 mM NaCl solution. Therefore, the timing of solution switching can be identified by imaging the fluorescence of fluorescein.\n75 s after the start of imaging, close the tube of 25 mM NaCl solution and open the tube of 50 mM NaCl solution at the same time.\nAt 125 s after the start of shooting, close the tube of 50 mM NaCl solution again and open the tube of 25 mM NaCl solution at the same time.\nAt 180 s after the start of imaging, end the measurement, close the tube of 25 mM NaCl solution and open the tube of 50 mM NaCl solution.\nNote: In this experiment, the nematodes are stimulated to change salt concentration from\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Simultaneous recording of velocity and ASER activity in response to salt concentration change, related to steps 17–19\nBright field image on the left and fluorescence image on the right. In the bright field image, the area surrounded by white squares (the pharynx and part of the intestine of the nematode) is used as a template for tracking. Since fluorescein is added to the 25 mM NaCl solution, it is possible to identify the timing of solution switching in the GCaMP channel.",
    "50 mM → 25 mM → 50 mM → 25 mM (Figure 4[href=https://www.wicell.org#fig4]A). The nematode's forward/backward state lasts for about several seconds to several tens of seconds. Therefore, in this experiment, the stimulus switching interval was set to 50 s. Since nematodes are attracted to the NaCl concentration at conditioning, changes away from and toward the NaCl concentration at conditioning are applied as stimuli. For example, for a nematode conditioned to 50 mM NaCl concentration, a change in NaCl concentration from 50 mM to 25 mM is a change away from the conditioned concentration, and a change from 25 mM to 50 mM is a change toward the conditioned concentration.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1245-Fig4.jpg\nFigure 4. The salt stimuli used in the experiment and the responses to them\n(A) Time course for switching salt solutions during the experiment. Since it takes about 30 s from the entrance to the exit of the microfluidic chamber, the actual timing at which the stimulus is delivered to nematodes depends on their position in the microfluidic chamber.\n(B) Comparison of the magnitude of the velocity change and neural response of ASER to salt concentration down-step (50 mM–25 mM) and up-step (25 mM–50 mM) between the first animal and the second and following animals. These animals were conditioned with 100 mM NaCl. Each graph represents the differences between mean value of 10 s windows before and after stimulus. Each dot represents the data of one animal. Mean ± S. E. M. (NS) not significant, Welch’s test.\nSelect another nematode in the chamber and measure again by steps 17–19. Up to about 5 animals should be measured in one experiment.",
    "Note: In this experiment, no significant differences in neural responses or behavioral changes due to repeated stimulus exposure were detected (Figure 4[href=https://www.wicell.org#fig4]B). If different stimuli or experimental conditions are to be used, it is necessary to estimate whether there is an effect of repeated stimulation. To avoid the effects of repeated stimulation, return to step 5 after measuring the first animal.\nAfter the experiment, dismantle the microfluidic device and clean it with ethanol. To continue the imaging again, start from step 5."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Microscopy",
    "Model Organisms",
    "Behavior"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Ecology & Environmental Biology",
    "Molecular Biology & Genetics"
  ]
}