{
  "id": 4209,
  "origin_website": "Cell",
  "title": "Low-input ATAC and mRNA-seq protocol for simultaneous profiling of chromatin accessibility and gene expression",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nATAC tagmentation using whole cells\nTiming: 50–60 min\nThis step uses Illumina Tagment DNA Enzyme and Buffer Kit (Cat# 20034198) to fragment and tag open chromatin regions with adapter sequences.\nNote: This step is based on Omni-ATAC protocol (Corces et al., 2017[href=https://www.wicell.org#bib3]) with modifications.\nCritical: This step requires single cell suspension, as cell clumps can cause inaccurate cell counts and inefficient cell permeabilization.\nCritical: Cell viability needs to be above 90% and preferably around 95%.\nCritical: This step relies on a one-step membrane permeabilization and transposition. Different cell types may need different detergent or concentration for proper cell permeabilization. However, the combination of 0.01% digitonin and 0.1% Tween-20 is a good starting point.\nCell preparation\nWash the harvested mESCs once in cold DPBS, and then resuspend the cell pellet in cold DPBS.\nCount the cells with a manual or automated cell counter. Trypan blue staining is recommended to assess cell viability.\nGently mix the cell suspension and pipette a volume corresponding to 1×104 cells into a new 1.5 mL Eppendorf tube.\nCentrifuge the tube containing 1×104 cells at 500 × g for 5 min at 4°C in a fixed angle centrifuge.\nNote: While waiting for the centrifuge to stop, prepare ATAC transposition mixture as below and keep it on ice before use.\ntable:files/protocols_protocol_968_7.csv\nNote: The volumes given here are for a single sample with 1×104 mESCs. For multiple samples, scale up and include 10% excess volume for pipetting losses.\nCritical: The ratio of cell number to TDE1 is crucial. 10 μL transposition mixture is used for 1×104 mESCs. Based on the actual cell number of the sample, adjust the volume of ATAC transposition mixture to use proportionally.",
    "Remove all the supernatant carefully using two pipetting steps (aspirate down to 100 ul with a P1000 pipette then remove final 100 ul with a P200 pipette).\nResuspend the cell pellet in 10 μL ATAC transposition mixture by pipetting up and down 6 times.\nIncubate the transposition reaction at 37°C for 30 min in an Eppendorf Thermomixer with shaking at 1000 RPM.\nNote: While waiting for the incubation to complete, please prepare the following.\nPrepare EDTA-LiCl mixture by mixing 88 μL of 0.5 M EDTA with 275 μL of 8M LiCl. The mixture is stable at room temperature (21°C–23°C) and can be reused in the future.\nPrepare reagents for direct mRNA isolation from cells following step 7.\nThaw the components of SuperScript™ IV First-Strand Synthesis System that are frozen.\nFor each sample, prepare a mixture of 560 μL of Buffer PB (from Qiagen MinElute PCR Purification Kit) with 10 μL of 3 M sodium acetate, pH 5.2 in a labeled Eppendorf tube. Keep the mixture at room temperature (21°C–23°C) before use in step 12.\nImmediately upon completion of the incubation, quick spin the sample tube, then add 1 μL of EDTA-LiCl mixture (0.1 volume of the ATAC transposition mixture used in step 4) to stop the transposition reaction.\nCritical: Proceed immediately to step 8.\nDirect mRNA isolation from the tagmented cells\nTiming: 15–20 min\nThis step uses Dynabeads™ mRNA DIRECT™ Micro Purification Kit (Cat# 61021) to isolate mRNA directly from the tagmented cells.\nNote: This step follows the manufacturer's manual with minor changes. https://assets.thermofisher.com/TFS-Assets/LSG/manuals/DynabeadmRNADIRECTMicro_UG_Rev004_20120514.pdf[href=https://assets.thermofisher.com/TFS-Assets/LSG/manuals/DynabeadmRNADIRECTMicro_UG_Rev004_20120514.pdf]\nPrepare reagents\nPrepare buffers from Dynabeads™ mRNA DIRECT™ Micro Purification Kit\nBring all buffers except the 10 mM Tris-HCl to room temperature before use. Store the 10 mM Tris-HCl on ice or at 2°C–8°C before use.",
    "Confirm that the Lysis/Binding Buffer has not precipitated. If any precipitation is observed, warm to room temperature and shake to dissolve.\nWash Dynabeads® Oligo (dT)25 before use\nResuspend Dynabeads® Oligo (dT)25 by vortex for more than 30 s.\nNote: Keep the Dynabeads® Oligo (dT)25 in liquid suspension during handling and storage to avoid reduced performance. If the Dynabeads® Oligo (dT)25 becomes dried out, resuspend the beads in the buffer they are supplied in by placing the vial on a roller or equivalent overnight at 2°C–8°C to restore their complete functionality.\nPipette 20 μL Dynabeads® Oligo (dT)25 into a 1.5 mL RNase-free Eppendorf tube.\nNote: Use 20 μL Dynabeads® per sample with 1×104 cells. For multiple samples, include 5–10% excess volume for pipetting losses.\nAdd 1 mL of Lysis/Binding Buffer and mix.\nPlace the tube on a magnet for 1 min, then remove and discard the supernatant.\nRemove the tube from the magnet, then resuspend the beads in 20 μL of Lysis/Binding Buffer (the same volume as the Dynabeads® used in step ii).\nAdd 100 μL Lysis/Binding Buffer to the tagmented cells from step 6. Perform a repeated passage of the solution through a pipette tip to obtain complete lysis.\nAdd 20 μL pre-washed Dynabeads® Oligo (dT)25 to the cell lysate and pipette up and down 2–3 times to mix.\nPlace the tube on a sample rotator at room temperature (21°C–23°C) for 5 min with continuous rotation to allow the mRNA to anneal to the Dynabeads®.\nNote: While waiting, prepare reverse transcription reaction mix following step 23.\nQuick spin the sample tube then place it on the magnet for 1 min.\nTransfer the supernatant into the Eppendorf tube containing Buffer PB and sodium acetate mixture prepared earlier.",
    "Critical: Don’t discard the supernatant, as it contains the tagmented DNA for ATAC-seq library preparation. Store the mixture at room temperature before proceeding to step 42.\nRemove the sample tube from the magnet and resuspend the Dynabeads®-mRNA complex in 100 μL Washing Buffer A by careful pipetting.\nPlace the sample tube on the magnet for 1 min, then remove and discard the supernatant.\nRepeat steps 13 and 14 once.\nResuspend the Dynabeads®-mRNA complex in 100 μL Washing Buffer B.\nTransfer the suspension into a RNase-free PCR tube.\nPlace the PCR tube on a magnet for 1 min, then discard the supernatant.\nResuspend the Dynabeads®-mRNA complex in 100 μL Washing Buffer B.\nPlace the PCR tube on the magnet for 1 min, then discard the supernatant.\nRemove the tube from the magnet and resuspend the Dynabeads®-mRNA complex in 100 μL ice-cold 10 mM Tris-HCl.\nPut the tube on ice and immediately proceed to step 24.\nCritical: Don’t elute the isolated mRNA from the beads. The Dynabeads®–mRNA complex is used directly for reverse transcription.\nSolid-phase cDNA synthesis\nTiming: 20–25 min\nThis step uses SuperScript™ IV First-Strand Synthesis System (Cat# 18091050) for first-strand cDNA synthesis on beads with the bead-bound oligo (dT) as primer, resulting in mRNA/cDNA hybrids covalently linked to the Dynabeads.\nNote: This step follows the manufacturer's manual with minor changes. https://assets.thermofisher.com/TFS-Assets/LSG/manuals/SSIV_First_Strand_Synthesis_System_UG.pdf[href=https://assets.thermofisher.com/TFS-Assets/LSG/manuals/SSIV_First_Strand_Synthesis_System_UG.pdf]\nPrepare reverse transcription reaction mix as below and keep it on ice before use.\nCritical: Pre-warm the 5× SSIV Buffer to room temperature before use. Vortex and briefly centrifuge the buffer prior to preparing the reverse transcription reaction mix.\ntable:files/protocols_protocol_968_8.csv\nNote: The volumes given here are for a single 20-μL reverse transcription reaction. For multiple reactions, scale up and include 10% excess volume for pipetting losses.",
    "Immediately before adding the reverse transcription reaction mix, place the tube containing the Dynabeads®-mRNA complex on the magnet for 1 min, then discard the supernatant.\nResuspend the Dynabeads®-mRNA complex in 20 μL reverse transcription reaction mix.\nIncubate the reaction in a thermocycler with the “RT” program, 50°C for 5 min followed by 55°C for 10 min.\nNote: When using a thermostable reverse transcriptase and the bead-bound oligo (dT) as primer for first-strand cDNA synthesis, an initial incubation at 50°C for 5 minutes is necessary before proceeding at the recommended reaction temperature.\nCritical: Proceed immediately once the incubation completes.\nNote: While waiting, carry out the following.\nThaw Amplicon Tagment Mix (ATM), Tagment DNA Buffer (TD), Nextera PCR Master Mix (NPM), and index adapters on ice. These reagents are from Illumina Nextera XT DNA Library Preparation Kit and Nextera XT Index Kit.\nPurify ATAC-DNA from step 12 following instructions in step 42.\nQuick spin and place the sample tube on the magnet for 30 s, then discard the supernatant.\nRemove the tube from the magnet and resuspend the beads in 100 μL of ice-cold 10 mM Tris-HCl.\nPlace the tube on the magnet for 1 min, then discard the supernatant.\nRepeat steps 28 and 29 once.\nRemove the tube from the magnet and put it on a cold metal block.\nAdd 5 μL ice-cold 10 mM Tris-HCl directly on the beads, and immediately proceed to step 33.\nmRNA-seq library preparation\nTiming: 50–60 min\nThis step uses Illumina Nextera XT DNA Library Preparation Kit (Cat# FC-131-1024) to directly tagment mRNA/cDNA hybrids on beads and then amplify the tagmented cDNA with PCR using index 1 (i7) adapter and index 2 (i5) adapter in Nextera XT Index Kit (Cat# FC-131-1001).\nNote: This step follows the manufacturer's manual with minor changes. https://support.illumina.com/content/dam/illumina-support/documents/documentation/chemistry_documentation/samplepreps_nextera/nextera-xt/nextera-xt-library-prep-reference-guide-15031942-05.pdf[href=https://support.illumina.com/content/dam/illumina-support/documents/documentation/chemistry_documentation/samplepreps_nextera/nextera-xt/nextera-xt-library-prep-reference-guide-15031942-05.pdf]",
    "Add 10 μL Tagment DNA Buffer (TD) and 5 μL Amplicon Tagment Mix (ATM) directly on the beads.\nCritical: Tagmentation is sensitive to the input amount. The volumes given here have been validated for mRNA/cDNA hybrids generated from 1–2×104 mESCs.\nResuspend the beads by pipetting up and down 10 times to mix.\nPlace the sample tube in the preprogrammed thermocycler and run the “TAG” program (55°C for 5 min, then hold at 10°C).\nCritical: When the program reaches 10°C, immediately proceed to step 36 to inactivate the transposome.\nQuick spin the sample tube, then add 5 μL Neutralize Tagment Buffer (NT) and mix by pipetting up and down 10 times.\nNote: Check NT for precipitates. If present, vortex until all particulates are resuspended.\nIncubate the sample tube at room temperature (21°C–23°C) for 5 min.\nAdd 5 μL i7 adapter, 5 μL i5 adapter, 15 μL Nextera PCR Master Mix (NPM) to the sample, then mix by pipetting up and down 10 times.\nNote: Open only one index adapter tube at a time to prevent misplacing caps. If using Index Adapter Plate, add 10 μL pre-paired i7 and i5 index adapters. If multiple samples are processed at the same time, please follow Illumina Index Adapters Pooling Guide to select index adapters for each sample.\nPlace the sample tube in the preprogrammed thermocycler and run the “NXT PCR” program.\ntable:files/protocols_protocol_968_9.csv\nNote: The PCR cycles needed is dependent on the input amount.\nNote: While waiting for the PCR program to complete, set up ATAC PCR reaction following step 43.\nOnce “NXT PCR” program is complete, quick spin the sample tube then place it on the magnet for 1 min.\nTransfer the supernatant containing the amplified mRNA-seq library into a new PCR tube.",
    "Pause point: If you are stopping, store the supernatant at 2°C–8°C for up to 2 days or −20°C for longer time.\nATAC-seq library preparation\nTiming: 30–40 min\nThis step uses Qiagen MinElute PCR Purification Kit (Cat# 28006) to purify ATAC-DNA from step 12, and then amplifies the purified DNA with a limited-cycle PCR using NEBNext® High-Fidelity 2× PCR Master Mix (Cat# M0541S) and 10 μM ATAC-seq PCR primers (Buenrostro et al., 2015[href=https://www.wicell.org#bib2]).\nNote: ATAC-DNA purification (step 42) follows the manufacturer's manual. https://www.qiagen.com/us/resources/download.aspx?id=521feb84-9cfa-45ea-9a8f-54c2999aa9a9&lang=en[href=https://www.qiagen.com/us/resources/download.aspx?id=521feb84-9cfa-45ea-9a8f-54c2999aa9a9&lang=en]\nNote: PCR amplification of the purified ATAC-DNA (Step 43) follows Omni-ATAC protocol (Corces et al., 2017[href=https://www.wicell.org#bib3]) with slight modifications.\nPurify ATAC-DNA from step 12 using Qiagen MinElute PCR Purification Kit.\nMix and apply the sample to the MinElute column.\nCentrifuge for 1 min at 17,900 × g at room temperature in a microcentrifuge.\nDiscard flow-through and place the MinElute column back into the same tube.\nAdd 750 μL Buffer PE to the MinElute column and centrifuge at 17,900 × g for 1 min.\nNote: Add ethanol (96%–100%) to Buffer PE before use (see bottle label for volume).\nDiscard flow-through and place the MinElute column back in the same tube. Centrifuge the column for an additional 1 min at maximum speed.\nCritical: Residual ethanol from Buffer PE will not be completely removed unless the flowthrough is discarded before this additional centrifugation.\nPlace the MinElute column in a clean 1.5 mL microcentrifuge tube.\nAdd 11 μL Buffer EB (10 mM Tris·Cl, pH 8.5) to the center of the membrane to elute DNA. Let the column stand for 1 min, and then centrifuge for 1 min.\nCritical: Ensure that the elution buffer is dispensed directly onto the center of the membrane for complete elution of bound DNA.\nRepeat step 42 g once.",
    "Pause point: If you are stopping, store the purified ATAC-DNA at −20°C.\nAmplify the purified ATAC-DNA with NEBNext® High-Fidelity 2× PCR Master Mix and ATAC-seq PCR primers (Buenrostro et al., 2015[href=https://www.wicell.org#bib2]).\nAdd 20 μL DNA, 2.5 μL universal i5 primer (10 μM), 2.5 μL index i7 primer (10 μM), and 25 μL NEBNext HiFi 2× PCR Master Mix into a PCR tube.\nNote: If multiple samples are processed at the same time, make sure that each sample uses a different index i7 primer (Buenrostro et al., 2015[href=https://www.wicell.org#bib2]). If ATAC-seq and mRNA-seq libraries will be sequenced together, please follow Illumina Index Adapters Pooling Guide to select the indexes compatible with those used in step 38 for mRNA-seq libraries.\nMix, quick spin, then place the PCR tube in the preprogrammed thermocycler and run the “ATAC PCR” program.\nNote: The PCR cycles needed is dependent on the input amount. The optimal PCR cycles can be determined by qPCR amplification after initial 5 cycles according to Omni-ATAC protocol (Corces et al., 2017[href=https://www.wicell.org#bib3]).\ntable:files/protocols_protocol_968_10.csv\nPause point: If you are stopping, store the PCR product at 2°C–8°C for up to 2 days or −20°C for longer time.\nClean up mRNA-seq and ATAC-seq libraries\nTiming: 35–40 min\nThis step uses Agencourt AMPure XP beads (Cat# A63881) to clean up the amplified mRNA-seq library from step 41 and ATAC-seq library from step 43 with single-sided bead purification.\nNote: Bring AMPure XP beads to room temperature for at least 30 minutes before use.\nVortex AMPure XP beads and add 1.8× beads to each sample (90 μL beads for 50 μL PCR).\nGently pipette the entire volume up and down 10 times to mix thoroughly.\nIncubate at room temperature (21°C–23°C) for 15 min.\nNote: Thaw Illumina Resuspension Buffer (RSB) at room temperature.",
    "Note: Prepare fresh 80% ethanol 400 μL per sample.\nPlace the PCR tubes on the magnetic stand for 5 min or until the liquid is clear.\nRemove and discard all supernatant without disturbing the beads.\nWith the PCR tubes on the magnetic stand, add 200 μL freshly prepared 80% ethanol without disturbing the beads.\nIncubate at room temperature for 30 s, then remove and discard all the supernatant.\nRepeat steps 49 and 50 for a total of two ethanol washes.\nNote: Use a P10 pipette to remove and discard residual ethanol after the second wash.\nWith the PCR tubes on the magnetic stand, air-dry the beads at room temperature (21°C–23°C) for 8 min.\nNote: Do not overdry the beads, as it may result in lower DNA recovery. If the beads appear cracked, they have been overdried.\nAdd 32.5 μL Resuspension Buffer (RSB) directly on the beads.\nRemove the tubes from the magnetic stand, then resuspend the beads thoroughly by gently pipetting the entire volume up and down 10 times.\nIncubate at room temperature (21°C–23°C) for 2 min.\nPlace the PCR tubes on the magnetic stand for 5 min or until the liquid is clear.\nTransfer 30 μL of clear supernatant into a new Eppendorf tube labeled with corresponding library name.\nPause point: If you are stopping, store the purified libraries at −20°C.\nLibrary quality control and sequencing\nTiming: 20–30 min\nThis step checks library quality and quantity followed by Illumina sequencing.\nQuantify the libraries using Qubit® Fluorometer with Qubit dsDNA HS Assay Kit (Cat# Q32851) according to manufacturer’s User Guide (https://assets.thermofisher.com/TFS-Assets/LSG/manuals/Qubit_dsDNA_HS_Assay_UG.pdf[href=https://assets.thermofisher.com/TFS-Assets/LSG/manuals/Qubit_dsDNA_HS_Assay_UG.pdf]).\nDetermine library size distribution using Agilent TapeStation with D1000 ScreenTape & Reagents following the manufacturer’s User Manual (https://www.agilent.com/cs/library/usermanuals/public/ScreenTape_D1000_QG.pdf[href=https://www.agilent.com/cs/library/usermanuals/public/ScreenTape_D1000_QG.pdf]).\nNote: Alternatively, Agilent Bioanalyzer can be used.\nSequence the libraries on Illumina sequencer following the manufacturer’s instructions.",
    "Note: Paired-end sequencing is recommended with sequencing depth following ENCODE guideline for bulk ATAC-seq and mRNA-seq."
  ],
  "subjectAreas": [
    "Genomics",
    "Molecular Biology",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}