{
  "id": 15732,
  "origin_website": "Jove",
  "title": "A Competent Hepatocyte Model Examining Hepatitis B Virus Entry through Sodium Taurocholate Cotransporting Polypeptide as a Therapeutic Target",
  "procedures": [
    "NOTE: The following procedures must be performed in a Class II biological hazard flow hood or a laminar-flow hood. The handling of HBV was ethically approved by the IRB (MURA2020/1545). See the Table of Materials for details about all solutions, reagents, equipment, and cell lines used in this protocol.\n1. Preparing host cells (mature hepatocytes)\nCulture hepatocytes (3.75 × 105 cells HepaRG or imHC) and maintain in a 75 cm2 culture flask with 10 mL of DMEM/F12 medium supplemented with 10% fetal bovine serum (FBS), 1% L-glutamine, 100 U/mL penicillin, and 100 µg/mL streptomycin. Wait for the cells to reach 80%-90% confluence (within 1 week).\nDiscard the old medium from the flask and wash the cells with 4 mL of phosphate-buffered saline (PBS).\nAspirate the PBS and add 4 mL of 0.05% trypsin-EDTA.\nIncubate the flask in the 37 °C incubator for 2-3 min, and check the adherent cells using an inverted microscope with a 10x objective lens. Ensure that the monolayer has detached from the culturing surface.\nInhibit the trypsin by adding 4 mL of the culture medium supplemented with 10% FBS to the flask and carefully resuspend the harvested cells. Transfer the cell suspension into a 15-mL conical tube and centrifuge for 3 min at 300 × g, 25 °C.\nAspirate the supernatant from the cell pellet and resuspend with 1-2 mL of the prewarmed culture medium supplemented with 10% FBS and antibiotics.\nMix 10 µL each of the cell suspension and trypan blue and count the cells using a hemacytometer. Ensure that the cell viability is higher than 90% before proceeding to the next step.\nSeed 1 × 106 cells per 2 mL in each well of a 6-well plate and maintain in DME/F12 complete medium until the cells reach 100% confluence.",
    "For hepatic maturation, prepare hepatic maturation medium (Williams' E medium supplemented with 10% FBS, 100 U/mL penicillin, 100 µg/mL streptomycin, 5 µg/mL insulin, 50 µM hydrocortisone, 2 mM L-glutamine, and 2% DMSO).\nReplace the culture medium 2x per week.\nMaintain the hepatocytes in maturation medium for 2 weeks to obtain mature hepatocytes ready for HBV infection.\n2. Quantification of cellular NTCP\nMeasuring NTCP expression using real-time PCR\n\t\nCollect the pellet of mature hepatocytes through trypsinization (see Steps 1.2-1.5).\nExtract total RNA from the cell pellet using an RNA extraction kit with DNase I treatment.\nSynthesize cDNA from 200 ng of total RNA using an oligo-dT primer and reverse-transcription system following the manufacturer's instructions.\nDilute the cDNA to 50 ng/µL and use it as a template for the PCR reaction. Mix 2 µL of the diluted cDNA with the PCR master mix reagents containing SYBR green qRT-PCR Kit solution with 5 µM NTCP-specific primers (5'-GGACATGAACCTCAGCATTGTG-3' and 5'-ATCATAGATCCCCCTGGAGTAGAT-3').\nFor normalization, use GAPDH as a housekeeping gene with specific primers (5'-GAAATCCCATCACCATCTTCC-3' and 5'-AAATGAGCCCCAGCCTTCTC-3').\nAmplify the cDNA samples using a thermal cycler under the following temperature conditions: 1 cycle of 3 min at 95 °C (initial denaturation); 40 cycles of 30 s at 95 °C (denaturation), 30 s at 60 °C to 65 °C (annealing), 30 s at 72 °C (extension); 1 cycle of 5 min at 72 °C (final extension).\nCalculate the NTCP fold change in mature hepatocytes over undifferentiated cells using GAPDH as a calibrator gene based on the 2-ΔΔCT method.\nQuantifying NTCP using western blot analysis\n\t\nHarvest hepatocytes using a cell scraper and centrifuge them at 300 x g, 25 °C for 5 min to collect the cell pellet.\nFollow the RIPA buffer manufacturer's instructions to extract the cellular protein with 100 µL of RIPA buffer containing 1x protease inhibitor.",
    "Measure the total protein concentration using the bicinchoninic acid (BCA) method.\nMix 12.5 µL of protein with 2x loading dye in a 1:1 ratio by volume.\nBoil the protein mixture and standard ladder at 95 °C for 5 min.\nAdd 1x running buffer to the electrophoresis chamber.\nLoad 5 µL of the protein standard ladder or 20 µL of the boiled protein mixture in a 10% (w/v) polyacrylamide gel.\nPerform gel electrophoresis: 50 V for 30 min followed by 90 V for 1 h at room temperature.\nPrepare a PVDF membrane by soaking it in methanol for 30 s, wash it with double-distilled water for 1-2 min, and soak it along with two pieces of filter paper in transfer buffer for 10 min or until use.\nPlace the filter paper onto the anode plate of a semi-dry transfer cell; then, place the PVDF membrane, the gel, and the filter paper on top, in that order.\nTransfer the proteins from the gel to the PVDF membrane at 10 V for 25 min at room temperature.\nBlock the membrane with WB blocking solution for 1 h at room temperature.\nIncubate the membrane with anti-sodium taurocholate cotransporting polypeptide (anti-NTCP) (1:100 dilution) at 4 °C overnight.\nWash the membrane 3 x 10 min with TBST.\nIncubate the membrane with horseradish peroxidase (HRP)-conjugated goat anti-rabbit antibody (1:10,000 dilution) for 1 h at room temperature.\nWash the membrane 3 x 10 min with TBST and then 1 x 5 min with TBS.\nDetect NTCP using an HRP substrate (see the Table of Materials).\nAdd at least 0.1 mL of HRP substrate solution/cm2 of the membrane and incubate the membrane for 3-5 min in the dark.",
    "Visualize NTCP using a Gel Documentation System in the chemiluminescence mode, select the marker option for the membrane, adjust the exposure time with accumulative mode every 1 min, and take the photo with various exposure times for 5 min.\nStrip and probe the blot with mouse anti-GAPDH antibody (1:200,000 dilution) and HRP-conjugated goat anti-mouse secondary antibody (1:10,000 dilution).\nMeasuring the NTCP level using flow cytometry\n\t\nCollect the cell pellets of mature hepatocytes by incubating the cells with 8 mM EDTA for 15 min.\n\t\tNOTE: Avoid using trypsin or other proteases that can disrupt cell surface receptors. As NTCP is a cell surface receptor protein, damage due to trypsinization can give negative results.\nFix the hepatocytes with 300 µL of 3.7% paraformaldehyde in 1x PBS for 15 min. Transfer the cell suspension into a 1.5 mL microcentrifuge tube and centrifuge for 10 min at 300 × g, 25 °C.\nWash the cells 2x with 700 µL of 1x PBS with 1% FBS (v/v), centrifuge for 10 min at 300 × g, 25 °C, add 300 µL of 0.05% Triton X-100 in PBS to the cell pellet, and incubate the cells at room temperature for 20 min to permeabilize them.\nCentrifuge for 10 min at 300 × g, 25 °C, wash the cell pellet 3 x 1 min with 700 µL of PBS containing 1% FBS (v/v). Incubate the cells with the primary antibody against NTCP (1:100 dilution) at 4 °C for 30 min. Wash the cells 3 x 1 min with Perm/Wash buffer and centrifuge for 10 min at 300 × g, 25 °C.",
    "Stain the cells with secondary antibody conjugated to Alexa Fluor 488 at 4 °C for 30 min. Wash the cells 3 x 1 min with Perm/Wash buffer and centrifuge for 10 min at 300 × g, 25 °C. Resuspend the cell pellet with 200 µL of PBS with 1% FBS (v/v).\nTurn on the flow cytometer, warm up the laser for 15 min, and perform routine cleaning.\nSelect the measurement parameters, including forward scatter (FSC), side scatter (SSC), and fluorescein isothiocyanate (FITC) or phycoerythrin (PE), and set the auto compensation adjustment by the software. Include the compensation control samples: unstained control, FITC-stained control, and PE-stained control.\n\t\tNOTE: FSC and SSC parameters are used to determine the size and granularity of individual cells to select the cell population for gating analysis. The fluorescence channel detector has FITC and PE channels. For this protocol, select the FITC channel to detect Alexa Fluor 488.\nRun the unstained sample with medium fluidic flow rate (60 µL/min), adjust the threshold of FSC and SSC until they cover the cell population of interest, mark the gate region in this area, and apply to all compensation controls.\nSet the fluorescence photomultiplier tube (PMT) using the unstained control, and adjust the PMT voltage of FITC or PE in the negative quadrant. Run the positive stained sample and adjust FITC or PE in the positive quadrant scale. Run the unstained, FITC-stained, or PE-stained controls, calculate the compensation, and apply it to the sample settings. Run the hepatocyte sample to measure the NTCP level.\nAnalyze the stained hepatocytes using flow cytometer software (see the Table of Materials).\n\t\t\nUnder BD FACSuite windows, click on the control tube in the Data Sources Tab and wait for the raw data to appear.",
    "In the Worksheet tab on the right-hand side, click on the Ellipse Gate button, select the cell population in SSC and the FSC dot plot using the mouse cursor, and wait for the circle P1 to appear.\nClick on the Interval Gate button and mark the region in the FITC histogram, starting from the highest fluorescence intensity value to the right-hand side. Observe the line P2 that appears.\nClick on the experiment tube and observe that the data in the Worksheet tab changes. Click on the Statistics button and then on the empty space in the worksheet. Observe the statistical values of the NTCP population that appear.\n3. Production of the cell culture-derived HBV particles (HBVcc)\nCulture HepG2.2.15 in complete medium (DMEM supplemented with 10% FBS, 100 U/mL penicillin, and 100 µg/mL streptomycin) in a 10 cm Petri dish for 24 h.\nReplace the complete medium supplemented with 380 µg/mL geneticin (G418) when the HepG2.2.15 reach 60%-70% confluence. Harvest the conditioned medium every 2 days; store the medium containing HBV at 4 °C.\nRemove cell debris by centrifuging the supernatant at 5,000 × g, 4 °C for 20 min. Collect the conditioned medium using a 20 mL syringe and filter it through a 0.45 µm low-protein-binding filter to remove cell debris.\nTo concentrate HBV, dilute 1 volume of concentrator with 3 volumes of the filtered supernatant from Step 3.3 in a conical centrifuge tube and carefully mix the solution by tube inversion. Place the mixture at 4 °C for 1 h. Centrifuge the solution for 1 h at 1,500 × g, 4 °C and ensure that an off-white pellet is visible.\n\tNOTE: For every 30 mL of filtered supernatant from Step 3.3, add 10 mL of the concentrator to reach 40 mL of total volume.",
    "Evaluate the HBV titer (genome equivalent) with HBV 1.3-mer WT replicon as a standard curve ranging from 1 × 102 to 1 × 1010 using absolute real-time PCR, as described previously11.\nGently reconstitute the pellet in FBS and store for up to 1 year at −80 °C in single-use aliquots.\n4. Anti-HBV entry assay\nMaintain 100% confluent imHC or HepaRG in 6-well plates in maturation medium (2% DMSO in Williams' E medium, 10% FBS, 100 U/mL penicillin, 100 µg/mL streptomycin, 5 µg/mL insulin, 50 µM hydrocortisone, and 2 mM L-glutamine) for 2 weeks and change the medium 2x per week.\nAspirate the medium, then add the curcumin (10-30 µM) or 4 µM cyclosporine A (CsA) diluted with William's E medium for 2 h. Aspirate the candidate HBV entry inhibitor and replace it with 1 mL of William's E medium containing 4% polyethylene glycol.\nAdd HBV particles to the culture medium at a multiplicity of infection (MOI) of 100 per well and incubate at 37 °C for 18 h. Discard the supernatant, add 2 mL of cold PBS, and swirl gently to rinse off the old medium with unbound HBV.\nAdd 2 mL of complete William's E medium and culture for 7 days. Aspirate the medium, wash the cells with 1x PBS, and fix the cells with 3.7% paraformaldehyde in PBS for 15 min at room temperature. Permeabilize and block the infected cells with IF blocking solution (0.2% Triton X-100 and 3% bovine serum albumin in PBS) and incubate them for 60 min at room temperature.\nAdd the primary antibody (anti-HBV core antigen) at 1:200 dilution in the blocking solution and incubate overnight at 4 °C. Wash the cells 3 x 1 min with washing solution (0.5% Tween 20 in PBS).",
    "Add secondary antibody (1:500 dilution) to the IF blocking solution, incubate for 1 h at room temperature, and wash the cells 3 x 1 min with washing solution.\nMount the sample with antifade mounting medium with 4',6-diamidino-2-phenylindole (DAPI), and cover with a glass coverslip. Detect the fluorescence signal using a fluorescence microscope equipped with a DAPI filter (Ex 352-402 nM and Em 417-477) and a PE filter (Ex 542-582 and Em 604-644), along with a 20x objective lens, and determine anti-HBV entry activity of the candidate compounds.\n5. HBV-cell binding assay\nMaintain 100% confluent imHC or HepaRG in 6-well plates in maturation medium (2% DMSO in Williams' E medium, 10% FBS, 100 U/mL penicillin, 100 µg/mL streptomycin, 5 µg/mL insulin, 50 µM hydrocortisone, and 2 mM L-glutamine) for 2 weeks and change the medium 2x per week.\nAspirate the medium, then add curcumin (10-30 µM) or cyclosporine A (4 µM) diluted in William's E medium for 2 h. Aspirate the HBV entry inhibitor and replace it with 1 mL of William's E medium containing 4% polyethylene glycol.\nAdd HBV particles to the culture medium at an MOI of 100 per well and incubate at 4 °C for 2 h to allow HBV binding to the hepatocytes. Discard the medium containing unbound HBV, add 2 mL of cold PBS, and swirl gently to remove traces of the spent medium.",
    "Harvest the infected cells using a cell scraper and disrupt the cells with lysis buffer. Transfer the lysate to a collection tube and extract total DNA to evaluate the HBV DNA using real-time PCR with specific primers for HBV (forward primer: 5´- GTT GCC CGT TTG TCC TCT AATTC-3´, and reverse primer: 5´- GGA GGG ATA CAT AGA GGT TCC TTG A-3´) using PRNP (forward primer: 5´- GACCAATTTATGCCTACAGC-3´, reverse primer: 5´- TTTATGCCTACAGCCTCCTA-3´) as an internal control.\nAmplify the PCR products in a thermal cycler using the temperature conditions described in Step 2.1.\nCalculate relative HBV DNA levels/1 × 106 cells in treatment versus control using PRNP as the calibrator gene based on the 2-ΔΔCT method.\n6. Taurocholic acid (TCA) uptake assay\nMaintain 100% confluent imHC and HepaRG cells in maturation medium for 14 days.\nAspirate the medium and wash the hepatocytes with 1x PBS. Add curcumin or cyclosporine A (10-50 µM) diluted in William's E medium for 2 h. Replace the medium with the sodium taurocholic acid solution (0.5 M sodium taurocholate hydrate in 1x HEPES) and incubate for 15 min at room temperature.\nAspirate the sodium taurocholic acid solution, and wash 3x with cold 1x HEPES. Add 300-500 µL of cold 1x HEPES and harvest the cells with cell scrapers on ice.\nHomogenize the cells by ultrasonication at a frequency of 20 kHz for 20 s and incubate on ice for 5 min. Centrifuge the lysates at 10,000 × g for 20 min to precipitate cell debris. Collect the supernatant and evaluate intracellular taurocholic acid concentration using a TCA ELISA assay kit (see the Table of Materials).\n7. Determination of protein-ligand interactions using isothermal titration calorimetry\nNOTE: This assay system was developed based on the MicroCal PEAQ-ITC (ITC software).\nPrepare the buffer (50 mM Tris-HCl buffer, pH 7.0).",
    "Prepare 15 µM of NTCP in the buffer.\nPrepare 150 µM candidate HBV entry inhibitor solutions in the buffer.\nWash the sample cell, the reference cell, and the syringe in the ITC instrument using the buffer (Step 7.1.).\n\t\nLaunch the ITC software by double-clicking on the software icon in Windows systems. Under the Run experiment highlight tab, select microCal Method for 19 Injection.itcm, and click on open. When a new window opens, click on the clean tab, and in the Cleaning Method window, select the Wash button for Cell Cleaning Method and the Rinse button for Syringe Cleaning Method. Click on Next and follow the on-screen instructions.\n\t\tNOTE: The washing step can take 1.4 h to complete.\nLoad the sample into the ITC; under the Run Experiment tab, click on the Load button, and read the on-screen instructions. Click on next and follow the video instructions until this loading step is completed.\n\t\nFill the reference cell with solution buffer using a syringe. Fill the sample cell with 15 µM NTCP in buffer using a syringe and remove the excess NTCP solution over the sample cell. Fill the syringe with 150 µM solution of the curcumin (ligand), avoiding air bubbles in the syringe.\nRun the sample, and under the Run Experiment tab, click on the Run button. Observe the windows on the left-hand side showing experimental information and experimental setting. Enter the ligand and protein concentrations as 150 µM in [Syr], 15 µM in [Cell], and 25 °C in temperature.\nIn the software, click on start to perform the injection process and wait for 1.4 h for the protein-ligand interaction to complete.\n\tNOTE: The faded analyze button appears under the software windows.",
    "Observe that the analyze button brightens after the injection is complete. Click on the analysis button in the control software to analyze the raw data using the analysis software. Click on overview to display the raw data and choose the fitting model as One Set of Binding Site.\nEnsure that binding status shows the experimental data (binding, no binding, control, or check data) and that the experiment values (KD, ΔG, ΔH, TΔS, and N) are presented on the software panel.\nExport the thermodynamic parameters that predict the interaction binding, including hydrogen bond, van der Waals bond, and hydrophobic interaction into tif or jpeg format.\nAfter the experiment is complete, wash the sample cell following Step 7.4.\n8. Statistical analysis\nPerform all experiments in three independent replicates (n = 3).\nPresent experimental data as means ± SD, and perform statistical analysis using the desired statistical analysis software.\nUse a two-tailed unpaired Students' t-test to compare between two mean values or apply one-way analysis of variance (ANOVA) with Dunnett for multiple comparisons between multiple values to a control value. Set the significance level at p ≤ 0.05.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}