{
  "id": 9511,
  "origin_website": "Jove",
  "title": "Imaging pHluorin-tagged Receptor Insertion to the Plasma Membrane in Primary Cultured Mouse Neurons",
  "procedures": [
    "1. Preparing Mouse Glia Culture for Neuronal Culture Conditioning\nT75 flasks are coated with collagen solution (1:3 dilution of Purecol in ddH2O). The flasks are set upright and left to dry overnight in a tissue culture hood.\nDissection buffer (aCSF: 119 mM NaCl, 5 mM KCl, 1 mM MgCl2, 30 mM dextrose, 25 mM HEPES, pH 7.4, without calcium) and glia media (DMEM supplemented with 10% FBS, 10 units/ml penicillin, 10 μg/ml streptomycin, and Glutamax) are prepared and stored at 4 °C until ready for use.\nOn the day of glia culture, the glia media is warmed for at least 30 min in a 37 °C water bath before dissection of mouse brains. Embryonic or neonatal mice are euthanized by rapid decapitation. Cerebral cortexes are dissected out under a dissection microscope.\nDissected brain tissues are digested in papain solution (100 ml papain and 20 μl 1% DNase I in 2 ml dissection buffer) at 37 °C for 20 min.\nFollowing papain digestion, brain tissues are rinsed with 10 ml pre-warmed glia media. Fresh glia media (2 ml) is then added to the digested brain tissues, and the tissues are triturated with a fire-polished glass Pasteur pipette.\nFresh glia media (8 ml) is added to the dissociated tissues. A 70 μm cell-strainer is used to filter the dissociated tissue suspension. Cells are then seeded into T75 flasks (usually 2-3 embryos can seed one T75 flask) and placed into a 37 °C cell culture incubator.\nThe next day, the media from the T75 flasks is aspirated. The flasks are rinsed with 10 ml PBS. Fresh glia media (10-15 ml) is then added to each flask.",
    "Within 10-12 days, glia in the T75 flasks should be confluent. Glial cells are rinsed with PBS, and 5 ml of 0.05% trypsin is added to each T75 flask.\nAfter trypsin incubation at 37 °C for 5 min, glial cells are dissociated and glial cells from each T75 flask are split into two different collagen-coated T75 flasks.\nCulture inserts (Millipore PICM03050) are prepared by placing them into 6-well plates, coating them with collagen, and air-drying overnight. Glia media (2 ml each) is placed underneath each culture insert.\nGlia from confluent T75 flasks are trypsinized and seeded onto the culture inserts (one T75 flask per 6-well plate, 2 ml each insert). These glia culture inserts will be used to condition the neuronal cultures.\n2. Neuronal Culture\nThe glass coverslips for neuronal culture are cleaned by soaking in 70% HNO3 at least overnight. Coverslips are then washed with ddH2O at least 3 times, and dried in an Isotemp Oven (>200 °C) overnight.\nCleaned coverslips are placed in a 6-well plate, one coverslip per well. Coverslips are coated with poly-L-Lysine solution (2 ml, 0.1% in 100 mM boric acid, pH = 8.5) overnight in a 37 °C incubator.\nThe poly-L-Lysine solution is removed from the coverslips and coverslips are washed 3 times with autoclaved ddH2O. Coverslips are then incubated in a 37 °C incubator overnight in plating media (Neurobasal supplemented with 5% heat-inactivated horse serum, 10 units/ml penicillin, 10 μg/ml streptomycin, Glutamax; 2% B27 supplement is added to the plating medium on the day it is used).\nOn the following day, the plating media is removed and 2 ml of fresh plating media with B-27 is added to each well that has a glass coverslip.",
    "Pregnant mice (E15-18) are euthanized with CO2, and embryonic mice are euthanized by decapitation. The hippocampus or striatum is dissected from the brain tissue and placed into a 15 ml conical tube with ice-cold dissection buffer, for culture of hippocampal neurons or striatal medium spiny neurons, respectively.\nDissected brain tissues are dissociated with papain as described in steps 1.4) and 1.5).\nFollowing dissociation, the number of cells in each neuronal suspension is counted with a hemocytometer. Neurons are then seeded on each coverslip at a density of 0.4 x 106 cells per well of a 6-well plate, and cultured in a 37 °C incubator overnight (neurons are DIV 0).\nTo prepare glia culture inserts for conditioning the neuronal cultures, the glia media is removed from the glia culture inserts and fresh plating medium is added (2 ml in the insert and 2 ml underneath the insert).\nThe next day (DIV 1), coverslips with neurons are placed underneath the glia culture inserts, one coverslip in each well.\nNeurons are fed with half the volume of fresh pre-warmed feeding media (with B-27) every 3-4 days until they are ready for transfection and imaging experiments.\n3. Transfection\nNeuronal transfection is performed using Lipofectamine 2000. For each neuronal culture (one culture per coverslip), 2 μl Lipofectamine 2000 and 1 μg of DNA are used. Fresh Neurobasal medium with no supplement is used to dilute Lipofectamine and DNA.\nDNA and Lipofectamine are incubated for 20 min at room temperature after mixing.\nSave 1 ml of the media from underneath each glia culture insert, and 1 ml from inside each insert, and transfer the media to a conical tube. Add the same volume of feeding media + B27 to the saved medium and incubate at 37 °C. This medium is used for neuronal culture following transfection.",
    "Following the 20-min Lipofectamine/DNA incubation, glia culture inserts are removed momentarily from the 6-well plates. The 200 μl Lipofectamine/DNA mixture is added to each coverslip with neurons. The glia culture inserts are then returned to each well, above the neurons. Generation of bubbles under the membrane of the culture inserts should be avoided. Neurons are incubated with the Lipofectamine/DNA mixture at 37 °C for 2-4 hr.\nAfter the 2-4 hr incubation period, glia inserts are removed again. The culture media with the Lipofectamine/DNA mixture is removed from each well. The media saved in step 3.3) is added to neurons (2 ml per well). Glia culture inserts are returned to each well, and the glia media from each insert is removed, and 2 ml of the media from step 3.3) is added into each insert.\nNeurons are cultured for an additional 24-72 hr to allow expression of transfected cDNA before TIRF imaging is performed on these neurons.\n4. TIRF Imaging\nArtificial Cerebrospinal Fluid (aCSF: 119 mM NaCl, 2.5 mM KCl, 30 mM glucose, 2 mM CaCl2, 1 mM MgCl2, 25 mM HEPES, pH = 7.4) will be used for live-imaging experiments. Our TIRF imaging system is custom set-up with a 100-mW Cyan laser for excitation, and an Electron Multiplying Charge Coupled Device (EMCCD) camera for a detector.\nPrior to imaging experiments, the aCSF is warned in a 37 °C water bath for at least 30 min. The heating insert for live imaging is placed on the microscope stage, and the heating insert, laser, and camera are warmed for at least 30 min before the start of the imaging experiments.",
    "A coverslip with transfected neurons is assembled into the live-imaging chamber. The pre-warmed aCSF is placed in the chamber after the chamber is assembled; this step should be completed as quickly as possible.\nOnce the chamber is placed on the heating insert on the microscope stage, transfected neurons are identified visually under epi-fluorescent imaging mode.\nAfter healthy transfected neurons are identified (refer to Figures 1 and 2), we typically perform 1 min of photo-bleach to eliminate pre-existing pHluorin fluorescence on the plasma membrane, as pHluorin-receptors on the plasma membrane have very high fluorescence levels when TIRF imaging is first started, which interferes with visualization of individual insertion events.\nFollowing photobleach, the gain setting of the electron multiplier on the EMCCD camera is set to maximum, and recording is performed for 1 min at 10 Hz.\nEach recording will contain 600 images. Individual insertion events are identified by playing the recording back using ImageJ. Individual insertion events are analyzed manually using ImageJ.\n5. Representative Results",
    "Consistent neuronal culture is the key to successful live-imaging experiments. Figure 1 shows mouse hippocampal neurons cultured using our protocol from DIV 11 to DIV 18. It is clear from the images that the neurons have developed extensive processes and that the dendritic processes are covered densely with dendritic spines, indications that these neurons are healthy in culture. Our culture protocol could also be used for other types of neurons in the brain. For example, we recently used this protocol to culture striatal medium spiny neurons in a study to examine dopamine D2 receptor (DRD2) insertion in cultured mouse striatal medium spiny neurons 9. Figure 2 shows mouse striatal medium spiny neurons cultured using our protocol at DIV 8. We have also successfully performed TIRF imaging of superecliptic pHluorin-tagged DRD2s in this type of neuron. Figure 3 shows expression of pHluorin-tagged DRD2 (pH-DRD2) in a medium spiny neuron and visualization of pH-DRD2 insertion in this neuron.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4450/4450fig1.jpg\nFigure 1. Mouse hippocampal culture using the interface culture method. DIV: days in vitro, the day of culture is considered as DIV 0. From the images, it is evident that hippocampal neurons mature in this type of culture between DIV 11 and DIV 15. At DIV 11 and 13, neuronal dendrites are covered with filipodia and immature spines. At DIV 15 and 18, neuronal dendrites are covered with large spines, an indication of more mature neurons. Left panels: low-magnification images of mouse hippocampal neurons at different ages. Right panels: high-magnification images (zoom in on neuronal dendrites of the left panel) of neuronal dendritic processes with dendritic spines at different ages.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4450/4450fig2.jpg\nFigure 2. Mouse striatal medium spiny neuron culture using the interface culture method. Neurons in the images are at DIV 8.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4450/4450fig3.jpg",
    "Figure 3. A mouse striatal medium spiny neuron transfected with super ecliptic pHluorin-tagged dopamine D2 receptor (pH-DRD2). Image on the left is maximum intensity projection of a time-lapse recording (600 images, 100 msec per image). White arrowheads indicate individual vesicular insertion of pH-DRD2. This image retains insertion information in the x-y dimension but loses the time information. Image on the right shows y-t maximum intensity projection, in which the x-y-t stack is rotated 90 degrees around the y-axis, and the maximum pixel on each x-axis line is projected onto a single y-axis pixel. This image retains insertion information along the y-t axis but loses the x-axis information.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}