{
  "id": 17195,
  "origin_website": "Jove",
  "title": "Application of Laparoscopic Hepatectomy Combined with Intraoperative Microwave Ablation in Colorectal Cancer Liver Metastasis",
  "procedures": [
    "This study was approved by the Ethics Committee of the Sixth Affiliated Hospital, Sun Yat-sen University. The diagnostic criteria and treatment strategies refer to Chinese guidelines for the diagnosis and comprehensive treatment of colorectal liver metastases (version 2018) and the Shanghai International Consensus on Diagnosis and Comprehensive Treatment of Colorectal Liver Metastases (Version 2019). The patient had clinical symptoms such as hematochezia, intestinal obstruction, liver pain, and weight loss. Patients with unresectable multiple liver metastases diagnosed by CT, MR, B-ultrasound, liver function, CEA, AFP, and other tumor markers were included in the study. The representative patient and their family have been informed of the contents of this agreement, the video shooting, and other relevant content; a signed informed consent form and authorization have been obtained from the patient.\n1. Instruments for operation\nBefore surgery, ensure that the surgical instruments mentioned in the Table of Materials are sterile, the surgical materials are complete, and the surgical equipment is normal.\n2. Preparation for operation\nPrepare the belly button and skin for abdominal surgery. Clean the belly button and shave the belly hair.\nBowel preparation: Ask patients to start consuming a residual-free diet, such as porridge and liquid foods, within 3 days before surgery, and guide them to take laxatives such as 139.12 g of compound polyethylene glycol electrolyte powder in 2,000 mL of warm water 1 day before the surgery. Ask the patient to have a clean enema on the night before surgery and in the morning on the day of surgery until all feces are discharged. The feces should be water samples without fecal residues. No food or drink is allowed for 8 h before the surgery. Insert a gastric tube for gastrointestinal decompression before the surgery.",
    "Ask the patient to lie supine on the operating table, and give general anesthesia with endotracheal intubation.\nEnsure the surgeons wash their hands during surgery, disinfect the operating area twice with 5% iodophenol, deiodize it once with 70% alcohol, and place surgical towels.\nAt 30 min before the operation, administer 2.5 g of cefoperidine and sulbactam sodium and 100 mL of 0.9% sodium chloride solution intravenously.\n3. Laparoscopic hepatectomy combined with intraoperative microwave ablation for colorectal cancer liver metastases\nInsert a 12 cm trocar into the navel and abdominal cavity for aeration. Maintain the abdominal pressure at 12-15 mmHg, place 12 cm trocars under the xiphoid process and 15 cm below the costal margin of the right midclavicular line, and place two additional 5 cm trocars on the left and right sides (Figure 1).\nPlace the laparoscope into the navel trocar to explore the cavity organs, such as the intestine, and the parenchymal organs, such as the liver in the abdominal cavity (Figure 2A). Separate the round and falciform ligaments associated with the abdominal wall and diaphragm of the liver using an ultrasonic knife (Figure 2B).\nInject the contrast agent intravenously during the operation, and then place the laparoscopic ultrasound probe into the abdominal cavity from the two trocars 12 cm to explore the whole liver (Figure 3B).\nUnder the effect of the contrast agent, locate the metastatic tumors in the S5 and S7 segments of the liver by ultrasound, and make localization markers on the liver surface (Figure 3A).",
    "For liver segments or liver lobes with less than three liver metastases, perform anatomic lobe or liver segment resection with an ultrasonic knife as per the portal vein drainage (Figure 4). Dissect the liver parenchyma of the left lateral lobe (Figure 4A), and sever the branch of the umbilical fissure vein (Figure 4B). Expose the hepatic pedicles between segment II and segment III (Figure 4C), and sever the left lateral lobe of the liver with a nail gun (Figure 4D).\nUse laparoscopic ultrasound to locate the boundaries of the tumor and to mark the surface of the liver (Figure 5A). Keep the margin of resection >1 cm from the tumor, and perform the local liver parenchymal resection with an ultrasonic scalpel (Figure 5B).\nDetect liver metastases using laparoscopic ultrasound pressed to the liver surface (Figure 6A). Enter the microwave ablation needle into the abdominal cavity through the percutaneous puncture. This ensures that the laparoscopic puncture path avoids the thorax and surrounding organs and that ultrasound can be used to guide the microwave ablation needle into the tumor center for ablation. At the same time, microwave ablation under abdominal ultrasound can avoid important blood vessels and bile ducts in the liver (Figure 6B).\nDetermine the metastatic lesions and the puncture site of microwave ablation by CT or B-ultrasound before the operation, and mark the surface puncture. After the localization of the metastasis, insert the microwave ablation needle into the abdominal cavity under direct laparoscopy.\nFor metastatic tumors less than 3 cm in diameter, perform microwave ablation at 55 W power for 5 min by inserting a microwave ablation needle into the center of the metastatic tumor under the guidance of a laparoscopic ultrasound probe.",
    "NOTE: Colorectal cancer liver metastases are mainly multiple liver metastases, and different treatments can be performed for different metastatic lesions. For metastatic lesions in the left lateral lobe, surgical resection can be performed if the remaining liver volume is sufficient. Microwave ablation can be used for metastatic lesions in occult sites that are difficult to resect or cannot be resected. Taking the ablation of a metastatic tumor in the S7 segment of the liver as an example, if the lesion is not easy to find with laparoscopic ultrasound, or the percutaneous puncture path needs to pass through the thorax or organs, it is necessary to free the perihepatic tough band (Figure 7A) and rotate the liver downward (Figure 7B) to expose the S7 segment of the liver. In this study, the metastatic tumor in segment S7 of the liver was re-located by ultrasound (Figure 7C), and thoracotomy was avoided. Microwave ablation needles were inserted into the center of the metastatic tumor, and ablation was performed under a specific power microwave ablation machine. Successful ablation was defined as liver tissue necrosis 3 cm away from the tumor center (this video is liver S7 segment ablation; Figure 7D).\nElectocoagulate the liver parenchyma sections with an ultrasonic scalpel, and place a hemostatic gauze (Figure 8A). Clean the abdominal cavity, and place a drainage tube (Figure 8D). Close the trocar pinhole with 2-0 polyglactin 910 sutures.\n4. Postoperative care\nAsk the patient to fast, take parenteral nutrition, and perform early ambulation at 48 h after surgery.\nPerform ECG monitoring, pay attention to the patient's blood pressure, pulse, blood oxygen, and other vital signs, and review routine bloods, liver function, coagulation function, electrolytes, etc.",
    "Bleeding is likely to occur within 48 h after surgery. Closely observe whether there is abdominal pain, abdominal distension, tenderness, or rebound tenderness, and pay attention to the quantity, color, and character of the drainage fluid from the abdominal drainage tube. Note whether the patient has defecation exhaust.\nAt 1 week after the surgery, discharge the patient from the hospital and instruct the patient to return to the hospital 1 month later for chemotherapy and an abdominal ultrasound review and to undergo microwave ablation again if necessary.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}