{
  "id": 4599,
  "origin_website": "Bio",
  "title": "Determination of the Secondary Structure of an RNA fragment in Solution: Selective 2`-Hydroxyl Acylation Analyzed by Primer Extension Assay (SHAPE)",
  "procedures": [
    "Cloning of RNA to be analyzed in SHAPE cassetteRNA segment was cloned into SHAPE cassette (Figure 1) (Wang et al., 2010). SHAPE cassette has been checked to ensure that it is not prone to forming stable base pairing interactions with the internal sequence. We have design a structure cassette that contains flanking sequences that allow evaluate all positions within the RNA of interest. The primer binding site of this cassette efficiently binds to a cDNA primer.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150119/20150119182718_8068.jpgFigure 1. Schematic representation of the construct used for the determination of secondary RNA structure by SHAPE technology. The sequence fragment of the RNA to be analyzed is cloned between the EcoRI and HpaI restriction sites of the SHAPE cassette (Wang et al., 2010). Preparation of RNA by in vitro transcriptionLinearized DNA plasmid (≈0.5 µg) with SmaI used as template for in vitro transcription with MEGAshortscript (transcription protocol in user guide).After transcription, purification was made by phenol:chloroform extraction and alcohol precipitation as described in protocol. Alcohol precipitation was carried out overnight at - 20 °C with 3 M sodium acetate (pH 5.2) instead ammonium acetate. RNA recovery by centrifugation, followed by wash with 70% ethanol and dissolve pellet in 20 µl nuclease-free water.SHAPE analysisRNA refoldingNeed 500 ng to 1 µg RNA per reaction.Resuspend RNA in water. For example for 4 reactions resuspend RNA to make 40 µl total volume in an Eppendorf tube.Denaturation of RNA, 94 °C/1 min.Incubate on ice, 2 min.Divide 10 µl of refolded RNA into each tube.Add 30 µl of nuclease free water supplemented with 0.5 µl RNAse inhibitor into each tube.Add 10 µl of 5x SHAPE buffer and incubate, 30 °C/30 min.Modification Add 5.5 µl of DMSO (untreated) or BzCN (treated), 2 min.Add 6 µl of 3 M NaOAc (pH 5.2) in each epp.",
    "Add 2 µl of tRNA yeast at 1.9 mg/ml + 190 µl of 100% EtOH, -20 °C, overnight.Next dayCentrifuge 14,000 rpm 4 °C, 40 min.Wash using 1ml of 70% ethanol and centrifuge 14,000 rpm, 4 °C, 10 min.Dry RNA pellet and resuspend in 20 µl. Quantify in Nanodrop. Continue with primer extension only with RNAs ≥ 100 ng/µl, 15 min.Label primertable:",
    "﻿0,1\ndH2O,33 µl\nPrimer (150 pmol),3 µl\n10x PNK buffer,6 µl\nγP32 ATP,15 µl\nPNK,3 µl\n37 °C, 30 minPurify using biospin columns.Measure counts in a liquid scintillation counter if 107 cpm activity proceed to probing. Primer extensiontable:\n﻿0,1,2,3\nRNA modified,,Sequencing ladder,\nRNA,500 ng,RNA no treated,200 ng\ndNTPs (2.5 mM),2 µl,dNTPs/ddNTPs,2 µl\nLabeled primer,2 µl,Labeled primer,2 µl\ndH2O,,,\nTotal,12 µl,Total,12 µl\nIncubate on ice, 2 min.Incubate at room temperature, 5 min.Cocktail RT (reverse transcription)table:\n﻿0,1\n0.1 mM DTT,2 µl\nRT buffer,4 µl\nRNase inhibitor,0.2 µl\nRT,0.1 µl\ndH2O,2 µl",
    "42 °C, 30 minAdd 4 µl of 1 M NaOH, 95 °C, 30 min.Add of Gel loading buffer II (see Item 18 in Materials and Reagents) (15-20 µl), 95 °C, 4 min.Mix, spin and incubate on ice before loading onto the gel, 3 min.Pre-run gel: Load 2 µl Gel loading buffer II and conduct electrophoresis at constant power of 60 W, 15 min.Load samples in gel: 2 µl/lane. Conduct electrophoresis at constant power of 60 W.Run gel (you may do a long run approximately 3 h for resolving 5´end or a short run approx. 2 h for resolving 3’ end or your molecule), 2-3 h.Remove one of the glasses plates, allowing the gel to remain attached to the second plate. Press a sheet of Whatman paper on top of the gel. The gel will adhere to the Whatman paper and can be peeled away from the remaining glass plate. Cover the gel with plastic wrap.Dry the gel, 2 h.Expose to phosphorimager screen, ≈ 15 h.Scan in Typhoon 9410 scanner at 50 micron resolution (Figure 2), 10 min.Use SAFA Footprinting Software for analyze bands: https://simtk.org/docman/view.php/69/496/SAFAUserGuide_v1_1.pdf.[href=https://simtk.org/docman/view.php/69/496/SAFAUserGuide_v1_1.pdf]The protocols implemented in SAFA have five steps: (a) lane identification, (b) gel rectification, (c) band assignment, (d) model fitting and (e) band-intensity normalization. Software will generate normalized bands intensities values (reactivity data).Use reactivity data from SAFA and classify it in “High, medium and low reactivity” according with normalized band intensity value from each nucleotide. Use “x” or “X” to indicate reactive nucleotides and “.” to indicate unreactive. Fill it in point 4 (Single-Stranded Chemical/Enzymatic Reactivity Data) of MC-Fold http://www.major.iric.ca/MC-Fold/[href=http://www.major.iric.ca/MC-Fold/] (Figure 3).MC-Fold will generate the top 20 structures.Choose structures that they are more fit of your reactivity data.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150119/20150119182744_3596.jpgFigure 2. Secondary structure probing of a cap-independent translation enhancer (3´-CITE).",
    "Structure probing by SHAPE of the first 65 nt of the 3´-UTR of MNSV-N, including the new 3´-CITE. Primer extension products separated on denaturing PAGE of RNA treated (lanes 4-6) or untreated (lane 3) with BzCN. Concentrations of Mg2+ (mM) are indicated above lines 4-6. The sequencing ladder was generated by reverse transcription of unmodified RNA in the presence of dideoxyCTP (ddCTP) or ddATP. Positions of nucleotides A4002, A4029 and A4047 are indicated on the left. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150119/20150119182758_0721.jpgFigure 3. Secondary structure of the new 3´-CITE probed in Figure 2. SHAPE reactivity of nucleotides superimposed on secondary structure predicted by Mfold. Color-coded bases indicate the levels of BzCN modification, with warmer color indicating greater modification (inset)."
  ],
  "subjectAreas": [
    "Microbiology",
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}