{
  "id": 11207,
  "origin_website": "Jove",
  "title": "Visualization of Cortex Organization and Dynamics in Microorganisms, using Total Internal Reflection Fluorescence Microscopy",
  "procedures": [
    "1. Sample Preparation\nPreparing cover slips\nCoverslips should be cleaned from dust particles as TIRF is sensitive to background signals arising from the coverslip (Fig. 1A, Movie 1).\n      \nUsing forceps place cover slips in a ceramic holder with lid.\nFill glass container with 1 M NaOH (can be reused multiple times).\nIncubate for 2 h under slow continuous rotation (orbital shaker). Excessive incubation (> 8 h) will create opaque cover slips.\nWash twice with distilled water for 5 min under slow continuous rotation.\nStore in ceramic holder covered in 100% ethanol.\nPreparing Bacillus subtilis cells\nDilute to an OD600 of 0.01 - 0.05 in 5 ml of appropriate growth media and grow to exponential phase (OD600 of 0.3-0.7).\nPrepare 1.25% agarose in water or medium. Use synthetic media to reduce background fluorescence. Dissolve powder in a 1.5 ml plastic tube at 95°C and store in heating block at 72°C.\nAdd a small drop of agarose to the middle of a slide and press into a flat pad with a second slide. Carefully separate slides after at least 2 min or before use.\nSpin down 500 μl cells in micro centrifuge at 12.000 rpm for 1 min.\nDiscard supernatant, and resuspend pellet in 50 μl medium.\nAdd 2-4 μl cells to the centre of the agarose pad.\nTake a cleaned cover slip from the ethanol filled container with forceps, dry with pressurized air and carefully place on sample.\nLet cells settle for at least 2 min prior to microscopy.\nSeal edges of coverslip with VALAP (Vaseline, Lanolin and Parafin, mixed at equal weight under heat, apply with small brush or spatula) for long term imaging.\nPreparing Saccharomyces cerevisiae cells\nDilute pre-culture and grow in appropriate media for at least 5 h to exponential phase (OD600 0.2-0.8).",
    "Take a coverslip from the container with forceps and dry with pressurized air.\nSpread 5 μl Concanavalin A solution (ConA, 2 μg/ml in distilled water) on cover slip with a pipette and dry with pressurized air. ConA binds to carbohydrates of the yeast cell wall and immobilizes yeast cells.\nTransfer 4.5 μl yeast cell suspension to one side of the ConA-coated coverslip. Carefully place cover slip on microscope slide. Start with one edge and let drop slowly to avoid formation of air bubbles.\nLet cells settle for at least 2 min prior to microscopy.\nSeal edges of coverslip with VALAP (see above) for long term imaging.\n2. Image Acquisition\nMicroscope setup\nWe performed all experiments on a customized TIRF setup based on a fully automated iMIC stand (Till Photonics) with an Olympus 100x 1.45 NA objective. 75 mW DPSS lasers at 488 nm (Coherent Sapphire) and 561 nm (Cobolt Jive) were used as light sources. Lasers were selected through an AOTF and directed through a broadband fiber to the iMIC. A galvanometer-driven two-axis scanner head was used to adjust incidence angles or Fluorescence Recovery after Photobleaching (FRAP) position. An additional galvanometer was used to switch between epifluorescence, FRAP and TIRF. Images were collected with an Andor iXON DU-897 EMCCD camera and a 2x magnification lens in front of the camera. Acquisition was controlled by the Live Acquisition (Till Photonics) software package. \nThe following points should be considered:\nProgrammable control over illumination source (laser line) and TIRF angle is essential for reproducible results and especially for multi-color TIRF, where incidence angles need to be adjusted for each excitation wave length to ensure equal penetration of evanescent waves. In our setup TIRF angle can be adjusted instantaneously via two galvanometers, which are directly controlled from the Live Acquisition software package.",
    "Our customized setup additionally allows rapid switching between epifluorescence, TIRF and FRAP via a third galvanometer, allowing simple measurement of localization kinetics for objects traced in TIRF.\nObjective-type TIRF requires high numerical apertures of NA>1.4. We used an Olympus 100x NA 1.45 objective.\nEMMCD cameras work very well with TIRF due to their high signal to noise ratio. To allow imaging with optimal sensitivity we used a 512x512 pixel back illuminated EMCCD camera with a pixel size of 16 μm. To maintain maximum resolution we placed a 2x magnification lens in front of the camera.\nAs TIRF is a widefield technique, intensity of laser beams is spread out. Strong lasers therefore often improve imaging. We used 75 mW diode pumped solid state (DPSS) lasers at 488 nm and 561 nm.\nTo keep cells under optimal growth conditions during imaging, use appropriate environmental controls. We used a custom made heating chamber (Fig. 1B) to study yeast temperature sensitive mutants. For medium exchange during acquisition we either used simple flow chambers or glass-bottom culture dishes that can be easily accessed from above on the inverted microscope.\nAdjusting parameters\nIdentify position of cells using bright field illumination. Red LEDs are particularly good as they do not induce significant photo damage.",
    "Switch to laser illumination and select appropriate lasers and filter combinations to excite the fluorophores of choice. Make sure that the TIRF angle is subcritical, or you will not be able to detect any signal arising from GFP fusion proteins. If in doubt set TIRF angle to 0° to obtain a perpendicular laser beam. Find the top section of the cell (side of the cell facing the coverslip). Alter the incident angle of the laser beam until signals disappear then slowly increase angle until the point where fluorescence at the cell surface reappears (Movie 2). Adjust z-focus again for optimal position at the surface. Acceptable TIRF angles create no blurred halo at the edge of the cell (Fig. 1C). If significant photo bleaching occurs during setup, save the TIRF angle and move to an unbleached stage position before starting acquisition.\nAdjust laser intensities and camera gain to maximize dynamic range (high signal to noise ratio without saturating pixels). Typically EMCCD cameras are optimal to detect very low signals at high signal to noise ratios. For stronger signals regular CCD cameras produce less noise and offer a wider dynamic range.\nTIRF microscopy is very sensitive to small height differences of the coverslip, resulting in only few cells, which can be imaged at the same time (Fig. 1D). For small cells the acquisition region (region of interest, ROI) can therefore often be reduced to a subregion containing the object of choice. This also reduces the time needed to transfer data from the chip to the hard drive, often the rate-limiting step at high frame rates.",
    "For double color TIRF experiments make sure to minimize bleed through of fluorophores. For RFP/GFP pairs use separate emission filters as RFP is weakly excited by 488 nm light (Fig. 2A). Most filters are not perfectly aligned with each other. Filter offset can be corrected by using fluorescent beads mixed in with cells. To achieve comparable penetration depth, adjust TIRF angles separately for each laser line. A typical workflow is illustrated in Fig. 2B.\nA critical parameter influencing image quality is laser alignment and a clean objective. To align the laser, first focus on the z-position used for TIRF imaging. Then remove the sample and clean the objective of all oil (residual oil will lead to diffraction of the laser light and speckles in the beam profile). Project the laser on the ceiling in TIRF mode and calibrate the 0° position such that the laser is in a straight line with the objective (use reference spot, always wear laser safety goggles and avoid all reflections in the beam path). Focus the laser spot to a minimal size. Our setup provides a moveable lens positioned between galvos and microscope to facilitate rapid calibration. After optimal adjustment, the laser profile should form a well define spot with roughly round shape. Perform calibration before every session to obtain optimal image quality.\n3. Representative Results",
    "Distribution of actin homologues and cell wall enzymes in Bacillus subtilis. We imaged cells expressing GFP fusions of the actin homologue Mbl or the transpeptidase PbpH by TIRF and regular epifluorescence. The penetration depth in TIRF is clearly reduced and limited to the surface facing the coverslip (Fig. 3A, B). The weakly expressed transpeptidase PbpH localizes to cortical patches that are hardly visible by epifluorescence but can be clearly distinguished by TIRF (Fig. 3B). The reduced penetration can be best observed for PbpHGFP signal at septa, which appear as lines in epifluorescence but as dots in TIRF (Fig. 3B, arrow).\nProtein domains in the yeast plasma membrane. Examples for network-like patterns formed by plasma membrane proteins in yeast are already given in Fig. 1C and 2. In addition to the improved contrast in TIRF that allows clear distinction of these network-like patterns, weak signals can sometimes be detected exclusively by TIRF microscopy. As example, we imaged a GFP fusion of the TORC2 complex component Bit61 from Saccharomyces cerevisiae. This protein is weakly expressed and forms small cortical patches with only few protein copies per patch9. In epifluorescence only few patches are visible above the strong background, while patches can be imaged with very good signal to noise ratio in TIRF (Fig. 3C). Therefore TIRF is particularly well suited to study weakly fluorescent structures and proteins at the cell surface.",
    "The high axial resolution provided by TIRF already reduces background fluorescence. Additional improvement of image contrast can be obtained through various image processing steps. A simple standard technique is local background equalization where a blurred image is subtracted from the original. Blurring can be performed with a variety of low pass filters including median or Gaussian filters (Fig. 3D). Local background subtraction removes noise and sharpens high intensity structures. However, this often comes at the price of a loss of fine structures and exaggerated amplification of high intensity regions (Fig. 3D, arrow). A superior procedure is 2D deconvolution, which can be performed with free or commercially available software packages such as ImageJ, Matlab or Huygens (Scientific Volume Imaging b.v.). TIRF images provide very good axial resolution and therefore a nearly two-dimensional point spread function (PSF). We experimentally determined this PSF by acquiring images of 40 nm fluorescent beads with the same settings that were used for the actual imaging (objective, camera, excitation and emission wave length) The experimental PSF was then used for deconvolution with a classical maximum likelihood algorithm in Huygens. Time lapse movies of GFPRas2 or of Fet3GFP and Pma1RFP (Movies 3 and 4) demonstrate the increase of contrast after deconvolution. In double color images it is critical to maximize contrast, to be able to quantify colocalization values (Movie 4).",
    "Analysis of protein turnover at the cell cortex. TIRF and FRAP offer a powerful combination for the study of dynamics of cortical proteins. However, to allow the efficient use of these techniques, rapid control of laser angles and positions is required. In TIRF, a wide field technique, the laser needs to be focused on the back focal plane and needs to follow a shallow incidence angle to achieve the desired reflection. In contrast, FRAP requires the laser to be focused directly on the sample and positioned with high spatial accuracy to allow bleaching of defined structures or regions. The setup from Till photonics we used in our experiments provides very fast and intuitive control over these parameters. Two galvanometer-controlled mirrors are used to adjust the FRAP position in x,y or to set the incidence angle in TIRF. A third mirror is used to switch between separate beam paths for TIRF and FRAP illumination (the laser is widened by additional lenses in the TIRF path). All settings are controlled by the LA (live acquisition) software and calibrations can be rapidly performed for each experiment to achieve optimal conditions. This software also allows definition of bleach positions during image acquisition, which is essential for FRAP experiments on motile structures.",
    "Using this feature we could exclude treadmilling of Mbl filaments as source for the observed motility of Mbl-containing patches (Fig. 3E). This observation motivated our search for alternative motility mechanisms, and finally resulted in our identification of a completely unexpected type of motility, where intracellular protein complexes (including Mbl) are moved through the activity of cell wall synthesizing enzymes residing on the outside of the cell4. In a similar fashion, we were able to observe the slow rearrangements of yeast plasma membrane proteins, which distribute into network-like domains covering the whole cell surface (Fig. 3F).\nThese examples illustrate how the dynamics and patterning of cortical proteins can be directly assessed by combining TIRF and FRAP techniques.\n4. Representative Results\nimgsrc://cloudfront.jove.com/files/ftp_upload/3982/3982fig1.jpg\nFigure 1. Adjusting parameters. A. Dirty vs. cleaned coverslip.  Background signal arising from dust on the coverslip interfere with a potential  GFP/RFP signal, cleaned coverslip has less background. B. Custom-made electrical heating controller showing set  temperature (a), temperature at probe (b) and sample holder (c). C. Yeast protein Pma1GFP imaged with decreasing  incidence angles (from top left to bottom right). Images show a sudden loss of  signal at the critical angle and progressive decrease in structural information  and signal to noise ratio. D. Uneven  field of view. A dense suspension of fluorescent beads is imaged, showing that only  part of the field of view is in focus. Scale bars in A, B: 2 μm, in C: 10 μm.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3982/3982fig2.jpg",
    "Figure 2. Double color imaging. A. Bleed through of Pil1RFP. Pil1RFP is excited with 488  nm and a 561 nm laser and fluorescence is recorded with a double band pass  filter. Signal of Pil1RFP is weakly visible in the GFP channel. Scale bar 2 μm B. Typical steps to avoid bleed through  in double color imaging. After imaging the cells with separate filter sets,  they are deconvolved and aligned (using fluorescent beads) before being merged  for analysis.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3982/3982fig3.jpg\nFigure 3. Representative  Results. A. Comparison of GFPMbl distribution in B. subtilis using TIRF or regular epifluorescence (Epi) microscopy.  Blue: Cell boundary from bright field image. Images represent average  projections of a time series to indicate the area covered by motile MreB  patches monitored with different imaging modes. B. Improved axial resolution and contrast of TIRF images taken of  the transpeptidase PbpHGFP in B.  subtilis. Arrows indicate septal staining that appears as ring in  epifluorescence and as patches in TIRF. Exposure time: 100 ms. C. Comparison between epifluorescence  and TIRF illumination of the TOR complex component Bit61 in S. cerevisiae. Bit61 is very weakly  expressed9.  Exposure time: 250 ms. D. Comparison  of different image processing methods. Series showing raw TIRF image of  Pma1GFP, subtraction of Gaussian or Median  blurred images, as well as deconvolution using the maximum likelihood algorithm  in Huygens. E. TIRF-FRAP of a single  GFPMbl patch (above asterisk) moving across a B. subtilis cell. The kymograph of the non-recovering patch and the  intensity profile along the kymograph (dotted line) rule out treadmilling as  source of motion. F. TIRF-FRAP of a  yeast cell expressing Pma1GFP. Note the diffusive closing of the gap in the  cortical staining pattern. Scale bars: 2 μm. Time in seconds.",
    "Movie 1. Movie showing B. subtilis cells  expressing an RFP fusion protein on a dirty coverslip. Note that RFP signal is hardly  distinguishable from background noise. Cycle time 100 ms. Click here to view movie[href=http://www.jove.com/files/ftp_upload/3982/3982_Movie1.mp4].\nMovie 2. Movie of Pma1GFP with different incidence angles. Angle is altered from  subcritical to critical angle, until signal is lost. Note, at subcritical angle  internal signal is visible, causing noisy images until at critical angle just  the protein at the PM is visible. Cycle time 200 ms. Scale bar: 2 μm. Click here to view movie[href=http://www.jove.com/files/ftp_upload/3982/3982_Movie2.mov].\nMovie 3. Movie of yeast GFPRas2, showing alternating RAW and deconvolved TIRF images. GFPRas2  is a fast moving protein (T1/2 of 2s unpublished data), fast acquisition times  are important to resolve the dynamic behavior. Cycle time 150 ms. Scale bar: 2 μm. Click here to view movie[href=http://www.jove.com/files/ftp_upload/3982/3982_Movie3.mov].\nMovie 4. Double color movie of yeast proteins Fet3GFP and Pma1RFP. First 10 frames  represent RAW images and last frames are deconvolved. This movie shows the  importance of image processing for colocalization analysis. The blurry RAW  images become sharpened, making an analysis possible. Cycle time 5 s. Scale bar:  2 μm. Click here to view movie[href=http://www.jove.com/files/ftp_upload/3982/3982_Movie4.mov].Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}