{
  "id": 3173,
  "origin_website": "Cell",
  "title": "Derivation of trophoblast stem cells from human expanded potential stem cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThawing SNL feeder cells\nTiming: 2 days\nThe quality and confluency of SNL feeder cells are keys to culturing hEPSCs. The suitable confluency of SNL feeder cells for one 6-well of a Corning 6-well plate is around 2–3 × 105. SNL feeder cells should be plated at least two days before hEPSCs subculture or recovery. The plated SNL feeder cells can be used within two weeks by refreshing the medium at 2–3 days intervals.\nCoat a 6-well plate with 0.2% gelatin at 37°C for at least 1 h.\nThaw a vial of SNL feeder cells.\nRetrieve a vial of SNL feeder cells from liquid nitrogen and transfer it to a 37°C water bath immediately for about 1 min and gently shake until no visible small ice pieces.\nOptional: Alternatively, cells could be thawed by an appropriate program of ThawSTAR® (BioLife Solutions, AST-600).\nSterilize the vial of SNL feeder cells by wiping it with 70% ethanol.\nAdd 1 mL of M10 into the vial drop by drop and mix it by gentle pipetting (3 times).\nTransfer the cell suspension to a 15-mL conical tube.\nCentrifuge the cells at 300 × g for 3 min.\nDiscard the supernatant and resuspend the cells in 1 mL of M10 medium.\nCount cells using the Countess™ 3 Automated Cell Counter (Invitrogen, AMQAX2000).\nPrepare a 1.5-mL Eppendorf tube with 10 μL 0.4% Trypan blue.\nTransfer 10 μL of the cell suspension to the 1.5-mL Eppendorf tube and gently pipet it up and down (3 times).\nTransfer 10 μL of the mixture to a cell counting chamber slide (Invitrogen, C10312)\nFollow the instruction of the cell counter to conduct cell counting.\nNote: Manual counting is possible, but we recommend using an automatic cell counter to reduce human error.",
    "Seed the SNL feeder cell suspension (2 × 105 cells) in a 6-well plate and culture it at 37°C in a 5% CO2 incubator.\nRefresh the M10 medium every two days to maintain the SNL feeder cells (See troubleshooting[href=https://www.wicell.org#troubleshooting] problem 1).\nAfter 48 h, SNL feeder cells are ready to use (See troubleshooting[href=https://www.wicell.org#troubleshooting] problem 2).\nNote: During the preparation of SNL feeder cells, observe their morphologies at 24 and 48 h post-plating (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2747-Fig1.jpg\nFigure 1. Morphology of SNL feeder cells\nSNL feeder cells attach readily and become more spread at 24- and 48-h post-plating, respectively. Scale bar: 200 μm.\nThawing hEPSCs\nTiming: 4–5 days\nThis section describes a standard procedure of thawing hEPSCs.\nPrepare a 15-mL conical tube and a 6-well plate with SNL feeder cells.\nPrepare at least 5 mL of M10 medium and 3 mL of hEPSC medium at 20–22°C.\nAdd 5 mL fresh M10 medium into the 15-mL conical tube.\nAspirate the M10 medium from the SNL feeder plate and add 1 mL of hEPSC medium containing 10 μM Y27632.\nNote: The recommended stock concentration of Y27632 for hEPSCs culture is 10 mM and it needs to be stored at -20°C for up to 1 month. Y27632 is aliquoted to avoid repeated freeze-thawing.\nThawing frozen hEPSCs.\nTake a vial of frozen hEPSCs from the liquid nitrogen.\nTransfer it to a 37°C water bath with gentle shaking until thawed.\nOptional: Thaw it by using ThawSTAR.\nSterilize the EPSC vial by wiping it with 70% ethanol.\nTransfer 1 mL of M10 medium drop by drop into the vial and resuspend cells by gentle pipetting (3 times).\nTransfer the cell suspension into the 15-mL conical tube containing M10 medium.\nCentrifuge the cells at 300 × g for 3 min.",
    "Aspirate the supernatant and resuspend the cells with 2 mL of hEPSC medium containing 10 μM Y27632.\nTransfer the 2 mL of cell suspension into the prepared 6-well plate well.\nCulture hEPSCs at 37°C in a 5% CO2 incubator.\nAfter 24 h of seeding hEPSCs, refresh the cells with hEPSC medium but without Y27632 (See troubleshooting[href=https://www.wicell.org#troubleshooting] problem 3).\nNote: For the maintenance of hEPSCs, refresh the medium every day. Y27632 is not required from the day after seeding.\nCritical: The quality of SNL feeder cells and the correct cryopreservation of hEPSCs are keys to hEPSC culture.\nSubculture of hEPSCs\nTiming: 4–5 days\nThis section describes passaging hEPSCs and the technical details following TSC differentiation. When cells reach 70–80% confluency (it usually takes 4–5 days) subculture is required.\nPrepare at least 1 mL M10 medium, 0.5 mL 0.05% Trypsin-EDTA, 3 mL hEPSC medium and a 6-well plate with SNL feeder cells.\nObserve the hEPSCs under a microscope. When cell confluency reaches 70–80%, perform cell passaging (See troubleshooting[href=https://www.wicell.org#troubleshooting] problem 4).\nDigest the hEPSCs using 0.05% Trypsin-EDTA solution.\nRemove the supernatant and rinse the hEPSCs with 1 mL DPBS.\nAspirate the DPBS and trypsinize the cells using 0.5 mL 0.05% Trypsin-EDTA.\nIncubate for 2–3 min at 37°C in an incubator.\nObserve cells under microscope after 2–3 min. Perform neutralization when cells become round in morphology.\nNote: For robust passage and expansion, hEPSC colonies should be digested into single cells or at least small aggregations (2–3 cells).\nNeutralize the Trypsin-EDTA by using 1 mL M10 medium.\nPrepare a 15-mL conical tube.\nAdd 1 mL M10 medium into the suspension of cells and Trypsin-EDTA.\nDissociate the cells by pipetting up and down 3–4 times gently.\nTransfer the cell suspension to the 15-mL conical tube.\nExamine under microscope to ensure single cell suspection.",
    "Centrifuge the cells at 300 × g for 3 min.\nPassage hEPSCs (1 × 105 cells/well) into a new SNL feeder well.\nRemove the M10 medium from a new SNL feeder well.\nAdd 1.9 mL of hEPSC medium containing 10 μM Y27632.\nDiscard the supernatant carefully from the 15-mL conical tube and resuspend cells with 800 μL hEPSC medium containing 10 μM Y27632.\nTransfer 100 μL of the cell suspension to the well with 1.9 mL of hEPSC medium.\nCulture hEPSCs at 37°C in a 5% CO2 incubator.\nNext day, refresh the culture using hEPSC medium without Y27632.\nFor maintenance of hEPSCs, refresh the hEPSC medium every day (See troubleshooting[href=https://www.wicell.org#troubleshooting] problem 5).\nCritical: If hEPSCs are needed for downstream experiments, we recommend that cells are passaged at least 1 time after recovery. For the maintenance of hEPSCs, it is recommended to observe their cell morphologies daily (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2747-Fig2.jpg\nFigure 2. The morphologies of hEPSCs on days 0, 2, 3, and 4 post-passage\nScale bar: 200 μm.\nDifferentiation of hEPSCs into trophoblast stem cells (EPSC-TSCs)\nTiming: 10 days\nThis section describes the early steps of deriving trophoblast stem cells (TSCs) from hEPSCs (Figure 3[href=https://www.wicell.org#fig3]A). The quality of EPSC-TSC colonies depends on the well-maintained hEPSCs. When cell confluency reaches 80–90%, perform TSC differentiation.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2747-Fig3.jpg\nFigure 3. Differentiation of hEPSCs into hTSCs and its assessment in vitro\n(A) The procedure of hTSC lines derivation from hEPSCs with representative cell morphologies at the respective stages. Scale bar: 50 μm and 200 μm as indicated.",
    "(B) RT-qPCR quantification of expression levels for pluripotency markers (OCT4 and NANOG) and hTSC markers (KRT7, ELF5, GATA2, TP63, GATA3, TFAP2A, TFAP2C) in hEPSCs and EPSC-TSCs. Gene expression levels were normalized to GAPDH using the ΔΔCt method. Datapoints represent the mean and error bars show the SD of data from three independent experiments. ∗p < 0.05, ∗∗p < 0.01, ∗∗∗p < 0.001 (two-tailed unpaired Student’s t-test).\n(C) Representative immunofluorescence staining images for pluripotency markers (NANOG, OCT4 and SSEA3) in hEPSCs (left) and trophoblast markers (GATA2, KRT7 and KRT18) in EPSC-TSCs (right), respectively. Scale bar: 20 μm and 100 μm as indicated.\nPrepare at least 1 mL M10 medium, 1 mL of 0.05% Trypsin-EDTA and 3 mL human TSC medium.\nRemove the SNL feeder cells (See troubleshooting[href=https://www.wicell.org#troubleshooting] problem 6).\nPrepare a 15-mL conical tube.\nAspirate the supernatant of hEPSCs and rinse the cells with 1 mL DPBS once.\nAspirate the DPBS and trypsinize the cells using 0.5 mL 0.05% Trypsin-EDTA.\nIncubate for 1.5–2.5 min at 37°C in an incubator.\nCheck cells under microscope.\nTap the plate gently to detach the SNL feeder cells.\nAspirate the 0.05% Trypsin-EDTA with feeder cells and discard them.\nAdd 1 mL of M10 medium to neutralize the trypsin and dissociate the cells by pipetting up and down gently.\nNote: The required duration of trypsinization depends on the cell confluency and status. If hEPSCs are not fully trypsinized after removing the feeder cells, add 0.5 mL 0.05% Trypsin-EDTA and incubate at 37°C for 1 min followed by step h.\nCritical: When cell confluency reaches 80%–90%, there are only a few SNL feeder cells between the hEPSC clonies, and the feeder cells can be easily removed by 1.5–2.5 min digestion.\nTransfer the cell suspension to the 15-mL conical tube.",
    "Centrifuge the cells at 300 × g for 3 min.\nRemove the supernatant carefully and resuspend the cells in 1 mL human TSC medium.\nOptional: Feeder cells impair the subsequent EPSC-TSC colony picking. To further remove the feeder cells, perform hEPSCs purification as follows. Prepare a 50-mL conical tube equipped with a 40 μm sterile cell strainer (Fisherbrand™, 22-363-547) and filter the cell suspension with the strainer. Proceed to the following steps.\nPrepare a 6-well plate coated with 1% Matrigel solution.\nPrepare a 6-well plate and coat a 6-well with the 1% Matrigel solution.\nIncubate at 37°C for at least 1 h.\nPerform cell counting using the cell counter.\nPrepare a 1.5-mL Eppendorf tube with 10 μL 0.4% Trypan blue.\nTransfer 10 μL cell suspension prepared in step 33 to the 1.5-mL Eppendorf tube and gently pipet it up and down (3 times).\nTransfer 10 μL mixture to a cell counting chamber slide.\nFollow the instruction of the cell counter to conduct cell counting.\nAspirate 1% Matrigel solution and add 2 mL human TSC medium to the coated 6-well.\nSeed the hEPSCs suspension (3 × 103 cells) in the 6-well (around 300 cells/cm2) coated by 1% Matrigel (See troubleshooting[href=https://www.wicell.org#troubleshooting] problem 7).\nCulture the cells at 37°C in a 5% CO2 incubator.\nRefresh the human TSC medium every two days.\nOptional: For higher efficiency, use human TSC medium without CHIR99021 induction hEPSCs at first 3 days.\nThe establishment of EPSC-TSC stable cell line\nTiming: 4–8 weeks",
    "The section illustrates a general procedure for establishing stable EPSC-TSC lines after TSC differentiation. The hEPSC colonies will differentiate into TSCs during the 10-day culture. Usually, on day 10, the size and density of EPSC-TSC colonies are ready for colony picking. Not every EPSC could finally differentiate into the EPSC-TSC. There appears to be some over-differentiated cells (not colony-like) around EPSC-TSC (cobblestone-shaped colonies), which can be easily identified by their morphologies.\nWhen the size of EPSC-TSC colonies is suitable for passage, perform human EPSC-TSC colony picking.\nNote: Usually, 24 colonies are picked and roughly half of the colonies can survive and be expanded.\nPrepare a 96-Well Round-Bottom Microplate (Corning, 38018) and a 48-well plate.\nAdd 10 μL of TrypLE in each 96-well.\nCoat the 48-well plate with 100 μL 1% Matrigel solution for at least 1 h in a 37°C incubator.\nPick colonies with TSC-like morphologies into the 96-wells with TrypLE.\nIncubate the 96-well plate at 37°C for 2–3 min for digestion.\nAspirate Matrigel from the 48-well plate.\nAdd 200 μL human TSC medium for each well in the 48-well plate.\nPipet the EPSC-TSC suspension up and down gently 3 times and transfer all cell suspension to the prepared 48-well plate.\nOptional: Pick the colonies with TSC-like morphologies and transfer the colonies directly to the prepared 48-well plate without TrypLE digestion.\nFor maintenance of human EPSC-TSCs, refresh the medium every two days.\nOn day 10, perform human EPSC-TSC passage from the 48-well plate to a 24-well plate at a passage ratio of 1:1 (See troubleshooting[href=https://www.wicell.org#troubleshooting] problem 8).\nPrepare a 24-well plate coated with at least 200 μL fresh 1% Matrigel solution for at least 1 h in a 37°C incubator.\nPrepare human TSC medium, M10 medium and TrypLE at 20–22°C.",
    "Discard the supernatant of human EPSC-TSCs and rinse the cells with 100 μL DPBS once.\nAspirate the DPBS and digest the cells using 100 μL of TrypLE.\nIncubate in a 37°C incubator for 5–10 min.\nNote: If human EPSC-TSC colonies cannot detach after incubation, pipet up and down several times to produce a cell suspension and incubate for 5 more min. If any colonies still do not detach, it is recommended to discard them.\nResuspend human EPSC-TSCs by pipetting up and down and transferring the cell suspension into a new 1.5-mL Eppendorf tube.\nNeutralize the TrypLE by adding 500 μL M10 medium into the 1.5-mL Eppendorf tube.\nCentrifuge the cells at 300 × g for 3 min.\nDiscard the supernatant and resuspend human EPSC-TSCs with 500 μL of human TSC medium.\nRemove the Matrigel from the 24-well plate and transfer the human EPSC-TSCs suspension into the 24-wells with a passage ratio of 1:1.\nIncubate in a 37°C incubator with 5% CO2.\nFor maintenance of the passaged human EPSC-TSCs, refresh the medium every two days.\nNote: In the first 5 days, human EPSC-TSC colonies grow slowly. Some picked colonies will differentiate or stop growing during the 10-day culture. Select colonies with TSC-like morphologies and further perform cell passaging.\nObserve the human EPSC-TSCs periodically and perform passage when the cell confluency reaches 70%-80%.\nPassage of the human EPSC-TSCs into a 12-well plate.\nPrepared a new 12-well plate coated with 500 μL fresh 1% Matrigel solution for at least 1 h in a 37°C incubator.\nPrepare 1 mL of human TSC medium for each 12-well, 200 μL TrypLE for digesting human EPSC-TSCs in one 24-well and 500 μL M10 medium for TrypLE neutralization.\nCentrifuge the cells at 300 × g for 3 min.",
    "Discard the supernatant and resuspend human EPSC-TSCs with 1 mL of human TSC medium.\nRemove the Matrigel from the 12-well plate and transfer the human EPSC-TSCs suspension into the 12-wells with a passage ratio of 1:1.\nIncubate in a 37°C incubator with 5% CO2.\nFor maintenance of the passaged human EPSC-TSCs, refresh the medium every two days.\nPassage of the human TSCs into a 6-well plate.\nPrepared a new 6-well plate coated with 1000 μL fresh 1% Matrigel solution for at least 1 h in a 37°C incubator.\nPrepare 2 mL of human TSC medium for each 6-well, 500 μL of TrypLE for digesting human EPSC-TSCs in one 12-well and 1000 μL of M10 medium for TrypLE neutralization.\nCentrifuge the cells at 300 × g for 3 min.\nDiscard the supernatant and resuspend human EPSC-TSCs with 2 mL of human TSC medium.\nRemove the Matrigel from the 6-well plate and transfer the human EPSC-TSCs suspension into the 6-wells with a passage ratio of 1:1.\nIncubate in a 37°C incubator with 5% CO2.\nFor maintenance of the passaged human EPSC-TSCs, refresh the medium every two days.\nCritical: Only a small part of hEPSC will differentiate into TSC eventually. When the human EPSC-TSC colonies are too confluent or merged, the purity of the EPSC-TSC cell line may be affected.\nSerial passage and cryopreservation of human EPSC-TSC cell line\nTiming: 4–5 days",
    "The standard passage protocol and correct cryopreservation of the human EPSC-TSC lines are critical for the success of subsequent experiments. This section describes the instruction of the human EPSC-TSC line serial passage and its cryopreservation. When human EPSC-TSCs have expanded into at least two wells of a 6-well plate and reached 70–80% cell confluency, perform serial passaging, and cryo-freeze one 6-well for storage. EPSC-TSCs need to be passaged at a ratio of 1:8. Ususlly, it takes 3–4 days until the next passage. EPSC-TSCs retain their cobblestone-shaped morphologies and differentiation potential after 80 passages.\nPrepare M10 medium, human TSC medium and TrypLE at 20–22°C.\nPrepare a new 6-well plate coated with 1 mL fresh 1% Matrigel solution for at least 1 h in a 37°C incubator.\nDigest human EPSC-TSCs in a 6-well (See troubleshooting[href=https://www.wicell.org#troubleshooting] problem 9).\nAspirate supernatant of the human EPSC-TSC culture.\nAdd at least 1 mL DPBS for rinsing once and aspirate the DPBS.\nDigest EPSC-TSCs with 1 mL of TrypLE and incubate cells at 37°C for 2 min.\nRinse the cells with TrypLE two times and have another 3 min incubation.\nPrepare a 15-mL conical tube.\nDissociate cells by pipetting up and down. Transfer cell suspension into the 15-mL conical tube.\nAdd 1 mL of M10 medium into the 6-well to neutralize and wash the cells remaining in the plate.\nTransfer all the medium to the 15-mL conical tube.\nCentrifuge cells at 300 × g for 3 min.\nDiscard supernatant and resuspend cells in 800 μL of human TSC medium.\nAdd 1.9 mL human TSC medium to the 6-well plate coated by Matrigel.\nTransfer 100 μL cell suspension to the well.\nNote: The ideal cell dilution factor for passage is 5∼8-fold.\nIncubate in a 37°C incubator with 5% CO2.\nRefresh medium after 24 h of passage.",
    "For maintenance of EPSC-TSCs, refresh medium every two days.\nHarvest cells following steps 47-48.\nPrepare 3 mL of 10% DMSO 90% FBS cell freezing solution.\nNote: Cells in one 6-well are typically frozen in 3 vials (1.5–2.0 × 105 cells/vial) for cryopreservation.\nAspirate the supernatant and resuspend the cells with 3 mL cell freezing solution.\nAliquot 1mL cell suspension into each of the three vials.\nFreeze the vials at -80°C using a Mr. Frosty (Thermo Scientific™, 5100-0001) and transfer them into liquid nitrogen after 24 h.\nIdentification of EPSC-TSC cell line\nTiming: 3–4 days\nThis section describes the assessment of EPSC-TSCs by checking the expression of hTSC marker genes KRT7, KRT18, GATA2, ELF5 and TP63. Immunofluorescence staining is conducted to detect KRT7, KRT18, GATA2 and the absence of markers NANOG, OCT4 and SSEA3 (Figures 3[href=https://www.wicell.org#fig3]B and 3C). EPSC-TSCs can be continuously cultured with consistent differentiation efficiencies over passages.\nPrepare M10 medium, human TSC medium and TrypLE at 20–22°C.\nPrepare a 6-well plate coated with fresh 1% Matrigel solution for at least 1 h in a 37°C incubator.\nHarvest cells following steps 47-48.\nCount the number of live EPSC-TSCs.\nTransfer cell suspension (2 × 105 cells) into a Matrigel-coated 6-well with 2 mL of human TSC medium.\nIncubate in a 37°C incubator with 5% CO2.\nRefresh the TSC medium after the first 24 h of incubation and change the medium every two days for maintenance.\nOn day 2, harvest the human EPSC-TSCs and perform RT-qPCR experiments.\nUse the remaining cells from step 62 for immunofluorescence staining.\nDifferentiation of EPSC-TSC into STB\nTiming: 6 days",
    "This section describes STB differentiation from EPSC-TSCs (Figures 4[href=https://www.wicell.org#fig4]A and 4B) and the assessment. The identification of EPSC-STB cells can be used as a criterion for a newly established hTSC line. EPSC-STBs expressed CGB, CSH1/2, OVOL1, SDC1 and HERVW which can be detected by immunofluorescence (Figure 4[href=https://www.wicell.org#fig4]C) and in RT-qPCR (Figure 4[href=https://www.wicell.org#fig4]D).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2747-Fig4.jpg\nFigure 4. Differentiation of hEPSC-derived hTSCs into EPSC-STBs and its assessment in vitro\n(A) The procedure of EPSC-STB differentiation from EPSC-TSCs.\n(B) Representative cell morphologies of EPSC-TSCs and STBs at differentiation day6. Scale bar: 100 μm.\n(C) Representative immunofluorescence staining images for STB marker (CGB) and ZO-1 in EPSC-STBs (top) and EPSC-TSCs (bottom), respectively. Scale bar: 50 μm and 100 μm.\n(D) RT-qPCR quantification of expression levels for STB markers (CSH1/2, OVOL1, CGB, HERVW and SDC1) in EPSC-STBs and EPSC-TSCs. Gene expression levels were normalized to GAPDH using the ΔΔCt method. Datapoints represent the mean and error bars show the SD of data from three independent experiments. ∗∗∗p < 0.001 (two-tailed unpaired Student’s t-test).\nPrepare human STB medium, M10, TrypLE at 20–22°C.\nHarvest EPSC-TSCs following steps 47-48.\nCount live TSCs using a cell counter.\nSeed 200,000 cells into one 1% Matrigel-coated 6-well with 3 mL human STB medium.\nRefresh human STB medium every three days for maintenance.\nOn day 6, EPSC-STBs are ready for assessment.\nHarvest cells to perform RT-qPCR.\nPrepare samples for immunofluorescence experiment.\nPrepare a μ-Slide 8 Well ibiTreat.\nCoat 4 wells with 1% Matrigel for 1 h in a 37°C incubator.\nSeed suspension of EPSC-TSCs (2.5 × 104 cells) into each well individually with 300 μL human STB medium.\nRefresh human STB medium on day 3.\nOn the day 6, perform immunofluorescence staining experiment following step 116.\nDifferentiation of EPSC-TSC into EVT\nTiming: 8 days",
    "This section describes differentiation of human EVT from hEPSC-derived hTSCs (Figure 5[href=https://www.wicell.org#fig5]A) and the assessment. The differentiation to EPSC-EVT includes three major time points and the cells will be ready for marker gene (HLA-G, ITGA1, ITGA5, MMP2) detection on day 8 using RT-qPCR (Figure 5[href=https://www.wicell.org#fig5]B), flow cytometry (Figure 5[href=https://www.wicell.org#fig5]C), and immunofluorescence (Figure 5[href=https://www.wicell.org#fig5]D).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2747-Fig5.jpg\nFigure 5. Differentiation of hEPSC-derived hTSCs into EVTs and its assessment in vitro\n(A) The procedure of human EVT differentiation from hEPSC-derived hTSC lines with representative cell morphologies at the respective stages. Scale bar: 100 μm and 200 μm.\n(B) RT-qPCR quantification of expression levels for EVT markers (HLA-G, ITGA5, MMP2, ITGA1) in EPSC-TSCs and EPSC-EVTs. Gene expression levels were normalized to GAPDH using the ΔΔCt method. Datapoints represent the mean and error bars show the SD of data from three independent experiments.∗∗p < 0.01, ∗∗∗p < 0.001 (two-tailed unpaired Student’s t-test).\n(C) Flow cytometric quantification of HLA-G expression in EPSC-EVTs, unstained EPSC-EVTs as the control group.\n(D) Representative immunofluorescence staining images for GATA3 and EVT markers (HLA-G, ITGA5) in EPSC-EVTs (right) compared with EPSC-TSCs (left), respectively. Scale bar: 40 μm and 100 μm.\nPrepare the EVT basal medium at 20–22°C and prepare two 6-wells coated with 1% Matrigel.\nNote: We recommend preparing the human EVT basal, which could be stored at 4°C for 1 month. Other ingredients should be added freshly to this basal medium before use.\nHarvest EPSC-TSCs following steps 47-48.\nResuspend cells with 1 mL human EVT basal.\nCount live TSCs using a cell counter.\nTransfer 200,000 cells into two Matrigel-coated wells, respectively.\nAdd 3 mL human EVT basal for each well.\nAdd NRG-1 to a final concentration of 100 ng/mL, 2% Matrigel Matrix and 4% KSR.\nOn day 3, refresh medium using human EVT basal with 4% KSR and 0.5% Matrigel Matrix.",
    "On day 6, dissociate cells with TrypLE for 15 min at 37°C and passage to a new Matrigel-coated well at a ratio of 1:2.\nNote: For immunofluorescence staining, passage the cells at the ratio of 1:16 to a Matrigel-coated μ-Slide 8 Well ibiTreat and follow step 116 on day 8.\nAdd 3 mL human EVT medium with 0.5% Matrigel Matrix.\nEPSC-EVTs will be ready for the following assessment on day 8.\nHarvest one or two wells of cells to perform RT-qPCR.\nHarvest one or two wells of cells to perform flow cytometry.\nFlow cytometry of human EVTs\nTiming: 1–2 days\nThis section describes a protocol of flow cytometry on human EVTs including cell fixation and its staining.\nDiscard supernatant carefully using suction.\nWash cells with 1 mL DPBS once.\nCentrifuge at 300 × g for 3 min.\nDiscard the supernatant.\nFix cells with 500 μL 0.5% PFA for 15 min at 20–22°C.\nCentrifuge at 300 × g for 3 min and aspirate supernatant.\nAdd 500 μL blocking buffer and incubate cells for 1 h at 20–22°C.\nPause point: Cells can be stored at 4°C in the blocking buffer for 8–12 h until performing flow cytometry.\nCentrifuge at 300 × g for 3 min and aspirate supernatant.\nIncubate cells on ice with antibodies diluted in 100 μL of DPBS at a ratio of 1:100 for 30 min.\nWash cells with 1 mL DPBS twice.\nCentrifuge at 300 × g for 5 min.\nResuspend cells with 100 μL DPBS and transfer cell suspension to a 5 mL Polystyrene Round-Bottom Tube (FALCON, 352052).\nConduct flow cytometry experiments.\nRT-qPCR of human EPSC-TSCs, STBs and EVTs\nTiming: 1–2 days",
    "For RT-qPCR analysis, we recommend at least triplicating and randomizing samples in qPCR plates to reduce technical variations. In addition, RNase-free water is required for this step.\nWash the cell pellet twice with DPBS in a 1.5-mL Eppendorf tube.\nAdd 500 μL TRIzol™ Reagent to lyse the cells and incubate for at least 3 min at 20–22°C.\nPause point: Samples in TRIzol™ Reagent can be stored at -80°C until RNA extraction is performed.\nExtract total RNA following TRIzol™ Reagent instructions (https://assets.thermofisher.com/TFS-Assets/LSG/manuals/trizol_reagent.pdf[href=https://assets.thermofisher.com/TFS-Assets/LSG/manuals/trizol_reagent.pdf]).\nOptional: Alternatively, extract total RNA using commercial RNA extraction kits following the manufacturer’s recommendations.\nMeasure RNA concentration using NanoDrop (ThermoFisher Scientific, A51119500C).\nUse 2 μg RNA for each sample to perform reverse transcription following the reaction master mix in the following table:\nNote: We recommend using PrimeScript RT Master Mix (Takara, RR036A) or equivalent commercial kits to conduct reverse transcription.\ntable:files/protocols_protocol_2747_8.csv\nSynthesize cDNA using the following program: 37°C for 15 min, 85°C for 5 s, and 4°C forever.\nAfter reverse transcription, dilute the cDNA samples ten-fold in 1.5-mL Eppendorf tubes.\nPerform qPCR using SYBR™ Green PCR Master Mix (Thermo Fisher Scientific, 4309155).\nPrepare primers for qPCR.\nNote: Commercial primers are powder-stored in 1.5-mL Eppendorf tubes. The stock concentration of the primer mix is 2.5 μM for qPCR.\nCentrifuge the primer powder at 12,000 × g for 15 s.\nDissolve the powder into 100 μM following the volume of ddH2O indicated on primer tubes.\nVortex and centrifuge the tubes at 3,000 × g for 15 s.\nIncubate the primer solutions at 20–22°C for 3 min.\nTransfer 10 μL 100 μM forward and reverse primers respectively into a 1.5-mL Eppendorf tubes containing 380 μL ddH2O. The final concentration of each primer is 2.5 μM in the primer mix for qPCR.",
    "Use 2 μL diluted cDNA for qPCR and prepare the reaction mix as per the following table. Perform qPCR as per the following program.\ntable:files/protocols_protocol_2747_9.csv\ntable:files/protocols_protocol_2747_10.csv\nImmunofluorescence staining of human EPSC-TSCs, STBs and EVTs\nTiming: 1–3 days\nThis section describes a general protocol for cell immunofluorescence staining. There are some tweaks to the details in the assessment of different cell lines, described in the corresponding sections.\nCoat four wells of a μ-Slide 8 Well ibiTreat (ibidi, 80826) with 300 μL of 1% Matrigel solution for at least 1 h in a 37°C incubator.\nTransfer the cell suspension (2.5 × 104 cells/well) into four Matrigel-coated wells.\nRefresh the medium after 24 h.\nNote: Only human TSC medium is required to be refreshed. For the other types of cells, please follow the corresponding differentiation protocols.\nPerform the immunofluorescence staining experiment.\nAspirate cell culture medium and wash cells two times with DPBS.\nFix cells with 4% PFA solution and incubate for 15 min at 20–22°C.\nRinse the cells once with DPBS.\nAdd 300 μL permeabilization buffer for each well and incubate cells for 15 min at 20–22°C.\nIncubate with 300 μL blocking buffer for at least 1 h at 20–22°C.\nPause point: Cells can be stored at 4°C for 8–12 h or longer in the blocking buffer.\nIncubate with primary antibodies diluted in 150 μL blocking buffer at a ratio of 1:100 for 8–12 h at 4°C.\nWash the cells five times with 300 μL DPBS.\nIncubate the cells with 1× DAPI and secondary antibodies diluted in 150 μL blocking buffer at a ratio of 1:1000 for 30 min at 20–22°C in dark.\nWash the cells five times with 300 μL DPBS.\nImage for fluorescent signals using a confocal microscope."
  ],
  "subjectAreas": [
    "Cell Differentiation",
    "Cell Biology",
    "Stem Cells",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}