{
  "id": 19195,
  "origin_website": "Jove",
  "title": "X-ray Dose Reduction through Adaptive Exposure in Fluoroscopic Imaging",
  "procedures": [
    "1. System setup\nSet up the phantom to image at isocenter (i.e. 40-cm from the collimator).\nSet up the DAP Meter to measure X-ray dose in front of the collimator (Figure 4).\nPower on the SBDX system.\nSelect the system operating mode. We are currently using a 7\" field of view (FOV) with a frame rate of 15fps. The X-ray source peak voltage is set to 80kVp at 9kW X-ray source power. \n2. Data acquisition\nStart data acquisition from the control computer. During data acquisition, detector images are saved into the system memory. The following steps take place in the SBDX system:\n  \nThe electron beam scans each focal spot position sequentially in a raster fashion (Figure 5).\nThe electron beam hits the transmission target and generates X-rays (Movie 2).\nAt each focal spot position, X-ray photons illuminate the detector using a focusing collimator, thus projecting a small portion of the imaging volume onto the detector.\nFor each focal spot position, the detector creates one detector image, which is directly stored in the system memory. \nThe selected operation mode of 7’’ 15fps provides 71x71 focal spots. Each focal spot position is illuminated for a total of 8 μs. The exposure time must be broken up into 1 μs increments because of the thermal limitations of the X-ray target. Thus, the beam illuminates the target at each focal spot position for 1 μs and moves to the next focal spot position. At a later time, each focal spot is revisited to complete the 8 μs exposure. As one detector image is created for each focal spot illumination, there are a total of 40328 detector images that are acquired and stored into memory in about 60ms. \n3. Image reconstruction",
    "The SBDX is intrinsically a tomosynthesis system, as the object is illuminated under different angles from the source. Any plane within the imaging volume located between collimator and detector can be reconstructed. The following steps illustrate how the partial images are reconstructed into individual planes, or into a composite or plane selected image. In the clinical SBDX system steps 3.2 to 3.4 will be performed in real-time.\nSelect the image reconstruction parameters on the reconstruction simulator. \nRun the image reconstruction algorithm. During image reconstruction the algorithm performs the following steps:\n  \nRead each individual detector image.\nScale the detector images to match the scale of the plane to reconstruct.\nShift the images according to their focal spot source location and add them to the reconstruction plane (Movie 3).\nRepeat the last two steps for each focal spot location.\nPerform post processing filtering to remove the pattern created by the shift operation.\nAt this point, one plane is reconstructed (Figure 6), and the anatomy of our object is visible. \nIf requested, run the algorithm to create a plane selected image. The algorithm performs the following steps:\n  \nPoint 3.2.1 to 3.2.6 are repeated to create the 32 planes necessary for the plane selected image. The planes usually have a spacing of 0.5-mm (Movie 4, Figure 7 and Movie 5).\nFor each portion of the image, the plane that contains the object in focus is selected to be part of the final plane selected image (Figure 8 and Movie 6).\nIf necessary, reposition the phantom to place the heart in the center of the field of view.\nPerform step 2.1 to 3.3 until the phantom is correctly placed inside the field of view.\nRecord the dose area product from the DAP meter for this non-equalized image.",
    "4. New operation mode file generation for adaptive exposure\nLoad the previously acquired detector images into the adaptive exposure simulator.\nSelect the adaptive exposure algorithm parameters. \nRun the adaptive exposure simulator. The simulator performs the following steps: \n  \nThe target number of photons per detector image is determined based on the user selected threshold.\nFor each focal spot position, the number of photons in the detector image is determined. The detector images from that focal spot position are accumulated until either the target number of photons or the maximum of eight rescans is reached (Figure 9).\nAs a result we obtain a rescan map detailing how many times each focal spot position is illuminated (Figure 10).\nThe rescan map is merged with the operation mode file that is used to run the SBDX system.\n5. Equalized Image acquisition\nLoad the updated operation mode file into the SBDX system.\nStart data acquisition from the control computer. Data acquisition is performed as detailed in 2.1.1 to 2.1.5. In contrast to the previous acquisition, the X-ray beam is turned on or off at the focal spot positions according to our rescan map. As the total number of illuminations is smaller than in the standard acquisition, the X-ray dose is reduced. \nRecord the dose area product measured by the DAP meter.\nRun the image reconstruction algorithm on the newly acquired equalized data as detailed in 3.2 to 3.4.\nThe reconstructed equalized image (Figure 11) is displayed.\n6. Data analysis\nCompare the dose measured for the non-equalized images and the equalized images.\nObserve the difference between the equalized and non-equalized reconstructed images. \n7. Representative results:",
    "Figure 8 and Figure 11 show the comparison between a standard image and an equalized image. Dose measurements with the DAP meter demonstrate a dose saving of 30% in the equalized image using the rescan mask illustrated in Figure 10. \nIn addition, equalization is a very effective way to compress dynamic range, giving a more pleasant appearance of the image without the need for post-processing. \nAs shown, equalization filtration can be used to save dose. However, equalization can also be used to improve image quality by matching the radiation dose to the non-equalized image by increasing the source power. In this way, the dark regions of the image receive more photons, resulting in reduced image noise. \nimgsrc://cloudfront.jove.com/files/ftp_upload/3236/3236fig1.jpg\nFigure 1. Conventional fluoroscopy system. A conventional system has a single focal spot X-ray source and a large area detector. The patient is positioned close to the detector.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3236/3236fig2.jpg\nFigure 2. SBDX system. The SBDX system operates in inverse geometry. A large scanning beam X-ray source illuminates a small area detector. The patient is positioned far from the detector.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3236/3236fig3.jpg\nFigure 3. Flow chart of the data acquisition. 1) A non-equalized image of the phantom is acquired. 2) The data is extracted from the disk array. 3) The adaptive exposure algorithm takes this data as input to create an exposure or rescan mask. 4) The rescan mask is combined with the original operating mode in the source control computer. 5) An equalized image of the same phantom is acquired and stored into the disk array. 6) The non-equalized and equalized data sets are extracted from the disk array, and the image reconstruction software reconstructs the different planes of each data set. 7) Both images are the output of the reconstruction software. 8) Both images are displayed.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3236/3236fig4.jpg",
    "Figure 4. System setup. The phantom is placed on the patient table at isocenter between the X-ray source and the detector. A dose area product meter is placed between X-ray source and phantom.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3236/3236fig5.jpg\nFigure 5. X-ray source. An electron beam is generated by the electron gun and scans each hole of the collimator in a raster fashion. Starting from one side of the collimator, the beam scans each hole sequentially. At the end of the row, the beam is turned off and positioned at the beginning of the next row, and the scan is started for that row. This way the electron beam scans the entire collimator, 71 by 71 holes are scanned eight times in approximately 60ms.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3236/3236fig6.jpg\nFigure 6. Standard reconstructed image. Reconstructed image of our anthropomorphic phantom displaying the heart with iodinated coronary arteries. The image was taken at 7’’ FOV and 15fps, and a single plane at 45cm from the X-ray target was reconstructed.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3236/3236fig7.jpg\nFigure 7. Multi-plane reconstruction. Representation of the different reconstructed planes between the collimator and the detector. The blue cones illustrate how the detector images are backprojected into the reconstruction planes.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3236/3236fig8.jpg\nFigure 8. Plane selected image. This image is a composition of 32 planes. In contrast to Figure 6, where only the vessels on the selected plane are in focus, every vessel is in focus.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3236/3236fig9.jpg",
    "Figure 9. Equalization filtration steps. As the collimator is scanned (top), the detector receives a varying count rate depending on the opacity of the object (bottom). Each collimator hole is scanned up to eight times (eight rescans). On the first rescan, the focal spots are illuminated sequentially along the row, starting from the left, and the flux is measured for each hole. On the next rescan, the illumination is repeated starting at the beginning of the row. For each focal spot, the counts are added to the previous value. If the total number of counts exceeds a previously set threshold, this hole will not be illuminated on the following rescan. In the current implementation this process is performed offline and leads to the creation of a rescan mask that subsequently will be used to acquire an equalized image. \nimgsrc://cloudfront.jove.com/files/ftp_upload/3236/3236fig10.jpg\nFigure 10. Rescan map generated by the equalization filtration algorithm. Each pixel of this image represents one focal spot of the collimator. The image is therefore 71x71 pixels. The gray level of each pixel represents the number of rescan for that focal spot, from zero (black) to eight (white). We observe that on the right part of the image, the number of rescan is very low. As a result, each of these focal spots will be illuminated only once or twice. This region corresponds to the lung field area of our reconstructed image (Figure 6), where the image is almost saturated because of the low X-ray absorption of this area.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3236/3236fig11.jpg",
    "Figure 11. Plane selected equalized image. This image is the output of the reconstruction algorithm after adaptive exposure. This image has been acquired with the same operating mode 7\" 15fps as the standard image (Figure 8), but with adaptive exposure enabled based on the scan mask of Figure 10. The image is more uniform in terms of intensity, and consequently the vessels appear at higher contrast, especially in dark areas. On the right hand side of the image, there is no longer saturation in the lung field.\nMovie 1. Animation of the SBDX system. The SBDX system operates in inverse geometry. A large scanning beam X-ray source illuminates a small area detector. The patient is positioned far from the detector. Click here to view the movie.[href=http://www.jove.com/files/ftp_upload/3236/3236movie1.swf]\nMovie 2. X-ray generation. At each focal spot, the electron beam hits the tungsten target and X-rays are generated. The collimator focuses the X-ray beam toward the detector. Click here to view the movie.[href=http://www.jove.com/files/ftp_upload/3236/3236movie2.swf]\nMovie 3. Image reconstruction animation. This animation represents the process of reconstructing the final image using the detector images. For each focal spot of the collimator (bottom left), the corresponding detector image (upper left) is projected onto the plane to reconstruct (right). In this animation we represent three planes that are being reconstructed at different distances from the X-ray source. Click here to view the movie.[href=http://www.jove.com/files/ftp_upload/3236/3236movie3.avi]\nMovie 4. Plane selection. The SBDX system is a tomosynthesis imaging system. The plane to be reconstructed and visualized can be selected by the user. Click here to view the movie.[href=http://www.jove.com/files/ftp_upload/3236/3236movie4.swf]\nMovie 5. Multi-plane animation. This video shows the different planes reconstructed at increasing distance from the collimator. Notably, the iodinated coronary arteries go in and out of focus depending on their physical location. Click here to view the movie.[href=http://www.jove.com/files/ftp_upload/3236/3236movie5.avi]",
    "Movie 6. 3D plane selected animation. 3D visualization of the reconstructed focal planes. Focal planes are shifted more with increasing depth. Click here to view the movie.[href=http://www.jove.com/files/ftp_upload/3236/3236movie6.wmv]"
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}