{
  "id": 18851,
  "origin_website": "Jove",
  "title": "Acute Brain Trauma in Mice Followed By Longitudinal Two-photon Imaging",
  "procedures": [
    "All the procedures presented here were performed according to local guidance for animal care (The Finnish Act on Animal Experimentation 62/2006). Animal license (ESAVI/2857/04.10.03/2012) was obtained from local authority (ELÄINKOELAUTAKUNTA-ELLA). Adult mice of 1-3 months age, weight 24-38 g, were kept in individual cages in the certified University’s animal facility and provided with food and water ad libitum.\n1. Brain Injury Imaging Through a Cranial Window\nAnesthetizing animals and preparing the operation field\n\t\nAnesthetize mice by peritoneal injection of a mixture of ketamine (Ketalar, 80 mg/kg) and xylazine (Rompun, 10 mg/kg) dissolved in filter-sterilized phosphate buffer saline (PBS), pH 7.4. Check the mouse’s reflexes regularly (tail and toe pinch probe) to verify the depth of anesthesia. Increase the dose when appropriate, to maintain proper anesthesia but avoid overdose.\nMaintain the animal at 37.0 °C using a heating pad during surgical operation, imaging session and first hour after recovery from anesthesia.\nTo protect the mouse’s eyes from drying out, apply eye lubricant.\nAdminister dexamethasone (Rapidexon vet, 2 mg/kg) by subcutaneous injection to reduce inflammation and cerebral edema.\nAdminister an analgesic (for instance, Ketoprophene intraperitoneally) up to 30 min prior to or immediately after the surgery. If the animal exhibits any pain symptoms, such as reluctance to move, eat or drink, or weight loss, salivation, piloerection, or abnormal respiratory sounds after surgery, repeat the injection of analgesic.\nShave the mouse’ head with a shaving machine (see Materials and Equipment). Avoid damaging the whiskers.\nTreat the skin on the mouse’s head with 70% ethanol solution to clean the shaved area.\nUsing surgical scissors (see Materials and Equipment) and forceps (see Materials and Equipment), cut the skin from the middle line between ears to the forehead.\nGently scrape away the connective tissue attached to the skull with a blunt microsurgical blade.",
    "Slide skin borders sideways and pull ear bars slightly into aural orifices of the skull for head and skin fixation.\nClean the skull with sterile PBS and treat the surgery site on the mouse’s head with 0.5% chlorhexidine digluconate, then dry the skull surface using a combination of sterile cotton swabs and compressed air.\nInfliction of the prick injury\n\t\nPosition a small animal stereotaxic instrument with an animal holder (see Materials and Equipment).\nAdjust the position of the binocular microscope next to the stereotaxic instrument to focus on the surface of the animal’s skull.\nUsing a binocular microscope, locate the bregma point on the skull.\nIdentify the region of interest using the stereotaxic coordinates.\n\t\tNOTE: Avoid those areas of interest that are directly located over superficial cortical vessels. Destruction of these can strongly affect the trauma progression.\nPosition the 30 G needle above the chosen region and mark the target site by scratching the skull surface.\nDrill the skull with all possible precautions to avoid unnecessary widening of the affected bone surface area. Use a high speed surgical drill (see Materials and Equipment) under the microscope. Stop drilling if liquid appears in the drilled area.\nTouch the bottom of the drilled well with the needle.\nDip the needle smoothly into the brain (insertion rate 5-10 mm/min), to the depth of 0.5-2.0 mm according to the coordinates of the prick application site.\nRemove the needle immediately after reaching the desired depth (retraction rate 5-10 mm/min) and wipe the blood appearing after the prick with a small tampon (see Materials and equipment).\nPerform microinjection of 100 µM Sulforhodamine 101 or another compound of interest into the lesion site using a microsyringe pump (WPI) and 10 µl Hamilton syringe assemble with glass pipette.",
    "NOTE: During preparation of the glass pipette from borosilicate glass capillary, sharpen the tip to a diameter of 10-20 µm.\nInfuse 250-1,500 nl of the injection solution at the rate of 2-5 nl/sec.\n\t\tNOTE: Leave the pipette after the end of infusion for at least 5 min in brain parenchyma, then remove it slowly and gently to prevent solution outflow.\nCraniotomy for chronic cranial window\n\t\nDrill the skull gently and carefully to make a circle window around the injury site. Use window diameter of 3-3.5 mm.\nApply a drop of cortex buffer (125 mM NaCl, 5 mM KCl, 10 mM glucose, 10 mM HEPES, 2 mM CaCl2 and 2 mM MgSO4 in distilled H2O) to cover the window.\nPosition a round glass coverslip (#1.5 thickness) on the cranial window.\nRemove the excess of cortex buffer around the coverslip.\nSeal the edges of the coverslip with polyacrylic glue (see Materials and Equipment).\n\t\tNOTE: Ensure that the glue is not applied to the upper surface of the coverslip. If the cover glass is contaminated with glue, wait until the glass is stably glued to the skull and the glue on the glass surface gets dry, then carefully remove the contaminating glue with a microblade.\nWait for 5 min to let the glue dry up.\nUsing the ear bar height screws, adjust the head position so that the metal holder can be placed.\nApply a small amount of polyacrylic glue on the ring of the steel holder (see Materials and Equipment).\nGlue the ring of the steel holder to the glass coverslip with the metal holder handle directed backwards.\nWait for 5 min to let the glue dry up.\nMix dental cement (see Materials and equipment) with polyacrylic glue in a 3.5 cm Petri dish (or analogue) to achieve viscous conditions.",
    "Seal the borders of the cranial window with the cement + glue mixture and cover the exposed surface of the skull with the same mixture up to the skin border.\nWait for 15 min to let the cement + glue mixture dry up and then remove ear bars.\nPerform two-photon excitation microscopic (TPEM) imaging for the region of interest and a control area as it described in Protocol 3.\nAfter imaging, allow the animal to recover from anesthesia on a heating pad and keep it in an individual cage under observation until full recovery. Wet food can be given to facilitate chewing and hydration.\n2. Brain Injury Imaging Through the Thinned Skull\nAnaesthetizing animals and preparing the operation field\n\t\nAnesthetize the mouse and prepare it for trauma induction as described in step 1.1.\nSkull thinning and infliction of the prick injury\n\t\nPosition a small animal stereotaxic instrument with the animal holder (see Materials and equipment).\nAdjust the position of a binocular microscope next to the stereotaxic instrument to focus on the animal skull surface.\nLocate the bregma point on the skull using the binocular microscope, identify the brain area to be imaged based on stereotactic coordinates and mark it by scratching.\n\t\tNOTE: Skull thinning position should not be located over or nearby cranial sutures, as the skull stability is compromised in those areas. Furthermore, large cortical or meningeal vessels and meninges located below the skull sutures are likely to cause imaging artifacts.\nPlace the metal holder coated with glue over the area of interest on the animal's skull, apply light pressure and wait for 5 min until the metal holder is firmly glued to the skull.\nMix dental cement (see Materials and equipment) with polyacrylic glue in a 3.5 cm Petri dish (or analogue) to achieve viscous conditions.",
    "Seal the borders of the metal holder with the cement + glue mixture and cover the exposed surface of the skull with the same mixture up to the skin border.\nWait for 15 min to let the cement and glue mixture dry up.\nRinse the thinned skull region and the surrounding parts of the metal holder several times with PBS, so that the remnants of nonpolymerized glue are washed away.\n\t\tNOTE: It is crucial to ensure stable attachment of skull to the holder. This enables the preparation stability during imaging.\nUsing the high magnification mode of the binocular microscope, remove upper layers of the skull bone with a high-speed micro-drill to create a thinned skull area of ~0.5–1.5 mm in diameter. Use compressed air during drilling to remove the bone debris. Perform the drilling intermittently during the thinning procedure in order to avoid friction-induced overheating. Cool the drill bit using the room temperature solution and periodically apply buffer to the thinned area to absorb heat.\n\t\tNOTE: To avoid damaging the cortex, do not drill over large regions (>1.5 mm) down to a thin layer (<50 μm).\n\t\tNOTE: The rodent skull bone structure consists of two thin layers of compact bone separated by a thick layer of spongy bone. Tiny cavities of the spongy bone form concentric circles and canaliculi, which contain blood vessels. Use the microdrill to remove both the external compact bone layer and most of the spongy layer. Disruption of the blood vessels within the spongy bone may cause bleeding. Use hemostasis collagen sponge to stop this bleeding.\nUse second-harmonic generation (SHG) imaging to examine whether the majority of the spongy bone has been removed. Be careful to avoid excessive thinning, make sure that the remaining bone is thicker than 50 µm at this stage of the preparation.",
    "Put a drop of warm buffer (35-37 °C) on top of the thinned region. Use a microsurgical blade or Micro Finishing Bur to further remove bone layers and form a smooth area of ~700 µm in diameter with bone thickness of ~20 µm. During this step, it is helpful to perform repetitive SHG imaging and measure regularly the bone thickness.\nPerform TPEM imaging for the region of interest and a control area.\nAdjust the head position using the ear bar height screws in such a way that thinned region is positioned strictly horizontally. Position the needle above the thinned region and make sure that there are no large vessels beneath the targeted site.\nMake a lesion by dipping the needle into the brain, to the depth of 0.5-2.0 mm from thinned skull surface and according to the coordinates of the prick application site.\nRemove the needle and suppress hemorrhage appearing after the acute brain injury with hemostatic tampon (see Materials and equipment). Wait until blood clots form and vessel pulsation at the injury site stops. \nPerform microinjection of 100 µM Sulforhodamine 101 or another compound of interest into the lesion site, as described above in section 1.2.10.\nPerform TPEM imaging to monitor the injury progression and recovery as described in Protocol 3.\nAfter imaging, allow the animal to regain consciousness from anesthesia on a heating pad. Do not leave the animal unattended and return it to its home cage only after full physical recovery.\n3. Imaging\nPlace the animal under the microscope by attaching the metal holder to the custom built frame.\nFor imaging, use e.g. the FV1000MPE two-photon microscope equipped with Mai Tai DeepSee laser and XLPLN 25X 1.05 NA water immersion objective optimized for in vivo two-photon imaging.",
    "Identify the lesion site under the microscope using wide-field fluorescence mode. Use long pass filters to visualize brain vasculature and select the control area according to the observed pattern of blood vessels.\nTo image the second harmonic generation (SHG) signal, tune the femtosecond laser to the 800 nm wavelength and collect the emitted light using the 380-410 nm bypass filter. For fluorescence imaging, use the band pass filter (515-560 nm) to collect emitted light, and the following wavelengths are used to excite the fluorescence: GFP- 860 nm, YFP- 950 nm.\nUse Fluoview software for image acquisition.\nStore coordinates of every ROI for subsequent repetitive imaging. Image the same ROIs over time, and adjust coordinates every time to maximize the image overlap.\nAnalyze images with the appropriate software (e.g. ImageJ). Reconstructions presented here were done using Imaris software.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}