{
  "id": 17535,
  "origin_website": "Jove",
  "title": "Digital Hybrid Model Preparation for Virtual Planning of Reconstructive Dentoalveolar Surgical Procedures",
  "procedures": [
    "This study was conducted in complete accordance with the Declaration of Helsinki. Before manuscript preparation, written informed consent was provided and signed by the patient. The patient granted permission for data usage for the demonstration of the protocol.\n1. Radiographic image processing\nLoad DICOM files into the software\n\t\nDownload the newest version of the medical imaging software and open it.\n\t\tNOTE: After opening the software, the home screen will appear.\nClick Load DICOM Data on the sidebar.\n\t\tNOTE: The DICOM database will pop up, showing the previously loaded DICOM datasets.\n\t\t\nClick Import DICOM files in the DICOM database, select the DICOM dataset in the destination folder and click Import.\n\t\t\tNOTE: The newly added DICOM dataset will appear in the list of studies.\nSelect the study and click Load at the bottom of the window.\n\t\tNOTE: The DICOM dataset will be opened, and four views (coronal, axial, sagittal, and 3D) of the loaded data will be visible. Nodes are listed on the left-hand side. Theoretically, the described method can be performed on any CT or CBCT regardless of image quality (voxel size, artifacts). However, the segmentation process of higher-quality CBCT/CT scans is more straightforward, and higher-quality 3D models can be acquired. A shown CBCT scan was taken with the following parameters: voxel size: 150 µm, anode voltage: 84 kV, tube current: 40 mA, Field-of-view: 8 x 5 cm. The process can be stopped at any stage; make sure to save the scene before exiting. To save, click the save icon on the left-hand side of the toolbar and save it as a \"medical record bundle\" (.mrb) by clicking on the box icon in the \"save scene\" window.\nVolume rendering and cropping volume",
    "Crop the area of interest (upper or lower jaw) to reduce the file size and rendering time. Click the Modules bar visible on the left-hand side of the toolbar to view a scroll-down window showing frequently used modules.\nSelect the Volume Rendering module from the dropdown window. To make volume rendering visible, click the eye icon next to the \"Volumes\" bar.\nSelect the desired preset to view the volume render and move the \"Shift\" slider until the hard tissues can be viewed clearly.\n\t\tNOTE: For CBCT scans, the CT-Bone preset is recommended.\nCheck the box next to \"Enable\" and click the eye icon next to \"Display ROI\" in the \"Crop\" section to make the ROI (Region of interest) visible.\n\t\tNOTE: A wireframe box around the dataset in all 2D views and the 3D view will appear. By dragging the sides of the box, the volume will be cropped to the desired area.\nAccess the \"Crop Volume\" module to finalize cropping. Select the original dataset as the input volume.\n\t\tNOTE: Input ROI is automatically set to ROI that was previously created.\nSelect Create new volume from the \"Output volume\" dropdown bar to create a new output volume. Uncheck Interpolated cropping in the advanced settings section and click Apply.\n\t\tNOTE: When returning to the \"Data module,\" the new cropped volume will appear as a new node.\nSegmentation of CBCT dataset\n\t\nAccess the Segment Editor module for segmentation.\n\t\tNOTE: Segmentation is when 3D reconstructions of anatomical structures are generated based on the CBCT dataset to allow more accessible analysis.\nSelect the previously created cropped volume as the Master Volume of the active segmentation. Click +Add to add, and -Remove to remove segments. Rename them according to the anatomical structure they will represent.",
    "NOTE: Alveolar bone and all teeth will be separate segments within the segmentation\nStart with the segmentation of the alveolar bone. From the list of effects, select Level Tracing, a semi-automatic tool that outlines the region where pixels have the same background value as the selected pixel.\nDrag the mouse to the perimeter of the bone on one of the 2D views for a yellow line to appear around the selected area and press the left mouse button to generate the segment on the selected slice of the dataset.\n\t\tNOTE: Segmentation can be done in any of the 2D views; however, sagittal and axial orientations work the best.\nUse the Paint and Erase hand tools to modify the segment and correct mistakes if the \"Level Tracing\" tool did not outline the entire section of the bone or if artifacts present on the slice were also included.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62743/62743fig01.jpg\nFigure 1: Application of \"Level Tracing\" semi-automatic segmentation tool in sagittal orientation. (A) Outlining the region of pixels with the same background value with a yellow line. (B) Results of \"Level Tracing\" and subsequent manual segmentation. (C) Refinement of semi-automatic segmentation with the help of manual tools (paint, erase). Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62743/62743fig01large.jpg]\nNOTE: Using number keys to allow fast switching between tools.\nExclude both teeth and implants from the bone segment. Outline teeth and implants using the Erase tool and delete all highlighted pixels representing them.\nRepeat the same process on every 5th slice of the dataset in the selected orientation.\n\tNOTE: Click Show 3D to view the segmentation in three dimensions. Set the smoothening factor slider to 0.00.\nCompute the missing segments upon completion of this phase-select Fill between slices from the effects list.",
    "NOTE: This tool calculates the missing segments based on those created previously using a morphological contour interpolation algorithm.\nClick Initialize to activate contour interpolation, and if the results are satisfactory, click Apply. Scroll through the dataset upon completion to check and correct occasional mistakes.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62743/62743fig02.jpg\nFigure 2: Morphological contour interpolation with \"Fill Between Slices,\" light green areas indicating the automatically reconstructed part of the segment. (A) Axial view. (B) Sagittal view. (C) Coronal view. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62743/62743fig02large.jpg]\nNOTE: Make sure that only the segment is visible on which the interpolation is applied. The visibility of the segments can be toggled in the segments list.\nMake segment boundaries smoother by removing protrusions using the Smoothing effect. Select Median as the smoothing method and set the \"Kernel size\" to 5 x 5 x 5 pixels by adjusting the mm value in the bracket and clicking Apply.\nRepeat the same steps for the segmentation of teeth once the segmentation of alveolar bone is completed.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62743/62743fig03.jpg\nFigure 3: Finished segmentation, the brown segment representing bone and the blue segment representing teeth. (A) Axial view. (B) Sagittal view. (C) Coronal view. (D) The 3D model is generated automatically from the segments created previously. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62743/62743fig03large.jpg]\nSet the \"Modify other segments\" bar to Allow overlap before tooth segmentation so that the newly created segments will not overwrite the previously created ones.\nSpatial registration of CBCT dataset and IOS\n\tNOTE: Spatial registration is necessary because the coordinate systems for the CBCT dataset and the IOS are different.\n\t\nSelect Extension Manager From the \"View\" menu bar and click Install Extensions. Type IGT into the search bar in the right-hand corner, install the SlicerIGT extension and restart the program.",
    "Load the previously saved .mrb file of the scene by clicking the Data icon and Choose file(s) to add.\nImport the .stl file of IOS by clicking the Data icon in the upper left corner. In the \"Add data into the scene\" pop-up window, click Choose file(s) to add, go to the destination folder, select the .stl file of the IOS, and click Open.\nAdd the .stl file of the intraoral scan as segmentation by selecting Segmentation from the dropdown bar.\n\t\tNOTE: The installed \"IGT\" module will now appear in the \"Modules\" dropdown menu.\nMove the cursor over the module, and in the sidebar that appears, select Fiducial Registration Wizard.\nSelect Create new Markups Fiducial from the dropdown bar in both the \"From fiducials\" and the \"To fiducials\" sections.\n\t\tNOTE: The software will automatically name the two lists \"From\" and \"To.\" The \"From\" list represents the moving volume, which in this case will be the IOS. The \"To\" list represents the fixed volume, which will be the CBCT dataset.\nPlace marker points on well-defined anatomical landmarks on the IOS using the \"Place a markup point\" icon next to the dropdown bar in the \"From\" section. Markup points will be numbered in order of placement.\n\t\tNOTE: Place at least 6 points on the cusps and incisal edges of teeth.\nPlace markers in the same position to create the \"To\" list and in the same order on the CBCT dataset. Markup points with the same number must represent the same anatomical landmark.\nCreate a transformation by selecting Create new LinearTransform from the dropdown menu in the \"Registration result transform\" section of the sidebar after the two lists are ready.",
    "Access the \"Transforms\" module and select the previously created transformation as the Active transform. In the \"Apply transform\" section, move the IOS segmentation and the \"From\" markups list from the \"Transformable\" box to the \"Transformed\" box to superimpose the IOS over the CBCT dataset.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62743/62743fig04.jpg\nFigure 4: Spatial registration of IOS by placing fiducial markers on well-defined anatomical landmarks. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62743/62743fig04large.jpg]\nNOTE: If necessary, the accuracy of the transformation can be improved by moving the markup points or by adding additional points.\n2. Export models as .stl files for free-form surface modeling\nExport the matched hard- and soft-tissue models for further surface modeling after segmentation and spatial registration.\nGo to the Segmentations module and select the segmentation with the alveolar bone and teeth models as the active segmentation. Scroll down to the \"Export to files\" section, choose the destination folder, and select STL as the file format.\nUncheck the Merge into single file box, set the Coordinate system to RAS, and click Export.\nRepeat the same process for the IOS, visible as a separate segmentation, save the scene, and close the imaging software.\n3. Free-form surface modeling\nSurface smoothing\n\t\nOpen the CAD software, and on the home screen, click Import. Select the .stl models that were previously exported from the DICOM image processing software.\n\t\tNOTE: Even though smoothing was performed previously, the surface of the models reconstructed from the CBCT dataset will still appear pixelated, so further surface smoothing is necessary.\nGo to Sculpt in the menu bar, and from the brush inventory, select Adaptive reduce.\n\t\tNOTE: Brush size and strength must be adjusted, depending on the amount of smoothing.\nSeparate crown of the teeth from the IOS",
    "NOTE: Crowns of teeth are depicted more accurately on the IOS than on segmented models; therefore, crowns of the segmented teeth models must be replaced with crowns from the IOS.\n\t\nClick Select in the sidebar and select Brush as the selection tool. Use Unwrap brush brush mode and adjust the size of the brush. Using the brush, select the crown of each tooth until the marginal gingiva on the IOS.\n\t\tNOTE: Selected surfaces are indicated with an orange color.\nMove the cursor to Modify in the sidebar and select Smooth Boundary. Click Apply if the results are satisfactory.\n\t\tNOTE: Now, the boundary of the selection precisely follows the marginal gingiva.\nGo to Edit in the Select sidebar and click Separate to create an individual object from the selected area.\nRepeat the same process for all teeth.\nGo to Analysis in the menu bar and select Inspect.\n\t\tNOTE: The program will indicate errors in the models. Holes are marked with a blue color.\nSelect Flat fill as the \"Hole fill mode\" and click Auto repair all to create closed models from the IOS model and the separated teeth models.Go to Sculpt and smooth the edges of the filled hole using Shrinksmooth brush.\nRepeat the process for all tooth crowns and the rest of the IOS.\nMerge crowns of the teeth with the segmented tooth models.\n\tNOTE: If spatial registration was correctly done, the positions of the crowns of teeth on the IOS and the crowns of segmented teeth should match.\n\t\nUse the Shrinksmooth brush on the segmented tooth model until they are completely cover by the tooth crowns separated from the IOS.\n\t\tNOTE: Due to imperfections in both the segmentation and the IOS, the crowns don't always overlap completely.",
    "Select both the separated crown and the segmented model of the same tooth in the Object Browser. In the sidebar that appears, select Boolean union, and click Accept.\n\t\tNOTE: Now, the crown of the segmented tooth model is replaced by the crown separated from the IOS.\nUse Shrinksmooth to smooth the transition.\nSubtractions and model composition\n\t\nSubtract the bone model from the soft-tissue model to represent the clinical situation realistically.\n\t\tNOTE: The original IOS without teeth became the model of the soft tissues.\nSelect both bone and soft-tissue models in the Object Browser and select Boolean Difference.\nSmooth transitions with the Shrinksmooth brush and remove protrusions from the bottom side of the soft-tissue model.\nSubtract teeth from the soft-tissue model using the same process and smooth transitions.\nColor models\n\t\nColor the surfaces of the models to give a more realistic look since the model is complete now with the teeth, soft tissues, and alveolar bone being separated from one another, representing the clinical situation in 3D.\nSelect Sculpt from the sidebar and switch the little slider from Volume to Surface.\nSelect PaintVertex from the brush inventory and select the desired color using the color wheel in the Color section of the sidebar. Color the surface of each model (e.g., bone: brown, soft tissue: pink, teeth: white)\nAnimated Figure 1: Animation of the final, colored model, ready for virtual surgical planning. Please click here to download this Figure.[href=https://www.jove.com/files/ftp_upload/62743/Animated Figure1.mp4]Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}