{
  "id": 19954,
  "origin_website": "Wiley",
  "title": "Towards Development, Maintenance, and Standardized Phenotypic Characterization of Single-Seed-Descent Genetic Resources for Lupins",
  "procedures": [
    "This protocol describes the assessment of the seed morphological traits prior to each seed multiplication cycle. The seed traits are recorded at the beginning of each seed increase cycle, starting from the first cycle of SSD line development using the heterogeneous genotypes. These assessments will enable comprehensive characterization of seeds from different lupin genetic resources, as well as detection and elimination of errors that might occur during the SSD cycles.\nMaterials\nSeeds of lupin genetic resources\nValidated measuring devices, such as a ruler\nA standardized color scale (i.e., ColorChecker Classic Nano, X-Rite)\nTemplate file (spreadsheet)\nNOTE: The seed traits listed below should be recorded at the beginning of each primary seed multiplication cycle.\n1. Take at least five seeds from each accession (heterogeneous materials or SSD lines), and through visual assessment record the Seed Shape, according to the following categories (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.191#cpz1191-fig-0002]):\n         \n1 = spherical\n2 = flattened spherical (lenticular)\n3 = oval\n4 = flattened oval\n5 = cuboid\n6 = flattened cuboid\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/67cee623-39d7-4709-a715-3efbdc43146d/cpz1191-fig-0002-m.jpg</p>\nFigure 2\nSeed shape (A), according to The International Board for Plant Genetic Resources, Lupin Descriptor. Example images of lupin seeds: flattened spherical (B), cuboid (C).\n2. Take at least five seeds from each accession (heterogeneous materials or SSD lines), and through visual assessment record the Seed Primary Color, according to the following categories:\n         \n1 = white\n2 = brown\n3 = other\nThe seed primary color is the dominating basal color of the seed.\n3. Take at least five seeds from each accession (heterogeneous materials or SSD lines), and through visual assessment record the Seed Ornamentation, according to the following categories (for example of lupin seed ornamentation, see Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.191#cpz1191-fig-0003]):\n         \n1 = crescent\n2 = eyebrow\n3 = back\n4 = spotted\n5 = moustache\n6 = marbled\n7 = marbled crescent",
    "8 = marbled plus eyebrow\n9 = spotted plus eyebrow\n10 = spotted plus moustache\n11 = other\nOrnamentation refers to well-defined seed coat pattern that is different from the primary color. It should be assessed at full maturity of the seeds.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/956f7290-48cd-4156-86ef-8b3ca6e41ebd/cpz1191-fig-0003-m.jpg</p>\nFigure 3\nSeed ornamentation (A), according to The International Board for Plant Genetic Resources Lupin Descriptor; crescent (B), eyebrow (C), back (D), spotted (E), moustache (F), marbled (G). Example images of lupins seeds: range A-G observed in L. mutabilis; G occasionally observed in L. albus.\n4. Take at least five seeds from each accession (heterogeneous materials or SSD lines), and through visual assessment record the Seed Ornamentation Color, according to the following categories:\n         \n1 = gray\n2 = light brown\n3 = dark brown\n4 = black\n5 = other\nDensity of seed ornamentation\n5. Take at least five seeds from each accession (heterogeneous materials or SSD lines), and through visual assessment record the Density of Seed Ornamentation, according to the following categories (Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.191#cpz1191-fig-0004]):\n         \n1 = sparse\n2 = medium\n3 = dense\n4 = very dense\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/5cf8c75b-162e-483c-b7d4-991c83dbc322/cpz1191-fig-0004-m.jpg</p>\nFigure 4\nDensity of ornamentation, according to the International Union for the Protection of New Varieties of Plants.\n6. Take at least five seeds from each accession (heterogeneous materials or SSD lines), and through visual assessment record the Seed Quality, i.e., visibly healthy seeds, not affected by any pest or disease.",
    "This protocol describes the best-practice standards for seed imaging within the INCREASE project. The images of the seeds are archived prior to each seed multiplication cycle, starting from the first cycle of SSD line development using the heterogeneous genotypes. Such records will serve as a documentation of seed quality, as well as shape, color, and size of seeds, and might be an input for automated image analysis.\nMaterials\nSeeds of lupin genetic resources\nValidated measuring devices, such as a ruler\nA standardized color scale (i.e., ColorChecker Classic Nano, X-Rite)\nUniform background\nDigital camera (≥20 MP resolution)\n1. Take at least five seeds from each accession (heterogeneous materials or SSD line).\nSeeds representing the entire variation in seed morphological characteristics should be chosen (i.e., color or shape).\n2. Place the seeds on the uniform background.\nPreferably, a color not observed on seeds should be chosen, e.g., light gray.\n3. Place the seeds close to the ruler.\nOne of the seed should be placed at position zero of the scale.\n4. Make sure that the seeds are well separated from each other.\n5. Place the standardized color scale to provide color quality control and enable automated image post-processing.\nThe bioinformatics group of the INCREASE project is working on software using artificial intelligence (AI) approaches for this.\n6. Add accession label or leave enough space for the subsequent insertion of the label information and the barcode (QR code).\nImages should be clearly labeled including unique IncreaseID followed by the sample ID. Full Image-ID description is structured as follows: <IncreaseID>_<SampleID>_<ImageID>\n7. Take a picture of each accession.",
    "The resolution and size of an image depends on the intended use; e.g., resolution for research, printing, and web presentation should be 600 dpi, 300 dpi, and 72 dpi, respectively. The color bit depth should be 24-bit color.\n8. Transfer the finalized images to a central repository for the project.",
    "Here we describe the protocol to phenotypically characterize the lupin genetic material grown under controlled conditions, for primary seed increase. The protocol should be applied at the stage of SSD development from heterogeneous material, as well as for further selfing cycles. Collected data will be uploaded into the database of the project and integrated with the results obtained for the same line in other experiments (e.g., field trials, molecular characterization), thus serving as a comprehensive information resource.\nMaterials\nL. albus and L. mutabilis plants grown in insect-free conditions\n               \nThe following conditions are offered for guidance in providing optimal growing conditions for lupins: pod capacity, 7.5 L; potting medium, peat and vermiculite mixture (1:1 by volume); day and night temperatures of 22°C and 18°C, respectively; at last 14- to 16-hr photoperiod; air humidity, 60%–65%; plant watering as required, average, 200 ml per pot, twice a week; the commercial rhizobia inoculum treatment might be applied prior to sowing (to the seeds or soil); during the flowering period plants to be fertilized once a week; biological pest controls as well as protective biological products (e.g., mites, microorganisms) to be used through the whole experimental period; chemical pest control to be used when other attempts have failed.\nValidated measuring devices, such as a meter stick or a ruler\nData collection template file (spreadsheet)",
    "NOTE: Prior to sowing, it is recommended to surface-sterilize the seeds to avoid potential development of pathogen diseases. As this approach weakens the seed coat, it might serve as an scarification treatment to stimulate germination. Soak the seeds in 70% ethanol (30 s for L. albus, 20 s for L. mutabilis); rinse the seeds under tap water; soak the seeds in 1.5% sodium hypochlorite (4 min for L. albus, 1 min for L. mutabilis); rinse the seeds under sterile water; and put the seeds into sterile petri dishes and then in the refrigerator.\n1. Prior to protocol implementation, collect the following information on the experimental site:\n         \nInsect-free conditions: greenhouse/tunnel/ growth chamber\nGrowing conditions (day/night temperature, photoperiod, humidity, watering)\nLocation of experimental trial\nLatitude of experimental trial\nLongitude of experimental trial\nAltitude of experimental trial\nData collector name\nTime of collection of the data (year/season)\nNumber of generations from collection of the original seeds\nType of INCREASE Intelligent Collections\nThe following mandatory traits need to be recorded. These traits are essential to the lupin INCREASE project, and the data should be collected for all accessions of the INCREASE Intelligent Collections (i.e., R-core, T-core, H-core).\n2. Record the Dates of Cold Treatment (dd/mm/yyyy).\nExposing the seed to cold temperature (6-8°C) for 21 days induces flowering; the time of cold treatment might be adjusted to the individual genotype.\n3. Record the Date of Sowing the seeds (dd/mm/yyyy).\n4. Record the Date of Emergence, when the cotyledons emerge from the soil and open with their leave visible (dd/mm/yyyy; Fig. 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.191#cpz1191-fig-0005]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/12142a6c-f9c6-45c5-befe-eaaa7bf789e6/cpz1191-fig-0005-m.jpg</p>\nFigure 5\nEmergent lupins: L. albus (A, B); L. mutabilis (C, D).\n5. Record the Date of First Bud Occurrence on the Main Stem, when bud becomes clearly visible (dd/mm/yyyy; Fig. 6A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.191#cpz1191-fig-0006]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/50d97294-e565-4410-b66c-52700e2d9fc4/cpz1191-fig-0006-m.jpg</p>\nFigure 6",
    "Lupin stages: bud occurrence (A), petal occurrence (B), flower opened (C), full flowering (D).\n6. Record the Date of First Bud Occurrence on the Lateral Branches, when bud becomes clearly visible (dd/mm/yyyy).\n7. Record the Date of First Petal Occurrence on the Main Stem (dd/mm/yyyy; Fig. 6B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.191#cpz1191-fig-0006]).\n8. Record the Date of First Petal Occurrence on the Later Branches (dd/mm/yyyy).\n9. Record the Date of First Flower Opened on the Main Stem (dd/mm/yyyy).\nAn open flower is defined as one with visible wings and standard petal (Fig. 6C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.191#cpz1191-fig-0006]).\n10. Record the Date of First Flower Opened on the Lateral Branches, at any node (dd/mm/yyyy).\n11. Through visual assessment, record the dominant Color of Wing Petal in the Just-Opened Flower on the Main Stem, according to the following categories:\n         \n1 = white\n2 = white/blue; white color is more expanded than blue\n3 = blue\n4 = blue/white; blue color is more expanded than white\n5 = white/violet; white color is more expanded than violet\n6 = violet\n7 = violet/white; violet color is more expanded than white\n8 = white/pink; white color is more expanded than pink\n9 = pink\n10 = pink/white; pink color is more expanded than white\n12. Through visual assessment, record the dominant Color of Standard Petal in the Just-Opened Flower of the Main Stem, according to the following categories:\n         \n1 = white\n2 = white/blue; white color is more expanded than blue\n3 = blue\n4 = blue/white; blue color is more expanded than white\n5 = white/violet; white color is more expanded than violet\n6 = violet\n7 = violet/white; violet color is more expanded than white\n8 = white/pink; white color is more expanded than pink\n9 = pink\n10 = pink/white; pink color is more expanded than white",
    "13. Through visual assessment, record the Color of the Keel in Just-Opened Flower on the Main Stem (observed in L. mutabilis only), according to the following categories:\n         \n1 = white\n2 = white/blue; white color is more expanded than blue\n3 = blue/white; blue color is more expanded than white\n14. Record the Date of Full Flowering on the Main Stem, when 98% to 100% of the flowers of the inflorescences have opened (dd/mm/yyyy; Fig. 6D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.191#cpz1191-fig-0006]).\n15. Through visual assessment, record the dominant Color of Wing Petals at Full Flowering on the Main Stem, according to the following categories:\n         \n1 = white\n2 = white/blue\n3 = blue\n4 = blue/white\n5 = white/violet\n6 = violet\n7 = violet/white\n8 = white/pink\n9 = pink\n10 = pink/white\n16. Through visual assessment, record the dominant Color of Standard Petal at Full Flowering on the Main Stem, according to the following categories:\n         \n1 = white\n2 = white/blue\n3 = blue\n4 = blue/white\n5 = white/violet\n6 = violet\n7 = violet/white\n8 = white/pink\n9 = pink\n10 = pink/white\n17. Through visual assessment, record the Color of the Keel Edge at Full Flowering on the Main Stem, according to the following categories:\n         \n1 = transparent\n2 = white\n3 = white/ blue\n4 = slight blue hue\n5 = intensely colored—black\n18. Through visual assessment, record the Type of Keel Edge on the Main Stem, according to the following categories:\n         \n1 = curved\n2 = straight\n3 = enclosed\n19. Record the Date of First Flower Withering on the Main Stem (dd/mm/yyyy).\nWithering is defined as when the first petal dies and become brownish (Fig. 7A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.191#cpz1191-fig-0007] and B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.191#cpz1191-fig-0007]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/ebb49b37-9fad-420d-9d66-f4be243fea2b/cpz1191-fig-0007-m.jpg</p>\nFigure 7\nPetal withering: inflorescence (A), single flower (B).",
    "20. Through visual assessment, record the Color of Keel Edge at Flower Withering on the Main Stem, according to the following categories:\n         \n1 = transparent\n2 = white\n3 = white/ blue\n4 = slight blue hue\n5 = intensely colored—black\n21. Through visual assessment, record the Purple Pigmentation of the Main Stem at 2 months and 4 months after emergence, according to the following categories:\n         \n1 = none\n2 = slightly\n3 = medium intensity—more than half of the stem is purple\n4 = very intense—stem and internodes are purple\n5 = no pigment in stem plus purple internodes\n22. At flower withering, record the Growth Habit, according to the following categories (Fig. 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.191#cpz1191-fig-0008]):\n         \ndeterminate\nsemi-determinate\nindeterminate\nDeterminate means determinate inflorescence on the main stem. Indeterminate means lateral branches develop along the main stem with further branching. The secondary lateral branches grow higher than the primary lateral branches, and so on. Flowers develop in compact inflorescences at the tops of branches. The expression is the same in the spring type and winter type.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/ebf4c380-066d-4928-acc0-39d52e38e681/cpz1191-fig-0008-m.jpg</p>\nFigure 8\nGrowth habit/determinacy.\n23. Record the Date of First Pod Set on the Main Stem (dd/mm/yyyy).\nPod set = the pod is 8 to 10 mm long (Fig. 9A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.191#cpz1191-fig-0009] and B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.191#cpz1191-fig-0009]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/90caec42-3ddd-4436-a286-354f9765d2ee/cpz1191-fig-0009-m.jpg</p>\nFigure 9\nLupin stages: pod set (A, B), pod color changes (C, D), harvesting (E).\n24. Record the Date of First Pod set on the Lateral Branches (dd/mm/yyyy).\nPod set = the pod is 8 to 10 mm long (Fig. 9A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.191#cpz1191-fig-0009] and B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.191#cpz1191-fig-0009]).\n25. Record the Date of First Pod Color Changes on the Main Stem (dd/mm/yyyy).\nThe pod color has changed from green to khaki. These pods are ready to be harvested soon (Fig. 9C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.191#cpz1191-fig-0009] and D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.191#cpz1191-fig-0009]).\n26. Record the Date of First Pod Color Changes on the Lateral Branches (dd/mm/yyyy).",
    "The pod color has changed from green to khaki. These pods are ready to be harvested soon.\n27. At the stage of harvesting, through visual assessment, record the Pod Shattering on the Main Stem, according to the following categories:\n         \n1 = none\n2 = slight\n3 = moderate\n4 = complete\n28. At the stage of harvesting, through visual assessment, record the Pod Shattering on the Lateral Branches, according to the following categories:\n         \n1 = none\n2 = slight\n3 = moderate\n4 = complete\n29. Record the Date of Harvesting Pods on the Main Stem (dd/mm/yyyy), i.e., when the pods have dried and turned a golden-brown color.\nWhen pods have dried, the seeds in the pods have reached full size and the pods can no longer be dented with the thumbnail (Fig. 9E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.191#cpz1191-fig-0009]).\n30. Record the Date of Harvesting Pods on the Lateral Branches (dd/mm/yyyy), i.e., when the pods have dried and turned a golden-brown color.\nWhen pods have dried, the seeds in the pods have reached full size and the pods can no longer be dented with the thumbnail (Fig. 9E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.191#cpz1191-fig-0009]).\n31. Record the Plant Height of the Main Stem (in cm) from the ground level to the lowest end of the first ripe pod, at the stage of harvesting.\n32. Record the Total Plant Height (in cm) from the ground level to the highest point of the plant, including lateral branches, at the stage of harvesting.\n33. Record the Number of Pods per Plant on the Main Stem of each plant.\n34. Record the Number of Pods per Plant on the Lateral Branches of each plant.\n35. Record the Number of Qualified Seeds on the Main Stem of each plant, i.e., healthy, well-developed, non-infected.",
    "36. Record the Number of Qualified Seeds on the Lateral Branches of each plant, i.e., healthy, well-developed, non-infected.\n37. Record the Total Number of Qualified Seeds from each plant from both the main stem and the lateral branches, i.e., healthy, well-developed, non-infected.\n38. Record the Total Mass of the Qualified Seeds harvested from each plant.\n39. Through visual assessment, record the Presence of any Disease and/or Pathogen, and if possible, describe it or make notes according to the following categories:\n         \n1 = thrips\n2 = powdery mildew\n3 = aphids\n4 = anthracnose\n5 = fusarium\n6 = virus\n7 = other\nBased on the mandatory data recorded in Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.191#cpz1191-prot-0003] (steps 1-39), the following traits can be estimated\n40. Based on the recorded dates, estimate the Days to Emergence based on the recorded date of sowing.\n41. Based on the recorded dates, estimate the Length of Vegetative Phase/Days to Floral Time based upon the recorded date of sowing and the first bud occurrence on the main stem.\nThe vegetative phase begins when the seeds are sown and ends with floral initiation.\n42. Based on the recorded dates, estimate the Length of the Generative Phase on the Main Stem:\n         \nCount from the first bud occurrence to the first flower wither\nCount from date of pod set to pod color changes\nThe generative phase begins when the flower bud becomes visible and ends when the first flower has begun to wither and the pod color changes to khaki on the main stem.\n43. Based on the recorded dates, estimate the Length of the Pod and Seed Growth Phase on the Main Stem (physiological maturity):\n         \nCount from date of pod set to harvest\nCount from date of pod color change to harvest",
    "The pod and seed growth phase begins when a pod is set (reaches 8-10 mm) and ends when the pod changes color (from green, through khaki, to light brown).\n44. Based on the recorded dates, estimate the Length of the Pod and Seed Growth Phase on the Lateral Branches (physiological maturity):\n         \nCount from date of pod set to harvest\nCount from date of pod color change to harvest\nThe pod and seed growth phase begins when a pod is set (reaches 8-10 mm) and ends when the pod changes color (from green, through khaki, to light brown)."
  ],
  "subjectAreas": [
    "Plant Biology"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}