{
  "id": 17296,
  "origin_website": "Jove",
  "title": "Laparoscopic Non-Mesh Cerclage Pectopexy for Pelvic Organ Prolapse",
  "procedures": [
    "The protocol using LNMCP was conducted after approval by the Institutional Review Board of The University of Hong Kong-Shenzhen Hospital on 1 March, 2021 (IRB Approval Number 2021-040). All human participants provided written informed consent for publication before undergoing the procedure. All women diagnosed with symptomatic POP and cystocele or uterine descent POP-Q stage 2 or higher were included in the study. Women with a history of prolapse surgery, established malignancy of the cervix or cervical dysplasia, language issues, intention to preserve fertility, contraindications for laparoscopic surgery, such as the risk of severe adhesions, and those not available for follow-up were excluded.\n1. Patient preparation\nDiscuss the benefits and risks associated with the procedure as well as the risk of complications such as uncontrolled bleeding warranting blood transfusion, conversion to laparotomy, postoperative infection, and the recurrence of POP.\nPerform surgery using general anesthesia and endotracheal intubation following a previous report7. Administer prophylactic antibiotics such as intravenous cefuroxime (1.5 g, see Table of Materials) to each patient 30 min before the induction of anesthesia.\nStart perioperative thrombosis prophylaxis in women using an enoxaparin sodium injection (4,000 AxaIU, see Table of Materials) according to hospital protocols.\n2. Pre- LNMCP preparation\nFollowing skin sterilization, establish the ports (see Table of Materials) using standard techniques7: a 10 mm umbilical port, a 5 mm port on the right side, and two left-sided ports measuring 5 mm each on the left side of the lower abdomen.\nDuring the operation, carefully monitor the patient's vital signs with the help of an anesthesiologist.\n\tNOTE: During the anesthesia, continually evaluate the patient's oxygenation, ventilation, circulation, and temperature.\nMaintain an intra-abdominal pressure of 12 mmHg and a gas flow rate of 20 L/min7.\n3. LNMCP procedure\nPerform laparoscopic supracervical hysterectomy with bilateral salpingo-oophorectomy as previously described by Lyons et al.8.",
    "To perform cervical cerclage, suture, ligate, and attach a round ligament to the cervical stump using a permanent suture (size 2, see Table of Materials) in the uterine isthmus beginning at the 3 o'clock position on the right side in a counterclockwise direction, performing peripheral movements with the needle around the cervix to complete one round until the starting position (Figure 1). Tighten and secure the stitch upon completion of the cervical cerclage (Figure 2).\nEmbed the suture (size 2) in the round ligament until the iliopectineal ligament (Figure 3).\nExpose the iliopectineal ligament near the landmarks, including the round ligament and the obliterated umbilical artery. Incise the peritoneum to a length of approximately 8 cm along the inner edge of the round ligament toward the pelvic wall until the iliopectineal ligament is reached. Locate the posterior aspect of the iliopectineal ligament immediately below the external iliac vein.\nInsert the suture (size 2) through the iliopectineal ligament to ensure tension-free anchoring (Figure 4).\nRepeat steps 3.2-3.5 on the other side of the pelvis.\nPerform re-peritonealization with an absorbable suture (size 2-0, see Table of Materials).\nPerform anterior and/or posterior colporrhaphy and/or anti-incontinence surgery before LNMCP, if indicated9.\n\t​NOTE: The postoperative pelvis and schematic shown in Figure 5 and Figure 6, respectively, illustrate the LNMCP technique.\n4. Postoperative management\nRecord the intraoperative and postoperative parameters, including blood loss based on vacuum drainage, the operation time of LNMCP, and perioperative complications.\nDocument the primary outcomes, including objective and subjective success rates.\n\tNOTE: An objective measure of surgical success is the absence of any prolapse extending beyond the hymen, an annoying bulge, or treatment for recurrent prolapse9. Subjective success is defined as Patient Global Impression (PGI) ≤2, based on the PGI Improvement Scale10.\nPrescribe low-dose vaginal estriol for at least 6 weeks post-surgery.",
    "Ask the patient to perform pelvic floor exercises starting 8 weeks after the surgery.\nPerform follow-up after the surgery at intervals of 6 weeks, 6 months, and again 1 year later. Conduct a gynecological examination of the patients, who should complete the PGI Improvement Scale questionnaire10."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}