{
  "id": 3664,
  "origin_website": "Cell",
  "title": "A behavioral training protocol using visual perceptual learning to improve a visual skill",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPretest (day 1)\nTiming: 1 session of 1 h\nSubjects are presented on each trial with a different mammogram and are asked to decide whether the mammogram contains the trained type of lesion.\nInstruction slides\nGive subjects explanation as to the purpose of the study and the methods used in the study. Subjects will be committing to one session every day for 5 days and then a retest 6 months after the last session. Subjects do not require any background knowledge of reading mammograms or any medical background.\nSubjects are shown instruction slides that detail the importance of the study and background information on breast cancer and mammographic lesions (see Figure 4[href=https://www.wicell.org#fig4] and Experimental design considerations[href=https://www.wicell.org#sec1.1]).\nPretest session\nSubjects are assigned to the trained type of lesion prior to the experiment.\nMammograms with the trained type of lesion and normal mammograms are presented in random order.\nTask:\nAll the available keystrokes (moving in four directions, zoom in, zoom out) are printed in large font next to the keyboard.\nMake sure subjects are familiar with the keyboard and mouse before starting by asking whether they know the available keystrokes for the study and asking them to move the cursor around on the screen. No practice trials are given. The experimenter should remain in the testing room with the subject for the first five trials to make sure that the subject understands the task and knows which buttons to press.\nSubject is presented with a mammogram slide, then asked to indicate if there is a lesion using the “J” or “N” keys on the keyboard for “yes” or “no.”\nIf the subject chooses “J,” then the subject is asked to click on the center of the lesion using the mouse cursor.",
    "Note: Upon pressing the “J” key a crosshair, enclosed by a circle, will appear on the screen and the subject can adjust to where they believe the center of the lesion is located by moving and clicking the cursor. The circle has a diameter of 2 degrees visual angle. The subject cannot adjust the circle size to indicate the lesion area. If the subject zooms into the mammogram to magnify anatomical details the crosshair and circle are similarly magnified. The subject can still change the decision by pressing the “N” key.\nNote: Future studies may consider including a circle adjustable in size such that subjects can indicate the lesion area.\nSubject presses space to confirm decision, no feedback is provided, and the next mammogram slide is shown.\nNote: The difficulty level of different mammograms with and without any lesion was not equated across pretest, training, posttest, and retest. Instead, mammograms were randomly assigned to different sessions for each subject to cancel out differences in difficulty between different mammograms across subjects. Future studies should consider piloting all mammograms in the study in a different group of subjects to calculate the difficulty to detect the presence or absence of a lesion in each mammogram prior to test and training.\nTraining (days 2–4)\nTiming: 3 sessions of 1 h per day over 3 days\nEach training session is conducted on a separate day. Subjects are presented with a different mammogram on each trial and are asked to decide whether the mammogram contains the trained type of lesion.\nNote: In the training phase, each trial is immediately followed by detailed feedback about response accuracy (see below and Figure 3[href=https://www.wicell.org#fig3]).\nNote: Subjects are notified which lesion they are assigned for training before the training session starts.",
    "Note: A set of new, previously unseen mammograms is used for each training session.\nInstruction\nSubjects are told that there will be detailed feedback about response accuracy after each slide.\nTraining session\nMammograms with the trained type of lesion and normal mammograms are presented in random order.\nSubjects are asked to indicate whether there is a lesion or not using the same steps as in the pretest.\nIf there is no lesion in the mammogram:\nSubjects will be notified with green text if they responded correctly (correct rejection), and red text if they responded incorrectly (false alarm).\nThe mammogram will be shown again so that the subject can review the slide. Subjects can control how long they want to review the feedback slide and press space to move on from the feedback slide when they are ready. There is nothing indicated on the slide, except a blue crosshair of the indicated center of the lesion if the subject committed a false alarm.\nIf there is a lesion in the mammogram:\nSubjects will be notified with green text if they responded correctly (hit), and red text if they responded incorrectly (miss).\nThe mammogram will be shown again with the area of the lesion circled in yellow (corresponding to the true location of the lesion) and the blue crosshair corresponding to the center of the lesion reported by the subject (if the subject indicated the presence of a lesion).\nNote: When indicating where the lesion is, subjects can click anywhere within the yellow-circled area (Figure 1[href=https://www.wicell.org#fig1]) and be counted as correct; the subject does not need to click exactly in the center of the lesion.\nSubject presses space to confirm when finished with review, and the next mammogram slide is shown for the next trial of training.",
    "Critical: Subjects are to be reminded before beginning of training to examine the feedback image for every slide carefully, for both normal mammograms and lesions. Furthermore, subjects are to be informed that the percentage of normal mammograms is a lot higher than of mammograms with the trained type of lesion.\nPosttest (day 5)\nTiming: 1 session of 1 h\nPosttest is identical with the pretest except that a set of new, previously unseen mammograms is used.\nInstruction slides\nSubjects are again familiarized with the diagnostic features of the trained type of lesion by using the same instruction slides as prior to the pretest.\nSubjects are told that there will not be feedback after each slide during the test.\nPosttest session\nExactly the same procedures as in the pretest session are used.\nRetest (6 months after posttest)\nTiming: 1 session of 1 h\nThe long-term stability of VPL is assessed by conducting a retest session, which is identical with the pretest and posttest sessions except that a set of new, previously unseen mammograms is used.\nCritical: Only trained subjects who completed each of the preceding sessions of the experiment should be recruited for the retest.\nInstruction slides\nSubjects are asked to review all slides in the instruction slides from the pretest session.\nRetest session\nExactly the same procedures as in the pretest and posttest sessions are used."
  ],
  "subjectAreas": [
    "Clinical Protocol",
    "Neuroscience",
    "Behavior",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Ecology & Environmental Biology"
  ]
}