{
  "id": 6828,
  "origin_website": "Bio",
  "title": "Quantification of Bacteria Residing in <em>Caenorhabditis elegans</em> Intestine",
  "procedures": [
    "Note: All microbiological techniques should be carried out in a clean bench, next to a Bunsen burner. Bacteria and nematode growthBacteria were store in 50% glycerol stocks at -20 °C. Stocks were prepared by mixing 287 μl of sterile 87% glycerol and 213 μl of cultured bacteria. Mix by inversion.Streak E. coli OP50-GFP and Salmonella Typhimurium MST1-GFP from glycerol stocks onto individual Luria-Bertani (LB) plates and grow them overnight at 37 °C. LB plates for these two bacteria should contain ampicillin (50 μg/ml).Next day, pick a single colony and grow it on 10 ml of liquid LB supplemented with 50 μg/ml ampicillin at 37 °C for 6 h on a 50 ml Falcon tube. The OD600 should range between 1.5 and 2. Colonies can be picked by using a sterile 200 μl pippet tip, or a smear loop (prior sterilization with fire). Tube lid should be with loose, but secured by lab tape. Shake at 200 rpm.Seed 3 ml of each bacterial culture onto 90-mm NGM agar plates. Allow it to dry and use them next day. Keep at room temperature.Pick 5 L4 worms (genetic background of interest) onto each plate seeded with E. coli OP50-GFP and S. Typhimurium MST1-GFP. Experiment should be carried out in triplicates.Allow worms to grow until desired developmental stage (Figure 1). In our case, we allow worms to grown for 2 days and we selected L4 grown on each bacterial lawn, because it is easy to recognize as a specific developmental stage.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200425/20200425224055_9982.jpgFigure 1. Wild type (N2) worms growing on E. coli OP50 and Salmonella Typhimurium MST1. As previously described (Palominos et al., 2017), the exposure to bacterial pathogens for two consecutive generations cause that a percentage of C. elegans population enter diapause, forming the dauer larvae (arrowheads). Adults can be seen in both conditions (arrows).",
    "Scale bars = 500 μm.Isolate bacteria from C. elegans intestines: Homogenization and serial dilutionNote: This procedure should be carried out in a sterile area. Ideally, under a laminar flow cabinet. All solutions should be autoclaved prior use. Prepare levamisole (25 mM) in M9 solution (M9 + Lev). This will cause worms to paralyze and stop the pharyngeal pumping, avoiding the solution to enter to the worm’s interior. Keep on ice.Select 30 worms of the desired stage grown on each bacterium lawn and pass them with a platinum pick onto 1.5 ml microcentrifuge tubes containing 1 ml of M 9+ Lev. Three tubes should be prepared per bacteria with worms from each replica (Step A4) This will be biological replicate number 1 (replicates number 2 and 3 should be carried out in a different day).Centrifuge worms for 2 min at 376 x g. Discard supernatant.Fill with 1 ml of M9 + Lev.Repeat Steps B3-B4, twice.Discard M9+Lev and resuspend worms in 1 ml of M9 + Lev supplemented with Antibiotics (M9 + Lev + Ab).Repeat Steps B3-B5, but with M9 + Lev + Ab, instead of M9 + Lev.Discard supernatant, resuspend pelleted worms in 1 ml of M9 + Lev + Ab and incubate for one hour.Repeat Steps B3-B5.Note: Use just M9 + Lev. Discard M9 + Lev as much as possible and lyse worms with a sterile pestle (could be motorized if available).Note: Worms on each tube should be lysed with a sterile pestle. Lyse worms for 1 min, or until the worm pellet is completely dissolved. Resuspend lysed worms in 500 μl of M9.Note: Serial dilutions consist of series of successive measured dilutions that are prepared in order to reduce the concentration of bacteria and obtain a known number of colony forming units per sample.",
    "Dilute 1:10 the worm lysate, in seven serial dilutions (dilution #1 to #7) in M9. For example, take 1 ml of worm lysate into 9 ml of M9 buffer. This will be dilution #1. Then, take 1 ml of the dilution #1 into 9 ml of M9 buffer, making dilution #2. Repeat sequentially until dilution #7.Take 200 μl of dilution #5 (10-5), #6 (10-6), and #7 (10-7), and plate them on solid LB with antibiotics. Streptomycin is used to select E. coli OP50, ampicillin is used to select fluorescent Salmonella Typhimurium MST1-GFP and E. coli OP50-GFP strains.Incubate plates overnight at 37 °C.Quantification of bacterial colonization by calculating Colony Forming Units (CFU) in C. elegans intestines (or simple plating)Notes:Next day, check for undesired bacterial or fungi contamination ensuring you will count colonies of bacteria with the reported morphology. For example, E. coli OP50 colonies are tiny, round, creamy white in color and with defined borders. In contrast, Salmonella colonies are shiny, with dense center and round margins. You will have 9 plates of isolated colonies from each bacterium, in this case, 18 plates in total (3 from E. coli replicates, and other three replicates from Salmonella, per each 10-5, 10-6, 10-7 dilution).Count the number of colonies with a Hand Tally Counter (Humboldt). Digital counters, or image-based counters can also be used.Register each value in an MS® Excel sheet.Calculate the CFU per worm using the formula:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200425/20200425224140_2500.jpgQuantification of the degree of bacterial colonization in the gut using fluorescence microscopyPrepare agar pads as described by Monica Driscoll (www.wormatlas.org/agarpad.htm[href=http://www.wormatlas.org/agarpad.htm]) or in WormBook. Instead of a 5% agar solution, we use 2%.Pick 15 worms per bacterial condition to individual agar pads containing a drop of 1 mM levamisole hydrochloride using a platinum pick.",
    "Small amounts of playdough can be placed at each corner of a 22 x 22 coverslip before covering the preparation to avoid pressuring the worm.Classify worms according to the presence of GFP positive bacteria in their guts. As described in Palominos et al. (2017), worms with no detectable fluorescence or discrete bacteria in the pharynx are classified as “undetectable” (Figure 2A’). Worms with one-third of the intestine with fluorescent bacteria are classified as “partial”, and “full” when GFP tagged bacteria is found along the whole intestine (Figure 2B’).Quantify the number of animals with different phenotypes. Save raw data.Take representative images of each phenotype.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200425/20200425224248_6540.jpgFigure 2. Intestinal colonization of C. elegans gut by fluorescent bacteria. A-A’. L4 wild type worm grown on E. coli OP50-GFP. Most worms on these bacteria possess just scattered bacteria in the pharyngeal grinder. B-B’. L4 wild type worm grown on Salmonella Typhimurium MST1-GFP. Worm fed on Salmonella presenting a “full” colonization phenotype, showing individual and clumped GFP positive bacteria (arrows) along the intestine. Moreover, intestinal expansion can be observed (arrowheads). Scale bars = 50 μm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}