{
  "id": 15432,
  "origin_website": "Jove",
  "title": "A Triple Primary Cell Culture Model of the Human Blood-Brain Barrier for Studying Ischemic Stroke In Vitro",
  "procedures": [
    "NOTE: See the Table of Materials for details related to all cells, materials, equipment, and solutions used in this protocol.\n1. Triple cell culture BBB model setting\nSeeding pericytes\n\t\nCultivate HBVP in T75 culture flasks with an activated surface for cell adhesion within a 5% CO2 incubator at 37 °C until confluent. Once confluence is reached, aspirate the old pericyte medium and wash the cells with 5 mL of warm Dulbecco's phosphate-buffered saline (DPBS). Aspirate the DPBS and detach the cells from the flask using a combination of 4 mL of warm trypsin-EDTA solution and 1 mL of DPBS.\n\t\tNOTE: Avoid using passages later than P7.\nIncubate the flask for 5 min at 37 °C in a CO2 incubator. View under a microscope to confirm whether the cells are detached from the flask. Add 5 mL of warm pericyte medium (containing 2% fetal bovine serum [FBS]) to the flask and transfer the detached cells to a 50 mL centrifuge tube.\nCentrifuge the cell suspension for 3 min at 200 × g, allowing the cells to form a pellet in the bottom of the tube. Aspirate the medium from the tube, ensuring the cell pellet remains intact.\nResuspend the cell pellet in pericyte medium; calculate the amount of medium depending on the confluence of the cells and the number of well-inserts needed. Take 10 µL of the resuspended cells, place them into a cell counting slide, and count the number of cells.\nDetermine the cell density and seed 300,000 cells/insert in 1 mL of pericyte medium onto the abluminal side of the well-inserts (6-well format).",
    "NOTE: When seeding HBVP on the underside of inserts, it is very important to first flip the well-insert plates upside down. While the plate is laid flat on a surface, remove the bottom section to expose the abluminal side of the well-inserts. After adding pericyte cell suspension onto the abluminal side, cover the well-inserts with the flipped plate to prevent evaporation. Keep all plates turned upside down in a 5% CO2 incubator at 37 °C overnight.\nSeeding astrocytes\n\t\nCultivate HA in T75 flasks within a 5% CO2 incubator at 37 °C until confluence is reached. Follow the above steps 1.1.1-1.1.4 using astrocyte medium (also containing 2% FBS) instead of pericyte medium.\n\t\tNOTE: Avoid using passages later than P9.\nDetermine the cell density and seed 300,000 cells/well onto the bottom of the tissue culture 6-well plates. Cover the plate to prevent evaporation and keep all plates in a 5% CO2 incubator at 37 °C overnight.\nSeeding endothelial cells\n\t\nCultivate HBMEC in tissue culture dishes within a 5% CO2 incubator at 37 °C until confluent. Follow the above steps 1.1.1-1.1.4 using complete classic medium (containing 10% FBS) instead of pericyte medium.\n\t\t​NOTE: Avoid using passages later than P12.\nTake out the tissue culture 6-well plates containing astrocytes and the well-inserts (6-well format) containing pericytes from the 5% CO2 incubator at 37 °C. Aspirate the astrocyte medium from the tissue culture 6-well plates. Add 1 mL of pericyte medium and 1 mL of astrocyte medium to each well.\nAspirate the pericyte medium from the well-inserts and place them into the tissue culture 6-well plates containing the seeded astrocytes. Seed HBMEC at a density of 300,000 cells/well in 2 mL of complete classic medium onto the apical side of the same well-inserts.",
    "NOTE: The endothelial cells should be seeded on the apical side of the well-inserts on the next day after seeding pericytes on the abluminal side of the well-inserts and astrocytes on tissue culture 6-well plates. Cells should be maintained in triple culture for 6 days to induce BBB-like properties. The cell culture medium should be changed in both well-insert compartments 24 h prior to experiments.\n2. Induction of the oxygen-glucose deprivation\nWash the cells 3x with DPBS. For triple cell cultures subjected to OGD, add glucose-free medium (without L-glutamine and phenol red) to both the apical and basolateral compartments. Replace the culture medium with fresh medium in normoxic control cell cultures. Place control triple cultures in the 5% CO2 incubator at 37 °C.\n\tNOTE: Medium changes prior to the induction of OGD or immediately after OGD might create mechanical stress that would further impact the endothelial cell monolayers. Thus, the steps with medium replacement are included for normoxic control cell cultures.\nPlace a Petri dish containing 20 mL of sterile water in the hypoxia incubator chamber to provide adequate humidification of the cultures. Open the chamber by releasing the ring clamp. Arrange the cell cultures on the shelves. Seal the chamber by securing the ring clamp.\nOpen both the inlet and outlet ports of the chamber. Attach the tubing coming from the top of the flow meter to the chamber. Attach the tubing coming from the bottom of the flow meter to the gas tank containing the gas mixture of 95% N2/5% CO2 via an air filter.\nOpen the tank flow control valve by turning it counterclockwise to allow minimum gas flow. Slowly open the pressure regulator valve by turning clockwise.",
    "Flush the chamber with the gas mixture at a flow rate of 20 L/min for 5 min. Disconnect the chamber from the gas source and firmly close both white plastic clamps.\nTurn off the tank flow control valve by turning clockwise. Close the pressure regulator valve by turning counterclockwise.\nPlace the hypoxia chamber in a conventional incubator at 37 °C for 4 h.\n\t​NOTE: For adding subsequent reoxygenation period, wash the cells 3x with DPBS, add fresh medium in all triple cultures, and keep for an additional 24 h in the 5% CO2 incubator at 37°C. According to the manufacturer's instructions, the oxygen concentration remaining in the chamber is 0% after no less than 4 min of purging with anaerobic gas mixture at 20 L/min.\n3. TEER measurements\nPlace the sterilized TEER instrument into the biosafety cabinet and plug the electrodes into the epithelial voltohmmeter. Sterilize the electrodes in 30 mL of 70% isopropyl alcohol solution for a minimum of 30 min.\nTurn on the TEER instrument and set the function to ohms.\nRemove the electrodes from the 70% isopropyl alcohol solution and place them in 20 mL of DPBS for a minimum of 30 min until the digital readout on the TEER device reads 0 ohms.\nInsert the long prong of the electrode through one of the three openings in the well-insert hanger of the blank well-insert control, lowering it until it touches the bottom of the well. Ensure that the short prong is resting above the apical culture on the bottom of the well-insert.",
    "NOTE: The blank well-insert control is comprised of 2 mL of complete classic medium in the apical compartment and a combination of 1 mL of pericyte medium and 1 mL of astrocyte medium in the basolateral compartment. Ascertain that the electrodes are held at a 90° to the well-insert while taking the TEER measurement. Using the average of two or three readings obtained in the same well (per opening) can help to decrease the variability.\nWait until the digital readout values on the TEER instrument level off before recording the value. Place the electrodes back into DPBS to wash them between measurements. Continue to collect all the TEER measurements for two more blank well-insert controls.\nCollect the TEER measurements of the sample plates using steps 3.4-3.5 taken for the control measurements. Once all measurements have been taken, place the electrode back into the 70% isopropyl alcohol solution for 30 min. Disconnect the electrodes from the TEER instrument and allow them to air-dry.\nCalculate the TEER values. Use equation (1) to subtract the mean ohm value of the blank well-insert control from the ohm value of the sample, and then multiply this resistance value by the area of the membrane insert (cm2) to give the reported TEER value in Ω∙cm2.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64469/64469eq01.jpg (1)\n4. Assessment of the BBB paracellular permeability\nNOTE: Perform all steps involving FITC-dextran in a cell culture biosafety cabinet with the lights turned off. Cover the FITC-dextran solutions with aluminum foil to minimize photobleaching.\nPrepare solutions containing FITC-dextrans of 20 and 70 kDa (0.1 mg/mL) using phenol red-free endothelial cell growth medium and allow to stir on a rocking platform shaker for 1 h. Filter the solutions using a 0.22 µm syringe filter.",
    "Aspirate the medium from the basolateral compartment and replace it with 2 mL of phenol red-free endothelial cell growth medium in the triple cell culture BBB model. Wash the cells in the apical compartment twice with Hanks' balanced salt solution (HBSS).\nAdd 1 mL of the FITC-dextran solution in the apical compartment and cover the plate with aluminum foil. Place the plate into a 5% CO2 incubator at 37 °C for 1 h.\nTake 100 µL of medium from the basolateral compartments and transfer it into a black 96-well plate. Measure the fluorescence using a microplate reader with the excitation and emission wavelengths set to 480 nm and 530 nm, respectively.\n5. Detection of hypoxia in live cells\nSeed 200 µL of HBMEC, HA, and HBVP in the center of poly-d-lysine-coated, 35 mm glass bottom dishes at a density of 150,000 cells/dish. Before seeding HBMEC, coat the bottom of the dishes with the attachment factor. Allow the cells to attach to the glass surface by leaving them overnight at 37 °C in a CO2 incubator.\n\tNOTE: It is important to place dishes with human primary cells at the same time with a triple well-insert BBB model in a hypoxia chamber for OGD.\nOnce confluence is reached, discard the culture medium and add 2 mL of prewarmed glucose-free medium (for OGD) or normal medium (for controls) containing 2 µL of 1 mM Hoechst 33342 (final concentration 0.2 µM) and 0.5 µL of 5 mM stock solution of the referenced Image-iT green hypoxia reagent (final concentration 1 µM). After OGD treatment, replace the medium with imaging optimized medium in all dishes.\nPerform fluorescence live-cell imaging with the GFP filter and top-stage confocal microscope incubator as described previously14,15.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}