{
  "id": 17404,
  "origin_website": "Jove",
  "title": "Echocardiographic Characterization of Left Ventricular Structure, Function, and Coronary Flow in Neonate Mice",
  "procedures": [
    "All experiments were approved by the Animal Care and Use Committee of the University of Illinois at Chicago. For the experiments, 7-day-old FVB/N mice were used. The protocol is divided into mouse preparation, echocardiography image acquisition, and post-imaging animal care.\n1. Mouse preparation\nObtain the 7-day-old mice from the breeding cage.\n\tNOTE: At this early age, it is difficult to determine the sex of the animal by physical examination.\nPlace ECG gel (see Table of Materials) on the warmed platform electrode pads. Place aluminum foil strips (~1.5 in x 0.25 in) on top of the electrode pads to extend the electrode range and secure with tape (Figure 1A). Subsequently, place the ECG gel on top of the aluminum foil strips.\n\tNOTE: Ensure that the gel underneath the aluminum foil strips does not dry out during the procedure. If that occurs, add more gel to maintain the conductivity.\nCut out a finger from a nitrile glove and fit it to cover both the isoflurane/oxygen nose cone on one side and the mouse nose on the other side (Figure 1B).\nPlace the mouse pup into the isoflurane induction chamber and start isoflurane delivery at 2.5% concentration driven by 100% oxygen (Figure 1C).\nPlace the anesthetized pup in a supine position on the imaging platform with the paws on top of the aluminum foil pads and secure with tape. Ensure that the electrical circuit is complete and that the ECG is recording.\nDecrease the isoflurane delivery to 1.5% driven by 100% oxygen. Secure the cut-out finger from the glove around the pup's nose with tape. Confirm the depth of anesthesia by pinching the pup's paws.\nPlace a thick layer of prewarmed ultrasound gel on top of the pup's upper body. Use two gauze rolls to keep the ultrasound gel in place (Figure 1D).",
    "Use a heating lamp to maintain the pup's normal body temperature (Figure 1E).\n\t​NOTE: A rectal probe was not used to monitor body temperature in the current study due to the small size of the pup.\n2. Echocardiographic image acquisition and analyses\nPerform transthoracic echocardiography using an echocardiography instrument equipped with a linear array transducer at 40 MHz for B-mode and at 32 MHz for Doppler (frame rate 233) (see Table of Materials), following adult mice echocardiography protocols7,8,9.\nAvoid placing excessive pressure on the pup's chest cavity when placing the echo transducer during echocardiographic image acquisition.\n\tNOTE: Due to the pup's small size, the weight of the transducer itself may result in altered cardiac function or death.\nCapture the PLAX view of the left ventricular outflow tract and the left atrium.\n\t\nPlace the transducer in the holder, with the index mark toward the right shoulder of the pup.\nLower the transducer until it is in contact with the gel and visualize the left ventricular outflow tract in B-mode (Figure 2A).\nUse M-mode at the aortic leaflets to measure the left atrium (LA) maximum diameter at end-systole (Figure 2B, Table 1). Press the Cine Store button to record the data.\nCapture the PSAX view of the left ventricle to measure the chamber dimensions, wall thickness, aortic flow, and pulmonary flow.\n\t\nRotate the transducer ~90° clockwise of the PLAX to obtain the PSAX view.\nPlace the probe at the level of the papillary muscles and use M-mode to measure the left ventricular internal diameters (LVID), interventricular septum thickness (IVS), and PW during systole and diastole (Figure 3A, Table 1). Press the Cine Store button to record the data.\nCalculate the RWT, an index of hypertrophy, using diastolic chamber dimensions as follows3,10:\n\t\t(PW + IVS at end-diastole) / (LVID at end-diastole)",
    "Move the transducer toward the base of the heart and use the color Doppler to visualize the pulmonary artery. Press PW Doppler to quantify the pulmonary peak flow velocity, pulmonary flow profiles, pulmonary ejection time (PET), and pulmonary acceleration time (PAT)11,12 (Figure 3B). Press the Cine Store button to record the data.\nMove the transducer further toward the base and use color Doppler to visualize the aortic flow (Figure 3C). Use PW Doppler to visualize the blood flow and measure the aortic ejection time (AET). Press the Cine Store button to record the data.\nCalculate the Vcf (circ/sec)13,14, an indicator of myocardial performance, using LVID end-diastole (LVIDd), LVID end-systole (LVIDs), and AET as follows (Table 1):\n\t\t(LVIDd - LVIDs) / (LVIDd x AET)\nCapture the apical four-chamber view.\n\t\nPlace the platform in the Trendelenburg position, tilt it to the left, and adjust the probe to visualize the four chambers (Figure 4A).\nUse color Doppler to visualize the blood flow and PW Doppler at the tip of the mitral valve leaflets in the center of the mitral valve orifice to record the mitral flow. Press the Cine Store to record the data.\nIn this view, calculate the following parameters2,3,10 (Figure 4B and Table 1):\n\t\t\nCalculate E/A ratio, which is the maximal velocity of blood flow in the early phase of diastole (E) over the maximal velocity of blood flow in the late phase of diastole (A).\nDetermine E wave deceleration time (DT), which is the time from peak E to the end of the early diastole.\nCalculate LV isovolumic relaxation time (IVRT), which is the time from aortic valve closure to mitral valve opening.\nCalculate LV isovolumic contraction time (IVCT), which is the time from mitral valve closure to aortic valve opening.",
    "Use Tissue Doppler at the septal side of the mitral valve annulus in a four-chamber view to measure the peak myocardial relaxation velocity in the early diastolic filling (e') and late diastolic filling (a'), as well as the peak systolic myocardial contraction velocity (s') (Figure 4C and Table 1). Press the Cine Store button to record the data.\nCapture the modified PLAX view to examine the left anterior descending coronary artery.\n\t\nUse a modified PLAX view15, moving the transducer laterally and tilting the beam toward the anterior (Figure 5A).\nMove the probe and use color Doppler to visualize the origin of the left main coronary artery (LCA) that generates from the aorta. Identify the LAD artery that generates from the LCA and runs between the left ventricular anterior wall and the right ventricular outflow tract16,17. In this position, apply PW Doppler to measure the LAD flow (Figure 5B). Press the Cine Store button to record the data.\nCalculate the following LAD coronary artery flow parameters (Figure 5C and Table 2): peak coronary flow velocity (CFV), mean CFV, and velocity-time integral (VTI).\n\t\tNOTE: All these parameters are measured at a basal isoflurane concentration of 1.5% (baseline).\nIncrease the isoflurane concentration to 2.5% and wait for 5 min to achieve maximal flow (Figure 5C). Press the Cine Store button to record the data. Calculate CFR as the ratio of diastolic peak CFV at maximal flow to diastolic peak CFV at baseline18,19,20 (Table 2):\n\t\tCFR = diastolic peak CFV (2.5%) / diastolic peak CFV (1.5%)\n3. Post-imaging animal monitoring and care\nAfter completing the echocardiographic imaging, carefully clean the pup and allow it to recover from the anesthesia for approximately 2 min.\nBefore returning the pup to its cage, smear the pup with the cage mother's bedding to prevent rejection or cannibalization.",
    "Observe the mother's behavior for about 30 min after the procedure. If aggressive behavior is observed, euthanize the pup following the animal procedure guidelines.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}