{
  "id": 6749,
  "origin_website": "Bio",
  "title": "CRISPR-Cas9 Genome Editing of <em>Plasmodium knowlesi</em>",
  "procedures": [
    "Cloning of pCas9/sg plasmidChoose guide sequence in the gene of interestFind PAM site (NGG) in the gene region that is going to be deleted/replaced. The positioning of the PAM site will vary depending on the goal. For knock-out or replacement studies it can be placed anywhere within the deleted/replaced region. For tagging studies the guide RNA sequence should cross the position of tag insertion.Determine off- and on-target scores of the guide sequence (N20 upstream of the NGG site) with CRISPR software (e.g., Benchling, Protospacer). Choose one or multiple guide sequences with off-target scores < 0.03. The positioning and off-target scores should be your overriding factors when deciding on a guide sequence. We recommend avoiding extremely AT-rich sequences. The on-target scores are normally determined in the context of other species, and in our experience do not correlate well with success, so whilst they should be considered, the other criteria should be prioritized.Design In-Fusion oligos for integration of the target sequence into the pCas9/sg plasmidForward oligo: 5′-TTACAGTATATTATT(N20)GTTTTAGAGCTAGAA-3′Reverse oligo: 5′-TTCTAGCTCTAAAAC(N20)AATAATATACTGTAA-3′The schematic in Figure 1 depicts the insertion of the guide sequence into the pCas9/sg plasmid.Linearize 2 μg pCas9/sg plasmid with 1 μl BtgZI enzyme and 5 μl cut smart buffer in 50 μl reaction volume for at least 2 h at 60 °C and clean up with QIAquick PCR Purification kit. Confirm linearization by running on 0.8% agarose gel. Dilute linearized plasmid to 50 ng/μl.Anneal guide oligosPrepare oligo suspensions of 100 μM and mix 10 μl of each (forward and reverse oligo) with 2.2 μl NEB2 buffer in a 1.5 ml reaction tube.Incubate in heat block for 10 min at 95 °C. Move heat block on ice and let cool down. (It takes approximately 1 min for the block to cool down.) From now on, always keep the reaction tube on ice.",
    "Dilute annealed oligos 1:200 to 0.5 μM with cold EB buffer from the QIAGEN kit (1 μl of annealed oligos to 199 μl EB buffer).Prepare In-Fusion reactionMix 1 μl of linearized plasmid (50 ng), 1 μl of diluted annealed oligos, 2 μl H2O and 1 μl In-Fusion buffer on ice.Incubate for 15 min at 50 °C.Transformation of pCas9/sg_guideAdd 5 μl of In-Fusion reaction to 50 μl of XL10 gold ultracompetent cells or alternative cells, for example StellarTM competent cells (Clontech).Incubate on ice for 30 min.Apply heat shock according to the manufacturer’s instructions. For XL10 gold cells this is 30 s in a heat bath at 42 °C.Incubate reaction on ice for 2 min.Add 200 μl of LB-media and incubate for 20 min at 37 °C with 350 rpm shaking.Plate reaction out on agar plates with 0.1 μg/ml ampicillin and incubate overnight at 37 °C.Confirm insertion of N20 guide sequence into pCas9/sg plasmidInoculate a colony in 5 ml LB-media with 0.1 μg/ml ampicillin and incubate overnight at 37 °C.Purify plasmid with Mini-prep kit.Sequence at least two plasmids (efficiency typically between 50 and 100%) with oligo 5′-CATTGTTCCCCCCTTTGTTTTGCAAG-3′ to confirm insertion.Purify plasmid for parasite transfectionInoculate 250 ml LB-media with 0.1 μg/ml ampicillin and incubate overnight at 37 °C.Purify plasmid with Midi-prep kit. The yield should be at least 30 μg in order to have enough plasmid for one parasite transfection.Precipitate plasmid by mixing with 0.1 volume of 3 M NaAc and 2 volumes of ice-cold 100% ethanol and incubate for at least 30 min at -20 °C.Spin down plasmid for 30 min at 4 °C and 15,871 rcf. Wash pellet twice with 700 μl 70% ethanol, each time spin down pellet for 15 min at 4 °C and 15,871 rcf.",
    "Dry plasmid pellet in sterile laboratory cabinet and resuspend with 10 μl sterile TE buffer.Measure DNA concentration.Keep plasmid at 4 °C until transfection.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200218/20200218172420_3157.jpgFigure 1. In-Fusion cloning of guide sequence into pCas9/sg plasmid. BtgZI cleaves outside of its recognition site. Two BtgZI sites (green) are used to linearize the plasmid and remove the recognition sites. Oligos for In-Fusion cloning are generated by using 15 bp homology regions of either side of the integration site, flanking the 20 bp upstream of the NGG site within the target gene. Gray lines indicate sequence homology.Generating PCR template DNAGenerating oligosChoose oligos to amplify homology regions (HRs) up- (product 1, oligo5 + oligo2) and downstream (product 2, oligo3 + oligo6) of the guide sequence (double-strand break) of at least 500 bp length each, but ideally 800 bp. If possible, avoid long poly-A or T tracts.Add an adaptor sequence of the DNA to be integrated (this could be a tag or a whole expression cassette) to oligo 2 and oligo 3 of ~20 bp (Tm of at least 56 °C).Choose oligos at least 50 bp upstream of the 5′HR and 50 bp downstream of the 3′HR (oligo1 and oligo4), these will allow you to carry out the fusion reaction as a semi-nested PCR, this is critical to ensure minimal background products and sufficient yield.Choose oligos to amplify the DNA sequence to be integrated (product 3, oligo7 + oligo8).Amplify 5′HR (product 1, oligo1 + oligo2), 3’HR (product 2, oligo3 + oligo4) and DNA sequence to be integrated (product 3, oligo7 + oligo8). Run each PCR in duplicate with a total volume of 25 μl according to the user manual. For CloneAmp Hifi PCR Premix this is 32 cycles of:table:",
    "﻿0,1,2\n98 °C,10 s,Denaturation\n55 °C,15 s,Annealing\n72 °C,5 s/kb,Extension",
    "Run on agarose gel and gel purify.Combine product 1 and product 3 by PCR (oligo5 + oligo8). Allow 15 s/kb during the extension step. Run on agarose gel and gel purify.Example: for 25 μl PCR use: 12.5 μl CloneAmp Premix, 0.5 μl fwd oligo, 0.5 μl rev oligo, 1 μl product 1, 1 μl product 2 and 10 μl H2O.Combine product 1/3 and product 2 by PCR (oligo5 + oligo6). Again allow 15 s/kb during the extension step. Run at least 6x 50 μl reactions of this final PCR to yield 40 μg of DNA. Note that whilst it sometimes is possible to simultaneously fuse all three products in a single reaction, splitting this into two steps increases robustness and yield so we recommend this as default.Without purification (to avoid loss of DNA) precipitate DNA, wash and dry as described for pCas9/sg plasmid. A schematic of the 3-step PCR for generating template DNA is shown in Figure 2.Notes:If the inserted DNA sequence is a small tag (like hemagglutinin tag) the whole tag sequence can be added as adaptors in oligos 2 and 3 and only two PCR steps are needed to fuse 5′HR and 3′HR. If the aim is to knock-out a gene, homology regions targeting the 5′ and 3′ UTRs can simply be fused together (or with a short intervening “barcode” or linker) to create a PCR knockout construct. If there is no PAM site located close to the C- or N-term of the gene of interest, a PAM site further away can be chosen but part of the sequence needs to be recodonized to avoid repair of the locus without modification (see example in Figure 3).",
    "If larger volumes of the template DNA is needed, or if the sequence needs to be confirmed by sequencing, the final PCR can also be integrated into a plasmid (e.g., by TA cloning into pGEM).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200218/20200218172456_3175.jpgFigure 2. Schematic of 3-step PCR for generating template DNA. The genomic sequence of the gene of interest is used to design oligos for amplification of homology regions flanking the sequence to be deleted/replaced (red). Separately, oligos are designed to amplify the sequence to be introduced (green). In three PCR steps the template DNA for homogous repair is produced. In the first PCR step, three products are generated. In the second PCR step, products 1 and 3 are fused and in the third PCR, products 1/3 and 2 are fused. ol = oligo.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200218/20200218172532_7242.jpgFigure 3. Schematic showing generation of template DNA with recodonization. In this example the aim is to tag the C-terminal end of a gene of interest (purple), while the chosen PAM site is within the 3′ end of the gene and the 20 bp guide sequence would not be disrupted by introduction of a tag sequence. The PAM site must therefore be deleted by introducing a recodonized sequence (blue) that runs from the PAM site up until the tag sequence (to ensure there is no chance of integration between mutated PAM site and tag). In this case the tag is a short sequence like a hemagglutinin-tag or spot-tag (green). The PCR oligos are designed as described before with the difference that at least two reverse oligos for HR1 are needed. In the first reverse oligo (oligo 2.1), the 5′ end contains the recodonized sequence (blue), the second oligo (oligo 2.2) binds within the recodonized sequence and contains the tag sequence in its 5′ end.",
    "Template DNA for the first PCR is genomic DNA, the template for second PCR is product 1.1 and the template for the final PCR are product 1.2 and product 2.Synchronize P. knowlesi parasites via Nycodenz purificationTransfer 5 ml of 55% Nycodenz working solution to a 15 ml conical tube and warm up to RT.Note: 1 Nycodenz tube is needed for 1 ml of red blood cells (50 ml culture with 2% hematocrit). Centrifuge down high parasitemia (4-10%) P. knowlesi culture at 900 x g for 4 min at RT.Resuspend parasite pellet at 50% hematocrit in RPMI.Carefully layer 2 ml of this culture above the 5 ml Nycodenz.Centrifuge at 900 x g for 12 min with low brake/acceleration. Uninfected red cells and ring-stage parasites will sink to the bottom and schizonts form a layer on top of the Nycodenz.Transfer top layer schizonts (brownish color) to a new conical tube and wash with RPMI to remove Nycodenz (see Figure 4).Incubate schizonts with 1 μM Compound 2 for 2-3 h. Compound 2 is a PKG inhibitor that reversibly blocks merozoite egress. This step is optional but will help to maximize yield of late schizonts and also provides the user with some flexibility in timing for subsequent steps. Viability of parasites will dramatically decline for incubations longer than 3 h.Wash off Compound 2 and transfer schizonts back to culture (with 2% hematocrit red blood cells).Note: To get parasites even more synchronous undertake the steps above and then let them invade red blood cells for 30 to 60 min and Nycodenz purify again, only this time keep ring stage parasite pellet and remove schizonts.",
    "You can slow down the maturation of the parasites by leaving them at RT for several h in order to get them to the schizont stage at a convenient time for the next purification/ transfection.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200218/20200218172605_1286.jpgFigure 4. Schizont enrichment with NycodenzTransfect P. knowlesi parasites with CRISPR constructsFor transfection of the parasites, DNA and blood need to be prepared. This can be done simultaneously.Blood: Spin down fresh Duffy positive red blood cells (stored for less than 1 week) and transfer 200 μl of packed cells to a new 1.5 ml reaction tube. Add 500 μl of complete media and incubate at 37 °C with shaking at 550 rpm (in, for example, an Eppendorf Thermomixer).DNA:Combine ~20 μg of the pCas9/sg_guide plasmid with ~40 to 60 μg of template DNA (~1:20 molar ratio) and adjust to a final volume of 10 μl with sterile TE buffer.Mix 10 μl DNA with 100 μl of supplement P3 transfection buffer (from the Lonza kit).Parasites:Purify P. knowlesi parasites with Nycodenz from a synchronous late-stage schizont (24-26 h old) culture and incubate for 2 h with 1 μM Compound 2. The best indicator of schizont age in P. knowlesi is the presence of a single compact pigment granule and full segregation of merozoites. The compact pigment granule forms approximately 30-45 min prior to egress. Maximizing the proportion of these stages will drastically improve transfection efficiency.After Compound 2 incubation of schizonts, wash and transfer 10 to 20 μl schizonts (∼1-2 x 108 cells) to a new 1.5 ml reaction tube. Leave them with at least 100 μl of complete media at 37 °C for 15 to 20 min.Add program to Amaxa 4D-Nucleofector X or choose existing experiment with the following setting: Pulse code: FP 158, Solution: Primary Cell P3, Volume: 100 μl.Immediately after the incubation from Step D1c.",
    "ii spin down schizonts for 1 min at 845 rcf and remove culture media.Transfer 100 μl of the DNA/transfection buffer to the schizont pellet and gently mix.Transfer 100 μl of the schizont/buffer mix to a nucleofection cuvette and move to the Amaxa 4D-Nucleofector X. Press start and wait until the screen shows green signal to indicate successful transfection. Loading more than 100 μl of mix to the cuvettes can increase probability of error messages indicating partial (“yellow”) or complete (“red”) pulse failure.Immediately after transfection, transfer schizonts with pastette (included in Lonza kit) to the prepared warm red blood cells. Rinse out cuvette with blood/media to avoid loss of schizont material.Incubate schizonts for 20-30 min at 37 °C and shaking at 550 rpm to allow invasion, before moving the culture to a 6-well plate and add 4.5 ml of complete media.Note: In order to determine the transfection efficiency an episomal eGFP plasmid (e.g., PkconGFP) should be transfected as a control. The day after transfection change media daily for 5 days with the addition of positive selection drug Pyrimethamine (100 nM final concentration).Confirm transfection efficieMicroscopy (if fluorescent episomal plasmid was transfected)Around 24 h post-transfection stain 30 μl of culture with 30 μl of 4 μg/ml Hoechst in PBS for 15 min at 37 °C.Dilute with 100 μl PBS and apply 100 μl of the dilution to a microscopy channel slide (ibidi).Count 20 to 50 parasites with defined Hoechst signal and check how many of these also show fluorescence of the episomal plasmid. Transfection efficiencies are usually between 5 and 40%.Example fluorescent microscopy images are shown in Figure 5.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200218/20200218172635_6566.jpgFigure 5. Microscopy image of eGFP positive parasitesDiagnostic PCRChoose the forward oligos at least 100 bp outside the repair template HRs in the genome.",
    "Choose one reverse oligos inside the wild-type locus and one reverse oligo inside the modified locus.Note: The product must be unique to integrated parasites and should not also amplify out the transfected template DNA. As large quantities are used in transfections the construct can remain detectable for some time after transfection resulting in a potential false-positive PCR result. Additional control PCRs should be designed which provide a product only in wild type parasites and also in an unrelated control locus (to demonstrate there are no issues with the gDNA). Spin down 1 ml of parasite culture, wash blood pellet with RPMI or PBS and store pellet at -20 °C or immediately use for gDNA extraction (Dneasy blood and tissue kit).Set up six PCR reactions to determine wild-type locus, modified locus and an independent locus of wild-type parasites and transfected parasites. Run on agarose gel as shown in Figure 6.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200218/20200218172701_4531.jpgFigure 6. Diagnostic PCRs to confirm integration. The agarose gel is an example of a diagnostic PCR in order to confirm wild-type locus, integration locus and of an unrelated/independent locus. The wild-type forward oligo should be outside of the repair template (~100 bp upstream of the 5′ homology region or downstream of the 3′ homology region). The reverse oligos should be specific for wild-type or integration. The genomic DNA is from wild-type parasites (WT) before transfection or when parasites reappeared after transfection (TF).Note: Integration can be detectable as early as two days after transfection, but PCR works more reliable with higher DNA concentrations, therefore samples should be taken when drug resistant parasites are easily detectable by Giemsa smear in the cultures (> 0.2% parasitemia). SequencingAmplify the modified gene locus by PCR and confirm by sequencing.",
    "Remove Cas9/sg_guide plasmid containing parasites with negative selectionAdd 1 μM Ancotil (5-Fluorocytosine) for 7 days to parasite culture of ~0.5% (parasite should be confirmed integration positive and are stably growing in culture).Note: Without positive selection, parasites lose plasmid very quickly, therefore no big drop in parasitemia is expected. Clone out parasites by limiting dilution (Moon et al., 2013).Confirm integration in several clonal lines by PCR or microscopy as described above.Confirm removal of Cas9/sg_guide plasmid in integration positive clonal lines by treating parasites for 5 days with Pyrimethamine as described before. Keep culture for another week to test if parasites reappear.Note: Prepare cryo stocks of transfected parasites (bulk culture) and clonal lines."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}