{
  "id": 18256,
  "origin_website": "Jove",
  "title": "Reproducible Motor Deficit Following Aortic Occlusion in a Rat Model Of Spinal Cord Ischemia",
  "procedures": [
    "This protocol was approved by the Institutional Animal Care and Use Committee of Seoul National University Bundang Hospital. Animal care and experiments were conducted according to the United States National Institutes of Health Guide for the Care and Use of Laboratory Animals.\n1. Surgical Preparation\nPrior to surgery, flush the catheters with sterile saline to ensure patency.\nPut a heating blanket on the operating table, and cover the table with a sterile drape.\nPlace Male Sprague−Dawley rats (270-330 g) in an acrylic box with 3.0%-4.0% of isoflurane in 100% oxygen.\nApply lubricant to the rat's eyes.\nPlace the rat on the operating table in the supine position, and maintain anesthesia using a facial mask with continuous administration of inhaled isoflurane (1.0%-2.5 vol.%).\nPlace a rectal probe to monitor and maintain body temperature between 37.0-38.0 °C.\n2. Femoral Artery Catheterization\nGently scrub the right inguinal area using Betadine and 70% ethanol.\nMake a 2-cm horizontal skin incision using scissors on the right inguinal area.\nUsing a retractor, expose the surgical field.\nDissect the femoral artery from the surrounding vein and nerve. Isolate a 1-cm section of the artery using curved forceps and blunted forceps.\nUsing a 4.0 black silk suture, place a loose tie on both the proximal and distal ends of the artery to maximize the exposure.\nMake an incision on the femoral artery using micro-scissors.\nInsert a 2-Fr. balloon-tipped catheter into the femoral artery using micro-forceps. Secure the catheter to the vessel about 1 cm from the catheter head with the proximal ligature, and then tie the distal ligature.\n3. Carotid Artery Catheterization\nScrub the right anterior neck using betadine and 70% ethanol, and then make a skin incision.",
    "Using a retractor, expose the surgical field. Isolate a 1-cm section of the artery, and tie it loosely using a silk suture on both the proximal and distal ends of the artery to maximize the exposure.\nPuncture the carotid artery using a 24 G intravenous catheter, and advance the proximal 1 cm of the catheter towards the heart.\nSecure the catheter with the proximal ligature, and then tie the distal ligature.\nUsing a 3-way stopcock, connect the distal end of the catheter to the saline-filled micro-tube and external reservoir.\n4. Tail Artery Catheterization\nScrub the ventral area of the tail using betadine and 70% ethanol, and make a 2-cm skin incision.\nDissect the tail artery from the surrounding structures and isolate a 1 cm section of the artery using curved forceps and blunted forceps.\nUsing a 4.0 black silk suture, place a loose tie on both the proximal and distal ends of the artery to maximize the exposure.\nPuncture the tail artery using a 24 G intravenous catheter, and advance the catheter into the artery.\nSecure the catheter to the vessel (about 1 cm from the catheter head) with the proximal ligature, and tie the distal ligature.\nConnect the distal part of the catheter to the arterial pressure monitoring device.\n5. Induction of Spinal Cord Ischemia\nAfter catheterization is complete, advance the 2 Fr. balloon-tipped catheter into the descending thoracic aorta so that the tip of the catheter reaches the left subclavian artery.\nInsert to a depth of 10 cm from the insertion site.\nInject 150 units of heparin at a concentration of 100 units/mL into the carotid catheter.\nInflate the catheter balloon with 0.05 mL of saline.\nSimultaneously, drain the blood into the external blood container from the carotid artery to regulate the proximal arterial pressure to 80 mmHg.",
    "Connect the arterial pressure monitoring system to the remaining lumen of the 3-way stop cock, and control the amount of blood drainage with monitoring the arterial pressure.\nConfirm the success of aortic occlusion by an abrupt decrease and continuous loss of distal arterial pressure.\nAfter aortic occlusion of 9, 10, or 11 min, deflate the Fogarty catheter balloon, and reinfuse the drained blood.\n6. Post-surgical Care and Neurologic Assessment\nWhile monitoring the arterial pressure through the tail artery, remove the catheters from the femoral and carotid arteries and close the wounds with silk sutures.\nAfter confirming that the arterial pressure is recovered to the normal range, remove the catheter from the tail artery and close the wound.\nAfter recovery from the anesthesia, return the rat to its cage.\nAssess hind limb motor function at 24 h after surgery using the motor deficit index (Table 1). The motor deficit index is defined as the sum of the ambulation score and the placing/stepping reflex score. A motor deficit index of 6 indicates the maximum deficit.\n7. Histopathologic Evaluation\nAfter the neurologic assessment, anesthetize rats with mask-delivered isoflurane, sacrifice them by transcardial perfusion with 100 mL of heparinized saline under anesthesia, and extract the spinal cord.8\nEmbed the cord sections from the level of lumbar vertebrae 3-5 in paraffin.\nStain transverse sections with hematoxylin and eosin (H & E).\nObserve the motor neuron injury under a microscope.9\n8. Statistical Analysis\nPerform statistical analysis using Statistical Package for the Social Sciences version 20. The motor deficit index of the three groups was compared using the Kruskal-Wallis test, followed by a Mann-Whitney U-test. A P-value <0.05 was considered statistically significant.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}