{
  "id": 17503,
  "origin_website": "Jove",
  "title": "A Simplified Stepwise Approach to Echo Guidance during Percutaneous Mitral Valve Repair",
  "procedures": [
    "The protocol follows the guidelines of our's institution's human research ethics committee.\n1. Evaluation before intervention\nExclude pericardial effusion before transseptal puncture. If a small pericardial effusion is present, measure the maximal end-diastolic echolucent space in a four-chamber (4Ch) view with a focus on the right ventricle (RV), a mid-oesophageal right ventricular inflow-outflow view, and a long-axis (LAX) view.\nEvaluate the pulmonary venous flow pattern with pulse wave doppler (PW) in the left upper pulmonary vein (LUPV) and exclude thrombus formation in the left atrial appendage (LAA). Show the short axis (SAX) view with focus on the LAA, sweep then at 40-60° and rotate the probe anti-clockwise to show the LUPV. Assess the flow in the right upper pulmonary vein (RUPV) by sweeping at 90-110° (Figure 1 and Supplementary Figure 1).\nimgsrc://cloudfront.jove.com/files/ftp_upload/62053/62053fig01.jpg\nFigure 1: Modified SAX view: PW flow in the left upper pulmonary vein Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62053/62053fig01large.jpg]\nEnsure hemodynamic state is the same during pre- and post-procedural evaluation.\n\t​NOTE: AS MR is a dynamic valve disease, regurgitation may seem less severe under general anaesthesia. In this case, consult the operator and increase the afterload and/or the preload.\nFind the best intercommissural view (50-70°). Take a perpendicular view (X-plane) in the three segments with and without color doppler and measure the length of the posterior mitral leaflet (PML). Then, check the leaflet morphology again (Figure 2 and Supplementary Figure 2).\nimgsrc://cloudfront.jove.com/files/ftp_upload/62053/62053fig02.jpg\nFigure 2: 2D biplanar view of the MV with color doppler: medial insufficiency jet Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62053/62053fig02large.jpg]\nAssess the transmitral pressure gradient with continuous wave doppler (CW) in the long axis view (120-140°).\n\t​NOTE: A mean pressure gradient (MPG) > 5 mmHg is a relative contraindication for PMVR.",
    "Take a 3D dataset with color doppler or a wide-sector zoom image with color and measure the 3D-vena contracta (3D-VCA) (Figure 3).\nimgsrc://cloudfront.jove.com/files/ftp_upload/62053/62053fig03.jpg\nFigure 3: Multiplanar reconstruction of the 3D dataset with color doppler: 3D-Vena contracta Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62053/62053fig03large.jpg]\nWithout color, use the 3D volume to measure the mitral valve area (MVA) (Supplementary Figure 3).\n\tNOTE: An area < 4 cm2 is a relative contraindication, an area < 3 cm2 an absolute contraindication to perform the procedure. Otherwise assess the MVA in the transgastric basal SAX view.\nShow the 3D en-face surgical atrial view (aortic valve at 12 o'clock) of the mitral valve.\n\tNOTE: The segments of the valve are named \"lateral\" for the segments 1 and \"medial\" for the segments 3. The sequence of the segments in the en-face surgical view, is inverse to the sequence in the commissural view. Perform a 180° clockwise rotation into the 3D en-face surgical view (aortic valve at 6 o'clock), that will result in an equal sequence of segments in both views (Figure 4 and Figure 5).\nimgsrc://cloudfront.jove.com/files/ftp_upload/62053/62053fig4v2.jpg\nFigure 4: Wide sector zoom image: 3D en-face surgical atrial view (aortic valve at 12 o'clock) Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62053/62053fig04large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/62053/62053fig5v2.jpg\nFigure 5: Wide sector zoom image: 3D en-face atrial view (aortic valve at 6 o'clock) Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62053/62053fig05large.jpg]\nFinally, take a bicaval view (90-110°) with X-plane, to show the aortic valve (AV), for the transseptal puncture.\n2. Strategy\nDiscuss the strategy with the operator before inserting the steerable guide catheter (SGC) and the clip delivery system (CDS) into the left atrium.",
    "Evaluate a one device strategy if the orifice is < 1 cm wide and position the clip directly above the regurgitation jet if the orifice is circular.\nEvaluate the implantation of ≥ 2 clips in case of large elliptic or multiple jets. Implant the device starting medially of the regurgitant orifice, as the positioning of a second device is often easier when the first has been implanted in this way, rather than after starting laterally (Supplementary Figure 4).\n3. Transseptal puncture\nShow a bicaval view combined with a SAX view. Ensure the AV is visible, to avoid aortic injury.\nMake sure the puncture site is slightly superior and posterior (Figure 6).\nimgsrc://cloudfront.jove.com/files/ftp_upload/62053/62053fig06.jpg\nFigure 6: 2D biplanar view: transseptal puncture Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62053/62053fig06large.jpg]\nChoose a puncture height of 4-5 cm in case of degenerative MR (e.g., prolapse) and of > 3.5 in functional MR. Avoid a patent foramen ovale, as the entry is far too anterior.\nOnce the transseptal needle leads to tenting of the interatrial septum, measure the puncture height in the 4Ch view in mid-systole (Supplementary Figure 5).\n\tNOTE: In patients with large atria, if the puncture site is too posterior the tenting cannot be visualized in the 4Ch view. In this case, retroflex and insert the probe deeper into the oesophagus.\nAfter transseptal puncture, always exclude pericardial effusion in the 4Ch view.\nShow a SAX view with a focus on the LAA and pulmonary vein to visualize the entering of the stiff guidewire into the LUPV.\n4. Introduction of the SGC into the LA\nVisualize the tenting and advancement of the SGC with the dilator in a SAX view with continuous 2D-echocardiography and fluoroscopic guidance to avoid injuries to the left atrial wall.",
    "NOTE: The tip of the SGC is defined by a radiopaque and echo bright double ring (Supplementary Figure 6).\nShow the operator the SAX view and the bicaval view (90-120°) to position the SGC in the direction of the left ventricle (LV).\n5. Advancement of the CDS into the LA\nTake a 3D-volume including the interatrial septum, the left lateral ridge and the MV and ensure that the left lateral ridge is visible because protrusion of the CDS is common (Figure 7).\nimgsrc://cloudfront.jove.com/files/ftp_upload/62053/62053fig07.jpg\nFigure 7: Wide sector zoom image: SGC in the LA including the interatrial septum, the left lateral ridge and the MV Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62053/62053fig07large.jpg]\nOtherwise choose the SAX view and the LAX view (X-plane) to ensure, the CDS does not have contact with the ridge and the LA-wall.\n\tNOTE: The operator may ask the imager to show the interatrial septum and pull back the SGC a few millimetres to bypass the ridge. If the double ring in 3D cannot be visualized, switch to 2D and show the SGC in the SAX view.\nCheck that the CDS is positioned perpendicularly to the coaptation line to guarantee a correct trajectory.\n\t\nShow the intercommissural view in 2D at ca. 60° to display the medial - lateral plane and the LAX view at 120-140° to identify the anterior - posterior plane of the MV (Supplementary Figure 7).\nAlternatively optimize the medial, lateral, anterior, and posterior positioning of the CDS in the 3D en-face view (Supplementary Figure 8).\n6. Orientation of the device above and below the MV\nTake the 3D en-face view to show a perpendicular positioning of the arms to the coaptation line.",
    "In the event of poor image quality, show an intercommissural view combined with a LAX view (Figure 8 and Figure 9).\nimgsrc://cloudfront.jove.com/files/ftp_upload/62053/62053fig08.jpg\nFigure 8: 2D biplanar view of the MV: positioning of the device over the mitral valve Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62053/62053fig08large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/62053/62053fig09.jpg\nFigure 9: Wide sector zoom image: positioning of the device over the mitral valve Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62053/62053fig09large.jpg]\nNOTE: The clip arms are visible only in the LAX view.\nAdjust the intercommissural view angle for medially and laterally positioned devices to visualise the complete length of both arms. Sweep at ca. 30-45° for medially positioned devices and ca. 70-90° for laterally positioned devices.\nChoose the intercommissural view combined with a LAX view to visualize the advancing of the CDS into the LV.\nEnsure the CDS is placed just a few millimetres below the MV.\nVerify in the 3D en-face view that the clip arms are still in the planned position, as a rotation of the clip while crossing the valve is frequent.\n\tNOTE: If the position of the clip arms has changed, clockwise or anticlockwise rotation will be performed to obtain symmetric grasping. Be careful during this manoeuvre to minimize chordal and subchordal entanglement.\nIf gross reorientation of the device is necessary, show the intercommissural view with X-plane to visualize the inversion of the clip that will be retrieved into the LA.\n7. Grasping of the mitral leaflets and assessment of MR before and after clip deployment\nRecord the grasping of the leaflets in the intercommissural view combined with the LAX view (X-plane) or in the LAX view only (Supplementary Figure 9).\nAsk the anaesthesiologist to perform a breath-hold manoeuvre to reduce shifting during ventilation and to facilitate the grasping of the leaflets.",
    "Ensure continuous visualisation of leaflet insertion to avoid rolling of the leaflets or the chordae.\n\tNOTE: Grasping a rolled leaflet or a chorda may result in a partial leaflet detachment and/or an aggravation of the MR.\nCarefully evaluate the regurgitation reduction before clip deployment. Ensure both, operator and imager analyse this crucial step.\n\t\nRotate the TEE probe medially and laterally to the clip or use X-plane with color doppler to find eccentric jets close to the clip (Supplementary Figure 10).\n\t\tNOTE: Due to shadowing artifacts caused by the CDS underestimation of the MR may occur. Insert the probe deeper into the esophagus or show the transgastric view to visualize the residual insufficiency jets without shadowing artifacts.\nEvaluate the PW flow in the pulmonary veins.\n\t\tNOTE: if a previous systolic flow reversal changes into a systolic dominant pattern, a relevant reduction has probably occurred.\nMeasure the MPG across the mitral valve.\n\t\t​NOTE: A gradient > 5 mmHg is a relative contraindication for clip deployment (Supplementary Figure 11 and Supplementary Figure 12).\nUse the 3D en-face view of the MV or a transgastric SAX view of the MV to show the double orifice (Figure 10).\nimgsrc://cloudfront.jove.com/files/ftp_upload/62053/62053fig10.jpg\nFigure 10: Wide sector zoom image: double orifice of the MV after device deployment Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62053/62053fig10large.jpg]\nFinally, if the result is satisfactory, check leaflet insertion in 2D.\nAfter releasing the clip from the CDS, repeat the last five steps.\n\tNOTE: Due to the tension of the system on the MV, the residual insufficiency jets after releasing the device may be aggravated.\nShow when the delivery catheter tip is retrieved from the SGC in the LAX view with X-plane and ensure that the spike avoids contact with the LA (Supplementary Figure 13).\n8. Final MR assessment",
    "Show the intercommissural view with color doppler in combination with perpendicular X-planes in the residual insufficiency jets if present.\nCalculate the 3D-VCA in a 3D-volume. NOTE: usually the orifices are not in the same plane. In this case measure separated planimetries of each orifice in the appropriate planes (Supplementary Figure 14).\nEvaluate once again the pulmonary vein flow and the mean gradient across the mitral valve.\n\tNOTE: continuous LA pressure monitoring may be a useful tool during transcatheter mitral valve repair.\nFinally, show the 3D en-face view of the mitral valve.\n9. Implantation of additional devices\nEnsure MR reduction is sufficient.\n\tNOTE: If the result is not satisfactory, evaluate the implantation of additional devices.\nEnsure that the additional device does not contact the implanted device diving into the left ventricle.\n\tNOTE: fluoroscopy is essential to show the real distance between the clips.\nShow the 3D en-face view to visualize the commissural line, as it might be deferred after implantation of the first clip.\nRepeat the five steps as explained in point 7.4 to evaluate MR after grasping the leaflets with the additional clip.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}