{
  "id": 7112,
  "origin_website": "Bio",
  "title": "Isolation of Murine Primary Aortic Smooth Muscle Cells",
  "procedures": [
    "imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3907/bioprotoc-11-03-3907-g002.jpgFigure 2. Timeline of the procedure Preparing the mouseSet up a surgery table with the above-described equipment.Euthanize the mouse by cervical dislocation. Alternative methods may be used granted euthanasia is obtained.Spray the surfaces you will work on with 70% ethanol. Spray the abdominal region of the mouse with ethanol.Note: The ethanol does not only sanitize the mouse’s abdominal region it also fixes its fur. This avoids having hair in the preparation field. Place the mouse on a surgical board in a supine position with upper and lower extremities stretched outwards.Use four fixation needles to secure the position of the animal’s extremities.Preparation and extraction of the murine aorta (see Figure 1 Steps A+B)Open the fur and skin layer of the mouse using forceps and scissors.To do so incise in the median line of the mouse, roughly above the xiphoid and enlarge your initial incision into both directions up and down.Leave the thoracic and abdominal cavity closed and dissect all skin layers exposing the peritoneum and thoracic region.Now open up the abdominal cavity using forceps and scissors. Strongly lift the peritoneal layers to make sure you do not cut into the intestine.Note: For a clean skin dissection as well as the opening of the thoracic and abdominal cavity, it is crucial to create sufficient tension on the tissue with the forceps to cleanly incise. Especially while opening up the abdominal cave you can hereby avoid to puncture the intestine and thereby contaminate your samples with intestinal bacteria. After that, open up the thoracic cavity by dissecting the diaphragm, be careful not to puncture the heart during dissection of the diaphragm.Remove the lung. Grab lobe by lobe and excise with a scissor.Remove the abdominal organs to gain sight onto the aorta.",
    "Initially do not use a scalpel or scissors for the removal of the abdominal organs. Take rough tissue instead and smoothly spread away the intestine and the other organs to both sides.Note: Once the organs are located outside the peritoneal cavity, on both sides of the mouse, you can use a scalpel or scissors to strip away the organs from their connecting tissue and meso. Even if you lacerate one of the intestinal or other abdominal organs in this step you avoid contamination of your future samples because of the previous steps. Cut both femoral arteries open to allow blood and solution to flow out during perfusion.Cannulate left ventricle and perfuse with 10 ml of ice cold PBS + P/S/F.Now extract the murine aorta (see Video 1). In order to resect the aorta as clean as possible hold it with the forceps at the distal end and firmly lift it up. Then cut the underlying tissue which should be under tension at any time.Note: Dissection is most difficult at the branches of the renal arteries and the passing point of the aorta through the diaphragm as the vessel is attached to its surrounding tissue quite firmly at those areas. <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Aorta extraction. (This video was made at German Research Cancer Center Heidelberg according to guidelines from the German Cancer Research Center and Heidelberg University on Animal Care and approved by the Animal Research Ethics Board of German Cancer Research Center Heidelberg under protocol # DKFZ 244.)Cleaning and Cutting of the murine aortaPlace the extracted aorta on a 60 mm dish (use the top of the dish so that the sidewalls do not disturb your preparation actions) (see Figure 1 step C1).",
    "If possible use curved forceps and remove all the surrounding adipose and fibrous tissue and adventitia (see Video 2) (see Figure 3 for the final result).Note: The cleaning will be much easier in the thoracic part than in the abdominal of the aorta due to branch structure. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210204/20210204172443_7079.jpgFigure 3. Clean aorta after adventitia removal. The scale bar is 1 cm.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Cleaning Now place the cleaned aorta on a fresh 60 mm dish to cut it into small rings. We recommend using two scalpels for the cutting (see Video 3). Practice has shown that this method is superior to using one forceps and one scalpel regarding fineness of the cuttings (see Figure 1 step C2 and Figure 2).Add 2 ml DMEM+15% FCS+P/S/F (PenStrep, Fungizone) + collagenase (concentration 10 mg/ml, so in this case 20 mg) (see Figure 1 step D1 and Figure 2).Incubate overnight at 37 °C with 5% CO2 (see Figure 1 step D2).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 3. Cutting Cultivation of vascular smooth muscle cellsNext day: Pipette the medium containing the aortic tissue up and down and rinse the culture dish thoroughly. This helps to disrupt adhesive rings by shear forces.Transfer the media with the sample tissue into a 15 ml Falcon and centrifuge 5 min at 180 × g (see Figure 1 step D3).Discard the supernatant and resuspend the pellet with DMEM+FCS+P/S/F and plate it in a new cell culture dish (see Figure 1 step E1).Note: At this point, you might want to pool the cells from two to three murine aortas. The yield from one aorta should be enough for simple procedures such as qPCR or immunohistochemistry. However, we recommend pooling the extracted cells from at least two mice for more complex procedures that require a higher number of VSMCs.",
    "All pooled cells should be cultured in one dish together. To achieve the best results out of the following cultivation of the cells we recommend using a maximum dish size of 60 mm as the number of cells you will win by the extraction is not expected to be high enough for a 100 mm dish. Tissue culture dishes should be used to ensure adherence, extra coating of the dish is not necessary. Check after 3-5 days (see Figure 2) if vascular smooth muscle cells adhere to the bottom of the dish (do not change the dish or media at this point) (see Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3907/bioprotoc-11-03-3907-g004.jpgFigure 4. Cells after 4 days after isolation. It is visible how the cells start to detach from the aortic pieces. The scale bar is 100 µm.Change the medium (DMEM + 15% FCS) every 2 days and passage the cells only when confluence is achieved.Quality controlIn order to know whether the cells are in proper conditions, actin fibers can be stained. We will briefly describe a staining protocol for filamentous actin (F-actin) (see Figure 5).Seed the obtained vascular smooth muscle cells on glass cover slips in a 24-well format in DMEM with 15% FCS.2-7 days later, fix the attached cells with Histofix (or 4% paraformaldehyde) for 10 min at room temperature.Remove the Histofix by washing with PBS.To permeabilize, incubate cells with permeabilization buffer (see Recipe 2) for 10 min.Wash with PBS.To prevent unspecific binding of antibodies, block for 30 min with blocking buffer (see Recipe 3).Incubate the cells with Alexa FluorTM 488 Phalloidin (1:200) in blocking buffer for 1 h at room temperature in the dark.Note: From now on exposure to light should be reduced to the minimal possible extend to avoid photobleaching.",
    "Since most of the undesired cell types are present in the adventitia, the cells left in the media and intima, which is the part that is processed, will restrict to endothelial and smooth muscle cells (see Steps C1-C2). Endothelial cells need collagen coating to be able to adhere to the plate, considering that the aortas are incubated with collagenase, it would not be possible for the endothelial cells to adhere to the plate. Moreover, endothelial cells need a very special medium for their survival. It is extremely unlikely that they would be contaminating the culture after Step D5. However, if contamination would want to be evaluated cells could be stained with CD31 to detect endothelial cells. This single staining does not only function as a control of the cells’ state but also proofs purity of the culture. As the aorta was cleaned from all surrounding tissue (see Steps C1-C2) only VSMCs and endothelial cells are expected to be cultured. The endothelial cells will not survive the culturing as they would require certain conditions so purity is ensured by the cleaning step. Wash 3 × with PBS.Incubate with DAPI in PBS (final concentration 2 µM) for 10 min at room temperature.Wash 3 × with PBS.Mount coverslips on slides with fluorescence mounting medium. Store until analysis at 4 °C.Analyze staining at a fluorescent microscope, e.g., Zeiss Cell Observer (see Figure 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3907/bioprotoc-11-03-3907-g005.jpgFigure 5. Vascular smooth muscle cells stained for F-Actin by Phalloidin (green) and DAPI (blue). Scale bar: 50 µm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}