{
  "id": 5476,
  "origin_website": "Bio",
  "title": "Expression, Purification and Crystallisation of the Adenosine A<sub>2A</sub>  Receptor Bound to an Engineered Mini G Protein",
  "procedures": [
    "Expression of A2AR in insect cellsHuman A2AR, which was truncated to remove the flexible C-terminus (see Note 1) and contained the N154A mutation to remove a potential N-linked glycosylation site, was cloned into the transfer vector pBacPAK8, and baculoviruses were prepared using the flashBAC ULTRA system, following the manufacturer’s instructions. The A2AR construct contained a C-terminal 10x histidine tag to facilitate purification (see Note 2) and a TEV protease cleavage site to allow removal of the histidine tag (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170415/20170415004959_4532.jpgFigure 1. A2AR baculovirus expression construct. A2AR was cloned into the baculovirus transfer vector pBacPAK8 using BamHI and NotI restriction sites (underlined), and baculoviruses were prepared using the flashBAC ULTRA system. The construct consists of residues 1-308 of human A2AR followed by a TEV protease cleavage site (highlighted in green) and C-terminal 10x histidine tag (highlighted in red). A2AR contains the N154A mutation (highlighted in yellow) to remove a potential N-linked glycosylation site. Start and stop codons are shown in bold.Dilute T. ni cells (grown in ESF921 serum-free media) to 2,730 ml in a 5 L optimum growth flask at a density of 1 x 106 cells/ml, and incubate overnight at 27 °C, shaking at 124 rpm.Once the density reaches 3.3 x 106 cells/ml, add 150 ml of fetal bovine serum (final concentration of 5% v/v) and 120 ml of passage three A2AR baculovirus (final concentration of 4% v/v).Incubate for 65-72 h at 27 °C, shaking at 124 rpm.Harvest the cells by centrifugation at 5,000 x g for 10 min at 4 °C.Resuspend the cell pellet to a final volume of 180 ml in buffer A, add 4 protease inhibitor tablets and PMSF to give a final concentration of 1 mM. Flash freeze in liquid nitrogen and store at -80 °C.",
    "Insect cell membrane preparationA crude membrane preparation is performed, which retains all insoluble intracellular components, whilst removing soluble proteins. This type of membrane preparation helps to limit the loss of membrane fragments and maximise the recovery of A2AR. This protocol describes the membrane preparation from three liters of insect cell culture, which is sufficient for one A2AR purification. However, if necessary, two batches (six liters of culture in total) can be processed simultaneously using a single Ti45 ultracentrifuge rotor.Thaw the cell pellet from 3 L of insect cell culture in a water bath at room temperature.Add fresh PMSF to give a final concentration of 1 mM, transfer the solution to three Ti45 tubes and centrifuge at 158,000 x g (45,000 rpm) in a Ti45 rotor for 2 h at 4 °C. Make sure the tubes are filled correctly (to the neck), top up with buffer A if necessary. (see Note 3)Carefully remove the supernatant until level with the top of the pellet using a serological pipette (see Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170415/20170415010331_2735.jpgFigure 2. Illustration of the membrane pellet after ultracentrifugation. A diffuse layer, which contains a significant amount of A2AR, is observed on the surface of the membrane pellet after ultracentrifugation. It is important not to decant the supernatant, because this will remove the diffuse layer, resulting to a decreased yield of A2AR. Instead, the supernatant should be carefully aspirated using a serological pipette until level with the top of the membrane pellet (indicate by the dashed line).Add 25 ml of buffer A to each tube and break the pellet up into small pieces using plastic spatula.Homogenise the pellet using an ULTRA-TURRAX T25 homogeniser operating at 10,000 rpm until no lumps remain. This should take approximately 30 sec per tube.",
    "Top up the tubes with buffer A and centrifuge at 158,000 x g (45,000 rpm) in a Ti45 rotor for 2 h at 4 °C. (see Note 3)Remove the supernatant until level with the top of the pellet using a serological pipette (see Figure 2).Resuspend the pellet with the buffer that remains in the tubes using a plastic spatula followed by an ULTRA-TURRAX T25 homogeniser. Do not exceed a final volume of 160 ml. Aliquot the membrane suspension into 50 ml tubes, flash freeze in liquid nitrogen and store at -80 °C. Membranes can be stored under these conditions for up to three months.Purification of A2ARA2AR is purified in decylmaltoside (DM), in the presence of the agonist NECA, using a protocol adapted from a previously described method for the purification of a thermostabilised A2AR construct (Lebon et al., 2011a and 2011b; Tate and Lebon, 2015). DM must be used if the complex is to be later exchanged into short chain detergents for vapour diffusion crystallisation. This protocol typically yields 3-6 mg of pure A2AR from 3 L of insect cell culture.Thaw the membranes from 3 L of insect cell culture in a water bath at room temperature.Add 4 protease inhibitor tablets, and NECA (100 μM), imidazole (10 mM), PMSF (1 mM), and NaCl (300 mM) to give the final concentrations indicated, stir slowly at room temperature for 30 min using a magnetic stirring bar to allow agonist binding.Cool the membrane suspension to 4 °C in an ice bath. Solubilise the membranes by adding DM to give a final concentration of 2% (w/v) while stirring rapidly using a magnetic stirring bar, continue to stir slowly for 30 min at 4 °C.",
    "Transfer the solution to eight Ti70 tubes and centrifuge at 265,000 x g (60,000 rpm) in a Ti70 rotor for 2 h at 4 °C.Remove the supernatant and filter through a 0.2 μm Steritop filter unit. (see Note 4)Load the filtrate (~150 ml) onto a 5 ml Ni2+-NTA Superflow column (pre-equilibrated with buffer B) at a flow rate of 2 ml/min at 4 °C, using a peristaltic pump. The filtrate should be kept on ice during loading.Wash the column with 100 ml of buffer C at a flow rate of 5 ml/min at 4 °C.Elute the column with 20 ml of buffer D at a flow rate of 2 ml/min at 4 °C, collecting a single 20 ml fraction.Concentrate the eluate to 5 ml using an Amicon Ultra-15 concentrator (50 kDa molecular weight cut-off) in a refrigerated benchtop centrifuge at 4 °C. (see Note 5)Exchange the concentrated protein into buffer E using two PD-10 desalting columns (load 2.5 ml onto each column). (see Note 6)Add TEV protease to give a TEV:A2AR ratio of approximately 1:3 (w/w), incubate overnight on ice. Add 2 ml of Ni2+-NTA agarose resin (pre-equilibrated with buffer E), mix on a roller mixer for 30 min at 4 °C.Pour the suspension onto 1 ml of Ni2+-NTA agarose resin (pre-equilibrated with buffer E) packed into a disposable plastic column and let it run through by gravity.Collect the flow through and wash the column with 2 x 3 ml of buffer E.Pool the wash with the flow through and concentrate to 0.2 ml using an Amicon Ultra-15 concentrator (50 kDa cut-off) in a refrigerated benchtop centrifuge at 4 °C.Centrifuge the concentrated protein at 135,000 x g (55,000 rpm) in a TLA55 rotor using a benchtop ultracentrifuge for 10 min at 4 °C to remove aggregates.",
    "Load the supernatant onto a Superdex 200 GL 10/300 gel filtration column, (pre-equilibrated with buffer E) at a flow rate of 0.4 ml/min at 4 °C, collecting 0.5 ml fractions.Pool peak fractions (typically 3-4 ml) based on the gel filtration chromatogram. (see Note 7)Concentrate the pooled fractions to 0.2 ml using an Amicon Ultra-4 concentrator (50 kDa cut-off) in a refrigerated benchtop centrifuge at 4 °C.Determine the protein concentration using the amido black assay (Schaffner and Weissmann, 1973). (see Note 8)If required, purified A2AR can be aliquoted, flash frozen in liquid nitrogen and stored at -80 °C. (see Note 9) Crystallisation of the A2AR–mini-Gs complexThe A2AR–mini-Gs complex is first prepared in DM, once the complex is formed it is stable enough to be exchanged into octylthioglucoside (OTG) for vapour diffusion crystallisation trials. A detailed protocol for the expression and purification of mini-Gs is provided in a companion manuscript (Carpenter and Tate, 2017).Aliquot 2 mg of A2AR into a microcentrifuge tube and add a 1.2-fold molar excess of mini-Gs construct 414 (1.8 mg). Adjust the volume to 0.2 ml with buffer E, add MgCl2 to give a final concentration of 1 mM and add 0.1 units of apyrase. Incubate for 3-16 h on ice. (see Note 10)Start the detergent exchange (from DM to OTG) by diluting the complex 1:10 in buffer F, and re-concentrating to 0.2 ml using an Amicon Ultra-4 concentrator (50 kDa cut-off) in a refrigerated benchtop centrifuge at 4 °C.Centrifuge the concentrated protein at 55,000 rpm (135,000 x g) in a TLA55 rotor using a benchtop ultracentrifuge for 10 min at 4 °C to remove aggregates.Complete the detergent exchange by loading the supernatant onto a Superdex 200 GL 10/300 gel filtration column (pre-equilibrated with buffer F) at a flow rate of 0.",
    "5 ml/min at 4 °C, collecting 0.5 ml fractions.Pool peak fractions (typically 2-3 ml) based on the gel filtration chromatogram (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170415/20170415011624_3061.jpgFigure 3. SDS-PAGE and gel filtration analysis of the A2AR purification. A and B. SDS-PAGE analysis of the purification of a representative A2AR construct. Despite having molecular weights of 35 and 27 kDa respectively, A2AR and mini-Gs414 migrate at an identical rate on the SDS-PAGE gel, making visualisation of the complex difficult. Therefore, for demonstration purposes, we show SDS-PAGE gels of an A2AR construct that contains an N-terminal thioredoxin fusion (TrxA-A2AR), which increases its molecular weight to 46 kDa. TrxA-A2AR was purified in DM using an identical protocol to that described for A2AR, however, the TrxA-A2AR–mini-Gs complex, which was exchanged into OTG, did not yield crystals that diffracted to higher than 3.5 Å resolution. A. SDS-PAGE analysis of the TrxA-A2AR purification: (M) molecular weight markers; (1) Ni2+-NTA column loading material (1:10 dilution); (2) Ni2+-NTA column flow through (1:10 dilution); (3) Ni2+-NTA column wash; (4) Ni2+-NTA column eluate; (5) sample after concentration and buffer exchange; (6) sample after TEV digestion; (7) Ni2+-NTA negative purification flow through; (8) Ni2+-NTA negative purification eluate; (9) gel filtration pool. TEV protease is indicated by an asterisk. The samples should not be boiled prior to loading on the gel (see Note 11). B. SDS-PAGE analysis of the TrxA-A2AR–mini-Gs414 complex after detergent exchange into OTG: (M) molecular weight markers; (1) gel filtration pool. C. Preparative gel filtration chromatogram for the A2AR–mini-Gs414 complex in OTG, pooled fractions (typically 2-3 ml) are indicated by dashed lines. Note that the UV detector reaches saturation, which results in a truncated absorbance profile. D. A crystal of the A2AR–mini-Gs414 complex mounted in a loop on beamline ID23-2 at the European Synchrotron Radiation Facility (the scale bar is 50 x 100 μm).",
    "Concentrate the pooled fractions to ≥ 20 mg/ml using an Amicon Ultra-4 concentrator (50 kDa cut-off) in a refrigerated benchtop centrifuge at 4 °C.Centrifuge the concentrated protein at 135,000 x g (55,000 rpm) in a TLA55 rotor using a benchtop ultracentrifuge for 10 min at 4 °C to remove aggregates.Transfer the supernatant to a new tube and discard the pellet.Accurately determine the concentration of the complex using the amido black assay (Schaffner and Weissmann, 1973).Dilute the complex to 20 mg/ml and immediately set up crystallisation trials in 96-well sitting drop plates, dispensing 120 nl of protein and 120 nl of precipitant solution using a Mosquito crystallisation robot situated in a cold room at 4 °C. (see Note 12)The initial hit for the A2AR–mini-Gs414 complex came from the MemGoldTM screen (0.1 M sodium acetate pH 5.5, 8.8% [w/v] PEG 2000 MME). The two crystals that were used for structure determination were grown in either: 0.1 M sodium acetate pH 5.5, 10% (w/v) PEG 2000; or 0.1 M sodium acetate pH 5.7, 9.5% (w/v) PEG 2000 MME.Harvest the crystals in a cold room at 4 °C. Sequentially transfer the crystals between drops of mother liquor supplemented with increasing concentrations (10, 20, 30%) of the cryoprotectant PEG 400 (1 min in each solution), before flash freezing in liquid nitrogen. (see Note 13)"
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}