{
  "id": 11071,
  "origin_website": "Jove",
  "title": "Characteristics of Precipitation-formed Polyethylene Glycol Microgels Are Controlled by Molecular Weight of Reactants",
  "procedures": [
    "1. Preparing Solutions for Use in Microgel Fabrication\nBefore beginning the precipitation reaction, make the necessary solutions and warm them to 37 °C. The required solutions include 0.5% photoinitiator, 1.5 M Na2SO4, buffer solution, 200 mg/ml PEG-diacrylate (PEG-DA) solution, and 1x phosphate buffered saline (PBS). Note: Acrylate all PEG precursors according to published methods and store at -20 °C under argon until use12.\nWeigh out photoinitiator and dissolve in deionized (DI) H2O for a 0.5 (w/v)% solution. It is important to protect the solution from exposure to UV light.\n\t\nAfter full dissolution, filter through a 0.22 μm filter. This solution can be made in advance and stored at 4 °C in the dark. Note: Decrease the stirring time to approximately 1 hr by heating the solution to 40 °C while stirring.\nFor 1x PBS, add 1 tablet PBS to 1 L DI H2O and filter through a 0.22 μm filter. PBS can be made in advance and stored at 4 °C.\nMeasure 39.4 ml of phosphate buffered saline (PBS, pH=7.4) and add 612 μl triethanolamine (TEOA), and 260 μl of 6 M hydrochloric acid (HCl). Note: TEOA is very viscous; preheat TEOA to 37 °C prior to pipetting.\n\t\nAdjust the pH of the buffer so that it is approximately 7.7 and filter through a 0.22 μm filter (final pH ~7.8). The buffer solution can be scaled up, made in advance, and stored at 37 °C.\nMake the PEG-DA solution prior to beginning the reaction each time; decreased reactivity has been observed if the solution is stored. Weigh out PEG-DA and add PBS/TEOA/HCl buffer to final concentration of 200 mg/ml. Note: Add buffer slowly to carefully control PEG concentration because PEG swells in solution.",
    "Note: This solution is highly customizable. Options for customizing microgels include: changing the starting molecular weight of PEG to alter microgel properties, using a degradable PEG precursor to fabricate degradable microgels, sterile filtering all of the solutions for biologically sterile microgels, completing the process of formation in a laminar flow hood, and finally adding functional groups to the surface by incorporating them in the PEG solution.\nWeigh out Na2SO4 and dissolve in DI H2O for a 1.5 M solution. For best results, the sodium sulfate solution must also be made just prior to beginning the reaction.\n\t\nHeat and vortex the solution until Na2SO4 is completely dissolved. Filter through 0.22 μm filter as necessary.\n2. Microgel Fabrication\nPlace 127.5 μl of PBS/TEOA/HCl buffer, 10 μl of 0.5% photoinitiator, and 25 μl of 200 mg/ml PEG solution into the tubes where the microgels will be formed; typically 2 ml microcentrifuge tubes.\n\t\nHeat these tubes along with the 1.5 M Na2SO4 solution to 37 °C.\nMix the tubes while heating. Note: This microgel protocol can be scaled up.\nTo encapsulate molecules into the microgels, add the desired molecule (e.g. ovalbumin) to the PBS/TEOA/HCl buffer, photoinitiator, and PEG solution. After crosslinking the molecule will be trapped in the microgel network.\nComplete each microgel reaction one at a time. Take the first tube and add 87.5 μl of 1.5 M Na2SO4.\nMix tube by pipetting 3-5x; alternatively wait 30 sec. After mixing, the salt concentration will be evenly distributed and the solution should be clear.\nPlace the tube under the UV light and crosslink for 30 sec. Following crosslinking there should be a cloudy layer on top of the solution, this layer contains the microgels. See Figure 1 for reaction scheme.\nAdd 750 μl PBS to form a pellet upon centrifugation and mix well.",
    "Wash the microgels 5 x by centrifuging for 2 min at 4,000 x g to form a pellet and exchanging the supernatant with PBS. Note: Do not disturb the microgel pellet while buffer exchanging, it may not be possible to remove all the supernatant.\n3. Microgel Size and Polydispersity\nPipette 30 μl of microgels from the pellet formed from centrifuging in 1 ml of DI H2O. For best results, sonicate the microgel solution in a water bath sonicator for 1 hr (50-60 Hz and 1.4 A) or mix vigorously to suspend the microgels.\nPipette 15 μl of the microgel solution onto a clean glass slide and put #1.5 cover slip on top. Flip the slide and cover slip over onto a laboratory tissue and push down on the slide to remove excess solution and ensure that the microgels are in a single layer.\nCapture several images of the microgels using a DIC 100X oil objective. Typically 5 images are taken per sample and 3 samples per batch are recommended for a total of 15 images. Note: no batch to batch variation has been observed to date.\nMeasure the microgels to obtain a representative diameter.\nCalculate PDI using the following volume based equation in which N is the total number of microgels and Vi is the volume of microgel i.\n4. Microgel Density\nPrepare dextran 7, 6, 5, 4, 3, and 1 (w/v)% solutions in DI H2O to determine microgel density. These densities were calculated to be 1.022, 1.020, 1.018, 1.016, 1.014, and 1.010 g/cm3, respectively.\nAdd 1 ml of 7% dextran solution to a 15 ml centrifuge tube.\n\t\nSlowly pipette 1 ml of 6% dextran solution to form a distinct layer atop the 7% dextran.\nWait 5 min then add 1 ml of the 5% solution.",
    "Continue until all dextran solutions are layered in order of decreasing dextran concentration.\nCarefully layer the microgels above the 1% dextran solution.\nCentrifuge the gradient for 10 min at 4,000 x g and 5 °C. Microgel position after centrifugation allowed for simple calculation of density13.\n5. Microgel Equilibrium Swelling\nTo measure the swollen mass (Ms) of the microgels, defined as the mass after equilibrium swelling (48 hr), first wash the microgels 5x in DI H2O and swell for a minimum of 48 hr in preweighed microcentrifuge tubes.\nCentrifuge the microgels for 10 min at 4,000 x g.\nRemove all supernatant and record the wet mass. Use filtering methods to ensure all excess water is removed to obtain more accurate results.\nFreeze the microgels at -80 °C then lyophilize to constant mass to obtain the dry mass (Md).\nCalculate the water content in the microgels by Water% = (Ms - Md) / Md x 100.\nDetermine polymer content by Polymer% = 100 - Water% .\nPerform statistical analysis on all data using SAS with n-way ANOVA and Tukey post-hoc test. Differences are noted when p<0.05.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}