{
  "id": 7655,
  "origin_website": "Bio",
  "title": "Genome-assisted Identification, Purification, and Characterization of Bacteriocins",
  "procedures": [
    "Bacteriocin purification Take the vial of bacteriocin producing culture Lactococcus lactis LMGT 4215 (nisin Z producer) from deep freezer (-80°C) and place it on ice or in a cold block.Aseptically transfer culture to M17 agar plates supplemented with 0.5% wt/vol glucose (GM17) with sterile loop and streak out to obtain single colonies.Incubate at 30°C for 24 h.Take a single colony from the plate with a sterile loop and transfer it to a sterile culture tube containing 10 mL of the GM17 broth. Leave the tube O/N (overnight) at 30°C without shaking.The following day, inoculate 1 L of GM17 with the culture prepared earlier (1% inoculum, v/v). Leave the bottle for 20–24 h without shaking at 30°C.Note: Bacteriocin production usually peaks at the early stationary growth phase, but this can vary from strain to strain. Therefore, this has to be monitored for each new bacteriocin producer if yield is important. If the culture is incubated for a prolonged period of time, bacterial proteases can digest the bacteriocin of interest and reduce or even abolish antimicrobial activity. It is important to optimize the incubation time for each individual bacteriocin producer. Also, bacteriocin production can depend on the growth medium, temperature, and aeration—all those parameters should also be optimized for a particular bacteriocin producer (Telke et al., 2019). Transfer the culture (1 L) of the bacteriocin producer to centrifuge bottles (floor centrifuge) at room temperature. Spin down the cells (10,000 × g, 20 min, 4°C). Distribute the supernatant (SN) carefully into a new 1.5–2 L bottle. Discard the cell pellet.Note: Continue immediately to the next step to avoid bacterial growth in the supernatant. Take an aliquot of the SN (1–2 mL) to analyze the initial bacteriocin concentration in the SN.",
    "Immediately heat the SN aliquot for 5 min at 100°C to sterilize and inactivate proteases. Store at -20°C until use.Add ammonium sulphate dry salt to the cold cell-free SN (at 4°C) to reach 50% (w/v) saturation; mix well using a magnetic stirrer until all salt is dissolved. Leave the SN with ammonium sulphate O/N at 4°C for protein precipitation.Notes:  Use an ammonium sulphate saturation calculator (such as: http://www.encorbio.com/protocols/AM-SO4.htm[href=http://www.encorbio.com/protocols/AM-SO4.htm]). Increasing the ammonium sulphate concentration up to 70% saturation can increase yield as more of the bacteriocin will precipitate. Bacteriocins are unstructured in water, meaning that there is no need for careful and gradual addition of ammonium sulphate. In our laboratory, the procedure takes only a few min. After adding the ammonium sulphate, the solution can be left at 4°C for a few days without loss of bacteriocin activity, as proteases are unlikely to be active at high concentrations of ammonium sulphate. However, some bacteriocins lose activity due to oxidation, such as pediocin PA-1 (Fimland et al., 2000); in this case, prolonged storage in ammonium sulphate is not recommended. Centrifuge the ammonium sulphate solution (12,000 × g, 45 min, and 4°C), and carefully discard the SN from the centrifuge bottles to avoid resuspension of the protein pellet because loss of the protein pellet will reduce yield.Gently resuspend all protein pellets in Milli-Q water to a total volume of 150 mL (100–150 mL/L of starting volume of supernatant). Use a 5 mL pipet to dislodge and resuspend the pellets. Transfer the total volume to a new bottle or beaker. Adjust the pH of the protein solution to 4 by the addition of 1 M HCl.Note: Reducing the pH ensures that bacteriocin peptides are positively charged, which improves binding to the cation-exchange column.",
    "Connect the cation exchange column HiPrep 16/10 SP-XL column to the ÄKTA purifier system equipped with the fraction collector. Set the maximum pressure limit to 0.5 MPa (highest pressure limit for that column) to avoid potentially damaging the column.Wash pump A with Milli-Q water with a pH of 4 and pump B with 1 M NaCl (unbuffered).Equilibrate the column with 5 CV (column volumes; 100 mL) of Milli-Q water adjusted to pH 4.Place pump A inlet into the protein solution and apply it to the column at a flow rate of 1–7 mL/min. Collect the flow-through in a new bottle.Wash the column again with 5 CV of Milli-Q pure water at pH 4 (this step can be omitted).Place pump A inlet in 20 mM phosphate buffer (pH 7) and wash the column with 5 CV (100 mL). Collect the flow-through in a new bottle.Elute the bacteriocin with a linear gradient from 0 M to 1 M NaCl (unbuffered) at a flow rate of 5 mL/min over 20 min. Set the fraction collector to collect 20 fractions of 5 mL each. Each fraction, as well as the initial heat-treated SN, the cation-exchange flow-through, and the “wash” fractions, are checked for antimicrobial activity using the microtiter plate assay (see below). The active fractions eluted with NaCl are pooled for the reversed-phase chromatography (RPC) purification.Note: To prevent bacteriocin aggregation, it is recommended to reduce the pH of the pooled active fractions to 2 with 1 M HCl. This is especially important if the cation-exchange eluate will be stored for a long time and/or the purified bacteriocin molecules are large (>40 residues) and hydrophobic. The recommended temperature to store bacteriocins is -20°C. RPC purification is performed with a resource RPC column (1 mL) connected to ÄKTA purifier system.",
    "First, prepare 200 mL Milli-Q water with 0.1% (v/v) trifluoroacetic acid (TFA; solution A) and 200 mL 2-propanol with 0.1% (v/v) TFA (solution B). Wash pump A and pump B with solution A and B, respectively. Set the maximum pressure limit to 4 MPa (highest pressure limit for that RPC column) to avoid potentially damaging the column. Equilibrate the RPC column with at least 10 mL of solution A.Change pump A inlet from solution A to the pooled active fractions from cation-exchange chromatography (eluate). Apply the eluate to the column at 3–5 mL/min flow rate.Use a linear gradient (0–100%) of solution B at the flow rate of 1.0 mL/min for elution of the bacteriocin.Note: Normally, bacteriocins are eluted at 25–50% solution B. Set the fraction collector to collect 1 mL per fraction from the RPC column. Collect a total of 30–40 fractions.Take a 10 µL aliquot from each fraction for antimicrobial activity test in a microtiter plate assay (see microtiter plate protocol below).Microtiter plate assay Add 100 µL of GM17 broth medium to the wells A1 to A11 of a microtiter plate. Add 200 µL to well A12 as a control; this well should have no growth.Add 100 µL of the heat-treated supernatant or cation-exchange fractions (flow-through, wash flow-through, elution fraction) to A1 to a total volume of 200 µL.Notes:  For reversed-phase fractions, use 10 µL of each reversed-phase fraction plus 90 µL of growth medium, so that the total added volume is 100 µL to each well. If the purified bacteriocin is predicted (BAGEL4, AntiSMASH, see below) to consist of two or more different peptides, the individual peptides can be eluted into different fractions, thereby resulting in low or no antimicrobial activity.",
    "In this case, we recommend pooling the fractions corresponding to the peaks and seeing if the antimicrobial activity is restored. A checkboard assay can then be performed to determine which two fractions the peptides are in. The growth of mutants resistant to the bacteriocin can supersede the growth of the wild-type strain during incubations longer than 5–6 h; hence, avoid overnight incubations. Mix the liquid in A1 by pipetting up and down 4–5 times.Take 100 µL from A1 and transfer to A2, and pipet up and down 4–5 times to mix. Move 100 µL from A2 to A3 and so on until A10.After mixing in A10, discard the tip containing 100 µL of liquid.Make 25 times diluted O/N culture of indicator (known to be sensitive towards your bacteriocin, such as Lactococcus lactis IL1403 or Listeria innocua LMGT 2785 for nisin), e.g., 1 mL O/N culture into 24 mL of BHI broth.Add 100 µL of the diluted culture to well A11. Now there is 200 µL in A11 with no bacteriocin; this is a positive control for normal cell growth.Continue adding 100 µL of diluted indicator culture to A10, then A9, and so on, up to A1 without changing the tip(s). Now there is 200 µL of liquid in all A1–A12. A12 will always be transparent (pure broth), and A11 will become turbid (only bacteria).Note: Other fractions can be tested using the rest of the microtiter plate (B1-H1). After application of the test samples into the wells, use a multichannel pipette. Incubate the plate at 30°C for 5–6 h.Measure growth at A600 using a spectrophotometer such as the SPECTROstar Nano. One bacteriocin unit (BU) is defined as the amount of bacteriocin that inhibits the growth of the indicator strain by at least 50% in 200 µL culture (i.e.",
    ", ≤ 50% of the turbidity of the control culture without bacteriocin). The amount of antimicrobial in column 5 of Figure 1 is then 1 BU or 5 BU/mL. The RPC fraction then has an activity of 3,200 BU/mL if 10 µL of the RPC fraction was added to well No. 1 at the beginning.Note: Using the bacteriocin purification protocol presented here, we typically achieve 60–70% yield starting from 320 BU/mL in the cell-free supernatant. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4477/bioprotoc-12-14-4477-g001.jpgFigure 1. An example of the microtiter plate assay. Eight aliquots of nisin Z (10 µL each) from the same RPC fraction were tested for antimicrobial activity against L. lactis IL1403. The plate was incubated for 5 h at 30°C before optical density was read at 600 nm. Wells with clear inhibition (more than 50% compared to the OD in wells of column 11) are shown in yellow (columns 1–5), cultures without bacteriocin in brown (positive control; column 11), cultures with no or less than 50% inhibition in white, and GM17 broth control in blue (negative control; column 12).Protease-sensitivity Reconstitute proteinase K in Milli-Q water to 20 mg/mL.Dilute indicator strain L. lactis IL1403 (for nisin Z) in GM17 soft agar (0.8% agarose) cooled to 45°C; pour evenly over a GM17 agar plate. Leave the soft-agar to solidify for 3–5 min with the lid partly off.Drop 2–3 µL of the bacteriocin producing O/N culture (or a bacteriocin containing solution). Drop 2 µL of proteinase K solution 4–5 mm near the bacteriocin-producing culture (make sure the drops do not mix). Let the plate dry for 5–10 min before incubation O/N at appropriate temperature. Next day a “crescent moon” shape will appear on the plate if the antimicrobial is susceptible to proteinase K, see Figure 2.Note: Circular and highly modified bacteriocins can be resilient to proteinase K. imgsrc:https://en-cdn.",
    "bio-protocol.org/attached/image/e4477/bioprotoc-12-14-4477-g002.jpgFigure 2. Proteinase K drop (indicated with the black dot) degrades nisin Z produced by L. lactis LMGT 4215 (A), making it inactive against indicator culture L. lactis IL1403 (B). Heat-stability Spin down the O/N culture of the bacteriocin producer using a centrifuge (10,000 × g, 3 min). It is also possible to further sterilize the SN by filtration using a 0.2 µm filter.Take 1 mL of the cell-free SN and distribute it equally into two centrifuge tubes. Leave one tube at room temperature, and place the other in a heating block (or water bath) at 100°C for 5 min. Compare antimicrobial activity in the two tubes (heated and non-heated) using a microtiter plate assay as described above.Note: Bacteriocins are heat-stable molecules and do not lose their activity after heating. If the antimicrobial activity is lost after heating, it is most likely to be due to antimicrobial enzymes/proteins (of high molecular weight). MALDI TOF MS Prepare the MALDI matrix solution as described in the recipes section. Thoroughly dissolve the α-cyano-4-hydroxycinnamic acid (HCCA) by vortexing, followed by sonication (5 min).Note: Although a number of alternative matrices, such as 2,5-didroxybenzoic acid (DHB), could work well, we find that HCCA is particularly useful for bacteriocin analysis. Prepare the calibration standard by dissolving the Peptide Calibration Standard II in 0.1% TFA according to the manufacturer’s instructions. Store the peptide calibration standard as 4–5 µL aliquots at -20°C until use.Note: For optimal results, it is recommended to calibrate the mass axis frequently. This is achieved by acquiring spectra from calibration standards covering the useful mass range, which may be obtained from several vendors. To 1–2 µL of RPC purified bacteriocin sample, add an equal volume of matrix solution in, e.g., a 0.",
    "2 mL PCR tube, and mix thoroughly by pipetting up and down several times. Apply a small drop (0.5–1 µL) to a spot on the MALDI target plate and let the droplet air dry.Note: For best mass accuracy results, always apply your sample next to a calibration spot, which is prepared the same way as the sample spot. Mount the target plate in the target frame, insert the frame into the instrument, and wait for the complete evacuation of the ion source. Load an appropriate (positive reflectron mode) acquisition method. Set the instrument to an acceleration voltage (ion source 1) of 20 kV, ion source 2 of approximately 18 kV, reflectron voltage 1 and 2 of approximately 21 kV and 11 kV, respectively, and a PIE (delayed extraction) setting of approximately 140 ns. To suppress low mass (mainly matrix) signals, use a deflection setting of 400–600.Note: The procedure described applies to analysis performed using the Bruker Daltonics Ultraflex and Ultraflextreme MALDI-TOF/TOF instruments. For other systems, adjustments to sample preparation as well as to instrument settings may be required. Position the cursor on the appropriate spot and start firing the laser. Adjust the laser intensity to achieve maximum resolution. Achieve the required peak intensity and signal/noise ratio by accumulating several shots; increasing the laser intensity instead may lead to poor resolution and mass accuracy. Once an acceptable spectrum has been accumulated, calibrate the instrument by assigning the peaks to a list of theoretical monoisotopic m/z values, using a cubic enhanced function. A calibration with <5 ppm error is acceptable; normally, <2 ppm is achieved. Once the calibration spectrum has been accepted, the instrument’s mass axis is calibrated, proceed to acquire data from your sample spot(s). A representative example for nisin is shown in Figure 3.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4477/bioprotoc-12-14-4477-g003.jpgFigure 3.",
    "MALDI TOF MS spectrum obtained from the most active RPC fraction. The mass of 3329.6 m/z corresponds well with the predicted mass for nisin Z (containing one unmodified Ser/Thr).Whole genome sequencing and analysis Prepare genomic DNA from the bacteriocin producer from 1.5 mL of overnight culture using the GenElute Bacterial Genomic DNA kit according to the manufacturer’s instructions.Ensure that the sample meets the minimum requirements set by the sequencing laboratory. For microbial genome sequencing by Novogene, the sample concentration should be ≥ 10 ng/µL by Qubit with a minimum volume of 20 µL. The total amount of DNA should be ≥ 200 ng. The DNA should migrate on an agarose gel as a single band at approximately 20–25 kb, and OD260/280 should be 1.8–2.0 by NanoDrop.Ship the sample to your sequencing provider (e.g., Novogene) for bacterial whole genome sequencing (100× coverage, paired-end 150 bp).Download the sequencing results using the web interface from your sequencing provider. Two files should be associated with the sample and have a suffix _R1/_1 for forward reads and _R2/_2 for reverse reads.Create an account with https://www.patricbrc.org[href=https://www.patricbrc.org], which provides free bioinformatic analyses such as assembly.Note: Most assembly software is freely distributed and can be executed on your personal computer (such as SPAdes, MEGAHIT, ALLPATHS-LG, IDBA-UD, MIRA, and Velvet). However, these tools are inaccessible to most researchers because they require familiarity with the command-line interface and GNU/Linux (or Windows Subsystem for Linux). In the web interface, go to WORKSPACES and “Genome Groups”. Go to “Upload”, then “Select Files”. Select both sequencing files. Then “Start Upload”.Select the first file, then “Edit type” and select “reads” in the drop-down menu. Do this for both files.Go to “Services” then “Assembly”. In the “Paired read library” box, select read file 1 as the file named _R1 or _1.",
    "For read file 2, select the file named _R2 or _2.In the box “Parameters” select SPAdes under “Assembly strategy”, set the output folder to “/home/Assemblies”. Give the assembly an output name.Click the right arrow in the “Paired read library” box, then click “Assemble” at the bottom.When the assembly is finished, go to “Workspaces” and select “home”. Double-click on the “Assemblies” directory, then on the directory with the assembly name chosen previously.Select the file named *contigs.fasta, then download the file by clicking “DWNLD” in the green bar to the right.Submit the file to http://bagel4.molgenrug.nl[href=http://bagel4.molgenrug.nl] and https://antismash.secondarymetabolites.org[href=https://antismash.secondarymetabolites.org] to identify bacteriocin genes, see Figure 4A.Analyze the identified genes and compare the theoretical monoisotopic mass with that obtained by MALDI TOF MS. The mass can be calculated using a tool such as PeptideMass (https://web.expasy.org/peptide_mass/[href=https://web.expasy.org/peptide_mass/]), see Figure 4B.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4477/bioprotoc-12-14-4477-g004.jpgFigure 4. AntiSMASH search result. AntiSMASH correctly identifies a lanthipeptide cluster in the assembled contigs from the nisin Z producer (A). Theoretical monoisotopic mass of the predicted core peptides is provided in a panel located at the lower right of the AntiSMASH window (B). The mass measured by MALDI TOF MS is correctly predicted in the alternative weights assuming 1 unmodified Ser/Thr (3331.0 Da).Propidium iodide pore formation assay Dilute RPC purified antimicrobial in PBS containing 40 µM propidium iodide to total volume of 100 µL in the well of a black 96-well plate. Include three controls, one containing no antimicrobial, one containing an antimicrobial that does not form pores such as micrococcin P1, and one containing a known pore-former such as commercially obtained nisin A.Prepare 20–50 mL overnight culture of your indicator, such as L. lactis IL1403 in GM17. Wash the cells once in PBS and resuspend to an OD600 of 1.Add 100 µL of cell suspension to the wells containing diluted antimicrobial and the negative controls.",
    "Immediately place the 96-well plate in the Hidex Sense plate reader and measure the fluorescence every 10 min (kinetic) for 3 h with excitation at 535/20 nm (515–555 nm) and emission at 630/40 nm (590–670 nm); see Figure 5 for a representative result and Figure 6 for the principle of the Propidium iodide assay.Note: Many fluorometers can produce very large values depending on the settings and dynamic range of the instrument. Here, we are only interested in the difference between samples; relative fluorescence values are obtained by dividing readings from all samples by the same constant (e.g., the first reading from the well containing micrococcin P1, making this value equal to 1). imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4477/bioprotoc-12-14-4477-g005.jpgFigure 5. Propidium iodide pore formation assay. An increase in fluorescence indicative of pore formation is observed for commercial nisin A (green) as well as for the purified fraction of nisin Z (grey). Wells with micrococcin P1 (yellow), which does not form pores but kills cells by inhibiting protein synthesis, or the control with no added antimicrobial (NC; blue), show no increase in fluorescence.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4477/bioprotoc-12-14-4477-g006.jpgFigure 6. Principle of the propidium iodide-based pore formation assay. Intact bacterial membranes are impermeable to propidium iodide molecules (left). Membrane disruption allows PI to diffuse into bacteria and interact with DNA, causing an increase in the fluorescence intensity (right). The triangle represents the fluorescence emission from PI in solution (small triangle, left) and when interacting with dsDNA (larger triangle; right).Assessment of pore formation using pHlourin biosensors Inoculate 5–10 mL of BHI containing 10 µg/mL chloramphenicol from a single bacterial colony of the biosensor bacteria, e.g., Listeria innocua/pNZ-pHin2Lm (biosafety level 1) or Listeria monocytogenes/pNZ-pHin2Lm (BSL 2) (Reich et al., 2022), and incubate overnight at 37°C under shaking conditions (130 rpm).",
    "Next morning, harvest the bacteria by centrifugation at 4,500 × g for 10 min, wash with an equal volume of PBS, and measure the OD600 (typically between 3–4). Centrifuge again and resuspend bacteria at an OD600 of 3 in Listeria minimal buffer (LMB) (Crauwels et al., 2018).Prepare your samples in a black 96-well microtiter plate as follows:For general analysis of activity in multiple samples, distribute 100 µL per sample to the wells of the microtiter plate. Include controls of 100 µL LMB (no pore formation) and 100 µL LMB containing 10 µg/mL of a commercial nisin A preparation (maximum pore formation).For closer analysis of activity in up to eight samples, fill as many rows of the plate as samples to be analyzed with 100 µL of LMB per well. Add 100 µL of sample to the first well of a row and mix by pipetting. Prepare horizontal dilution rows by transferring 100 µL to the next well using a multichannel pipette, ensuring always to mix well. Repeat until column 11, then discard 100 µL from the wells in column 11. Use wells in column 12 for positive and negative controls as described in step 3a.Note: Column 12 is used for both negative and positive controls, e.g., by using wells A12/B12/C12 for negative and D12/E12/F12 for positive controls. Using a multichannel pipette, add 100 µL of LMB-suspended sensor bacteria to all wells. Mix carefully by shuffling the plate on the lab bench.Incubate at RT in the dark for 30 min.Measure fluorescence emission at 520 nm of each well using an infinite M200 multiplate reader (Tecan) with excitation at 400 and 480 nm.In the results file, divide the emission value for excitation at 400 nm by the emission value for excitation at 480 nm. Compare ratio values by plotting, e.g.",
    ", as bar chart (Figure 7). Pore formation leads to collapse of intracellular pH, leading to a decrease in fluorescence ratio.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4477/bioprotoc-12-14-4477-g007.jpgFigure 7. Principle of assessing membrane integrity via pHluorin2 fluorescence. Biosensor bacteria constitutively express the pH-sensitive fluorescent protein pHluorin2, which shows a bimodal excitation spectrum with maxima at 400 and 480 nm. In intact cells, the ratio of fluorescence intensities at the two excitation peaks is defined by the intracellular pH (left). If pH homoeostasis is disrupted by membrane-damaging compounds, intracellular pH drops to the pH of the assay buffer (pH 6.2), and this leads to a ratiometric change in the fluorescence intensity of pHLuorin2 at the two excitation peaks right). Calculation of fluorescence intensity ratios at the two excitation maxima (400 and 480 nm) allows discrimination between intact and disrupted cells (middle)."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}