{
  "id": 1832,
  "origin_website": "Cell",
  "title": "Protocol for deep brain stimulation in the fimbria-fornix of freely moving mice",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSurgical preparation\nTiming: 30 min\nSurgical instruments\nPrepare scissors, blunt-end forceps, scalpel, spring scissors, spatula, burs, and needle holder.\nAutoclave all these instruments.\nDrugs and chemicals\nAnesthetic: isoflurane.\nAnalgesic: meloxicam (0.5 mg/mL), 50/50 mix of 2% lidocaine and 0.5% bupivacaine diluted 1:20 in sterile saline.\n70% ethanol, betadine, 8% hydrogen peroxide.\nIsoflurane anesthesia system, oxygen (medical grade), exhaust vacuum system of isoflurane.\nStereotaxic apparatus, dipper, fur trimmer, hair remover lotion, heating blanket, eye ointment, drill, cotton swabs, dental acrylic, suture, tissue glue, disposable syringes, gown, gloves, masks.\nSurgical implantation of the electrodes\nTiming: 2 h\nAll the procedures should be performed under aseptic conditions that include appropriate personal protective equipment, autoclaved instruments, and a glass bead sterilizer.\nSet all autoclaved surgical instruments on a stainless steel tray.\nInject mice at 6–8 weeks of age with meloxicam (5.0 mg/kg, S.C.) 30 min prior to administering anesthesia.\nUse an isoflurane vaporizer to anesthetize the mice with 2.5 % isoflurane in oxygen (1.0 L/min flow rate) for ∼5 min in the induction chamber. Fully anesthetized mice will not exhibit tail- or foot-pinch reflexes.\nTake the mice out from the induction chamber and lay them flat on a diaper. Carefully shave the region of interest and the surrounding area with a fur trimmer. Then evenly apply hair remover lotion on the shaved surgical area for ∼10 s to completely remove the fur from the skin.\nPut the mice back into the induction chamber until they lose pinch reflexes again. Then, quickly mount the anesthetized mice on the stereotaxic frame by locking the incisor and gently inserting the ear bar tips into the ear canals.",
    "Switch the isoflurane anesthesia to the nose connection of the frame. The mice should rest comfortably on a heating blanket. Reduce the isoflurane concentration to 1.0%–2.0% and maintain the anesthesia level throughout the procedure.\nUse a feedback-controlled heating blanket to maintain the mice’s body temperature at 36°C–37°C. Insert the temperature sensor probe with a lubricated tip part 7–8 mm into the rectum.\nCover both the mice’s eyes with lubricant ophthalmic ointment to protect them from dryness and bright light during the surgery.\nDisinfect the skin of the surgical region with 70% ethanol followed by povidone-iodine for three runs.\nInject a 50/50 mix of 2% lidocaine and 0.5% bupivacaine diluted 1:20 in sterile saline (0.04 mL/10 g body weight) subcutaneously along the incision line. Then wait for 2–3 min before making the incision.\nGently hold the skin with blunt forceps and use a scalpel to make an incision along the midline between the eyes and the occiput (∼15 mm long) and pull the skin to the sides.\nUse a scalpel blade together with spring scissors to clean the connecting tissues. Then, use a cotton swab soaked with 8% hydrogen peroxide followed with sterile saline to expose the skull surface. Let it dry so that the suture lines (bregma, lambda, etc.) on the skull are clearly visible (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1311-Fig4.jpg\nFigure 4. Surgical procedures for the implantation of DBS and recording electrodes\n(A) The bregma and lambda are identified after the skull is cleaned and dried. Scale bars in (A), (C), (D), (E): 2 mm.\n(B) Electrode assemblies mounted on the electrode holder of the stereotaxic arm through custom-made adaptors.\n(C) Horizontal sites of the DBS, CA1, and ground are determined and marked on the skull.\n(D) Small openings that allow electrode insertion are made with a high-speed drill.",
    "(E) Rough skull surface for better cementing contact.\n(F) Insertion of DBS, recording, and ground electrodes following coordination.\nCritical: Measure the height of the bregma and lambda and make sure that they are on the same vertical level, if necessary, by adjusting the head positioning. This is the premise of coordinate setting (Paxinos and Franklin, 2001[href=https://www.wicell.org#bib9]).\nDetermine the coordinates for the targets of DBS and hippocampal recordings.\nAttach the two electrode assemblies (DBS and recording electrodes) to the electrode holders mounted on the stereotaxic arms with custom-made adaptors (Figure 4[href=https://www.wicell.org#fig4]B).\nCritical: The adaptors for DBS and recording electrodes are specially made so that one side matches the designed pins of the electrodes and the other side connects to the output of the stimulus isolator and input of signal acquisition system, respectively.\nDetermine the coordinates for each electrode assembly (DBS electrode: P0.2R0.24H2.3; recording electrode: P2.0R1.0H1.3 (the longer, active probe to the CA1); ground electrode: subdural space over the cerebellum) (Paxinos and Franklin, 2001[href=https://www.wicell.org#bib9]) and mark each point on the skull with a black marker (Figure 4[href=https://www.wicell.org#fig4]C).\nCarefully use a surgical high-speed drill (0.7 mm tip diameter) to make the openings that allow electrode insertion at each mark on the skull (Figure 4[href=https://www.wicell.org#fig4]D).\nThen, make rough on the rest of the exposed skull surface for better cementing contact (Figure 4[href=https://www.wicell.org#fig4]E). Gently touch the skull surface with the rolling edge of the straight fissure crosscut bur mounted to the surgical drill to make it rough evenly. Clean the skull with a cotton swab lightly soaked with 8% hydrogen peroxide and let it dry before electrode insertion.\nEvoked response-guided implantation of DBS and recording electrodes.",
    "Connect the output of the stimulus isolator to the designed pins of the DBS electrode assembly. Then, connect the designed pins of the recording electrode assembly to the input of the Differential AC Amplifier (A-M Systems). The output of the amplifier goes to the inputs of the digitizer (DigiData 1440A, Molecular Devices) and the output of the digitizer goes to a USB port of the computer (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1311-Fig5.jpg\nFigure 5. Equipment setup for evoked response-guided implantation of DBS and recording electrodes\nSurgical procedures are performed inside a Faraday cage. pClamp software is used to control the stimulation and data acquisition through the Digidata 1440A digitizer.\nUse pClamp 10 software for data acquisition and experimental control. Use one of the digital outputs of the digitizer to trigger the stimulus isolator.\nSet the stimulation as a single pulse: 0.1 ms pulse duration, 0.2 mA stimulus intensity, and repeat every 30 s.\nSet the data acquisition at 10 kHz sampling rate, 100× amplification, 0.1 Hz–5 kHz filter band, and 50 ms sweep length.\nImplant the ground wire to the subdural space over the cerebellum (Figure 4[href=https://www.wicell.org#fig4]F).\nSlowly lower both DBS electrode towards the fimbria-fornix and the recording electrode aimed at the CA1, to depths of 2.0 mm and 1.0 mm, respectively, as the pre-set depths.",
    "Start to record the evoked potentials induced by stimulation through the DBS electrode. Lower the DBS electrode and/or recording electrodes by 0.1 mm every 10 min and record the evoked responses for 3 min at each depth step. The depth profile of the evoked responses along the track of the recording electrode is shown in Figure 6[href=https://www.wicell.org#fig6]. Once the DBS electrode reaches the fimbria-fornix and the recording electrode arrives at the pyramidal cell layer of the CA1 (e.g., the last depth of recording at 1.3 mm depth), stop lowering the electrodes and record the evoked response for 10 min.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1311-Fig6.jpg\nFigure 6. Electrophysiological guidance of electrode implantation\n(A) Schematic illustration of the targets for DBS probe (top) and the recording electrodes (bottom) in the brain.\n(B) Depth profile of the evoked potentials induced by stimulation of the fimbria-fornix. Numbers on the right of each representative trace indicate the active recording electrode depth from the bregma after the DBS electrode reached the final depth.\nWait an additional 20 min before applying the cement.",
    "Critical: 1) To reduce the interference of environmental electromagnetic noises, the mice should stay inside a Faraday cage that is properly grounded for the surgical procedure and signal recording (Figure 5[href=https://www.wicell.org#fig5]); 2) It is important to slowly lower the electrode probes, increment by increment. This is to minimize the mechanical pressure of the electrodes on the brain tissue, which may cause the electrode to be placed too deep after the tissue bounces back; 3) it is possible to see tiny response or no response at all due to misplacement of the electrodes, especially the DBS electrode. If a second try of the DBS electrode insertion with 0.1–0.2 mm horizontal shift does not improve recording, terminate the attempt to implant the electrode and euthanize this animal; 4) during insertion of the electrodes, apply one or two small drops of sterilized saline at the skull openings to keep the exposed parts of the brain surface moist.\nApply dental cement (C&B Metabond) sequentially at the skull openings with electrode wires, the rest of the skull surface, and the space between the skull and the bottom half of the female connectors. Make sure that all of the wires and wire connections at the connector pins are embedded into the cement.\nAfter the acrylic hardens (∼20 min), suture the incised skin at the rostral and the caudal. Attach the skin edges at both sides on the cement surface using tissue glue.",
    "Critical: Store the cement kit in 4°C to allow a longer operation window while the cement components are still cold during the procedure. Pay careful attention to avoid the fluid cement or the tissue glue entering the connector holes of the electrode assemblies. Failure to do so may not allow removing the adaptors from the electrode assemblies at the end of surgery or cause open electronic circuit(s) for DBS and/or field recordings afterwards.\nWithdraw the ear bars and loosen the nose clamp. Carefully detach the implanted head posts from the connected adaptors and insert the double male connectors into the connector holes of the electrode assemblies.\nTransfer the implanted mouse into a pre-warmed cage that is heated by a heat-therapy pump until the mouse completely wakes up from the anesthesia, usually within 30 min.\nFor post-surgical care, singly house the animal and administer meloxicam (5.0 mg/kg, S.C.) daily for at least 3 days to reduce pain. Carefully observe the post-surgical recovery of the mice and provide necessary treatment, if there is minor dehydration or local infection, following approved procedures.\nGive the mice a 2-week recovery from the surgery before the next step.\nDetermine the DBS current intensity for each mouse\nTiming: 30 min\nThe goal of this step is to optimize the current intensity of DBS for each behaving mouse (Hao et al., 2015[href=https://www.wicell.org#bib3]; Shirvalkar et al., 2010[href=https://www.wicell.org#bib11]; Suthana et al., 2012[href=https://www.wicell.org#bib12]). Setting up the equipment for stimulation and recording is the same as for the surgical implantation except that the evoked potential signal is picked up through a preamplifier.",
    "Connect the preamplifier (± 4.5 V power supply) to the implanted recording electrode assembly and leave the animal in the recording chamber with corn bedding inside the Faraday cage. The output of the preamplifier is connected to the input of the differential AC amplifier via a commutator (Figure 7[href=https://www.wicell.org#fig7]). Signals are amplified (100×, preamplifier and amplifier together), filtered (0.1 Hz–5 kHz bandpass), and digitized at 10 kHz. Connect the output of the stimulus isolator to the DBS electrode assembly through the commutator.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1311-Fig7.jpg\nFigure 7. Experimental setup for the recording of evoked potentials in the CA1 of freely moving mice\nBoth stimulation and recording signals pass through a commutator that counterbalances the animal movement inside the testing chamber. A representative threshold response of the pop spike is displayed.\nScan the evoked responses with incremental stimulus intensity of a single pulse (60 μs duration) to determine the threshold for a population spike (pop spike, Figure 7[href=https://www.wicell.org#fig7]). Take 80% of the threshold as the current intensity of DBS for this given mouse.\nCritical: The DBS current intensity is always below the threshold required to elicit an afterdischarge (e.g., a neuronal discharge that occurs after termination of the stimulus).\nChronic DBS application in freely moving mice\nTiming: 1.5 h\nThe goal of this step is to set up the system for chronic DBS in freely moving mice and administer the daily DBS.\nSet up the DBS system (Figure 8[href=https://www.wicell.org#fig8]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1311-Fig8.jpg\nFigure 8. System for chronic DBS delivery\nA Master-8 stimulator generates the stimulus pattern that controls the output of a stimulus isolator. The constant current output pulses are delivered to the mouse through a commutator and the customized wiring system as shown in Figure 3[href=https://www.wicell.org#fig3].",
    "Use a programmable stimulator (e.g., Master-8) and set the output as continuous train stimulation at 130 Hz, 60 μs pulse duration.\nConnect the output of the programmable stimulator (e.g., Master-8) to the input of a stimulus isolator with constant current output (e.g., A365R). Set the isolator output as a bipolar rectangular pulse model, and the stimulus intensity to the given current value for each animal.\nConnect the isolator output to the commutator and then to the implanted DBS electrode assembly through the custom-made adaptor and wire system (Figure 3[href=https://www.wicell.org#fig3]).\nLeave the mouse in the Plexiglas chamber and deliver the chronic daily DBS (e.g., 1 h per day for 2 weeks in this study).\nCritical: 1) To ensure delivery of DBS, use a multimeter to check the connection between the stimulator and the DBS electrode assembly daily before DBS; 2) Habituate the mice in the DBS room for 30 min daily before connecting them to the DBS system; 3) Experimenter should be present during the DBS session to make sure the wire connections remain intact and monitor the mouse for any untoward events (e.g., you may discover an unexpected seizure tendency in a given mouse model and have to reduce or stop DBS).\nClassic fear conditioning task\nTiming: 30 min habituation + 10 min training + 20 min testing\nThe goal of this step is to evaluate the benefits of forniceal DBS on hippocampal learning and memory. ANY-maze software package provides experimental control, data acquisition and analysis.\nSet up the fear conditioning system (Figure 9[href=https://www.wicell.org#fig9]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1311-Fig9.jpg\nFigure 9. Fear conditioning system",
    "The fear conditioning chamber is set inside a sound attenuation cubicle mounted with a loudspeaker, an overhead camera, and a house light. ANY-maze is used to control the delivery of sound and foot shock, record the mouse behavior, and analyze the data.\nInside a sound attenuation cubicle, set up the fear conditioning chamber, an overhead USB camera, a loudspeaker, and a house light.\nConnect the metal grating floor of the fear conditioning chamber to the electric shocker.\nInstall ANY-maze software on a PC computer.\nConnect the USB camera to the computer.\nUse AMi 2 audio and digital interfaces of ANY-maze to connect the loudspeaker and the shocker with the computer, respectively.\nSet up the experimental parameters: sound, 5 KHz, 85 dB tone; foot shock, 0.7 mA current, 2 s.\nThree weeks after the 2-week DBS session, habituate the mice for 30 min before training or tests in the test room with 150 lux light intensity and 60 dB background white noise.\nFear conditioning training (Figure 10[href=https://www.wicell.org#fig10]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1311-Fig10.jpg\nFigure 10. Fear conditioning protocol\nFor fear conditioning training, after 2 min of exploration in the conditioning chamber, mice receive two pairs of tone-foot shock presentations which are separated by 1 min. For contextual memory tests, the mice are scored for 3 min in the conditioning chamber without tone or foot shock. For cued memory tests, mice in a novel context receive 3 min of tone presentation after 3 min of exploration in the new chamber.\nClean the fear conditioning chamber with 70% ethanol.",
    "Put a mouse into the fear conditioning chamber. After 2 min of exploration, deliver the first tone – foot shock pairing (30 s tone co-terminated with 0.7 mA, 2 s foot shock). Repeat this tone – foot shock pairing 1 min later. Bring the mouse to the home cage after an additional minute.\nClean the chamber with 70% ethanol for the next mouse.\nRetention test of fear memory 24 h after fear conditioning training.\nFor contextual fear memory, put the mice back into the training chamber once it has been cleaned with 70% ethanol. Record the mouse behavior for 3 min without tone or foot shock presentation for off-line analysis.\nFor the cued fear memory test, place the mice into a new environment that is different from the training chamber in shape, texture, smell (1% acetic acid), and house light intensity. After 3 min of exploration, the same tone for the training is presented for 3 min. Record the mouse behavior for a total of 6 min for off-line analysis.\nCritical: Before using ANY-maze tracking system to score the freezing level of mice, it is crucial to manually calibrate the settings of freezing detection.\nHistological verification of electrode placement\nTiming: 2 h\nThe goal of this step is to histologically verify the tip sites of DBS and recording electrodes in the mouse brain.\nEuthanize the mice at the end of experiments. Then, apply anodal current (30 μA, 8 s) through one of the DBS electrodes and the recording electrode to the CA1 region.\nDissect the mouse brain and freeze it in cold 2-methylbutane. Store the brain in −20°C for at least 24 h before sectioning.\nCut the brain for 30 μm-thick sections using a cryostat microtome and mount the sections on the glass slides directly.",
    "Stain the sections with 0.4% cresyl violet for ∼1 min.\nExamine the sites of DBS and recording electrodes under a microscope (Figure 11[href=https://www.wicell.org#fig11]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1311-Fig11.jpg\nFigure 11. Photomicrographs illustrating electrode placement\n(A) DBS electrode in the fimbria-fornix (arrowhead).\n(B) Active recording electrode in the CA1 (black arrowhead) and reference electrode in the corpus callosum (white arrowhead). cc, corpus callosum; LV, lateral ventricle; D3V, dorsal third ventricle; DG, dentate gyrus."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Model Organisms",
    "Behavior",
    "Cognitive Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Ecology & Environmental Biology"
  ]
}