{
  "id": 19290,
  "origin_website": "Jove",
  "title": "Performing and Processing FNA of Anterior Fat Pad for Amyloid",
  "procedures": [
    "Introduction\nSystemic amyloidosis is a highly variable disease that refers to extracellular deposition of various proteins that are collectively referred to as amyloid. Deposition of these amyloid fibrils with beta pleated configuration leads to various clinical presentations depending on the organs involved. The most clinically relevant manifestations of systemic amyloidosis are noted when there is involvement of critical organs such as the heart, liver, and/or kidney.  Historically, these involved organs would be biopsied to demonstrate the presence of amyloid.  These moderately invasive procedures carried a significant risk including hemorrhage.  Fat pad aspiration has since been shown to provide a reliable and noninvasive method for the detection of amyloid in systemic amyloidosis 1. This procedure is essentially comparable to the liposuction of the subcutaneous fat in the anterior abdominal wall under local anesthesia to retrieve fibroadipose tissue for evaluating scant amyloid deposits in small blood vessel walls 2.\nThe most frequently utilized method for amyloid identification in tissue remains the characteristic apple-green birefringence pattern seen when Congo red stained sections are visualized under a polarized light microscope 3.  When fat pad aspiration is performed, Congo red stains can be done on either direct smeared slides or cell block preparations of the aspirated adipose tissue.   However, patients in early stages of amyloidosis have scant amyloid deposits, which greatly reduces the sensitivity of Congo red stained cell block sections 4,5. Ultrastructural evaluation of fat pad aspirates by electron microscopy has better reproducibility and improved sensitivity 4. Therefore, it is recommended to submit all fat pad aspirates for both preparation of a cell block and for performing electron microscopy 2.",
    "Fat pad aspiration is a relatively low cost and noninvasive method for obtaining tissue to diagnose systemic amyloidosis.  This article describes fat pad aspiration procedure along with details about sample processing to submit specimen for both Congo red staining and ultrastructural evaluation by electron microscopy.   In this video, we demonstrate this reproducible and simple procedure to retrieve optimal diagnostic material.\n1. Performing the FNA of Anterior Fat Pad\nA. Anesthetization of the local area (Figure 1 & 2)\nUsing alcohol swabs or the skin cleansing agent preferred by a particular institution, clean the skin on the lower quadrant area of the abdomen lateral to the midline  and below the umbilicus (Figure 1).\nMark a rhomboid shaped area about 2 x 2 inches as shown in Figure 1 with a marking pen.\nAspirate approximately 10 mL of 1% lidocaine with an 18G needle. Attach a 25G 1 ½ inch needle to the syringe.  Remove any trapped air by tapping the upright syringe while pressing the plunger until liquid is dispensed and no air bubbles are present.",
    "Anesthetize along the borders of the rhomboid area already marked as shown in Figure 2. Start by inserting the 25G needle just under the skin at point A and carefully push the needle subcutaneously to point X. Pull back on the syringe plunger to ensure that you are not within a vessel. Then slowly push the plunger to  infiltrate up to 2.5 mL of lidocaine (about ¼ of the lidocaine in 10 mL syringe) while withdrawing  the needle to point A without letting the needle come out of the skin at point A (Figure 2a3). With the needle still under the skin change the direction towards point Y (Figure 2a4) and push the needle subcutaneously to point Y (Figure 2b1). As before, confirm that the needle is not in a vessel and dispense approximately 2.5 mL of lidocaine while slowly withdrawing the needle through point A (Figure 2b3 through 2b4).  Repeat similar steps starting from point B and dispensing lidocaine subcutaneous from points B to X and B to Y (Figure 2c1 through 2d4).   Prevent bleeding from the pricks A and B by firm application of sterile gauge piece.\nYou may now check that the area is anesthetized by lightly touching the skin within the anesthetized rhomboid by tip/corner of cotton gauze piece, by comparing with adjacent unanesthetized skin.\nB. Performing fat pad aspiration (Figure 3)",
    "(Application of local anesthesia prior to performance of fat pad aspiration may be bypassed, depending on the regional and individual preferences. Properly performed FNAB procedure for anterior fat pad aspiration can be completed in one prick. However, depending on the pain threshold of individual patient, maneuvering of 18G needle back and forth in to the subcutaneous fat tissue is relatively distressing. The anesthetization method described here achieves the effect in only two pricks with 25G needle and averts the pain with improved tolerance to the procedure.)\nAssemble 18G 1 ½ inch needle onto a 10 mL syringe. Mount the syringe-needle assembly in the syringe grip (\"FNAB grip/gun\") for proper application and release of vacuum.\nInsert the tip of the needle into the subcutaneous fat within the cleansed and anesthetized rhomboid area (Figure 3a).\nFully retract the plunger of the syringe with the needle inserted in the subcutaneous tissue to generate vacuum (Figure 3b).\nMaintain the vacuum and maneuver the needle back and forth in various directions in to the subcutaneous fat (Figure 3c through 3i).  Each stroke should be as long as possible with the length of the needle selected without letting the needle come out of the skin.  Maximum sampling is achieved by changing direction with each stroke (Figure 3i).  It is important to keep the direction of the needle tangential to the serosa and parallel to the skin surface to avoid puncturing of the peritoneal cavity.\nThe fibroadipose tissue accumulates in the syringe. Once enough   fibroadipose tissue fragments (up to 1 mL of fragments rich blood mixed specimen) are retrieved, release the vacuum completely and remove the needle (Figure 3k).\nHave the patient or the assistant apply firm pressure on the area of procedure with a pad of gauze to prevent extravasation of blood.\n2. Specimen Processing",
    "Place at least 5-6 fragments of fibroadipose tissue in glutaraldehyde solution for electron microscopy (Figure 4B).\nDepending on the institutional protocol, a few smears of the fibroadipose tissue fragments may be prepared by spreading them between two slides (Figure 4A).\nThe remaining material is allowed to clot in the syringe (this may take 5-7 minutes, depending on the clotting time) (Figure 4C).\nAspirate 10% formalin in the syringe so that the clotted fibroadipose tissue material is dislodged from the wall of the syringe and free floating (Figure 4C2). Remove the plunger from the syringe (Figure 4C3) and transfer the clotted fibroadipose tissue into the 10% formalin container from the open end of the syringe opposite the nozzle end (Figure 4C4).\nLabel the containers appropriately and submit the glutaraldehyde for electron microscopy and the formalin for H & E section and Congo red stain for evaluation under polarizing microscopy.  If smears are prepared, they may be processed according to the protocol of the individual laboratory.\nimgsrc://cloudfront.jove.com/files/ftp_upload/1747/1747fig1.jpgFigure 1. Area to be anesthetized for FNAB of anterior fat pad.\nimgsrc://cloudfront.jove.com/files/ftp_upload/1747/1747fig2.jpgFigure 2. Anesthetization of the local area.\nimgsrc://cloudfront.jove.com/files/ftp_upload/1747/1747fig3.jpgFigure 3. Performing FNAB of anterior fat pad.\nimgsrc://cloudfront.jove.com/files/ftp_upload/1747/1747fig4.jpgFigure 4. Processing of anterior fat pad aspirate to be submitted to laboratory for detecting amyloid deposits.\n3. Representative Results\nimgsrc://cloudfront.jove.com/files/ftp_upload/1747/1747fig5.jpgFigure 5. Amyloid in the wall of small blood vessels in fibroadipose tissue fragments. Fibroadipose tissue was formalin-processed, paraffin embedded, stained with Congo red, and examined by polarizing light microscopy.  Amyloid in the wall of small blood vessels shows apple green birefringence (white arrow).\nimgsrc://cloudfront.jove.com/files/ftp_upload/1747/1747fig6.jpgFigure 6.  Tissue lacking amyloidosis. The apple green birefringence is absent in tissues of a different patient without amyloidosis.  Blue birefringence (white arrow) of collagen fibers, are usually present in almost all specimens.",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/1747/1747fig7.jpgFigure 7. Fibrils consistent with amyloid in the blood vessel wall. Electron micrograph of straight, non-branching, randomly-scattered 8-10 nm diameter fibrils formed by amyloid in the blood vessel wall."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}