{
  "id": 12265,
  "origin_website": "Jove",
  "title": "A Unified Methodological Framework for Vestibular Schwannoma Research",
  "procedures": [
    "Written informed consent for the collection of all samples was obtained prior to surgery, and the experiments were carried out according to the Code of Ethics of the World Medical Association (Declaration of Helsinki). All sections of the study protocol were approved by the Institutional Review Board of Massachusetts Eye and Ear and Massachusetts General Hospital.\nNOTE: Sections 1-7 below are designed to be performed sequentially upon the receipt of a primary human VS or GAN sample from the operating room. Processing should always begin with section 1. Then, as a rule, RNA should be preserved first (section 2), followed by the preparation of tissue for the collection of secretions (section 3) and protein extraction (section 4). Tissue to be cultured (section 5 for VS, section 6 for GAN) can sit in supplemented culture medium while sections 2, 3, and 4 are performed. The fixation of tissue for sectioning (section 7) is very short and can be performed during any centrifugation step. Section 8 (perilymph processing) and section 9 (CSF processing) can be carried out upon the receipt of perilymph or CSF from the operating room during a translabyrinthine VS resection. Section 10 (viral transduction) can be performed on growing VS or Schwann cells in culture.\n1. Preparation for and Receipt of a Surgical Sample\nNOTE: The following steps are to be performed in a sterile environment, such as a tissue culture hood or laminar flow hood. Familiarity with basic sterile technique is expected.\nPreparation of medium for primary human VS or Schwann cell culture\nThaw a 50 mL aliquot of frozen fetal bovine serum (FBS) in a 37 °C water bath.\nAdd 5 mL of penicillin/streptomycin mix to a 500 mL bottle of DMEM/F-12, resulting in a final dilution of 1:100.",
    "Add the 50 mL of thawed FBS to the 500 mL bottle of DMEM/F-12, resulting in a final dilution of 1:10.\nWrite the date, researcher's initials, and supplemental information (e.g., 1% P/S, 10% FBS) on the bottle.\nPlace the new culture medium in the refrigerator (4 °C).\nReceipt and cleansing of VS or GAN sample\nIn the operating room, place the freshly harvested VS or GAN sample into sterile saline in a specimen container. Transport the sample on ice from the operating room to a laminar flow hood in the laboratory.\n\t\tNOTE: Sample sizes and weights vary significantly between patients based on the size of the relevant tumor or the amount of excised nerve.\nRemove stock-solution aliquots of hyaluronidase (25,000 U/mL) and collagenase (3,200 U/mL) from the freezer and let the enzymes thaw at room temperature (required for step 5.1.4 or 6.1.6, depending on whether the specimen is a VS or a GAN).\n\t\tNOTE: The resuspension of lyophilized enzymes is described in detail on the product information sheets. Collagenase can be resuspended in any calcium-free balanced salt solution and hyaluronidase in a solution of 0.02 M phosphate buffer (pH 7.0), 77 mM NaCl, and 0.01% of 1 mg/mL bovine serum albumin. The specific activity for each lyophilized enzyme varies with the lot and should be verified prior to resuspension.\nUsing a series of three 1.5 mL tubes filled with 1.4 mL of 1x sterile PBS, wash the VS or GAN specimen three times. Carefully transfer the specimen from tube to tube with sterile forceps. Close each tube once it contains the specimen, and shake gently to wash.\n\t\tNOTE: To avoid flooding the 1.5 mL tubes, less than 1.4 mL of PBS can be used per tube if the tumor piece is large.",
    "Put the sample into a dry 60 mm Petri dish and use forceps to remove all dead tissue (i.e., cauterized portions, which are usually white or opaque in color) and areas with prominent blood vessels.\nUse forceps or a scalpel blade to divide the sample into separate pieces for RNA preservation, protein extraction, secretion collection, fixation, and cell culture (see sections 2 - 6, below).\nTransfer the piece of the specimen designated for cell culture (section 5/6) to a new 60 mm culture dish containing 5-8 mL of cold, supplemented DMEM/F-12 medium (alternatively, the lid of the first culture dish can be used for this step).\n\t\tNOTE: The amount of DMEM/F-12 medium needed (from step 1.1) will depend on the size of the tumor or nerve, but it should fall between 5 and 8 mL. This piece can sit in culture medium while the subsequent steps are performed.\n2. RNA Preservation of VS and GAN Tissue (Also Valid for Human Sensory Epithelium)\nUnder the laminar flow hood, transfer 1-1.2 mL of RNA stabilization solution to a new 1.5 mL tube.\nAfter washing the specimen with PBS (step 1.2.3), briefly dip the small piece of tissue designated for RNA preservation (approximately 3 mm3 of VS or a 5 mm length of GAN) into the RNA stabilization solution. Ensure that the specimen is completely immersed in the solution.\nPrepare and label a new 1.5 mL tube. Retrieve the specimen from the RNA stabilization solution, transfer it to the new tube, and store it in a -80 °C freezer.\n3. Collection of the VS and GAN Secretions\nDay 1\nAfter washing the specimen with PBS (step 1.2.3), place the piece of VS or GAN designated for the collection of secretions into an empty 1.5 mL tube.",
    "Prepare two additional 1.5 mL tubes and pipette 500 µL of DMEM (not supplemented with FBS) into each tube.\n\t\tNOTE: The first tube of DMEM will be used to collect the tumor secretions, and the second tube of DMEM will serve as a matched control. Secretions can be collected in DMEM, any other typical culture medium not supplemented with serum, or PBS.\nPlace one of the DMEM-containing tubes onto a calibrated digital scale. Tare the scale, such that when the tube sits atop the scale, it reads 0 mg.\nRemove the tube of DMEM from the scale, place the piece of specimen designated for the collection of secretions into the tube, and weigh it. Note the result, which will represent the weight of the tissue alone.\nUnder a laminar flow hood, adjust the volume of DMEM in the tube to 100 µL per 10 mg of specimen.\nPlace the tube containing the tissue sample and its matched control (DMEM alone) into the incubator (37 °C, 5% CO2) for a period consistent with the plans for this experiment. Incubate the tissue for at least 72 h to collect biologically useful quantities of tumor or nerve secretions15.\nDay 4\nAfter incubation for 72 h, remove the secretion-containing medium from the specimen (i.e., tissue-conditioned medium) using a 1 mL pipette. To prevent repeated freeze-thaw cycles, aliquot the medium into new tubes according to the planned downstream analyses (e.g., to run an ELISA with 4 wells requiring 50 µL each, aliquots of 210 µL can be prepared).\nIf required, freeze the tissue piece remaining in the original tube (already labeled on Day 1) at -80 °C for additional analyses, such as DNA extraction, at a later date.",
    "Store the tissue, secretions, and control DMEM in a -80 °C freezer until the downstream applications are initiated (e.g., ELISAs, LC-MS/MS, cytokine arrays, etc.).\n4. Protein Extraction from VS or GAN Tissue\nPreparation of fortified RIPA buffer\nAdd one tablet of phosphatase inhibitor and one tablet of protease inhibitor to 10 mL of RIPA buffer in a 15 mL tube; this is fortified RIPA buffer.\n\t\tNOTE: Store the RIPA buffer at 4 °C and add the tablets just prior to use.\nProtein extraction\nTransfer 210 µL of fortified RIPA buffer (step 4.1.1) to a new 1.5 mL tube.\nAfter washing the specimen with PBS (step 1.2.3), transfer the small piece of tissue designated for protein extraction (approximately 3 mm3 of VS or a 5 mm length of GAN) to the RIPA buffer-containing tube and place it on ice for at least 10 min. If studying phosphorylated forms of proteins, supplement the RIPA buffer with protease and phosphatase inhibitors14. In the meantime, steps for other components of the tissue processing, such as fixation (section 7), can be carried out.\nPre-cool the centrifuge to 4 °C.\nUsing a plastic pestle, homogenize the tissue in the RIPA buffer-containing tube. Sonicate the tissue for 10-15 s at 20% amplitude. Ensure that the specimen remains on ice, even during sonication.\nCentrifuge for 10 min at 15,000 x g and 4 °C.\nAliquot the supernatant in 50 µL increments into new 0.5 mL tubes (depending upon the intended downstream applications, any increment size can be chosen).\nStore the aliquots of protein lysate in a -80 °C freezer until the downstream applications are initiated (e.g., ELISAs or Western blots)20,21.\n5. Primary Human VS Culture\nDay 1",
    "Separate the VS tissue designated for cell culture (which has been sitting in culture medium, as described in step 1.2.6) into approximately 1 mm3 pieces using a pair of forceps in each hand.\nAspirate the tumor piece-containing medium with a 10 mL serological pipette and transfer all contents to a 15 mL conical tube.\nCentrifuge for 3 min at 1,000 x g and 25 °C.\nPrepare disintegration medium in a new 60 mm culture dish by combining 4.7 mL of supplemented DMEM/F-12 medium with 250 µL of collagenase (final concentration: 160 U/mL) and 50 µL of hyaluronidase (final concentration: 250 U/mL), for a final volume of 5 mL.\n\t\tNOTE: Both enzymes should be stored in a -20 °C freezer but thawed prior to the preparation of this medium (step 1.2.2).\nAfter centrifugation, the tumor pieces will form a pellet at the bottom of the conical tube. Carefully pipette off and discard the supernatant.\nAdd 2 mL of the freshly made enzyme-containing disintegration medium (step 5.1.4) to the tumor pellet. Pipette up and down several times to mobilize the tissue and transfer the tumor-piece containing medium to the 60 mm culture dish.\nPlace the culture dish into the incubator (37 °C, 5% CO2) for 18 h.\nDay 2\nWarm DMEM/F-12 medium supplemented with 10% FBS and 1% penicillin/streptomycin (prepared in step 1.1) in a 37 °C water bath.\nRemove the petri dish containing the VS culture from the incubator (step 5.1.7). Using a 22 G needle attached to a 6 mL syringe, aspirate the culture-containing medium and transfer it to a new 15 mL conical tube.\nCentrifuge for 5 min at 1,000 x g and 37 °C.\nIn the meantime, use sterile forceps to place the required number of poly-D-lysine- and laminin-coated glass coverslips into a 24-well culture plate.",
    "NOTE: The number of wells to be cultured depends on the size of the specimen; approximately 24-32 wells can be cultured from a 1 cm3 tumor, so for most smaller tumors, planning for 8-16 wells of cultured cells is appropriate.\nAfter centrifugation, discard the supernatant (i.e., enzyme-enriched medium) and resuspend the residual cell pellet in fresh, supplemented DMEM/F-12 medium, pre-warmed in step 5.2.1.\n\t\tNOTE: The volume in which to resuspend the pellet is determined by the number of wells planned in step 5.2.4, estimating 1 mL of medium per planned well.\nAspirate 2 mL of the resuspended cell medium (step 5.2.5) using a 5 mL serological pipette. Deposit 1 mL of the tumor cell-containing medium into each prepared well of the 24-well plate.\nContinue aspirating and depositing tumor cell-containing medium (aspirating in increments of 2 mL, from which 1 mL is deposited into each planned well) until the tumor cell suspension is equally divided between all prepared wells.\nPlace the 24-well plate into the 37 °C incubator overnight.\nDay 3\nIf significant debris is noted on the bottom of the wells, carefully change the medium in each well to new supplemented DMEM/F-12 culture medium, taking care not to dislodge adherent cells. If not, return the plate to the incubator and change the medium for the first time on Day 5.\nDays 5-7 and afterwards\nChange the medium every 3 days.\n\t\tNOTE: Primary human VS and GAN cells are generally maintained in culture until their use in downstream applications, at or around 14 days of age. Culture purity decreases after this19.\n6. Primary Human GAN Culture\nDay 1\nUnder a dissecting microscope, isolate fascicles from the tissue designated for the GAN culture (which has been sitting in culture medium, as outlined in step 1.2.6).",
    "Isolate the fascicles from the epineurium and fibrous sheath by pulling on the perineurium using no. 5 forceps while clasping the epineurium with no. 3 forceps.\nOnce the fascicles are sufficiently isolated from the surrounding epineurium, transfer them to a new culture dish containing 2 mL of fresh supplemented medium.\nCut the fascicles into 1 to 2 mm segments using the scalpel blade.\nPipette the small fascicle pieces and surrounding medium into a 15 mL tube containing 3 mL of fresh supplemented culture medium, such that the total volume in the 15-mL tube becomes 5 mL.\nCentrifuge the specimen for 3 min at 1,000 x g and 25 °C.\nIn the meantime, make a Schwann cell culture medium in a new 60 mm Petri dish by combining 4.7 mL of supplemented DMEM/F-12 medium, 250 µL of collagenase, and 50 µL of hyaluronidase, for a final volume of 5 mL.\n\t\tNOTE: Store both enzymes at -20 °C; thaw them at room temperature before preparing this medium (step 1.2.2).\nAfter the centrifugation of the specimen, the fascicles will condense into a small pellet in the conical tube. Discard the supernatant.\nAdd 2 mL of the freshly made enzyme-containing disintegration medium (step 6.1.6) to the nerve pellet. Pipette up and down several times to mobilize the tissue and transfer it to a new 60 mm culture dish.\nPlace dish in the incubator (37 °C, 5% CO2) for 20-22 h.\n\t\tNOTE: This is a longer incubation than is needed for VS samples (step 5.1.7).\nDay 2\nWarm supplemented DMEM/F-12 medium in a 37 °C water bath.\nUsing a 22 G needle attached to a 6-mL syringe, aspirate the cell culture-containing medium and transfer it to a new 15 mL conical tube.\nCentrifuge for 5 min at 1,000 x g and 37 °C.",
    "Discard the supernatant and resuspend the sample in new, pre-warmed, supplemented DMEM/F-12 culture medium.\nUse sterile forceps to place the required number of coated coverslips into the wells of a 24-well culture plate.\n\t\tNOTE: Calculating two wells of cultured cells per 1-cm nerve specimen promotes robust culture growth.\nAdd 1 mL of the culture-containing medium to each designated well in the 24-well plate.\nPlace the 24-well plate into the incubator at 37 °C and 5% CO2.\nDay 3\nIf significant debris is noted in the wells, carefully replace the medium with new supplemented DMEM/F-12 culture medium, taking care not to dislodge adherent cells. If not, return the plate to the incubator and change the medium for the first time on Day 5.\nDays 5-7 and afterwards\nChange the medium every 3 days.\n7. VS & GAN Tissue Fixation\nPipette 1-1.2 mL of 4% paraformaldehyde (PFA; CAUTION) into a new 1.5 mL tube.\nAfter washing the tumor or nerve with PBS (step 1.2.3), transfer a small piece of tissue (approximately 3 mm3 of VS or a 5 mm length of GAN) into 4% PFA and place the tube on a shaker at 4 °C. Ensure that the specimen is completely immersed in the solution.\nAfter at least 2 h of fixation, retrieve the tube from the shaker and proceed with further processing (e.g., embedding in paraffin or optimal cutting temperature compound (OCT) for subsequent immunohistochemistry or immunofluorescence)22,23,24. Alternatively, the tissue can be snap-frozen, as previously described25,26.\n8. Collection and Storage of Human Perilymph during Translabyrinthine VS Resection\nPlace three sterile 1.5 mL tubes on ice.\n\tNOTE: One tube will be kept as a backup in case of contamination.\nFill one 1.5 mL tube with approximately 1.2 mL of PBS solution that has been filtered twice using a 0.22 µm filter.",
    "NOTE: To collect perilymph during a translabyrinthine VS resection, the surgeon must first ensure that the surgical field is free of bone dust, blood, or saline. The surgeon can use a Schuknecht 21 or 24 G suction tube in the non-dominant hand for this purpose.\n\tA typical place from which to extract perilymph is the lateral semicircular canal (however, the posterior semicircular canal or round window membrane can also be accessed, depending on the surgeon's preference). The surgeon should carefully remove the labyrinthine bone with a diamond bur (while using continuous suction irrigation) to identify the blue line (i.e., the membranous labyrinth) of the semicircular canal. The semicircular canal is penetrated through the blue line using a long 27 G needle attached to a 1 mL tuberculin syringe.\nAsk the surgeon to gently aspirate a small amount of perilymph and then pass the syringe and attached needle to the surgical nurse.\n\tNOTE: Typically, a drop of perilymph or less is collected. If the observed volume is larger, the sample is likely contaminated with other fluid.\nOpen the prepared, empty 1.5 mL tube and the tube filled with PBS directly prior to use. Be careful not to touch the inside of the tube lids while opening them.\nReceive the syringe and attached needle from the surgical nurse and purge the fluid completely into the empty tube, taking care not to touch the tube itself with the needle.\nCarefully detach the needle from the syringe. Do not contaminate the needle tip, and continue to hold it in one hand.\n\tNOTE: A very small volume of perilymph has been collected, so some fluid may remain in the long tip of the needle.",
    "With the other hand, use the syringe itself (without the needle) to suck 0.2 mL of filtered PBS solution from the prepared tube into the body of the syringe.\nReattach the needle to the syringe. Fully evacuate the syringe into the tube containing perilymph, using the sterile PBS to flush the needle tip.\nClose the perilymph- and PBS-containing tube and place it on ice.\nDispose of the needle in a sharps container.\nPlace the tube containing perilymph in the -80 °C freezer as soon as possible.\n9. Collection and Storage of Human CSF\nPlace three (or more) sterile 1.5 mL tubes on ice.\n\tNOTE: One tube will be a backup in case of contamination or a sample volume that is larger than expected.\nAfter opening the dura mater, ask the surgeon to collect CSF with a 3 mL syringe (without an attached needle).\n\tNOTE: To prevent contamination, CSF collection should take place immediately following the opening of the dura mater.\nAsk the surgeon to hand the syringe to the surgical nurse.\nReceive the syringe from the surgical nurse and fully evacuate the required volume of CSF into the tube(s).\nClose the tube(s) and place them on ice.\nPlace the tube(s) in the -80 °C freezer as soon as possible.\n10. Viral transduction experiments for primary VS cells\nUsing the viral stock concentration as a reference, calculate the desired genome count (gc) number and multiplicity of infection (MOI) necessary for the proposed transduction experiment; virus stock can be diluted directly into supplemented culture medium.",
    "NOTE: Any viral vector suitable for primary cell transduction can be used; see Landegger et al. (2017) for a detailed comparison of six different adeno-associated virus serotypes27. Additionally, when culturing primary human cells, cell counts are not typically determined before plating onto coverslips. Primary VS cells do not respond well to trypsinization and passaging, so for a reliable MOI calculation, the number of adherent cells per well can be estimated using a phase contrast microscope. Alternatively, if cells are close to confluence, their numbers can be reliably estimated by using standard cell density values for a 24-well plate (e.g., 5 x 104 cells per well).\nUnder a laminar flow hood, prepare supplemented medium containing the desired amount of virus in a 15 mL conical laboratory tube, such that 1 mL of virus-containing medium is prepared for each well of cells to be transduced. Pipette the virus-containing medium up and down to mix gently but thoroughly.\nUsing sterile forceps, transfer the coverslips containing primary VS cells (step 5.2.8) from the original 24-well plate to a new 24-well plate. After the transfer of each individual coverslip, add 1 mL of virus-containing medium. Swirl the plate each time medium is added to ensure that the cells are coated evenly with the virus.\nIncubate at 37 °C and 5% CO2 for the duration of the planned experiment.\n\tNOTE: Incubations ranging from 48-120 h have all shown promising transduction results27.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}