{
  "id": 18931,
  "origin_website": "Jove",
  "title": "Pharmacologic Induction of Epidermal Melanin and Protection Against Sunburn in a Humanized Mouse Model",
  "procedures": [
    "1. Preparation of Forskolin for Topical Administration from a Crude Root Extract of the Plectranthus barbatus (Cohleus forskohlii) Plant\nProtocols for murine experiments followed the guidelines for ethical conduct in the care and use of animals and were approved by the Institutional Animal Care and Use Committee at the University of Kentucky (Protocol # 00768M2004). The root extract is made up at 40% weight/volume in a standard dermatologic base of 70% ethanol, 30% propylene glycol.\nWeigh 200 g of crude forskolin root extract and transfer it to a beaker. To make 500 ml of a 40% (w/v) solution, resuspend 200 g of crude forskolin root extract by adding most but not all of the volume of the vehicle (70% ethanol, 30% propylene glycol) and bring the solution to roughly 450 ml.\nStir for an hour at room temperature. The solution will be somewhat viscous and may require manual agitation to \"lift\" the extract into solution before the stir bar is able to take over.\nAfter an hour of stirring, pour the mixture into a graduated cylinder and bring the volume to 500 ml using vehicle that has been used to \"rinse out\" the beaker that was used to stir the slurry (to maximize recovery of forskolin from the beaker).\nTransfer the slurry to 50 ml polypropylene centrifuge tubes. Centrifuge (1,500 x g, room temperature, 15 min) using a table-top centrifuge. At this point, the insoluble material will be fairly compacted, allowing the supernatant to be easily poured off.",
    "Filter the solution through a 0.22 μm cellulose acetate membrane to remove any residual insoluble material from the extract. We use a bottle-top system designed for cell culture, along with the use of pre-filters that come with the unit to prevent premature clogging of the membrane from insoluble components of the root extract. When making large volumes of the extract, filter roughly 100 ml at a time, changing the pre-filter between each added volume.\nWhen stored at room temperature, the extract maintains biologic activity up for up to one year.\n2. Preparation of C57Bl/6 K14-Scf Mice for Topical Treatments\nRemove dorsal fur from the animals by electric shearing. Briefly anesthetize the animals with inhalational isoflurane to facilitate shearing of dorsal fur with electric shears outfitted with a 0.25 mm surgical preparatory head (Fisher Scientific). Preferably only use one type of anesthesia (e.g. ketamine/xylazine) to minimize risk of anesthetic overdose. The saturated inhalation chamber carries occupational risk when used outside a fume hood and delivers unknown amounts of anesthetic to animals.  Ideally a precision vaporizer should be used. \nTo remove residual hair stubble, treat the animals with a chemical depilatory. Administer anesthesia to the animal with an i.p. injection of ketamine 40 mg/kg  and xylazine 4 mg/kg\nOnce animals are adequately anesthetized (as judged by toe pinch), apply a fingertip-sized amount of depilatory cream to sheared dorsal skin using a gloved finger. Rub the cream into the skin for 30-60 sec or until hairs can clearly be seen in the cream as it is being moved around. Leave the cream on only for the minimum amount of time required for hair removal as prolonged exposure leads to chemical burning of the skin, epidermal breakdown and death from loss of epidermal integrity.",
    "Wipe the dorsal skin with water-soaked gauze pads repeatedly until all cream has been removed. Dry animals using soft paper towels, and allow them to recover in a warm secluded location (e.g. clean cages placed on a warming pad). Depilate the animals one-by-one and monitor closely throughout the procedure.\n3. Topical Administration of Forskolin or Vehicle Control\nAnimals should be treated one at a time. Briefly anesthetize with inhaled isoflurane by placing the mouse on top of a form-fitted nylon air-permeable filter under which has been placed an isoflurane-saturated paper towel in an isoflurane-saturated lidded clear glass jar in a fume hood. Expose the mouse to isoflurane for a sufficient time as to suppress voluntary muscular movements but to preserve spontaneous respiration (typically 10-20 sec). Leaving the animal in isoflurane too long will result in respiratory suppression and death. It is better to err on the side of \"going light\" and having to re-expose the mouse briefly to more isoflurane rather than to over-expose the animal to the drug and risk death.\nRemove the animal from the isoflurane chamber and place on a clean absorbent bench pad.\nUsing a 1,000 μl micropipette outfitted with a disposable polypropylene tip, draw up 400 μl of 40% crude forskolin extract (vehicle control animals will receive 70% ethanol, 30% propylene glycol alone).\nTransfer the extract onto the back of the animal by dripping it onto the skin and then, using the side of the pipette tip, smear the extract over the dorsal skin until all the skin has been covered. There is no need to blot the skin after application.\nReturn the mouse to its cage, and carefully observe until it recovers from anesthesia.",
    "In order that non-pigment cAMP effects should not confound UV sensitivity experiments, discontinue all topical treatments 2 days prior to UV exposure (pigment effect lasts several days beyond last topical treatment).\n4. Skin Color Measurement by Reflective Colorimetry\nBriefly anesthetize the mouse with inhaled isoflurane (see above).\nCalibrate a Minolta colorimeter by placing the portable head on the standardized white surface provided with the colorimeter.\nPlace the portable measuring head of the colorimeter flush with the dorsal skin of the animal ensuring that the 1 cm2 round aperture is completely pressed onto the skin. Take at least three separate measurements in different areas of dorsal skin.\nCalculate mean L* score ± SD per animal and per treatment group. Reflective colorimetry can be done at any point in the experiment.\n5. Determination of UV Sensitivity by Calculation of \"Minimal Erythematous Dose\" (MED)\nUse animals that have been pre-treated with either vehicle or forskolin as described above. Anesthetize animals with intraperitoneal injection of a standard mixture of ketamine and xylazine (see above).\nPrepare a piece of UV-occlusive tape for MED testing. To generate holes in the tape, use a heavy-duty hole punch with a 1 cm2 circular cutout (Figures 2A and B). Having holes of a defined size and symmetric arrangement in the tape facilitates recognition of skin changes after irradiation. Over each hole in the tape, apply a small but easily detachable piece of tape that can be removed at defined times during UV exposure to allow administration of different UV doses.\nOnce animals are adequately sedated, place the tape on the dorsal surface. Eye lubricant should always be utilized under anesthesia.",
    "Turn on the UV source consisting of two Westinghouse F15T8UV-B lamps with a peak output of 313 nm and a range of 280-370 nm. Allow the lamp to equilibrate to a constant UV output as measured by a UV photometer with a UVB sensor (generally takes a few minutes for the lamps to warm up).\nBased on the UV transmission rate as measured by the UV Photometer, calculate UV exposure time for each desired dose. For example, our lamp's UVB output measures 2.4 mW/cm2. Therefore, to administer 5 kJ/m2, the skin would need to be exposed to 208 sec (which is 3 min and 28 sec) of UVB radiation, as calculated below:\nimgsrc://cloudfront.jove.com/files/ftp_upload/50670/50670eq1.jpg\nPlace sedated animals (each with occlusive tape in place) ventral surface down to ensure even UV exposure. To administer the chosen doses of UV radiation, sequentially remove the small occlusive tapes covering the holes to expose 1 cm2 areas of skin to the correct doses of radiation. Therefore, using the above example, if 40 kJ/m2 is the largest dose in the experiment, then the animal would be under the lamp for 27 min and 47 sec total and the skin in the 40 kJ/m2 condition would have no overlying tape the entire time. However, tape overlying the 5 kJ/m2 condition would be removed when there is 208 sec remaining in the exposure. Timing of tape removal should be done so that each condition ends simultaneously.\nAfter UV exposure, peel off the tape from the dorsal skin carefully, taking care not to rip the skin with sudden or overly-forceful movements. Place animals in a warm quiet place to allow recovery from anesthesia.",
    "Monitor mice for 24-48 hr to look for discreet areas of erythema (redness) or edema (swelling) corresponding to the anatomic sites exposed to the specific dose of UV irradiation. Document skin findings photographically.\nMED value corresponds to the minimum dose of UV that causes inflammation as defined by erythema and/or edema of the entire exposed circle of skin. Note that pigmentation of the skin can challenge determination of MED, however, erythema and edema can still generally be accurately assessed, thanks in part to the defined shape of the apertures in the tape during UV exposure.\n6. Statistical Analysis\nAnalyze data between cohorts of mice by one way ANOVA with Bonferroni post test (Graph Pad PRISM). p values <0.05 are considered statistically significant.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}