{
  "id": 6927,
  "origin_website": "Bio",
  "title": "High-level Production of Recombinant Membrane Proteins Using the Engineered <em>Escherichia coli</em> Strains SuptoxD and SuptoxR",
  "procedures": [
    "The use of the engineered E. coli strains SuptoxD and SuptoxR for the high-level production of recombinant MPs is outlined in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200802/20200802203136_3448.jpgFigure 1. Overview of the E. coli SuptoxD and SuptoxR systems. The toxicity-suppressing and cellular production-promoting capabilities of E. coli SuptoxD and SuptoxR that result in dramatically enhanced volumetric yields for various recombinant MPs, are based on the overexpression of the E. coli genes djlA or rraA, respectively. The effector genes are overexpressed from the vectors pSuptoxD and pSuptoxR under the control of the araBAD promoter and its inducer L(+)-arabinose. For the production of recombinant MPs in these strains, we typically use pASK75-based plasmids under the control of a tet promoter and its inducer aTc (pASK-MP vector).The procedure of the recombinant MP production and purification is outlined in Figure 2.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200802/20200802203218_6415.jpgFigure 2. Overview of the recombinant MP production and purification procedure using the E. coli SuptoxD and SuptoxR strains. A. Transform either one of the SuptoxD or SuptoxR strains with the plasmid encoding the MP of interest. B. Overexpress the MP of interest together with the pSuptoxD or pSuptoxR system, at 25 °C for 16 h and using the appropriate inducers. C. Lyse cells by sonication. D. Centrifuge the total cell lysates and transfer the soluble supernatant into an ultracentrifugation tube. E. Ultracentrifuge the soluble cell lysate and collect the pelleted membranes. F. Mechanically resuspend the membranes in DDM-solubilization buffer using a homogenizer. G. Rotate for at least 1 h at 4 °C. H. Ultracentrifuge and collect the supernatant containing the solubilized membranes. I-J. Purify the solubilized membranes using IMAC and SEC.MP overexpression in shake flasks (Under sterile conditions)Transform (chemically or electro-) competent SuptoxD or SuptoxR cells with the pASK-MP vector and plate on LB agar containing 100 μg/ml ampicillin and 40 μg/ml chloramphenicol.",
    "Notes: When performing recombinant production of a specific MP of interest for the first time, we recommend using both the SuptoxD and SuptoxR strains, in order to determine the particular strain that yields higher levels of MP production. For the expression of highly toxic or otherwise difficult-to-express MPs that accumulate at very low yields, we highly recommend to use the pSuptoxD or pSuptoxR plasmid in isolated form and perform double transformation of pSuptoxD or pSuptoxR with the pASK-MP plasmid in fresh competent E. coli MC1061 cells. Other E. coli strains can also be used as hosts for the pSuptox vectors. We have used the pASK75 vector backbone for the expression of the MP of interest extensively. However, other expression vectors can also be used, provided that they are compatible with the pSuptoxD/R system (chloramphenicol resistance, p15A origin of replication, araBAD promoter) and preferably contain an inducible promoter with tight regulation. Pick a single transformed bacterial colony and inoculate liquid LB cultures supplemented with the selection antibiotics 100 μg/ml ampicillin and 40 μg/ml chloramphenicol for pASK-MP and SuptoxD/R system maintenance. Incubate at 37 °C for 16 h with constant shaking at 200-220 rpm.Notes: We highly recommend using freshly transformed E. coli cells for all MP production experiments in order to obtain maximum protein yields. The volume of the LB cultures should be enough for next-day’s inoculation. The following day prepare a 2% sub-culture in fresh LB supplemented with the appropriate antibiotics, as well as 0.01% or 0.2% (w/v) L(+)-arabinose for the induction of the SuptoxD and SuptoxR system respectively. Incubate at 30 °C with shaking until an optical density at 600 nm (OD600) of 0.5.Notes: The recommended L(+)-arabinose concentrations have been determined following expression optimization in SuptoxD/R using certain model recombinant MPs (Michou et al., 2019).",
    "Other MPs, however, may require other concentrations for their optimal accumulation. Keep working stock solution of arabinose (20% w/v) in aliquots to avoid contamination. Initiate overexpression of the target MP by adding 0.2 μg/ml anhydrotetracycline (aTc) and incubate overnight at 25 °C with shaking.Notes: We highly recommend using freshly prepared and light-protected aTc. We highly recommend initiating MP overexpression at an OD600 of precisely 0.5 as we have found that deviations result in lower protein yields. We recommend to not exceed 16 h of overexpression in order to minimize the accumulation of genomic/plasmid mutations that suppress MP production. The recommended aTc concentration has been determined following expression optimization in SuptoxD/R using certain model recombinant MPs (Michou et al., 2019). Other MPs, however, may require other concentrations for their optimal accumulation. Harvest cells by centrifugation at 4,000 x g for 10 min at 4 °C.Check for MP production by western blotting or activity assay according to standard protocols.Notes: Due to the MP-induced toxicity, it is not unusual for genomic/plasmid mutations to accumulate and bypass the overproduction of MP. This will result in a high increase of the culture’s OD600 and low yield of MP production. For this reason, MP production should always be checked before continuing with MP purification. When overexpressing an MP-GFP fusion, the bacterial fluorescence can be used as an indicator of protein production. In this case, cells corresponding to an OD600 = 1 should be resuspended in 100 μl PBS and fluorescence should be measured: Using a 96-well plate reader at 510 nm after excitation at 488. Using a flow cytometer equipped with a 488 nm solid state laser for excitation and a 530/30 nm band pass filter for detection. In this case, events should be first gated in a forward scatter (FSC) vs.",
    "side scatter (SSC) plot in order to eliminate non-cellular events and then plotted in a histogram of fluorescence intensity detected by the FITC (fluorescein isothiocyanate) channel photomultiplier tube (PMT) vs. number of events, in order to estimate the mean fluorescence of the population. Bacterial membrane isolation and MP extractionResuspend a cell pellet from a 1 L culture in 10 ml ice-cold lysis buffer.Lyse cells by sonication for 4 x 25 s on ice, with a 1 min interval between each sonication.Centrifuge the total cell lysates (10,000 x g, 15 min, 4 °C) and transfer carefully the soluble supernatant into an ultracentrifugation tube.Ultracentrifuge the soluble fraction at 130,000 x g for 1 h at 4 °C using a 70-Ti rotor, in order to pellet the bacterial membranes.Collect the pelleted membranes using a spatula and mechanically resuspend them in 5 ml ice-cold DDM-solubilisation buffer using a homogenizer. The homogenate should contain no visible particles.Note: Care should be taken when collecting the membranes as they form a very sticky and difficult to handle pellet. Rotate the resuspension at 180 rpm for at least 1 h at 4 °C, in order for MP extraction to take place.Note: A range of different DDM concentrations and incubation periods should be tested in order to determine the optimal conditions for MP extraction. When using MP-GFP fusions or chromophore-containing MPs, such as certain bacteriorhodopsins (Michou et al., 2019), this procedure can be easily optimized by regular centrifugations and monitoring of the fluorescence levels or discoloration respectively, of the resulting pellet. Ultracentrifuge at 130,000 x g for 1 h at 4 °C and collect the supernatant that contains the extracted MP.Check for successful MP extraction by western blotting or activity assay according to standard protocols.",
    "Note: When overexpressing an MP-GFP fusion, we highly recommend using in-gel fluorescence analysis as a quality control of the extraction of well-folded and active MP (Geertsma et al., 2008). In this case, the following procedure should be followed:Mix 100 μl of the supernatant containing the extracted MP with 20 μl of 6x SDS loading dye.Load 50 μl of sample on a 4-20% precast polyacrylamide gel without prior boiling of the sample and run the gel at a constant voltage of 80 V.Visualize the MP-GFP fluorescent band on an imaging system, e.g., ChemiDoc-It2 Imaging System, equipped with a CCD camera and a GFP filter, after exposure of about 3 s.Western blotting of the analysed proteins according to standard protocols should result in the visualization of the MP’s dual band migration, with the lower band corresponding to the fluorescent and well-folded MP-GFP fusion and the upper band corresponding to non-fluorescent and misfolded MP-GFP fusion (Drew et al., 2008; Geertsma et al., 2008).Analyzing the same samples after boiling for 10 min with SDS-PAGE and western blotting results in full denaturation of the fusion and single band migration that lacks fluorescence.Store the supernatant on ice until further use or purification.Small-scale, two-step MP purification for initial studies using immobilized metal affinity chromatography (IMAC) and size exclusion chromatography (SEC) (All steps should be performed at 4 °C)Transfer 1 ml of Ni-NTA agarose resin to a 15 ml tube and remove the supernatant after brief centrifugation at low speed (1,000 x g, 1 min). Resuspend in 2 ml lysis buffer and mix by gently inverting.Mix the supernatant containing the extracted MP with the equilibrated resin from the above step at 4 °C for 1 h on a roller mixer.",
    "Equilibrate a 5 ml polypropylene chromatography column with 1 column volume (CV) of lysis buffer and load the mixture onto the equilibrated column.Collect the flow-through, and reload it onto the column. Repeat for a total of 5-6 times.Note: This step should be repeated multiple times in order to ensure complete binding of the MP to the nickel resin. When using MP-GFP fusions or chromophore-containing MPs, this step should be repeated until a non-fluorescent or colourless flow-through is collected. Wash the column-bound protein with 40 ml wash buffer.Elute the MP with 6 ml elution buffer.Concentrate the elution to a final volume of approximately 500 μl using a centrifugal filter.Equilibrate a Superdex 200 column with 2 CV of size exclusion buffer at 1 ml/min, ensuring that the pressure does not exceed the maximum limit of 0.3 MPa.Inject the concentrated sample onto the column and pass 1 CV of size exclusion buffer through the system while collecting the eluted fractions. Pool together the fractions that correspond to the MP’s peak.Quantify the amount of purified MP by calculating the absorbance at 280 nm of the integrated peak area and using the MP’s extinction coefficient (ε280).Note: By following this protocol, and using the SuptoxD strain we have obtained 1 mg per L of bacterial culture of purified human bradykinin receptor 2 (BR2), which under normal conditions exhibits very high levels of toxicity and low yields when overexpressed in E. coli (Michou et al., 2019). This amount was 14-fold higher than the corresponding yield from wild-type E. coli. Similar results were achieved by the use of SuptoxR in overexpressing the large bacterial mechano-sensitive ion channel (MscL), in which case we isolated 0.33 mg per L of bacterial shake flask culture, a > 10-fold increased yield compared to wild-type E. coli (Michou et al., 2019).",
    "However, other means of MP purification can be used according to the user’s particular preferences and needs. Evaluate MP purity by SDS-PAGE analysis and Coomassie staining.Note: For highly concentrated MP fractions, we recommend running the gel at a very low constant current, such as 12-13 mA."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}