{
  "id": 13574,
  "origin_website": "Jove",
  "title": "Efficient Differentiation of Pluripotent Stem Cells to NKX6-1+ Pancreatic Progenitors",
  "procedures": [
    "1. Preparation of Solutions and Media\nNOTE: Prepare all media for cell culture in a sterile environment. Media has to be made and used immediately. Reagent details are provided in the Materials Table.\nDifferentiation Media\nPrepare Day 0 Differentiation Media: RPMI Medium with 1% Glutamine, 2 µM CHIR 99021, 100 ng/ml Activin A, 104 M MTG.\nPrepare Day 1-2 Differentiation Media: RPMI Medium with 1% Glutamine, 100 ng/ml Activin A, 104 M MTG, 5 ng/ml bFGF, 50 µg/ml Ascorbic Acid.\nPrepare Day 3-5 Differentiation Media: RPMI Medium with 1% Glutamine, 1% B27, 104 M MTG, 0.75 µM Dorsomorphin, 50 ng/ml FGF10.\nPrepare Day 6-7 Differentiation Media: DMEM with 1% Glutamine, 1% B27, 50 µg/ml Ascorbic Acid, 50 ng/ml FGF10, 0.25 µM SANT-1, 2 µM Retinoic Acid, 50 ng/ml NOGGIN.\n\t\tNOTE: Retinoic Acid should be added to the media last and media should be protected from light to prevent oxidative degradation15.\nPrepare Day 8-12 Differentiation Media: DMEM with 1% Glutamine, 1% B27, 50 µg/ml Ascorbic Acid, 50 ng/ml NOGGIN, 100 ng/ml hEGF, 10 mM Nicotinamide.\nPrepare FACS buffer: 10% FBS in PBS, minus calcium and magnesium.\n2. HESC Differentiation\nNOTE: HESC are thawed, passaged and expanded on irradiated mouse embryonic fibroblasts in the presence of a KOSR-based media supplemented with bFGF16. HESCs are ready for differentiation when the cells reach 80-95% confluency. At this time the colonies should be large with defined borders and a 'domelike' structure (Figure 1A). All cell culture is performed in flat-bottom, tissue culture treated plates coated with 0.1% gelatin. Typically, the cells are grown in 6 or 12-well plates, in media volumes of 2 ml or 1 ml, respectively.\nOn day 0, begin differentiation by replacing the KOSR-based media with Day 0 Differentiation Media.",
    "On days 1 and 2, gently shake the plate to remove any dead cells from the monolayer before aspirating. Replace with Day 1-2 Differentiation Media.\nOn day 3, harvest cells for flow cytometry. If the cells express more than 90% CXCR4+/CD117+, proceed to step 2.4.\nOn days 3 and 5, gently shake the plate to remove any dead cells from the monolayer prior to aspirating. Replace with Day 3-5 Differentiation Media.\nOn days 6 and 7, replace with Day 6-7 Differentiation Media.\nOn days 8, 10 and 12, replace with Day 8-12 Differentiation Media.\nOn day 13, harvest cells for flow cytometry to determine PDX1 and NKX6-1 expression.\n3. Harvesting Cells for Flow Cytometry Analysis\nDissociate cells with 1x commercial trypsin solution according to manufacturer's protocol and incubate at 37 °C for 3 min.\nRemove commercial trypsin solution and resuspend single cells in 1,000 µl FACS Buffer with 30 µl DNase I.\nFilter cells using a 35 µm nylon mesh cell strainer and transfer to a microcentrifuge tube.\nCentrifuge cells at 455 x g for 5 min. Prepare cells for either live or fixed staining.\n4. Staining for Flow Cytometry\nFlow preparation for live staining on day 3\nResuspend cells in 1,000 µl FACS Buffer. Transfer 200 µl (approximately 1-3 x 105 cells) into two wells of a 96-well plate (for both unstained and stained samples).\nCentrifuge the plate at 931 x g for 2 min. Remove the supernatant by inverting the plate.\nStain with primary-conjugated antibodies, CXCR4:APC and CD117:PE (see Materials Table) for 30 min at room temperature protected from light.\nCentrifuge the plate at 931 x g for 2 min. Remove the supernatant by inverting the plate.\nResuspend samples in 100 µl FACS Buffer.",
    "Centrifuge the plate at 931 x g for 2 min. Remove the supernatant by inverting the plate.\nResuspend each sample and transfer in a total volume of 300-500 µl FACS Buffer to 1 ml micro test tubes or 5 ml round-bottom tubes.\nRun samples on the flow cytometer17. If samples cannot be run immediately, store at 4 °C protected from light.\nFlow preparation for fixed staining on day 13\nResuspend the cell pellet in commercial fixation/permeabilization solution for 24 hr at 4 °C.\nCentrifuge the sample at 455 x g for 5 min. Resuspend in 400 µl Perm/Wash solution.\nTransfer 200 µl of the sample (approximately 0.5-1 x 106 cells) to two wells of a 96-well plate (for IgG control and PDX1/NKX6-1 staining). Centrifuge at 931 x g for 2 min.\nResuspend the cell pellets in 100 µl Perm/Wash solution containing anti-PDX1 and anti-NKX6-1 primary or isotype control antibodies (see Materials Table). Incubate overnight at 4 °C.\nCentrifuge the plate at 931 x g for 2 min. Remove the supernatant by inverting the plate. Resuspend samples in 100 µl Perm/Wash solution.\nCentrifuge the plate at 931 x g for 2 min. Remove the supernatant by inverting the plate.\nResuspend the samples in 100 µl Perm/Wash containing secondary antibodies at room temperature for 1 hr protected from light.\nCentrifuge the plate at 931 x g for 2 min. Remove the supernatant by inverting the plate.\nResuspend samples in 100 µl Perm/Wash Solution.\nCentrifuge the plate at 931 x g for 2 min. Remove the supernatant by inverting the plate.\nRepeat step 4.2.9 and 4.2.10.\nResuspend each sample and transfer in a total volume of 300-500 µl FACS Buffer to 1 ml micro test tubes or 5 ml round-bottom tubes.",
    "Run samples on the flow cytometer17. If samples cannot be run immediately, store at 4 °C protected from light.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}