{
  "id": 11767,
  "origin_website": "Jove",
  "title": "A Three-Dimensional Technique for the Visualization of Mitochondrial Ultrastructural Changes in Pancreatic Cancer Cells",
  "procedures": [
    "1. Material preparation\nCulture 2 x 106 Panc02 cells in 12 mL of DMEM medium (10% fetal bovine serum and 100 U/mL of penicillin-streptomycin), and maintain at 37 °C and 95% humidity in an atmosphere of 5% carbon dioxide and 95% air for 48 h.\nCollect Panc02 cells, centrifuge at 28 x g for 2 min, and then discard the supernatant. Ensure that the sample is of an appropriate size (1 x 107 cells), as otherwise, the following fixation and dehydration steps will not work well.\nAdd 1 mL of 2.5% glutaraldehyde as a fixative to fix the fresh Panc02 cells in the 1.5 mL micro-centrifuge tubes overnight at 4 °C.\n\tNOTE: The samples need to be centrifuged at 1,006 x g for 5 min in each of the following steps (steps 1.3-1.11).\nAspirate the fixative, and rinse the samples twice with 0.1 M phosphate-buffered saline (PBS), and then rinse twice with double-distilled water (ddH2O) at room temperature for 10 min each.\nAdd 50 µL of a solution containing 1% osmium tetroxide (OsO4) and 1.5% potassium ferrocyanide at a ratio of 1:1 at 4 °C for 1 h. Then, rinse twice with 0.1 M PBS for 10 min each time, and rinse with ddH2O for another 10 min.\nAdd 1 mL of 1% thiocarbohydrazide (TCH), incubate at room temperature for 30 min to 1 h, and then rinse with ddH2O four times for 10 min each time.\nAdd 50 µL of 1% OsO4, fix at room temperature for 1 h, and then rinse with ddH2O four times for 10 min each time.\nAdd 1 mL of 2% uranyl acetate at 4 °C overnight, and then rinse with ddH2O four times for 10 min each time.",
    "Add 1 mL of Walton solution (0.066 g of lead nitrate dissolved in 10 mL of 0.03 mol/L aspartic acid stock solution) at 60 °C for an additional 1 h of incubation.\nRinse with ddH2O four times for 10 min each time, and then dehydrate in a graded alcohol series for 10 min each time: 50% alcohol, 70% alcohol, 80% alcohol, and 90% alcohol 1x, and 100% alcohol 2x. Then, dehydrate in 100% acetone twice for 10 min each time. Use 1 mL of each solution for the dehydration.\nMix 200 µL of acetone with Pon 812 epoxy resin at a ratio of 3:1, 1:1, and 1:3. Soak the sample in resin at room temperature for 2 h, 4 h, and 4 h, respectively, and then take the 100% Pon 812 epoxy resin to impregnate overnight.\n\tNOTE: When performing the staining and resin embedding steps, it is important to operate in a fume hood as these are toxic substances. Additionally, lab coats and solvent-resistant gloves must be worn during the experiment.\nPut the specimens into an embedding mold, and then place in an oven at 60 °C for 48 h to polymerize. Use flat embedding29 to reduce the appearance of resin around the sample. This simplifies the specimen installation and decreases the impact of charging artifacts on the subsequent image segmentation.\n\tNOTE: To subsequently generate a horizontal cutting surface, a small amount of resin can be added into the mold hole, taking care not to overfill it.\nPrepare silicon wafers by first washing them and then hydrophilizing with a concentrated H2SO4/H2O2 solution for 30 min. Collect serially slice strips with a thickness of 70 nm on the hydrophilized silicon wafers by using an ultramicrotome, and dry them in a 60 °C oven for 10 min.",
    "NOTE: Slowly capture the slice as the slice floats to the surface of the wafers to prevent slice loss or deformation.\n2. Image acquisition and three-dimensional reconstruction\nBefore mounting a silicon wafer on the stage, wash the sections with distilled water three times, and air-dry them. Cut a conductive carbon tape with the size of 1 cm x 0.5 cm, and stick this between the silicon wafer and SEM specimen stage to complete the sample setup (Figure 2E).\nSet the FE-SEM accelerating voltage parameter to 2 kV with a working distance of 4 mm (Figure 3B and Table 1).\n\tNOTE: In order to improve the signal-to-noise ratio and reduce the noise in the image, observe at low magnifications whenever possible.As the multiple increases, the scanning range of the SEM decreases, leading to an increase in charge accumulation on the images.\nClick on the H/L icon in the top menu bar. First, at low magnification, orient the first section of the target slice strips, and then click again on the H/L option (Figure 3A) to switch to high-magnification mode; collect an appropriate image for the structure of interest by adjusting the image brightness, contrast, and magnification.\nSelect Project View > Open Data, and import the image files to be analyzed into the software.\nAlign the pictures by clicking on Align Slices > Edit (Figure 4B), and adjust the Intensity Range value in the lower-left menu bar by modifying the image transparency. Here, use a semi-automatic alignment strategy; specifically, through automatic alignment, make the pictures overlap with a previous picture, and then perform manual fine-tuning.",
    "NOTE: In this work, during the process of alignment, the previous image was used as a reference, and the move and rotate operations were utilized to maximally overlap the target structure of the two images. Clicking on Align Current Slice Pair can help to align the images automatically, but misplacement may occur.\nSelect the Extract Subvolume module, and clip the aligned data sets to fit the size of the overlapping portion of the whole stack.\nUnder the Segmentation subsection (Figure 4C), select Resample > Segmentation > Save. Choose the threshold of the Magic Wand and the size of Brush tool to select the correct range. Here again, adopt a semi-automatic segmentation method by first using the Magic Wand to automatically select a suitable large area, and then use the Brush to accurately describe the details.\n\tNOTE: The Magic Wand can be applied to segment images based on the obvious differences in the pixel intensity existing between the structure of interest and the surrounding structures by altering the Masking value and using the Draw Limit Line. It is incapable of distinguishing the charging artifacts generated during image acquisition. Therefore, it may result in incorrect segmentation for the target regions. The Brush tool can be used to segment manually to accurately reconstruct the biological structures.\nUnder Segmentation > Selection, click on the + icon to add the selected area (Figure 4C).\nRepeat the above step (2.8) to select the same target structure in different images until the selection is complete for reconstructing the microstructures of interest.",
    "NOTE: During the mitochondrial remodeling processes, the selection of the target object must be performed from the picture in the middle of a group of sequential images. If the required area is selected from the first or last picture, the reconstruction result will not be able to present a complete 3D visualization.\nAfter completing the regional segmentation, generate the image file according to the best results for the size of the object and the picture resolution. Click on Crop Editor, and then enter the number 6 in the Virtual Slider box (Figure 4C).\nIn the drop-down menu on the left, right-click on the gray area under the Project subsection, and select Generate Surface > Create > Apply. In the generated file, use the Surface View module to create the surface structure and 3D representation.\n3. Quantification\nClick on Remove Small Spots > Apply (Figure 4D). Under the Project subsection, right-click on the gray area, and select Label Analysis > Apply (Figure 4D).\nCustomize the name of the column, and choose a measure group. Select Volume3d and Length3d from the Native Measurements box.\nClick on the Apply button in the lower-left corner of the screen. Copy the data, and graph in the statistical software, such as GraphPad.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}