{
  "id": 11842,
  "origin_website": "Jove",
  "title": "Combining Reflectance Confocal Microscopy with Optical Coherence Tomography for Noninvasive Diagnosis of Skin Cancers via Image Acquisition",
  "procedures": [
    "All the protocols described below follow the guidelines of the institutional human research ethics committee.\n1. RCM device and imaging protocol\nNOTE: There are two commercially available in vivo RCM devices: wide-probe RCM (WP-RCM) and handheld RCM (HH-RCM). The WP-RCM comes integrated with a digital dermatoscope. These two devices are available separately or as a combined unit. Below are the image acquisition protocols using the latest generation (Generation 4) of the WP-RCM and HH-RCM devices along with their clinical indications.\nLesion selection and clinical indications\n\t\nLook for the following types of lesions: dermoscopically equivocal pink (BCC, squamous cell carcinoma [SCC], actinic keratosis [AK], other benign lesions) or pigmented lesion (nevi and melanoma, pigmented keratinocytic lesions); a nevus that has recently changed on clinical or dermoscopy examination; inflammatory lesions to determine inflammatory patterns.\nPerform mapping for lentigo maligna (LM) margins to determine the extent of the lesion and mapping and selection of biopsy sites for disease with subclinical extension such as extramammary Paget's disease (EMPD) and LM.\nCarry out noninvasive monitoring of nonsurgical treatment such as topical drugs (imiquimod), radiation, photodynamic therapy, and laser ablation.\nFor device selection, use the WP-RCM device for lesions located on relatively flat surfaces of skin (the trunk and extremities) and the HH-RCM device for lesions on curved surfaces (the nose, earlobes, eyelids, and genitalia).\n\tNOTE: Selection of the imaging device will mainly depend on the location of the lesion.\nFor imaging, position the patient on a fully reclining chair or a flat examination table with pillows or an armrest for support and to achieve a flat imaging surface.",
    "NOTE: Older generation (Generation 3) WP-RCM devices took ~30 min per lesion. Imaging a single lesion may require ~15 min with the newer generation (Generation 4) WP-RCM device currently being used in clinics. Despite the improved acquisition time, positioning the patient comfortably will ensure minimum motion artifacts and aid the acquisition of superior quality images. The following steps may help with correctly positioning the patient:\nTo prepare for imaging, clean the lesion and surrounding skin with an alcohol wipe to eliminate any dirt, lotion, or make-up. Shave hairy skin surfaces before attaching the tissue window to avoid air bubbles that can hinder the visualization of tissue microstructures.\n\tNOTE: For removing heavy cosmetics or sunscreens, clean the site with a gentle soap and water prior to cleaning with alcohol.\nImage acquisition using the WP-RCM device (Figure 1, Figure 2, Supplemental Figure S1, Supplemental Figure S2, and Supplemental Figure S3)\n\t​NOTE: WP-RCM devices are capable of capturing stacks, mosaic, live single-framed videos, and single-framed images.\n\t\nTo attach a disposable plastic window cap to the lesion (Figure 1), position the probe perpendicular to the lesion for the best images. Refer to Figure 1A-F for an example of attachment. Add a drop of mineral oil on the center of the plastic window, carefully spreading it across the window width (Figure 1A). Remove the paper backing from the adhesive side of the plastic window. Stretch the skin gently to avoid wrinkling and attach the window.\n\t\tNOTE: Use food-grade mineral oil that is safe and has a high viscosity. Ensure that the lesion is centered and covered in its entirety. For lesions larger than 8 mm x 8 mm, either image areas of concern based on dermoscopy or perform separate imaging sessions to cover the entire lesion.\nAcquiring dermoscopy images (Figure 1C,D)",
    "NOTE: A dermoscopy image is acquired to serve as a guide for navigating within the lesion. The following steps should be used to ensure perfect registration between the dermoscopy image and the confocal image.\n\t\t\nHover the WP-RCM probe over the plastic window cap and approximate the best angle of insertion for the probe (Figure 1C). Locate the small, white arrow located on the side of the probe (Figure 1C) and align it with the arrow on the side of the dermoscopy camera (Figure 1C).\nInsert the dermoscopy camera into the plastic window cap (Figure 1D). Press the trigger on the camera to acquire an image. Remove the dermatoscope. Before starting the imaging session, ensure that the dermatoscope image covers the entire lesion surface.\nTo attach the RCM probe to the plastic disposable cap (Figure 1E,F), place a pea-sized amount of ultrasound gel inside the disposable plastic window cap (Figure 1E). Insert the probe within the cap until a sharp click is heard (Figure 1F).\n\t\tNOTE: For the best images, insert the probe perpendicular (at a 90° angle) to the plastic window. The height of the examination chair can be raised to achieve a flatter surface, reduce motion artifacts, expel air bubbles (Figure 3 and Figure 4), and ensure secure attachment to the skin.\nAcquiring RCM images (Figure 2, Supplemental Figure S1, and Supplemental Figure S2)\n\t\t\nUse the dermoscopy image (step 5.2.) for guiding the RCM image acquisition (Supplemental Figure S1). Select the center of the lesion and identify the topmost (brightest) layer of the skin — the anucleate layer of the stratum corneum (Supplemental Figure S1).\nSet the imaging depth to zero at this level (Supplemental Figure S1).\n\t\t\tNOTE: This depth serves as a reference point for determining the actual z-depth of subsequent layers within the lesion.",
    "Acquire a stack in the lesion's center (Figure 2 and Supplemental Figure S1) by pressing the stack icon. Select an anatomical site from the drop-down menu: face or body. Set 4.5 µm step-size and 250 µm depth.\n\t\t\tNOTE: Begin the stacks from the stratum corneum and end at the deepest visible layers in the dermis. Supplemental Figure S1 shows an example of how to acquire a stack, while Figure 2 gives an example of a stack.\nAcquire a mosaic: take the first mosaic at the dermal-epidermal junction (DEJ) (Supplemental Figure S2). Identify the DEJ layer in the stack acquired and then use the mouse to select an 8 mm x 8 mm square to cover the entire lesion. Press the mosaic icon to complete the operation (Supplemental Figure S2). Acquire at least 5 mosaics at various depths: stratum corneum, stratum spinosum, suprabasal layer, DEJ, and superficial papillary dermis.\nOpen the DEJ mosaic to guide the acquisition of the subsequent mosaics. Click on any structure on the DEJ mosaic to bring up that area on the live view imaging. Scroll down to acquire mosaics at the dermis and then up (from the DEJ) to take mosaics in the epidermis.\nGet the acquired mosaics evaluated by the expert RCM reader present at the bedside to identify the region of interest and take stacks. In the absence of an expert at the bedside, capture 5 stacks: one in each quadrant and one in the center of the lesion with a homogeneous pattern on dermoscopy (steps 1.5.2.). For heterogeneous lesions, acquire additional stacks to cover all the dermoscopy features.",
    "NOTE: A \"stack\" (Figure 2) is a sequential collection of high-resolution, single-frame, small field of view (FOV) images (0.5mm x 0.5 mm) acquired in depth starting from the topmost layer of the epidermis to the superficial dermis (~200 µm). A \"mosaic\" (Supplemental Figure S2) is a large FOV of images obtained by stitching individual 500 µm x 500 µm images together in \"X-Y\" (horizontal en face plane).\nCompleting an imaging session\n\t\t\nClick on Done Imaging.\nDetach the microscope from the plastic window. Remove the plastic window by gently holding the patient's skin taut and dispose of it. Wipe off oil on the skin with an alcohol swab.\nDetach the protective cone surrounding the microscope lens. Clean the tip of the objective lens with an alcohol swab to remove the ultrasound gel. Dry the objective lens with a paper towel. Reattach the plastic cone to the microscope probe.\n\t\t\tNOTE: Images can be read, and a report can be generated and signed at the bedside by a trained physician. In the absence of an expert reader, a remote expert can be consulted either by transferring the images via the cloud or via a live teleconfocal session26.\nGenerating a Confocal Diagnostic Evaluation report (Supplemental Figure S3)\n\t\t\nClick on New Evaluation. Enter the diagnosis from the preselected options in the dropdown menu.\nIf another imaging session is required, select images inadequate and need to be recaptured. If a descriptive diagnosis is needed, select other and describe in the free text box at the end of the form. Enter the CPT code for billing7 (Supplemental Figure S3A). Select the applicable features seen during imaging from the report checklist (Supplemental Figure S3B). Select the applicable management from the checklist.\n\t\t\tNOTE: No billing code is applicable for HH-RCM imaging.",
    "Click on Finish and Sign. Generate the report as a PDF and print. Get the report signed by a physician and add it to the patient's chart for billing.\nImage acquisition using the HH-RCM device (Figure 5)\n\tNOTE: HH-RCM devices are capable of capturing stacks, live single-framed videos, and single-framed images.\n\t\nEncircle the lesion identified by the physician with a paper ring. Use steps detailed in section 3. for positioning the patient and cleaning the lesion site.\n\t\tNOTE: Select the size of the paper ring (5-15 mm) based on the lesion size to define the boundary of the lesion and ensure imaging is done within the lesion. If a paper ring is not available, use paper tape to define the lesion.\nRemove the plastic cap covering the microscope lens. Apply a pea-sized amount of ultrasound gel to the objective lens of the HH-RCM and cover it with the plastic cap (Supplemental Figure S3A). Add a generous drop of mineral oil to the side of the plastic cap that will be touching the skin.\n\t\tNOTE: Increase the amount of oil for very dry skin, if needed.\nPress the probe to the lesion site on the skin with firm pressure. Use the z-depth controls on the HH-RCM device to move up and down at various depths within the lesion (Supplemental Figure S3B). Acquire multiple single-frame images and stacks in the regions of interest. Take stacks as described in step 1.5.4.3.\nFor large lesions where the WP-RCM device cannot be attached, take continuous videos at various layers by moving the HH-RCM probe over the entire lesion surface. Click on the video capture symbol to do so. Record the movement of blood cells within vessels, if needed.\n\t\tNOTE: These videos can be later stitched using software to provide large FOV images similar to mosaics.",
    "Press Done Imaging after the imaging session is complete. Clean the lesion with an alcohol swab to remove the oil. Remove the ultrasound gel from the objective lens of the probe by cleaning it with an alcohol wipe and reattaching the plastic cap.\n\t\t​NOTE: Unlike the WP-RCM device, which can be operated by a technician, the HH-RCM should be operated by an RCM reader who can interpret images in real time to navigate within the lesion and arrive at a correct diagnosis.\n2. Combined RCM-OCT device and imaging protocol\nNOTE: There is only one prototype of the RCM-OCT device. This device has a handheld probe and can be used on all body surfaces, similar to the HH-RCM device. It acquires RCM stacks (similar to the RCM device) and OCT rasters (a video of sequential, cross-sectional images22). Both RCM and OCT images are in gray scale. RCM images have an FOV of ~200 µm x 200 µm, while the OCT image has an FOV of 2 mm (in width) x 1 mm (in depth). Below is the image acquisition protocol using the RCM-OCT device, along with their clinical indications. Figure 6 shows an image of the RCM-OCT device, while Figure 7 shows the software system of the RCM-OCT device.\nLesion selection\n\t\nLook for dermoscopically equivocal pink or pigmented lesion to rule out BCC.\nAssess the depth of BCC for management, and assess the residual BCC post treatment.\nPositioning the patient for imaging: Imaging a single lesion may require up to 20 minutes with the RCM-OCT device. The device is also a handheld probe similar to the HH-RCM device and, thus, can be moved freely over the lesion. For details of patient positioning, refer to section 1.4. above.",
    "Preparation of the site for imaging: When using this probe, ensure that the boundary of the lesion is free of excessive hair and topical impurities and is clearly defined. Refer to step 1.4.1. above for more detail.\nImage acquisition using the RCM-OCT device (Figure 6 and Figure 7)\n\t\nPrepare the probe similarly to the one used for the HH-RCM (steps 1.6.1-1.6.2.)\nAcquire images in line imaging mode and raster mode.\n\t\t\nClick on imaging settings (Figure 7A). Select the line imaging mode to acquire an RCM image (cellular resolution) (Figure 7B). Set the step size to 5 µm and the number of steps to 40 (Figure 7A).\nClick on Grab. Acquire stacks following step 1.5.4.3. Once complete, click on the Freeze button.\nClick on imaging settings. Select raster mode to acquire a correlative OCT video for the lesion architecture (Figure 7B). Switch to the technician tab (Figure 7C). Once complete, click on the Grab button (Figure 7A) and immediately press the save button.\nAcquire multiple stacks and videos based on the physician's interest.\nClean the lesion and machine as described in step 1.6.5.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}