{
  "id": 12058,
  "origin_website": "Jove",
  "title": "Radiosensitivity of Cancer Stem Cells in Lung Cancer Cell Lines",
  "procedures": [
    "NOTE: Steps are performed under the indicated temperature. For steps in which the temperature is not mentioned, perform under room temperature (18–25 °C). Cell culture medium should be stored at 4 °C, and other reagents should be stored according to the manufacturer’s guides. Medium should be pre-warmed to 37 °C before being added to cells.\n1. Cell sorting\nAntibody conjugation\n\tNOTE: Considering the shorter incubation time, direct-labeled antibody is preferred for cell sorting. If no commercial direct-labeled antibody is available, use fluorescein-conjugating reagents to conjugate the antibody to a fluorescent dye according to the manufacturer’s guide (see Table of Materials). As cells will be cultured after sorting, all steps should be performed in a biological safety cabinet or laminar clean bench. To avoid contamination, antibiotics (penicillin and streptomycin) are recommended to be added to the culture medium after sorting.\n\t\nAdd 1 µL of modifier reagent for each 10 µL of antibody to be labeled. Mix gently.\nAdd the mixture of antibody and modifier directly onto the lyophilized fluorescein. Pipet gently. Leave the vial standing for 3 h or overnight at room temperature (RT) in the dark.\nAdd 1 µL of quencher reagent for every 10 µL of antibody. The conjugate can be used after 30 min. The fluorescein conjugate can be stored at 4 °C for up to 18 months.\nBefore sorting, titration of conjugated antibody is recommended. Prepare cells that express (e.g., H1299 or A549 for α2δ1) and do not express (e.g., H1975) the marker. Aliquot the cells and incubate them with antibody at different concentrations (e.g., 15 μg/mL, 7.5 μg/mL, 1.5 μg/mL, and 0.75 μg/mL, respectively).",
    "Perform flow cytometric analysis (with histogram or dot plot) and choose the concentration in which positive cells of H1299 or A549 can be separated from the isotype control and H1975 cells have little unspecific signals.\nCell labeling\n\t\nCulture A549 cells in RPMI 1640 medium supplemented with 10% fetal bovine serum (FBS) in 10 cm dishes at 37 °C and 5% CO2 in a cell culture incubator. Digest cells as follows for sorting when they reach 80%–90% confluence (about 5–10 x 106 cells per dish).\nRemove the culture medium. Wash cells with 3 mL of phosphate buffered saline (PBS) briefly. Add 3 mL of 0.05% trypsin to each dish. Remove the trypsin and leave the residuary trypsin to digest cells at 37 °C for 1–3 min. Check the detachment of the cells frequently to avoid overdigestion.\n\t\tNOTE: Some cell lines may be relatively difficult to digest, such as NSCLC cell lines H520 and PC9. In such situation, 3 mL of trypsin can be left in the dish, rather than digestion with residuary trypsin. Moreover, the digestion time can be extended.\nWhen cells become loose and begin to detach from the dishes, add 3 mL of RPMI 1640 medium supplemented with 10% FBS and pipette the cell suspension into a 50 mL tube.\nCentrifuge at 300 x g at 4 °C for 5 min. Discard the supernatant. Add 10 mL of PBS to resuspend the cells. Transfer 0.5 mL (or at least 5 x 105 cells) of cell suspension into a new tube as an isotype control. The remaining cells are for sorting.\nCentrifuge both the control and experimental tubes at 300 x g at 4 °C for 5 min. Discard the supernatant.",
    "Prepare the working solution for staining by diluting the fluorescent dye-conjugated isotype control or antibody in PBS to the optimal concentration titrated as mentioned above.\n\t\tNOTE: In this experiment, FITC-conjugated 1B50-1 (the antibody of α2δ1) was diluted into 7.5 μg/mL. The volume of working solution is dependent on the cell amount.\nResuspend the control and experimental cells with each working solution at about 2–5 x 107 cells/mL and mix gently. Incubate the samples at RT for 30–40 min in the dark.\nWash the cells by adding 10 mL of PBS to samples, mix gently and centrifuge at 300 x g at 4 °C for 5 min. Discard the supernatant. Resuspend cells with 10 mL of PBS.\nPut 40 μm cell strainers on new 50 mL tubes for control and experimental cells respectively. Apply cell suspension onto the strainer and collect the flow-through.\n\t\tNOTE: This step removes the cell clumps that may block the capillary of the cell sorter.\nCentrifuge the flow-through at 300 x g at 4 °C for 5 min. Discard the supernatant. Resuspend the cells with 0.2–1.0 mL PBS then transfer into a 5 mL tube for flow cytometry.\nCell sorting by flow cytometry\n\t\nPrepare two 5 mL tubes to collect the positive and negative cell populations. Add 1 mL of RPMI 1640 medium in each tube. Place the tubes at the collection platform of the cell sorter.\nAnalyze the control cells and experimental cells respectively with the dot plot. Gate the live cells with the parameters forward scatter (FSC) and side scatter (SSC). Gate the positive and negative population of live cells according to the FL-1 intensity.\nCollect the α2δ1-positive cells and α2δ1-negative cells. Record the number of cells obtained.",
    "To confirm that the harvested cell populations have different level of α2δ1 expression, a quantitative polymerase chain reaction (QPCR) can be performed.\n\t\t\nExtract RNA of positive and negative cells with guanidinium thiocyanate reagent and reverse transcript the RNA into cDNA according to the manufacturer’s guide. Perform QPCR with SYBR green reagent. The sequences of primers are as follows: α2δ1-F, CAGTTGAGATGGAGGATGATG; α2δ1-R, TTGTATGAGCAGTCGTGTGTC; GAPDH-F, GTCGGAGTCAACGGATTTGG; and GAPDH-R, AAAAGCAGCCCTGGTGACC.\n2. Sphere formation assay\nNOTE: Sphere formation assay is applied to determine the self-renewal capacity of cells. Cells with self-renewal capacity could form spheres in this serum-free semisolid medium supplemented with growth factors. All steps should be performed in a biological safety cabinet or laminar clean bench. To avoid contamination, antibiotics (penicillin and streptomycin) are recommended to be added to the culture medium after sorting.\nMedium preparation\n\t\nPrepare 2x DMEM/F-12 medium by reconstituting a 1 L package of DMEM/F-12 powder into 475 mL of distilled water. Add 2.438 g of NaHCO3. Adjust the pH to 7.0–7.2 by slowly adding 1 N NaOH or 1 N HCl with stirring. Add distilled water to a final volume of 500 mL. Sterilize the medium by filtering through a 0.2 μm filter.\nPrepare a 2% methylcellulose solution by adding 2 g of methylcellulose into 100 mL of distilled water. Autoclave the solution. The methylcellulose may show a cotton-like state after autoclaving. Mix it by reversing the bottle up and down gently for few times and leave it for natural cooling. It will become a transparent semisolid overnight.",
    "To obtain 20 mL of self-renewal medium, add 10 mL of 2x DMEM/F-12 medium to a 50 mL tube. Add 400 μL of B27 to the medium. Add recombinant human epidermal growth factor (EGF) to a final concentration of 25 ng/mL. Add recombinant human basic fibroblast growth factor (bFGF) to a final concentration of 25 ng/mL. Add 2% methylcellulose to reach a final volume of 20 mL.\nMix the medium by vortex so that the self-renewal medium is obtained.\nCell seeding\n\t\nTransfer the harvested cells into the self-renewal medium to reach 2000 cells/mL and mix them with a brief vortex. Add 100 μL of cell suspension to each well of an ultra-low attachment 96 well plate. Do not use the wells at the rim of the plate, as the medium is more likely to evaporate in these wells. Add sterilized water to these wells.\nCulture at 37 °C with 5% CO2 in cell culture incubator for 10–14 days. Add 50 μL of self-renewal medium at day 5–7.\nSphere counting and calculation\n\t\n10–14 days after seeding, count the number of spheres with more than 50 cells (approximately) or with a diameter more than 100 μm under a microscope (4x objective lens, 10x eyepiece).\n\t\tNOTE: Starting from the upper left of the well, count the spheres while moving the objective table horizontally towards the right with the joystick of the microscope. Then, move the objective table to the middle row of the visual field and count the spheres from right to left. Then, move to the lower row and count from left to right. A well of 96 well plate can be counted within three rows.",
    "Calculate the sphere formation efficiency as the number of spheres divided by the number of cells seeded. Compare the sphere formation efficiency between the positive and negative cell populations.\n3. Colony formation assay\nNOTE: Colony formation assay is applied to determine the radiosensitivity of cells. Radiation can be delivered by a linear accelerator used for radiotherapy. Cell irradiation system for laboratory use can also be used if the equipment is available. Steps 3.1, 3.2.3, and 3.2.6 should be performed in a biological safety cabinet or laminar clean bench. To avoid contamination, antibiotics (penicillin and streptomycin) are recommended to be added to the culture medium after sorting.\nCell seeding\n\t\nPrepare one 6 well plate for each radiation dose including the 0 Gy group. Add 1.5 mL of medium to each well of 6 well plate. Culture medium for colony formation assay is the conventional RPMI 1640 medium supplemented with 10% FBS (named as “completed 1640”).\nDilute harvested cells with completed 1640 medium to 1000 cells/mL.\nAdd cell suspension to the wells. Shake the plates horizontally to make cells distribute evenly in the wells. Record the volume added in each dose group.\n\t\tNOTE: Generally, seed 200 cells per well for 0 Gy, 200 cells for 2 Gy, 400 cells for 4 Gy, 800 cells for 6 Gy, and 1600 cells for 8 Gy, respectively. It is better to adjust the cell numbers in unsorted cells in pre-experiments.\nCulture at 37 °C with 5% CO2 in cell culture incubator.\nRadiation\n\t\nAfter cells have attached to the bottom of the wells (usually one day after seeding, and longer time is not recommended considering cell proliferation), proceed to perform cell radiation.",
    "Calculate the number of monitor units (MU) for each dose at a depth of 1 cm in a 20 cm x 20 cm radiation field.\n\t\tNOTE: Number of MU = dose (cGy)/output factor for the radiation field/percentage depth dose (PDD) for the depth. For example, the output factor for a 20 cm x 20 cm field is 1.066, PDD for 1.0 cm is 0.987, and number of MU for 8 Gy (800 cGy) is 760 (800/1.066/0.987 = 760.35). If multiple plates need to be radiated for each dose, a larger field can also be used, and the numbers of MU need to be recalculated according to the size of the field. Output factor and PDD differ in different accelerators. Refer to radiation physicists for these parameters.\nAdd completed 1640 to each well to reach 1 cm for the height of the medium.\n\t\tNOTE: Cell growth area of 6 well plate can be found on the manufacturer’s guide. For example, if the growth area is 9.5 cm2 for each well of 6 well plate, and 1.5 mL of medium and 0.4 mL of cell suspension has been added on the day before, then add 7.6 mL medium to the well. The height is needed for dose build-up. A medium height of less than 0.8 cm is not recommended.\n\t\tNOTE: Keep the plates covered during radiation. When the plates are transferred between cell culture room and radiation therapy room, wrap the plates with aluminum foil or put them in a clean box to avoid contamination. Hold the plates flat to avoid medium spilling out.",
    "Set a 20 cm x 20 cm radiation field. Place a tissue-equivalent bolus of 1.0 cm thickness on the treatment couch, and place the 6 well plate on the bolus to keep them in contact. Make sure the whole plate is within the radiation field. Set the source skin distance as 100 cm. Align the medium surface level to the laser level by adjusting the height of the treatment couch.\n\t\tNOTE: Plates with the same radiation dose can be radiated at the same time. For this case, a larger radiation field is needed, and the number of MU should be recalculated according to the corresponding output factor. Make sure all the plates are within the radiation field.\nDeliver the each assigned dose to each plate in sequence.\n\t\tCAUTION: The linear accelerator can only be operated by qualified technicians. Keep away from radiation.\nTake the plates back to the cell culture room. Change the medium with 2 mL of completed medium for each well. Culture at 37 °C with 5% CO2 in cell culture incubator. Change the medium every 3–5 days.\nStaining\n\t\n7–10 days after radiation, when many colonies form and before they grow too large and merge together, then perform staining and counting as follows. Remove the medium and wash briefly with PBS. Add 1 mL of 4% formaldehyde to each well to fix the cells.\n\t\tCAUTION: Formaldehyde is volatile. Use formaldehyde in a fume hood.\nAfter 10 min of fixation, remove the formaldehyde and wash with 2 mL of distilled water each well twice.\nAdd 1 mL of 1% crystal violet stain solution to each well. Stain for 10 min. Remove the crystal violet stain solution, and wash with distilled water 3 times. Remove the water and dry the plates.\nColony counting and calculation",
    "Count the number of colonies with more than 50 cells. Do not include small colonies with less than 50 cells. Check the colonies under a microscope to get an impression of a colony constituted by 50 cells and mark it on the bottom of the plate with a marker pen.\n\t\tNOTE: Photographing the wells and using the software ImageJ will facilitate the counting process.\nCalculate the colony formation efficiency as the number of colonies divided by the number of cells seeded. Calculate the survival fraction as the colony formation efficiency at a certain irradiation dose divided by the colony formation efficiency at 0 Gy.\nUsing the dose as the x-axis and survival fraction as the y-axis, a survival curve can be obtained. Compare the survival curves between the positive and negative cell populations.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}