{
  "id": 11873,
  "origin_website": "Jove",
  "title": "Application of Hemostatic Devices in Laparoscopic Hepatectomy",
  "procedures": [
    "The operation is routine and received ethics approval. The approvals are as follows: Approval for rapid review by the Clinical Research and Application Ethics Committee of the Second Affiliated Hospital of Guangzhou Medical University: The scientific research ethics review project \"Application of simple and easy Hemostatic Devices in Laparoscopic Hepatectomy\" (acceptance No.: 2022-hg-ks-02) was approved by the clinical research and application ethics committee of the Second Affiliated Hospital of Guangzhou Medical University. Its research contents and methods meet the medical ethics norms and requirements.\n1. Preoperative preparation, operative position, and anesthesia\nAsk the patient to consume a liquid diet 1 day before the surgical operation and then abstain from eating food and drinking water at least 8 h before the surgery.\nPlace the patient in a supine position and 30° reverse Trendelenburg position, tilted softly to the left. The principal surgeon operates from the patient's right side.\nPerform endotracheal intubation and give general anesthesia. Judge the anesthetic effect according to the patient's post-anesthesia and intraoperative conditions, such as complete anesthesia block, no additional drugs during operation, and stable vital signs.\n2. Surgical technique\nApply direct puncture to establish pneumoperitoneum in laparoscopy. Place five trocars in the following positions: observation hole in the sub-umbilical area 12 mm trocar, right anterior axillary line 5 mm trocar, right midclavicular line under the costal margin 10 mm trocar, ventral midline 10 mm and 5 mm trocar (see Figure 2).\nAssemble the following hemostatic devices: harmonic scalpel, monopole electrocoagulation, and single lumen catheter, to be innovatively used in liver parenchyma tissue resection (see Figure 3).\nPerform a Pringle maneuver. To do so, follow the steps below.\n\t\nOcclude the first porta hepatis intermittently by using a single lumen catheter. Clamp the lumen catheter with a hemostatic clip for 15 min, followed by releasing for 5 min.",
    "When required to release, use the harmonic scalpel to cut off the clip and take the clip out to restore blood supply to the first porta hepatis (see Figure 4).\nSeparate the hepatic pedicles supplying the tumor. Resect and divide them one by one with a harmonic scalpel (see Figure 5).\nObserve the ischemia line on the liver surface, which becomes visible after the resection of the hepatic pedicles. Use the hook to mark this (see Figure 6).\nResect the liver parenchyma tissue using the harmonic scalpel with clamping and crushing of the liver little by little. Observe the internal hepatic artery, vein, and bile duct now visible. Resect and divide these pipeline structures (see Figure 7).\nOnce bleeding appears, coagulate the bleeding spots on the liver dissection surface immediately using point-to-point monopole electrocoagulation (see Figure 8).\nUse the right posterior hepatic pedicle as a signpost for intrahepatic parenchyma tissue resection. Reserve the main posterior hepatic pedicle (PP) and dissect the branch of pedicles (PPa) supplying the tumor (see Figure 9).\nTo complete the operation, wash the liver surface so one can see if there are still bleeding spots. Stop the bleeding on the liver dissection surface and remove the tumor specimen from the abdominal cavity (see Figure 10).\n\t​NOTE: The Paraffin pathology results of the tumor was metastatic adenocarcinoma, which is shown in Figure 11.\n3. Postoperative nursing\nPerform ECG monitoring after the operation. Calculate the total 24 h inflow and outflow and observe the urine volume.\n\tNOTE: The patient's total rehydration volume (antibiotic, amino acid, vitamin, electrolyte, etc.) was 1,750 mL 10.5 h after surgery (after surgery until 7:00 am the next day). The total liquid excretion of the patient at 10.5h after surgery was 1,900ml, including 1,700ml of urine and 200ml of drainage.",
    "On the first day after the operation, give the patient a liquid diet and instruct the patient to turn over and exercise in bed, such as turning over, patting the back, moving the legs, and other exercises, which are mainly guided by the nurses.\nOn day 2 after the operation, assist the patient to get out of bed and carry out daily activities.\nOn day 3 after the operation, guide the patient to walk in the corridor and increase gradually the amount of activity in combination with the recovery of the patient's condition. Implement psychological intervention according to the patient's situation to improve the patient's bad mood.\nFinally, according to the patient's drainage flow, remove the drainage tube. In this case, the drainage tube was removed on the 7th day after the operation when the drainage flow was 50 mL.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}