{
  "id": 6355,
  "origin_website": "Bio",
  "title": "<em>Eimeria vermiformis</em> Infection Model of Murine Small Intestine",
  "procedures": [
    "Preparing E. vermiformis stockInfect mice with E. vermiformis (1,000 oocysts) in 100 μl of tap-filtered water via oral gavage. At Day 8 post-infection, place the mice in a cage lined with sand (refer to Procedure B and Figure 3). Note: Susceptibility to and patency of infection is mouse strain dependent and should be empirically tested. The protocol described here is typical for the C57BL6/J mouse strain.  Collect mouse feces from a cage containing five infected animals, on Day 9 post-infection. Place feces into a 50 ml Falcon tube, add 40 ml of sterile water and vortex until feces disaggregate. Store in a fridge (2-6 °C).Note: Use of harsher methods such as glass beads may damage the parasites. Repeat procedure, Steps A3-A4, on Days 10 and 11 post-infection.When ready to prepare the stock, pour the contents of the three Falcon tubes through a fine mesh sieve, into a beaker (to remove larger pieces).Working in a fume hood, add 180 ml of a 4% potassium dichromate solution (w/v), making up a final concentration of 2.4% (3 x 40 ml + 180 ml = 300 ml end volume).Add a stir bar to the beaker and place on a magnetic stirrer. Aerate the contents using an aquarium pump on a low setting, enough to create a few air bubbles continuously.Cover beaker with aluminum foil to reduce evaporation.Leave the pump on and keep stirring at room temperature in the fume hood for three days. Regularly check stirrer and aeration.After three days, take a sample and count oocysts in a Fuchs Rosenthal Chamber to check the percentage of sporulation (refer to Procedure C and Figure 2).",
    "If sporulation is under 70%, leave the solution for another day and repeat the counting and sporulation assessment the next day or the day after that if required (generally takes 4-5 days).Once the percentage of sporulation is higher than 70%, place the stock solution in the fridge. Note down the approximate concentration of oocysts for future reference.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20181216/20181216194112_0488.jpgFigure 2. E. vermiformis oocysts. This figure illustrates how “to distinguish sporulated oocyst”. A. Unsporolated or early oocyst. B. Sporulated or late oocyst, which is tetrasporic in which four sporocysts are visible. Recorded at Primovert microscope, taken at 400x magnification (Ocular 10x + objective 40x). Scale bar = 20 μm.Preparing E. vermiformis to infect miceTransfer an appropriate volume containing oocysts from the E. vermiformis stock solution (refer to Procedure A) into a 15 ml Falcon tube. Notes:Usually, stock solution contains approximately 1 x 105 oocysts/ml. Appropriate volume depends on how many mice you wish to infect and the stock solution obtained.  Fill up to 15 ml with sterile water and centrifuge for 8 min at 1,800 x g at room temperature. Discard the supernatant and vortex to detach the pellet from the bottom of the Falcon tube. Fill up again to 15 ml with sterile water and repeat the washing step twice more. Note: Typically, the supernatant changes from light yellow to clear.  Discard the supernatant, vortex the pellet and fill up with Sodium Hypochlorite to 15 ml. Note: It is important to thoroughly re-suspend the pellet in the Sodium Hypochlorite since the oocysts are at the bottom and need to float up, to the top of the Sodium Hypochlorite. Use a vortex to mix.  Centrifuge for 10 min at 1,100 x g with low break (setting 1), room temperature.",
    "Take the tube very carefully from the centrifuge and cautiously remove 1-2 ml from the surface ring and transfer to a clean 15 ml Falcon tube.Note: For the top 1-2 ml, you may spot a slight cloudiness by eye. Optional: After removing the top 1-2 ml (Step B6), fill up again with Sodium Hypochlorite, vortex to re-suspend the pellet and repeat the centrifugation for 10 min, at 1,100 x g, low break, at room temperature. Add 1 ml from the surface ring to the previously collected 1-2 ml in the 15 ml Falcon tube.Fill up the tube containing 2-3 ml of oocysts to 15 ml with sterile water and centrifuge for 8 min at 1,800 x g, at room temperature. Discard the supernatant and fill up again to 15 ml with sterile water. Repeat the washing step twice more. In the last washing step, discard the supernatant and re-suspend the pellet in 1 ml of sterile filtered tap water. Counting sporulated oocysts to infect miceDilute the previously prepared E. vermiformis to count in a Fuchs Rosenthal Chamber 0.200 mm depth, using the 10x objective (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20181216/20181216194133_4736.jpgFigure 3. Fuchs Rosenthal Counting Chamber. A. Two-chamber counting slides (0.200 mm depth; 0.0625 mm2). B. In total the grid contains 16 large squares of 1 mm side, enclosed by triple lines. All 16 large squares are subdivided into 16 small squares of 0.25 mm side. Due to the large counting grid and a depth of 0.2 mm the total volume amount is 3.2 μl, so the chamber factor is 312.5.Count sporulated oocysts in the 16 big squares and multiply by the chamber factor 312.5 (0.2 mm height; volume of 3.2 μl) and the dilution to obtain number of sporulated oocysts/ml. e.g., 60 sporulated oocysts x 312.",
    "5 x 10 (dilution 1:10) = 187,500 oocysts/ml = 1.875 x 105 oocysts/mlNote: See Figure 2 for distinguishing sporulated and non-sporulated oocysts.  Adjust to the desired number of oocysts/ml. e.g., 1,000 oocysts/mouse in 100 μl. From the previous example, to prepare 1 ml with the concentration of 1 x 104 oocysts/ml: 1,000 μl/1.875 x 105 oocysts x 10,000 oocysts = 53.3 μl from the prepared E. vermiformis solution + 946.7 μl of sterile filtered tap waterNote: Prepare extra volume to account for the loss of volume in the gavage needle. The prepared E. vermiformis solution can be kept in the fridge overnight. Give 100 μl to each mouse via oral gavage (standard mouse size).Determining oocyst burden in mouse fecesOn Day 6 post infection, place each mouse individually in a cage lined with fine sand (e.g., playground sand). Note: Use a thin layer of sand, enough to cover the bottom of the cage (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20181216/20181216194159_7888.jpgFigure 4. Mouse housed in Individually Ventilated Cage (IVC) lined with fine sandOn Day 7, collect the sand with feces from each mouse in each cage. Separate the sand from the feces using a sieve and transfer the feces into a 50 ml Falcon tube using a funnel. Line the cage with clean sand and return the mouse to the cage.Add 30 ml of sterile water to the Falcon tube and vortex for 1 min. Samples can be stored in the fridge for up to 6 months, prior to oocyst counting.Repeat Steps C2 and C3 daily until no more oocysts are detected (15-16 days in C57BL6/J mice) for two consecutive days to determine patency (days of oocyst shedding) and accumulative number of oocysts.",
    "Alternatively, if patency periods are similar between mouse lines or conditions tested and since the majority of oocysts are shed between Days 8-10, a shorter defined period may be chosen and reported.Counting total oocysts in infected mouse fecesTo count, vortex the 50 ml Falcon tube containing the feces in 30 ml volume of an individual mouse from one day vigorously to disaggregate the feces.Prepare 3 independent dilutions for each sample in saturated sodium chloride (final volume 1 ml, e.g., dilution 1:10–100 μl of feces + 900 μl of sodium chloride).Note: It is important to cut the tip end of the 200 and 1,000 μl tips (1 cm), in order to take up and transfer the fecal pieces from the sample.  Adjust the dilution to count up to 100 oocysts in each counting chamber.Note: On the peak of infection higher oocysts numbers will be encountered. Prepare serial dilutions, not exceeding more than 3 dilution steps (refer to Table 1). Table 1. Guide to dilute E. vermiformis in mouse feces to count in a McMaster Chamber. Dilutions are dependent on the day post-infection (d.p.i.). These dilutions are representative for C57BL6/J mice infected with 1,000 oocysts. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20181216/20181216194427_7847.jpgFill up the McMaster counting chamber (Figure 5) and wait ~2 min for the oocysts to float up in the saturated sodium chloride solution.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20181216/20181216194223_5793.jpgFigure 5. Two-chamber McMaster counting slide. 0.15 cm depth; 1 cm2.Count total oocysts inside the grid areas using the 10x objective (include oocysts on the left and top grid lines).Take the average of the triplicate counts and multiply by the dilution factor (chamber volume of 150 μl and original volume of 30 ml; dilution factor is 200x) as well as any additional dilutions used to obtain the total number of oocysts/mouse/day (Figure 6).",
    "Formula: Average of oocysts counted from three chambers x 200 x additional dilution = number of oocysts/mouse per dayimgsrc:https://en-cdn.bio-protocol.org/attached/image/20181216/20181216194241_5330.jpgFigure 6. Characteristic oocyst burden of C57BL6/J mice. Counts of oocysts in the feces of mice inoculated with 1,000 sporulated oocysts of E. vermiformis. Three animals were analyzed per time point. Error bars show standard error of the mean (SEM)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}