{
  "id": 9463,
  "origin_website": "Jove",
  "title": "An Injury Paradigm to Investigate Central Nervous System Repair in Drosophila",
  "procedures": [
    "1. Collection of Staged Larvae\nPlace 15 female and 15 male adult flies in a cylindrical Perspex cage to lay eggs on a Petri dish with agar and grape juice supplemented with a small scoop of yeast paste for 3 hr at 25 °C. Change the plate 3-4 times a day, and discard the first plate (i.e. from the O/N egg-lay). Discard also the plates from the first day. From the second day on, keep the plates with eggs at 25 °C. After 7 days of collecting eggs, start with a new set up of parent flies.\nAfter about 24 hr, larvae hatch from the eggs. By hooking larvae with a thinned paintbrush or with a pair of forceps, transfer 35 larvae from the grape agar to a vial containing standard fly food (10 ml) (Figure 1A).\nMaintain the vials containing larvae for 3 days (96 hr After Egg Laying, AEL) at 25 °C.\n2. Dissection of Larval Ventral Nerve Cords for Culture\nClean bench and hands with 70% ethanol. Soak 4 staining blocks, 2 pairs of forceps and a needle with 70% ethanol, and let air dry.\nPrepare 4 staining blocks with the following media: one with Distilled Water (DW) to clean and to pool cleaned larvae; a second one with 2 ml of Shield and Sang M3 insect medium with 1% penicillin and Streptomycin, Ecdysone-free (M3 PS medium) to dissect the larvae; a third with 2 ml of M3 PS medium to pool dissected ventral nerve cords (VNCs); and a fourth with 2 ml of M3 PS medium to stab the VNCs. All of the reagents must be pre-warmed to RT.",
    "Add water to the vial containing 96 hr AEL larvae. Then, by using a spatula, gently spread food with larvae from the vial on to a wet paper towel. Transfer 10 larvae to a staining block containing DW to wash off the food. Replace DW 6 times. Then replace with M3 PS medium.\nTransfer one of the larvae to a staining block containing 2 ml of M3 PS medium.\nUnder a dissecting microscope, dissect a larval brain carefully using standard methods 12, but to minimize tissue damage, take special care by proceeding in the following way. Place the larva dorsal side up, and hold the dorsal side at one third from the anterior end with 2 pairs of forceps (one in each hand). Whilst holding the anterior section, pull away the posterior end with the forceps, and tear the epidermis. The brain and the VNC should be visible from the posterior edge of the anterior half. Carefully isolate the brain and VNC complex by removing the fat body, gut and epidermis. When the VNCs are damaged too much, the VNCs will degenerate fully or partially even without stabbing injury. Take into account the following points:\nDo not pull or tear the imaginal discs and peripheral nerves from the thoracic VNC as this will damage the VNC. To cut the peripheral nerves, hold the peripheral nerves with two pairs of forceps placed close each other, and then pull the nerves with the forceps. Imaginal discs and mouth parts can be left attached to the VNC.\nLeave the ring gland and lymph gland attached to the brain.\nCut the gut at the point closest to the brain, where not much food is contained.",
    "By using a P20 pipetman with the tip cut off and widened a little, transfer the VNC to a staining block containing fresh M3 PS medium. Before transferring the VNC, first pipette up and down only the medium used for the dissection in order to prevent the VNC from sticking to the tip.\n3. Stabbing Injury to the Drosophila Larval VNC\nThis section describes how to perform stabbing injury to the VNCs, and to prepare stabbed-VNCs for time-lapse analysis and immunostaining. Post-stabbing culture conditions and duration are described in section 5 (for time-lapse analysis) and in section 6 (for immunostaining).\nAfter pooling enough VNCs (4-5 for time-lapse and over 24 for immunostaining), transfer one VNC to a clean staining block containing M3 PS.\nOrient the VNC so that the dorsal neuropile is in view under the dissecting microscope (Figure 1B). This is the most natural orientation for VNCs to lie in when attached to the optic lobes.\nStab manually using a tungsten needle under the dissection microscope, from the dorsal side virtually at a right angle and aiming for the abdominal half of the VNC (Figure 1B).\nTake particular attention to the following:\nStab only once.\nStab until the needle hits the bottom of the glass. However, be careful not to damage the needle tip.\nThe stem of the needle holder must not touch the medium during stabbing.\nThe wound is not visible under the dissection microscope.\nNote: Stab-injury unrelated degeneration\nThe procedure can result in cellular degeneration within the VNC distinct from the stabbing lesion. Degeneration results in holes in the neuropile, and occasionally holes have been observed in the cortex of non-stabbed specimens. Specimens with degeneration affecting the neuropile or widespread degeneration affecting also the VNC surface must be discarded. Degeneration can be identified as follows:",
    "Rough surface, especially at the lateral/ventral area of the thorax, at 22 hr of stabbing. In extreme cases, the VNC looks protruded.\nHoles or vacuoles in the thoracic neuropile, which can be visible as holes in background signal with fluorescence immunostaining.\n4. Maintenance of Needle and Forceps\nRoutinely check whether the needle tip is sharp enough. The needle tip can be bent or blunt after using it for several experiments. In this case, sharpen the tip using an Arkansas stone or equivalent.\nThe tips of the forceps must meet perfectly. The tips can get damaged with use. In this case, adjust the tip using an Arkansas stones or equivalent.\n5. Culture and Time-lapse Recording of Stabbed VNCs\nTo visualize the axonal neuropile in the living VNC, a GFP protein trap line that labels all axons - G9 13 - can be used, and to visualize all glial cells (except the midline glia) the glial driver repoGAL4 can be used to express the UASdsRed S197Y 14 reporter. By crossing G9 flies to UASdsRedS197Y;;repoGAL4 flies, VNCs from progeny larvae are obtained with green axons and red glia that can be recorded in living tissue.\nAfter pooling 4-5 VNCs, transfer 1 VNC to a clean staining block containing 2 ml of M3 PS, and stab the abdominal half of the VNC as indicated in section 3.\nTransfer the stabbed VNC to a Poly-L-lysin coated 3.5 mm glass bottom Petri dish containing 1 ml of M3 PS. Place the VNCs dorsal side down. Gently push the VNC using the flat side of a pair of forceps to allow the VNC to stick to the dish.\nGently add 1 ml of M3 PS 15% FBS rendering the final concentration of FBS to 7.5%.",
    "Acquire images using laser scanning confocal microscopy. Scan the VNC, collecting a Z-section series throughout its entire thickness. We used a Leica SP2 inverted confocal microscope with a temperature controlled environmental chamber. Any equivalent confocal microscope should work, however it may require optimization of the settings for the scanning. The settings for our time-lapse confocal microscopy were as follows: Temperature of environmental chamber: 25 °C; 20X objective with 4 times zoom; scanning mode xyzt, with 512x512 pixel resolution, z=1 μm steps and 1-hour or 2-hour intervals.\nThe Leica SP2 confocal microscope has a limitation in file size for scanning. With these settings, 8-9 timepoints can be scanned. With other confocal microscopes, it ought to be possible to acquire image stacks for longer time points, i.e. over the span of up to 24 hr.\n6. Culture and Immunostaining of Stabbed and Fixed VNCs\nPrepare a 24-well tissue culture plate containing 500 μl of M3 PS 7.5% FBS per well.\nRepeat dissection of more than 24 VNCs for a 24-well tissue culture dish.\nBy using the P20 pipetman with the tip cut-off, transfer 12 non-stabbed VNCs from the pool to the culture dish, using 1 VNC per well.\nStab the rest of VNCs in the pool as described in section 3. Transfer each stabbed VNC to a well each.\nPlace the 24-well dish in the 25 °C incubator for a desired duration depending on the experiment. Cell integrity is unaltered for at least 24 hr.",
    "After culture, transfer the 12 VNCs in 250 μl of 4% formaldehyde PEM in a 1.5 ml tube by using the P20 pipetman with the tip cut-off. Then, the fixative is carefully pipetted out, taking care not to damage the VNCs. A small amount of fixative sufficient to cover the samples should remain in each tube. Subsequently, add fresh fixative, and gently agitate for 50 min at RT.\nRinse 2 times with 0.3% Triton X PBS, and then wash 2 times for 10 min with 0.3% Triton X PBS at RT.\nBlock VNCs by incubating with 10% normal goat serum in 0.3% Triton X PBS for 1 hr at RT. The samples can be stored at 4 °C for at least one month.\nIncubate VNCs with primary antibodies for more than 20 hr at 4 °C.\nRinse 2 times with 0.3% Triton X PBS, then wash 3 times for 10 min with 0.3% Triton X PBS at RT.\nIncubate VNCs with secondary antibodies for more than 16 hr at 4 °C.\nRinse 2 times with 0.3% Triton X PBS, then wash 3 times for 10 min with 0.3% Triton X PBS at room RT (in the dark if using fluorescent secondary antibodies).\nReplace PBS with 50% glycerol: 50% PBS for at least an hour.\nThen replace with 80% glycerol: 20% PBS for at least an hour.\nMount a VNC in a window made on 2 layers of cello-tape (approximately 0.06 mm) on a microscopy glass slide. Adjust the orientation, and place a coverslip (18x18 mm) over the window. Two VNCs can be mounted on a slide using this method.\nUsing a variety of primary antibodies, different cellular responses to injury can be analyzed (e.g. changes in cell number and cell shape).",
    "7. Analyze Data Using ImageJ and a Range of Plugins\nIf the VNC does not have stabbing unrelated degeneration, the sample must be counted in for the analysis regardless of lesion size. As stabbing is done manually, the lesion size differs each time. Thus it is important to analyze statistically the effect of stabbing, whenever possible.\nWound size measurement. The size of the wound is an indicator of repair 15. The stabbing lesion is visible as devoid of GFP expression. Lesion area can be measured lapse data using freely available ImageJ software, as follows:\n\t\nUsing ImageJ, open a stack of confocal images from \"File\" menu, select \"Import\" and from here select \"Image sequence\". This will turn the collection of individual images into a stack.\nNext change the \"stack\" into a \"Hyperstack\" by going to \"Image\" menu, select \"Hyperstack\", then select \"Stack to Hyperstack\".\nSet the voxel size by using \"Properties\" from \"Image\" menu. In data acquired using the Leica SP2 confocal microscope, the voxel size can be obtained from the scanning-software, and from the metadata text file saved together with images. With our setting as described in Section 3, pixel dimensions are xy=0.366211 μm and z=0.99709 μm.\nBy examining all the slices in one time point, draw the maximum outline of the lesion area with the polygon-selection tool in the tool bar. This is the Region Of Interest (ROI).\nAdd the ROI to the ROI manager by going to \"Analyze\" menu, scroll down and select \"Tools\", then \"ROI manager\", then \"add\".\nRepeat this for the all the time points.\nClick the \"Measure\" button in the ROI manager to obtain the area size of each ROI.",
    "Correction of VNC movement during time-lapse recordings. \"Stackreg\" and \"Turboreg\" plugins 16 (from the ImageJ website http://rsbweb.nih.gov/ij/[href=http://rsbweb.nih.gov/ij/]): these plugins allow to correct small sample movements during time-lapse. Build a stack with an equivalent representative optical section through all the time-points and apply the plugins. It helps to visualize how the lesion changes over time. The details on these methods and the instruction manual are available from the research group that developed these plugins. (http://bigwww.epfl.ch/thevenaz/stackreg/[href=http://bigwww.epfl.ch/thevenaz/stackreg/]).\nAutomatic counting of glial cells. \"DeadEasy glia\" plugin (www.biosciences-labs.bham.ac.uk/hidalgo/Software.html[href=http://www.biosciences-labs.bham.ac.uk/hidalgo/Software.html]): this was developed to count the number of REPO-positive glial cells in the Drosophila larval VNC and to examine the change in glial number caused by stabbing injury17. The plug-in works accurately, with an error of 0.1% false positives and 4.3% false negatives 17. To use this plug-in, first label all the glia (except the midline) in the specimen using immunofluorescence with anti-REPO antibodies. Then install the plug-in in ImageJ, open a stack of confocal images and run plug-in. It counts glial cells automatically in about 30 seconds.\nAutomatic counting of apoptotic cells. \"DeadEasy Caspase larvae\" plug-in (www.biosciences-labs.bham.ac.uk/hidalgo/Software.html[href=http://www.biosciences-labs.bham.ac.uk/hidalgo/Software.html]) 18: This was developed to count the number of cells labeled with anti-cleaved-Caspase3, and a new version was adapted for the larval VNCs. Stabbing injury causes an increase in programmed cell death 11. To use this plug-in, first label apoptotic cells in the specimen using immunofluorescence with anti-cleaved-Caspase-3 antibodies. Then install the plug-in in ImageJ, open a stack of confocal images and run plug-in. It counts apoptotic cells automatically in about 30 seconds.\n8. Reagents\nCulture medium: Shield and Sang M3 insect medium, 7.5% fetal bovine serum, 1% penicillin and 1% Streptomycin.\n0.01% Poly-L-lysin in sterile DW.\nFixative: 4% formaldehyde, Ultra pure in PEM (0.1 M PIPES, 2 mM EGTA, 1 mM MgSO4) solution.",
    "Blocking solution for immunostaining: 10% normal goat serum in 0.3% Triton X PBS.\nAnti-Glutamine Synthetase 2 antibodies: 1:250 in blocking solution.\nAnti-GFP antibodies: 1:1,000 in blocking solution.\nAnti-REPO antibodies: 1:250 in blocking solution.\nAnti-ELAV antibodies: 1:250 in blocking solution.\nAnti-cleaved Caspase 3 antibodies: 1:1,000 in blocking solution.\nSecondary antibodies: 1:250 in blocking solution."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}