{
  "id": 11932,
  "origin_website": "Jove",
  "title": "A Syngeneic Orthotopic Osteosarcoma Sprague Dawley Rat Model with Amputation to Control Metastasis Rate",
  "procedures": [
    "All the procedures and experiments involving rats were performed according to protocols approved by Johns Hopkins Animal Care and Use Committee.\n1. The SD rat OS cell line UMR-106 cell culture protocol\nGrow cells in DMEM, supplemented with 10% (v/v) FBS, penicillin (10 U/mL)-streptomycin (10 U/mL) at 37 °C in humidified 5% CO2 atmosphere. Perform experiments using cells with passages of 2-812.\n2. Intratibial injection of OS cells protocol\nNOTE: Time-mated pregnant SD rats give birth in the animal facility and at 3 weeks of age, litters are used (since UMR 106 cell line is syngeneic to SD rats, no irradiation is needed).\nInduction\n\t\nPlace the rat in a medium-sized induction chamber and induce anesthesia with 2%-3% isoflurane. Monitor the animal continuously for the depth of anesthesia by reflex to toe pinch, respiratory rate, and character.\nInsert the nose into the nosecone. Secure with tape, if necessary.\nRemove the hair on the right leg up to the ventral and the dorsal lower abdomen with clippers or use depilatory agent. Place the rat in a supine position.\nScrub the surgical area aseptically using 70% ethanol and dilute chlorhexidine acetate or dilute betadine. Begin around the area of the knee and scrub in a circular motion both proximally and distally. Repeat this step three times. No drape is used for tumor implantation.\nApply eye lubricant in both the eyes of the rat to prevent corneal desiccation caused by anesthesia. Place the rat on a low heat setting heating pad. Ensure that the rat has normal body temperature (37 °C) and normal respiratory rate.\nSurgery\n\t\nTurn on isoflurane at ~1.5%-2% (for maintenance). Ensure that the animal is at an adequate plane of anesthesia via lack of a toe-pinch reflex. If not, increase the isoflurane percentage to 2.5%.",
    "Mark a sterile needle (approximately 22 G) at 10 mm from the tip for guidance of depth to insert.\nInsert the needle 10 mm down into the diaphysis of the tibia by entering the bent knee in the middle of the tibial plateau, extending the needle through the metaphysis into the diaphysis using a light drill-like motion to make an opening. Remove the needle.\nLoad the cell suspension into the Hamilton syringe directly before injection into the tibia. To do this, gently mix the cells before drawing into syringe as gravity makes the cells settle in the bottom of the tube.\n\t\tNOTE: Cells can be stored in a 1.5 to 2 mL tube (at room temperature) before drawing into the Hamilton syringe (100 µL) after careful mixing. Cells can be kept at room temperature for 2-3 h during the implantation procedure. Always check the cell viability of cells in the tube before and then after the implantation session. Trypan blue exclusion is the easiest method for cell viability assessment.\nOnce the bone is traversed with the first needle, insert a second (smaller diameter needle also marked at 10 mm) needle attached to the 100 µL Hamilton syringe loaded with cells. Ensure to insert the needle up to the 10 mm mark into the same hole extending into the diaphysis.\nGently discharge 20 µL of 75,000 OS cells suspension in PBS into the diaphysis and marrow cavity.\n\t\tNOTE: The needle should not wobble in the bone and should feel secure. If the needle easily moves, the cortex may have been traversed at the diaphysis. Repeat the insertion again to get a firmer placement before the injection of cells.\nRemove the Hamilton needle from the bone.",
    "NOTE: If a small drop of blood forms, apply light pressure. If clear fluid drop forms at the puncture site, the needle may not have been extended far enough in the bone and the tumor cell suspension may have leaked back through the hole. Record this in the notes but generally, tumor implantation will be successful. With experience, the tumor implantation procedure should take 5 min per rat. With experience, the tumor implantation of cells in the bone will become easier. Accidental injection of cells in the muscle around the bone, may not lead to the tumor microenvironment needed for pulmonary metastasis.\nRecovery\n\t\nEnsure that the rat is normothermic. Place the rat in a cage with a heating pad placed under the cage for recovery.\nAfter fully awake, mobile, and breathing well, inject the rats with Buprenorphine (1.0-1.2 mg/kg SC).\n\t\tNOTE: To get access to Buprenorphine, check with the institution to see options for approval through the veterinary staff to place the order.\nMove the rats back to clean cages and monitor once a day, each week.\n3. Measurement and monitoring\nMeasure the tumor size 9-10 days post-implantation and then every 2 days until 3 weeks post-implantation to establish a growth rate. Measure the maximum diameter of the tibia using an electronic or manual caliper. Store the data in a spreadsheet with a formula to calculate tumor volume. Measure the contralateral (not implanted tibia) as the baseline.\n\tNOTE: The implanted hindlimb diameters are used as a surrogate for tumor size. The hind limbs are measured perpendicular to the tibia long axis at the largest diameter for two measurements, ventral/dorsal and media/ lateral on the limb. The estimated tumor volume is calculated by the formula11: Tumor volume (mm3) = largest diameter (mm) x smallest diameter (mm)2/2.",
    "Consider the rats for survival amputation or chemotherapy treatment when tumors approach 15 mm in the largest dimension or 3 weeks post tumor implantation. The contralateral limb measures about 7-9 mm in most rats at this age.\n4. Doxorubicin intravenous administration\nAnesthetize the rats with 2% isoflurane. Prepare the skin over jugular vein with three surgical washes using betadine and alcohol as described13.\nUnder careful dissection, visualize the right or left jugular vein. Insert the needle into the overlying muscle and then direct toward the rat's head into the jugular vein lumen as it is visualized in the jugular vein anterior to the pectoralis muscle.\n\t\nWhen the needle is inserted into the jugular vein, gently draw blood into the syringe to ensure proper insertion. It is possible to believe that the needle is through the vein, but the needle is under the vein and not in the lumen. If the jugular vein becomes too small for injections when blunt dissecting to expose the jugular vein, use the other jugular vein for the injection.\nInject doxorubicin (2 mg/kg) slowly over 1 min in a volume of 100-150 µL. The solution can be visualized intravenously in the jugular vein during delivery.\nInject similar volumes of normal saline in control rats.\nRemove the needle and apply gentle pressure on the vein with a sterile gauze.\nClose the skin incision using 3-4 wound clips. Remove the clips at 7-10 days post injection.\n\tNOTE: Rats do not usually try to remove metal clips but will bite and remove sutures. The jugular injection method is preferable to tail vein injections for doxorubicin since any drug that leaks outside the vessel causes necrosis of tail that may require tail amputation.\n5. Hind limb amputation protocol\nInduction",
    "Place the rat in a medium-sized induction chamber and induce anesthesia with 2%-4% isoflurane. Monitor the rat continuously for the depth of the anesthesia.\n\t\tNOTE: The induction chamber is scavenged to a charcoal canister and any other gases are removed by a down-draft table used for surgery.\nInsert the nose into a nosecone. Secure with tape, if necessary.\n\t\tNOTE: This procedure is done on a down-draft table to scavenge excess volatile gases (i.e., isoflurane).\nRemove the hair on the right leg up to the ventral and the dorsal lower abdomen with clippers or use depilatory agent. Place the rat in a supine position.\nScrub the surgical area aseptically using 70% ethanol and dilute chlorhexidine acetate or dilute betadine. Prepare the skin for surgery from middle of the calf to skin area just above the hip joint of the right lower abdomen. Scrub the leg proximal and the distal area circumferentially. Repeat this step three times.\nApply the eye lubricant in both the eyes of the rat. Ensure that the rat has normal body temperature (37 °C) and normal vital signs. Monitor and regulate body temperature using a heating pad that is connected to a rectal temperature probe monitor.\nSurgery\n\t\nTurn on isoflurane at 1.5%-3% (maintenance). Monitor for anesthetic depth, including reaction to toe pinch, respiratory rate, and character. Adjust the rate of isoflurane as needed to maintain an appropriate plane of anesthesia.\n\t\tNOTE: Respiratory rate while under anesthesia should be between 50-100 breaths per minute. Deep, infrequent breaths are an indication that the rat is too deeply anesthetized.\nOpen sterile instrument packs and drapes and don sterile gloves. Take care to maintain sterility through the duration of the procedure. Basic sterile surgical instruments needed include, scalpel blade holder, forceps, hemostats, needle holder, scissors, and wound clip applier.",
    "Pull the leg of the rat through the vent of the sterile surgical drape. Ensure that the animal is at an adequate plane of anesthesia via toe-pinch reflex.\nUsing a scalpel blade or surgical scissors, make a circumferential, cutaneous incision just proximal to the stifle (knee joint).\nDeglove the hind limb using gauze or blunt dissection to expose the femoral artery and vein on the ventral-medial surface of the hind limb.\nLigate the vessels using 4-0 absorbable sutures at the level of the mid-femur and transect distally.\nClamp the vein distally to reduce leakage during muscle dissection.\n\t\tNOTE: Circumferential musculature will be transected distal to the level of femoral artery vessel ligation and muscles elevated from the femur to the level of the coxofemoral joint.\nUsing blunt dissection, abduct the hip joint with lateral outward rotation.\nFind the head of the femur and disarticulate it from the acetabulum. Cut any remaining tissue keeping the leg attached to the body.\nGive a splash block to the acetabulum and sciatic nerve with approximately 6 mg/kg Ropivacaine.\nClose the musculature over the acetabulum using a simple interrupted suture (4-0, absorbable suture).\n\t\tNOTE: Additional 0.5% bupivacaine or lidocaine (0.15-0.2 mg total) may be injected in several sites along the closed muscle layer (local infiltration/splash block).\nOppose and close the edges of the skin using wound clips placed apart every 5-10 mm.\nRecovery\n\t\nPlace the rat in a clean recovery cage with heat support using a heating pad placed under the cage.\n\t\tNOTE: To prevent hyperthermia, the heating pad should not be in direct contact with the animal and should not exceed 40 °C.\nMonitor the animal until it fully recovers and is normothermic (37.5-39 °C).",
    "NOTE: The animal should not be left unattended until fully conscious and sternally recumbent and moving easily around the cage.\nAfter fully awake, mobile, and breathing well, inject the rats with Buprenorphine (1.0-1.2 mg/kg SC).\n\t\tNOTE: Giving Buprenorphine in an anesthetized rat may impair recovery.\nAdminister 10 mL of warm lactated Ringer's solution subcutaneously between the shoulder blades.\nMove the rats back to the clean cage and reunite with conspecifics.\nMonitor all the animals twice daily for the next month for signs of pain and distress, including piloerection, hunched posture, or inappetence or signs of incision site infection, including erythema, purulent discharge, or wound dehiscence.\n\t\tNOTE: To date we have not observed clinical signs (such as infections) following post-operative recovery in any of the animals. Only one rat had a dehiscence with sutures, after which wound clips were used to close wounds with no further problems.\nAdminister buprenorphine or meloxicam to animals presenting clinical signs of pain at published doses in consultation with a laboratory animal veterinarian.\nAdminister antibiotics (i.e., cephalosporin) to animals presenting clinical signs of pain at published doses in consultation with a laboratory animal veterinarian.\n\t\tNOTE: Any animals exhibiting protracted signs of pain or distress that do not improve with analgesics or animals exhibiting signs of infection that do not respond to antibiotics need to be humanely euthanized.\n6. Imaging with X-ray\nAfter tumor implantation, image the tibias and lungs non-invasively to detect tumor growth using X-ray with a machine designed for rodents.\nAnesthetize the rats as previously done.\nTake images at 3x magnification for 6 s at 25 kV.\nProcess the film using the X-ray processor. Radiographs can be digitally scanned as well.\n7. Necropsy procedure",
    "Euthanize the rats with CO2. Confirm death via lack of heartbeat and immediately draw 3 mL blood from the heart for serum or plasma samples.\nOpen the thorax and abdomen for examination.\nIsolate the trachea and cannulate with a (18 G) catheter. To secure the catheter in the trachea, tie a silk suture around both the trachea with the catheter.\nConnect the infusion catheter to a 3 or 5 mL syringe. Infuse formalin or saline to gently inflate the lung lobes for better histology specimens. On infusion, the lungs will puff up and enable a better visualization of pulmonary metastases.\nExamine, dissect, and weigh all the selected thoracic and abdominal organs (such as liver, kidneys).\nFix the organs in formalin for histopathology or freeze on dry ice, 2-methylbutane, or liquid nitrogen.\nFor evaluation of protein expression using western blot, make lysates of frozen tissues. Antibodies that react with rat tissues are detailed13.\n8. Immunohistochemistry\nProcess the primary OS tissue, embed in paraffin, and section it for immunohistochemical staining.\nRetrieve the antigen after deparaffinization using citrate buffer (pH 6.0). Incubate in 0.3% H2O2 in methanol for 30 min to quench endogenous peroxidase.\nBlock the 5 µm thick paraffin sections using normal serum.\nIncubate with primary anti-CD68 and CD3 antibodies (see table) overnight at 4 °C.\nRinse the sections in PBS and incubate them in HRP polymer using a detection kit.\n\tNOTE: Immunostaining was developed with diaminobenzidine as a chromogen.\n9. Western blotting\nLyse the UMR-106 cells in 200-300 µL of lysis buffer14 to perform standard gel electrophoresis and western blotting.\nUse 4% to 12% Bis-Tris gels.\nIncubate in anti-ErbB2, anti-ErbB4, anti-EGFR, anti-ERK, β-actin or anti-mouse β2-AR primary antibody (see table) and horseradish peroxidase-linked secondary antibody.\nAdd the chemiluminescent substrate. Expose the membranes to X-ray film.",
    "NOTE: β-actin levels are used as loading controls.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}