{
  "id": 5419,
  "origin_website": "Bio",
  "title": "Ribosomal RNA N-glycosylase Activity Assay of Ribosome-inactivating Proteins",
  "procedures": [
    "The general procedure to assay N-glycosylase activity is illustrated in a flowchart in Figure 2.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170315/20170315105629_1967.jpgFigure 2. Flowchart illustrating protocol Procedure parts A-H. The flowchart shows the key steps describing the eight main parts of the protocol procedure. Capital letters (A-H) refer to the subsections in the Procedure section.Treatment of ribosomes with RIPsThaw frozen aliquots of both rabbit reticulocyte lysate (stored at -80 °C) and RIP (stored at -20 °C) at room temperature and place them on crushed ice.Reactions are prepared on crushed ice into four Eppendorf tubes as indicated in the following:table:\n﻿0,1,2,3,4\nTube,1 (control),2 (control),3 (+RIP),4 (+RIP)\nlysate,40 µl,40 µl,40 µl,40 µl\nRIP (1 mg/ml),-,-,1 µl,1 µl\nPipette 40 µl of rabbit reticulocyte lysate into the four tubes.Add 1 µl of 1 mg/ml RIP into tubes 3 and 4.Mix by gently vortexing.Incubate at 30 °C for 1 h in a water bath.Stop the reaction by adding 2 µl of 0.5 M EDTA (pH 8.0).Mix by gently vortexing.Add 500 µl of 50 mM Tris/0.5% SDS.Vortex hard for 30 sec (with the purpose of denaturing proteins with the aid of SDS).DeproteinizationNote: This process should be carried out under a fume hood.Add 500 µl of phenol.Vortex hard for 30 sec.Centrifuge at 16,060 x g (13,000 rpm) for 5 min at room temperature.Recover the aqueous (upper) phase (400 µl) to a new Eppendorf tube without disturbing the protein interphase.RNA precipitationTo carry out RNA precipitation with 3 volumes of ethanol in 1.5 ml tubes, the aqueous phase is split into two Eppendorf tubes (A and B), with 200 µl in each. Perform ethanol precipitation by mixing the following:table:\n﻿0,1,2,3,4\nTube,1A (control),1B (control),2A (control),2B (control)\nAqueous phase,200 µl,200 µl,200 µl,200 µl\n\"3 M sodium acetate, pH 5.2\",20 µl,20 µl,20 µl,20 µl\nAbsolute ethanol,600 µl,600 µl,600 µl,600 µl\ntable:\n﻿0,1,2,3,4\nTube,3A (+RIP),3B (+RIP),4A (+RIP),4B (+RIP)",
    "Aqueous phase,200 µl,200 µl,200 µl,200 µl\n\"3 M sodium acetate, pH 5.2\",20 µl,20 µl,20 µl,20 µl\nAbsolute ethanol,600 µl,600 µl,600 µl,600 µl",
    "Mix by vortexing.Keep overnight at -80 °C (or at least 3 h).Centrifuge at 16,060 x g (13,000 rpm) for 15 min at 4 °C. Orient each tube in the rotor with the cap hinge pointing outward, this will indicate the position of the pelleted RNA since pellets will be scarcely visible.Take the tubes out. Carefully decant the supernatant liquid and discard it into paper towel without losing sight of the off-white pellet avoiding its displacement.Add 250 µl of 70% ethanol.Centrifuge at 16,060 x g (13,000 rpm) for 15 min at 4 °C. Orient each tube in the rotor with the cap hinge pointing outward.Carefully decant the supernatant liquid and discard it into paper towel avoiding pellet displacement. Remove any droplet on the tube wall with the aid of a cotton swab.Place the tubes up-side-down onto a clean paper towel and allow the pellet to air-dry for 15 min.Resuspend the pellet in 10 µl of RNase-free deionized water. Mix the contents of tubes 1A and 1B, and 3A and 3B, obtaining now the tubes 1 and 3 with 20 µl each. Store these samples at -80 °C. Tubes 2A, 2B, 4A and 4B still remain separated.Aniline treatment of RNAAdd one volume (10 µl) of 2 M aniline (pH 4.5) to tubes 2A, 2B, 4A and 4B. Note: Reaction is carried out on crushed ice.Mix by vortexing.Incubate for 10 min on ice.Stop the reaction by adding 200 µl of RNase-free deionized water and mix by vortexing.Add 200 µl of water saturated ether.Vortex hard for 20 sec.Let the sample stand for 20 sec to allow phase separation.Discard the ether (upper) phase.Repeat steps D5 to D8. Add 20 µl of 3 M sodium acetate (pH 5.2) and 600 µl of absolute ethanol.Mix by vortexing.Keep overnight at -80 °C (or at least 3 h).",
    "Centrifuge at 16,060 x g (13,000 rpm) for 15 min at 4 °C. Orient each tube in the rotor with the cap hinge pointing outward.Take the tubes out. Carefully decant the supernatant liquid and discard it into paper towel without losing sight of the off-white pellet avoiding its displacement.Add 250 µl of 70% ethanol.Centrifuge at 16,060 x g (13,000 rpm) for 15 min at 4 °C. Orient each tube in the rotor with the cap hinge pointing outward.Carefully decant the supernatant liquid and discard it into paper towel avoiding pellet displacement. Remove any droplet on the tube wall with the aid of a cotton swab.Place the tubes up-side-down onto a clean paper towel and allow the pellet to air-dry for 15 min.Resuspend the pellet in 10 µl of RNase-free, deionized water. Mix the contents of tubes 2A and 2B, and 4A and 4B, obtaining now the tubes 2 and 4 with 20 µl each. Store these samples at -80 °C.Spectrophotometric quantification of RNAThaw frozen samples 1-4 with 20 µl each and place them on ice.Determine the RNA concentration of each sample in the spectrophotometer at 260 nm (in quartz cuvette of 10 mm path length, using water as blank). If A260 = 1, then the RNA concentration is 40 µg RNA/ml. Usually the yield of the process is 45-50 µg RNA for samples treated with aniline and 50-60 µg RNA for untreated samples.Preparation of 7 M urea/5% (w/v) polyacrylamide gelPrepare 25 ml of mix for two gels (glass plates of 10 x 10.5 cm, spacers of 0.1 cm) in a RNase-free Corning tube: 2.5 ml 10x TBE; 3.1 ml acrylamide/bisacrylamide (40%); 10.5 g urea; 12.3 ml RNase-free, deionized water; 0.2 ml 10% ammonium persulfate; 0.05 ml TEMED.Preparation of samplesSamples are prepared into Eppendorf tubes placed on crushed ice.",
    "Add 3 µg of RNA.Complete the volume to 5 µl with water.Add 5 µl of 2x gel loading buffer.Mix by vortexing.Boil 30 sec (in a 100 °C water bath) and place the tubes on crushed ice immediately.ElectrophoresisAttach the gel plates to the gel apparatus.Add TBE electrophoresis buffer (900 ml water and 100 ml 10x TBE) to the top and bottom chambers.Remove the comb and rinse the wells with buffer to remove residual urea (using a Pasteur pipette).Using a micropipettor, load the samples.Run the gel at 15 mA for 1 h 50 min.Disassemble the gel.Stain the gel with either 0.5 µg/ml ethidium bromide or GelRed solution at room temperature for 40 min with gentle shaking (destaining is not needed after staining).Place the gel on an ultraviolet transilluminator. Visualize and photograph RNA bands. Note: Be aware that RNA will diffuse within the gel over time, therefore examination and photography should take place shortly after the end of electrophoresis.A representative data is shown in Figure 3. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170315/20170315111049_0763.jpgFigure 3. rRNA N-glycosylase activity of BE27 in rabbit reticulocyte lysate. Each lane contained 3 µg of RNA isolated from either untreated (control) or RIP (+BE27) treated ribosomes from rabbit. The arrows indicate the 28S, 18S and 5.8S rRNAs, and the RNA fragment released as a result of RIP action after aniline treatment (+). The number of the corresponding tube in section A is indicated. Samples from lanes 5 and 6 were processed as samples from lanes 3 and 4, respectively, but the ribosomes were treated with 3 µg instead of 1 µg of BE27. The size of RNA markers in nucleotides are also indicated (M). The gel to the left was stained with ethidium bromide and the gel to the right with GelRed."
  ],
  "subjectAreas": [
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}