{
  "id": 7541,
  "origin_website": "Bio",
  "title": "Labeling and Tracking Mitochondria with Photoactivation in <em>Drosophila</em> Embryos",
  "procedures": [
    "Fly culture and embryo preparationCross nanos-Gal4 and mito-PA-GFP flies, and maintain them at 25°C on standard cornmeal-agar Drosophila medium containing yeast granules (Figure 1A, 1B-1).Collect the F1 generation of nanos-Gal4 and mito-PA-GFP (nanosGal4/mito-PA-GFP) containing female and male flies, and add them to embryo collection cages containing 3% sucrose-agar plates supplemented with yeast paste (Figure 1B-1). Discard the egg collection from the first 30 min, since they are often of varied ages, and add fresh plates.Collect embryos from nanos-Gal4/mito-PA-GFP flies 1.5 h after adding a fresh collection plate to the cages. This collection will contain embryos with a maximum age of 1.5 h in the syncytial blastoderm stage. Collect embryos after 2.5 h for imaging cellularization. Add water to the embryo collection plates. Gently dislodge the embryos from the agar using a fine brush and pour them into a cell strainer. Wash them with water in the cell strainer, until all the yeast paste is washed off (Figure 1B-2, 3).Dip the cell strainer containing the embryos in a slightly larger plate containing 100% bleach for 1 min to remove the embryonic chorion. You may observe the loss of the chorion with a stereomicroscope (Figure 1B-4).Carefully wash the embryos with water, to remove any residual bleach (Figure 1B-5).Using a stereo light microscope and brush, place the dechorionated embryos on a 2 chambered coverglass dish (Figure 1B-6).Carefully add 2 mL of PBS to the 2 chambered coverglass bottom chamber (Figure 1B-6).Add oil to the 63×/1.4NA objective in an available confocal microscope. We used the Zeiss LSM780 confocal microscope. Place the coverslip bottom chambers containing the embryos in an incubator stage at 25°C, to perform photoactivation (PA) experiments (Figure 1B-7).Mito-PA-GFP is photoactivated and imaged using the 405 nm and 488 nm lasers, respectively (Figure 1C), as described further.",
    "Notes:  The mito-PA-GFP fluorescence is faintly visible without photoactivation. The weak fluorescence can be used to decipher whether the transgene is present in the desired tissue and correctly targeted to mitochondria. Immunostaining with anti-GFP antibodies can also be carried out to test the expression and distribution of the transgene in mitochondria. Choose the objective magnification most suitable for the tissue of interest. The temperature of the incubator chamber depends on the tissue being processed. It is typically 25°C for Drosophila embryos and tissues, and 37°C for mammalian cells. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4347/bioprotoc-12-05-4347-g001.jpgFigure 1. Obtaining Drosophila embryos on coverslip bottom chambers for photoactivation experiments. (A) Representation of the Drosophila cross scheme. (B) Schematic showing embryo preparation for photoactivation. Female and male mito-PA-GFP flies are incubated in embryo collection cages containing agar plates supplemented with yeast paste (1). The embryos laid on the plate are collected in a strainer, by squirting water on the yeast agar plate (2, 3). Embryos are dechorionated by dipping the strainer in 100% bleach for 1 min (4). The chorion is removed in the bleach (outermost layer, shown as a black line in 2). Dechorionated embryos are thoroughly washed using distilled water (5). They are aligned in 2 chamber coverslip dishes (6), and 2 mL of PBS is added to the dish (6). The dish is placed in the incubation chamber on an inverted confocal microscope (7) and imaged using an oil (golden droplet) immersion lens (7). (C). PA in the desired ROI (red) is performed using the 405 nm laser (C1), and images are acquired using the 488 nm laser for excitation and a bandpass filter containing 520 nm for the emission (C2). (D) Screenshot of Carl Zeiss Zen Image Acquisition software associated with Zeiss LSM confocal microscopes, showing an appropriate selection of settings for photoactivation (zoomed-in inset).",
    "Image acquisitionThe plasma membrane in Drosophila syncytial blastoderm embryos partially covers the nuclei on the apical side (Figure 2A). Mitochondria are asymmetrically distributed, with increased intensity in the basal regions of the syncytial blastoderm embryo (Figure 2A and 2B). Mitochondria are present around nuclei in optical sections across the nuclei (Figure 2B, 5 μm). Drosophila embryos in cellularization contain mitochondria enriched at the basal side during early stages (Figure 3A and 3B). Mitochondria are less intense in apical sections in early cellularization, but are present at a higher intensity in late stages (Figure 3B). In late stages, this increase in fluorescence suggests that mitochondria move to apical sections from basal regions during cellularization.Observe the embryos in bright light with the 63× objective, to discern the stage of the embryos. The anterior end of the embryos contains the micropyle. Search for embryos where the pole cells are visible at the posterior. Embryos in the syncytial blastoderm stage contain bulges in the apical regions, where nuclei are present.Even before PA, mitochondrial and background cytoplasmic fluorescence is visible using 488 nm excitation at 2% laser power and emission with a bandpass filter at 520 nm. Zoom into the image to obtain a 2× magnification (2× optical zoom) of 512 × 512 pixels (Figure 1A, 7) and set the software to obtain images with an average of 2 for each pixel (2 averaging). The background fluorescence can be further used to locate the syncytial regions where PA will be performed (Figure 2C and 2D).Select time series, photobleaching, and regions tabs in the software, which enables setting the parameters for time-lapse imaging and photobleaching (Figure 1D).Select the regions of interest (ROI) using a suitable line drawing tool, to mark a region where photoactivation is desired.",
    "In Figure 2C, the ROI is drawn with a segmented line and encompasses the region containing mitochondria in one nucleo-cytoplasmic domain on the apical side. In Figure 3C, the ROI is drawn with a rectangular line tool at the base of cells. The ROI size covers the basal region of approximately three cells.After marking the regions for PA, select the 405 nm laser at 100% power and 30 iterations for PA.Set the software to acquire 3 pre-PA images and post-PA images, using the 488 nm excitation laser at 2% power at 1 min intervals for 2 min in the syncytial division cycle, and 40 min in cellularization experiments (Figure 2C and 2D, Figure 3C and 3D, Video 1 and Video 2).Start the experiment and save the movie files to the computer. Save one image containing the details of the ROI drawn for PA as well, for further calculations.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Photoactivation experiment in the Drosophila syncytial embryo, to ascertain the extent of mitochondrial translocation between neighboring nuclear-cytoplasmic domains. Mitochondria are photoactivated in a red region, and the neighboring green region is quantified for fluorescence gain. The movie is shown in a 16-color look up table, where blue is the lowest fluorescence and red is the highest. Scale bar is 10 μm. <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Photoactivation experiment for cellularization in Drosophila embryos, to assess the translocation of mitochondria from basal to apical directions. Mitochondria are photoactivated in basal regions (red region) and fluorescence is monitored in apical regions (green region) over time. The movie is shown in a 16-color look up table, where blue is the lowest fluorescence and red is the highest. Scale bar is 10 μm.",
    "Notes:  Photoactivation with mito-PA-GFP containing embryos can also be carried out in dechorionated embryos, which are fixed embryos mounted in antifade on a slide with a coverslip. PA experiments on these fixed embryos enable a preliminary analysis of the photoactivation protocol in any tissue of interest. There should be no movement of fluorescence signal in fixed embryos. The PA ROI may move during the PA step if fast developmental processes are being investigated, activating an ROI larger than the one drawn. Minimal photobleaching of the PA-GFP fluorescence intensity was seen over the 60 min time duration of these experiments. The extent of photobleaching may increase for experiments carried out for longer than 60 min. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4347/bioprotoc-12-05-4347-g002.jpgFigure 2. Photoactivation experiment to ascertain the distribution of mitochondria across neighboring syncytial nuclear-cytoplasmic domains in Drosophila embryos.(A) The DIC image on the left shows the Drosophila embryo in the syncytial blastoderm embryo stage. The pole cells are visible at the posterior of the embryo. The schematic shows mitochondrial organization (green dots) in the syncytial blastoderm embryo. Nuclei (light blue) are present cortically near the outer surface and partially covered with an apical plasma membrane (brown). A, anterior, V ventral, D, dorsal, P, posterior. A sagittal view of two adjacent nuclear-cytoplasmic domains in the syncytial Drosophila embryo is on the right. The schematic in the middle shows the organization of nuclei at the periphery of the embryo in the syncytial blastoderm embryo. Mitochondria are enriched at the base in the syncytial division cycles (green) (Chowdhary et al., 2017). Scale bar is 50 μm. (B) Mitochondria labeled with mito-GFP are enriched at the base of nuclei labeled with histone-RFP. The depth for each image is indicated from the surface of the embryo. Scale bar is 5 μm. (C) The schematic shows the strategy for the photoactivation experiment.",
    "Mitochondria in one nuclear-cytoplasmic domain (red ROI) are highlighted by the 405 nm laser and fluorescence change is monitored in adjacent domains (green ROI). (D) Mitochondria in the red region in mito-PA-GFP containing embryos are highlighted by photoactivation with the 405 nm laser. Imaging is carried out by excitation with the 488 nm laser and emission at 520 nm for 2 min. The optical sections pre-PA, post-PA, and at 105 sec after PA are shown. The 16-color rainbow lookup table (blue is lowest and red is the highest) in ImageJ is used to show snapshots of the data. Scale bar is 10 μm.Image processingOpen the acquired raw images using ImageJ software. Import the images and the respective ROIs into ImageJ, using the Bio-Formats plugin (https://imagej.net/formats/bio-formats[href=https://imagej.net/formats/bio-formats]).Add the PA ROIs shown by the Bio-Formats plugin to the ROI manager in ImageJ. Manually add an ROI in the adjacent non-PA region, to compare the PA ROI in the experiment in Figure 2, to monitor fluorescence transfer between adjacent nuclear-cytoplasmic domains. Draw an ROI in the region above the PA ROI in the experiment in Figure 3, to monitor the transfer of fluorescence from basal regions of cells to apical regions during cellularization. Draw one ROI in the entire imaging field. Add all the manually drawn ROIs to the ROI manager.Depending upon the cell cycle stage at which PA is carried out, the syncytial domains may move due to embryo development. In such cases, the ROIs need to be manually re-drawn to estimate the fluorescence in the desired regions. In the case of cell movements in the lateral direction or stage drifts, adjust the ROIs before obtaining the mean, minimum, and maximum measurements.",
    "For the experiment in Figure 2C and 2D, obtain the mean and minimum (min) fluorescence intensities of all ROIs, by using the “Multi-measure” function of the ROI manager. Alternatively, obtain these values using the “Time series analyzer” plugin in ImageJ (https://imagej.nih.gov/ij/plugins/time-series.html[href=https://imagej.nih.gov/ij/plugins/time-series.html]). Obtain the mean, min, and background fluorescence intensities for the cellularization experiment in Figure 3. Obtain the background fluorescence intensity from the region outside the embryo in Figure 3C and 3D.Notes:  The ROIs need to be drawn manually for quantification in subsequent time frames, if the PA region moves away from the original location due to movement within the tissue or stage drifts. Photobleaching of the mito-PA-GFP fluorescence may occur during the acquisition phase of the experiment. To estimate the extent of photobleaching, photoactivate the entire imaging field and image this across the duration of the experiment, to estimate the change in PA-mito-GFP fluorescence over time. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4347/bioprotoc-12-05-4347-g003.jpgFigure 3. Photoactivation experiment to ascertain the movement of mitochondria from basal to apical regions during cellularization in Drosophila embryos. (A) The DIC image on the left shows the Drosophila embryo in the cellularization stage. Note the presence of a transparent cortical region in the image. The schematic in the middle shows the organization of cells at the periphery of the embryo at the end of cellularization. Nuclei (light blue in the schematic) present cortically are completely covered by the plasma membrane at the end of cellularization (brown). A, anterior, V ventral, D, dorsal, P, posterior. The sagittal view of two adjacent nuclear-cytoplasmic domains in cellularization is on the right. Mitochondria are enriched at the base in early stages (green) and in apical regions at late stages (Chowdhary et al., 2020). Scale bar is 50 μm.",
    "(B) Mitochondria labeled with mito-GFP are enriched at the base of nuclei labeled with histone-RFP in early stages of cellularization. The apical intensity of mito-GFP increases during cellularization. It is seen as increased GFP fluorescence in apical sections at late stages. The depth for each image is indicated from the surface of the embryo. Scale bar is 5 μm. (C) The schematic shows the strategy of the photoactivation experiment. Mitochondria in the basal region (red ROI) are highlighted on photoactivation by the 405 nm laser, and fluorescence change is monitored in apical regions (green ROI). The fluorescence will increase in apical regions if movement occurs. (D) Mitochondria in the red region in mito-PA-GFP containing embryos are highlighted by photoactivation with the 405 nm laser, and imaging is carried out by excitation with the 488 nm laser and emission at 520 nm for 30 min. The optical sections pre-activation, post-activation, and at 30 min after activation are shown. The orange ROI is used to compute the background fluorescence. The 16-color rainbow lookup table (blue is lowest and red is the highest) in ImageJ is used to show snapshots of the data. Scale bar is 10 μm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}