{
  "id": 3184,
  "origin_website": "Cell",
  "title": "Differential affinity purification and mass spectrometry analysis of two nuclear pore complex isoforms in yeast S. cerevisiae",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nHarvesting, making cryo-noodles, cryo-griding cells, and magnetic bead conjugation\nTiming: 4 days (Handling time: 1 h for step 1; 2 h for step 2; 2 h for step 3; 1 h for step 4; 2 h for step 5)\nOur cells are grown in large volumes of YPD to generate enough material to do multiple affinity purification experiments. We start with a small pre-culture from which we then inoculate the large- scale culture. Typically, 6 L of YPD harvested at 0.6 OD 600 nm produce ∼10 g of yeast powder. Our yeast strains typically have a doubling time of 90 min at 30°C.13[href=https://www.wicell.org#bib13]\nDay 1\nInoculate and grow culture\nTo start a liquid pre-culture in Yeast Extract-Peptone-Dextrose (YPD), inoculate one colony grown on selective solid media.\nGrow 10 mL of preculture during the day (∼8 h).\nInoculate the preculture to harvest the large culture at ∼0.6 OD 600 nm on Day 2. We typically let the culture grow overnight to harvest on day 2 after ∼12 h.\nDay 2\nHarvest culture and freeze cells\nOnce the culture reached the desired OD, spin down the culture at 4000 × g, for 10 min, at 4°C.\nWash and pool the cell pellets in 50 mL MilliQ water on ice and transfer the resuspended cells into two 50 mL-Falcon tubes.\nSpin cells down at 2600 × g, for 5 min, at 4°C and repeat this wash once.\nResuspend the pellet on ice with an equal volume of harvesting buffer.\nSpin down the cells at 2600 × g, for 15 min and make sure that you aspirate all the buffer from the pellet.",
    "To ensure that all the buffer is removed spin the pellet at 2600 × g for 5 min and remove any remaining buffer with a 1-mL pipette (at this point, the pellet should be fairly dry and resemble a thick paste).\nPlace a Falcon tube rack and some liquid nitrogen into a Styrofoam container, top it with aluminum foil, and place a 50 mL-Falcon tube through a hole in the foil into the rack. Allow the tube to cool down (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2757-Fig1.jpg\nFigure 1. Making cryo-noodles\nThe cell paste is injected directly in a 50 mL-Falcon tube containing liquid nitrogen which has been placed into a Styrofoam box filled with liquid nitrogen, using a large syringe. A rack can be placed inside the Styrofoam box first to hold the falcon tube upright. If the liquid nitrogen evaporates, the falcon tube can be refilled carefully using a ladle.\nFill the cooled 50 mL-falcon tube with liquid nitrogen to the very top.\nWith a spatula, scoop out the cell paste and place it into a 10 mL or 20 mL syringe. Press the cell paste through the syringe into the liquid nitrogen in the Falcon tube.\nOnce all the cell paste has been transferred into the Falcon tube, decant the liquid nitrogen from the tube (you can pour off the liquid nitrogen by poking holes into the cap of the Falcon tube).\nDo not tighten the Falcon tube completely, to allow liquid nitrogen vapors to escape.\nStore the tubes at −80°C. The protocol can be stopped at this point. Noodles can be kept at −80°C for at least two years.\nCryo-lysis of cells.",
    "Note: For this specific step, we wear cryo-gloves and safety goggles as the cryogrinding requires handling a relatively large amount of liquid nitrogen (∼5 L for grinding of one strain). For 20–50 mL of frozen cell pellet noodles, we use a 125 mL stainless-steel jar and 12 × 20 mm stainless-steel balls. For less than 15 mL of noodles, we use a 50 mL stainless-steel jar and 4 × 20 mm stainless-steel balls.13[href=https://www.wicell.org#bib13]\nFill a rectangular ice bucket with liquid nitrogen and pre-chill the stainless-steel grinding jar, the stainless-steel lid, the grinding balls, and the tube containing the frozen yeast noodles in the liquid nitrogen (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2757-Fig2.jpg\nFigure 2. Grinding the noodles\n(A) The pre-chilled grinding jar, lid, and the grinding balls and the noodles are placed into the jar.\n(B) After the elapsed grinding cycles, the grinding balls are removed from the jar using large tweezers.\n(C) The dense powder ring along the inside walls of the jar is broken up using a prechilled metal spatula (C).\n(D) Finally, the powder is transferred into a pre-chilled 50 mL-Falcon tube placed inside a Styrofoam box filled with liquid nitrogen (D).\nThe pre-cooling step is finished when the liquid nitrogen has stopped bubbling vigorously.\nOnce everything is chilled, pour the noodles into the grinding jar.\nWeigh the grinding jar with the noodles and then adjust the counterbalance weight on the ball mill (we use a planetary ball mill from Retsch, model PM 100).\nWith a 125 mL-grinding jar, we use 7–11 × 20 mm stainless steel grinding balls, and the number of grinding balls should be adjusted based on the amount of noodles:\n75–50 mL of noodles require 7–9 grinding balls.\n25–50 mL of noodles requires 9–11 grinding balls.\n15–25 mL of noodles requires 11 grinding balls.",
    "For <15 mL of noodles, use a 50 mL-grinding jar with 3 grinding balls.\nNote: Grinding with a 50 mL jar and 20 mm stainless balls does not allow grinding less than 2 mL of noodles. For smaller volumes of frozen cell pellets, the cell lysis is done in microcentrifuge tubes by sonication.14[href=https://www.wicell.org#bib17]\nCritical: Make sure that there is no liquid nitrogen left in the grinding jar before starting your cell grinding.\nGrinding is performed in eight cycles; each cycle is set in the following manner:\n125 mL-jar: 400 RPM; 3 min; 1 min reverse rotation with no breaks between rotations.\n50 mL jar: 500 rpm; 3 min; 1 min reverse rotation with no breaks between rotations.\nNote: During the grinding, you must hear the balls rattling around in the jar; if the rattling stops, see troubleshooting, problem 1[href=https://www.wicell.org#sec6.1].\nBetween each cycle, the jar is removed and cooled in liquid nitrogen for 5 min.\nNote: To ensure the lid is chilled we use an empty Falcon tube to pour liquid nitrogen over the top of the grinding jar. The jar should not be opened or submerged during this time.\nWhen eight cycles have been completed, remove the powder with a pre-chilled spatula – if some powder is stuck to the side of the jar, we repeat 1 grinding cycle at 350 rpm, 2 min, 1 min reverse rotation no breaks between rotations (See troubleshooting, problem 1[href=https://www.wicell.org#sec6.1]).\nTransfer the ground cell powder to a 50 mL-Falcon tube and clean jar and grinding balls with warm water and Windex™ solution, then dry them in a 30°C incubator.\nThe yeast powder should be stored at −80°C.\nNote: This is a STOPPING point, and the powder can be stored for at least two years.\nDay 3\nConjugation of magnetic beads with antibodies.",
    "Note: For the differential affinity purification, we conjugated our magnetic beads with commercial IgG or with GFP nanobodies expressed and purified in our lab following the protocol detailed here.15[href=https://www.wicell.org#bib14] Once the beads are conjugated with IgG or GFP nanobodies, they last ∼1 month when stored at 4°C.\nResuspend the entire vial of Dynabeads (300 mg beads) in 16 mL of 0.1 M NaPO4 buffer, pH 7.4.\nVortex the bottle for 30 s.\nTo make handling easier, we divide the bead suspension into four 15 mL-Falcon tubes (4 mL of suspension in each tube).\nNote: The number of tubes will vary based on the number of samples and conditions being tested. Wash any remaining beads in the glass vial with an additional 2 mL of 0.1 M NaPO4 buffer and divide the 2 mL equally between the four Falcon tubes.\nShake the bead suspension slowly for 10 min at room temperature on a Nutator or rocking platform.\nWhile the bead suspension is on Nutator, prepare the antibody mix by adding the solutions to a 50 mL-Falcon tube, in this specific order:\n40 mg of IgG or nanobody (2 mL), previously aliquoted in MilliQ water at a concentration of 20 μg/μL and stored at −80°C.\n9.850 mL 0.1 M NaPO4 buffer.\nSlowly, while gently shaking the tube, add 6.65 mL of 3 M Ammonium Sulfate.\nFilter the solution using a .22 μm Millex GP filter.\nPlace the Falcon tubes with the bead suspension onto a magnetic holder and wait until all beads are attached to the magnetic rack. Once the bead solution becomes clear, aspirate the buffer (be careful to not aspirate off the beads).\nWash again with 4 mL of 0.1 M NaPO4.\nVortex for 15 s, put on the magnet, and aspirate off the buffer.",
    "Add 5 mL of antibody mix to each tube and vortex for 15 s.\nWrap the tops of each Falcon tube with parafilm and place on a rotating wheel at 30°C overnight (incubation should be done for at least 18 h and should not exceed 24 h).\nDay 4\nWashing of conjugated beads\nNote: We do all washes described below in 15 mL-Falcon tubes and we aspirate the supernatant using a vacuum aspirator while the tubes are on a magnetic rack.\nWash once with 3 mL of 100 mM Glycine HCl pH 2.5. Put the solution on, resuspend the beads quickly and take the solution off as fast as possible.\nWash once with 3 mL of 10 mM Tris pH 8.8.\nWash once with 3 mL of 100 mM Triethylamine (make a fresh solution of 100 mM Triethylamine by adding 168 μL stock to 11.156 mL of MilliQ water). Put the solution on and take it off as fast as possible.\nWash the coated beads by adding 1× PBS to the beads and placing on a rocker/nutator for 5 min – repeat this wash 4 times.\nWash once with PBS + 0.5% Triton X-100 for 5 min.\nWash again with PBS + 0.5% Triton X-100 for 15 min on rocker/nutator.\nFinally, resuspend all beads in a total of 2 mL of 1× PBS + 0.02% Sodium Azide.\nStore the conjugated beads at 4°C. Conjugated beads can be kept at 4°C for three months.\nDifferential affinity purification of NPC isoforms\nTiming: 2 days (handling time: 30 min for step 6; 2 h for steps 7 and 8, overnight for step 9; 30 min for step 10)",
    "To purify nuclear pore complexes, we typically use a ratio of 50 μL beads per 1 g of cell powder and carry out the binding in 9 mL of extraction (TBT) buffer. However, depending on the abundance of the bait protein and the affinity of the antibody, this ratio can be adjusted, and the efficiency of the affinity purification (AP) monitored with Western blot and/or silver staining. As an indication, for an abundance of 3000 molecules/cell, we use 2 g of yeast powder, for an abundancy of less than 1000 molecules/cell we use 5–7 g of powder; everything that is more abundant than 5000 molecules/cell we generally use 0.5–1 g.13[href=https://www.wicell.org#bib13] If you need to use a lot of powder (e.g., 3 g and more) you can split the powder between two tubes to do the AP then pool the beads by combining them after the binding step during the first wash.\nNote: We generally control for the specificity of our affinity purification by western blot, silver staining, or directly by mass spectrometry, comparing our samples against negative or background controls. To obtain these controls, we simply incubate and wash our beads as described above with an identical ratio of untagged cell extract. Alternatively, a cell extract can be used that expresses the epitope tag alone from a promoter. This allows the identification of non-specific binding (proteins cross-reacting with the antibody or epitope tag or sticking to the beads) in our sample.\nDay 1",
    "Optional: We generally test the efficiency of our affinity purification on non-crosslinked samples in parallel. To do so, we include one sample that is not treated with glutaraldehyde and does not undergo the crosslinking steps 6f. and 6g. We then take samples for SDS-PAGE followed by western blot analysis and/or silver- staining throughout the procedure. For analysis of these samples (Figure 3[href=https://www.wicell.org#fig3]).\nPreparation of resin and stabilization of dynamic complexes\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2757-Fig3.jpg\nFigure 3. Differential affinity purification\n(A) In the strain used for the differential affinity purification, Mlp1 is tagged C-terminally with a PrA and Nup133 is C-terminally tagged with GFP.\n(B) Mlp1-PrA associated complexes are purified via IgG- conjugated beads, followed by the isolation of Nup133-GFP associated complexes via GFP-nanobodies from the flow-through allowing for the separation of basket-containing and basket-less NPCs from the same sample.\n(C) In (C), a silver-stained gel is shown on which 10% of a differential affinity purification using 1 g of cell powder has been separated (see more on ratio beads/powder in the differential affinity purification section above). While Mlp1-PrA is identified in the basket-containing AP (AP-A), no bands corresponding to Mlp1-PrA can be identified in the basket-less (i.e., Nup133-GFP) AP (AP-B), suggesting a high degree of depletion of the basket-containing NPCs and Mlp1 in the first round of AP. However, as expected, a band corresponding to Nup133 as well as other nucleoporins and associated factors can be identified in both AP samples.\nPre-wash your IgG- and GFP- nanobody conjugated Dynabeads three times with 5 mL of extraction buffer by pipetting up and down and divide them up into 15 mL-Falcon tubes. Keep the beads at 4°C until you reach the binding steps.",
    "Weigh the yeast powder into a 50 mL-Falcon tube pre-cooled in liquid nitrogen. On ice, let cell powder thaw very slightly to look like soft ice cream.\nAdd 9 mL of room temperature extraction buffer per 1 g of cell powder and vortex for 30 s.\nPolytron for 30 s with a hand polytron homogenizer (7-mm probe)\nNote: A different type of homogenizer could be used here, however, we recommend the use of a similar probe as it could otherwise result in greater dispersion of cell material or breaking of complexes.\nSpin at 2600 × g for 10 min and transfer the supernatant to a fresh tube.\nAdd 10 mM glutaraldehyde for 5 min and gently agitate on ice on a rocker/nutator.16[href=https://www.wicell.org#bib15]\nQuench the reaction by adding 1 mL of Tris buffer 1 M, pH 8, to a final concentration of 100 mM.\nFirst affinity-purification of Mlp1-PrA complexes, including basket-containing NPCs (IgG AP)\nPour the supernatant from step 6g onto the magnetic beads - the binding time starts at this point.\nPlace the tubes on a rotating wheel and incubate for 30 min at 4°C.\nAfter 30 min, immediately place the tubes on a magnetic rack until the solution is clear.\nCritical: take off the supernatant very carefully using a pipette and transfer to a fresh 15 mL-Falcon tube. Do not aspirate the supernatant or the IgG beads, which should remain in the tube on the magnetic rack!\nAdd 1 mL extraction buffer to the IgG beads and keep them on ice. Label this sample “IgG AP”.\nSecond affinity purification of Nup133 (basket-less) NPC complexes (GFP AP)\nAdd the anti-GFP-conjugated beads to the supernatant from step 7c in the 15 mL-Falcon tubes, place the tubes on a rotating wheel and incubate for 30 min at 4°C.",
    "While the GFP AP is incubating for the isolation of Nup133, resuspend the IgG beads in the 1 mL extraction buffer, mix by pipetting (never vortex at this point), and transfer to a microcentrifuge tube on a magnet.\nWash the IgG AP beads three more times with 1 mL of extraction buffer by pipetting up and down, then place the tube on a magnetic rack and aspirate off the supernatant each time.\nWash the IgG AP beads with 1 mL of Last Wash buffer for 5 min on a nutator/rotator.\nPlace the tube on a magnetic bar and keep them on ice while you are proceeding to the washes of the second affinity purification.\nOnce the second incubation with anti-GFP-conjugated beads (GFP AP) is completed, place the tubes on a magnetic rack until the solution is clear.\nMove the GFP AP supernatant to a tube on ice for further processing for SDS PAGE analysis if needed.\nWash the GFP AP beads three more times with 1 mL of extraction buffer by pipetting up and down, then place the tube on a magnetic rack and aspirate off the supernatant each time.\nWash the GFP AP beads with 1 mL of Last Wash buffer for 5 min on a nutator/rotator.\nPlace the tube on a magnetic bar.\nOptional: If samples to test the efficiency of the affinity purification have been included, take 10% of each IgG and GFP AP samples for a Western blot or silver staining and resuspend in 20 μL 1× Laemmli buffer.\nTo prepare your samples for mass spectrometry analysis, wash all your samples/resin four more times in the Last Wash buffer without Tween:\nthree short washes,\none 5-min wash\nCritical: As Tween could damage the mass spectrometry instrument, we want to remove it at this point.",
    "After the last wash, add 50 μL of 20 mM Tris-HCl, pH 8.0 to each tube and resuspend the resin.\nTrypsin digestion of samples\nThe proteins are digested on beads at 37°C using 1 μg of trypsin and incubating for 16 h (our trypsin stock is kept at −80°C and resuspended at 500 ng/μL in 20 mM Tris-HCl).\nDay 2\nTrypsin digest continued and collection of peptides\nThe digestion is quenched by the addition of 2 μL of 50% formic acid.\nAt this step, we recommend injecting the samples for a mass spectrometry analysis as soon as possible, waiting no longer than a few days.\nPeptides are stored at −80°C in 20 mM Tris-HCl for short periods of time or can be lyophilized in a speed vacuum centrifuge or by other method and stored at −80°C if the injection for the mass spectrometry analysis has to be delayed for more than a few days.\nSDS PAGE analysis of samples and silver-staining\nTiming: 1–2 days (handling time: 2 h for step 11; 2 h 30 minutes for step 12)",
    "We generally test the efficiency of affinity purification by western blot or silver-staining on non- crosslinked samples. The silver staining provides a good indication of the AP efficiency as it shows the bait as well as the proteins co-affinity purified (Figure 3[href=https://www.wicell.org#fig3]C and 4[href=https://www.wicell.org#fig4]) and can therefore be a good approach to test different salt concentrations (See troubleshooting, problem 2[href=https://www.wicell.org#sec6.3]). The amount of material loaded on a gel depends on the quantity of powder used in your sample input as well as the cellular abundance of the complex of interest. Both Mlp1 and Nup133 are believed to have an abundance of >2000 molecules/cells and we loaded 10% of the sample on gel starting from 1 g of powder for affinity purifications of both Mlp1-PrA and Nup133-GFP.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2757-Fig4.jpg\nFigure 4. Silver staining overview\n(A) The gel is removed from its cast and the upper part of the gel is cut.\n(B) The first part of the silver staining protocol (B) consists of four main steps carried out on a shaking platform: fixation, re- hydration, sensitizing, and staining, separated by washes.\n(C) The developing step has to be monitored carefully on the shaking platform and stopped as soon as the desired bands appear.\n(D) Over-developed gels appear yellow/brown and individual bands, which can turn silver- black in coloring, become harder to distinguish. On a correctly developed gel, the co-affinity purified bait and prey proteins are easily distinguishable.\n(E) In the example shown in (E), AP-A is a basket- containing NPC AP using Mlp1-PrA as bait; AP-B is a basket-less NPC AP using Nup133-PrA as bait; and AP-C is an AP of both types of NPCs using Nup133-GFP as bait.\nDay 1",
    "Note: We use here pre-cast 4–12% gels and MES buffer to improve the protein resolution all along the gel regardless of the protein sizes. However here, homemade polyacrylamide gels run with classical electrophoresis buffers (e.g., Tris-Glycine-SDS buffer) can also be used.\nSDS PAGE analysis of samples.\nTake 10% of the beads after the last wash of the affinity purification (from step 8g, above).\nResuspend the beads in 20 μL of Laemmli buffer.\nBoil the beads at 70°C for 5 min to elute the complexes from the beads.\nAfter the elution step, place the tubes on a magnetic rack and place the supernatant in a new tube (samples can be kept at −20°C).\nPrepare the NuPAGE Bis-Tris 4%–12% gel and fill the electrophoresis chamber with 1× MES buffer.\nNote: We are using NuPage 4–12% Bis-Tris gradient gels which provider publication-grade images. For these gels, we recommend using MES over MOPS buffer (the two system-compatible buffers) as MES provides a better separation across a wide range of molecular weight. Samples can be separated on any other gel system.\nAdd 1 mL of NuPAGE antioxidant directly into the running buffer (use 1 mL of antioxidant for 600 mL of 1× MES buffer).\nKeep the samples on a magnetic rack to make sure that no beads will be loaded in the wells and load 15 μL of the samples.\nRun the gels for 35 min at 200 V.\nSilver staining the gel (Figure 4[href=https://www.wicell.org#fig4]).\nCarefully remove the gel from the cast.\nWash the gel quickly with MilliQ water in a clean glass dish.\nFix the gel in the fixing solution for 1 h to overnight on a rocker platform.\nWash twice for 10 min with 200 mL of 20% ethanol.\nRehydrate twice for 10 min with MilliQ water.",
    "Incubate for 30 min with 400 mL of reduction solution.\nWash twice for 10 min with 200 mL of 20% ethanol.\nIncubate for 30 min with the silver nitrate solution.\nWash for 30 s with MilliQ water.\nIncubate the gel with the developing solution and wait until desired darkness of bands is achieved.\nStop the reaction by adding 10 mL of stop solution for 5 min and scan the gel.\nThe gel can be stored at 4°C in liquid (e.g., MilliQ water)\nMass spectrometry analysis\nTiming: 3–4 days, not including follow-up and validation experiments\nAfter affinity purification and trypsin digestion, peptides were cleaned using C18 ZipTips following the supplier’s recommendations. Because our samples are relatively complex and are generated from the digestion of numerous proteins at very different abundances, each sample was injected near signal saturation to be able to detect even low abundant peptides. Information about the liquid chromatography method, as well as the settings and references of the MS instrument, are detailed in Bensidoun et al., 2022.1[href=https://www.wicell.org#bib1] We inject each sample near the saturation of the signal. We also inject a blank between each sample to limit carry-over between samples (see troubleshooting, problem 3[href=https://www.wicell.org#sec6.5] and Figure 5[href=https://www.wicell.org#fig5]). For protein identification, we used Proteome Discoverer to generate the peak list. Protein database searching was performed with Mascot 2.5 (Matrix Science) against the NCBI - S. cerevisiae protein database (20160802).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2757-Fig5.jpg\nFigure 5. Scaffold data overview\n(A) The protein threshold is set to 95%, giving a false discovery rate (FDR) of 6%.\n(B) The display option is set to ‘Exclusive Spectrum Counts’.\n(C) Scaffold™ data can be exported into Excel for further analysis.\n(D) Scaffold™ has different options allowing to view peptide coverage (in yellow) alongside the identified proteins (here, Mlp1).",
    "(E) Scaffold™ has also different tools that allow to do a quick search for GO term enrichment and to compare the quantities of factors differentially identified in each sample (Venn diagram).\nDay 1\nAnalysis of mass spectrometry data\nSet the protein and peptide identification thresholds in Scaffold™ to 95%. This results in a decoy false discovery rate (FDR) of 6% (Figure 5[href=https://www.wicell.org#fig5]A; the FDR can be set between 1%–6% depending on the sample and coverage).\nNote: Figure 5[href=https://www.wicell.org#fig5] shows the first ten proteins in our scaffold file for basket-containing and basket-less NPC APs. As suggested by the differential AP validation tests (silver staining in Figure 3[href=https://www.wicell.org#fig3]C), basket proteins are identified specifically in basket-containing pores APs (in triplicate), while other nucleoporins are identified in similar ratios in both APs.\nUsing the Scaffold™ menu, select ‘Exclusive Spectrum Counts’ to analyze the data (Figure 5[href=https://www.wicell.org#fig5]B).\nExtract the data from Scaffold™ as shown in (Figure 5[href=https://www.wicell.org#fig5]C) and export it as an Excel file.\nAverage non-specific interactors identified in a non-tagged and/or epitope-tag-only-expressing cellular extract (as described in the introductory note of the “Differential affinity purification of NPC isoforms” section). This represents the background.\nSubtract the background exclusive spectrum count values for each protein from the actual protein value measured in the bait sample affinity purification.\nFor semi-quantitative analyses across samples, retain only the proteins with an Exclusive Spectral Counts (ESC) value ≥ 10 (See troubleshooting, problem 2[href=https://www.wicell.org#sec6.3], problem 3[href=https://www.wicell.org#sec6.5]).\nNormalize values against the average values of proteins associated with the bait proteins in the different APs:\nMlp2 for Mlp1-PrA\nY-complex nucleoporins (Nup84, Nup85, Nup120, and Nup145C)11[href=https://www.wicell.org#bib11] for Nup133-GFP\nNote: See troubleshooting, problem 4[href=https://www.wicell.org#sec6.7].",
    "Note: This allows normalization of the data sets against proteins of similar size, stoichiometry, and segregation behavior. Curating mass spectrometry data is very specific to the purified complex and different cut-offs, FDRs, normalization strategies, and possibilities to represent the data can be applied depending on the experimental design and objectives. However, some online tools such as CRAPome2.0 have been developed to facilitate and standardize the background identification in the proteomics field."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Mass Spectrometry",
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}