{
  "id": 11023,
  "origin_website": "Jove",
  "title": "Oscillation and Reaction Board Techniques for Estimating Inertial Properties of a Below-knee Prosthesis",
  "procedures": [
    "Participants\nSix unilateral, transtibial amputees (5 males; 1 female; age = 46 ±16 years, mass = 104.7 ±9.7 kg, height = 1.75 ±0.08 m) participated in this study. Five of six amputees had amputations due to traumatic injuries with the other due to congenital bone disease. All amputees used a lock and pin type suspension system for the prosthetic socket interface and a dynamic elastic response prosthetic foot (3 College Park, 2 Flex-foot, and 1 Genesis II). Participant recruitment focused on amputees who were fully ambulatory, had used a lower limb prosthesis for at least one year, and maintained some degree of physical activity either in their vocational or daily activities. The protocol was approved by the university's Institutional Review Board, and informed consent was obtained from each participant prior to participation.\nOverground Walking Trials\nEach participant's preferred walking speed was determined as the participant walked along a 20 m walkway using a comfortable speed as if walking from their car to the entrance of a store. A photocell-based timing system was used to quantify the time required to traverse approximately a 5 m section in the middle of the walkway. Preferred walking speed was quantified as the mean of five trials. Each participant then completed five successful overground walking trials while ground reaction forces from two force plates (480 Hz) and motion (60 Hz) data from a six-camera motion analysis system were collected. Successful trials were those within ±3% of the participant's preferred speed and there was no visible indication of adjusting the stride to contact the force platform. Retroreflective markers were placed bilaterally on the greater trochanter, lateral femoral condyle, lateral malleolus, lateral aspect of the heel, and the head of the fifth metatarsal prior to data collection.",
    "A three-segment (thigh, shank, and foot) sagittal plane inverse dynamics model was used to estimate resultant joint forces and moments at the hip, knee, and ankle. Segment inertial properties for intact body segments were estimated based on regression equations from de Leva8. Inertial properties of the prosthesis and residual limb were measured directly and distributed between the prosthetic shank and foot (see step by step protocol below). A single factor MANOVA with repeated measures was used to determine the effect of prosthesis inertia estimates, either direct measures or using estimates of the intact segment, on peak resultant joint forces and moments during stance and swing. Given that resultant joint reaction force and moment profiles were similar among all participants, an algorithm was written in MATLAB (Mathworks, Natick, MA) to focus on specific windows within the gait cycle to identify each of the individual peak quantities (See % gait cycle in Table 2). A Bonferroni adjustment to the confidence intervals was made based on the number of dependent variables. Significance differences were considered at p < 0.05.\nDescription of the Oscillation and Reaction Board Systems",
    "The Oscillation system used to measure the inertial properties of a prosthesis includes an outer cage or support structure made of 80/20 aluminum, an inner aluminum cage that is adjustable, and an infrared photocell (see Figure 1A). The inner cage is suspended from the outer cage with an axle that passes through two low friction press-fit bearings. To accommodate different sized prostheses the inner cage can be shortened or lengthen by approximately 15 cm (or 6 inches). In addition, the inner cage also has two adjustable plates that are used to ensure a secure fit of the prosthesis within the cage. A plate with a set screw is used to ensure that oscillations of the inner cage have less than 5° of amplitude so that estimations can be based on equations of simple harmonic motion. The photocell is wired directly to a counter on a data acquisition card in the computer to record each TTL pulse as the cage passes in front of the photocell. A LabView Virtual Instrument (VI) program is used to collect and process the TTL pulses. The inner cage of the oscillation system (Figure 1A) is used as the reaction board system (Figure 2) in combination with a scale with range up to 10 kg and sensitivity to the nearest 1 gram and two knife edges used to support the inner cage during the reaction board measurements. The technique for quantifying the inertial properties of a below-knee prosthesis involves three main steps: 1) Oscillation and Reaction Board Protocol, 2) Mathematical Equations for Estimating Prosthesis Inertia, and 3) Distributing Prosthesis Inertia into Foot and Shank Segments.\nimgsrc://cloudfront.jove.com/files/ftp_upload/50977/50977fig1highres.jpg",
    "Figure 1. A) Image of the oscillation rack used for measuring the period of oscillation. Notice that there is an outer support structure that remains stationary as the inner cage, in which the prosthesis is fixed, oscillates back and forth in front of a photocell used for timing. B) Close-up view of the oscillation axis that also shows the set screw used to set oscillation amplitudes to less than 5°. C) Close-up view of the photocell and distal end of the inner cage to illustrate the adjustable end plates. Note that to reduce the weight of the inner cage we used thin aluminum and removed any excess aluminum without sacrificing the strength of the structure.\nimgsrc://cloudfront.jove.com/files/ftp_upload/50977/50977fig2highres.jpg\nFigure 2. Reaction board schematic of the adjustable aluminum frame (i.e., inner cage) removed from the outer support structure of the oscillation system illustrating the reaction board setup used for estimating the system's center of mass. Note that two axes (a.k.a, knife edges) are used to support the inner cage; one at the left (distal) edge of the cage and the other (proximal) positioned over the top of the scale. The distance between these two supporting axes represents the length of the reaction board. The oscillation axis is coming out of the page.\n1. Inertial Measurement Protocol\nInitially, have the amputee sit in a chair where the prosthetic leg can be comfortably lifted off the seat so that the person can perform a series of knee flexion and extension actions as the knee center of rotation (COR) is identified.\nOnce the knee COR is identified (it may be helpful to place a small piece of tape at the COR), have the amputee stand and measure the following.",
    "Measure the distance from the top (lip) of the prosthesis to the knee COR; if the knee COR sits inferior to the lip of the prosthesis this value should be recorded as a negative value.\nMeasure the distance between the knee COR and the ankle COR. The ankle COR is assumed to be in a similar location as that of the intact ankle.\nWith the prosthesis and underlying sleeve removed, take several measurements of the residual limb using a flexible tape measure. Use these measurements to estimate the inertial properties of the residual limb based on modeling the residual limb as the frustum of a right circular cone6,21 and assuming a uniform tissue density of 1.1 g∙cm-3 13.\n\t\nMeasure the proximal circumference of the residual limb. This circumference should be measured as the largest circumference close to the knee joint (e.g., usually approximately two finger widths from the knee joint).\nMeasure the distal circumference of the residual limb. This circumference should be measured at the last bony prominence on the distal end of the residual limb.\nMeasure the length of the residual limb as the distance from the fibular head to most distal aspect of the residual limb.\nRemove the inner cage from the oscillation rack by removing the axle. Put the amputee's liner and any ply the amputee is currently using within the socket of the prosthesis. Then securely position the prosthesis with shoe still on within the inner oscillation cage (Figure 1). In this system, two adjustable plates slide horizontally and when tightened into position secure the top of the prosthesis within the cage. For the foot of the prosthesis use a Velcro strap to secure it on distal plate of the cage.",
    "Reposition the inner cage within the oscillation rack. Secure the axle and make sure the suspending arm of the inner cage aligns with the set screw that will set the angle of oscillation to less than 5°.\nCollect three oscillation trials with the prosthesis positioned in the inner cage. The period of oscillation will represent the time it takes to complete one full oscillation with the inner cage swinging under its own weight and influenced only by gravity. To begin an oscillation trial pull the inner cage back until it hits the set screw and then move it forward until space between the set screw and inner cage is visible. Record the average time for one complete cycle of oscillation for each trial.\nPrior to shifting to the reaction board measurements, measure and record the following dimensions of the inner cage with the prosthesis still fixed in the rack using digital calipers or a flexible measuring tape. These measures will be used if the inner cage configuration changes upon removing the prosthesis in Step 1.9 and also during estimations of the inertial properties of the system. These measurements are easier to take with the inner cage positioned horizontally and resting on the knife edges for the reaction board test.\n\t\nMeasure the distance between the top adjustable plate and the fixed cross-member at the top of the inner cage.\nMeasure the distance between the bottom adjustable plate and the fixed cross-member at the top of the inner cage.\nMeasure the distance between the bottom adjustable plate and the fixed cross-member at the bottom of the inner cage.\nMeasure the length of the reaction board; this is the distance between the locations of the two knife edges that will be used as supports during the reaction board test.",
    "Position the rack and prosthetic limb in the reaction board setup. Make sure the scale reads zero at this point. Place one end of the inner cage over the scale, and position the knife edge at the bottom of the inner cage so that there is no tension created between the two knife edges and the inner cage is level. Lift the scale-end several times and place it back down on the scale. Once a consistent reading from the scale is achieved, record this value.\nRemove the prosthesis from the inner cage. If the top and/or bottom plates had to be moved to remove the prosthesis, return the plates to their original position using the dimensions measured in Step 1.7. Once cage dimensions are what they were with the prosthesis in the cage, repeat Step 1.8 to record the reaction board reading for just the cage.\nRemove the shoe from the prosthetic limb and measure the mass of the shoe, followed by the mass of the prosthesis without the shoe.\nTake several measurements of the prosthesis.\n\t\nMeasure the distance between COR of ankle and the plantar surface of the foot.\nMeasure the length of prosthetic foot without the shoe.\nPlace the shoe back on the prosthesis and measure the distance from the ankle COR to sole of shoe and the length of the foot with the shoe on.",
    "Reposition the inner cage within the oscillation rack making sure that the black corner with reflective tape is closest to the photocell. Secure the axis and make sure the suspending arm of the inner cage aligns with the set screw that will set the angle of oscillation to less than 5°. Collect 10 oscillation trials, where this time only the first oscillation period of each trial will be recorded. Note: See Appendix A for explanation about why we use only the first oscillation period when the inner cage is oscillated by itself without the prosthesis.\n2. Mathematical Equations for Estimating Prosthesis Inertia\nAdjust body mass to account for the reduced mass of the prosthetic prior to estimating intact segment inertial properties using the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/50977/50977eq1.jpg (1)\n\twhere ABM is the adjusted body mass, MBM is the measured body mass while wearing the prosthesis, Mpros is the mass of the prosthesis, Mresidual is the mass of the residual limb (anatomical structures below the knee that remain after amputation), and c (0.057 for males; 0.061 for females) is percent of ABM accounted for by the intact shank and foot8.\nEstimate the inertial properties of the thigh, shank and foot of the intact leg and thigh of the prosthetic leg based on the ABM and their respective segment lengths8.\nThe prosthesis center of mass location is first expressed relative to the reference axis (Figure 2):\n\tCMpros_ax = (Lrxn * (Rpros + frame – Rframe)) / mpros  (2)\n\twhere Lrxn represents the distance between points of support, Rpros+frame represents the scale reading for the prosthesis and aluminum frame together, Rframe represents the scale reading for the frame only, and mpros represents the mass of the prosthesis.",
    "Based on the distance between oscillation and reference axes (Losc_ref) the center of mass location of the prosthesis is expressed relative to the oscillation axis:\n\tCMpros_osc = Losc_ref - CMpros_ax  (3)\n\tThis is needed in subsequent computations of the moment of inertia of the prosthesis relative to this oscillation axis.\nFinally, the center of mass location is expressed relative to the proximal end of the prosthetic socket based on the distance between the oscillation axis and the top adjustable end plate (d_plate):\n\tCMpros_prox = CMpros_osc – d_plate  (4)\nCompute the moment of inertia for each condition (cage alone and cage + prosthesis):\nimgsrc://cloudfront.jove.com/files/ftp_upload/50977/50977eq5.jpg (5)\n\twhere Iaxis is the moment of inertia relative to the oscillation axis, τ is the average period of one oscillation, m is the mass of the system, g is the acceleration due to gravity, and d is the distance between the oscillation axis and the center of mass of the system. The moment of inertia of the prosthesis relative to the oscillation axis is computed as the difference between Iaxis for the cage alone and Iaxis for the cage plus prosthesis. The parallel axis theorem is then used to express the moment of inertia of the prosthesis about a transverse axis through knee joint.\nCombine the inertial properties of the residual limb and prosthesis to determine the combined mass, center of mass position relative to the knee, and using the parallel axis theorem express the moment of inertia of the system about a transverse axis through the combined center of mass location.\n3. Distributing Prosthesis Inertia into Foot and Shank Segments",
    "To distribute the inertial properties of the prosthesis and residual limb into a foot (prosthetic foot only) and shank segment (prosthetic socket, pylon, and residual limb) for inverse dynamics modeling segment inertial properties were determined based on data from a dismantled prosthesis. The total mass of the dismantled prosthetic limb was 2.126 kg, with a socket mass (including pylon mass) of 1.406 kg and a foot mass of 0.72 kg. Thus, 66% of total prosthesis mass was apportioned to the prosthetic socket and 34% was apportioned to the foot. A sensitivity analysis was performed to determine what effect this had on the estimated moment of inertia of the prosthesis about the knee joint. This analysis was based on experimental measurements of the inertial properties of six below knee prostheses from Mattes et al.21 (data were obtained via personal communication with the authors). When the prosthetic shank and foot masses were determined based on de Leva8 (foot = 24%; shank = 76% of total prosthesis mass), the total moment of inertia of the prosthesis about the knee joint was underestimated by approximately 5% compared to the actual experimental value estimated using an oscillation technique. Using percentages based on the dismantled prosthesis for foot (34%) and shank (66%) masses, the total moment of inertia about the knee joint was overestimated by approximately 2% compared to the experimental measure.\nDistribute prosthesis mass between prosthetic foot (34%) and socket (66%) segments based on measurements of a dismantled prosthetic limb.",
    "COM location of the prosthetic foot was determined based on regression equations for an intact foot8. This step was based on the results of sensitivity analyses from Miller25 and Czerniecki et al24. Miller25 estimated resultant joint moments at the knee using: a) direct measurements of the prosthesis inertial properties, and b) using prosthesis inertial properties estimated from regressions equations for an intact shank and foot. The average difference between knee moment profiles for the two different methods and for two subjects was approximately 3 N·m. This average difference in magnitude amounted to less than 2% of the peak knee moment during stance. Czerniecki et al.24 dismantled multiple below-knee prostheses and balanced the prosthetic foot on a knife edge to determine its COM location. When they compared these results to estimates based on regression equations for an intact foot, they found that there was little difference between the two estimates.\nMOI of the prosthetic foot about a transverse axis though its COM is determined using de Leva's8 regressions for an intact foot and the estimated foot mass from Step 1. MOI of the foot is also expressed relative to the knee joint using the parallel axis theorem.\nimgsrc://cloudfront.jove.com/files/ftp_upload/50977/50977eq6.jpg (6)\nimgsrc://cloudfront.jove.com/files/ftp_upload/50977/50977eq7.jpg (7)\nCOM location of the prosthetic socket (CMpros_sock) was determined by combining an estimate of the COM position for the entire prosthesis (CMpros_limb; not including the residual limb inertial properties), obtained with a reaction board technique, and the assigned COM location of the prosthetic foot relative to the knee joint (CMpros_ft) from Step 3.2. The CMpros_sock was constrained to lie on a straight line between the knee and ankle and was determined as:\nimgsrc://cloudfront.jove.com/files/ftp_upload/50977/50977eq8.jpg (8)",
    "MOI of the prosthetic foot about an axis though the knee joint was subtracted from the experimental measurement for MOI of the entire prosthetic limb about the knee joint (Iknee_limb) to determine MOI of only the prosthetic socket about the knee joint (Iknee_sock). The parallel axis theorem was then applied to express MOI of the prosthetic socket about an axis through its COM (Icm_sock).\nimgsrc://cloudfront.jove.com/files/ftp_upload/50977/50977eq9.jpg (9)\nimgsrc://cloudfront.jove.com/files/ftp_upload/50977/50977eq10.jpg (10)\nThe inertial properties of the residual limb (anatomical structures remaining below the knee after amputation) were combined with the inertial properties of the prosthesis shank, which were used as the inertial properties of the shank segment on the prosthetic side in the inverse dynamics model.\nimgsrc://cloudfront.jove.com/files/ftp_upload/50977/50977eq11.jpg (11)\nimgsrc://cloudfront.jove.com/files/ftp_upload/50977/50977eq12.jpg (12)\nimgsrc://cloudfront.jove.com/files/ftp_upload/50977/50977eq13.jpg (13)\nimgsrc://cloudfront.jove.com/files/ftp_upload/50977/50977eq14.jpg (14)\nimgsrc://cloudfront.jove.com/files/ftp_upload/50977/50977body.jpg"
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}