{
  "id": 17084,
  "origin_website": "Jove",
  "title": "Ultrasound Scanning Protocol in the Assessment of Ulnar Neuropathy at the Elbow",
  "procedures": [
    "The protocol follows the guidelines of the Wake Forest School of Medicine Research and Ethics Committee, and informed written consent was obtained from patients before deidentifying and including the ultrasound images in this document.\n1. Patient positioning, knobology, and basic tools of assessment (Figure 1)\nPatient positioning\n\t\nAsk the patient to lie supine with the affected arm abducted and externally rotated at the shoulder and elbow flexed at 70째-90째(Figure 1A). For patients with shoulder pathology and limited range of motion, place a pillow under the patient's arm to limit the degree of external rotation at the shoulder.\nUltrasound set up\n\t\nTurn on the ultrasound machine and enter patient information.\nPress the button labeled Exam (Figure 2) on the keyboard of the ultrasound machine.\nUse the cursor to navigate the screen, click on Upper Extremity to choose the appropriate preset, and click on 12 Mhz Linear Transducer to choose the recommended probe.\nImage optimization\n\t\nApply a generous amount of ultrasound gel to the transducer and place the probe on the patient's arm.\nAttempt to visualize the ulnar nerve in the area of interest (see the next section for regional assessments).\nSet the initial depth between 2-3 cm using the depth knob (Figure 2). Adjust accordingly to optimize the visualization of the ulnar nerve.\nUse the focus knob (Figure 2) to ensure that the ulnar nerve is visualized within the focal zone at the top of the screen.\nUse the gain knob (Figure 2) to increase or decrease the brightness of the signal to optimize the visualization of the ulnar nerve.\nMeasuring the cross-sectional area and storing images\n\t\nPress the Freeze button (Figure 2) at the location of a suspected lesion as signified by an abrupt change in CSA or echotexture.",
    "Double-click the Measure button (Figure 2) to choose the cross-sectional area tool.\n\t\tNOTE: The cursor will appear as a small circle with a dot in the center after the double-click.\nDrag the cursor around the circumference of the nerve within the hyperechoic rim of the nerve and hit Enter when complete. Ensure that the measured CSA appears in the lower left-hand corner of the screen.\nPress the P1 button (Figure 2) to store the image.\nAssessing vascularity\n\t\nPress the Color button (Figure 2) to use the Doppler tool and move the box over the nerve.\nDocument the evidence of blood flow within the nerve by freezing the screen and saving the image.\nPress the Color button again to remove the Doppler tool.\nLong-axis visualization of the nerve\n\t\nWith the ulnar nerve centered on the screen in the area of interest, slowly turn the transducer 90째.\nLook for focal constrictions or fusiform enlargement in this view. Freeze the screen and store images in areas of interest.\n2. Regional assessment of the ulnar nerve throughout its course\nAssessment of the distal ulnar nerve segment (wrist to elbow)\n\t\nIdentify the ulnar nerve at the wrist where it lies immediately adjacent to the ulnar artery.\nFrom this location, follow the ulnar nerve proximally through the forearm, where it runs between the flexor carpi ulnaris and flexor digitorum profundus, and continue to the level of the medial epicondyle. Adjust the depth accordingly to keep the ulnar nerve in view.\nIdentify and document a description of any visually apparent changes in nerve echotexture or CSA in the wrist and forearm segment. Measure CSA, assess vascularity, and store images in any area of interest.\n\t\tNOTE: See the referenced articles for a discussion regarding the normal appearance of the ulnar nerve, including echotexture1,7.",
    "Identify and record a description of any identifiable structural abnormalities such as masses, foreign bodies, or scar tissue (see discussion for details). Store images of interest.\nVisualize the nerve in the long axis (see step 1.6) at any location of increased CSA, change in echotexture, or structural abnormality. Freeze the screen and store relevant images.\nDocument the specific location of any abnormalities by measuring the distance from a bony prominence such as the ulnar styloid (in the distal segment) or medial epicondyle (at the elbow or proximal segment) to the area of interest with a tape measurer.\nAssessment of the ulnar nerve at the elbow\n\t\nPlace the lateral end of the transducer at the medial epicondyle and the medial end of the transducer at the olecranon; the nerve runs directly between these landmarks at the retroepicondylar groove (Figure 1B).\n\t\tNOTE: The presence of these bony prominences requires a significant amount of gel to maintain the contact between the transducer and the patient skin.\nAdjust the gain, focus, and depth to obtain the optimal image of the nerve at this location.\nScan the entire segment of the ulnar nerve in the elbow, moving the transducer several centimeters in both a proximal (Figure 1B) and distal (Figure 1C) direction from the medial epicondyle while keeping the nerve centered.\n\t\tNOTE: The true cubital tunnel is the location immediately distal to the medial epicondyle as the ulnar nerve enters the forearm between the ulna, heads of the flexor carpi ulnaris, and humeroulnar aponeurotic arcade.\nVisually identify the maximal point of the enlargement of the nerve in this region and measure CSA. Ensure the transducer is directly perpendicular to the nerve when identifying the area of maximal enlargement, as tracing the nerve from an oblique angle can artificially increase the CSA.",
    "Repeat steps 1.3-1.6 in this region. When visualizing the ulnar nerve in the long axis at the elbow, reposition the elbow into an extension to capture the entire nerve segment of interest.\nDynamic assessment of the ulnar nerve at the elbow\n\t\nPlace the transducer in the position between the medial epicondyle and olecranon as described previously. Keep the transducer fixed at the medial epicondyle to keep the ulnar nerve in view.\nFlex the elbow (135째) while maintaining this transducer position and assess ulnar nerve mobility.\n\t\tNOTE: The olecranon often moves out of view during deep elbow flexion, and the distal aspect of the medial head of the triceps may come into view.\nRecord a video of the dynamic assessment but hitting the P1 button, which will then be recorded for 3 s from the time the button is pressed.\nDocument any evidence of subluxation (migration of the ulnar nerve over part of the medial epicondyle) or dislocation (complete migration of the ulnar nerve over the entire medial epicondyle).\nAssessment of the proximal ulnar nerve (elbow to axilla)\n\t\nFrom the medial epicondyle, scan the ulnar nerve proximally through the Arcade of Struthers and medial intermuscular septum of the arm up to the level of the axilla, where it lies adjacent to the axillary artery.\n\t\tNOTE: The ulnar nerve remains superficial in the proximal arm and is typically visualized just medial to the brachial artery in this segment.\nRepeat steps 1.3-1.6 in this region.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}