{
  "id": 9587,
  "origin_website": "Jove",
  "title": "Nerve Excitability Assessment in Chemotherapy-induced Neurotoxicity",
  "procedures": [
    "1. Patient Preparation\nPatients are referred from the Department of Medical Oncology for baseline nerve excitability testing prior to commencement on chemotherapy.\nPatient suitability for excitability testing must be determined. Patients should be excluded if they have a history of or baseline neurophysiological evidence of peripheral neuropathy, have received prior neurotoxic chemotherapy treatment or there are any contra-indications for excitability testing.\n2. Axonal Excitability Procedures\nUndertake sensory and motor excitability protocols on the median nerve, using the semi-automated computerized system QTracS (Institute of Neurology, Queen Square, UK), an isolated linear bipolar constant current stimulator (Digitimer, Welwyn Garden City, UK) and an amplifier (Sapphire IIA, Medelec, UK).\nPrepare the skin surface at the wrist and forearm with an abrasive gel or pad to reduce skin resistance, followed by application of an alcohol wipe.\nPrepare the recording site for motor recordings- with non-polarizable electrodes placed on the muscle belly of abductor pollicis brevis and a reference electrode 4cm distal to record compound motor action potentials (CMAPs).\nPrepare the recording site for sensory recordings - using ring electrodes placed at the proximal and distal interphalangeal joints for recording and reference electrodes respectively, to record compound sensory action potentials (CSAPs).\nPlace an electrosurgical neutral earth plate in the palm, with conductive gel.\nElectrical noise in the recording setup should be removed as much as possible, using a Humbug 50/60 Hz Noise eliminator (Quest Scientific Instruments, North Vancouver, Canada).\nStimulate the median nerve at the wrist. Stimulation site should be selected as the site of lowest threshold, using a repositionable bipolar electrode and subsequently a non-polarizable electrode.\nThe anode electrode should be placed 10 cm proximal from the stimulating electrode over bone.\nMonitor temperature at the site of stimulation throughout the test and ensure that the temperature is greater than 32 °C.",
    "3. Axonal Excitability Protocols\nRecord a stimulus-response curve by incrementally increasing the stimulus until the response is maximal and does not augment when stimulus intensity is further increased.\nThe target amplitude for threshold tracking is set automatically to 30%-40% of maximal amplitude, corresponding to the area of steepest slope on the stimulus-response curve.\nAs per the method of Bostock et al., 1998, changes in threshold current required to achieve the target amplitude are tracked online.\nRecord multiple excitability parameters, including threshold electrotonus (TE), recovery cycle (RC) and current-threshold (I/V) relationship as described in Kiernan et al., 2000 and Kiernan et al., 2001.\nThreshold electrotonus is assessed using 100ms subthreshold polarizing currents, with polarizing current set to ± 40% of control threshold (Fig. 1). The change in threshold current required to maintain target response amplitude following both de- and hyper-polarization is recorded. Threshold electrotonus provides an assessment of internodal conductances and membrane potential, with responses in the hyperpolarizing direction at the end of the polarizing pulse (90-100 ms) strongly associated with membrane potential.\nThe recovery cycle is assessed using a paired pulse paradigm (Fig. 2), with an initial supramaximal conditioning stimulus followed at different intervals by a test stimulus (from 2.5 ms to 200 ms). Following the supramaximal stimulus, it is more difficult to generate a subsequent response, termed 'refractoriness', reflecting the inactivation of voltage-gated Na+ channels. Following the refractory period, a period of facilitation known as superexcitability occurs.\nCurrent-threshold relationship is assessed using polarizing currents of 200 ms which vary in strength from +50% to -100% of threshold.\n4. Patient Assessment\nUsing these techniques, patients are assessed both acutely and longitudinally across chemotherapy treatment. To assess acute neurotoxicity, patients return for post-chemotherapy assessment within 48 hours of receiving treatment.",
    "To examine chronic neurotoxicity, assessments taken prior to chemotherapy infusion are compared longitudinally across treatment cycles.\nIn addition to axonal excitability testing, conventional clinical grading scales should be used to assess chemotherapy-induced neurotoxicity, including the National Cancer Institute - Common Criteria for Adverse Events Neuropathy Sensory Subscale, Total Neuropathy Score and patient-reported outcome assessment.\n5. Analysis and Interpretation\nTo identify acute neurotoxicity, results are compared pre- and post-chemotherapy treatment. To assess the development of longitudinal changes in nerve function, results are compared across treatment. Key parameters for assessment include refractoriness, superexcitability, extent of threshold change in threshold electrotonus (hyperpolarizing 90-100 ms), in addition to conventional parameters such as peak amplitude and latency.\nTo assess overall change in excitability parameters across treatment, a composite excitability score is calculated. The change in three parameters - superexcitability, refractoriness and threshold electrotonus (hyperpolarizing 90-100 ms) - is summed from initial to final treatments to give an overall marker of change.\n6. Representative Results\nExamples of excitability results in a patient treated with oxaliplatin are provided. Immediately post-oxaliplatin infusion, acute changes in both sensory and motor excitability develop, suggestive of the development of a functional Na+ channelopathy10 -13. However, significant change in multiple excitability parameters develops progressively across oxaliplatin treatment only in sensory axons, with motor axons unaffected (Fig. 3), reflecting widespread sensory axonal damage and membrane potential change. This pattern matches the clinical expression of symptoms in chronic oxaliplatin-induced neurotoxicity. Excitability changes in sensory axons precedes reductions in peak amplitude as assessed using conventional nerve conduction techniques, and suggest that axonal excitability techniques may provide a sensitive assessment tool for early oxaliplatin-induced neurotoxicity.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3439/3439fig1.jpg",
    "Figure 1.  Threshold electrotonus, depicting waveforms in response to prolonged subthreshold polarizing current (100 ms), with hyperpolarizing direction plotted in the bottom quadrant (blue) and depolarizing direction plotted in the upper quadrant (red). Below is the stimulus waveform applied to generate the threshold electrotonus response.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3439/3439fig2.jpg\nFigure 2.  Recovery cycle of excitability, demonstrating the characteristic sequence of excitability changes following impulse conduction, with a period of reduced excitability (refractoriness) up to 3 ms following a supramaximal stimulus, followed by a period of increased excitability (superexcitability) peaking at 5-7 ms and subsequently reduced excitability (subexcitability). The paired pulse paradigm stimulus protocol is inset.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3439/3439fig3.jpg\nFigure 3.  Excitability changes in sensory axons oxaliplatin-treated patients, with baseline recordings shown in black and post-treatment recordings shown in white, following 4-6 months of oxaliplatin treatment. These changes are thought to reflect widespread axonal damage and membrane potential change. A picture of the excitability set-up in the oncology setting is shown at left. Click here to view larger image[href=http://www.jove.com/files/ftp_upload/3439/3439fig3large.jpg]."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}