{
  "id": 19286,
  "origin_website": "Jove",
  "title": "Surgical Management of Meatal Stenosis with Meatoplasty",
  "procedures": [
    "Introduction:\nGenital disorders are commonly encountered in the offices of primary care physicians. Meatal stenosis, an abnormal narrowing of the urethral opening (meatus) is a common complication after circumcision occurring in 9%-10% of males.  This disorder is characterized by an upward deflected, difficult-to-aim urinary stream, dysuria, urgency, frequent, and prolonged urination.  If left untreated, this can lead to urinary tract infections and kidney problems.  Surgical meatotomy/meatoplasty is curative.\nTreatment/Diagnostics Procedure:\nA routine urine analysis will rule out urinary tract infection or diabetes as potential causes of urinary frequency.\nDetailed history and physical exam, include observation of micturition, confirm the diagnosis.\nOutpatient surgery/meatoplasty is curative. The procedure is done under a 5-10 minute anesthetic.\nIntraoperative preparation includes surgical loupe magnification, mosquito hemostat, fine tipped plastic microsurgical scissors, Castroviejo needle holder, and 7-0 vicryl suture;\nChild is placed in supine position.\nMinimal skin prep and drape of the genitalia. No prophylactic antibiotics needed.\n\t\nBetadine POVIDONE IODINE solution is used to scrub the genital region, and allowed to remain for approximately 3 minutes prior to initial incision.\nThe penis should be draped off with sterile towels.\nA right handed surgeon will stand to the left side of the patient and one jaw of a well-lubricated mosquito hemostat is then introduced into the tip/ventral aspect of the urethral meatus to a depth of approximately 2-3 mm. The ventral tissue is then crushed by closing the hemostat.  Total clamp time will be 60 seconds.\nThe crushed ventral tissue is incised sharply with microsurgical scissors (figure 1) and the inner urethral mucosa and glanular tissue are reapproximated using 7-0 vicryl sutures (Castroviejo needle holder figure 2) in an interrupted fashion.",
    "Recovery time is minimal, and a child is sent home with Tylenol as needed for discomfort. Vaseline is applied to the wound 3-4x/day.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}