{
  "id": 17281,
  "origin_website": "Jove",
  "title": "Neuronavigation and Laparoscopy Guided Ventriculoperitoneal Shunt Insertion for the Treatment of Hydrocephalus",
  "procedures": [
    "The following protocol follows the guidelines of the University of Calgary Conjoint Health Research Ethics Board. Informed media consent for the procedure was obtained and the patient provided written consent for this publication.\n1. Positioning and pre-procedure setup\nObtain a preoperative cranial MRI or computed tomography (CT) with the appropriate neuronavigation protocol.\nPlace the patient supine on a donut headrest with the head turned toward the contralateral side and place a shoulder roll to augment the exposure of the occipital region (Figure 3).\nUpload the patient's preoperative cranial MRI or CT, register it to the neuronavigation system, and complete the neuronavigation workstation planning.\nSelect an entry point and target for the proximal catheter and mark the specific entry location on the patient's scalp.\n\tNOTE: By standard, a right-sided posterior approach is preferred, unless precluded by the patient's circumstances. An ideal entry point is one with a trajectory that traverses minimal parenchyma while missing any identifiable vessels in its path to the body of the right lateral ventricle (Figure 3).\nMark an inverted u-shaped (horseshoe-shaped) incision to incorporate the entry point. Shave any hair surrounding the incision with a clipper (Figure 3).\nMark a 1 cm para-midline abdominal incision at the junction, immediately inferior and right lateral to the xiphisternum.\nInfiltrate the scalp incision with a local anesthetic.\nAdhere to a strict infection-prevention protocol (bundle) (Figure 4)38.\nPrepare the entire surgical field with a 2% chlorhexidine gluconate/70% isopropyl alcohol solution and allow it to dry for at least 3 min before starting the operative draping.\n\t​NOTE: Prior to operative draping, all scrubbed surgical staff must double glove, and must change their outer gloves for new ones after draping of the patient is completed.",
    "Drape the entire surgical field with an antimicrobial incise drape, which will help hold the drapes in place and reduce the surgical team's direct contact with the skin.\nApply a standard laparoscopic drape and extend the opening in a cranial direction to the edges of the draping to allow exposure of the cranium and chest surgical field.\n2. Cranial exposure\nUse a #15 scalpel to score the horseshoe-shaped incision.\nUse a fine-tip monopolar cautery to deepen the incision, making sure to preserve the periosteal layer.\nRetract the skin edges with a self-retaining retractor.\nMake a cruciate periosteal incision in the center of the wound to expose the skull using monopolar cautery.\nMake an approximately 2 cm burr hole in the center of the periosteal exposure, ensuring the underlying dura is preserved (Figure 5).\n3. Subcutaneous distal catheter placement\nMake a para-midline sub-xiphisternum incision down to the perifascial fat layer.\nBlunt dissect the subcutaneous tissue 2-3 cm in a cranial direction.\nCarefully guide a tunneling stylet with its encasing plastic sheath within the subcutaneous layer and pass it toward the cranial incision, taking every caution to stay above the ribs and clavicle, and avoid piercing the skin.\nOnce the inferior aspect of the cranial incision is pierced by the tunneller, withdraw the stylet, leaving the plastic sheath in place (Figure 5).\nCreate a subgaleal pocket at the inferior edge of the cranial incision around the plastic sheath that is sizable enough to bury the shunt reservoir using monopolar cautery and blunt dissection with Kelly forceps.\nRemove the distal catheter from the sterile packaging and place it in sterile saline.\nThread the distal catheter through the plastic sheath from cranial to caudal direction, minimizing contact of the shunt components with the drapes, and then remove the plastic sheath.",
    "Prime the system with sterile saline solution to remove any air.\nValve attachment\n\t\nIf a programmable shunt valve is used, program it to the desired setting before it is removed from the packaging. Remove the VP shunt valve and distal catheters from the sterile packaging and place the components in sterile saline.\nAttach the distal port of the valve to the proximal end of the distal catheter, secure it twice with 3-0 silk ties, and prime the system with sterile saline solution to remove any residual air locks. Wrap the valve and the exposed catheter in a saline-soaked sponge making every attempt to prevent the shunt system from touching the drapes.\n4. Ventricular (proximal) catheter insertion\nRemove the ventricular catheter from the sterile packaging and place it in sterile saline.\nCreate a small centrally located circular durotomy equivalent to the diameter of the proximal catheter (incorporating the underlying pia and arachnoid) using a fine tip monopolar cautery.\nWith the navigation stylet within the proximal catheter, pass the catheter into the ipsilateral ventricle using real-time navigation along the preprogrammed trajectory to the target depth.\n\tNOTE: Often, there is CSF flow at about 5 cm, however, ensure to advance the catheter further to a depth of approximately 8-10 cm (target).\nOnce at the target depth, remove the navigation stylet probe from the ventricular catheter and confirm free CSF flow. Then clamp the catheter with a snap using booties to protect the catheter.\nTrim the proximal catheter, leaving about 2 cm extra from the outer table of the skull (Figure 5).\nAttach the distal end of the proximal catheter to the proximal outlet of the valve and secure it twice with 3-0 silk ties.",
    "Carefully place the valve into the subgaleal pocket and anchor the valve sleeve to the preserved periosteum with a 4-0 silk suture.\nApply gentle traction on the distal catheter at the abdominal incision to ensure no catheter kinks exist.\nConfirm that the spontaneous flow of CSF is at the very distal (abdominal) end of the shunt system.\n5. Intrabdominal (distal) catheter placement\nNOTE: The distal catheter is placed laparoscopically within the peritoneal cavity, ideally by a general surgeon.\nMake a curvilinear periumbilical incision with a #15 scalpel followed by blunt dissection down to the abdominal wall fascia.\nGrasp the fascia on each side with Kocher forceps and incise it in a vertical fashion, to ensure entry into the peritoneal cavity.\nPlace #2 polyglactin stay sutures through the fascia on either side, then insert a blunt Hasson trocar.\nInsufflate the abdomen with carbon dioxide (CO2).\nInsert a at 30° angled laparoscope through the Hasson trocar access port (Figure 6).\nPlace a 5 mm port in standard fashion under direct vision, usually on the left, but this may vary depending on the density and position of intraperitoneal adhesions (Figure 6).\nPerform any lysis of adhesions, that may be required.\nMake a small hole in the falciform ligament (from the left side of the ligament) using a combination of electrocautery and laparoscopic Metzenbaum scissors (Figure 6). The hole must be as close to both the liver and diaphragm as safely possible (cephalad).\nCreate a transverse abdominal tunnel for the VP shunt catheter using the electrocautery hook at the incision created in step 3.1 (where the distal catheter exits from the subcutaneous space).\nInsert the distal VP shunt catheter into the peritoneal cavity through the path created with a 11F peel-away sheath introducer.",
    "Once the catheter is visualized in the abdominal cavity, grasp and position it, through the hole in the falciform ligament (Figure 6).\nPull the remaining catheter through the falciform ligament hole from the right side and tuck it behind the liver (following medial mobilization of the right posterior liver sector). The catheter's final resting place must be the retrohepatic space (Figure 6).\nTrim the catheter such that the end is located just above the inferior margin of the liver. The final position of the catheter should ideally be inferior to the diaphragm but superior and posterior to the mobilized liver, immediately superior to the right pericolic gutter. Confirm there is still spontaneous CSF flow through the catheter under direct visualization (Figure 6).\n\tNOTE: There is no predetermined length of the catheter. The catheter is trimmed to fit the patient's anatomy intracorporeally.\nRemove the residual (trimmed part of the catheter) through the 5 mm side port.\nDeflate the abdomen slowly and cautiously to ensure no migration of the catheter, and then remove all instruments.\n6. Closure\nClose the cranial wound in a layered fashion with 3-0 polyglactin simple interrupted buried sutures in the galea layer and staples in the skin. Apply a dressing.\nClose the abdominal fascia using the previously placed polyglactin stay sutures followed by 4-0 poliglecaprone-25 subcuticular sutures and acrylate adhesive for skin closure. Apply a surgical dressing.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}