{
  "id": 18672,
  "origin_website": "Jove",
  "title": "Bile Duct Ligation in Mice: Induction of Inflammatory Liver Injury and Fibrosis by Obstructive Cholestasis",
  "procedures": [
    "NOTE: All experiments were approved by the official State animal care and use committee (LANUV, Recklinghausen, Germany). The mice are housed under specific-pathogen-free conditions according to the guidelines of the Federation for Laboratory Animal Science Associations (FELASA). All experiments were conducted in accordance with the German federal law regarding the protection of animals and 'Guide for the Care and Use of Laboratory Animals' (National Institutes of Health publication 8th Edition, 2011).\n1. Presurgical Preparation\nNOTE: Carry out all procedures under clean but non-sterile conditions. All instruments and other reusable equipment such as surgical forceps, scissors, and Colibri retractor that are used to perform surgery must be sterilized prior to use according to protocols that are in strict compliance with the institutional guidelines for performing surgeries in animals.  For a detailed list of necessary reagents, materials and equipment, please refer to the list of Specific Materials/Equipment.\nDuring the complete experimentation, keep the animal on a warming plate at a temperature of 37 °C, permanently connected to an anesthesia system, and the cover the operational area overall with fluid-impermeable, self-adhesive drapes. Properly arrange all instrumentations and solutions that are used during the experimentation prior to surgery (Figure 1).\nAnesthetize the mouse with inhalation of 4 vol% isoflurane in 100% oxygen at a flow rate of 4 L/min for the induction of the anesthesia. The depth of anesthetization is sufficient when the following vital criteria are reached: regular spontaneous breathing, no reflex after setting of pain stimuli between toes, and no response to pain.\nShave the abdominal fur of the mouse with an electric fur shaver and protect the eyes from drying out by usage of eye and nose ointment.",
    "Place the mouse on a 37 °C heated hot plate, insert the mouse snout in the Fluovac mask of the Fluovac anesthesia system, and fix the legs of the animal with stripes of silk tape.\nMaintain anesthesia of the mouse by inhalation of 1.5-3 vol% isoflurane in 100% oxygen at a flow rate of 1 L/min and induct perioperative analgesia via intraperitoneal injection of buprenorphine solution (0.1 mg/kg BW dissolved in 0.9% NaCl solution).\nSterilize the shaved abdominal skin with a gauze swab that is moistened with a standard antiseptic, ready to use alcoholic solution for pre-operative treatment of the skin.  Note: In our protocols we use a poly-alcohol skin antisepticum. This is in full accordance with the German federal law regarding the protection of animals and the guidelines of the Federation for Laboratory Animal Science Associations. This antiseptic contains 70% (v/v) 2-propanol, butan-1,3.diol and traces of quinoline yellow, and perfume.\n2. Surgical Procedures\nOpen the abdomen with a midline laparotomy of a length of approximately 2 cm by cutting the cutis plus fascia at the same time with an 11.5 cm surgical scissor.\nDissect the connective tissue on top of the peritoneum by using the scissor as a spreader.\nCut the peritoneum along the linea alba to open the peritoneal cavity.\nEnlarge the cavity by inserting a holding suture in the sternum, raising the filament of the suture, and fixing it on top of the Fluovac mask.\nSpread the operation area by inserting a Colibri retractor in the peritoneal cavity (Figure 2).\nLift the liver with a moisturized (0.9% NaCl solution) cotton swab so that the ventral side of it sticks to the diaphragm and the hilum is clearly visible.\nExpose the bile duct by caudal movement of the gut (Figure 3).",
    "Separate carefully the bile duct from the flanking portal vein and hepatic artery using a micro-serrations forceps (Figure 4A).\nPlace the 5-0 suture around the bile duct and secure it with two surgical knots. When tying the knots increase the tractive force continuously to ensure effective obstruction without severing the bile duct (Figure 4B).\nAdd a second cranial ligation in the same manner but do not dissect the bile duct in between (Figure 4C). Otherwise there is a considerable risk that bile leaks if one knot is not secure, and the animals experience no cholestasis but develop severe peritonitis.\nCut the ends of the sutures (Figure 4D), lower the sternum, and remove the retractor.\nRinse the peritoneal cavity with 0.9% NaCl solution and replace the abdominal organs to the physiological positions.\nClose both abdominal layers (peritoneum and cutis plus facia) with separate running sutures with 6-0 Mersilk.\nCut the ends of the sutures and sterilize the operation area with a gauze swab moistened with antiseptic solution.\n\tNOTE: When performing the surgery for the first time, perform all procedures under a surgical microscope at a magnification of 16X-20X. This allows better recognition of the bile duct and clearly distinguishes it from the portal vein and hepatic artery (Figures 5 and 6). Some laboratories recommend the dissection of the bile duct in between the two ligatures. Leave the bile duct intact because potential leaks in one of the knots will result in severe acute peritonitis, ascites, and systemic endotoxemia when the bile duct is dissected.\n3. Postoperative Treatment and Follow-up\nAllow the mouse to recover in a cage warmed up by an infrared lamp until the mouse is fully awake and active.\nAfterwards, move the mouse to a normal cage and provide ad libitum access to water and food.",
    "After the surgery, monitor the animals at regular intervals and carry out follow-up postoperative treatment with suitable analgesia (e.g., buprenorphine solution) following the local recommendation of the internal animal care and use committees.\n\tNOTE: Perform analgesic therapy for 3 days. Any abnormal behavior may indicate rare complications such as peritonitis, sepsis or internal bleeding and should be handled as human endpoint to terminate the experiment.\nAnimals are kept with free access to food and water ad libitum until the end of the experiment. There is no need for blood drawing since ongoing fibrogenesis is indicated by jaundice.\nWhen animals are sacrificed, blood is collected for measurement of clinical chemistry parameters (AST, ALT, bilirubin etc.) and the liver is retrieved for histochemical and biochemical analysis."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}