{
  "id": 10395,
  "origin_website": "Jove",
  "title": "Standardized and Scalable Assay to Study Perfused 3D Angiogenic Sprouting of iPSC-derived Endothelial Cells In Vitro",
  "procedures": [
    "1. Device Preparation\nTransfer the microfluidic 384-well plate to a sterile laminar-flow hood.\nRemove the lid and add 50 µL of water or phosphate-buffered saline (PBS) to each of the 40 observation wells (Figure 1b, well B2) using a multichannel or repeating pipette.\nNOTE: The protocol can be paused here. Leave the plate with the lid on in the sterile culture cabinet at room temperature (RT).\n2. Prepare Gel and Coating\nPrepare 2.5 mL of 10 µg/mL fibronectin (FN) coating solution. Dilute 25 µL of 1 mg/mL fibronectin stock solution in 2.5 mL of Dulbecco’s PBS (dPBS, calcium and magnesium free). Place the solution in the water bath at 37 °C till use.\nPrepare 100 µL of collagen-1 solution. Add 10 µL of HEPES (1 M) to 10 µL of NaHCO3 (37 g/L) and mix by pipetting. Place the tube on ice and add 80 µL of collagen-1 (5 mg/mL) to yield a neutralized collagen-1 concentration of 4 mg/mL. Use a pipette to mix carefully and avoid the formation of bubbles.\nAdd 1.5 µL of collagen-1 solution (4 mg/mL) to the gel inlet of each microfluidic unit (Figure 1b, well B1). Make sure the droplet of gel is placed in the middle of each well in order for the gel to enter the channel (see Figure 2a).\nNOTE: Phaseguides prevent filling of the adjacent channels and enables gel patterning. Correct gel loading can be confirmed under a brightfield microscope by observing the meniscus formation through the ‘observation window’ (well B2) or by flipping the plate upside down. If the gel did not completely fill the channel, an additional droplet of 1 µL can be added.\nPlace the microfluidic plate in an incubator (37 °C, 5% CO2) for 10 min to polymerize collagen-1.",
    "NOTE: Timing of the polymerization is crucial; due to the low volumes used in microfluidics, evaporation can already be observed after 15 min of incubation, which results in gel collapse or shrinkage.\nTake the plate out of the incubator and transfer to a sterile laminar-flow hood.\nAdd 50 µL of 10 µg/mL FN coating solution to the outlet well of the top perfusion channel of every microfluidic unit (Figure 1b, well A3). Press the pipette tip against the side of the well for correct filling of the well without trapping air bubbles (see Figure 2b). The channel should fill, and the liquid should pin on the inlet (well A1) without filling the inlet well.\nPlace the plate in the incubator (37 °C, 5% CO2) for at least 2 days.\nNOTE: The protocol can be paused here, as the collagen-1 gel together with the coating mixture is stable for at least 5 days in the incubator. If the coating mixture is refreshed, longer periods could be possible, but this has not been tested. Crucial is the level of FN-coating, as this prevents the dehydration of the collagen-1 gel.\n3. Cell Seeding/Microvessel Culture\nAdd 5 mL of fetal calf serum and 2.5 mL of pen/strep to 500 mL of basal endothelial cell culture medium and filter sterilize using a bottle top filter with 0.22 µm pore size. This medium is now referred to as basal medium.\nPrepare vascular growth medium: Add 3 µL of 50 µg/mL vascular endothelial growth factor (VEGF) and 2 µL of 20 µg/mL basic fibroblast growth factors (bFGF) to 5 mL of basal medium.\nThaw the frozen iPSC-ECs rapidly (<1 min) in a 37 °Cwater bath and transfer to a 15 mL tube and dilute in 10 mL of basal medium.\nCount the cells.",
    "NOTE: A single vial contains 1 million cells in 0.5 mL with >90% viability.\nCentrifuge the tube at 100 x g for 5 min. Aspirate supernatant without disturbing the cell pellet and resuspend in basal medium to yield a concentration of 2 x 107 cells/mL.\nTransfer the microfluidic 384-well plate from the incubator to a sterile laminar-flow hood.\nAspirate FN-coating solution from the perfusion outlet well (A3) and replace with 25 µL of basal medium in the outlet well (well A3).\nAdd a 1 µL droplet of cell suspension to every top perfusion inlet well (Figure 1b, well A1). The droplet should flatten in a few seconds (see Figure 3a,b for an illustration of this ‘passive pumping’ method).\n\tNOTE: Check under a microscope whether the seeding is homogeneous. If not, add another 1 µL in the outlet and wait till the droplet flattens.\nIncubate the microfluidic well-plate for 1 h at 37 °C, 5% CO2. After this, the cells should have adhered. If not, wait another 30 min.\nRemove the basal medium from the top perfusion outlet wells (Figure 1b, well A3). Add warm vessel culture medium in the top perfusion inlet and outlet (Figure 1b, wells A1 and A3). Place the plate on the rocker platform (set on 7° angle, 8 min rocking interval) in the incubator (37 °C, 5% CO2).\nImage the plate using a brightfield microscope with automated stage at day 1 and 2 post-seeding to confirm cell viability. After 2 days, a confluent monolayer should have formed against the collagen-1 scaffold.\nNOTE: If the channels do not appear to be equally confluent, the microvessels can be cultured for an additional 24 h.\n4. Study Angiogenic Sprouting Including Tip- and Stalk-cell Formation",
    "Prepare 4.5 mL of angiogenic sprouting medium by supplementing basal medium with 4.5 µL of VEGF (50 µg/mL stock), 4.5 µL of phorbol 12-myristate-13-acetate (PMA) (2 µg/mL stock), and 2.25 µL of sphingosine-1-phosphate (S1P) (1 mM stock).\nPrepare 8.5 mL of vessel growth medium (basal medium supplemented with 30 ng/mL VEGF and 20 ng/mL bFGF).\nAspirate medium from the wells and add 50 µL of fresh vessel culture medium in the top perfusion inlet and outlet wells and gel inlet and outlet wells (Figure 1b, wells A1, A3, B1 and B3).\nAdd 50 µL of angiogenic sprout mixture to each of the bottom perfusion channel inlet and outlet wells (Figure 1b, wells C1 and C3).\nPlace the device back in the incubator (37 °C, 5% CO2) on the rocker platform in order to form a gradient of angiogenic growth factors.\nImage 1 day and 2 days after addition of the angiogenic growth factors using a brightfield microscope with automated stage.\nNOTE: Continue culturing the microvessels to study anastomosis (go to section 5) or fix and stain the microvessels to quantify sprouting length and morphology at day 2 and day 6 (go to section 6).\n5. Study Anastomosis and Sprout Stabilization\nImage using a brightfield microscope with automated stage.\nAdd 1 µL of fluorescently labeled albumin (0.5 mg/mL) to the top perfusion inlet (Figure 1b, well A1) and mix using a 50 µL pipette.\nTransfer the plate to a fluorescent microscope with automated stage and incubator set at 37 °C. Set microscope at 10x objective and correct exposure settings (e.g., tetramethylrhodamine [TRITC]-channel, 20 ms exposure). Acquire time-lapse images every minute for 10 min.\nRemove the plate from the microscope and transfer the plate to a sterile laminar-flow hood.",
    "Remove all medium from the wells and replace both the vessel culture medium and angiogenic sprouting medium in the corresponding wells (see steps 4.3 and 4.4).\nPlace the device back into the incubator (37 °C, 5% CO2) to continue angiogenic sprouting.\nRepeat steps 5.1−5.6 to study the permeability at day 6.\n6. Fixation, Staining, and Imaging\nAspirate all culture media from all the wells.\nNOTE: Residual medium or liquids in the microfluidic channels does not influence the fixation due to its low volume of 1−2 µL.\nAdd 25 µL of 4% paraformaldehyde (PFA) in PBS to all the perfusion inlet (Figure 1b, A1 and C1) and outlet wells (Figure 1b, A3 and C3). Incubate for 10 min at RT. Place the device under a slight angle (±5°) to induce flow (e.g., by placing one side of the plate on a lid).\nAspirate PFA from the wells. Wash all the perfusion inlets and outlets twice with 50 µL of Hank’s balanced salt solution (HBSS). Aspirate HBSS from wells.\nPermeabilize at RT for 10 min by adding 50 µL of 0.2% nonionic surfactant to all the perfusion inlets and outlets.\nAspirate the nonionic surfactant from wells. Wash the perfusion channels twice by adding 50 µL of HBSS to all perfusion inlet and outlet wells. Aspirate HBSS from wells.\nStain the nuclei using Hoechst (1:2,000) and F-actin using phalloidin (1:200) in HBSS. Prepare 2.2 mL for 40 units, and add 25 µL to each perfusion inlet and outlet well. Place the plate under a slight angle and incubate at RT for at least 30 min.\nWash twice with 50 µL of HBSS in all the perfusion inlets and outlets.\nDirectly image using a fluorescent microscope with automated stage or store the plate protected from light at 4 °C for later use."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}