{
  "id": 19641,
  "origin_website": "Jove",
  "title": "Acquisition of Resting-State Functional Magnetic Resonance Imaging Data in the Rat",
  "procedures": [
    "All experiments were performed on a 9.4 T MRI scanner, and were approved by the Institutional Animal Care and Use Committee at Dartmouth College. Additional approval was obtained to record and show the animals used in the video and figures below.\n1. Preparations before scanning\nSubcutaneous infusion line\n\t\nPartially remove a 23 G needle from its package so that the needle point remains sterile.\nSecurely hold the hub of the needle and use a razor blade to score the needle shaft where it meets the hub.\nClamp a needle holder around the shaft directly below the scoring and gently break the shaft from the hub.\nInsert 1/3 of the needle shaft (blunt end) into previously sterilized PE50 line with enough line length to extend from the drug pump to the animal inside the magnet bore.\nDilution of dexmedetomidine and atipamezole\n\t\nPrepare a solution of diluted dexmedetomidine hydrochloride using 0.5 mL of 0.5 mg/mL stock mixed with 9.5 mL of sterile saline in a clear, sterile glass bottle (diluted concentration = 0.025 mg/mL).\nPrepare a solution of diluted atipamezole using 0.1 mL of 5 mg/mL stock mixed with 9.9 mL of sterile saline in a clear, sterile glass bottle (diluted concentration = 0.05 mg/mL).\nScanning parameters\n\t\nUse the parameters presented in Table 1 to prepare scanning sequences.\n2. Phase 1 anesthesia: Animal induction and preparation\nSetup\n\t\nEnsure that all equipment is on and working properly including the oxygen and air mixer, heating pad, and active scavenging system (see Figure 1).\nSet the heating system's temperature set point to 37.5 °C.\nAnimal induction\n\t\nPlace the animal (90-day old, male Sprague Dawley rat) in the induction chamber and induce anesthesia with 2.5% isoflurane in 30% oxygen-enriched air.\n\t\tNOTE: A wide range of animal ages and both sexes can be used.",
    "Once the animal is anesthetized, remove it from the chamber, weigh the animal, and place it in the nose cone (at 2.5% isoflurane) on the heating pad in the preparation space.\nAnimal preparation\n\t\nApply ophthalmic lubricating ointment to each eye to prevent drying.\nConfirm the depth of anesthesia by a lack of toe pinch response.\nUse clippers to shave a 2\" by 2\" square area on the lower lumbar region of the animal's back (i.e., directly above the tail).\nAdminister 0.015 mg/kg of the dexmedetomidine solution with an intraperitoneal (i.p.) injection (e.g., a 300 g rat would receive 0.18 mL) into the lower right quadrant of the abdomen using a 25 G needle.\nSwitch isoflurane flow from the preparation space to the animal cradle.\nMove the animal into the animal cradle. Place the rat's front teeth securely over and into the bite bar. Push the nose cone over the nose to ensure a tight fit.\n\t\tNOTE: If the nose cone does not cover the lower jaw, use a paraffin film to gently hold the jaw closed while also sealing around the nose cone.\nPosition the respiration pad under the rat's abdomen below the rib cage and re-position it until the respiration waveform shows a deep trough centered on each breath (see respiration waveform in Figure 2).\nMonitor the animal's breathing using the physiology monitoring software. Move to the next phase of anesthesia when respiration is less than 40 breaths/min (bpm; approximately 5 min after dexmedetomidine injection).\n3. Phase 2 anesthesia: Animal setup\nInsert ear bars into the ear canal to stabilize the rat's head in the animal cradle. Once positioned, pull forward on the bite bar and confirm the head does not move. Re-adjust the nose cone and paraffin film as needed (see Figure 3a).",
    "Insert the temperature probe into a pre-lubricated, disposable probe cover. Gently insert the temperature probe approximately ½\" into the rectum, and tape it to the base of the tail with medical tape.\nPlace the pulse oximeter clip onto the metatarsal area of the hind foot, ensuring the light source is on the bottom of the foot (palm).\n\tNOTE: Rotation of the clip can affect the signal; thus, creating a holder to keep the paw and clip upright will lead to greater stability. Also note that until the rat is at normal body temperature, the oxygen saturation may be low (<95%).\nUse the rat's weight to calculate the infusion rate to eject 0.015 mg/kg/h of dexmedetomidine (a 300 g rat receives 0.18 mL/h).\nSet the drug pump to eject the calculated infusion rate.\nFill a 3 mL syringe with the sterile, diluted dexmedetomidine solution and insert the tip of the needle into the open end of the sterilized infusion line (extending from the drug pump to the animal cradle with the subcutaneous needle previously attached). Fill the line and secure the syringe in the syringe holder of the drug pump.\nMove the pusher block forward until it touches the plunger, and the drug is expelled at the needle, ensuring the infusion line is completely filled.\nUsing an alcohol wipe, clean the shaved area to remove any stray hair.\nPinch the skin approximately two finger widths above the base of the tail. Insert 1/3 of the infusion line needle into the tented skin.\nSecure the needle to the skin with a 3\" piece of wide medical tape. Place a second piece of wide medical tape over the first, across the rat, and attached to both sides of the animal cradle (see Figure 4).",
    "NOTE: It is critically important that the ferromagnetic needle is well secured to prevent movement during the scan.\nBegin the infusion of subcutaneous dexmedetomidine.\nPlace a piece of gauze on the bridge of the rat's nose to create a level surface for the coil. Use paper tape, which does not interfere with the MRI signal, to secure the coil to the rat's head, centering it over the brain (see Figure 3b,c).\nSecure all lines and cables within the animal cradle with lab tape and check whether all the physiology signals are stable (see Figure 2).\nPlace paper towels over the animal, securing them to the animal cradle with laboratory tape. If using an air heating system, wrap a plastic sheet around the entire cradle to contain the warm air.\nMove the animal into the bore and tune the magnet.\n4. Phase 3 anesthesia: Anatomical scan acquisition\nReduce isoflurane to 1.5%, resulting in a steady increase in respiration to approximately 45-50 bpm. Remain at this level for the duration of the anatomical scanning.\nUse the FLASH localizer scan to ensure the brain is aligned with the magnet isocenter (Figure 5a). Reposition the animal and repeat if necessary.\nRun the higher resolution RARE localizer scan and use this scan output to align 15 sagittal slices centered across the brain (left to right, Figure 5b).\nUsing the middle sagittal slice, align the center axial slice to the decussation of the anterior commissure, which appears as a dark spot (Figure 5c). Note the slice offset to use later in the resting-state scans.\nAcquire 23 slices using both the FLASH and RARE axial protocols to aid in registration to a common space during post-scan analysis.\nShim across the whole brain using the PRESS sequence.\n5. Phase 4: Resting-state scan acquisition",
    "After completing anatomical scans, reduce isoflurane to 0.5% to 0.75%, adjusting so that the animal's respiration is 60-65 breaths per minute. Remain at this level for at least 10 min before beginning resting-state scanning to ensure stability.\nWhen physiology is stable (respiration range is 60-75 bpm with no gasping or irregularities, core body temperature is 37.5 ± 1.0 °C, and oxygen saturation is 95% or greater), acquire a 15 slice EPI scan using the same slice offset as the anatomical axial series.\nAfter each resting-state scan is complete, check the quality using an independent component analysis (ICA) to decompose the data into spatial and temporal components.\nObtain at least three high-quality resting-state scans.\n6. Post-scan recovery\nWhen scanning is complete, increase isoflurane to 2% and stop the subcutaneous dexmedetomidine infusion.\nRemove the animal cradle from the magnet bore, unwrap the animal, and remove ear bars, temperature probe, pulse oximeter clip, and the dexmedetomidine needle.\nInject 0.015 mg/kg of the diluted atipamezole solution into the rat's hind leg muscle using a 1 mL syringe with a 25 G needle (i.e., a 300 g rat would receive 0.09 mL).\nPlace the rat back in the home cage on top of a heating pad and monitor until the animal is ambulatory.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}