{
  "id": 15352,
  "origin_website": "Jove",
  "title": "Transcriptomic Analysis of C. elegans RNA Sequencing Data Through the Tuxedo Suite on the Galaxy Project",
  "procedures": [
    "1. RNA Isolation\nPrecautionary measures\nWipe down the entire working surface, instruments and pipettes using a commercially-available RNase spray to eliminate any RNases present.\nWear gloves at all times, regularly changing them with fresh ones during the different steps of the protocol.\nUse only filter tips and keep all samples on ice as much as possible to avoid RNA degradation.\n\t\tNOTE: In order to obtain the best data from NGS platforms, it is critical to begin with high-quality RNA. RNA isolation and preparation methods vary depending on sample origin, method of sequencing and investigator preference. Several commercially available kits can be used for this purpose or RNA can also be isolated using a standard phenol-chloroform method of RNA extraction. With either methodology, the precautionary measures listed above should be followed throughout the process to minimize contamination and obtain pristine RNA samples.\nHarvesting Worms\nSynchronize the worm population by hypochlorite bleaching treatment23 to obtain 1,000-1,500 age-matched C. elegans adult worms per strain.\nWash the worms off plates using M9 buffer solution and spin at 325 x g on a table top centrifuge for 30 s. Aspirate out the M9 buffer leaving behind a pellet of worms. Repeat this step at least thrice to eliminate bacterial carryover.\nTo the worm pellet, add ~ 500 µL of lysis buffer (if using a commercial kit) or Trizol (a mono-phasic solution of phenol and guanidine isothiocyanate; if phenol:chloroform extraction described in 1.3.3 is undertaken) to disrupt worm tissues, deactivate RNases and stabilize nucleic acids.\n\t\tNOTE: The protocol can be paused here by flash freezing the samples in liquid nitrogen followed by storage at -80 °C.\nRNA Isolation\nSonicate worm samples at 45% amplitude in cycles of 20 s. 'ON' and 40 s. 'OFF' (8-12 cycles per strain). Keep samples on ice at all times.",
    "NOTE: Ensure that the sonicator probe is immersed in the buffer and is kept at a constant level throughout. Avoid frothing of the sample and clean the probe thoroughly in-between samples. Sonication cycles may vary depending on the type of sonicator used. It is recommended that sonication conditions are first optimized on a test sample before starting an experiment.\nIf using a commercially available kit, proceed with RNA Isolation as per the prescribed protocol. For RNA isolation using a phenol-chloroform method, perform the following steps.\nCentrifuge sonicated samples at 16,000 x g for 10 min. at 4° C.\nTransfer supernatant into a 1.5 mL RNase-free microfuge tube and add 100 µL of chloroform (1/5th the volume of RNA/DNA isolation reagent).\n\t\tCaution: Chloroform is toxic. To minimize exposure and avoid inhalation, work in a chemical hood when handling this substance.\nVortex the samples thoroughly for 30 - 60 s. and let the samples sit at room temperature for 3 min.\nCentrifuge at 11,750 x g for 15 min. at 4 °C. Transfer only the top aqueous layer to a new RNase-free microfuge tube taking care not to aspirate the DNA-containing white interface. Repeat steps 1.3.4 through 1.3.6.\nAdd 250 µL (70% of aqueous phase or 1/2 RNA/DNA isolation reagent volume) of 2-propanol and invert the tube to mix. Let tubes sit at room temperature for 10 min or leave overnight at -80 °C.\nCentrifuge samples at 11,750 x g for 10 min. at 4 °C. Decant the supernatant very carefully, leaving behind a few µL at the bottom of the tube so that the pellet is not disturbed.\nWash pellet with 500 µL of 75% ethanol (made using RNase-free water) and spin down at 16,000 x g for 5 min. at 4 °C.",
    "Remove as much supernatant as possible without disturbing the pellet. Air dry the pellet in a hood for a few minutes.\nAdd 30 µL of RNase-free water and help dissolve the RNA pellet by heating for 10 min. at 60 °C.\nCheck RNA quality and quantity using a bioanalyzer.\n\t\tNOTE: Bioanalyzer generates an RNA Integrity Number (RIN) as a measure of RNA quality. An RIN of at least 8 is the recommended threshold for RNA-Seq samples (higher is better). RNA quantity and quality can also be checked spectrophotometrically but should also be followed by visual assessment of RNA integrity. To do this, run the samples on a 1.2% agarose gel long enough to obtain suitable separation of the 28s and 18s ribosomal RNA bands. The presence of two distinct bands (1.75 kb for 18s rRNA and 3.5 kb for 28s rRNA in the case of C. elegans) is an acceptable measure of RNA quality.\nUse ~100 ng/µL RNA to ship to the vendor/NGS facility for preparation of sequencing libraries.\n\t\tNOTE: RNA samples should be shipped on dry ice to the sequencing service provider. Most providers conduct an independent RNA quality-control test before library preparation.\n2. RNA-Seq Data Analysis\nDownload of Raw Sequencing Data\nDownload the compressed raw fastq sequencing data encoded in the fastq.gz format from the NGS provider using a \"file transfer protocol\" (ftp).\nimgsrc://cloudfront.jove.com/files/ftp_upload/55473/55473fig2.jpg",
    "Figure 2: Layout of the Galaxy User Interface Panel and Key RNA-Seq Functions. Key features of the page are expanded and highlighted. (A) highlights the 'Analyze data' function in the webpage header used to access Analysis Home View. (B) is the 'Progress bar' that indicates the space on the Galaxy server utilized by the operation. (C) is the 'Tools Section' that lists all the tools that can be run on the Galaxy interface. (D) shows the 'NGS: RNA Analysis' tool section used for RNA-Seq analysis. (E) depicts the 'History' panel that lists all the files generated using Galaxy. (F) shows an example of the dialogue box that opens up when clicking on any file in the History section. Within (F), the blue box highlights icons that can be used to view, editthe attributes or delete the dataset, the purple box highlights icons that can be used to 'edit' the dataset tags or annotation, and, the red box indicates icons to download the data, view details of the task performed or rerun the operation. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/55473/55473fig2large.jpg]\nGetting Started with Galaxy\n\tNOTE: Galaxy can be run on a free public server using a web-based platform providing cloud access and free limited storage. It can also be downloaded and run locally on the user's machine or computational clusters hosted by institutions but local processing, may be constrained by data-storage limits and processing power limitations of user machines. Details on downloading and installation can be accessed at https://wiki.galaxyproject.org/Admin/GetGalaxy[href=https://wiki.galaxyproject.org/Admin/GetGalaxy]. In this protocol we describe the web-based usage of the Galaxy pipeline.\n\t\nAfter downloading and storing the NGS data on the user's machine, access Galaxy at https://usegalaxy.org/[href=https://usegalaxy.org/].",
    "Register a user account by clicking on 'User' in the header of the page, login and begin by getting acquainted with the user interface panel.\n\t\tNOTE: It is recommended that first time users utilize the 'Start here' tutorial provided on the home page to get familiarized with the basic set up of Galaxy (https://github.com/nekrut/galaxy/wiki/Galaxy101-1[href=https://github.com/nekrut/galaxy/wiki/Galaxy101-1]).\nClick on 'Analyze Data' (Figure 2A) in the header panel to access the 'Analysis Home View' which is also the startup screen on Galaxy.\n\t\tNOTE: The header also houses other links whose details can be seen by hovering the mouse pointer over them. The upper right-hand corner of the header has a progress bar that monitors space utilized for the tasks (Figure 2B).\nClick on 'NGS: RNA Analysis' task in the 'Tools Menu' on the left panel (Figure 2C) to access all the tools required for RNA-seq data analysis.\n\t\tNOTE: The 'Tools Menu' catalogs all the operations that Galaxy offers. This menu is split based on tasks and clicking on any one will open up a list of all the tools needed to accomplish that task.\nCreate new analysis history by clicking on the gear icon at the top of the 'History' panel on the right (Figure 2E). Choose 'Create New' option from the pop-up menu. Give this 'History' a suitable name to identify the analysis.",
    "NOTE: The 'History' panel shows all the files uploaded for analysis as well as all the output files that are generated by running tasks on Galaxy. Clicking on a file name in this panel opens up a dialogue box with detailed information about the task performed and a snippet of the dataset (Figure 2F). Icons in this box enable the user to 'view', 'edit the attributes' or 'delete' the dataset (Figure 2F, highlighted in blue). Additionally, the user can also 'edit' dataset tags or annotation (Figure 2F, highlighted in purple), 'download' the data, 'view details' of the task, 'rerun' the task or even 'visualize' the dataset from this dialogue box (Figure 2F, highlighted in red).\nClick the 'Upload File' function under 'Get Data' in the 'ToolsMenu' to upload raw fastq files.\n\t\tNOTE: Clicking on this or any other tool opens up a short description of the operation, and the test itself, in the middle 'Analysis Interface' panel. This panel laces together the 'Tools' from the left panel and the 'Input Files' from the right 'History' panel (Figure 2E). Here, input files from 'History' are selected and other parameters defined to run a given task. The resultant output dataset from every test is saved back in 'History'. Included with the test in the 'Analysis Interface\" panel are explanations for all the parameters available for running a given tool along with a detailed list of all the output files the tool generates.\nAfter the task opens in the 'Analysis Interface', click on 'Choose Local File' or 'Choose FTP File' (faster upload), navigate to the folder containing the sequencing files and select the appropriate dataset to be uploaded.\nAllow Galaxy to 'Auto-detect' the uploaded file type (default setting). Select 'C. elegans' in the pull down menu for the genome.",
    "Click on 'Start' to initiate data upload. Once the file is uploaded, it will be saved in the 'History' panel and can be accessed from there.\nIf multiple sequencing data files are produced for a single sample, combine them using the 'Concatenate' tool. To do this, open up the 'Text Manipulation' option in the 'Tools Menu'.\nClick on the 'Concatenate' tool, choose the files that need to be combined from the drop-down box in the middle of 'Analysis interface' and click 'Execute'.\n\t\tNOTE: Output files produced using this task are generated in the fastq format. The mapping program has a limit of 16,000,000 sequences per fastq file and when that limit is reached a new fastq file is generated for the remaining sequences. The 'Concatenate' tool is needed in such instances to combine the datasets.\nConvert the uploaded fastq format files to the required fastqsanger format for Galaxy RNA-Seq analysis by using the 'fastq groomer' tool found under the 'NGS: QC and manipulation' section (see supplemental file).\nChoose the appropriate fastq dataset under the 'File to Groom' option and run the tool using default parameters.\n\t\tNOTE: Output files produced using this task are generated in the fastqsanger format.\nfastqsanger Data Quality-Control Tests\nCheck the quality of the uploaded fastqsanger reads using the 'FastQC' tool located under 'NGS: QC and manipulation' in the 'Tools' Menu.\nChoose the groomed fastqsanger data file from the dropdown menu for 'Short read data from the current library' and run the tool using default parameters.\n\t\tNOTE: Pay special attention to the quality of the reads and presence of any adapter sequences. Adapters are usually removed as part of the post RNA-Seq data processing by NGS providers but in some instances, may be left behind. For explanation of quality standards go to http://www.bioinformatics.babraham.ac.uk/projects/fastqc/[href=http://www.bioinformatics.babraham.ac.uk/projects/fastqc/].",
    "Check with the NGS provider and if adapters are present, trim them using the 'Clip' tool from the 'NGS: QC and manipulation' task menu.\n\t\tNOTE: Output files produced using this task are generated in the raw txt format as well as in html that can be opened on any web browser.\nData Analysis with Tuxedo Suite\nTopHat\n\t\t\nDownload the latest version of C. elegans reference genome fasta and gtf (Gene Transfer Format) files from Upload file' as described above in 2.2.6.\nOpen the 'NGS: RNA Analysis' section and click on the 'TopHat' tool to map the sequencing reads to the downloaded reference genome.\nSelect the appropriate answer from the dropdown menu to the question 'Is this single-end or paired-end data?'\nChoose the appropriate fastq file.\nSelect 'Use a genome from history' in the next dropdown menu and choose reference genome downloaded in step 2.4.1.1.\nSelect 'Default' for the other parameters and click 'Execute'.\n\t\t\tNOTE: Among the output files produced using this task, the 'Accepted Hits' file is used for subsequent steps.\nCufflinks and Cuffmerge\n\t\t\nSelect the 'Cufflinks' tool in the 'NGS: RNA Analysis' section to assemble the transcripts, estimate their abundance and test for differential expression.\nIn the first dropdown menu, choose the mapped 'Accepted hits (BAM format)' file obtained from TopHat analysis.\nIn the second dropdown menu, set reference annotation to the gtf file downloaded in step 2.4.1.1.\nSelect 'Yes' for the 'Perform bias correction' option and run the task using the default settings for all other parameters.\n\t\t\tNOTE: Among the output files produced using this task, the 'Accepted Transcripts' file is used for subsequent steps.\nOpen 'Cuffmerge' tool in the 'NGS: RNA Analysis' to merge the 'Assembled Transcripts' produced for all the RNA-Seq samples.",
    "NOTE: The first box in the tool self-populates and lists all the gtf files produced by Cufflinks.\nSelect the 'Assembled Transcripts' file for all the strains/conditions tested, including biological replicates of the same strain/condition (See discussion for biological replicates).\nSelect 'Yes' for 'Use Reference Annotation' and choose the gtf file downloaded in step 2.4.1.1.\nIn the following box, again select 'Yes' for the 'Use Sequence Data' option and choose the whole genome fasta file downloaded in step 2.4.1.1.\nKeeping the other parameters as default, click 'Execute'.\n\t\t\tNOTE: Cuffmerge generates a single gtf output file.\nCuffdiff\n\t\t\nNavigate to the 'Cuffdiff' tool in the 'NGS: RNA Analysis' section. In the 'Transcripts' menu, select the merged output file from Cuffmerge.\nLabel conditions 1 and 2 with the two strains/condition names.\n\t\t\tNOTE: Cuffdiff can perform comparisons between more than two strains or conditions as well as time course experiments. Simply use the 'Add new conditions' option to add each new strains/condition, as needed.\nFor each strain/condition, under 'Replicates' select individual 'Accepted Hits' output files from TopHat that correspond to the different biological replicates of that strain/condition. Hold down the 'cmd' key, if using a Macintosh computer, and 'ctrl' key, if using a PC, to select multiple files.\nLeave all other options as default parameters. Click 'Execute' to run the task.",
    "NOTE: Cuffdiff generates numerous output files in a tabular format as the final readout of the RNA-Seq analysis. These include files with FPKM tracking for transcripts, genes (combined FPKM values of transcripts sharing a gene identity), primary transcripts and coding sequences. All data files generated can be viewed on any spreadsheet application and contain similar attributes such as gene name, locus, fold change (in log2 scale) as well as statistical data on comparisons between strains/conditions, including p value and q values. The data in these files can be sorted based on statistical significance of differences or fold change in gene expression (magnitude and direction of change, as in up- or down- regulated genes) and manipulated as per the users' requirements. If conversion between different gene identifiers is needed (e.g., Wormbase gene ID vs. cosmid number), tools available on Biomart (http://www.biomart.org/[href=http://www.biomart.org/]) can be utilized.\n3. Gene Ontology (GO) Term Analysis using DAVID\nAccess DAVID from the website https://david.ncifcrf.gov/. Click on 'Start Analysis' in the header of the webpage. In 'Step 1', copy and paste the list of genes obtained from Galaxy into box A. In 'Step 2', select 'Wormbase Gene ID' as the identifier for the input genes.\n\tNOTE: DAVID recognizes most publicly available annotation categories, so other gene identifiers (such as Entrez gene ID or gene symbol) can also be used.\nIn 'Step 3', choose 'Gene List' (genes to be analyzed) under 'List Type' and then click on the 'Submit List' icon.",
    "NOTE: 'Analysis Wizard', will open up to list all the hyperlinked DAVID tools that can be run on the uploaded gene list (Figure 3). Click on these links to access relevant corresponding modules as per the user's requirement. To identify the tools appropriate for a given task, click on 'Which DAVID tools to use?' link on the 'Analysis Wizard' page. Click on the 'Start Analysis' link in the header to return to the 'Analysis Wizard' home page at any point during the analysis.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55473/55473fig3.jpg\nFigure 3: Layout of the DAVID Analysis Wizard Webpage and Examples of Operation Outputs. The 'Analysis Wizard' web user-interface lists the tools used to analyze uploaded gene list for enrichment based on various parameters. Clicking on these tools reports the analyzed data in a new web page. Examples of the tabular reports generated from 'Gene Functional Classification', 'Functional Annotation Chart' and 'Functional Annotation Clustering' are shown as insets (arrows). Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/55473/55473fig3large.jpg]\nFunctional Annotation Tool 1: Functional Annotation Clustering\nClick on 'Functional Annotation Clustering' module to go to the summary page. Keep the default annotation categories and click on 'Functional Annotation Clustering' to generate clusters of similar annotation terms ranked by their enrichment score.\nClick on the hyperlinked name of each term to read details about it and 'RT' (related terms) to list other similar terms related to the category.\nClick on the purple bar to list the genes associated with a term and the red 'G' to list all the genes associated with all the terms within a cluster.\nClick on the green icon to see a two-dimensional view of all the genes and terms in a cluster.",
    "NOTE: The last three columns list the analytic and statistical results for each term. The results for this and all other analytics can be downloaded in a .txt format by clicking the 'Download File' link.\nFunctional Annotation Tool 2: Functional Annotation Chart\nReturn to the summary page and click on 'Functional Annotation Chart' to identify significantly overrepresented biological terms (e.g. transcription factor activity or kinase activity) associated with the gene list.\nClick on term name to get more detailed information and 'RT' (related terms) to list other related terms.\nClick on the purple bar to list all associated genes of corresponding individual category.\n\t\tNOTE: The last two columns list the statistical-tests' results for each category.\nFunctional Annotation Tool 3: Functional Annotation Table\nReturn to the summary page and click on 'Functional Annotation Table' to see a list of all the annotations associated with the genes on a list without any statistical calculations.\n\t\tNOTE: This tool can be useful for gene-by-gene analysis of a list or to look at specific, highly interesting genes.\nGene Functional Classification Tool\nReturn to 'Analysis Wizard' and click on 'Gene Functional Classification' module to segregate the input gene list into functionally-related groups of genes ranked as per their 'Enrichment Score', a measure of overall enrichment of the gene group in the list.\nClick on term name to get more detailed information and 'RG' to reveal functionally related genes of the gene group\nClick on the red 'T' (term reports) to list associated biology and the green icon to see a two-dimensional view of all the genes and terms.\nGene-name Batch Viewer\nReturn to 'Analysis Wizard' and click on 'Gene-name Batch Viewer' to translate 'Wormbase Gene IDs' into their corresponding gene names. (WBGene00022855 = tcer-1).\nClick on gene name to obtain more gene-specific information.",
    "Click on the 'RG' (related genes) link next to each gene to reveal genes predicted to be functionally related to the gene of interest.\n4. Uploading RAW Data onto the NCBI Sequence Read Archive (SRA)\nAccess the SRA webpage at Sign in to NCBI' link or register a new account.\nClick on 'Bioproject'.\nClick on 'Submission' under the 'Using Bioproject' heading on the left.\nSelect the option 'New Submission'. Update details of the submitter. Continue through the remaining seven tabs, filling in the details of the experiment and data being uploaded. Click 'Submit' when completed.\n\tNOTE: In the fifth 'Biosample' tab, leave the slot for 'Biosample' empty.\nRefresh the resulting page by clicking on the 'My Submissions' link. The submitted data will be listed with an assigned submission number, brief description and upload status.\nClick on 'Biosample' at the top of this page, in the 'start a new submission' box and create a 'new submission'. Submit separate submissions for each sample.\nAs in the case with 'Bioproject' in 4.4, update the details of the submitter and continue through the rest of the tabs filling in the details of each tab. Once completed review and click 'Submit'.\nNavigate to http://www.ncbi.nlm.nih.gov/sra[href=http://www.ncbi.nlm.nih.gov/sra] to create the final ‘Sequence Read Archive (SRA)’ submission.\nClick on 'Login to SRA' under 'Getting Started'.\nOn the next page click on the 'NCBI PDA' link. An 'Update Preferences' link will open up. Complete the form and click 'Save Preferences'.\nOn the resulting page, click on the 'Create New Submission' link. Enter a suitable name under 'Alias' and click 'Save'. A table with the submission ID and other details will be created.\nClick on 'New Experiment' and register at least one unique sequencing library for each 'BioSample'.",
    "Designate and link the previously created 'BioProject' and 'BioSample' submission ID's. A 'New Experiment' will be created.\nClick on 'New Run' at the bottom of the page after the SRA Experiment has been made and identify the data files that need to be linked to it.\nCompute the MD5 sum of each data file. To do this on a MacIntosh terminal, navigate to Applications/Utilities/Terminal. In terminal, type in 'md5' (without the quotes) followed by a space. Drag and drop the files that need to be uploaded into terminal from finder and click 'Enter'.\nTerminal will return an alphanumeric MD5 sum. Enter this as part of the submission process for the file upload. Use the username and password provided by the system to upload files using FTP.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}