{
  "id": 17579,
  "origin_website": "Jove",
  "title": "Refined CLARITY-Based Tissue Clearing for Three-Dimensional Fibroblast Organization in Healthy and Injured Mouse Hearts",
  "procedures": [
    "All experiments involving mice were approved by the Institutional Animal Care and Use Committee (IACUC) at Cincinnati Children’s Hospital Medical Center. The institution is also AAALAC (American Association for Accreditation of Laboratory Animal Care) certified. Mice were euthanized via cervical dislocation, and mice undergoing survival surgical procedures were given pain relief (see below). All methods used for pain management and euthanasia are based on recommendations of the Panel on Euthanasia of the American Veterinary Medical Association. All mice were housed in corn cob bedding units with water and food available at all times. Mice were housed 4 to a cage with the same sex. For surgery or uninjured tissue clearing, equal numbers of 6–8-week-old male and female mice were used.\nNOTE: Sterile surgical conditions were maintained in all surgeries. The surgeon changed into clean scrubs and a sterile gown and then donned shoe covers and a hairnet. The surgeon then scrubbed their hands with chlorhexidine and donned sterile surgical gloves. The surgeon was assisted by a technician who sedated, shaved, and scrubbed the incision site 3 times each, alternating between 2% chlorohexidine gluconate and 70% isopropanol. The mice were then brought to the surgeon, and surgery was performed. Between animals, the instruments were sterilized in a bead sterilizer.\n1. Cre recombination\nCross Rosa26-loxP-eGFP mice (Rosa26-nLacZ [FVB.Cg-Gt(ROSA)26Sortm1 (CAG-lacZ,-EGFP)Glh/J]) with Tcf21-MerCreMer mice (Figure 1A)6,21.\nWhen the offspring of this cross reach 6 weeks of age, administer an intraperitoneal injection of 75 mg/kg of tamoxifen dissolved in corn oil.22 Administer this tamoxifen twice, 48 h apart (Figure 1B).",
    "After tamoxifen injections, put the mice on a diet of tamoxifen food (~0.4 g/kg tamoxifen citrate) for one week. After one week of tamoxifen chow, return the mice to a normal autoclaved chow diet for one week before performing surgery (Figure 1B). Designate an appropriate number of mice (3 per surgical condition) to be uninjured controls. Sacrifice these mice, and proceed to the clearing process delineated below following the one week of normal chow diet.\nFollowing the tamoxifen regimen and recombination, perform surgery.\n2. Surgical models\nIschemia/reperfusion (I/R)23,24\nAnesthetize mice with 1.5% isoflurane gas in room air in a ventilated box; shave their chests and necks with electric clippers, and then scrub the shaved areas with a 2% chlorhexidine gluconate-soaked swab.\nUse artificial tear ointment to prevent dryness during surgery by placing ointment on the eyes of the sedated mice.\nPerform a mid-neck cut using surgical scissors to allow visualization of the trachea. Intubate with a 20 G catheter by placing the intubation tube into the trachea and visualize the tracheal catheter through the mid-neck incision. Place the mice on a ventilator while sedated with isoflurane gas (1.5%) in room air.\nMake an incision under the left front limb with surgical scissors, and cut the intercostal muscles between ribs 3 and 4. Spread the ribs open using a retractor.\nPlace a small sponge soaked in saline between the lung and the heart to prevent damage to the lung.\nUsing a fishhook needle (6.5 mm, 3/8 c), tie the left coronary artery with a releasable slip knot using 8-0 prolene.\nRemove the sponge using forceps.\nSuture the intercostal muscles closed using 4-0 braided silk and a continuous suture while also exteriorizing the end of the 8-0 prolene slip knot.",
    "Close the skin incisions using topical tissue adhesive with the end of the occluding slip knot protruding.\nAfter one hour of occlusion, pull the exterior end of the slip knot to internally release the coronary artery occlusion, relieving the ischemia and causing reperfusion.\nAdminister 0.02 mL of a 1 mg/mL extended release buprenorphine via subdermal injection (72 h release) as a pain reliever, and place the mice in an oxygenated incubation chamber at 37 °C, separate from other animals. Monitor the mice at least every 15 min until they have recovered from anesthesia and are able to maintain a sternal or sitting position. Return the mice to their regular housing.\nAssess the animals for pain and distress for 48 h following surgery, and monitor the incision site daily until fully healed.\nObserve the mice for hydration, nourishment, and overall well-being following surgery until sacrifice.\nMyocardial infarction (MI)25,26,27\nPerform steps 2.1.1–2.1.7.\nUse a continuous suture to close intercostal muscles using 4-0 braided silk.\nClose the skin incision using topical tissue adhesive.\nPerform steps 2.1.11–2.1.13.\nAngiotensin II/phenylephrine micro-osmotic pump infusion\n\t\nPrepare Prepare a 10 μg/μL working solution of angiotensin II and 500 μg/μL working solution of phenylephrine under sterile conditions (i.e., in a laminar flow hood) by adding 1 mg of angiotensin II to 100 μL of sterile phosphate buffered saline (PBS) and 250 mg of phenylephrine hydrochloride into 500 μL of PBS.\nCalculate the dilution of each working solution and final volume to dispense to the micro-osmotic pump based on mouse weight.\n\t\tNOTE: For instance, a 20 g mouse requires 20 g x 14 days x 1.5 μg/day = 420 μg angiotensin, or 42 μL of working solution, as well as 20 g x 14 days x 50 μg/day = 14000 μg phenylephrine hydrochloride, or 28 μL of working solution.",
    "For the weight of each mouse, dilute the working stock of the drug in sterile PBS and fill the micro-osmotic pumps (0.25 μL/h, 14 days, approximately 100 μL) using a 27 G needle and 1 mL syringe.\n\t\tNOTE: This will generate a flow rate of 1.5 μg∙g-1∙day-1 of angiotensin II and 50 μg∙g-1∙day-1 of phenylephrine hydrochloride once placed in the mice.\nAnesthetize the mice with 1.5% isoflurane inhalation (to effect) in a ventilated chamber containing room air.\nPlace the anesthetized mice on a sterile surgical table in the opine position, and maintain anesthesia with isoflurane gas inhalation (1.5%) through a nose cone.\nUse artificial tear ointment on the animal’s eyes to prevent dryness during surgery.\nShave the fur over the implantation area with electric hair clippers, and sterilize the area to be cut using ethanol and a sterile swab. Make a small incision (approximately 1 cm) with surgical scissors in the epidermal layer of the mouse skin on the right lateral side of the back, below the shoulder blade. Use the dull sides of a pair of surgical scissors to gently stretch the skin in and around the area of implantation to insert the minipump.\nPlace the micro-osmotic pump within the incision, and physically maneuver it to the left of the dorsal midline of the mouse by manually massaging the pump under the skin.\nClose the incision via continuous suture using 4-0 silk with a taper point needle.\nFollowing pump implantation, administer slow release buprenorphine at a dose of 0.1 mg/kg body weight via subdermal injection for analgesia (72-h slow release). Place the mice in an oxygenated incubation chamber at 37 °C, separate from other animals. Monitor the mice at least every 15 min until they recover from anesthesia and can maintain a sternal or sitting position.",
    "Upon recovery from anesthesia in the 37 °C warming chamber, place the mice back in their standard housing units.\nMonitor the mice for pain and distress for 48 h following surgery, and monitor the incision site daily until fully healed.\nObserve the mice for hydration, nourishment, and overall well-being following surgery until sacrifice.\n3. Clearing adult mouse hearts using a modified active CLARITY protocol\nPrepare a clean surgical area by sterilizing the surgery surface and all surgical tools with 70% ethanol. Prepare a solution of cold 1x PBS and 4% paraformaldehyde (PFA) in PBS (100 mL each). Wear gloves, lab coat, face mask, and eye protection.\nPrepare heparin buffer by diluting 10 units of heparin in 0.9% w/v sodium chloride solution. Inject each mouse intraperitoneally with 60 μL of heparin-NaCl using a 1 mL syringe and 27 G needle.\nFive minutes after the injection of heparin-NaCl solution, anesthetize the mice using 1.5% isoflurane inhalation (to effect) in a ventilated chamber containing room air.\nEuthanize the mice by cervical dislocation, wherein the back of the head is held with the flat, closed end of forceps, while the spinal column is dislocated by pulling the tail.\nClean the ventral surface of the mouse with 70% ethanol on a cotton swab. Make a 3 cm transverse incision approximately 3 cm below the xiphoid process using surgical scissors.",
    "Separate the skin from the underlying abdominal wall tissue by degloving the abdomen up to the xiphoid process (hold the skin closest to the tail and pull the skin closest to the head up toward the ribcage). Make a 2 cm transverse incision in the subcutaneous abdominal wall tissue 3 cm below the xiphoid process using surgical scissors. Make a vertical cut from this transverse incision, up the midline and through the ribcage. Pin the ribcage back, exposing the heart.\nUse a 27 G needle and 10 mL syringe to inject cold PBS into the superior vena cava and aorta (any positional manipulation of the heart should be done carefully with blunt forceps to avoid puncture) to clear blood from the heart.\n\tNOTE: Sufficient perfusion can be noted by tail twitch and discoloration of the lungs.\nUse a 27 G needle and 10 mL syringe to inject cold 4% PFA into the superior vena cava and aorta to begin the fixation process.\nExcise the hearts. The atria, right ventricle and septum, and left ventricle should be separated using a straight-blade scalpel. Place this tissue into a 15 mL centrifuge tube filled with cold 4% PFA, and place on a nutator at 4 °C overnight.\nWash the heart 3 times for 1 h each with cold 1x PBS to remove excess PFA.\nPrepare the hydrogel (termed A4P0 for relative acrylamide/polyacrylamide composition) by mixing the following chemicals in a 15 mL centrifuge tube: 10% of 40% acrylamide, 10% 1x PBS, 80% distilled water.\nAdd the 0.25% solution of the photoinitiator (2,2-Azobis[2-(2-imidazolin-2yl)propane)dihydrochloride) to the hydrogel solution just prior to submerging the heart in the hydrogel.\nPlace the heart in a conical tube containing the hydrogel. Wrap the conical tube in foil, and incubate overnight at 4 °C without physical disturbance.",
    "After approximately 14 h at 4 °C, move the conical tube containing the heart to a 37 °C bead bath.\nAfter 2.5 h in the bead bath, remove the heart from the hydrogel carefully with forceps.\nWash the hearts 3 times for 1 h each in a 15 mL conical tube containing 1x PBS at 37 °C on a nutator.\nPlace the hearts in the basket of the active electrophoresis machine using forceps, and place the lid on basket. Ensure that the lid is securely in place.\nFill the active electrophoresis chamber reservoir with electrophoretic clearing solution by pouring solution into the chamber.\nOnce the chamber is full of electrophoretic clearing solution, the basket containing the heart can be submerged. Place the cap on the electrophoresis machine securely.\nRun the electrophoresis machine at 1.5 A, 37 °C for 1.5 h.\nFollowing 1.5 h of electrophoresis, check the hearts visually to ensure that no opaque tissue remains. If regions of the tissue are still opaque, re-submerge the heart in electrophoresis solution in the electrophoretic chamber, and continue electrophoresis for 0.5 h at a time.\n\tNOTE: Electrophoresis should be discontinued at first signs of tissue damage (such as tissue fraying).\nWash the hearts in 15 mL conical tube containing 1x PBS for 1 h, 3 times each, at 37 °C on a nutator.\nSubmerge the hearts in a 15 mL conical tube containing N,N,N′,N′-Tetrakis(2-Hydroxypropyl)ethylenediamine—a decolorizing agent that reduces heme autofluorescence.\n\tNOTE: This solution should be changed every 24 h until the hearts are completely clear (approximately 2 days).\nWash the hearts in a 15 mL conical tube with 1x PBS 3 times for 1 h each to remove excess decolorizing agent.",
    "Prepare Refractive Index Matching Solution (RIMS) by combining 30 mL of 0.02 M phosphate buffer, 40 g of 5-(N-2, 3-dihydroxypropylacetamido)-2, 4, 6-tri-iodo-N, N'-bis (2, 3 dihydroxypropyl) isophthalamide with stirring (must be completely dissolved—this can take up to an hour), 5 mg of sodium azide, 50 µL of Tween20, and 1 g of 1,4-diazabicyclo[2.2.2]octane, and adjust the pH to 7.5.\nEquilibrate the hearts in RIMS for 48 h prior to imaging.\n4. Imaging cleared hearts using an upright single photon confocal microscope\nNOTE: The imaging apparatus consists of the bottom half of a 10 cm glass Petri dish, a 3D printed bottom reservoir, a round glass coverslip, and a 3D printed top reservoir (Figure 1C–E). 3D printed materials were made in-house by the Cincinnati Children’s Hospital Clinical Engineering Department.\nUse vacuum grease to seal the 3D printed bottom reservoir into a glass Petri dish by putting a thin layer of vacuum grease onto the bottom of the 3D printed piece (Figure 1C).\n\tNOTE: The reservoir should be the same height as the sample being imaged (i.e., the sample should not be compressed by the glass coverslip placed on top of it, and the sample also should not be able to float and move within the reservoir).\nFill the reservoir with RIMS, and remove all bubbles with a pipet tip. Place the heart in the RIMS carefully with the left ventricular wall facing up, ensuring that no bubbles are introduced into the solution.\nAdhere a glass coverslip to the bottom surface of the 3D printed top reservoir piece (Supplemental Figure 1A) using vacuum grease (again by placing a thin layer of vacuum grease onto the 3D printed piece, and placing it onto the cover slip) (Figure 1D).",
    "Place the glass coverslip and top reservoir, coverslip side down, onto the bottom reservoir (Supplemental Figure 1B), without the introduction of bubbles. The adhesion between the RIMS and cover slip will provide a seal between the top and bottom reservoir pieces (Figure 1E).\nFill the top reservoir with glycerol for use with a 10x glycerol immersion objective.\nUse a single photon microscope outfitted with a multiphoton confocal scan head to image the cleared hearts.\nLower the stage of the single photon microscope, and place the Petri dish containing the sample in the center of the stage. Raise the stage and lower the 10x glycerol immersion objective into the glycerol in the top reservoir of the sample apparatus. Ensure that the sample is in focus by looking at the edge of the sample using the eyepieces.\nSwitch from eyepiece view to camera view on the computer by clicking on the live button.\n\t\nSet the X and Y parameters by first locating the widest part of the tissue sample, which should be at the bottom of the Petri dish.\nClick on ND Acquisition and custom multipoint. Create multipoints by first finding the middle of the tissue sample by using the joystick to sweep left to right and top to bottom.\nThen, based on the size of the tissue, determine the tiling size needed (typically 6 x 5 for a 6–8-week-old mouse heart). Do this by running test imaging by only capturing X and Y parameters (uncheck z under the ND Acquisition tab) to check whether the entire length and width of the tissue were captured.\nTo set z parameters, open the XYZ navigation, and click on the up and down icons until finding the top and bottom of the sample.",
    "Open the Z intensity correction panel and adjust the fluorescence at the top, middle, and bottom of the tissue to correct for tissue density by increasing or decreasing the laser power at each z point. Set these by clicking on the set arrow at the right of the Z Intensity Correction panel.\nSet the Z step size in the ND Acquisition panel to 5 μm.\nAfter the X, Y, and Z parameters of the heart are delineated and z-intensity correction is set, use the automated upright microscope with a 10x glycerol immersion objective with a resonant scanner and gallium arsenide phosphide photomultiplier tubes (GaAsP PMTs) to image the cleared hearts. Ensure that the XY and Z tabs are checked under ND acquisition, and press Run Z correction.\nStitch, unmix, and denoise the resulting images by opening the multipoint image in the processing software and clicking on the stitch button. Under image, click on blind unmixing, 2 channel, and then find. and Under image, click on denoise.ai, then click on the fluorescent channel of choice (i.e., GFP).\n\tNOTE: This process results in a 3D image of GFP-positive fibroblasts in the entire left ventricle.\nUse secondary analysis software to further identify patterns and trends in the dispersion of cardiac fibroblasts. Use the Spots function by running the spots wizard program.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}