{
  "id": 15349,
  "origin_website": "Jove",
  "title": "Engineering Artificial Factors to Specifically Manipulate Alternative Splicing in Human Cells",
  "procedures": [
    "1. Construction of a PUF Scaffold with Customized RNA-binding Specificity by Overlapping PCR\nDesign a series of PCR primers containing the PUF sequences that specifically recognize different RNA nucleotides in each position12 (see Table 1 for the primer sequences and see Figure 1A for the RNA:PUF recognition code). For each PUF repeat, design four different primers to recognize a different base on each position.\n\tNOTE: These primers will be used in a series of four rounds of PCR reactions to generate PUF fragments that are joined together (Figure 1B).\nSelect the recognition site of the target gene near the alternative splice site.\n\tNOTE: This site can be decided by the user, and it usually is chosen within 10 - 50 nt from the alternative splice sites.\nRound 1: Generate coding sequences for 4 PUF repeats, universal bridge fragments, and cap fragments.\n\t\nUse the target site to define the recognition code for each repeat of the customized PUF. Select the set of PCR primers for PUF repeats 1 - 8. Conduct four consecutive rounds of PCR to produce a customized PUF domain, as described below (Figure 1B).\nIn the first round of PCR, set up standard PCR reaction mixtures (containing 2.5 µL of 10x buffer, 0.5 µL of 10 mM dNTPs, 0.5 µL of 10 µM forward and reverse primers, 50 ng of the DNA template (human cDNA or expression vector of WT PUF domain), and 0.5 U high-fidelity DNA polymerase in a 25 µL final volume).\n\t\tNOTE: These reactions will produce DNA sequences corresponding to each PUF repeat, to universal bridge fragments, and to two cap fragments with different restriction sites (Figure 1B). A brief list of templates, primers, and generated PCR products used in this step are shown in Table 2.",
    "Set the PCR program as follows: 5 min at 95 °C; 28 cycles of 30 s at 95 °C, 30 s at 55 °C, and 15 s at 72 °C; and 5 min of incubation at 72 °C. Use high-fidelity DNA polymerase to minimize point mutations during PCR.\nRound 2: Generate coding sequences for R1/R2/R3/R4 (R1 - 4) and R5/R6/R7/R8 (R5 - 8).\n\t\nSeparate the PCR products obtained in step 1.3.3 using electrophoresis with a 1.5% agarose gel (25 min at a constant voltage of 120 V). Gel-purify all products of the expected size using a gel purification kit. Use a different mixture of these products as the template in the following rounds of PCR.\n\t\tNOTE: Mix the three PCR products in roughly a 1:1:1 ratio. They usually do not need to be quantified, as long as the intensity of each product looks similar in the gel.\nMix about 5% of the purified PCR products as a template in the next round of PCR. Alternatively, quantify the purified PCR products using a UV-Vis spectrophotometer and use 15 ng of each PCR product in the template mixture.\nUse purified PCR products R1/R2, R3/R4, and Bridge 2/3 as mixed templates and R1-F and R4-R as primers. Set up the PCR reaction as described in step 1.3 to obtain overlapping PCR product R1 - 4.\nUse purified PCR products R5/R6, R7/R8, and Bridge 6-7 as mixed templates and R5-F and R8-R as primers to obtain overlapping PCR product R5-8 (Figure 1B). Set the PCR program as follows: 5 min at 95 °C; 28 cycles of 30 s at 95 °C, 30 s at 55 °C, and 30 s at 72 °C; and 5 min at 72 °C. Gel-purify R1-4 and R5-8.\nRound 3: Generate coding sequences for R1/R2/R3/R4/R5/R6/R7/R8 (R1 - 8 without caps).",
    "In the third round of PCR, using the purified R1-4, R5-8, and Bridge 4/5 as mixed templates and R1-F and R8-R as primers, set up the PCR reaction as described in step 1.3 to obtain overlapping PCR product R1-8 without caps.\nSet the PCR program as follows: 5 min at 95 °C; 28 cycles of 30 s at 95 °C, 30 s at 55 °C, and 55 s at 72 °C; and 5 min at 72 °C. Gel-purify the R1-8 without caps.\nRound 4: Generate coding sequences for complete PUF domains.\n\t\nIn the last round of PCR, using the purified R1-8 without caps and 5'-end and 3'-end caps as mixed templates and Cap-F and Cap-R as primers, set up the PCR reaction as described in step 1.3 to obtain the final mutated PUF domains.\nSet the PCR program as follows: 5 min at 95 °C; 28 cycles of 30 s at 95 °C, 30 s at 55 °C, and 1 min at 72 °C; and 5 min at 72 °C.\nGel-purify the PCR products of the final reprogrammed PUF domains. Use these products for the construction of the ESF expression plasmid in the subsequent steps. Sequence the final construct to verify the reprogrammed sequences of PUF domains.\n\t\tNOTE: Cap-F encodes NLS (PPKKKRKV) between BamHI and XbaI sites and Cap-R encodes a stop codon and the SalI site (restriction sites were designed for constructing expression vectors of ESFs, Figure 1C).\n2. Construction of a Functional Module of ESFs\nTwo strategies are commonly used to clone functional modules of ESFs (RS domains or Gly-rich domains): to amplify these domains by PCR using total human cDNA as a template (step 2.2) or to directly synthesize the DNA fragments that code for different RS or Gly-rich domains (step 2.3).",
    "Use PCR to clone RS domains from residues 123 - 238 of 9G8 (NP001026854), residues 180-272 of SRP40 (NP008856), or residues 117 - 221 of SC35 (NP003007). Clone Gly-rich domains from residues 195 - 320 of hnRNP A1 (NP_002127), residues 203 - 353 of hnRNP A2 (NP112533), or residues 211 - 378 of hnRNP A3 (NP919223).\n\t\nUse the NCBI primer design tool (http://www.ncbi.nlm.nih.gov/tools/primer-blast/) or Primer3 (http://frodo.wi.mit.edu/primer3/) to design primers for cloning RS domains or Gly-rich domains (functional module of ESFs).\n\t\tNOTE: The forward primer contains an N-terminal FLAG tag after the NheI site. The reverse primer contains a BamHI site for cloning into expression vectors (Figure 1C).\nSet up the standard PCR reaction, as described in step 1.3, to amplify the RS or Gly-rich domains. Set the PCR program as follows: 5 min at 95 °C; 28 cycles of 30 s at 95 °C, 30 s at 55 °C, and 30 s at 72 °C; and 5 min at 72 °C.\nClone RS domains or Gly-rich domains through direct DNA synthesis. Instead of generating PCR products that encode for the effector domains in step 2.2, synthesize an oligonucleotide that encodes a short-fragment RS domain (RSRSRSRSRSRS) or a Gly-rich domain (GYGGGGPGYGNQGGGYGGG) using a commercial source of DNA oligonucleotides.\n3. Construction of ESF Expression Plasmids\nConstruct ESF expression plasmids using any expression vector.\n\tNOTE: An expression construct pGL-Gly-MS2 (a gift from Dr. R. Breathnach from the Institute de Biologie-CHR11) was originally used, which encodes from the N- to the C-terminal, a FLAG epitope, a Gly-rich domain of hnRNP A1, and the MS2 coat protein. Therefore, this expression construct is used as an example in the following step.\n\tNOTE: Other expression vectors with multiple cloning sites can also be used, and the standard cloning steps will be applied to join the fragments together.",
    "Digest 1.5 µg of the expression plasmids (pGL-Gly-MS2) mentioned in step 3.1 to remove the MS2 coat protein fragment. Use the restriction endonucleases BamHI and SalI for 1 h at 37 °C. Digest the recognition module of ESFs (encoding an NLS and reprogrammed PUF domains, generated in step 1.5) with BamHI and SalI in same condition.\nAdd 5x loading dye to the restriction digest reactions and slowly electrophorese the total volume with a 1.5% agarose gel containing a DNA gel stain for 40 min at 120 V. Gel-purify the digested products.\nPrepare 10 µL ligation reactions with a purified recognition module of ESF inserts and expression vector DNA in a 3:1 ratio, 1 µL of DNA ligase, and 1 µL of 10x ligation buffer. Incubate the ligation reactions overnight at 4 °C; the resulting construct expresses a Gly-PUF-type ESF (pGL-Gly-PUF) under the control of a CMV promoter (Figure 1C).\nRemove the fragment encoding the FLAG/Gly-rich domain with NheI and BamHI digestion for 1 h at 37 °C. Replace it with a fragment that encodes the RS domain (generated in step 2.2, also digested by NheI and BamHI); the resulting construct expresses an RS-PUF-type ESF (Figure 1C).\n4. Construction of the Splicing Reporter\nSynthesize oligonucleotides containing the candidate sequences (i.e. target sequences of PUF domains) flanked by XhoI and ApaI sites or XhoI and EcoRI sites. Anneal the oligonucleotides for 5 min at 55 °C to obtain double-stranded inserts containing the recognition sites of PUF domains flanked by the cohesive ends of XhoI and ApaI or XhoI and EcoRI sites.\nStart from a previously described modular splicing reporter22, pGZ3, which contains two GFP exons separated by a test exon (exon 12 of the human IGF2BP1, Ensembl ID ENSG00000159217) and its flanking introns.",
    "NOTE: The test exon was engineered with XhoI and ApaI sites, which can be used to insert synthesized oligonucleotides containing the candidate sequences (target sequences of PUF domains). This modular splicing reporter (pGZ3) is provided through the plasmid repository Add-gene.\nDigest the base reporter pGZ3 (prepared in step 4.2) with the XhoI and ApaI restriction endonucleases for 1 h at 37 °C.\nGel-purify the digested products as described in step 3.3.\nPrepare 10 µL of ligation reactions with the double-stranded inserts generated at step 4.1 and the digested pGZ3 vector generated at step 4.4 in a 3:1 molar ratio, 1 µL of DNA ligase, and 1 µL of 10x ligation buffer. Incubate the ligation reactions overnight at 4 °C to obtain the constructing splicing reporter vector pGZ3.\nInsert the double-stranded inserts generated in step 4.1 into the previously published reporters, pEZ-1B (using XhoI and EcoRI sites) and pEZ-2F (using XhoI and ApaI sites)23, to obtain the competing 5' ss reporter and the competing 3' ss reporter, as described in steps 4.3-4.5.\n\tNOTE: Both types of splicing reporters will be available through Add-gene.\n5. Construction of Lentiviral Expression Vectors for ESF\nSet up the standard PCR reaction as described in step 1.3 to amplify the full-length ESFs from the original expression vectors (pGL-Gly-PUF or pGL-RS-PUF) with primers containing MluI/SpeI sites. Set the PCR program as follows: 5 min at 95 °C; 28 cycles of 30 s at 95 °C, 30 s at 55 °C, and 1.5 min at 72 °C; and 5 min at 72 °C.\nThrough a digestion reaction, gel purification, and ligation reaction, integrate the ESFs into the lentiviral expression vector, pWPXLd, between the MluI/SpeI sites, as described in steps 3.2-3.4.",
    "Use the standard calcium phosphate precipitation method, as previously reported24, to generate lentiviruses by cotransfecting HEK293T cells by packaging the vectors, psPAX2 and pMD2.G, with either pWPXLd-Gly-PUF(Bcl-x), pWPXLd-Gly-PUF(wt) (as a specificity control), or pWPXLd-GFP (mock).\n\t\nSeed 5x106 HEK293T cells into 10 cm dishes and grow the cells overnight in 10 mL of Dulbecco's Modified Eagle's Medium (DMEM) supplemented with 10% Fetal Bovine Serum (FBS) per dish in a humidified incubator at 37 °C and 5% CO2. Perform the transfection when the cells are 70 - 90% confluent.\nPrepare the plasmid mixture by adding the three plasmids (7.5 µg of the packaging vector, psPAX2; 2.5 µg of pMD2.G; and 10 µg of either pWPXLd-Gly-PUF(Bcl-x), pWPXLd-Gly-PUF(wt), or pWPXLd-GFP) to a 2 mL tube.\nAdd 560 µL of 0.25 M CaCl2 and 560 µL of 2x BBS solution to the 2-mL tube. Mix gently several times and incubate it for 15 min at RT to prepare the transfection mixture.\nAdd all the transfection mixtures to the 10-cm dishes. Swirl the dishes gently and incubate them overnight at 3% CO2 and 37 °C.\nRemove the medium, add 10 mL of fresh DMEM with 2% FBS to each dish, and incubate them at 10% CO2 and 37 °C O/N.\nCollect the first supernatant from the dishes. Add 10 mL of fresh DMEM with 2% FBS to each dish. Incubate the dishes O/N at 10% CO2 and 37 °C. Store the supernatant at 4 °C.\nCollect the second supernatant from the dishes. Pool the supernatant from the first and second harvests. Clear the supernatant of cell debris by filtering it through a 0.4-µm filter. Use the cleared supernatant directly or store it at -80 °C.\nDetermine the titer of the lentivirus by infecting HEK293T cells with serial dilutions of the virus preparation, as previously reported25.",
    "6. Specifically Modulating Exon Inclusion and the Alternative Use of Splice Sites with ESFs\nSeed 2 x105 HEK293T cells into each well of a 24-well plate. Grow the cells overnight in 500 µL of DMEM supplemented with 10% FBS in a humidified incubator at 37 °C and 5% CO2.\nMix the liposomal transfection reagent by gently inverting the bottles before use. Dilute 2 µL of liposomal transfection reagent in 50 µL of reduced serum medium. Mix gently and incubate them for 5 min at RT.\nDilute 0.04 µg of pGL-Gly-PUF expression vectors and 0.2 µg of pGZ3 reporter plasmids in 50 µL of reduced serum medium in a sterile tube. Dilute 0.4 µg of pGL-RS-PUF expression vectors and 0.2 µg of pGZ3 reporter plasmids in 50 µL of reduced serum medium in a sterile tube. Dilute 0.4 µg of pGL-RS-PUF expression vectors and 0.2 µg of pEZ-1B or pEZ-2F reporter plasmids in 50 µL of reduced serum medium in a sterile tube.\nAfter 5 min of incubation at RT, gently mix the diluted liposomal transfection reagent prepared in step 6.2 with the diluted plasmids prepared in step 6.3. Incubate the mixture for 20 min at RT.\nAdd the entire transfection mixtures containing the expression vectors and transfection reagent prepared in step 6.4 to each well and incubate for at least 12 h in a humidified incubator at 37 °C and 5% CO2.\nAfter 12 h in a humidified incubator at 37 °C and 5% CO2, discard the medium from each well and wash them with 500 µL of Phosphate-buffered Saline solution (PBS)/well.",
    "Discard the PBS and add 200 µL of trypsin to each well. Incubate the plate in a humidified incubator at 37 °C and 5% CO2 for 5 min. Add 1 mL of the medium to stop the digestion and transfer the cells to a sterile 1.5 mL tube.\nCentrifuge the tubes for 3 min at 5,000 x g and discard the medium. Add 0.5 mL of RNA extraction buffer per tube to lyse the cells by repetitive pipetting. Incubate the homogenized samples for 5 min.\nFor each RNA extraction buffer-treated sample, add 0.1 mL of chloroform per 0.5 mL of RNA extraction buffer. Invert the tubes for 15 s and incubate them for 3 min at RT.\nCentrifuge the tubes for 15 min at 12,000 x g and 4 °C. Transfer the aqueous phase to a fresh tube. Add 0.25 mL of isopropanol per 0.5 mL of RNA extraction buffer used for the initial homogenization.\nMix by vortexing and incubate them at RT for 10 min. Centrifuge the tubes at 12,000 x g for 10 min at 4 °C. After centrifugation, the RNA precipitate is usually visible on the bottom of the tube.\nDiscard the supernatant and wash the RNA pellet with 0.5 mL of 75% ethanol per 0.5 mL of RNA extraction buffer.\nVortex vigorously and centrifuge it at 7,500 x g for 5 min at 4 °C. Remove the supernatant and dry the RNA pellet. Dissolve the RNA in 50 µL of RNase-free water.\nAdd 2 µL of 5U/µL DNase I, 7 µL of 10x buffer, and 11 µL of H2O to each 50-µL RNA solution. Incubate the tubes at 37 °C for 1 h. Heat them at 70 °C for 15 min to inactivate the DNase.",
    "For each sample, add the following components to a 0.2 mL nuclease-free tube: 1 µL of 50 µM oligo dT, 5 µL of 400 ng/µL RNA (2 µg), 1 µL of 10 mM dNTP, and 3 µL of H2O. Perform the reverse PCR.\n\t\nHeat the mixture to 65 °C for 5 min and incubate it on ice for at least 2 min to prevent the reformation of the secondary structure. Add the following components to the same tube: 4 µL of 5x first-strand buffer, 1 µL of 0.1 M DTT, 1 µL of 200 U/µL reverse transcriptase, and 4 µL of H2O. Mix by pipetting gently up and down and incubate at 50 °C for 60 min. Stop the reaction by heating it at 70 °C for 15 min.\nFor each sample, add the following components to a PCR tube in order to complete the body-labeled PCR: 2.5 µL of 10x PCR buffer, 0.5 µL of 10 mM dNTP mix, 1 µL of 10 µM forward primer, 1 µL of 10 µM reverse primer, 0.25 µL of 5 U/µL Taq DNA polymerase, 0.5 µL of 25 nM Cy5-dCTP, and 2 µL of the cDNA prepared in step 6.15.\n\t\nHeat the reaction to 94 °C for 2 min to denature the molecules, perform 25 cycles of PCR (94 °C for 30 s, 60 °C 30 s, and 72 °C 30 s), keep the reaction at 72 °C for 7 min, and then leave it at a 4 °C hold.\nResolve the PCR products by electrophoresis through a 10% polyacrylamide gel with a 1x Tris base, Boric acid, and EDTA (TBE) buffer. Perform a scan using a fluorescence scanner. Measure the amount of each splicing isoform using a densitometry software.",
    "7. Use ESF to Modulate Endogenous Bcl-x Splicing and Measure Its Effects on Apoptosis\nPlate 2 x 105 HeLa cells to each well of a 24-well plate. Grow the cells overnight in 500 µL of DMEM supplemented with 10% FBS in an incubator at 37 °C and 5% CO2.\nAfter 12 h, transfect the cells with 2 µg of pGL-Gly-PUF(WT) or 0.2 µg, 1 µg, and 2 µg of pGL-Gly-PUF(531) (a reprogrammed PUF domain that recognizes Bcl-x pre-mRNA with high affinity, see Figure 2A) .\n24 h later, harvest the cells. 1/3 of the cells are for the RNA isolation and PCR analysis (steps 6.8 - 6.17) and 2/3 are for the protein isolation.\nFor the Western blot analysis, boil the total cell pellets in 2X Sodium Dodecyl Sulfate-PolyAcrylamide Gel Electrophoresis (SDS-PAGE) loading buffer for 10 min, and then resolve the proteins in a 12% SDS-PAGE gel. Transfer the proteins onto a nitrocellulose membrane.\nBlock the membrane with 5% milk for 1 h at RT and incubate the membrane O/N with Caspase-3 (1:1,000), PARP (1:1,000), or beta-actin (1:5,000) primary antibodies (diluted in 5% milk) at 4 °C.\nWash the membrane with PBS containing 0.1% Tween 20 (PBS-T) for 5 min at RT 3x on a rocking shaker. Incubate the membrane with HRP-linked antibodies (1:5,000, diluted in 5% milk) for 1 h at RT.\nWash the membrane with PBS-T 3x at RT, and then develop the membrane using ECL Western blotting detection reagents.",
    "Add 250 µL of poly-L-Lysine (PLL) onto coverslips, incubate them for 15 min at RT, and siphon off the liquid. Wash the PLL-coated glass coverslips with PBS 3x for 5 min each. For the immunofluorescence assay measuring apoptosis, seed 5 x 105 HeLa cells onto poly-lysine-coated glass coverslips in a 6-well plate. Transfect pGL-Gly-PUF(WT) or pGL-Gly-PUF(531) plasmids into the HeLa cells using a liposomal transfection reagent (see steps 6.1 - 6.5).\n24 h after the transfection, fix the cells on the coverslips with 1 mL of 4% paraformaldehyde (PFA) in 1x PBS for 20 min at RT. CAUTION: PFA is toxic; handle it with care in a fume hood.\nGently wash the cells on the coverslips by adding 2 mL of 1x PBS. Incubate them for 5 min. Remove the PBS with pipettes. Repeat the wash 3x.\nPermeabilize the cells with 0.2% Triton X-100 in 1x PBS for 10 min, and then wash them 3x with 1x PBS.\nBlock the cells with 3% Bovine Serum Albumin (BSA) in 1x PBS for 10 min and wash them 3x with 1x PBS.\nDilute the FLAG antibody 1:1,000 in 3% BSA/PBS and pipet 30 µL of the diluted FLAG antibody onto a parafilm sheet.\nTake out the coverslip with the cells, carefully dry the excess buffer with lab wipes, and put it upside-down (cell-side down) on the 30 µL anti-FLAG solution. Incubate it for 1 h at RT.\nAdd about 500 µL of 1x PBS to the side of the coverslip incubated with the primary antibody until the coverslip floats on top of the solution. Return it to the 6-well plate with 1x PBS in the wells.\nWash it 3x with 1x PBS for 5 min each.",
    "Dilute the anti-mouse secondary antibody (1:500) in 3% BSA/PBS; again, use 30 µL for each coverslip. Put the coverslip upside-down on the secondary antibody solution and incubate it for 15 min at RT.\nRemove the coverslip from the parafilm, as described in step 7.15. Put it back into the 6-well plate and wash it with 1x PBS 3x for 5 min each.\nMount the coverslips with mounting medium (with DAPI), remove the excess medium, and seal the edge with nail polish.\nVisualize the cells using a fluorescence microscope (at 100X magnification) and photograph them using a digital camera.\n\tNOTE: The expression of ESF is visualized by the fluorescence-labeled secondary antibody against the FLAG tag, and the nuclear fragmentation is visualized using DAPI staining.\n8. Measure the Apoptosis of Different Cancer Cells Expressing ESF\nSplit 2 x 106 HeLa cells, MDA-MB-231 cells, and A549 cells into 60-mm dishes with 4 mL of DMEM supplemented with 10% FBS in an incubator at 37 °C and 5% CO2 to detect apoptosis with Propidium Iodide (PI) staining.\n24 h later, refresh the medium and prepare the lentivirus, as previously reported24.\nDilute 10 x 106 lentivirus pWPXld-Gly-PUF(WT), pWPXld-Gly-PUF(531), or pWPXld-GFP stocks into 4 mL of fresh medium to make the ratio of virus to cell number equal to 5.\nChange the medium in the plates to 4 mL of the virus-containing medium prepared in step 8.3 and incubate the plates in an incubator at 37 °C and 5% CO2. 12 h after the infection, change the medium.\nAfter 24 h of infection, collect and stain the cells for 5 min in a PBS solution containing a final concentration of 2 µg/mL PI.\nAnalyze the PI-stained cells with a flow cytometer, as described previously16.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}