{
  "id": 10978,
  "origin_website": "Jove",
  "title": "A Novel Method for Localizing Reporter Fluorescent Beads Near the Cell Culture Surface for Traction Force Microscopy",
  "procedures": [
    "Fabricating and functionalizing PA gels of varying stiffnesses with fluorescent microspheres embedded near the cell culture surface.\n1. Functionalizing the Top Glass Cover Slips\nClean glass cover slips (#1.0, 12 mm diam.) with soap and water, followed by ethanol to remove extraneous dust.\nPlace glass cover slips on a grated surface (i.e. pipette tip holder) such that they are not touching to facilitate ease of interaction with the coverslips.\nCoat the entire surface of the cover slips with Poly-D-Lysine (0.1 mg/ml) for 1 hr (Figure 1A).\nDuring this time, perform a 1:10,000 dilution of the colloid solution of 0.1 μm diameter, red fluorescent microspheres with deionized (DI) water to obtain a particle density of approximately 1 microsphere per 20 μm2 on the gel surface. See Figure 2 for the results of various dilutions. This dilution can be modified to meet the need of specific experiments.\nPlace the diluted solution in an ultrasonic water bath for 30 min.\nAfter 1 hr, use tweezers to carefully lift each cover slip and blow dry with air. Return the dry cover slips to the grated surface.\nRemove the diluted colloid solution from the ultrasonic bath and pipette 150 μl onto each cover slip. Leave for 10 min (Figure 1B).\nUse tweezers to carefully lift each cover slip and blow dry with air. Return the dry cover slips to the grated surface and store in the dark until ready to use.\n2. Preparing PA Gel Directly on Glass Bottom Petri Dishes\nPreheat hotplate to 100 °C.\nLay out the desired number of glass bottom Petri dishes (35 mm dish with 14 mm micro-well, #1.0) on a flat surface in a chemical fume hood.",
    "Cover the glass portion of each Petri dish micro-well with 97% 3-aminopropyl-trimethoxysliane (3-APTES) for 7 min for chemical activation. Take caution to avoid inadvertent dripping of the 3-APTES to the surface of the plastic in the Petri dish to avoid degradation of the polystyrene.\nAfter 7 min, fill the Petri dish with DI water and dispose into waste container.\nRepeat step 2.4 3x for each dish, and then shake the Petri dish to remove extra water. Place the Petri dishes on the hot plate until the glass portion is dry.\nRemove the Petri dishes from the hot plate and return to a flat surface in a chemical fume hood.\nIn a chemical fume hood, make a solution of 0.5% glutaraldehyde and cover the glass portion of each Petri dish well with the solution for 30 min. Take caution to avoid inadvertent dripping of the glutaraldehyde to the surface of the plastic in the Petri dish to avoid degradation of the plastic.\nAfter 30 min, fill the Petri dish with DI water and dispose into waste container to rinse and remove the glutaraldehyde.\nRepeat step 2.4 3x for each dish, and then shake the Petri dish to remove extra water. Place the Petri dishes on the hot plate until the glass portion is dry.\nBefore mixing the components of the PA gel solution, move the functionalized glass slides into the chemical fume hood such that they are easily accessible, allowing for the quick sandwiching of the gel with the glass bottom Petri dishes after mixing the gel solution.\nIn a 15 ml centrifuge tube, mix 40% bisacrylamide, 2% acrylamide, and acrylic acid in immediate succession in the concentrations listed in Table 1 (adapted from published protocol10) to achieve the desired matrix elasticity.",
    "Add 100 mM HEPES, 10% ammonium persulfate, and TEMED in quantities listed in Table 1 corresponding to desired matrix elasticity to complete the gel solution.\nImmediately pipette 15 μl of gel solution onto the center of the glass portion of the petri dishes.\nImmediately pick up a functionalized glass cover slip with tweezers.\n\t\nFlip the glass cover slip over such that the fluorescent beads are on the side making contact with gel solution.\nLay the cover slip gently on top of the now-liquid PA gel such that the functionalized side is in contact with the gel (Figure 1C). Note: For best results, a second person is recommended for the role of adding the cover slip in order to avoid possibility of partial polymerization while pipetting liquid PA gel solution onto multiple Petri dishes.\nFlip all Petri dishes over to assist with avoiding gravity effects on fluorescent nanoparticles polymerizing into lower levels of the PA gel.\nWait for at least 35 min, or until the stock solution of PA gel has visibly polymerized in its centrifuge tube.\nFlip the Petri dishes back over and fill them with PBS to assist with removing the cover slip.\nCarefully make contact with the glass portion of the Petri dish and the outline of the cover slip, using tweezers to scrape the circumference of the cover slip. Perform several cycles until the cover slip is dislodged. Remove the cover slip and dispose in a proper sharps waste container.\nAfter removing all cover slips, fluorescent beads will have transferred to the gel (Figure 1D). Cover the PA gels completely with PBS, place the Petri dish lid on each dish, and store at 4 °C.\n3. Functionalizing PA gel with Fibronectin",
    "Prepare the following premixed solutions as described in an established protocol11: Soak solution (137 mM NaCl, 5% (v/v) glycerol) and 2x conjugation buffer (0.2 M 2-(N-morpholino)ethanesulfonic acid (MES), 10% (v/v) glycerol, pH 4.5).\nUse a vacuum pump in a biological hood to remove all PBS from the glass-bottom dishes containing the PA gels.\nPipette soak solution onto each gel such that the gel is completely submerged. Incubate at room temperature for at least 1 hr.\nWarm 1-ethyl-3-[3-dimethylaminopropyl]carbodiimide hydrochloride (EDC) and N-hydroxysulfosuccinimide (NHS) to room temperature.\nMix 10x solutions of EDC (150 mM, 19 mg/ml in DI water) and NHS (250 mM, 29 mg/ml in DI water).\nMix 1 part 10x EDC, 1 part 10x NHS, 3 parts DI water, and 5 parts 2x conjugation buffer.\nUse a vacuum pump in a biological hood to remove the soak solution. Make sure all fluid is removed from the gel surface.\nAdd enough NHS/EDC solution to cover the gel surface and fill the glass-bottom well of the Petri dish (150–250 μl). Incubate at room temperature for 30 min in the dark.\nThaw fibronectin at room temperature. Once thawed, mix sterile DI water to create a 50 μg/ml fibronectin solution.\nUse a vacuum pump in a biological hood to remove the NHS/EDC solution. Make sure all fluid is removed from the gel surface.\nAdd 150 μl of fibronectin solution to each gel. Incubate at room temperature for 35 min to allow for attachment of fibronectin.\nAfter 35 min, add PBS to each Petri dish and store at 4 °C for up to 2 weeks.\n4. Traction Force Experiments\nWarm cell media, PBS, and trypsin to 37 °C in a water bath.\nRinse gels 5x with sterile PBS, aspirating the PBS in between rinses, and leave covered in the hood.",
    "Add 1 ml trypsin per 25 cm2 to flask containing cells. After cells are lifted from flask, dilute the trypsin with cell media and count the cells. Based on gel surface area, determine the number of cells required per gel for a final cell seeding density of 3,000 cells/cm2. Dilute or concentrate suspension such that 150 μl of the cell-media mixture contains this number of cells. Aliquot 150 μl of cell suspension on to each gel.\nPlace the Petri dishes containing cells in an incubator for 30 min. Then, carefully remove the Petri dishes and fill the remainder of the Petri dish with media (approximately 2 ml) such that the surface of the dish is completely submerged.\nPlace the Petri dishes back in the incubator until image acquisition.\nPrepare the microscope and data acquisition system for imaging: insert the 40x water immersion objective, insert the Differential Interference Contrast (DIC) prism, select the mCherry or equivalent fluorescent filter, and turn on the environmental chamber.\nWhen prepared for imaging, remove one Petri dish from the incubator and place it gently on the microscope stage. Remove the Petri dish lid for DIC imaging.\nLocate a single cell and capture a single still image of the cell in DIC.\nWithout moving the microscope stage, switch the imaging mode to fluorescence. Focus on the fluorescent microspheres and record an image of the microspheres.\nCarefully remove cell media from the Petri dish with a pipette and add 0.05% trypsin-EDTA.\nImage the microspheres under the cell after the cells have detached.\nUse particle image velocimetry (PIV) analysis in ImageJ12 to compute the displacement field due to cellular forces.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}