{
  "id": 16962,
  "origin_website": "Jove",
  "title": "An Assay to Detect Protection of the Retinal Vasculature from Diabetes-Related Death in Mice",
  "procedures": [
    "All animal studies were approved by the Office of Animal Care and Institutional Biosafety at the University of Illinois at Chicago. Seven-week-old male C57/BL6/J mice were housed in group cages in a pathogen-free environment on a 12 h-light/dark cycle and provided free food and water access. Mice were euthanized by CO2 asphyxiation, and the eyes were enucleated and processed immediately18. The animals were obtained from a commercial source (see Table of Materials). The essential tools needed for the study are depicted in Figure 1.\n1. Delivery of the death-inducing insult\nPerform oxidative stress with TBH (ex vivo).\n\t\nEuthanize the mice following institutionally approved protocols and enucleate their eyes18 (Figure 2A).\nPut the eyeballs directly into individual wells of a 24-well plate containing DMEM + 1% BSA, with or without 5 mM Tert-butyl hydroperoxide (TBH) (see Table of Materials); incubate for 1 h at 37 °C. A positive control sample is treated with DNase (50 U/100 µL) for 10 min to fragment DNA.\n\t\tNOTE: The dose of TBH (the agent that induces oxidative stress) was chosen to induce a readily detectable and sub-maximal level of cell death within the isolated retinal vessels18.\nFix the eyes in 10% buffered formalin overnight (16 h minimum).\nUse cytokine cocktail to induce inflammation (in vivo).\n\t\nAnesthetize the mice with an intraperitoneal injection of 100 mg/kg ketamine and 5 mg/kg xylazine.\nUse a customized 33 G needle (see Table of Materials) to inject 1 µL/eye of the cytokine cocktail into the vitreous; the injection site is 2-3 mm from the limbus (Figure 2B).\n\t\tNOTE: The cytokine cocktail contains 1:1:1 ratio of 1 µg/mL TNF-α, 1 µg/mL IL-1β and 1500 U/µL IFN-γ18 (see Table of Materials).",
    "24 h after the injection, euthanize the mice (following institutionally approved protocols), enucleate their eyes and ﬁx with 10% buffered formalin overnight.\n\t\t​NOTE: The experiment can be paused after fixation for 1 week maximum and then restarted later.\n2. Retina isolation\nCut open the eyeball.\n\t\nUse straight forceps to grab the optic nerve gently (Figure 2C). Hold a micro-knife with the other hand to make an incision of 2-3 mm posterior to the limbus.\nSwitch from the micro-knife to micro-scissors to cut parallel to the limbus while rotating the eyeball along with the optic nerve until the eyeball has been cut into two halves.\nDiscard the anterior half of the eye, including the lens (Figure 2C).\nRemove the sclera.\n\t\nUse straight forceps to gently lift the sclera 1-3 mm off of the retina.\nUse micro-scissors to make two radial cuts in the sclera part of the way to the optic nerve. Avoid cutting the underlying retina.\nUse a pair of curved forceps to grab the scleral flap and tear it off the retina. The RPE layer will come off with the sclera.\nWash the retina.\n\t\nUse a micro-spatula to transfer the isolated retina to a well within a 24-well dish that has been filled with double-distilled water.\nGently shake the dish at mid-moderate speed at room temperature. Change the water every 30 min to 1 h, at least 4-5 times, then leave overnight.\n3. Retinal vasculature isolation\nDigestion: Replace the double-distilled water with 800 µL of YL trypsin solution (3% trypsin in 0.1 M Tris buffer (pH 7.8)). Incubate at 37 °C with gentle to no shaking for 4 h 15 min19 (Figure 2D).\n\tNOTE: Avoid rapid shaking as this can damage the vasculature.",
    "Transfer: Dip the broad end of a glass transfer pipet with YL trypsin solution to transfer the retina to a 35 mm Petri dish containing lint-free, double-distilled water.\nRemove the outer nuclear layer (photoreceptors) (Figure 2E).\n\t\nFlip the retina semi-sphere downward facing. Use the straight single-hair brush to gently press the retina to the bottom of the dish.\nUse the loop brush to gently brush away the photoreceptors of the retina. The brush strokes are applied in a direction from the optic nerve towards the periphery of the retina. The photoreceptors can detach in large sheets because they are not anchored to the rest of the retina by blood vessels.\nUsing a 200 µL pipette to collect and discard the sheets of neural tissue.\nRemove the vitreous.\n\t\nFlip the retina semi-sphere so that it faces upward. Use a pair of curved forceps (A) to grasp the vitreous as much as possible under a dissecting microscope.\n\t\tNOTE: The vitreous look like a sheet of transparent tissue attached to the optic nerve or retina.\nUse another curved forceps (B) to grasp the end of the vitreous where it connects the optic nerve. Remove the vitreous by pulling forceps A away from forceps B.\nDiscard the vitreous. Examine the remnant of the vitreous and repeat this step to remove all the vitreous as the residual will impede the next steps.\nRemove the remaining neural and glial tissue (Figure 2F).\n\t\nFlip the retina semi-sphere so that it is downward facing again. Once again, use the straight brush to gently press the retina to the bottom of the dish (do not use the tip of the hair).\nUse the loop brush to gently brush over the vasculature from the optic nerve head towards the periphery to remove the remaining neural tissue20.",
    "Spin the retina slowly with the straight brush and use the loop brush to remove all the small chunks of neural tissue on the retinal vasculature, till the vascular network is well cleaned (Figure 2G,H).\n4. Mounting the isolated retinal vasculature on a microscope slide\nPlace a microscope slide.\n\t\nPlace a clean mounting cassette (see Table of Materials) under a dissecting microscope. Fill the cassette with double-distilled water.\nUse a black background under the dissecting microscope to help generate contrast to see the illuminated transparent vasculature.\nUse forceps to place a clean, labeled microscope slide into the bottom of the mounting cassette.\nTransfer the retinal vasculature.\n\t\nDip the broad end of a glass transfer pipet with YL trypsin solution.\nTransfer the cleaned retinal vasculature and gently dislodge the vasculature into the double-distilled water within the mounting cassette and above the microscope slide.\nMount the retinal vasculature.\n\tNOTE: While the vasculature is floating above the microscope slide, the isolated vasculature will acquire its normal bowl shape.\n\t\nUse the loop brush to flip the retina semi-sphere facing upward and gently push the vasculature down onto the glass slide, and then use the hair to tack down the opened vasculature onto the center of the slide. The vasculature should stick to the slide as it touches.\nFlat mount the vasculature by brushing the bowl-shaped retinal vessel from the optic nerve to the periphery.\nRepeat brushing in all directions till the vasculature sticks to the slide completely.\nAir dry the retinal vasculature.\n\t\nOnce the entire retinal vasculature attaches to the slide, take the slide out of the water either by gently lifting one edge or by slowly draining water at the corner of the cassette to minimize currents, then pulling it out (Figure 2I).",
    "NOTE: The vasculature will become readily visible once it has once air-dried (Figure 2J).\nMark the circumference of the retinal vasculature on the back of the slide with a marker pen.\nProceed to stain the sample without pause.\n5. Death detection with TUNEL staining\nNOTE: For details on this procedure, refer to Zheng et al.21. Representative images of ischemia +/- ox stress-induced apoptotic bodies in isolated retinal vessels are depicted in Figure 3.\nRehydrate the isolated vasculature with PBS. Rinse it 3 times in PBS and then incubate with 1% Triton X-100 in PBS for 2 min on ice to permeabilize the isolated vasculature.\nRinse the slides twice with PBS to remove the residual Triton X-100. Dry the area around the sample.\nAdd 50 µL of TUNEL reaction mixture (see Table of Materials) onto the sample. Incubate the slide in a humidified atmosphere for 60 min at 37 °C in the dark.\nRinse the slide 3 times with PBS to remove the TUNEL reaction mixture. Dry the area around the sample.\nAdd a drop of DAPI mounting media to stain the nuclei with DAPI and mount the sample with a cover glass. Store at 4 °C in the dark.\n\tNOTE: The protocol could be paused for up to 1 week before capturing images.\nPhotograph the resulting vasculature with a confocal ﬂuorescence microscope (see Table of Materials). Capture six to eight randomly selected fields in the far periphery surrounding the optic nerve (Figure 4).\n\tNOTE: Representative images of cytokine-induced apoptotic bodies in isolated retinal vessels are illustrated in Figure 5.\nAnalyze the results.\n\t\nFor ex vivo, TBH-treated samples, perform the following steps.",
    "Count the number of apoptotic bodies (TUNEL/DAPI double-positive species) in each field using Image J (see Table of Materials). Tally the mean of the apoptotic bodies in all of the fields of a single sample.\nCalculate the fold change in the number of apoptotic bodies between a randomly selected pair of non-DM and DM samples.\nDetermine if there is a statistically significant difference using the two-tailed student t-test18.\n\t\t\tNOTE: Stain the control and experimental samples (non-DM and DM) on the same occasion because the extent of TUNEL staining can vary, even when done in the same way. Since up to 10 retinas can be cleaned and mounted per day by an experienced user, plan to process an equal number of control and experimental retinas before starting this protocol.\nFor in vivo, cytokines cocktail treated samples, perform the following the steps.\n\t\t\nManually count the number of apoptotic bodies (TUNEL/DAPI double-positive species) in the entire retinal vasculature.\nCalculate the fold change in the number of apoptotic bodies between a randomly selected pair of non-DM and DM samples.\nDetermine if there is a statistically significant difference using the two-tailed student t-test."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}