{
  "id": 18877,
  "origin_website": "Jove",
  "title": "Assessment of Right Ventricular Structure and Function in Mouse Model of Pulmonary Artery Constriction by Transthoracic Echocardiography",
  "procedures": [
    "Surgical Procedure\nObtain 8 week-old male C57BL/6 mice and acclimate for one week before any experimental procedures are performed.\nPrior to imaging, pulmonary artery occlusion is performed as described previously14 in accordance with AVMA guidelines and approved IACUC protocols.\nEchocardiographic Images Acquisition and Measurements\n\tAll abbreviations used are summarized in Table 1.\n1. Parasternal Long Axis (PLAX) M Mode View to Obtain RV Chamber Dimension, Fractional Shortening (FS), and RV Wall Thickness\nUse B Mode setting to obtain a full LV parasternal long axis view. With the animal lying in a supine position on the platform (see Note 6.1. and 6.2.), position the 40 MHz ultrasound probe (MS550D) on the animal with about 30° angle counterclockwise to the left parasternal line with the notch pointing caudal direction (Figure 1A). Adjust the probe angle by tilting slightly along y-axis of the probe (Figure 1D) to obtain a full LV chamber view in the center of the screen.\nOnce the proper landmarks (RV, LV, MV, Ao, LA) as illustrated in Figures 2A and 2B are clearly visualized, switch to M Mode. An indicator line will show up on the screen in the M Mode setting. The line should be positioned to go through the widest portion of RV chamber using Ao as landmark (Figures 2A and B).\nIn this view, the RV wall and IVS should be clearly visible. Please ensure that the focus depth lies in the center of RV chamber. Record the data with cine store for measurement RV chamber dimension, FS and RV wall thickness off line. Examples of M Mode images are shown in Figures 2C and 2D. (See Note 6.3.)\n2. Parasternal Short-axis View at Mid Papillary Level to Obtain Fractional Area Changes (FAC)",
    "From the position described above (Figure 1A), switch to B Mode and turn the probe 90° clockwise to obtain the parasternal short-axis view (Figure 1B). Tip the probe slightly along the x-axis of the probe to prevent the obstructive view of the sternum.\nMove slightly up and down along the y-axis of the probe to obtain the mid papillary level (See Note 6.4.)\nIn this view, the papillary muscles are typically located at the 2 and 5 o'clock position (Figure 3).\n3. Parasternal Short-axis View at Aortic Valve Level (RV PSAX Aortic Level) to Obtain RV Wall Thickness and PA Peak Velocity\nFrom the position described above (Figure 1B), move the probe at the y-axis toward cranium until the aortic valve cross section shows in the middle of the window.\nRight ventricular outflow tract (RVOT) should be visible on the top as a crescent-shaped structure with tricuspid valve separating the RV from RA as illustrated in Figures 4A and 2B. Record the data using cine store for the measurement of RV wall thickness off line. (See Note 6.5.)\nRemain at the same position. (See Note 6.6.)\nSwitch to Color Doppler Mode and position the yellow PW- dashed line parallel to the direction of flow in the vessel. Note that blue and red colors indicate flow away from and toward the probe, respectively (Figures 4C and 4D).\nPlace the PW cursor at the tip of the pulmonary valve leaflets. (See Note 6.7.) Record data using cine store. Measure PA peak velocity off line.\n4. Modified Parasternal Long-axis View of RV and PA to Obtain PA Peak Velocity",
    "Continue on B Mode setting, position the probe (MS550D or MS250) to right parasternal line (Figure 1C) and slowly title the probe about 30-45° angle on the y-axis of the probe (Figure 1D) toward the chest of the mice to clearly visualize the PA crossing over aorta as illustrated in Figures 5A and 5B.\nSwitch to Color Doppler Mode and position the yellow PW- dashed line parallel to the direction of flow in the vessel (Figures 5C and 5D). Place the PW cursor at the tip of the pulmonary valve leaflets. (See Note 6.6.) Record data using cine store and measure PA peak velocity off line.\n5. Data Calculation and Analysis\nRV wall thickness can be calculated from the B Mode data obtained from RV PSAX aortic level as described above (Protocol 3). Select the 2D area tracing tool to trace the area of the RV wall at diastole (as shown in pink area in Figure 6). Then, use the distance tracing tool to trace the inner and outer circumferences of the wall of RVOT (as shown in blue lines in Figure 6). Take the average of inner and outer circumferences. Using the equation imgsrc://cloudfront.jove.com/files/ftp_upload/51041/RVW_Thickness.jpg, we calculate RV Wall (RVW) thickness. (See Note 6.8.)\nFor other standard parameters, please refer to the manuals from the respective manufactures to perform data analysis.\n6. Notes\nAll images are collected using the Vevo 2100 system.  Similar images may be obtained using ultrasound imaging systems from other manufacturers, and the relative pros and cons of various ultrasound instruments have been previously compared8,12,15. It is recommended that all images should be obtained and analyzed in a blinded fashion whenever possible.",
    "The proper choice of anesthesia, such as a short duration of inhaled isoflurane (2-3% to induce, and 1.0% to maintain) is crucial in the maintenance of heart beat at normal physiological rates (above 500 beats/min), allowing us to detect reproducible and consistent basal and elevated pulmonary arterial systolic pressure in the study.\nMake sure to collect the data at the highest possible frame rate possible (>200 frames/sec).\nLook for the view with the largest chamber dimension.\nObstruction due to ribs and the sternum largely due to the RV’s retrosternal position is the single biggest impediment to obtaining excellent images in this method of imaging the RV. By repositioning the animal or the probe, an operator can overcome the sternal block and obtain necessary views of the RV. This may take from 5-15 min, depending on the animal’s physiology.\nYou may need to switch probe to MS250 since MS550D probe can be used in sham and mice before PAC and the 40 MHz probe is capable to record peak velocity of 300-1,500 m/sec, whereas MS250 is able to capture the park velocity up to 4,000 mm/sec.\nIt is acceptable to have a probe angle less than 20° for accurate measurement of PA peak velocity.\nConsistent measurements of RV wall thickness and area/dimensions were made using multiple acoustic windows, in both the long- and short-axis. The choice of some of these windows will depend on the experience of the operator, and could account for variability that could be contributory to different statistical results.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}