{
  "id": 9345,
  "origin_website": "Jove",
  "title": "In Vivo Electrophysiological Measurements on Mouse Sciatic Nerves",
  "procedures": [
    "The present study was performed according to the Protection of Animals Act of the Federal Republic of Germany (Tierschutzgesetz der Bundesrepublik Deutschland) and was approved by the Thuringian State Office for Food Safety and Consumer Protection (Thüringer Landesamt für Lebensmittelsicherheit und Verbraucherschutz).\n1. Setting Up the Measurements\nAnesthetize the mice by isoflurane/O2 inhalation - for initiation of anesthesia 3%, for maintenance 2% isoflurane in 100% oxygen (Figure 1). Confirm sufficient anesthesia by testing simple reflexes such as movement reflexes and testing of sensitivity for low-grade pain. Use of ointment on the eyes to prevent dryness during anesthesia is recommended but not indispensable because the procedure typically takes just 30 min/animal in total. In case of survival experiments, administer timely longer acting analgesics for managing postoperative pain.\nShave the fur covering the hind limbs with an electric razor and perform depilation with a commercially available hair-removal cream while animals are already under analgesia. In order to maintain pathogen-free status throughout the procedure, wear aseptic gloves and always use instruments carefully cleaned with 70% ethanol.\nControl body temperature stability by a feedback controlled heating plate and rectal thermo probe (Figure 2). If necessary, please use a sterile drape to cover the heating plate between the animals in order to keep a sterile experimental environment. Furthermore, it is recommended to use a heating plate, which is electronically controlled via an integrated sensor to limit the heating temperature to ≤40 °C in order to avoid tissue damage.\nimgsrc://cloudfront.jove.com/files/ftp_upload/51181/51181fig1.jpg\nFigure 1. Experimental setup showing an anesthetized mouse with shaved hind limbs. \nTake electrocardiography (ECG) recordings to monitor the heart rate as a vital parameter. Install three electrodes for ECG recordings as follows: one electrode under the skin of each forelimb and one electrode under the skin in the neck area.",
    "Place ring electrodes using contact gel for optimal conductivity / transfer resistance. The sensing electrode (labeled in black) is placed at the position where the gastrocnemius muscle has its maximum diameter. The reference electrode (indicated in red) is placed just beneath the sensing electrode.\n\t\tNote: Please see 'Material table' for equipment details.\nMark the correct positions of measurement with predetermined but consistent distances between the proximal and distal sciatic nerve stimulation and the lead electrode. Experimental proposal: At a distance of 4 mm from the sensing electrode, the distal stimulation will take place. In a distance of 16 mm to the sensing electrode, the proximal stimulation will be carried out (Figure 2).\nimgsrc://cloudfront.jove.com/files/ftp_upload/51181/51181fig2.jpg\nFigure 2. Representative picture showing the experimental situation just prior to the beginning of the measurements. The white arrow indicates the position of the sensing (black) and reference (red) electrode at the gastrocnemius muscle of the left hind limb. The stimulation by needle electrodes will be performed at defined positions in relation to the black sensing electrode. The point of distal stimulation (black mark with \"d.s.\" at the left hind limb) has a distance of 4 mm from the sensing electrode; the place of proximal stimulation (black mark with \"p.s.\") is 16 mm away. The red line on the right hind limb shows the approximate anatomical course of the sciatic nerve. Furthermore, the rough positions of relevant hind limb muscles are shown as landmarks. The asterisk indicates the rectal thermal probe.\n2. Measurement",
    "Principle: Perform a series of nerve stimulations with repetitively generated single square-wave pulses of 0.1 msec duration by monopolar disposable 28 G needle electrodes (repetition rate 200 msec; see Figure 3A). For off-line data analysis, it is recommended to simultaneously acquire stimulation signals together with the neuromuscular function response curve (Figure 3B) due to nerve stimulation. Average a series of maximal responses (\"representative neuromuscular function response\") for subsequent data analysis. In order to produce reliable data, record and later average at least 3 independent, optimal response curves per stimulation site and animal.\nimgsrc://cloudfront.jove.com/files/ftp_upload/51181/51181fig3.jpg\nFigure 3. Procedure for data acquisition and analysis (schematic presentation). Repetitively generated pulses are applied to the sciatic nerve via needle electrodes (upper row in Figure 3A). Simultaneously, several corresponding neuromuscular response curves are recorded (lower row in Figure 3A). When averaged and magnified, neuromuscular response curves due to stimulation pulses (upper row in Figure 3B) show the following characteristic properties (lower row in Figure 3B): Latency of the signal response as well as duration and amplitude of the signal are indicated and can be obtained for subsequent calculations and statistics. Irregular signal conduction and / or suboptimal recordings usually result in various signal deformations with more than just one positive and one negative deflection or signal deformation (bimodal shape) with reduced amplitude (Figure 3C).\nPerform proximal stimulation with a needle electrode at determined position (\"p.s.\" in Figure 2).\n\t\t\nIn order to achieve best recording conditions with maximum amplitudes, visualize the actual response curves simultaneous to the stimulation process. By doing so, the experimenter is able to immediately assess the shape of the response curves as well as the size of the amplitude.",
    "If necessary, slightly and carefully manipulate the position and / or the angle of the stimulation needle with respect to the sciatic nerve. This gentle optimization of stimulation conditions allows reaching constant amplitudes with the largest possible value and a response curve of typical biphasic shape (Figure 4).\nPerform distal stimulation with a needle electrode at determined position (\"d.s.\" in Figure 2).\nAfter completion of measurement, transfer the tested mouse to a separate cage until it has regained sufficient consciousness to maintain sternal recumbency. Do not leave an animal unattended and in the company of other animals until it has fully recovered from anesthesia. Administer timely longer acting analgesics for managing postoperative pain. Systemic administration of nonsteroidal anti-inflammatory drugs (NSAIDs) and opioids are recommended for 1-3 days.\nAlternatively, sacrifice the still anesthetized mouse in a quick and humane fashion without any further pain for the animal, e.g. by neck dislocation.\nimgsrc://cloudfront.jove.com/files/ftp_upload/51181/51181fig4.jpg\nFigure 4. Illustration to determine the CMAP recordings with maximum amplitudes. A complete registration series is presented. (a) Insertion point with minimal CMAP response. (b) Slight stimulation needle movement results in CMAP recordings with maximum amplitudes. (c) Additional changes in needle placement produce CMAP recordings with different amplitudes including near-maximum amplitudes. (d) Stimulation needle replacement with serial CMAP recordings of near-maximum amplitudes. Note: Typical decrement in CMAP amplitudes can occur during repetitive stimulation at optimal stimulation site12,13. Asterisks indicate CMAP recordings with maximum amplitudes depicted for averaging.\n3. Analysis\nExtract nerve conduction parameters based on the representative neuromuscular function response data set using an appropriate software package (e.g. AtisaPro).",
    "Note: Please handle time-related data determination with special care because inflection point determination of compound motor action potential (CMAP) onset and termination can be difficult. A procedure with verified reproducibility is given in Figure 3B, where tangents on signal deflections after onset and before termination are used.\nCalculate 'signal latency' and 'CMAP' values.\n\t\t\nLatency' represents the time delay between stimulation and CMAP onset, whereas the time span between CAMP onset of initial negative deflection to initial return to baseline is called 'CMAP duration'. Use the difference between distal and proximal latencies to calculate conduction velocity together with the distance between distal and proximal stimulation sites.\nconduction velocity = latency / distance between stimulation sites\nCMAP' (compound motor action potential) amplitude represents the magnitude between maximum positive and negative turnaround point of the CMAP signal (given in mV).\nCMAP = value 'positive turnaround point' - value 'negative turnaround point'\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}