{
  "id": 4667,
  "origin_website": "Bio",
  "title": "DNA Slot Blot Repair Assay",
  "procedures": [
    "Cell culture and UV irradiation   Cells were allowed to grow confluent in 6-well plates.   Remove the medium, wash with warming 1x PBS once.   UV irradiation (10-40 J/m2 of 254 nm UV). Note: It is necessary to remove the plastic lid before UV irradiation.   Incubate cells in culture medium for repair for the indicated times before harvest them. The repair time can be varied depending on the cell’s repair capability. Thus for obtaining the optimal time courses for CPD and 6-4PP repair a pioneer experiment with various time courses should be performed. The following time courses are good to be tested for uncharacterized cells.  Note: General repair time courses for  CPD: No UV, 0, 6, 12, 24, 48 h  6-4PPs: No UV, 0, 1, 2, 4, 8 h.   Trypsinize and collect each sample in a 1.5 ml microcentrifuge tube by centrifugation at 2,000 x g for 30 sec. Cell pellets can be stored at deep freezer up to 1 month for later DNA preparation.      DNA preparation (using QIAamp DNA Mini Kit)   Resuspend cell pellet in 200 μl of 1x PBS (room temperature).   Add 4 μl of RNase A (100 mg/ml).   Add 20 μl of QIAGEN proteinase K (or protease).   Add 200 μl of AL Buffer and Mix by pulse-vortexing for 15 sec.   Incubate at 56 °C for 10 min.   Briefly centrifuge to remove drops from the inside of the lid.   Add 200 μl of EtOH (100%) and Mix again by pulse-vortexing for 15 sec.   Briefly centrifuge to remove drops from the inside of the lid.   Apply the mixture to QIAamp Mini spin column (in a 2 ml collection tube) without wetting the rim.   Close the cap, centrifuge for 1 min at 6,000 x g.   Place spin column in a clean 2 ml collection tube.",
    "Add 500 μl of AW1 buffer and centrifuge 6,000 x g, 1 min.   Place spin column in a clean 2 ml collection tube.   Add 500 μl of AW2 buffer and centrifuge at full speed (approximately 20,000 x g) for 3 min.   Place spin column in a clean 1.5 ml E-tube.   Add 200 μl of AE buffer and Incubate at RT for 5 min and centrifuge 6,000 x g, 1 min.   Measure DNA concentration using NanoDrop.      Slot blotting (using Bio-Dot SF microfiltration apparatus)   DNA preparation (300 μl total final volume per slot)   Dilute DNA. - CPD (50 or 100 ng) → into 150 μl of 0.4 M NaOH + 10 mM EDTA buffer - 6-4PP (500 ng or 1 μg) →into 150 μl of dH2O (Do not include NaOH buffer) Note: We used 50 ng or 100 ng of the DNA in 300 μl of total volume to 0.4 M NaOH in 10 mM EDTA for CPD detection. Whereas for 6-4PP detection we used 500 μg or 1 μg of DNA and don't treat the sample with alkali (just use the water) for 6-4PPs since it destroys the 6-4PPs).   Boil for 10 min at 100 °C to denature the DNA.   Transfer immediately samples to ice.   Add 150 μl of cold 2 M ammonium acetate (pH 7.0) into CPD samples to neutralize the DNA (while the DNA is on ice).      Slot blotter   Presoak 3 blotting papers (Whatman filter 3 MM paper) and 1 nitrocellulose membrane in 6x SSC for 10 min.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150416/20150416022913_8022.jpg   Cleaning the blotting Manifold (rinse it in running distilled water).   Place 3 presoaked blotting papers onto the top of the manifold's middle plate. And then place nitrocellulose membrane on top of the blotting papers.   Put the slotted portion of the manifold onto top of the membrane.",
    "Clamp apparatus closed using the two side pieces.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150416/20150416022928_1386.jpg Figure 1. Bio-Dot SF microfiltration apparatus assembly (via Bio-Rad Laboratories)    Screw the plastic nozzle into the side of the apparatus.   Connect vacuum line to the nozzle.   Aspirate excess buffer leaking from presoaked papers and membrane.   Wash the membrane once with 400 μl of TE into each slot (using multi-channel pipette) and gentle vacuum. We recommend to fill buffer in every well before applying vacuum to deliver steady pressure on each well.   Carefully load DNA samples into the wells (using 1,000 p pipette) with the vacuum off and the flow valve open.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150416/20150416023012_7703.jpg Figure 2. Schematic table of sample loading into the well of blotting Manifold    Gentle vacuum to attach DNA onto the membrane.   Add 400 μl of 2x SSC to each slot and gentle vacuum.   Disassemble the blotting manifold and remove the nitrocellulose membrane and put the membrane between 3 M paper.   Baking the membrane in the vacuum drier at 80 °C for 2 h.        Immuno-blotting   Soak the blotting membrane in PBS-T for 10 min with 50 ml PBS-T in the plastic box.   Transfer the membrane to 30 ml of blocking buffer and shake for 30 min at room temperature.   Wash the membrane for 3 times (5 min each) with PBS-T.   Apply the mouse CPD or 6-4PP primary antibody diluted 1:2,000 in PBS-T with 0.02% sodium azide.   Incubate the blot in a cold room with shaking for overnight (12-14 h).   Wash the membrane with PBS-T 4 times for 15 min each.   Incubate with secondary antibody (anti-mouse IgG HRP-conjugated) diluted 1:2,500 in blocking buffer for 1 h at room temperature on an orbital shaker.   Wash the membrane with PBS-T 4 times for 15 min each.   Apply ECL and expose to film.      DNA staining   Rinse the membrane with PBS-T.",
    "Incubate the membrane with 10 ml of PBS-T containing SYBR-gold dye diluted 1:10,000 in PBS-T for 20 min at room temperatures on an orbital shaker.   Wash the membrane with PBS-T 2 times for 5 min each.   Take a photo of SYBR-gold stained blot under UV transilluminator. Note: The DNA bound to the membrane was detected with SYBR-Gold dye and used as loading control."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}