{
  "id": 14984,
  "origin_website": "Jove",
  "title": "An Effective Inoculation Method for Phytophthora capsici on Black Pepper Plants",
  "procedures": [
    "1. Preparation of black pepper cutting plants for infection\nTake a five-node cutting, approximately 40 cm long with a diameter of 0.5 cm, from a healthy and vigorously growing orthotropic branch of black pepper using a disinfected pruning knife or secateurs. Prune the lower three nodes of the plagiotropic branches, with the upper two nodes left with approximately 10 leaves intact.\nPrepare rooting substrate containing soil and animal manure (cow dung or sheep dung) at a ratio of 1:1. Autoclave the rooting substrate at 121 °C for 20 min.\nInsert the cuttings into the rooting substrate at an angle of approximately 50°, with the third node just touching the surface of the substrate and the axillary bud on this node above the substrate.\n\tNOTE: The bag used here has the following dimensions: height of 40-60 cm, diameter of 25-30 cm.\nPour 10-20 L of water over the roots of the plant. Place the cuttings in a greenhouse with 90% shade at a temperature of 25-30 °C for rooting and growth.\n2. Propagation of Phytophthora capsici (P. capsici)\nNOTE: A stock of Phytophthora capsici culture is maintained in the plant protection laboratory of the Spice and Beverage Research Institute, Chinese Academy of Tropical Agricultural Sciences7.\nBrush and clean the potato tubers under running tap water and then cut 200 g of potatoes into cubes of 1 cm3. Place some of the cubes into a beaker containing 800 mL of double-distilled water (ddH2O) and boil for 20 min.\nFilter the broth through double gauze using gravity filtration. Prepare potato dextrose agar (PDA) by adding 20 g of dextrose and 15 g of agar to the filtrate and topping the volume up to 1 L with ddH2O. Autoclave the mixture at 121 °C for 20 min8.",
    "Pour 20 mL of the sterilized PDA in liquid form into a 9 cm diameter round Petri dish inside a laminar air flow hood. Leave the PDA plates with lids open inside the laminar air flow hood overnight as a means of preventing condensation.\nUse an inoculation loop to pick up mycelia from Phytophthora capsici stock inside a test tube. Place the inoculum with the mycelial side in contact with the PDA in a Petri dish.\n3. Infection of black pepper\nIncubation\n\t\nIdentify an area 5 cm above the substrate surface and near to the roots on the stem for inoculation.\nCore out a disk of mycelia 0.5 cm in diameter at the growing edge of the Phytophthora capsici culture on PDA in a Petri dish using a stopper borer.\nDamage the stem using a syringe needle and make three holes in a triangular pattern at the selected inoculation area. Cover each hole with a mycelial disk. Position the holes close to each other to ensure the wounded area is fully covered with the mycelial disks.\nCover the mycelial disks with sterilized moistened cotton pads as a means of preventing drying. Tie the pad onto the stem with a polyethylene strip to maintain the position of the inoculating disks.\n\t\tNOTE: At 8 h after inoculation, the inoculated holes turned black and the lesion extended as time passed. The leaves turned yellow and dropped off, and the inoculated plant died 7-10 days after inoculation. No lesions developed in the control plants. Most of the genes expressed differently following inoculation with Phytophthora capsici in comparison to the control group. Histopathological analysis of the infected tissues demonstrated that Phytophthora capsici colonized in the xylem.\nSample the plant materials of interest and store at -80 °C in liquid nitrogen for use in subsequent studies.",
    "NOTE: Liquid nitrogen, plastic bags, marker pens, branch shears, and other materials were prepared prior to the experiments.\nAfter the specific plant materials are sampled for use, autoclave all the remaining plant materials, left-over Phytophthora capsici culture and culture medium, and all the instruments and labware used in this inoculation work.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}