{
  "id": 18015,
  "origin_website": "Jove",
  "title": "Isolation of Primary Mouse Hepatocytes for Nascent Protein Synthesis Analysis by Non-radioactive L-azidohomoalanine Labeling Method",
  "procedures": [
    "This protocol contains the use of laboratory mice. Animal care and experimental procedures were performed according to procedures approved by the animal care committees of Cincinnati Children Hospital Medical Center.\n1. Isolation of Primary Mouse Hepatocytes\nPre-isolation preparations\n\t\nPrepare 450 mL of 40% density gradient buffer as described in Table 1 and keep at 4 °C (15 mL/mouse).\nPrepare 500 mL of Williams’ Medium as described in Table 1 and keep at 4 °C.\nPrepare 500 mL of DMEM as described in Table 1 and keep on ice (30 mL/mouse).\nPrepare 500 mL of HBSS (-) Buffer as described in Table 1 and keep at 42 °C in the water bath (40 mL/mouse).\nPrepare 500 mL of HBSS (+) Buffer with 0.3 mg/mL Collagenase Type X as described in Table 1 with 30 min incubation at 42 °C in the water bath (40 mL/mouse).\nSet up the perfusion pump by placing the intravenous (I.V) administration tubing across the latching foot pedal and by checking the flow of flushing solution without air bubbles.\nWarm up the tube heater at 42 °C.\nCool down the centrifuge machine to 4 °C.\nAnesthesia and Perfusion\n\t\nClean the work areas and the pump.\nRinse out the pump-connected IV tube by running 70% ethanol thoroughly for 10 min.\nRemove the residual ethanol from the pump-connected IV tube by rinsing with DDW entirely for 10 min.\nWipe the scissors and forceps with 70% ethanol.\nPlace the mouse in a plastic container with a mesh bottom and with the 2 mL isoflurane-soaked gauze underneath the mesh to avoid the direct contact.\nAsses the depth of anesthesia by pedal reflex (firm toe pinch).\nRemove the mouse when it has reached the desired depth of anesthesia.\n\t\tNOTE: The induction time of anesthesia should not be more than 1 min.",
    "Construct a nose cone using a 15 mL conical tube with 1 mL isoflurane-soaked pad pushed to the end of the tube.\nControl the depth of anesthesia by moving the nose cone closer or away from the mouse nostrils.\nPlace the mouse on the working platform with the ventral side facing up.\nSpray 70% ethanol over the abdominal area of the mouse and then open the abdominal cavity by making a large transverse incision of the dermis and peritoneum by using sharp scissors and toothed forceps.\nThen, make a vertical cut of the abdominal layers until all abdominal organs are completely exposed by using sharp scissors and toothed forceps.\nMove small and large intestines toward the left side of the mouse with autoclaved cotton tip until liver, portal vein, and inferior vena cava (IVC) are clearly exposed.\nInsert a 24 G catheter into IVC just at the bifurcation with right renal vein carefully without shaking hands to avoid the injury of IVC and bleeding.\n\t\tNOTE: If bleeding occurs while you are inserting the catheter into IVC, then you should try to insert the new catheter into a portal vein.\nRemove the needle of the catheter and control the position of the cannula to avoid getting out of IVC, then connect 24 G cannula with perfusion tube by using the connector.\n\t\tNOTE: Avoid the presence of air bubbles before starting the perfusion.\nStart the perfusion of the liver with warm HBSS (-) at a flow rate of 4 mL/min and cut off the splenic vein quickly to drain out the internal blood by using scissors.",
    "NOTE: If the cannulation is successful, the liver will begin to blanch due to the backflow distribution of the buffer from IVC to hepatic veins. The portal vein is formed by the union of splenic and superior mesenteric veins; therefore, it is quite safe to cut the splenic vein since it is big and distal from the liver.\nContinue perfusion with 35 mL of warm HBSS (-).\n\t\tNOTE: The liver will become pale in color if the perfusion is adequate, and the mouse still alive under anesthesia at this stage.\nDigestion and extraction\n\t\nPerfuse the mouse liver with warm 35 mL of HBSS (+) including Collagenase Type X at a flow rate of 4 mL/min.\nEvery few minutes, clamp the splenic vein by using forceps for ~10 s to allow the entire volume of HBSS (+) to diffuse into all anatomical parts of the liver.\n\t\tNOTE: Liver begins to swell after clamping the splenic vein due to buffer congestion.\nPour 5 mL of prepared warm HBSS (+) with Collagenase Type X into 100 mm Petri dish at the end of the perfusion process.\nCut off the perfused liver from the rest of the body before stopping the pump to avoid the backflow of blood into the liver, remove the gallbladder by forceps, and then wipe the liver gently with a paper towel to remove the blood.\nTransfer the liver to the Petri dish which contains 5 mL of prepared warm HBSS (+) and remove the liver capsule gently using straight-tipped forceps.\n\t\tNOTE: The liver capsule is a thin layer of connective tissue that surrounding the liver.\nDisperse the parenchymal tissue carefully by using the forceps. Add 15 mL cold DMEM to the Petri dish.\n\t\tNOTE: The medium will turn cloudy due to parenchymal cells if the liver is well digested.",
    "Shake the torn liver gently to release the residual parenchymal cells into the medium and add another 15 mL cold DMEM to the Petri dish to get the rest of the cells.\nTransfer DMEM with the dissolved liver through 100 μm cell strainer into a 50 mL conical tube and keep in ice.\nPurification\n\t\nCentrifuge the cell suspension at 60 x g for 2 min at 4 °C, carefully remove the supernatant by vacuum aspiration and resuspend the pellet in 10 mL DMEM.\nAdd resuspended pellet as a thin layer on the top of 40% density gradient buffer, and centrifuge at 800 x g for 10 min without brake at 4 °C.\nCarefully remove supernatant including the upper layer (DMEM) and the middle layer (dead or non-parenchymal cells), but not the lower layer (Pellet: primary parenchymal hepatocytes).\nResuspend the primary cells with 2–3 mL William’s medium E, and transfer to the new 50 mL tube to avoid contamination of dead cells on the wall of the tube.\nAdd 7-8 mL William’s medium E, mix gently, and centrifuge at 800 x g for 1 min at 4 °C.\nCarefully remove supernatant by vacuum aspiration and then resuspend pellet again with 10, 20 or 30 mL of William’s medium E (according to the size of the pellet).\nCount the cells by using an automated cell counter.\nSeed with William’s medium E, keep the plate in an incubator at 37 °C for 2-3 h, then replace the medium with10% FBS DMEM medium with Anti-Anti to remove the dead or unattached cells and for overnight incubation at 37 °C.\nNext day, primary mouse hepatocytes are ready for experimental use.\n2. Chemo-selective Ligation Reaction Assay for the Detection of Nascent Protein Synthesis\nMetabolic labeling",
    "(Pre-treatment) Wash primary hepatocytes with 37 °C warm PBS twice and add the methionine-free DMEM medium for 30 min to deplete the cytoplasmic methionine reserves.\n\t\tNOTE: L-Azidohomoalanine, is an amino acid and analog to methionine, contains an azido moiety that can be incorporated into proteins during biosynthesis of cellular proteins so that depletion of cytoplasmic methionine will enhance the feeding and incorporation of L-Azidohomoalanine into newly synthesized proteins of cultured primary hepatocytes.\n(Treatment) Wash primary hepatocytes with 37 °C warm PBS twice and add the methionine-free DMEM medium with 25 μM AHA (L-Azidohomoalanine) for 4–6 h.\nAdd any specific chemical (i.e. 10 μM rotenone) in the medium for 4–6 h in presence of AHA in order to investigate its effect on nascent protein expression levels.\nAfter incubation, remove the medium by vacuum aspiration and wash primary hepatocytes with cold PBS three times.\nAdd 200 μL lysis buffer to the plate and incubate for 15-30 min on ice, then tilt the plate and take the whole cell lysate into 1.7 mL tube.\n\t\tNOTE: You should observe that cell lysate is very sticky during the cell harvesting.\nSonicate the cell lysate on ice for 5 s three times by using a probe sonicator to solubilize the proteins and disperse the DNA.\nVortex the cell lysate for 5 min, centrifuge the cell lysate at 21,130 x g for 10 min at 4 oC and then transfer the clear supernatant into a new tube. Measure the protein concentration twice.\n\t\tNOTE: At this stage, protein samples can be stored at -20 °C for two weeks if they are not immediately used.\nLabeling the Azide-modified nascent protein\n\t\nPrepare the components (A+B) by adding 60 μL of component (A) to component (B).\n\t\tNOTE: The solution turns to bright pink in color after adding component (A) to (B).",
    "Prepare the buffers (D) and (E) according to the protocol.\nTake 20–40 μg cell lysate and add 50 μL 2x reaction buffer (component A+B), then adjust the volume to 80 μL by adding DDW and vortex for 5 s.\nAdd 5 μL CuSO4 (component C), and vortex for 5 s.\nAdd 5 μL reaction buffer additive 1 (freshly prepared component D), then vortex for 5 s and wait for 3 min.\nAdd 10 μL reconstituted reaction buffer additive 2 (component E), then vortex for 5 s and rotate samples for 20 min at 4 °C by using a multi-rotator machine.\n\t\tNOTE: The solution turns to bright orange in color after adding component (E). The samples should be protected from light during the rotation.\nAdd 300 μL methanol and vortex for 5 s, add 75 μL chloroform and vortex for 5 s, then add 200 μL DDW and vortex for 5 s.\nCentrifuge the samples at 21,130 x g and 4 °C for 5 min, then discard the aqueous supernatant and keep the pellet.\nAdd 250 μL methanol to the tube, vortex, and spin again for 5 min at 21,130 x g.\nDiscard the supernatant, then cover the samples with the lint-free tissue and allow the pellets to air-dry for 15 min at room temperature.\nPAGE analysis and western blotting\n\t\nSolubilize the pellet in 20 μL of loading buffer without β-mercaptoethanol, vortex for 10 min, heat at 70 °C by using heat block for 10 min. Then load the samples into 10% SDS gel (1.5 mm) for Tetramethylrhodamine (TAMRA) detection.\nDetect AHA signal using a variable mode laser scanner for precise quantitation of nascent proteins.\nWash the Gel with DDW for 15 min.",
    "Then, stain the 10% SDS gel with a fast and sensitive coomassie-dye reagent for 15–60 min to detect total proteins as a control.\nDe-stain the Gel with DDW for 1–2 h and acquire the image by using a UV fluorescence imager.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}