{
  "id": 19345,
  "origin_website": "Jove",
  "title": "Rapid and Efficient Enrichment of Mouse Spinal Cord Microglia",
  "procedures": [
    "The study was conducted in accordance with the official Mexican standard NOM-062-ZOO-1999 and the guide for the care and use of laboratory animals. Approval for the study was obtained from the Research, Ethics, and Biosafety Committees of the Mexico Children's Hospital (HIM/2023/006) and the Research and Bioethics Committee of the General Hospital of Mexico Eduardo Liceaga (DI/21/501/04/62). Three C57BL/6 mice aged 6 to 8 weeks were obtained from the Mexico Children's Hospital, where they were raised under isolated conditions in ventilated racks, in compliance with institutional animal care and use guidelines.\n1. Preparation of materials and reagents\nPre-warm Ca2+ and Mg2+ free PBS as well as Hank's balanced salt solution (HBSS) to 37 °C.\nSupplement the HBSS solution with 100 µg/mL of Liberase and 4 µg/mL of DNase (HBSS-LD). Ensure that the solution maintains a physiological pH of 7.4.\n\tNOTE: 1 mL of working solution per spinal cord will be necessary.\nPrepare an isotonic 90% solution for density gradient centrifugation (commercially available, see Table of Materials) and prewarm it to 37 °C.\nPrepare the staining buffer by combining 5% heat-inactivated fetal bovine serum (FBS) with PBS, and store the mixture on ice.\nPre-warm Dulbecco's Modified Eagle's Medium-high glucose (1g/L) (DMEM) to 37 °C.\nSupplement the DMEM medium with 10% FBS, 2 mM L-glutamine, 200 U/mL penicillin, 200 µg/mL of streptomycin, and 500 pg/mL of amphotericin B (see Table of Materials) to prepare DMEM-S.\n2. Dissection and preparation of the spinal cord\nEuthanize the mouse with an intraperitoneal overdose of pentobarbital at a dose of 150 mg/kg. Sterilize the mouse's thorax and back using 70% ethanol.\n\tNOTE: Confirm euthanasia was successful before proceeding with the mouse dissection.\nShave the thoracolumbar region and secure the extremities to the dissection board using adhesive tape.",
    "Using a scalpel, make a careful incision along the dorsal midline from the occipital to the sacral region (Figure 2).\nWith the assistance of a stereoscopic surgical microscope, dissect in layers until reaching the lumbar spine and identifying the last costal arch.\n\tNOTE: The 13 costal arches are articulated in the thoracic vertebrae; when dissected, they become visible superior to the L1 vertebra2.\nDetermine the last cervical vertebra and the sacrum, then make a cut to separate the spine (Figure 2).\nUtilizing dissecting forceps, perform a dorsal laminectomy of the vertebrae to extract the spinal cord (Figure 3A-D).\n\tNOTE: Except for the first two cervical vertebrae (atlas and axis), all movable vertebrae share a common morphological design in various regions (cervical, thoracic, or lumbar). Each typical movable vertebra features a cylindrical vertebral body at its anterior end. Attached to the back of the body is a bony arch known as the vertebral arch (neural arch), consisting of laminae and spinous processes. Between these structures lies the vertebral foramen15.\nRemove the nerves emerging through the foramina (dorsal and ventral roots) that constitute the peripheral nervous system and may contain infiltrated macrophages (Figure 3D).\n\tNOTE: It is unnecessary to remove the pia mater or meninges as the density gradient medium effectively eliminates contaminating astrocytes. Additionally, retaining the meninges reduces purification time and enhances viability.\n3. Tissue digestion and isolation of microglia\nPlace the spinal cord on the dissecting board, and using Vannas scissors, cut the spinal cord into 2 mm pieces, yielding an average of 10 pieces.\nTransfer the sections of the spinal cord to a 2 mL flat-bottom microtube (Figure 3E,F).\nAdd 1 mL of the HBSS-LD working solution (step 1.2). Incubate at 37 °C for 25 min, vigorously vortexing every 5 min.",
    "Pass the contents of each digestion through a 40 µm strainer, and then add 7 mL of HBSS with 2% FBS to neutralize the digestion.\nCrush the remaining tissue using a 1 mL syringe plunger. Centrifuge the suspension in a 50 mL conical tube for 5 min at 220 x g, 4 °C.\nDiscard the supernatant using a 1 mL micropipette, and resuspend the pellet in 2 mL of HBSS with 2% FBS in a 15 mL conical tube. Combine with 2 mL of 90% isotonic density gradient medium. Centrifuge for 25 min at 160 x g, 18 °C.\n\tNOTE: Utilize slow acceleration and avoid using the brake.\nUse a transfer pipette to retrieve the interface and transfer it to a 15 mL conical tube. Wash the cells with 10 mL of PBS and centrifuge for 5 min at 220 x g, 4 °C.\nResuspend the cells in DMEM-S (step 1.6) and keep them stored on ice.\n4. Determining purity/viability\nFor quantifying viable cells using a hemocytometer chamber, employ a 0.4% Trypan blue stain (see Table of Materials).\n\tNOTE: On average, a single mouse provides 4-6 million cells.\nTo quantify viable cells via a flow cytometer, employ commercially available amine-reactive fluorescent dye staining (see Table of Materials).\n\t\nTransfer 1 million cells into a 5 mL polystyrene round-bottom (FACS) tube. Dilute the fluorescent dye with PBS at a ratio of 1:1000 (creating the viability working solution).\nIncubate the samples with the viability solution in the dark at 4 °C for 30 min. Wash the cells with ice-cold PBS twice. Resuspend the cells in 400 µL of staining buffer (step 1.4).\nBlock the cells with 2.4G2 anti-FcRIII/I (see Table of Materials) in the ice-cold staining buffer for 15 min at 4 °C.",
    "Formulate the antibody staining cocktail by adding the fluorescent-labeled monoclonal antibodies CD45-PerCP and CD11b-eFluor 450 to the staining buffer (at a dilution of 1:300) (see Table of Materials).\n\t\tNOTE: While both techniques are available, choose the one that best aligns with the subsequent protocol.\nIncubate the samples with the antibody staining cocktail in the dark at 4 °C for 30 min. Wash the cells with ice-cold staining buffer twice. Resuspend the cells in 400 µL of staining buffer.\nAcquire 250,000 events on a flow cytometer, as outlined by the gating strategy in step 6 (Figure 4).\n5. Immunofluorescent staining\nPlace a pretreated coverslip into a well of a 6-well plate.\n\tNOTE: To treat coverslips, place them in a Petri dish with 500 µL of L-polylysine (0.01 mg/mL, see Table of Materials) solution and incubate for 1 h. Afterward, wash them three times with distilled water and allow them to dry.\nSeed 200,000 cells onto the treated coverslip using 500 µL of DMEM-S solution. Incubate for 24 h.\nRemove the coverslips and fix the cells using 3.7% paraformaldehyde (PFA) for 20 min at room temperature. Wash the coverslips three times with ice-cold PBS.\nPermeabilize the cells with 0.2% Triton X-100 in PBS for 15 min at room temperature. Subsequently, wash the coverslips three times with cold PBS. Block the cells with 0.2% BSA in PBS for 1 h at room temperature.\nDilute the fluorescence-labeled monoclonal antibodies (at a 1:300 dilution, see Table of Materials) in the blocking solution and incubate for 1 h at room temperature. Wash the coverslips three times with ice-cold PBS.\nApply mounting medium containing DAPI onto the slide, and then seal it with a coverslip.",
    "NOTE: The slides can be immediately analyzed using a fluorescence or confocal microscope, or they can be stored for up to 3 months at -20°C.\n6. Gating strategy for spinal cord microglia\nGenerate a dot plot and establish a gate to isolate viable cells based on viability staining and an empty fluorescent channel16. Exclude non-viable cells.\nProduce another plot utilizing forward and side scatter parameters to eliminate debris16.\nDevelop an additional dot plot and analyze the expression of CD11b and CD45 to differentiate microglia.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}