{
  "id": 10242,
  "origin_website": "Jove",
  "title": "Continuous Measurement of Biological Noise in Escherichia Coli Using Time-lapse Microscopy",
  "procedures": [
    "1. Media and culture preparation\nPrepare stock solution of 1,000x Carbenicillin (50 mg/mL) or relevant antibiotic.\n\t\n.Weigh 0.5 g of carbenicillin. Add 10 mL of sterile H2O. Dissolve completely.\nSterilize carbenicillin stock through a 0.22 µm syringe filter. Aliquot the antibiotic solution and store at -20 °C.\nTo prepare lysogeny broth (LB) plates, mix 5 g of tryptone, 5 g of NaCl, 2.5 g of yeast extract and 7.5 g of Bacto agar with 0.5 L of sterile H2O. Autoclave the solution at 121 °C for 20 min.\n\t\nPartially submerge the molten gel-mix in a 50 °C water bath.Add 1,000 µL of carbenicillin (50 mg/mL).\nPrepare Petri dishes in a sterile environment. Leave the plates to set before storing them in the fridge.\nFor M9 minimal media, prepare separate stock solutions of the following: 5x M9 salts (56.4 g/L), 2 M glucose and 2% biotin-free casamino acids. Autoclave the solutions at 121 °C for 20 min.\nTo prepare 5 Petri plates, mix 1125 mg of low melting agar and 400 mg of agar with 89.2 mL of minimal media (1x M9). Add 10 mL of 2% casamino acids (2% [vol/vol]) in a 250 mL Erlenmeyer flask.\n\tNOTE: Make sure to pour the media on the inner lips of the flask.\nMicrowave the solution in short bursts of 3 to 4 seconds. Repeat until the solution is clear.\n\tNOTE: Make sure not to reach boiling point.\nPlace the 250 mL Erlenmeyer flask in a hot water bath (60 °C) to further mix by diffusion, and leave it to cool until its temperature falls to about 45-50°C.\nLight the flame at the plate-pouring bench.\nAdd quickly all the solutions in the following order:\n\t800 µL of 50% glycerol (0.4% [vol/vol])\n\t100 µL of thiamine (B1)\n\t1100 µL of Glucose (2M)",
    "100 µL of Carbenicillin (50 mg/mL).\nSwirl the Erlenmeyer flask to ensure even distribution of all ingredients throughout the agar.\nOpen one plate at a time next to the flame and begin pouring.\n\t\nLeave the plates on the bench for a few minutes until initial solidification.\nTurn the plates upside down to prevent water condensation from dripping onto the gel.\nLeave the plates to solidify at room temperature for about 2 h.\nOnce the plates have solidified and dried, they can be stored at 4 °C for about 3 months.\n2. Bacterial strains and plasmids construction\nNOTE:The genetic circuit contains one part; a Green Fluorescent Protein (GFP) driven by a PtetO promoter resulting in constitutive expression. All the plasmids in this work were constructed using basic molecular cloning techniques and were transformed into Escherichia coli 10β, using a standard heat shock protocol24. The final construct was transformed into Escherichia coli MG1655 wild type strain for testing.\nTransform the desired plasmid into Escherichia coli MG1655 cells with the standard heat shock protocol24.\nGrow the transformed cells on an LB agar plate overnight at 37°C.\n\tNOTE: It is possible to keep the Petri dishes from step 2.2 up to 3 days for microscopy use.\nInoculate a single colony into 5 mL of LB broth supplemented with the relevant antibiotics in a glass tube.\nGrow cells at 37 °C with 250 rpm shaking speed in incubator for 2 h until liquid is cloudy.\nPrepare 1 mL of dilution solution as follows:\n\t892 µL of minimal media (1x M9)\n\t8 µL of 50% glycerol (0.4% [vol/vol])\n\t100 µL of 2% Casamino acids (0.2% [wt/vol])\n\t1 µL of thiamine (B1)\n\t11 µL of Glucose (2 M)\n\t​1 µL of relevant antibiotics\n\t\nMix and spin down.",
    "Dilute the cell culture (1:30) from step 2.4 into a 2 mL tube by adding 30 µL of Escherichia coli growth to 1000 µL of dilution solution (step 2.5).\nIncubate the tube for 1 h with shaking (250 rpm) at 37 °C.\nGrow 40 µL - 60 µL on M9 plates prepared in step 1.10. Incubate the plate at 37 °C overnight.\n\tNOTE: The Optical Density (OD600nm) for plating should be around 0.1.\nPlace up to three 35 mm glass bottom plates on the bench.\n\tNOTE: Make sure the plate's glass has the correct thickness for the microscope lenses used.\nPrepare the culture for seeding on gel plates, repeat steps 2.3 to 2.6 for colonies from plate prepared at step 2.9 microscope measurements.\nPrepare the following solution to make three microscope plates.\n\t\nPreheat the water bath to 60 °C.\nMix 112.5 mg of low melting agar and 40 mg of agar with 8.92 mL of minimal media (1x M9) and add 1 mL of 2% casamino acids (0.2% [vol/vol]) in a 25 mL Erlenmeyer flask.\n\t\tNOTE: Make sure to pour the media on the inner lips of the flask.\nMicrowave the solution in short bursts of 2 to 3 seconds. Repeat until the solution is clear.\n\tNOTE:Make sure not to reach boiling point.\nPlace the 25 mL Erlenmeyer flask in a hot water bath (60 °C) to further mixing by diffusion, and leave it to cool on the bench until its temperature falls to about 45-50 °C.\n3. Preparation of agarose pads\nClean bench with 70% ethanol. Stretch tape on the cleaned bench. Make sure the tape is smooth and leveled.\nPrepare two coverslips: one on the tape and a second one nearby. Prepare a coverlid.",
    "Remove flask (prepared at step 2.14) from water bath, wipe the outside of the flask clean and leave it to cool until its temperature falls to about 45-50 °C.\nTo make the gel solution, mix quickly all the solutions in the following order:\n\t80 µL of 50% glycerol (0.4% [vol/vol])\n\t1 mL of 2% casamino acids (0.2% [wt/vol])\n\t10 µL of thiamine (B1)\n\t110 µL of glucose (2 M)\n\t10 µL of relevant antibiotics.\nPour 1.5 mL of the gel on the coverslip and cover it with the second piece making a \"sandwich\".\nReturn the Erlenmeyer to the hot water bath. Cover the sandwich with the lid and set timer for 20 minutes.\nAt the same time, incubate the tube from step 2.11 for 1 h at 37 °C with shaking (250 rpm)\nAfter 20 minutes flip the sandwich (step 3.5), cover it and leave to rest for 1 h.\n\tNOTE: For better results leave the \"sandwich\" to rest at 4 °C for the duration of step 3.8.\nSeed Escherichia coli culture from step 3.7 by pipetting the sample onto the 35 mm dish.\n\tNOTE: Pipetting 6 µL of cells as separate small drops gives the best results.\nAllow the drops to dry, for at least 15 minutes and up to 30 minutes.\nExpose the solidified gel of the sandwich from step 3.8 by sliding the coverslip away.\nCut sandwich into small individual pads with biopsy punch or tip.\nLean it gently on the sample (step 3.9). Leave the dish for 20 minutes on the bench.\n4. Preparing the sample for microscopy imaging\nRemove the flask from water bath from step 3.6. Wipe the outside of the flask clean and let cool to room temperature (25 °C).",
    "NOTE: Remove the flask at step 4.1 about 3 minutes before the timer ends.\nPour 3 mL of the gel constantly to the plate perimeter in a circular motion. Leave to solidify for a few minutes.\nSeal plates with tape and pierce several holes with 25 G needle. Flip all the dishes to prevent water condensation dripping onto the gel.\nIncubate all the dishes at 4 °C for 30 min to allow full solidification while preventing cell mitosis.\n\tNOTE: Leave samples at 4 °C for successive measurements, no more than one day.\nStart the microscope per manufacturer instructions.\nFind the initial focus using lowest amplification lens and engage automatic focus system (AFS).\nUse oil if needed, drown the lens with oil and spread it carefully by moving the plate with a platform controller (not manually) and AFS can be engaged again.\nUse relative cross-section in Z direction, following default suggestion for Z step cross-sections.\n\tNOTE: We took bright field images every 5 minutes and fluorescent images every 20 minutes. Sometimes the focus needs to be adjusted during the first 30 minutes. Preheating the microscope incubator box and oil, while refrigerating the sample tends to help reduce the initial loss of focus.\n5. Data analysis\nNOTE: In order to process microscopy data, we designed a computer-based software in MATLAB. This software facilitates identification of cell boundaries from bright field tiff images and segments and sorts cells by area. The output of this image analysis can be used as a mask on fluorescent tiff images to derive cell intensity levels and cancel artifacts in the fluorescent domain such as cell halo due to microscope resolution limits. The software developed was inspired from similar works7,25,26,27,28,29,30 and provides an elegant solution tailored for the lab.\nFirst, define the following parameters in main_code.m.",
    "Define the folder of the acquisition images.\nDefine the image time period - bright field channel time step in minutes.\nDefine the GFP frequency - rate of acquisition of GFP images.\nDefine the microscope resolution (i.e., how many pixels equals 1 µm).\nDefine histogram bin range - cell area range.\n\t\tNOTE: The process of classifying the data according to cell area is similar to the principles of gating in flow cytometry data analysis. Gates are placed around populations of cells with common characteristics, usually forward scattered and side scattered, to isolate and quantify these populations of interest. Microscopy allows to gate, investigate and quantify several cell groups.\nDefine convolution kernel (3,3) - this parameter detects cell boundaries by global thresholding (count_cells.m).\n\t\tNOTE: This setup is needed only when changing the lab or microscope. Software requires the input bright field channel to be labeled with index c1, fluorescence channel labeled as c2.\nRun main_code.m, which will run all other scripts automatically (count_cells.m, cell_growth_rate.m).\n\t\nProgram automatically segments bright field images (see Supplementary Figure 2-4).\nCombine the segmentation image with fluorescent image (GFP) to extract intensity level per cell.\nCalculate the graph of amount of cells by time and fit according to exponential growth.\nCalculate the mean and standard deviation (STD) for each cell area range.\nCalculate the signal to noise ratio (SNR) for each cell area range.\nPlot and fit the distribution of amount of cells by intensity.\nCalculate the coefficient of Variance (CV) and compare to flow analyzer data.\n\t\tNOTE: Software will give as output the final segmentation images for adjusting conv_kernel in a new folder \"yourfolder/Segmented\". Software will give as output the graphs in a new folder \"yourfolder/Graphs.\nIn order to compare between experiments, use compare_experiments.m.\n\t\nDefine directories for the saved graphs and the address for the \\CompareResult directory.",
    "Run the file.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}