{
  "id": 4319,
  "origin_website": "Bio",
  "title": "Measuring Genetic Robustness in Vesicular Stomatitis Virus",
  "procedures": [
    "Make I1 Mab stock and titrate I1 and I14 antibodies; use at enough concentration to produce full inhibition of wild type. Alternatively, I1 Mab can be purchased from Kerafast (https://www.kerafast.com/p-171-hybridoma-8g5f11-i1.aspx[href=https://www.kerafast.com/p-171-hybridoma-8g5f11-i1.aspx]). Notes:   Because of high mutation rates leading to high frequency of antibody-resistance mutants, viral stocks can never be fully neutralized. The goal of Mab titration is to produce plaque assays with less than 10-4 (if viral stocks are neutralized) or less than 10-3 (if the Mab is added to the overlay medium) mutants/wt.   Antibodies other than I14 (https://www.kerafast.com[href=https://www.kerafast.com/]) can be used to calculate mutant frequencies.     BHK-21 cells are washed twice with saline solution, trypsinized and 0.8-1.0 x 105 are seeded in T25 flasks with MEM-H supplemented with 7% BCS and 0.06% PP3. The flasks are gassed for 2 sec with 10% CO2 using a plugged Pasteur pipette. Caps are locked.   The cells are incubated for 24 h to produce monolayers 90% confluent.   On day 2 cell monolayers are treated with no mutagen (mock) or with the mutagen 5-FU at a range of concentrations between 1 and 100 μg/ml for 6 h at 37 °C (5, 10, 25, 50 and 100 μg/ml).   Dilute viral stocks in MEM-H+FBS as needed to produce a 106 plaque forming units (PFU)/ml solution.   Use 200 μl to infect a BHK-21 monolayer for each 5-FU concentration. Incubate 10 min at room temperature (RT) and 40 min at 37 °C.  Add 5 ml of MEM-H+FBS+5-FU (Figure 1, right).   From the 106 PFU/ml solution carry out additional, 10-fold, 100-fold and 1000-fold dilutions. Use each of the three dilutions (105, 104 and 103 PFU/ml solutions) to infect at least 3 BHK-21 monolayers with 200 μl of the dilution to carry out plaque assay in the presence of I1Mab.",
    "Do not neutralize the mixture with I14Mab prior to infection, as it will result in incorrect data due to phenotypic mixing and hiding (Valcarcel and Ortin, 1989; Holland et al., 1989). Incubate 10 min at room temperature (RT) and 40 min at 37 °C. Prewarm a mixture of MEM-H+FBS and I14Mab, add agarose to a final concentration of 0.2%, and add 5 ml of mixture to flasks (Figure 1, left). Note: Even if the virus stock has a known concentration it is recommended that a titration is done in parallel by triplicate plaque assay Figure 1, top left).    imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140312/20140312235055_5527.jpg Figure 1. Flowchart showing the infections needed to calculate the frequency of I1 MARM and the sensitivity to 5-FU. Details are given in the text.    Incubate mutagenized infections and plaque assays for 24 h at 37 °C (Figure 1).   Develop all plaque assays (Figure 1). Because of the low agarose concentration there is no need to fix the cells. Just let the medium overlay slide out and add 2-3 ml of crystal violet solution. Wait for 5 min at RT, discard crystal violet and rinse with tap water.   Count plaques and calculate mutant frequency by dividing Monoclonal antibody resistant mutant (MARM) titers (Figure 1B) by wt titers (Figure 1A).   Check virus replication by examining monolayers under the microscope. When cytopatic effect is > 90%, recover mutagenized populations. Notes:   For lower FU concentrations 24 h are usually sufficient, but for FU concentrations over 30 μg/ml it may take up to three days.   Samples may be frozen so titrations can be carried out for the complete set of mutagenized samples in a single assay.     Carry out titrations of control and mutagenized viral yields. To improve statistical significante it is recommended to do duplicate or triplicate plaque assays for each dilution.",
    "Allow 24-36 h of incubation.   Develop plaque assays with crystal violet and count claque (Figure 1C).   Robustness can be calculated as the slope of the regression of log transformed normalized viral titers vs. square-root transformed 5-FU concentration (Figure 2). The more robust the strain is the closer to a slope of 1.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140312/20140312235153_5536.jpg  Figure 2. To calculate robustness the log-transformed viral titer is represented against the square root of mutagen concentration. Robustness is the slope of the regression (shown at the top of the graph).    To test whether changes in survival are the result of changes in the overall mutation rate, and not in the neutral mutation rate, mutant frequencies must be compared. When all other environmental parameters are the same, mutant frequencies correlate with mutation rates. If mutant frequency and survival to mutagenesis correlate inversely, the latter may not represent robustness. In such case, a clonal analysis is indicated."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}