{
  "id": 3070,
  "origin_website": "Cell",
  "title": "Protocol for engineering E. coli Nissle 1917 to diagnose, record, and ameliorate inflammatory bowel disease in mice",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation of electrocompetent EcN strain (with pKD46) for genome insertion\nTiming: 2 days (for steps 1 to 7)\nThis step involves the preparation of electrocompetent EcN cells with the pKD46 plasmid (EcN-pKD46), the insertion of DNA fragments into the EcN genome, and the selection of the clones with the correct genome insertion.\nPreparation of electrocompetent cell\nStreak the EcN-pKD46 strain on a plate containing 100 μg/mL ampicillin and then cultured at 30°C for 12 h.\nInoculate a single colony into 5 mL LB media for 12 h (30°C, 220 rpm).\nInoculate the culture at 1:200 dilution in 50 mL LB media containing 0.2% L-arabinose and 100 μg/mL ampicillin to an OD600 of 0.5–0.6 (30°C, 220 rpm).\nAllow the culture to cool on ice for 10 min.\nNote: The induction time of L-arabinose is usually 4.5–5 h to ensure the expression of sufficient Gam, Bet, and Exo proteins.\nHarvest the culture by centrifugation for 10 min at 4°C and 3000 rcf. Wash the cells three times with 30 mL of ice-cold 10% glycerol to prepare electrocompetent cells.\nNote: In our protocol, we centrifuged immediately after adding 30 mL ice-cold 10% glycerol to precipitate the culture.\nAfter washing three times, resuspend the culture in 1 mL of ice-cold 10% glycerol. Next, transfer into 1.5 mL tubes (100 μL/tube) for DNA transformation.\nTransformation\nAdd 10–15 μL of BD-ACG-tag DNA fragments (approximately 2–3 μg) to electrocompetent cells and incubate on ice for 10 min.\nAdd the DNA-cell mixture into a gapped cuvette. Electroporate the mixture at an electric field intensity of 3 kV (15 kV/cm) for 4 ms to transform DNA fragments into electrocompetent cells. Resuspend the cells in 800 μL LB media immediately after electroporation pulse and recovery at 37°C for 2–3 h.",
    "Note: In our protocol, the activation process took more than 2 h to ensure the recombination of DNA fragments and bacterial genomes.\nPellet the cultures at 6000 rcf for 1 min. Discard the supernatant and resuspend the cells. Spread the cultures on agar plates containing 50 μg/mL kanamycin and culture at 37°C for 12 h.\nSelection of the clones with the desired genome insertion\nTiming: 2 days\nThis step involves the selection of the clones with correct genome insertion.\nPick 5–10 colonies and add to 10 μL sterilized ddH2O, and use 1 μL of the suspension to execute the colony PCR program (use 1 μL EcN suspension as a control, refer to step 8 in “before you begin[href=https://www.wicell.org#before-you-begin]” section). Add the remaining bacterial suspension to 5 mL of LB medium containing 50 μg/mL kanamycin and culture at 37°C for 12 h.\nRun the PCR products on a 1.5% agarose gel to confirm their size and sequence the correct one. The lengths of the PCR products of wild-type EcN and recombinant EcN are 1614 and 5304 bp, respectively (Figure 7[href=https://www.wicell.org#fig7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2644-Fig7.jpg\nFigure 7. Screening of the recombinant clones by colony PCR\nNext, add 500 μL 50% sterilized glycerin solution to 500 μL of the suspension containing the correct recombinant bacteria and store at −80°C. In our experiment, the recombinant EcN was named EcN-hlyBD-ACG-tag-LacZ.\nPreparation of electrocompetent EcN-hlyBD-ACG-tag-LacZ for pWT-AGBM transformation\nTiming: 3 days\nThis step covers the preparation of electrocompetent EcN-hlyBD-ACG-tag-LacZ cells, transformation of pWT-AGBM plasmid into EcN-hlyBD-ACG-tag-LacZ, and selection of the correct transformants.\nPreparation of electrocompetent cell for plasmid transformation\nStreak the EcN-hlyBD-ACG-tag-LacZ strain onto a plate containing 50 mg/mL kanamycin and then culture at 37°C for 12 h.",
    "Inoculate a single colony into 5 mL of LB media for 12 h (37°C, 220 rpm). Inoculate the culture in 50 mL of LB media (1:200) containing 50 mg/mL kanamycin to an OD600 of 0.3 (37°C, 220 rpm). Allow the culture to cool on ice for 10 min.\nHarvest the culture by centrifugation for 10 min at 4°C and 3000 rcf. Wash the cells three times with 30 mL ice-cold 10% glycerol to prepare electrocompetent cells.\nAfter washing three times, resuspend the culture in 1 mL of ice-cold 10% glycerol. Then transfer into 1.5 mL tubes (100 μL/tube) for DNA transformation.\nTransformation\nAdd 10–15 μL of pWT-AGBM plasmid (approximately 1.5–2 μg) to electrocompetent cells and incubate on ice for 10 min.\nAdd the plasmid-cell mixture to a gapped cuvette.\nElectroporate the mixture at an electric field intensity of 3 kV (15 kV/cm) for 4 ms to transform the plasmids into electrocompetent cells.\nResuspend the cells immediately after pulse with 800 μL of LB media and activate at 37°C for 1–1.5 h.\nCentrifuge the cultures at 6000 rcf for 1 min. Discard the supernatant (600 μL) and resuspend the cells. Spread the cultures on an agar plate containing 50 μg/mL streptomycin and incubate at 37°C for 12 h.\nSelection of the cloning product containing the pWT-AGBM plasmid\nTiming: 2 days\nThis step involves the selection of the cloning product containing the pWT-AGBM plasmid.\nPick 5–10 colonies and add to 10 μL sterilized ddH2O; use 1 μL of the suspension to execute the colony PCR program (refer to step 8 in “before you begin[href=https://www.wicell.org#before-you-begin]” section). Add the remaining bacterial suspension to 5 mL of LB media containing 50 μg/mL streptomycin and culture at 37°C for 12 h.",
    "Run the PCR products on a 1.5% agarose gel to confirm their size and sequence the correct one. Add 500 μL 50% sterilized glycerin solution to 500 μL of the correct engineered bacterial suspension and store at −80°C; in our experiment, this strain was named i-ROBOT.\nNote: The i-ROBOT strain is multifunctional with the following traits: (1) sensing inflammatory markers with high sensitivity for early diagnosis of inflammatory bowel disease (IBD), (2) recording IBD information and (3) responsively expressing and releasing drugs in situ in a self-tunable.\nUse the same method to obtain the control strain D57A, which contains the pWT-AGBM-D57A plasmid in the EcN-hlyBD-ACG-tag-LacZ chassis.\nDiagnosis and record of DSS-induced mouse colitis by i-ROBOT\nTiming: 8–9 days\nThis step includes the diagnosis and recording of thiosulfate in DSS-induced colitis in mice using i-ROBOT. The engineered i-ROBOT bacteria is administered to the mice, and the fecal and colon contents are collected. Next, the flora from fecal and colon contents is collected, and green fluorescence, base editing rate, and blue clone ratio of i-ROBOT contained in the contents are recorded (Figure 8[href=https://www.wicell.org#fig8]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2644-Fig8.jpg\nFigure 8. The flow chart of i-ROBOT diagnoses and record of DSS-induced mouse colitis\nDSS-induced mouse colitis experiments\nDivide the mice into four groups, and administer 3% DSS for drinking to each group for 0, 1, 3, and 5 days (Figure 9[href=https://www.wicell.org#fig9]). Weigh mice on day 0, 1, 3 and 5 for assessing the disease activity index (DAI).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2644-Fig9.jpg\nFigure 9. Guide for four groups",
    "The first group (group 1) of mice drink water freely for 5 days. The second group (group 2) of mice drink water freely for 4 days, and then drank 3% DSS freely for 1 day. The third group (group 3) of mice drink water freely for 2 days, and then drank 3% DSS freely for 3 days. The fourth group (group 4) of mice drink water freely for 5 days.\nNote: Before the experiments began, the mice were acclimated to the environment for one week. The animals were randomly allocated to each group.\nDAI assessment of each mouse on the day 0, 1, 3, 5.\nCritical: We suggest assess the DAI under the blind condition.\ntable:files/protocols_protocol_2644_8.csv\nBacteria preparation administration and sample preparation\nBacteria preparation.\nStreak the i-ROBOT strain on a plate containing 50 mg/mL streptomycin and then culture at 37°C for 12 h, and inoculate a single colony into 5 mL of LB media for 12 h to activate the strain.\nInoculate the activated culture in a 24-well cell culture plate with 750 μL of LB media (1:200) containing 50 mg/mL streptomycin in 37°C with shaking at 1000 rpm for 8 h. Carry out this process in a microplate shaker.\nCollect all cultures and wash with PBS twice.\nResuspend the i-ROBOT strain to 1 × 109 CFU/100 μL with PBS.\nCritical: Readers should establish a standard curve for the correlation between i-ROBOT CFUs (by plating a dilution series) and OD600. Calculate the number of cultures by OD600, and then dilute to 1 × 109 CFU/100 μL.\nAdminister a total of 2 × 109 CFU (200 μL) of i-ROBOT to each mouse on the fifth day.\nStabilize the mouse by holding its head, neck and back.\nKeep mouse lower jaw and neck at 180°, to make sure the esophagus is unobstructed.",
    "Inject the gavage needle (8#45 mm) from mouth, keep the needle moving in parallel with the esophagus of mouse and then inject 200 μL bacteria.\nSample preparation.\nCollect the fecal over a 6–12 h period after bacterial gavage and euthanize the mice to get the colon contents at 12 h after bacterial gavage. Transfer the fecal and colon contents to a 2 mL centrifuge tube with two steel grinding beads (3 mm).\nCritical: Six h after gavage, all mice were assigned to separate cages to collect feces from individual mice. Removing the padding can make it more convenient to collect feces.\nAdd 1.5 mL of ice-cold PBS (containing 1 mg/mL chloramphenicol) to the tube (20 mg sample/mL PBS).\nNote: High concentration of chloramphenicol is used to halt protein translation.\nUse the “high-speed low-temperature tissue homogenizer” (KZ-III-F, Servicebio, Hubei, China) to homogenize samples. The instructions are as follows: http://shopobs.servicebio.cn/2022/04/01/1648813395478380977.pdf[href=http://shopobs.servicebio.cn/2022/04/01/1648813395478380977.pdf].\nNote: Readers can also use glass beads or other beads if sufficient grinding can be performed by other vortex means.\nFilter the vortexed samples through a 5-μm syringe filter to remove large debris.\nNote: Readers can dilute the samples to allow them to pass easily through the filter.\nCentrifuge and wash the filtered samples at 4°C. Resuspend the precipitate in ice-cold PBS containing 1 mg/mL chloramphenicol.\nFlow cytometry\nTransfer 750 μL of the prepared sample into a 24-well cell culture plate (standard microplate), incubate in a microplate shaker (37°C, 1000 rpm) for 2 h to maturate the green fluorophores, and then transfer to a 4°C refrigerator, or analyze the intensity of green fluorescence by flow cytometry immediately.\nNote: We recommend that readers analyze fluorescence by flow cytometry less than 12 h after sample collection.",
    "Perform flow cytometry analysis using a CytoFLEX S flow cytometer (Beckman Coulter, Brea, CA, USA) with blue (488 nm, 30 mW) and yellow (561 nm, 50 mW) lasers.\nPerform the first gating (P1) according to the FSC/SSC scatter characteristics of the i-ROBOT.1[href=https://www.wicell.org#bib1]\nPerform the second gating (P2) according to the red fluorescence intensity of i-ROBOT to ignore counts with low red fluorescence.1[href=https://www.wicell.org#bib1]\nAnalyze a total of 30,000 events or 600 s within the gated population.\nNote: Before analysis, dilute the sample properly to avoid blocking the flow cytometer.\nAnalysis of records\nInoculate the prepared sample (obtained in step 32) in 750 μL of LB media (1:50) containing 50 mg/mL streptomycin at 37°C (1000 rpm) for 12 h.\nCollect and wash the culture.\nSerially dilute the culture, spread on an X-gal agar plate, and culture at 37°C. After 12 h, count the numbers of blue and white colonies.\nAdd 1 μL of culture and 1 μL of uninduced i-ROBOT (as an unmodified reference) to the colony PCR system (refer to step 8 in “before you begin[href=https://www.wicell.org#before-you-begin]” section).\nNote: Use Sequalizer-F as the upstream primer and Sequalizer-R as the downstream primer.\nSequence the PCR products using the Sequalizer-F primer to obtain Sanger chromatogram signals.\nUse Sequalizer9[href=https://www.wicell.org#bib9] to calculate the difference between a sample and an unmodified reference to identify the base-editing ratio (Software: MATLAB R2018a).\nAmelioration of disease activity in mice with DSS-induced colitis by i-ROBOT\nTiming: 15–20 days\nThis step includes the amelioration of disease activity in colitis mice by i-ROBOT (Figure 10[href=https://www.wicell.org#fig10]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2644-Fig10.jpg\nFigure 10. The flow chart of i-ROBOT ameliorates disease activity in mice with DSS-induced colitis\nBacteria preparation and DSS-induced mouse colitis experiments\nBacteria preparation.",
    "Streak the i-ROBOT and D57A strains on a plate containing 50 mg/mL streptomycin and culture at 37°C for 12 h. Inoculate a single colony into 5 mL of LB media for 12 h to activate the strain.\nInoculate the activated culture in 30 mL of LB media (1:200) containing 50 mg/mL streptomycin at 37°C (220 rpm) for 8 h.\nCollect all cultures and wash twice with PBS.\nResuspend the i-ROBOT strain to 5 × 109 CFU/100 μL with PBS.\nDivide the mice into four groups (Figure 11[href=https://www.wicell.org#fig11]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2644-Fig11.jpg\nFigure 11. Guide for four groups\nThe first group of mice to drink water freely for 8 days and administer 200 μL PBS daily to the mice. The second group of mice to drink water freely for 3 days, 3% DSS for 5 days and administer 200 μL PBS daily to the mice. The third group of mice to drink water freely for 3 days, 3% DSS for 5 days and administer 200 μL of D57A strain (1 × 1010 CFU) to the mice daily. The fourth group of mice to drink water freely for 3 days, 3% DSS for 5 days and administer 200 μL of i-ROBOT strain (1 × 1010 CFU) to the mice daily.\nAllow the first group (named “PBS (DSS-)”) of mice to drink water freely for 8 days. Administer 200 μL PBS daily to the mice.\nAllow the second group (named “PBS (DSS+)”) of mice to drink water freely for 3 days and 3% DSS for 5 days. Administer 200 μL PBS daily to the mice.\nAllow the third group (named “D57A (DSS+)”) of mice to drink water freely for 3 days and 3% DSS for 5 days. Administer 200 μL of D57A strain (1 × 1010 CFUs) to the mice daily.",
    "Allow the fourth group (named “i-ROBOT (DSS+)”) of mice to drink water freely for 3 days and 3% DSS for 5 days. Administer 200 μL of i-ROBOT strain (1 × 1010 CFU) to the mice daily.\nAnalysis of therapeutic efficacy\nRecord the weight of mice every day.\nAssess the DAI of mice on day 8.\nPerform cervical dislocation to euthanize the mice, and dissect the colon, put it on ice, and measure the length.\nNote: Autoclave the scissors and tweezers before you start.\nGently rinse the colon surface with PBS.\nDivide the distal colon close to the rectum into three parts (approximately 1 cm each).\nFix the part closest to the rectum (it may contain part of rectal tissue) with 4% paraformaldehyde at 20°C–25°C for 24 h.\nFreeze the middle part in liquid nitrogen and store at −80°C for cytokine detection.\nFreeze the part near the cecum in liquid nitrogen and store at −80°C.\nHistological studies\nHematoxylin-eosin staining (HE staining).\nEmbed the fixed colonic samples in paraffin, section (5 μm) them, and stain with hematoxylin and eosin. The instructions are as follows: https://www.servicebio.com/data-detail?id=5590&code=RSSYBG[href=https://www.servicebio.com/data-detail?id=5590&code=RSSYBG].\nObserve with microscopic inspection, image acquisition and analysis.\nMasson staining and fibrosis analysis.\nEmbed the fixed colonic samples in paraffin, section (5 μm) them, and stain with Masson’s dye solution.\nhttps://www.servicebio.com/data-detail?id=5588&code=RSSYBG[href=https://www.servicebio.com/data-detail?id=5588&code=RSSYBG].\nObserve with microscopic inspection, followed by image acquisition and analysis.\nUse an Eclipse Ci-L photographic microscope to image the selected area (200x) as shown in Figure 12[href=https://www.wicell.org#fig12]A.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2644-Fig12.jpg\nFigure 12. Masson staining for detecting fibrosis in sections\n(A) Image of Masson staining.\n(B) Area of collagen pixel.\n(C) Area of tissue pixel.\nNote: During imaging, ensure that the tissue fills the entire field of vision and that the background light of each photo is consistent.",
    "After imaging, Image-Pro Plus software (version 6.0) was used to measure the collagen pixel area (Figure 12[href=https://www.wicell.org#fig12]B) and corresponding tissue pixel area (Figure 12[href=https://www.wicell.org#fig12]C) in each slice with pixel area as the standard unit. Three visual fields were selected from each slice.\nThe proportion of positive area (%) = collagen pixel area/tissue pixel area × 100.\nAnalysis of cytokines in animal tissues.\nHomogenize the middle part of the colon (100 mg tissue/100 μL ice-cold PBS or ice-cold physiological saline).\nCentrifuge homogenized samples at 3000 rpm at 4°C for 10 min and transfer the supernatants to new tubes.\nUse ELISA cytokine detection kits for cytokine detection. Follow the instructions: https://www.sangon.com/productImage/DOC/D721022/D721022_ZH_P.pdf[href=https://www.sangon.com/productImage/DOC/D721022/D721022_ZH_P.pdf].\nNote: Carry out three repeated experiments on each sample."
  ],
  "subjectAreas": [
    "Health Sciences",
    "Biotechnology And Bioengineering",
    "Crispr",
    "Microbiology",
    "Molecular Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}