{
  "id": 4033,
  "origin_website": "Cell",
  "title": "Histological characterization and quantification of newborn cells in the adult rodent brain",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nFluorescent immunolabeling protocol\nTiming: 2 days\nFree floating sections are transferred into glass scintillation vials and the vials are placed on an orbital rocker for the duration of the experiment in order to agitate the tissue sections. Generally, 1 mL of solution is sufficient for 1:12 series (used in the present example) up to a maximum of a 1:6 series for a rat brain (approximately spanning Bregma +4.7 mm to -8.0 mm–40 sections). For larger amounts of tissue, the incubation volume should be increased accordingly to ensure adequate diffusion of incubation solution throughout the tissue.\nDenaturing pre-treatment\nWash tissue for 5 min 3 times (3×) with PBS at room temperature (RT; ∼20°C)\nDenaturing\nIncubate free-floating sections in 1 mL of de-ionized formamide for 2 h at 65°C\n3× 5 min washes with PBS\nIncubate in 1 mL of 2 M HCl for 30 min at 37°C\n2× 5 min wash with 0.1 M Borax solution\nIncubation in 1 mL of Borax solution for 20 min at RT\n6× 5 min washes in PBS\nNote: DNA denaturing using formamide as a pre-treatment allows greater access of the primary BrdU antibody to the DNA incorporated BrdU.\nLabeling with primary antibodies Primary antibodies: - sheep anti-BrdU (Exalpha, A205P, 1:1000) - mouse anti-NeuN (Millipore, MAB377, 1:1000)\nIncubate in 1 mL of primary antibodies diluted in blocking solution, overnight (∼8–12 h) at RT\n3× wash 5 min washes in PBS\nNote: Tissue can be incubated for longer times (e.g. over a weekend) at 4°C.",
    "Labeling with secondary antibodies Here we describe direct conjugation of a fluorophore labeled secondary antibody (488) for direct detection of the BrdU labeled with primary sheep antibody and also indirect conjugation with a biotin labeled secondary antibody targeted to the mouse NeuN primary antibody. The biotin conjugation allows for amplification of the detectable signal via the addition of a streptavidin-fluorophore complex. Note that the capacity for biotin-streptavidin amplification to improve signal-to-noise ratio should be determined for each antibody by the user. We find that it is useful for certain antibodies where the specific signal can be low, including the mouse anti-NeuN described here. Secondary antibodies: - Direct: anti-sheep Dylight Fluorophore 488 (Jackson ImmunoResearch,1:200) - Indirect: anti-mouse biotin (Jackson ImmunoResearch,1:400)\nIncubation in 1 mL blocking solution for 30–60 min\nIncubation in secondary antibodies in blocking solution for 2 h at RT\n3× 5 min washes in PBS\nNote: For all subsequent steps involving fluorophores, we reduce ambient light exposure by covering the scintillation vials (e.g. using Alfoil).\nAmplification with streptavidin: Detection of certain antibodies can benefit from streptavidin-biotin amplification. This step can also allow for detection using lower concentrations of primary antibody, which can improve the signal-to-noise ratio. Optimal results, including a range of primary antibody concentrations, should be determined by the user.\nIncubation with streptavidin-550 (1:400) in blocking solution for 1.5 h at RT\n3× 5 min washes in PBS\nSlide mounting:\nGlass slides are previously double coated with gelatine (10 g/L, Sigma) and chromium potassium sulfate dodecahydrate (1 g/L, Merck) in distilled water. Slides are dried in an oven at 42°C for 48 h and left at room temperature (∼20°C) for a further 48 h.",
    "Tissue sections can be floated and arranged as individual sections in PBS in a glass petri dish and a fine paintbrush used to drag each section onto the coated glass slides. Slides are allowed to dry for ∼10 min until the sections have adhered to the slide and then mounting medium is used (e.g., DAKO) to apply a coverslip, before final drying overnight (∼8–12 h) in the dark. Slides should be stored at 4°C in the dark to reduce loss of signal from the fluorophore over time.\nNotes: The immunohistochemistry was performed using free floating sections, that were agitated, which aids antibody penetration, but can also be performed on slide mounted sections, where the incubation solutions are applied to cover the tissue sections and washing is performed using e.g. coplin jars. Note that primary antibodies will vary in capacity to penetrate the tissue and thus tissue thickness will impact the final result. The concentration of detergents such as Triton X-100 can be increased to aid penetration in some cases.\nOptional: labeling with DAPI- DAPI labeling can be included as a last step if the analysis requires identification of all nuclei. This will come after step 3c or 4b depending if the antibodies used require a streptavidin step or not.\nAfter step 3c or 4b, incubate with DAPI (1:5000) in PBS for 5 min at RT\n3×5 min washes in PBS\nSlide mounting as described\nImage capturing of 3D tissue volumes by confocal microscopy",
    "Timing: Will be dependent on the volume of the region of interest (ROI) and the performance of the microscope and associated software, including specific settings that determine the quality of the final image, such as laser scanning speed, resolution and averaging. In the example described here (Figure 1[href=https://www.wicell.org#fig1]), the entire striatal volume in a single 40 μm section of rat brain was acquired in 1.5 h.\nHigh quality images are required to facilitate accurate identification of specific, antibody-labeled, fluorescent signal using automated image analysis packages, such as the Imaris software described below. We used a Zeiss confocal microscope (LMS 780, Carl Zeiss AG, Oberkochen, Germany) running Zen black software (2012 SP5). Images were acquired using a 20× air objective (NA of 0.8), at a resolution of 1024×1024, acquisition resolution of 2.4 pixels/μm and using a laser speed of 0.64 μs per pixel. Anatomical landmarks were used to define the striatum as the region of interest (ROI) and the tiling function was used to capture consecutive fields of view spanning the entire ROI. Optical sections were captured in series throughout the Z-axis (tissue depth) for each field of view. Post-processing using the ‘stitch’ function was used to produce a composite 3-dimensional volume of the entire striatum.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/747-Fig1.jpg\nFigure 1. Image capturing of 3D tissue volumes by confocal microscopy\n(A) Immunohistochemistry for BrdU (red) and NeuN (green) in the rat striatum 3 weeks after ischemic injury. The image was acquired as single fields of view using a 20× objective and the tiling function used to assemble the final montaged image of the entire striatum.\n(B–D) The boxed area is shown at greater magnification and illustrates well-defined cell structures suitable for analysis using automated imaging software.\nScale bars: (A) 500 μm and (B–D) 50 μm.",
    "Adjust channel-specific settings such as laser power and gain to optimize signal strength and specificity for each fluorophore.\nDefine the ROI on the X and Y planes using microscope-specific software, typically defined as a ‘tiling’ feature.\nDefine the Z range and the optical section interval. Note that the absolute Z position defining the upper and lower limits of the tissue may vary across large X-Y areas. This may be due to the microscope stage not being completely flat or slight variations in tissue properties. This can be addressed by defining a Z range that oversamples to compensate. This can be achieved by defining upper and lower Z limits at diagonally opposite points of the ROI and selecting final Z values that will include the entire tissue volume within the ROI. The section interval should be set using the Nyquist principle, for the present example we set the interval as 2∗pixel size (with a pixel size of 0.42 μm, the section interval was set at <0.84 μm).\nFollowing image acquisition, a post-processing ‘stitch’ function should be performed in order to generate a composite 3-dimensional ROI that can be handled as a single tissue volume in the image analysis software.\nSoftware-based approaches for automated quantitation",
    "Software packages for automated image analysis are increasingly being used for a variety of applications in biology, ranging from generation of images for robust illustration of cellular and subcellular morphology to efficient, automated quantification of large data sets, including cell counting. Commonly available platforms include popular open-source software such as Image J/FIJI and Cell Profiler as well as commercial platforms such as Imaris and Amira. These software packages employ morphometric analysis tools, whereby fluorescent signals in tissue volumes are rendered in binary as either ‘spots’ or ‘surfaces’. Depending on the parameters used, these compartments can define and quantify a wide variety of morophological features ranging from whole cell bodies to dendrites and subcellular structures. Here we describe a workflow using Imaris 9.0 (Bitplane) for the automated identification and quantitation of new, BrdU+ cells generated in the striatum following ischemic injury as well as neuronal identity based on co-labeling for NeuN. This application thus demonstrates automated counting for large numbers of cells as well as high-throughput screening for rare events\nCreation of a region of interest and volume measurement using the surface function\nTiming: 20 min\nThe ROI creation is a completely flexible and user-defined function and can be performed as a manual delineation, for example based on anatomical structure, such as the striatum illustrated here (Figures 2[href=https://www.wicell.org#fig2]A–2C). Immunohistochemical labeling can also be used for more refined anatomical delineation at the molecular level. Only a single channel needs to be selected – we used the BrdU channel in this example.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/747-Fig2.jpg\nFigure 2. Surface creation for a region of interest\n(A) The original BrdU signal in a 3D tissue volume before ROI selection.\n(B) The surface created from the ROI selection is shown in green.",
    "(C) A new surface channel is generated containing only information within the ROI. Scale bar: 500 μm.\nSelect 'Surface’ function in the software.\nSelect ‘Skip automatic detection, edit manually’ for more accurate delineation of the ROI.\nSelect pencil tool and draw the contour of your ROI. We used every second Z level to define the ROI on the X-Y plane in order to accommodate changes in the ROI throughout the depth of the image volume. A 3D surface volume was then created by the software (Figure 2[href=https://www.wicell.org#fig2]B).\nUse the ‘Mask Selection’ function to apply the surface to your desired channel – BrdU is shown in the example here (Figure 2[href=https://www.wicell.org#fig2]). A duplicated channel is then created excluding any signal outside the surface defining the ROI (Figure 2[href=https://www.wicell.org#fig2]C).\nSpecifications including the ROI volume can be found in the Statistic selection, under the detailed tab for this surface.\nCell counting using the spot tracer tool (spot creation Wizard)\nTiming: 5–10 min\nThe spot creation tool can be used to identify and count cells within the ROI. Here we describe examples for BrdU (Figures 3[href=https://www.wicell.org#fig3]A–3D) and NeuN (Figures 3[href=https://www.wicell.org#fig3]E–3H).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/747-Fig3.jpg\nFigure 3. Cell counting – Automatic spot creation\n(A and E) represents the striatum with the 3 sampling squares for BrdU and the single sampling square for the NeuN channel respectively.\n(B and F) show a closer view of the region of interests.\n(C and G) are showing the cells selected as positive labeling based on their intensity and marked by the gray spots.\n(D and H) represent the BrdU and NeuN cells selected by the spot tracer in the overall striatum respectively. The boxed area, (D′, D’’, H′, and H’’), respectively represent a higher magnification.",
    "Scale bars: (A, D, E, and H) 500 μm; (B, C, F, and G) 50 μm; (D′, D’’, H′, and H’’) 10 μm.\nSelect the add new Spot to begin to define the parameters for automated cell detection. Part of the workflow allows for the selection of a small sampling square within the ROI, ‘Segment only a region of interest’, in order to preview the results of automated selection against actual cells defined by the histological label.\nPosition the sampling square in a representative portion of the image. In cases where the signal is not uniform, for example for detection of BrdU in the example presented here, we recommend the creation of 3 sampling squares in representative areas of the ROI (Figure 3[href=https://www.wicell.org#fig3]A). If the marker is uniformly represented in your ROI. e.g., as shown for NeuN, a single sampling square may be sufficient (Figure 3[href=https://www.wicell.org#fig3]E).\nSelect the source channel for automated cell detection.\nDefine the minimum diameter of the cell population of interest. This will avoid automated identification of artefacts and noise corresponding to objects below this size. In the example described here, NeuN is a relatively homogeneous labeling of nuclei with a minimum diameter defined as 6 μm. BrdU labeling is nuclear but punctate in distribution and a smaller size of 4.5 μm was appropriate to ensure capturing of all cells. Background subtraction option is recommended to remove the background.",
    "Spot detection thresholding step using the Quality filter. The threshold can be allocated automatically according to default setting or set manually. A live preview feature within the sampling square allows the user to verify automated cell detection annotated against the histological signal in order to select the appropriate threshold (Figures 3[href=https://www.wicell.org#fig3]B, 3C, 3F, and 3G). This can be useful when the signal quality varies across samples. In the example shown here, we found that for NeuN, the signal intensity was consistent between samples and a fixed threshold could be used across all brain sections. However, for the BrdU signal, signal quality varied across brain sections and the threshold had to be adjusted accordingly (while blinded to sample identity).\nThe final step applies the parameters selected for the sampling square (if used) to the entire ROI and the number of spots/cells can be found under the Overall tab. A new channel is generated with the annotated representation of cells.\nRepeat all steps for additional channels where required.\nNote: Settings should be defined by the user according to the material and will vary widely according to the distribution of the labelled proteins and the quality of the acquired image. As a general rule we found that investing more time in quality of the image acquisition translated to more efficient and accurate automated cell detection using morphometric software.\nCo-localization using the spot co-localization tool\nTiming: 5–10 min\nExample of BrdU/NeuN co-localization (double labeling; Figure 4[href=https://www.wicell.org#fig4]). We found an automated approach to be particularly useful for detecting low frequency co-localization events in large tissue volumes containing large numbers of cells where it would be prohibitive to manually inspect all cells for co-localization. Co-localization is a post-processing function on data acquired from the spot creation sequence on >1 channel.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/747-Fig4.jpg",
    "Figure 4. Co-localization using the spot co-localization tool\n(A) Cells identified by the co-localization function are annotated as yellow spheres in the ROI (striatum).\n(B–E) Enlarged view of the boxed areas show the identified cells as well as the immunohistochemical signal for the two channels used to detect both cell types using the ‘Colocalize Spot Xtension’.\n(F–H) Enlarged view of a false positive co-localization detected by this tool.\nScale bars: (A) 500 μm and (B–H) 10 μm.\nRun spot detection as described above on the channels of interest.\nFrom the ‘Tools’ tab select the ‘Colocalize Spot Xtension’.\nSelect the 2 spot datasets of interest.\nSelect a threshold that corresponds to the distance above which the 2 spots would not be considered co-localized. This should be user defined based on the cellular distribution of the markers used - e.g., nuclear or cytoplasmic. For the 2 nuclear markers used in the present example we set the threshold as 2 μm. This should be applied across all samples.\nA new spot dataset is created and annotated according to the co-localized cell population.\nThe number of co-localized cells can be found under the Statistic tab of the newly created ‘coloc-cell’ tab.",
    "The degree of verification of co-localization will be user-specific and depend on the application. For our own work (Ermine et al 2020[href=https://www.wicell.org#bib3]) we used this automated co-localization approach as a screening step to identify low-frequency events in large tissue volumes (striatum) but manually verified co-localization of each event by confocal microscopy. Alternatively, where there are a large number of events identified by automated software, it is recommended to manually verify a percentage of the identified cells in order to attribute a margin of error to the software generated value. In our study we found that this co-localization tool was ∼95% correct. An example of correct double positive cells for BrdU/NeuN is presented in Figures 4[href=https://www.wicell.org#fig4]B–4E, as well as an example of false positive double labeling in Figures 4[href=https://www.wicell.org#fig4]F–4H.\nNote: The ROI creation is a user defined step based on the area required for quantification. The co-localisation analysis can be done on multiple regions, for example the striatum can be divided into dorsal and ventral, however, unique ROIs need to be pre-defined prior to the cell counting step, as each ROI needs to be treated separately for spot creation and cell counting. The colocalization step for each region can then be processed as described."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Cell Biology",
    "Model Organisms",
    "Microscopy"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}