{
  "id": 19002,
  "origin_website": "Jove",
  "title": "Assessment of Gastric Emptying in Non-obese Diabetic Mice Using a [13C]-octanoic Acid Breath Test",
  "procedures": [
    "1. Training and Habituation of the Mice\nPrior to analysis, put all mice in the testing chambers for 2-4 hr with constant airflow in order to habituate them to the testing conditions. This markedly reduces stress levels that might otherwise cause aberrant detection of delayed gastric emptying. Treat the mice the same way as if the gastric emptying experiment was running. Prepare egg yolk (see further) without adding octanoic acid and feed 0.2 g to each mouse.   \nRepeat this process till the mice are sufficiently trained (typically 2-3 times). The mice typically are easily habituated as long as the environmental conditions are kept the same. \nNote: Non-habituated mice continue to move around for about 1 hr after transfer to the chamber, and defecate and urinate frequently, while habituated mice quickly settle in their new environment and rest quietly.\nNote: During the experiment: Monitor animals for signs of loss of habituation such as excess urination, defecation, lack of interest in eating the egg. If this is the case consider re habituating in an empty chamber 1-2 times prior to obtaining gastric emptying data. Consistency is extremely important while doing this experiment.  Doing things exactly the same way every time is the only way to get reliable and reproducible results.  This includes giving treatment (e.g. insulin) every day at the same time, not separating the mice from their cage-mates unless absolutely necessary, fasting the mice and starting the gastric emptying test at the same time, and handling the mice the same way.\n2. Preparation of the Isotope Containing Test Meal  \nStart with weighing out 5 g of egg yolk in a 50 ml falcon tube. Repeat these steps each experimental day to prepare a fresh test meal.",
    "Add 10 μl of octanoic acid with a concentration of 2 μl/g to the 50 ml falcon tube containing the egg and mix vigorously for 1 min with a spatula in the falcon tube.  \nThe egg is then transferred to a glass beaker and heated over a Bunsen burner until it coagulates and its consistency is suitable to make small balls. This typically takes about 30 sec. \nNote: The balls of egg yolk should weigh 0.2 g per mouse. This is important to keep the cumulative dose constant in all the mice.  \n3. Starting the Experiment\nOnce trained and ready for gastric emptying, fast the mice overnight (12 hr) on a metal \"mesh-bottom\" fasting rack to prevent coprophagia. Make sure they have free access to drinking water. Since diabetic mice are used in the current experiment, they should not be fasted for more than 16 hr.\nStart by setting up the gastric emptying chambers. Use clean chambers and covers that have been air-dried. Also, any tubes connecting the chambers to the analyzer or the CO2 air supply should be moisture free; water can interfere with the signal read by the analyzer \nConnect the chambers to the inlet tubes that provide a constant air flow. Then connect the outlet tubes from the chambers to the machine. Close the tubes and turn on the airflow. \nNote: Apply a very small amount of Vaseline at the end of the cover lids so they close easily and are securely sealed. This tight seal is necessary to collect all the carbon dioxide produced by the mice.\n4. Experimental Procedures",
    "Start out by weighing each mouse. Body weight is a measure of their continuing good health. Then place each mouse in the appropriate chamber.  It is of course important to have the air flowing into the chambers at this time.    \nTo start the measurement, allow the mice to acclimate to the chambers before adjusting the air levels. \nOnce the mice appear calm, which may take a few minutes, adjust the air flow rate for each mouse chamber. This may be different for each mouse. Typically, the air flow is adjusted at the beginning of the experiment to make sure that exhaled CO2 reaches levels detectable by whatever equipment is being used, and to make sure that the level stays low enough to ensure healthy air turnover. We use initial CO2 levels between 1,000 and 1,500 parts per million. \nIf having difficulty with adjustments, check for air leaks. Then repeat the process for each of the chambers and watch for another round of measurements to see if adjustments made to airflow have corrected the CO2 level. It is important to obtain a steady baseline reading prior to feeding the mice. We use a machine with a self calibration feature.  If this is not the case calibration should be checked. \nWhen this is achieved, administer the egg meal to the first mouse and record the time each mouse receives the food. \nWe run the procedure for 4 hr to obtain enough values for fitting the 13CO2 enrichment curve for each mouse. Check on the mice every 30-60 min to make sure that the CO2 levels are still safe for the mice.\nPrepare new boxes containing food before the end of the test so the mice can start eating immediately after the test is over. \nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}