{
  "id": 6072,
  "origin_website": "Bio",
  "title": "Isolation and Maintenance of Murine Embryonic Striatal Neurons",
  "procedures": [
    "Note: Except for the coverslips washing (described in the following Procedure A, before poly-D-lysine coating) and brain dissection, all the procedures must be done in a sterile environment using a flow chamber. Coverslips washing (timing ~20 h; before poly-D-lysine coating)Heat coverslips in a loosely covered glass bottle embedded in 1 M HCl at 50-60 °C for 4-16 h with occasional swirling. Use few coverslips at a time to prevent them from sticking each other. Acid washing protocol is recommended by the manufacturers for both enhancing the cleanliness of the coverslip and increasing cellular attachment. Cool at room temperature and carefully decant the HCl solution into an appropriate container. Rinse thoroughly with ddH2O and fill the glass bottle with ddH2O. Sonicate in a water bath for 30 min. Repeat the sonication step twice.Replace the ddH2O for a solution of 50% ethanol (v/v) and sonicate in a water bath for 30 min. Repeat the sonication step twice with an increasing concentration of ethanol: (i) 70% ethanol (v/v), (ii) 95% ethanol (v/v). Coverslips can be stored submerged in ethanol absolute ≥ 99.8% (v/v) for up to 6 months.Before use, sterilize the coverslips exposing them to UV light for ~15 min or by dry-heat sterilization.Poly-D-lysine coating (timing ~2.5 h; 1 day before culture)Add the previously prepared 0.1 mg/ml poly-D-lysine solution to the plates/coverslips desired for the culture until it covers the bottom. Incubate the plates/coverslips for at least 2 h, preferably overnight, at 37 °C in a humidified incubator. Aspirate the poly-D-lysine with a Pasteur pipette and rinse twice with sterile water. Remove the water and allow the well to dry in the laminar flow chamber.Store at 4 °C for up to 1 month.",
    "Brain and striatum dissection (timing 1 h 30 min)Soak all the dissecting tools in 70% ethanol (v/v) before starting the dissection. Also, during the dissection routinely dip the dissecting tools in 70% ethanol (v/v) to reduce contaminations. Dry thoroughly before using.Anesthetize the pregnant female mice at gestational day 16 with 5% isoflurane (v/v) and sacrifice it by cervical dislocation (or choose an appropriate anesthesia according to the recommendations of the Institutional Animal Care and Use Committee ruling in the respective country of research). Place the mouse on its belly up and thoroughly rinse abdomen with 70% ethanol (v/v). Collect the embryos by cesarean-section by grasping the uterus with sterile forceps and cutting the connection with the mesometrium. Put the embryos in an HBSS-filled 100 mm Petri dish.Remove each embryo from the embryonic sac and rapidly decapitate it. Transfer the embryos’ heads to an HBSS-filled 60 mm Petri dish and keep it on ice.Using a pair of forceps, hold the head of the embryo and insert the tip of a straight Dumont #5 forceps between eyes to keep the head fixed above the surface. With the mini dissecting scissor pointed up, begin to cut the skin and skull from the end of the spinal cord (which is visible after decapitation) through the longitudinal fissure until the end of the head cavity. Support the head in the Petri dish and gently squeeze the brain out from the brain cavity in a frontal-occipital direction using an angled Dumont #5/45 forceps. Transfer one brain at a time to a new HBSS-filled 60 mm Petri dish (see Video 1).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Exemplification of how to remove the mouse brain from the skull Turn on the magnifying glass and adjust it for approximately 25x magnification.",
    "With the brain faced upward, start the dissection by making a sagittal cut approximately 1 mm parallel to the midline using the angled Dumont #5/45 forceps. Use this cut to facilitate the removal of the meninges from the cortex (see Video 2/Figures 1A-1D). To stabilize the brain during dissection, use a straight Dumont #5 forceps to gently hold the brain between the forebrain and the cerebellum.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Isolation of striatum from embryonic E16 mouse brain Open the slit with the help of the same angled forceps to unfold the anterior cortex overlaying the lateral ventricle and the ganglionic eminences. The striatum, presenting an irrigated oval structure, is located in the lateral eminence. Use the tips of the angled forceps to cut out the striatum pinching around, as shown in Video 2/Figures 1E-1F. Transfer it to a sterile HBSS-filled 35 mm Petri dish. Repeat the procedure on the other lobe and for each brain until all striata are collected. The remaining tissue can be harnessed to isolate the hippocampus, the cortex or other brain areas of interest.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180419/20180419000225_0174.jpgFigure 1. Steps for striata dissection from embryonic E16 mouse brains. A and B. Dorsal positioned embryos brains (C) are cut parallel to the central plane of the sagittal suture. Hold the cerebellum (Ce) with a straight Dumont #5 forceps to keep the brain stable during dissection. D. Using the open slit pull out the meninges (asterisk, *), which cover the whole forebrain (Fb). Afterward, use an angled Dumont #5/45 forceps (E) to unfold the anterior cortex (Cx) and (F) remove the striatum (St), next to the lateral ventricle, with a typical striated appearance that is not always visible at 25x magnification. Ob, olfactory bulbs; Bs, brainstem.",
    "Dissociation and plating of striatal cells (timing 30 min)Transfer the striata into sterile HBSS medium (7 ml) to a 15 ml-Falcon.Add 3 ml of trypsin solution and mix by gently inverting the tube. Incubate for 2-3 min in a 37 °C water bath gently mixing from time to time. Note that depending on the amount of tissue and the trypsin activity the trypsinization time may change. The current protocol is optimized to 3 ml of trypsin solution for about 6 embryos; an increased number of embryos may require an adjustment of the total volume of the solution, maintaining the trypsin ratio.Inactivate the trypsin by adding 5 ml of trypsin inhibitor solution. Note that if the volume added in the previous step is changed, the volume of trypsin inhibitor solution should be added accordingly. Mix by gently inverting the tube and wait until tissue settle. Aspirate the medium.Wash the cells by adding 5 ml of washing solution (trypsin inhibitor in BSA solution, 1:5) and mix by inverting the tube. Allow tissue to settle and aspirate as much volume as possible without disturbing the pellet.Add 2-3 ml of supplemented Neurobasal medium with 0.5% FBS and gently homogenize with P1000 pipette until the solution is homogeneous. Note that if trypsinization step is adequate, an aggressive trituration is not required, as too much physical stress on cells during mechanical homogenization will reduce cell viability.Prepare a 1.5 ml Eppendorf with 20 μl of cell suspension, 20 μl of Neurobasal medium and 20 μl of trypan blue solution, creating a 3-fold dilution factor. Use an inverted phase contrast microscope to count the number of viable cells in a hemocytometer and plate at a density of 130 x 103 cells/cm2. For low density cultures in coverslips plate 92 x 103 cells/cm2.",
    "Neurons are maintained at 37 °C in a humidified incubator with 5% CO2/95% air, for 12 days.At DIV3 remove one-third of culture medium and add an equal part of volume of fresh supplemented Neurobasal medium without FBS and containing 15 μM 5-FdU (final concentration of 5 μM) to reduce dividing non-neuronal cells in primary culture (Hui et al., 2016). Under these conditions, we observed approximately 15% of Glial fibrillary acidic protein (GFAP)-positive cells (data not shown). At DIV7 change the medium again by replacing half of the culture medium to fresh supplemented Neurobasal medium devoid of FBS and 5-FdU.Characterize your primary striatal culture in terms of percentage of neurons (MAP2 or NeuN-positive), glial cells (GFAP or S100 beta-positive), GABAergic cells (GAD65 or GABA-positive), MSNs (DARPP-32-positive and GAD65 or GABA-positive) and GABAergic interneurons (GAD65-positive and DARPP-32-negative). Figure 2 shows a representative image of a primary striatal neuronal culture with approximately 82% of GABA-positive plus DARPP-32-positive striatal neurons. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180419/20180419000432_6496.jpgFigure 2. Characterization of mouse primary striatal culture. DIV12 cultured striatal neurons were stained with anti-MAP2 (1:500; Santa Cruz Biotechnology) antibody conjugated with secondary Alexa Fluor 594 (1:200; Ex: 590 nm, Em: 617 nm) together with (A) anti-GABA (1:500; Sigma-Aldrich) or (B) anti-DARPP32 (1:100; Abcam) antibodies conjugated with secondary Alexa Fluor 488 (1:200; Ex: 495 nm, Em: 519 nm). A secondary antibody-only control staining was performed, which showed no signal. Z-stack confocal images obtained with a 20x objective, NA=1.4 on an inverted confocal microscope. Scale bars = 50 μm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}