{
  "id": 7372,
  "origin_website": "Bio",
  "title": "Structural and Functional Mapping of Mesenchymal Bodies",
  "procedures": [
    "Microfabrication of the microfluidic chipsA detailed protocol on the fabrication of the chips can be found in         Amselem et al. (2018)        . The chips consist of two parts: 1) The top part comprises a flow focusing junction, a serpentine, diverging rails, and a culture chamber. The molds are fabricated using dry resins that are etched to produce the shape of the droplet generators and guiding channels by standard soft lithography. 2) The bottom of the chips consists of an array of 270 hexagonal capillary traps. The molds of the bottoms part of the chips are fabricated by micromilling the brass plates. The geometry and dimensions of the features can be found in         Sart et al. (2020)         (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4177/bioprotoc-11-19-4177-g001.jpgFigure 1. Chip design and depth of the different regions. 1. Inlet for the injection of the aqueous phase containing cells and culture medium; 2. Inlet for oil injection at the junction; 3. Inlet for oil injection to push the drops within the trapping chamber.Fabricate the tops and the floors of the chips by casting poly(dimethylsiloxane) (PDMS) (a mix of 90% of base and 10% of curing agents) into the molds.Place the two molds in an oven set up at 80°C for 2 h to promote the polymerization of the PDMS.Extract the two parts of the chips from the molds and cut them with a scalpel.Assemble the two parts of the chips by bonding the two surfaces for 40 s using a plasma cleaner.Flush the chips with Novec and heat them at 110°C for three cycles to render the inner walls of the chip fluorophilic.Cell culture, sorting, and loading in microfluidic dropletsCultivate hMSCs using hMSC culture medium, from passage 2 to 7 in regular T-175 cm2 flasks, and place them into a culture incubator, set up at 37°C and 5% CO2.",
    "Seed the cells into the flask at a density of 5 × 103 cells/cm2, subcultivate them every week using TrypLE, and change the medium every 2 days.Optionally, sort hMSCs based on their level of expression of CD146 by flow cytometry. CD146 is a marker of undifferentiated status, whose level of expression decreases upon differentiation (Sacchetti et al., 2007). To separate the CD146dim and CD146bright hMSCs, isolate the cells (passage 5) from the flasks, and incubate them with CD146 staining solution for 30 min. Wash the cells with straining buffer. Identify and select the hMSC population by plotting FSC-A and SSC-A signals using the flow cytometer. Eliminate cell doublets by gating the main population obtained by plotting FSC-H versus FSC-A signals. From this selected population, plot the FITC-A (or any fluorochrome for which the cells are not labeled) versus Alexa-647-A signal distribution; analyze the spread of expression of CD146 with the cytometer and sort 25% of the brightest and 25% of the dimmest cells.Connect two 1 ml syringes containing a 1% RAN in FC-40 solution to inlets #3 and #2, block inlet #1, then flush the oil of each syringe at 50 μl/min to remove the air from the chip (Figure 2, Step 1).Load a suspension of 6 × 106 bulk- or a mix of 50:50 CD146dim and CD146bright sorted- hMSCs/ml in culture medium supplemented with the agarose solution into a 100 μl glass syringe.Connect this syringe into inlet #1 (Figure 2, Step 2).Apply a flow rate of 8-8.5 μl/min to syringe 1 and a flow rate of 11 μl/min to syringe 2. The solution containing the cells is pinched at the junction. This yields to the formation of monodispersed droplets containing a suspension of about 380 cells each (Figure 2, Step 2).",
    "Apply a flow rate of 50 μl/min on syringe 3: the droplets are pushed on the rails that guide them evenly within the culture chamber. The drops are then captured within the capillary traps (Figure 2, Step 2).Stop the flow of syringe #1 and apply a flow rate of 100 μl/min to syringes #2 and #3 to remove the excess of non-anchored droplets in the culture chamber (Figure 2, step 3).Stop the oil flows; the cells settle down at the bottom of the drops and start clustering.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4177/bioprotoc-11-19-4177-g002.jpgFigure 2. Protocol for cell loading and droplet formation Spheroid formation and culture in microfluidic dropletsPlace the chips into the CO2 incubator overnight to let the cells form spheroids (Figure 3 and Video 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4177/bioprotoc-11-19-4177-g003.jpgFigure 3. Kinetics of MB formation in microfluidic droplets. After stopping the oil flow, the cells are allowed to settle down to the bottom of the drops, where they start clustering. Cells are monitored continuously by live imaging, while forming MBs. Scale bar = 100 μm.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Morphology of MB in 3D. The MBs in liquid drops are subjected to recirculation by applying an oil flow around them. The protocol allows the MBs to rotate on their axis. The movie demonstrates the 3D structural organization of MBs.On the second day, place the chips at 4°C for 30 min to gel the agarose.Flush the chips with 1 ml of pure FC-40 oil, at 80 μl/min, to dilute the surfactant.Replace the oil phase with culture medium by slowly flowing the aqueous solution into the device. At this stage, the 3D aggregates are mechanically retained into the traps by the hydrogel. They can be regularly perfused with culture medium; thus, they are now ready for long-term culture while remaining fully viable (Sart et al., 2020).",
    "Spheroid labeling and imaging within microfluidic dropletsTo interrogate the structural organization within MBs:Label CD146dim- and CD146bright- hMSCs with Vybrant DiO (green) or Vybrant DiD (red) dyes (5 μl for 1 ml culture medium) for 30 min, prior to loading them into the microfluidic drops.Note: CD146 protein and the Vybrant dyes are soluble in Triton-X 100 solution; thus, this protocol does not allow to combine immunostaining with the detection of the different CD146 subpopulations. After spheroid formation and culture, image MBs using a fluorescent microscope (e.g., wide-field or confocal microscope equipped with large working distance objectives) (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4177/bioprotoc-11-19-4177-g004.jpgFigure 4. Spatial organization of CD146dim and CD146bright hMSCs within MBs.  CD146dim and CD146bright are isolated by cell sorting, then labeled with Vybrant DiO (green) or Vybrant DiD (red) dyes prior to their loading into drops. Scale bar = 100 μm.To interrogate the functional organization within MBs (e.g., the regional expression of VEGF-A, COX-2, or RUNX-2):Fix the MBs by perfusing a solution of 200 µl of fixative solution, by first filling a 1 ml plastic syringe with PFA, then flowing at a flow rate of 80 μl/min.Incubate the aggregates of hMSCs with the PFA solution for 30 min at room temperature.Wash the culture chamber with PBS at the same flow rate (200 μl at 80 μl/min).Permeabilize the MBs by perfusing at 80 μl/min with a 200 μl of permeabilization buffer, and incubate for 5 min.Wash the culture chamber with PBS (200 μl at 80 μl/min).Block MBs by perfusion of a blocking buffer (200 μl at 80 μl/min) and incubate for 30 min.After blocking, perfuse the chamber with a solution of primary antibody (e.g., anti-COX-2 or anti-VEGF-A antibody or anti-RUNX-2; 200 μl at 80 μl/min), and incubate for 4 h.Wash the primary antibody solution by perfusing PBS (200 μl at 80 μl/min).",
    "Perfuse the solution of secondary antibodies (200 μl at 80 μl/min) and incubate for 1 h 30 min.Wash with PBS (200 μl at 80 μl/min).Image the MBs in the traps using a fluorescent microscope (Figure 5).To validate the specificity of the primary antibodies, incubate the sample with the secondary antibody only, then wash with PBS. Absence of fluorescent signal validates that the primary antibody is specific to its target (i.e., VEGF-A) and that excess of antibodies is effectively washed with PBS rinsing (Sart et al., 2020).To validate the absence of diffusion limitation, omit the blocking step and incubate with the secondary antibody only. Absence of diffusion limitation is demonstrated by homogeneous fluorescent signal distribution within the aggregate (Sart et al., 2020).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4177/bioprotoc-11-19-4177-g005.jpgFigure 5. Functional organization hMSCs within MBs: VEGF-A expression detected by immunostaining. Similar results were obtained for RUNX-2 and COX-2 immunostaining (Sart et al., 2020). Scale bar = 100 μm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}