{
  "id": 15208,
  "origin_website": "Jove",
  "title": "Saccharomyces cerevisiae Metabolic Labeling with 4-thiouracil and the Quantification of Newly Synthesized mRNA As a Proxy for RNA Polymerase II Activity",
  "procedures": [
    "1. Cell Culturing and Rapamycin Depletion of a SAGA Subunit\nFor each S. cerevisiae strain and replicate, including wild-type or control strains, inoculate a single colony from a fresh plate onto 5 mL of YPD medium (2% Peptone, 1% yeast extract, and 2% glucose).\nGrow S. cerevisiae cells overnight at 30 °C with constant agitation (150 rpm).\nMeasure the optical density at 600 nm (OD600) and dilute the culture to an OD600 of approximately 0.1 in 100 mL of YPD medium and let it grow up until the OD600 is around 0.8.\nIn parallel, inoculate a single colony of S. pombe cells from a fresh plate onto 50 mL of YES medium (0.5% yeast extract; 250 mg/L adenine, histidine, uracil, leucine, and lysine; 3% glucose) and grow the cells overnight at 32 °C with constant agitation (150 rpm).\nMeasure the OD600 of the S. pombe overnight culture and dilute the culture to an OD600 of approximately 0.1 in 500 mL of YES medium and let it grow up until the OD600 is approximately 0.8.\nFor each S. cerevisiae anchor-away strain and replicate, including wild-type or control strains, inoculate a single colony from a fresh plate onto 5 mL of YPD medium (2% Peptone, 1% yeast extract, and 2% glucose).\nGrow the cells overnight at 30 °C with constant agitation (150 rpm).\nThe next morning, measure the OD600, dilute the culture to an OD600 of approximately 0.1 in 100 mL of YPD medium and let it grow until the OD600≈ 0.8.",
    "Add 100 µL of rapamycin to the culture from a stock solution of 1 mg/mL (final rapamycin concentration of 1 µg/mL) and let the cells incubate at 30 °C with constant agitation for the time necessary for the protein of interest to be conditionally depleted from the nucleus (usually, 30 min is adequate). For the control, use a similar yeast culture, but instead of adding rapamycin, add the equivalent volume of dimethyl sulfoxide (DMSO).\n2. 4tU Labeling with S. pombe as a Spike-in (Counting)\nPrepare a fresh solution of 2 M 4-thiouracil. Once prepared, keep it at room temperature and away from light.\nAccurately weigh 64.1 mg of 4-thiouracil for each S. cerevisiae culture and dissolve it in 250 µL of dimethylformamide (DMF) or in 250 µL of DMSO.\nFor the S. pombe culture to be used as spike-in, weigh 320.5 mg of 4-thiouracil and dissolve it in 1,250 µL of DMSO.\nAdd the 4-thiouracil solution to S. cerevisiae and S. pombe cultures for a final concentration of 5 mM and incubate them for 6 min with constant agitation at 30 °C and 32 °C, respectively.\nAfter 6 min, remove a small aliquot of each culture for cell counting. Count the cells using an automatic cell counter or a Neubauer chamber.\nCollect the cells through centrifugation (2,500 x g) for 5 min at 4 °C.\nDiscard the supernatant, wash the cells with ice-cold 1x PBS, and centrifuge again (2,500 x g, 4 °C, 5 min).\nCalculate the total number of cells in each of the S. cerevisiae and S. pombe samples.\nResuspend the cells in 5 mL of ice-cold 1x PBS and mix S. cerevisiae with S. pombe cells with a 3:1 ratio.",
    "Centrifuge the cells (2,500 x g, 4 °C, 5 min), remove the PBS, flash-freeze the cells in liquid N2, and store the sample at -80 °C until further use.\n3. RNA Extraction and DNase Treatment\nThaw the cells on ice for approximately 20–30 min.\nProceed with the RNA extraction using a yeast-RNA extraction kit (Table of Materials) with a few adaptations.\nPer each sample, pour 750 µL of ice-cold Zirconia beads into a 1.5-mL screw cap tube supplied with the kit. Keep in mind that per each tube, RNA from up to 109 cells can be efficiently extracted. Hence, prepare the number of tubes necessary for each sample. For example, an S. cerevisiae culture of 100 mL (OD600≈ 0.8) can render around 2 x 109 to 3 x 109 cells, leading up to a total of 2.7 x 109 to 4 x 109 cells in total (after the spike-in with a third of the S. pombe cells). In this case, up to 3 - 4 reaction tubes per each sample/condition/mutant/replicate would be required.\nPer each 1 x 109 cells, add 480 µL of the lysis buffer provided with the kit, 48 µL of 10% SDS, and 480 µL of phenol:chloroform:isoamyl alcohol (25:24:1, v/v/v).\nMix the cells using a vortex mixer and transfer them to the tubes containing the ice-cold Zirconia beads.\nAccommodate the tubes on a vortex mixer adaptor, turn the vortex at maximum speed, and beat for 10 min to lyse the yeast cells (in a room at 4 °C). Alternatively, perform lysis of the cells in an automatic bead-beater.\nCentrifuge tubes at 16,000 x g for 5 min at room temperature and carefully collect the upper phase (RNA-containing phase) to a fresh 15 mL falcon tube. Typically, the volume recovered per each tube is around 500–600 µL.",
    "To the 15 mL tubes containing the partially purified RNA, add the binding buffer provided with the kit and mix thoroughly. Per each 100 µL of RNA solution, add 350 µL of binding buffer (i.e., when the aqueous-phase solution volume is 600 µL, 2.1 mL of the binding buffer should be added).\nTo the previous mixture, add the 100% ethanol and mix thoroughly. Per each 100 µL of RNA solution, add 235 µL of 100% ethanol (i.e., when the aqueous-phase solution volume is 600 µL, add 1.41 mL of ethanol).\nApply up to 700 µL of the mixture from step 3.9 to a filter cartridge assembled in a collection tube, both provided with the kit.\nCentrifuge for 1 min at 16,000 x g. If the centrifugation duration was not enough for the total volume to pass through the filter, repeat the centrifugation for 30 s.\nDiscard the flow-through and reuse the same collection tube. Add another 700 µL of RNA-binding buffer-ethanol solution to the filter and centrifuge again at 16,000 x g for 1 min.\nDiscard the flow-through and repeat steps 3.11 and 3.12 until the RNA solution is finished.\nWash the filter 2x with 700 µL of washing solution 1. Collect the washing solution via centrifugation at 16,000 x g for 1 min and always keep the collection tube.\nWash the filter 2x with 500 µL of washing solution 2. Collect the washing solution via centrifugation at 16,000 x g for 1 min and always keep the collection tube.\nCentrifuge the tubes once again at 16,000 x g for 1 min to completely dry the filter.\nTransfer the filter cartridge to the final collection tube (RNA-appropriate tube) and elute RNA with 50 µL of DEPC-treated, RNase-free H2O (preheated to 100 °C).\nCentrifuge for 1 min at 16,000 x g.",
    "Elute RNA again (to the same tube) with 50 µL of preheated DEPC-treated, RNase-free H2O. Make sure that all the volume has passed through the filter; otherwise, centrifuge for longer periods.\nIf multiple tubes for one single sample are used, pool them all in one tube.\nQuantify and check the purity of the sample using the appropriate equipment.\n\tNOTE: While 4tU is only incorporated within newly synthesized RNA, there is a chance of minor contamination with DNA. For that reason, it is always advisable to treat the samples with DNase I. For that, use the reagents provided with the RNA-extraction kit (Table of Materials) following the manufacturer's recommendations.\n4. Thiol-specific Biotinylation of Newly Synthesized RNA\nAdjust the concentration of the RNA obtained with section 3 of the protocol to 2 mg/mL. Aliquot 200 µg of total RNA, heat it for 10 min at 60 °C, and immediately chill it on ice for 2 min.\nTo the RNA aliquot, add the reagents mentioned below in the following order: 600 µL of DEPC-treated, RNase-free H2O, 100 µL of biotinylation buffer (100 mM Tris-HCl [pH 7.5] and 10 mM EDTA, in DEPC-treated, RNase-free H2O), and 200 µL of biotin-HPDP from a stock of 1 mg/mL biotin-HPDP in DMSO or DMF.\nIn some situations, the biotin-HPDP solution tends to precipitate, likely due to its low solubility in water. In this situation, increase the volume of DMSO/DMF up to 40% of the reaction volume (to the RNA sample, add 400 µL of DEPC-treated H2O, 100 µL of biotinylation buffer, and 400 µL of biotin-HPDP from a 0.5 mg/mL stock).\nIncubate the sample at room temperature and protected from light for 3 h, with gentle agitation.\nAfter incubation, add an approximately equal volume of chloroform to the tubes and mix vigorously.",
    "Spin the sample at 13,000 x g for 5 min, at 4 °C. This step allows the removal of excess biotin that did not biotinylate the RNA. Alternatively, perform this step using phase-lock tubes (heavy). For that, spin down the phase-lock tubes for 1 min at 13,000 x g, add the RNA mixture and an equal amount of chloroform, mix them vigorously, and centrifuge them at 13,000 x g for 5 min, at 4 °C.\nCarefully transfer the upper phase into new 2 mL tubes.\nAdd one-tenth of the volume of 5 M NaCl and mix the sample.\nAdd an equal volume of isopropanol, mix the sample thoroughly, and spin it at 13,000 x g for at least 30 min, at 4 °C.\nCautiously remove the supernatant and add 1 mL of ice-cold 75% ethanol.\nSpin at 13,000 x g for 10 min, at 4 °C.\nCarefully remove supernatant, quick-spin the tube, and remove the remaining ethanol solution. Make sure that the RNA pellet does not dry.\nSuspend the RNA in 100 µL of DEPC-treated, RNase-free H2O.\n5. Purification of Newly Synthesized Fraction from Total and Unlabeled RNA Using Streptavidin-coated Magnetic Beads\nHeat the biotinylated RNA for 10 min at 65 °C and then chill the samples on ice for 5 min.\nAdd 100 µL of streptavidin-coated magnetic beads to the biotinylated RNA (at a final volume of 200 µL). Specifically, it is recommended to use the beads indicated in the Table of Materials, since, after conversations with other laboratories, these seemed to be the more consistent and reliable.\nIncubate the sample with slight shaking for 90 min, at room temperature.\nPlace the columns provided with the kit (Table of Materials) in the magnetic stand.",
    "Add 900 µL of room-temperature washing buffer (100 mM Tris-HCl [pH 7.5], 10 mM EDTA, 1 M NaCl, and 0.1% Tween 20, in DEPC-treated, RNase-free H2O) to the columns (pre-run and equilibrate).\nApply beads/RNA mixture (200 µL) to the columns.\nCollect the flow-through in 1.5-mL tubes and apply it again to the same magnetic column. If necessary, keep this flow-through as it represents the unlabeled RNA fraction.\nWash the columns 5x with increasing volumes of washing buffer (600, 700, 800, 900, and 1,000 µL).\nElute the newly synthesized RNA with 200 µL of 0.1 M DTT.\nPerform a second elution, 3 min later, with an equal volume of 0.1 M DTT.\nAfter eluting the RNA, add 0.1 volumes of 3 M NaOAc (pH 5.2), 3 volumes of ice-cold 100% ethanol, and 2 µL of 20 mg/mL glycogen (RNA-grade) and let the RNA precipitate overnight, at -20 °C.\nRecover the RNA by centrifugation (13,000 x g for 10 min, at 4 °C) and resuspend it in 15 µL of DEPC-treated, RNase-free H20. The proportion of labeled-to-total RNA is expected to be around 2% - 4% (usually more toward the lower end), rendering approximately 2.0 µg of newly synthesized RNA. This quantity is enough to do several qPCR experiments, as well for microarray/sequencing analyses.\n6. RT-qPCR Validation of the Different Fractions\nSynthesize cDNA from 2 µg of total RNA or 10 µL of labeled RNA using random hexamers and the reverse transcriptase of choice, according to the manufacturer's instructions (Table of Materials).\nAmplify the cDNA by real-time qPCR using a standard protocol (Table of Materials).\n\tNOTE: All samples should be run in triplicate from a minimum of two biological replicates. Correct all raw values for the expression of S. pombe tubulin.\n7. Microarray Hybridization",
    "Hybridize RNA samples onto preferred microarray chips according to the manufacturer's instructions (for this specific protocol, see Table of Materials). Briefly, prepare biotinylated cRNA targets from 150 ng of RNA using the Premier RNA Amplification Kit (Table of Materials), according to the manufacturer's instructions. Hybridize 4 mg of fragmented cRNAs for 16 h at 45 °C and 60 rpm on microarray chips.\nWash, stain, and scan the chips using the indicated station and scanner (Table of Materials). Extract the raw data (CEL Intensity files) from the scanned images using the command console (AGCC, version 4.1.2).\nFurther process the CEL files with Expression Console software version 1.4.1 to calculate probe set signal intensities, using the statistics-based algorithms MAS 5.0 with default settings and global scaling as normalization method.\n\tNOTE: The trimmed mean target intensity of each chip was arbitrarily set to 100. Perform all experiments using at least two independent biological replicates. Normalize raw data to the S. pombe signal and calculate fold changes in total and newly synthesized RNA levels.\n8. Data Analysis Using an Existing R Pipeline\nCalculate synthesis and decay rates using a pipeline and R/Bioconductor package publicly available, as previously described8,10.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}