{
  "id": 16974,
  "origin_website": "Jove",
  "title": "Using Herbal-Cake-Separated Moxibustion for the Treatment of Rats with Chronic Renal Failure",
  "procedures": [
    "The plan follows the Animal Care Guidelines of the Yunnan University of Chinese Medicine and has been approved by the Animal Ethics Committee of Yunnan University of Chinese Medicine. The experimental animal welfare and ethics review number is R-062021G098.\n1. Moxibustion experimental platform device (Figure 1)\nNOTE: We designed and constructed the rat moxibustion experimental platform device based on the distance between the hind and front limbs of rats and their behavioral and physiological characteristics.\nThe size of the moxibustion device\n\t\nFabricate the device using anti-beaten board material and a wooden board; the overall size is 52 cm L x 23.5 cm W x 64 cm H, and the bottom area of the device is 1222 cm2.\n\t\tNOTE: The moxibustion operation is carried out on the platform at this height, and the rats can be kept calm.\nThe main frame of the moxibustion device\n\t\nMake the base of the whole device with anti-beaten board material: The base plate is 52 cm L x 23.5 cm W with a white surface. Ensure that the bottom accounts for a large proportion of the device's weight to stabilize the whole device.\nMake the elevated platform of the device with solid wood, 60 cm high.\n\t\tNOTE: This is the main frame of the whole instrument, which stabilizes the whole device and supports the placement of the rats in a standing position.\nPut five placement slots above the elevated platform, with a size of 10 cm L x 6 cm W x 10 cm H. Use interval boards (10 cm L x 1.3 cm W x 10 cm H) to separate the placement slots, corresponding to the distance between the front and rear limbs of the rat in standing position.\nThe components of the moxibustion device",
    "Fix two stainless steel strips on top of the placement slots. Each fixed strip is a right angle equal edge steel bar 40 cm L x 1.4 cm W (both sides have the same width), with 15 holes. Three holes at the fixed strip correspond to each slot, used to fix the plum handle screw and the moving hose. The distance between adjacent holes is 7 cm.\nPlace the adjustable plum blossom handle screw at both ends of the heat insulation network made of 304 stainless steel and connect to the fixed heat insulation network and the fixed strip.\nConnect the upper end of each placement slot with a liftable heat insulation network surrounded by a galvanized plate frame. Connect this frame to the plum blossom handle screw at both ends. Place 304 stainless steel circular mesh material in the middle of the heat insulation network to prevent the ash from falling and scalding the rats and to fix the rats to facilitate moxibustion.\nAffix the bottom end of the stainless steel movable hose (34 cm long) with a stainless steel fixed strip and the upper end with the pipe clamp connection plate.\n\t\tNOTE: The movable hose is convenient for adjusting the position of the moxa stick during the suspension moxibustion operation.\nUse the tube clamp made of aluminum alloy to connect the stainless steel movable hose and the moxa clip.\nConnect the stainless steel moxa clip to the pipe clamp connection plate, and fix 8-10 moxa strips simultaneously for moxibustion.\n\t\tNOTE: The movable hose, tube clamp connecting plate, and moxa clip can be used for suspension moxibustion operation in rats.\n2. Establish a rat model of chronic renal failure",
    "Acclimate 24 specific pathogen-free (SPF) SD male rats (aged 3-4 weeks, weighing 180-200 g) for 1 week. Keep the feeding temperature at 18-24 °C; relative humidity at 40-70%; and a 12 h light and 12 h dark cycle. House six animals in every cage and provide free access to water and common feed.\nEstablish the rat model of CRF. According to the random number table and following this protocol, select six rats as the control group and the remaining 18 as the model group. Treat the control group (n = 6) with distilled water (10 mL∙kg-1∙day-1) and normal feed and the model group (n = 18) with adenine suspension (150 mg kg-1∙day-1) and high-protein feed for 21 days.\nObserve and record the body weight, mental status, and diet daily. After the end of 21 days, ensure that all the animals are fasted for 12 h before orbital blood sampling.\nCollect the orbit blood samples.\n\t\nGrab the rat's back with the non-dominant hand, hold the rat's head and face symmetrically between the thumb and forefinger, fully expose one side of the rat's canthus, and hold this position.\nWith the dominant hand, hold 3 cm long melting point capillaries between the thumb and forefinger and slowly twist the capillary, entering the rat's inner canthus venous plexus at 45° until the blood slowly flows out of the tube.\nCollect 150-200 µL of blood samples in 0.5 mL blood collection anticoagulant tubes, gently pull out the capillaries, and press the orbit with cotton.\nShake the anticoagulant tube quickly and thoroughly. Measure serum creatinine (Scr) and blood urea nitrogen (BUN) using an automatic biochemical analyzer.\n\tNOTE: The increase in Scr and BUN indicates the successful establishment of the model of CRF.",
    "Divide the rats into four groups: A: six control rats, no treatment; 18 model rats divided into groups B: (model group: no medication or moxibustion), C: (losartan potassium group: administered 2.33 mg∙kg-1∙day-1 by gavage needle 12 G), and D: (herbal-cake-separated-moxibustion group: herbal-cake-separated-moxibustion applied to bilateral Shenshu [B23] and bilateral Pishu [B20]).\n3. Treatment phase\nNOTE: Groups A and B are not given any treatment, while groups C and D will be treated once a day for 24 days, with two days off after 12 days of treatment.\nPreparations before treatment\n\t\nPrepare 300 g of dried Radix astragali, 300 g of dried Radix Codonopsis, 200 g of dried Radix Rehmanniae Praeparata, 100 g of roasted Shorthorned Epimedium Herb and 100 g of Cornus officinalis. Mix these powders.\nPut 500 g of Artemisiae Argyi Folium into the traditional Chinese medicine crusher (speed of 34,000 rotations/min) for 5 min, transfer the ground powder onto a plate, and then screen with a 600 mesh sieve. After two screening rounds, eliminate the coarse moxa and transfer the fine moxa to a bag for use (Figure 2).\nPrepare the moxa cone by filling the fine moxa into the mold to make a small moxa cone of 0.5 cm diameter and 0.5 cm height. Alternatively, malaxate the moxa between the thumbs and index fingers of both hands to form moxa cones (Figure 3A).\nPrepare the herbal cake mold by cutting a 5 mL syringe into four 0.5 cm thick circular plastic rings and gluing the four rings on the same horizontal plane (on the corners of a square plane with a side length of 26 mm, Figure 3D).",
    "Make medicine cakes by mixing the powder and water in a 1:1 ratio and filling the mixture into the herbal cake mold (Figure 3E). Leave the medicine cake in the mold and store it in a dry place.\nMarking the acupoints\n\t\nLocate the acupoints as follows: Shenshu (B23), both sides of the second lumbar vertebra, one acupoint on each side; Pishu (B20), the intercostal of the 11th thoracic vertebra on both sides, one acupoint on each side (Figure 4).\n\t\tNOTE: For the location of the acupoints, refer to the Manual of Acupuncture for Experimental Animals20.\nWear a thick rubber glove on the non-dominant hand to gently cover the rat's head, locate the acupoints on the rat's back with the dominant hand, and then mark the acupoints with a color marker.\nPlacing the rats\n\t\nWear thick rubber gloves. Use the thumb and the other four fingers of the dominant hand to slightly pinch the skin on the back and the neck of the rat. Use the thumb and index finger of the non-dominant hand to pinch the rat's tail gently.\nLift the rat, align the head of the rat into the placement slot of the special moxibustion platform, and move the rat slowly forward. Ensure that the front paw of the rat is close to the edge of the placement slot and that the rat climbs into the slot.\n\t\tNOTE: Before catching the rat, touch the back of the rat gently or talk to it to calm it. Adjust the height of the insulation network from a low position (when not in use) to the highest, which is convenient for rats to enter.\nRat fixation",
    "Place the thumb and index fingers of both hands at the screw of the plum blossom screw at both ends of the heat insulation network. Unscrew the plum blossom screw to lower the heat insulation net to the appropriate position, close to the back of the rat, but not causing compression, and then tighten the screws.\nPlacing the moxa cone and medicated cake.\n\t\nPlace the prepared mold containing the medicine cake on the heat insulation net corresponding to the acupoints of both Pishu (B20) and Shenshu (B23) according to the marks of acupoints on the rats. There are four acupoints, each of which corresponds to a medicine cake.\nPlace the moxa cone on the medicated cake smoothly and steadily.\nMoxibustion\n\t\nLight the moxa cone with a lighter and start moxibustion till the moxa cone burns out and the residual heat dissipates naturally (the wet medicated cake dries up).\nReplace the burnt-out moxa cone with a new moxa cone and medicated cake on the same acupoint and continue moxibustion till the moxa cone burns out and the medicated cake dries. Repeat this for a total of 5x at each acupoint.\nExtinguish the moxa cones and the medicated cakes in a water-containing waste tank after burning five moxa cones at each acupoint.\n\t\tNOTE: Each acupoint receives five cones of moxibustion; each moxa cone can be replaced after burning out.\nReturning the rat to the cage",
    "Put the empty rearing cage in front of the rat, close to the lower end of the placement slot of the moxibustion platform, and keep still. Pat lightly the rat's buttock so that the rat can move from the placement slot to the feeding cage. After the rat enters, put down the cage. Use the dominant hand to grasp the fur on the back of the rat, hold the rat firmly, and place it on the ground for further observation.\nObserve whether the rats have shortness of breath, whether the mood is stable, and whether the skin surface is scalded. If there is no abnormality, put it back in the cage. If it is scalded, immediately apply the scald ointment on the skin surface and place it in a single cage.\n4. Sampling phase\nAfter 24 days of treatment, prepare the rats for 12 hours of fasting before sampling.\nPour isoflurane into the gas anesthesia machine and anesthetize the rats with 2-3% isoflurane. After 2-3 min, ensure that reflexes are absent (pinch the tail with surgical tweezers to check that they do not have any reflex) and continued existence of a heartbeat and switch to maintenance anesthesia with 1-1.5% isoflurane.\nCollect 5 mL of blood from the abdominal aorta by inserting the needle into the quasi-abdominal aorta. Let the blood stand for 2 h, centrifuge at 2490 × g for 10 min at 4 °C, and transfer the plasma supernatant to a 1.5 mL microcentrifuge tube for further analysis.\nEuthanize the rats by cervical dislocation.\nHarvest tissues from both kidneys by stripping the bilateral renal fascia and fat with surgical scissors and tweezers and rinsing with 0.9% normal saline. Weigh the left and right kidneys and record the weight and morphology.",
    "Preserve the renal tissue by cutting the left kidney into six parts and putting them into a 50 mL centrifuge tube containing 4% paraformaldehyde for soaking, fixation, and preservation. Cut the right kidney into six pieces using a knife in the longitudinal direction and two knives in the transverse direction. Place these pieces into six 2 mL Cryotubes and immediately put them in liquid nitrogen; transfer them to a -80 °C freezer for storage.\n5. Detection phase\nUse the right kidney tissue of appropriate size for protein extraction, gel electrophoresis, membrane transfer, blocking, primary antibody incubation, secondary antibody, chemiluminescence, development, fixation, and film scanning.\nUse a gel image data analysis system (e.g., Image-Pro Plus 6.0) to analyze the band's gray value and calculate each protein's content.\nSubject the left kidney tissues to dehydration, clearing, embedding in paraffin, sectioning (thickness of 4 µm), staining with hematoxylin-eosin and Masson's trichrome stain, and observe the pathological changes21 in the renal tissue under a light microscope at 200x magnification.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}