{
  "id": 2555,
  "origin_website": "Cell",
  "title": "Protocols for genetic labeling and tracing of Staphylococcus xylosus during tumor progression",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nBelow we provide a step-by-step method for genetic labeling of S. xylosus, which includes construction of plasmid and screening for recombinant clones. We used the genetically labeled recombinant strain to perform bacteria tracing experiment in a murine MMTV-PyMT breast tumor model.\nConstruction of the plasmid\nTiming: 3–4 days\nThis step includes amplification of homologous regions, GFP, Erm cassette for the construction of plasmid, and Gibson assembly reaction to seamlessly ligate various fragments in one step (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2059-Fig2.jpg\nFigure 2. Guide for construction of the plasmid\nVector linearization.\nCheck the quantity of plasmid and if it’s not enough for next step, miniprep the plasmid in E. coli Top10 competent cells.\nThaw competent cells on ice and add 1 ng plasmid in the tube, mix by gentle tapping and incubate on ice for 25–30 min.\nTransfer the tubes to 42°C and heat shock for 45 s.\nTransfer the cells back to ice and chill for 2 min.\nAdd 1 mL of LB media (maintained at 37°C) and recover the cells by incubating at 37°C for 60 min with horizontal shaking at 200 rpm.\nSpread 100 μL of the cells on LB agar plate containing 50 μg/mL ampicillin, and culture for around 12 h at 37°C.\nInoculate a single colony in 50 mL LB culture and extract plasmid using TIANGEN Plasmid Extraction Kit.\nLinearize the pBT2 plasmid by PstI and BamHI restriction enzyme digestion. Set up the following reaction on ice and digest the plasmid at 37°C for 2 h.\ntable:files/protocols_protocol_2059_3.csv\nRun the digestion products on a 1% agar gel to confirm the plasmid is linearized.\nCut the expected band and extract linearized plasmid from the gel with Zymoclean Gel DNA Recovery Kit. Follow the instructions: https://files.zymoresearch.com/protocols/_D4001T_D4001_D4002_D4007_D4008_Zymoclean_Gel_DNA_Recovery_Kit_ver_1_2_1_LKN-SW_.pdf[href=https://files.zymoresearch.com/protocols/_D4001T_D4001_D4002_D4007_D4008_Zymoclean_Gel_DNA_Recovery_Kit_ver_1_2_1_LKN-SW_.pdf].",
    "Amplify the left and right homologous arm regions, GFP and Erm cassette.\nAmplify the homologous arms from S. xylosus genome. GFP-Erm cassette with codon optimization was outsourced and synthesized (refer to this website to do codon optimization: http://genomes.urv.es/OPTIMIZER/[href=http://genomes.urv.es/OPTIMIZER/]).\ntable:files/protocols_protocol_2059_4.csv\nNote: Genome DNA quantity should be around 200 ng while the plasmid DNA quantity should be less than 1 ng.\ntable:files/protocols_protocol_2059_5.csv\nNote: ∗ annealing temperature: refer to the Tm calculator to ensure successful PCR (https://tmcalculator.neb.com/[href=https://tmcalculator.neb.com/]).\nTake 2 μL of PCR product and run it on the agar gel to confirm the size.\nRetrieve the PCR product with Zymoclean Gel DNA Recovery Kit. Follow the instructions: https://files.zymoresearch.com/protocols/_D4001T_D4001_D4002_D4007_D4008_Zymoclean_Gel_DNA_Recovery_Kit_ver_1_2_1_LKN-SW_.pdf[href=https://files.zymoresearch.com/protocols/_D4001T_D4001_D4002_D4007_D4008_Zymoclean_Gel_DNA_Recovery_Kit_ver_1_2_1_LKN-SW_.pdf].\nSequence the PCR product and the correct one can be used for further steps.\nGibson assembly reaction. Set up the following reaction and run a Gibson assembly program at 50°C for 30 min followed by 80°C for 20 min to inactivate the enzyme.\ntable:files/protocols_protocol_2059_6.csv\nTransformation of Gibson assembly product in E. coli Top10 competent cells.\nThaw the E. coli Top10 competent cells on ice (100 μL per tube).\nAdd 10 μL reaction product into competent cells. Mix by gentle tapping and incubate the competent cells on ice for 25–30 min.\nTransfer the tubes to 42°C and heat shock for 45 s.\nTransfer the cells back to ice and chill for 2 min.\nAdd 1 mL of LB media (maintained at 37°C) and recover the cells by incubating at 37°C for 60 min with horizontal shaking at 200 rpm.\nCentrifuge at 1200 rpm (around 13800 g) for 1 min to harvest all the bacteria.\nDiscard around 1 mL supernatant and resuspend in 100 μL LB left in the tube. Spread the cells on LB agar plate containing 50 μg/mL ampicillin, and culture for around 12 h at 37°C.\nDo genotyping to confirm the correct colonies.",
    "Pick individual colonies into 20 μL H2O.\nOptional: You can skip step b and c, directly perform step d. Step b and c enable initial screening of the correct colonies, while step d enables final confirmation of the plasmid.\nSet up the following reaction on ice and run the PCR program. This region detects the ligation of left arm and GFP-Erm cassette. The PCR product is short and enable for initial screening of correct colonies.\ntable:files/protocols_protocol_2059_7.csv\ntable:files/protocols_protocol_2059_8.csv\nRun the PCR product on 1% gel, the product size according to our design is around 860 bp.\nIf the product size is correct, the colony suspension should be used to perform following PCR reaction. This reaction will get full length of inserted sequence in the constructed plasmid.\ntable:files/protocols_protocol_2059_9.csv\ntable:files/protocols_protocol_2059_10.csv\nRun 2 μL of the PCR product on 1% gel, the product size according to our design is around 4 Kb. If the size right, the rest PCR product will be subjected to sequencing validation with following primers: PBT2_test-F, Left_F_PBT2, GFP-F, Erm-F-GFP, PBT2_test_R.\nIf the sequencing confirms the expected construct, grow the rest colony suspension in LB containing 50 μg/mL ampicillin at 37°C with horizontal shaking to amplify the plasmid.\nExtract the plasmid using TIANGEN Plasmid Extraction Kit. Concentrate the plasmid in deionized water. The concentration of plasmid should be more than 500 ng/μL.\nCritical: Sequence the constructed plasmid to make sure there is no mutation or deletion.\nPreparation of electrocompetent S. xylosus for transformation\nTiming: 10–18 h",
    "This step includes the preparation of electrocompetent cells of S. xylosus and transformation of S. xylosus. We referred to the original paper (Bruckner, 1997[href=https://www.wicell.org#bib1]), but made minor revisions accordingly. S. xylosus was isolated from breast tumor tissues of MMTV-PyMT mice (Figure 3[href=https://www.wicell.org#fig3]). To isolate S xylosus, 0.2 g PyMT tumor tissue was homogenized in 1 mL PBS and 100 μL homogenate was plated in CBA plates. After 24 h’s culture at 37°C with 5% CO2, this S xylosus strain is commonly identified on the plate by 16S sequencing.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2059-Fig3.jpg\nFigure 3. Guide for preparation of electrocompetent S. xylosus for transformation\nCompetent cell preparation\nInoculate a single S. xylosus colony and grow in 1 mL BHI media for around 12 h. Inoculate the culture at 1:100 dilution in 50 mL BHI media and grow at 37°C to an OD600 of 0.4–0.5.\nNote: This step usually takes 2.5–3 h with 1:100 inoculated S. xylosus. It also works to directly inoculate a colony into 50 mL BHI and culture, but takes longer time.\nWhen culture reaches the expected OD600, cool down the cell culture on ice for 10 min. Pre-chill the centrifuge to 4°C and all the centrifugation must be performed at 4°C.\nHarvest the cells by centrifugation, 2,800 × g for 10 min. Wash the cells with 30 mL ice-cold 10% glycine solution. Put the cells on ice for around 5 min.\nRepeat step 9 for three times but wash cells with 10 mL, 2.5 mL and 1 mL ice-cold 10% glycine solution, respectively.\nTransformation\nResuspend cells with 200 μL 10% glycine solution. Mix plasmid DNA (around 5 μg, no more than 5 μL) with competent cells and incubate for 30 min at room temperature, around 25°C.\nNote: The transformation must be performed with freshly prepared competent cells.",
    "Electroporate the DNA-cell mixture (100 μL) at Pulse (2 kV, 25 μf, 100 Ohm) in 0.1 cm gap cuvette. Resuspend the cells immediately after pulse with 1 mL 37°C pre-warmed BHI containing 0.5 M sucrose. Outgrow the cells for 1 h at 37°C with horizontal shaking.\nPrecipitate the cells with centrifugation at 12000 rpm (around 13800 g) for 1 min. Discard supernatant and leave around 100 μL culture medium to resuspend the cells. Spread 100 μL cells on BHI+0.5 M sucrose agar plates containing 12.5 μg/mL chloramphenicol.\nColonies are usually visible after 24 h’ culture.\nCritical: According to our experience, transformation efficiency varies but is very low in general, you can only get several colonies in each experiment. Higher concentration of chloramphenicol delays the colony growth.\nPause point: The plate can be stored at 4°C for no more than 1 month.\nInduction of recombination and selection of clones that are genetically labeled\nTiming: 7–15 days\nThis step includes the details about the induction of recombination with different concentrations of erythromycin and temperatures, and selection of clones that are genetically labeled using genotyping and antibiotics (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2059-Fig4.jpg\nFigure 4. Guide for induction and selection of correct clones\nInoculate a colony in 1 mL B-medium (10 μg/mL Cm) and grow at 37°C with horizontal shaking at 200 rpm to late-stationary phase.\nInoculate the culture 1:100 into 100 mL fresh B-medium containing 10 μg/mL Em, grow at 30°C to late-stationary phase.\nNote: The plasmid can stably replicate in the S. xylosus at low temperatures like 30°C.\nDilute the culture 1:100 into 100 mL fresh B-medium containing 2.5 μg/mL Em and grow at 40°C to late-stationary phase.",
    "Note: S. xylosus may grow slower when transferred from 30°C to 40°C. When grow S. xylosus at 40 or higher degrees, the plasmid will be gradually lost because of the temperature sensitive replicon.\nRepeat step 17 once.\nNote: The plasmid is using a temperature sensitive replicon which at high temperature does not replicate. Therefore, extended time of culturing at high temperature can further promote the loss of plasmid and increase the efficiency of selection of recombinant clone.\nDilute the culture 1:100 into 100 mL fresh B-medium without antibiotics and grow at 42°C to late-stationary phase.\nPerform serial dilution of the culture and spread on B-medium agar plates containing 2.5 μg/mL Em.\nNote: Recommended dilution fold: 10ˆ4, 10ˆ5, 10ˆ6, 10ˆ7.\nPick around 50 colonies into 20 μL sterilized water and validate whether the colonies are recombinant ones with GFP-Erm cassette integrated at the right locus (Figure 5[href=https://www.wicell.org#fig5]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2059-Fig5.jpg\nFigure 5. Expected results for selection of correct clones\n(A) Screening of successful recombinant clones.\n(B) Screening of clones that lost plasmid.\n(C) FACS analysis of GFP expression level of recombinant S. xylosus.\nNote: In the original paper that we referred to, they did antibiotics selection first. It’s absolutely okay to do antibiotics selection step first. In our experience, we found that most colonies already had the GFP-erm cassette integrated in the genome, but still contain plasmid. So we think that the recombination occurs faster than the loss of plasmid. So, we chose to select correct colony first, then do antibiotics selection to identify the colonies that lose plasmid.\nSet up following PCR reaction buffer on ice.\ntable:files/protocols_protocol_2059_11.csv\ntable:files/protocols_protocol_2059_12.csv",
    "Run the PCR product on 1% gel, according to our design, the expected PCR product size is around 1.8 kb (Figure 5[href=https://www.wicell.org#fig5]A). If the size of PCR product is correct, perform step 22 to further validate the integration locus; if not, repeat steps 16–21 and do another round of screening.\nNote: The efficiency of gene replacement varies for different gene loci. You may need to try several rounds to get the correct clone.\nAmplify the full length of integration cassette with adjacent genomic fragments.\nSet up the following reaction buffer on ice and run the PCR program.\ntable:files/protocols_protocol_2059_13.csv\ntable:files/protocols_protocol_2059_14.csv\nSequence the PCR product. If the sequence flanking the GFP-Erm cassette align well with the genome locus, it indicates a correct recombinant strain and a successful genetic labeling.\nAfter getting the correct colony, grow the cells at 40°C to late-stationary phase, dilute the culture and spread on B-medium agar plates containing Cm and plates without antibiotics. Culture at 37°C for 12 h for no antibiotics plates and 24 h for Cm plates.\nIf the colony number on Cm plates is much less than that on plates without antibiotics (which means some colonies already lost their plasmids), then pick around 50 colonies on plates without antibiotics in 20 μL sterilized water and spot 3–5 μL on the plates containing Cm and plate containing Erm, respectively (Figure 5[href=https://www.wicell.org#fig5]B). The colonies that can grow on Erm plate but not on Cm plate are correct colony without plasmid. Do genotyping to confirm the gene replacement.\nNote: You can use multi-channel pipette to spot the colony on plate with antibiotics. Bacteria clones devoid of plasmid but with successful genome integration are sensitive to chloramphenicol resistance, but resistant to erythromycin.",
    "Grow the cells in BHI with Em (2.5 μg/mL) and resuspend the cells with PBS. Do FACS analyze to test whether the GFP is expressed. Expected FACS plot of positive recombinant strain is illustrated in Figure 5[href=https://www.wicell.org#fig5]C.\nTracing the dynamics of S. xylosus in MMTV-PyMT mTmG breast tumor mice\nTiming: 17–40 days\nThis step includes the details about tracing recombinant bacteria in vivo in MMTV-PyMT mTmG breast tumor mice. Recombinant bacteria are injected into tumor tissues and detected in breast tumors and metastatic tumors in lungs (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2059-Fig6.jpg\nFigure 6. Guide for three different tracing strategies\nWhen the PyMT spontaneous tumors were palpable, precondition mice with doxycycline (0.2 mg/mL) in drinking water for 5 days to clear all the bacteria in tumor.\nCritical: The doxycycline should be replenished every 2–3 days and be sure to protect it from light. This step highly increases the colonization of injected bacteria.\nRecover mice with normal drinking water for 3 days.\nGrow the genetically labelled S. xylosus strain with BHI containing 2.5 μg/mL Em. Measure OD600 value, calculate the density (CFU/mL) and resuspend the recombinant S. xylosus to 10ˆ7 CFU/100 μL with DMEM/F12 buffer. Inject 100 μL bacteria suspension into tumor for each mouse and once every 10 days for 3 times.\nAnesthetize the mouse and swab the skin of injection site with 75% alcohol cotton.\nInject 100 μL bacteria suspension in total into each tumor as there are tumors grown at each mammary gland.\nNote: Use 1 mL BD insulin syringe to inject bacteria.\nPress the injection site with dry sterile cotton to stop bleeding. Place the mice in clean cages.",
    "Note: Three times of injection may increase the colonization of bacteria, especially when the tracing is long-term. The colonization of S. xylosus varies for different mice and one shot of S. xylosus administration can also successfully colonize the S. xylosus in tumor.\nCritical: Autoclave the tubes, scissors, tweezers, glass homogenizers and PBS before sacrifice the mice and all the procedure should be performed in the clean and sterile cell culture hood.\nSeven days after the third injection, sacrifice the mice and dissect the lung and tumor tissue, put on ice.\nImage lung under fluorescence dissection microscope to count the metastasis. Tumor cells were labeled with tdTomato reporter. Usually, lung metastases are visible under the fluorescent dissection microscope as shown in Figure 7[href=https://www.wicell.org#fig7]A. So the brighter dots are metastases.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2059-Fig7.jpg\nFigure 7. Analysis of recombinant S. xylosus in the lung after different ways of injection of bacteria\n(A) Detect recombinant S. xylosus in tumors and lungs of MMTV-PyMT mTmG mice after intratumor injection of recombinant S. xylosus.\n(B) Analysis of recombinant S. xylosus in the lungs. Ntumor inj met+=16, Ntumor injmet-=3, NBac tail vein=5, NBac-tumor tail vein=5 (Fu et al., 2022[href=https://www.wicell.org#bib3]).\nAdd 1 mL sterilized ice-cold PBS to the lung and homogenize the lung with sterilized glass homogenizer. Spread the homogenate 100 μL per CBA plate and 10 plates in total.\nOptional: Mince the tissue into small pieces (∼1 mm) will make the homogenization more complete especially for tumor tissue.\nTransfer the tissue pieces with PBS with wide-orifice tips to the glass homogenizer. Homogenize the tissue until the tissue is fully disintegrated.\nTransfer the tissue slurry back to the 1.5 mL EP tube.\nNote: The glass homogenizer needs to be pre-chilled on ice, and the homogenization should be performed all through on ice.",
    "Take around 200 mg tumor tissues in tubes, add 1 mL PBS and homogenize the tumor tissues as described in step 31. Dilute 10- and 100-fold with PBS and spread on the CBA plate.\nCulture the plates at 37°C for 24 h. Pick the colonies and follow step 21a to perform genotyping for the recombinant strain (Figure 7[href=https://www.wicell.org#fig7]A).\nTracing S. xylosus’s colonization in lung together with host tumor cells via tail vein injection\nTiming: 10 days\nThis step includes the details about tracing recombinant bacteria hijacking host tumor cells in the lungs of normal mice via tail vein injection (Figure 6[href=https://www.wicell.org#fig6]).\nDigest tumor cells follow the protocol and plate 5∗10ˆ5 MMTV-PyMT tumor cells on the 6-well-plate. Add penicillin/streptomycin to final concentration 0.25× (stock concentration is 100×).\nNote: Mouse breast tumors were dissected and digested according to this protocol (Cai et al., 2017[href=https://www.wicell.org#bib2]) with minor revisions.\nTake around 1 g of mouse breast tumors and put the tissues in a 10 cm dish (non-adhesive flat plate).\nAdd 9.5 mL DMEM/F12 media into the plate. Chop the tumor tissues with razor blade into 1 mm small pieces.\nAdd collagenase type 3 (300 U/mL) and hyaluronidase (100 U/mL) to digest the tissue. Incubate the tissues at 37°C for 2 h with 5% CO2. Gently pipette the tissues every half an hour.\nPool the digested tissues into a 50 mL conical and spin down at 1500 rpm (around 420 g) for 5 min.\nDiscard the supernatant and flick the bottom of the tube to loosen the cells. Add 5 mL ACK to lysis the red blood cells on ice for 5 min.\nAdd HBSS+2%FBS to stop the reaction and spin down at 1500 rpm (around 420 g) for 5 min.",
    "Discard the supernatant and add 5 mL pre-warmed 0.25% trypsin-EDTA. Pipette the pellet up and down with cutted wide tips to dissociate the cells. Put the tube at 37°C water bath for 5 min.\nAdd HBSS+2%FBS to disturb the digestion reaction. Spin down the cells at 1800 rpm (around 600 g) for 5 min.\nDiscard the supernatant and add 0.1 mg/mL DNaseⅠ in DMEM/F12 media. Put the tube at 37°C water bath for 5 min.\nAdd HBSS+2%FBS to disturb the digestion reaction and filter the cells through a 40 μm mesh.\nCount the dissociated cells and resuspend the cells in designated medium for subsequent culture or freeze.\nWhen the cells are 90% confluent, inoculate a recombinant S. xylosus colony in 1 mL BHI and grow at 37°C with horizontal shaking for around 10 h. Dilute and measure OD600 value, calculate the density with the standard curve.\nChange culture media of MMTV-PyMT cells to fresh culture medium without antibiotics. Add 2∗10ˆ7 CFU recombinant S. xylosus (at MOI=1:20) into the medium and mix well. Recombinant S. xylosus can adhere and invade cells in this step.\n4 h after co-culture, discard the medium and change to fresh culture medium with penicillin/streptomycin (final concentration is 0.25×) to inhibit the growth of extracellular recombinant S. xylosus while do not influence the intracellular recombinant S. xylosus. Antibiotics can also force the recombinant S. xylosus to invade the tumor cells.\nNote: Co-culture with recombinant S. xylosus in culture medium without penicillin/streptomycin for longer time cause overgrowth of S. xylosus. While extended incubation with penicillin/streptomycin would cause S. xylosus death and decrease S. xylosus invasion rate.\n5 h post culture medium change, wash three times with PBS to exclude extracellular S. xylosus.\nDigest the cells with trypsin at 37°C for 4 min.",
    "Terminate cell digestion by adding 5-fold volume of PBS with 2% FBS. Transfer the cells into tubes.\nCentrifuge at 350 × g for 5 min to pellet cells.\nWash once with 1 mL PBS.\nResuspend cells with 0.2 mL DMEM/F12 medium. Count total cells and make the final cell density to 10ˆ6 cells/100 μL. Put the cells on ice.\nInject cells into mouse with 1 mL syringe via tail vein, 100 μL per mouse.\nPut the mouse in a cyclindrical restraint tube to keep still.\nRotate the mouse to make the vessels at proper position for injection.\nThe needle should be parallel to the tail. Insert the needle into tail vein and inject the cell suspension in a slow and fluent motion.\nNote: Stop immediately if you feel strong obstruction, that may because the needle is not in the vessel. Rotate the mice and try to inject another vein.\nAfter injection, withdraw the needle and press the injection site with sterilized cotton. Transfer the mice into a new cage.\nSacrifice the mice 7 days post injection and dissect out the lungs. Add 1 mL sterilized ice-cold PBS to the lung and homogenize the lung with sterilized glass homogenizer. Spread the homogenate 100 μL per CBA plate and 10 plates in total.\nCulture the plates at 37°C for 24 h. Pick the colonies and perform genotyping according to step 21a to validate the recombinant strain.\nTracing S. xylosus’s colonization ability in lung via tail vein injection\nTiming: 10 days\nThis step includes the details about tracing recombinant bacteria in the lungs of normal mice via tail vein injection (Figure 6[href=https://www.wicell.org#fig6]).",
    "Pick a recombinant S. xylosus colony in 1 mL BHI for around 10 h. Dilute and measure OD600 value, calculate the density (CFU/mL) and resuspend S. xylosus in PBS to a final concentration 10ˆ7 CFU/100 μL.\nInject 100 μL bacteria culture of designated density per mouse through tail vein.\nPut the mouse in a cyclindrical restraint tube to keep still.\nRotate the mouse to make the vessels at proper position for injection.\nThe needle should be parallel to the tail. Insert the needle into tail vein and inject the bacteria suspension in a slow and fluent motion.\nNote: Stop immediately if you feel strong obstruction, that may because the needle is not in the vessel. Rotate the mice and try to inject another vein.\nAfter injection, withdraw the needle and press the injection site with sterilized cotton. Transfer the mice into a new cage.\nSacrifice the mice 7 days after bacteria administration. Add 1 mL sterilized ice-cold PBS to the lung and homogenize the lung with sterilized glass homogenizer. Spread the homogenate 100 μL per CBA plate and 10 plates in total.\n24 h after culturing the plates at 37°C, pick the colonies and perform genotyping following step 21a to validate the recombinant strain."
  ],
  "subjectAreas": [
    "Microbiology",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}