{
  "id": 18814,
  "origin_website": "Jove",
  "title": "Quantification of Breast Cancer Cell Invasiveness Using a Three-dimensional (3D) Model",
  "procedures": [
    "1. Three-dimensional Culture of Breast Cancer Cells in Basement Membrane Matrix (The Embedment Technique)\nHandling Matrigel basement membrane matrix: Thaw on ice overnight at 4 °C. Basement membrane matrix is liquid at low temperature but solidifies at room temperature. Keep basement membrane matrix on ice (Figures 1A-B).\nCover the Confocal No.1 glass-bottom dish with 50 μl of basement membrane matrix by means of spreading the matrix using the tip of a P-200 Pipetman in a spiral pattern (Figure 1C). Use caution when spreading the basement membrane matrix to avoid the formation of air bubbles. Likewise, avoid spreading the matrix to close to the borders of the glass-bottom dish to prevent meniscus formation. If inexperienced handling basement membrane matrix, then precooled the dish, P-200 Pipetman and pipettes can be on ice (alternatively left overnight in a fridge at 4 °C). This step offers additional time to spread the basement membrane matrix before solidification. Place the dish(es) in a cell culture incubator (at 37 °C with 5% CO2) for at least 30 min to enable the basement membrane matrix to solidify (Figure 1D).\nWhile the matrix is undergoing solidification, trypsinize a 70-80% confluent 100-mm plate of cells. Once the cells have begun lifting off of the plate, resuspend them in 10 ml of RPMI 1640 medium containing 10% (v/v) fetal bovine serum (FBS), to inactivate the trypsin (Figure 1E). Then transfer the resuspended cells into a 15 ml conical tube (Figure 1F).\nSpin the cells (present in conical tube) at 100 x g for 3 min in a dedicated cell culture centrifuge (Figures 1G-H).",
    "While the cells are being spun down, aliquot 50 μl of matrix into an 1 ml microcentrifuge tube (note: each glass-bottomed dish is allocated one microcentrifuge tube; hence, if the experiment requires 3 dishes, then it follows that 3 microcentrifuge tubes are necessary as well), and then place the tube on ice (Figure 1B).\nAspirate the medium from the conical tube from step 1.4, whilst leaving the pellet undisturbed (Figure 1I). Resuspend cells (that have been spun down) in 1 ml of FBS-supplemented RPMI medium (Figure 1J).\nOnce the cells are counted using a hemocytometer (Figure 1K), or a cell particle counter aliquot 2.5 x 104 cells into the microcentrifuge tube and top it off using appropriate media so as to obtain total volume of 50 μl (Figure 1L).\nMix the cells from step 1.7 (25,000 cells in 50 μl) with the matrix-containing microcentrifuge tube from step 1.5 in a 1:1 ratio; final volume will be 100 μl (Figure 1M).\nGently plate 100 μl of the matrix:cell mixture from step 1.8 onto the solidified basement membrane matrix-coated dish from step 1.2 (Figure 1N). This allows for cells to be embedded in basement membrane matrix.\nTransfer the dish(es) into the cell culture incubator (at 37 °C with 5% CO2) and allow the matrix:cell mixture to solidify for at least 30 min.\nOnce the matrix:cell mixture is solidified, add 2 ml of FBS-supplemented RPMI media to the dish (Figure 1O) and take the dish back the incubator where it will be stored for the remainder of the experiment (Figure 1P).\nChange media every day for a period of 5 days (or as per required for an assay; the duration of the assay for MDA-MB-231 cells is 5 days in length).",
    "Using a light microscope, take differential interference contrast (DIC) images of the MDA-MB-231 colonies suspended in basement membrane matrix (Figure 3A). Image 20 representative areas at 10X objective once a day for five days to determine colony morphogenesis (Figure 3C).\nAnalyze images blindly to determine cell colony stellate formation (Figure 3B). A colony is deemed to be stellate if one or more projections from the spheroid of cells are perceived. To determine the percentage of invasive stellate colonies, divide the number of stellate colonies by the total number of cell colonies per acquired image, and then average the stellate colonies percentages of the 20 images for each day.\nimgsrc://cloudfront.jove.com/files/ftp_upload/51341/51341fig1highres.jpg",
    "Figure 1. Three-dimensional culture of MDA-MB-231 breast cancer cells in basement membrane matrix (the embedment technique). A-B) A schematic of the experimental setup (performed in the fume hood). C) The well of the glass-bottomed dish coated with 50 μl of basement membrane matrix. D) Dish(es) placed in a cell culture incubator (at 37 °C with 5% CO2) to permit the matrix to solidify for at least 30 min. E) Cells were trypsinized. F) Cells were resuspended into a 15 ml conical tube. G-H) Cells (present in conical tube) were spun down at 100 x g for 3 min in a tissue culture centrifuge. I) Cell pellet. J) Cells (that have been spun down) were resuspended in 1 ml of FBS-supplemented RPMI medium. K) Cells were counted using a hemocytometer. L) 2.5 x 104 cells aliquoted into the microcentrifuge tube and topped off using appropriate media so as to obtain total volume of 50 μl. M) Mix cells from step 1.7 (25,000 cells in 50 μl) with the matrix-containing microcentrifuge tube from step 1.5 in a 1:1 ratio; final volume will be 100 μl. N) Gently plate 100 μl of the matrix: cell mixture from step 8 onto the solidified matrix-coated dish from step 1.2. O) Once the matrix:cell mixture is solidified, add 2 ml of FBS-supplemented RPMI media to the dish. P) Place the dish in the incubator where it will be stored for the remainder of the experiment.\n2. Examination of Morphogenic Features of 3D Cultures with Immunofluorescence\nSet up an ice tray, cold phosphate buffered solution (PBS), 20% acetone: 80% methanol (fixative solution), and 3% bovine serum albumin (BSA; blocking solution) (Figure 2A) before taking out the dish(es) from the incubator.",
    "Place the dish(es) on the ice tray and aspirate media, then wash 3x with 2 ml of cold PBS (Figure 2B).\nOnce the last PBS wash is aspirated, add 2 ml of 20% acetone: 80% methanol solution into the dish(es) (Figure 2C) to fix the cells for 20 min at 4 °C (either on ice, or in a refrigerator) (Figure 2D).\nOnce the 20 min of fixation is terminated, bring the dishes back at room temperature, aspirate the fixative, and subsequently wash 3x with PBS. Once the final PBS wash is aspirated, add 2 ml of 3% BSA to the dish(es) to block for at least 30 min at room temperature (Figure 2E).\nDuring the blocking period prepare dilutions of primary (laminin V 1:100) and secondary antibodies (at appropriate dilution) dissolved in 3% bovine serum albumin (BSA) blocking buffer. Please note that 400-500 μl the ‘BSA + primary antibody’ solution should be added directly onto the matrix: cell mixture.\nOnce the 30 min of blocking have expired, add the primary antibodies and incubate for at least 1 hr at room temperature (Figure 2F). Please note that no PBS washes should be performed following the 30 min blocking period.\nUpon completion of step 2.6, remove the ‘BSA + primary antibody’ solution, and wash 3x with PBS.\nAdd the secondary antibody dissolved in 3% BSA (at appropriate dilution) directly onto the matrix: cell mixture, cover the dishes and incubate for 1 hr at room temperature (Figure 2G).\nRemove the ‘BSA + secondary antibody’ solution, and wash 3x with PBS.\nAdd 2 ml of Hoechst 33258 (1:10,000) dissolved in PBS for nuclei staining, and incubate for 5 min under aluminum foil (or cover with an opaque container to limit photobleaching) (Figure 2H).",
    "Once the 5 min of incubation with Hoechst 33258t have expired, wash the dish(es) 5x with PBS.\nAdd mounting medium directly onto the matrix: cell mixture in the confocal dish and cover with glass coverslip carefully to prevent inducing any disruptions to the integrity of the colonies in the basement membrane matrix:cell mixture (Figure 2I).\nAllow the dish(es) to dry overnight (or 24 hr) at room temperature (Figure 2I). Once dry, the dish(es) can be stored at -20 °C, but it is highly recommended that they should be imaged as quickly as possible.\nAcquire images using a fluorescent microscope with appropriate laser wavelengths of antibodies used (Figures 3D-E).\nimgsrc://cloudfront.jove.com/files/ftp_upload/51341/51341fig2highres.jpg",
    "Figure 2. Examination of 3D cultures by immunofluorescence. A) A schematic of the experimental setup. B) Dish(es) placed on the ice tray and media aspirated; subsequently cells were washed three times with 2 ml of cold PBS. C) 2 ml of 20% acetone: 80% methanol solution added into the dish(es). D) Fix the cells for 20 min at 4 °C (either on ice, or in a refrigerator). E) 2 ml of 3% BSA added to the dish(es) to block for at least 30 min at room temperature. F) Once the 30 min of blocking have expired, add the primary antibodies and incubate for at least 1 hr at room temperature. G) Secondary antibodies dissolved in 3% BSA (at appropriate dilution) were added directly onto the basement membrane matrix:cell mixture; subsequently dishes covered and incubated for 1 hr at room temperature. H) 2 ml of Hoechst (1:10,000; dissolved in PBS) added to the dishe(es) and cells incubated for 5 min under aluminum foil. I) Mounting medium added directly onto the matrix: cell mixture in the confocal dish and the dish is covered with glass coverslip. Dish(es) left to dry overnight (or 24 hr) at room temperature.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}