{
  "id": 12173,
  "origin_website": "Jove",
  "title": "Counting Proteins in Single Cells with Addressable Droplet Microarrays",
  "procedures": [
    "1. Preparation\nMake chips and print antibody microarrays\nAttach an adhesive silicone/acrylic isolator to a coverslip functionalized to support an antibody microarray. This is referred to as the chip.\n\t\tNOTE: Various surface chemistries have been tested for their suitability with addressable droplets.5 Surface chemistries may need to be optimized for alternative capture agents. ADM isolators are available commercially or may be produced by laser cutting acrylic (CAD file for isolator used in this work is provided as a download; see the Supplemental Code File).\nSwitch on the microarrayer and set the humidity to 75%.\n\t\tNOTE: Relative humidity reduces evaporation of printing solution from the microarray pin and reduces intra- and inter-spot variation.\nClean the microarray pin in pin cleaning solution for 5 min by ultrasonication. Rinse the pin with ultra-pure water using a wash bottle and dry using nitrogen.\n\t\tNOTE: Suspend the pin as to only immerse the pin tip. A microscope slide with an appropriately drilled set of holes will help if a pin holder cannot be obtained.\nMake 5 mL of print buffer comprising of 3 × saline-sodium citrate (SSC) buffer, 1.5 M betaine supplemented with 0.01% sodium dodecyl sulfate (SDS). Store at 4 °C indefinitely.\nTo prepare a printing solution, thaw anti-p53 antibody (p53/Mdm2 ELISA kit; see the Table of Materials) aliquots stored at -80 °C. Mix it 1:1 with print buffer to a final concentration of 0.5 mg/mL. Load 5-10 µL of printing solution in a 384 well-plate using a micropipette and place in the microarrayer.\nLoad chips assembled in step 1.1.1 into the microarrayer. Program the microarrayer to print spots at coordinates defined by the center of each well of the isolator.",
    "NOTE: Microarrayers employ a range of, predominantly, proprietary software and so the reader is encouraged to consult the relevant literature. The microarray required for the ADM isolator featured in the accompanying CAD file in step 1.1.1 comprises of rectangular elements; the relevant distances are provided.\nStore the chips in airtight containers and wrap with foil. Store at 4 °C up to 6 weeks.\n\t\tNOTE: The foil is to prevent any photo-damage. Storage at 4 °C limits the degradation rate of biomolecules and any deleterious reactions that may act to reduce microarray activity. An airtight container allows chips to equilibrate to room temperature before use without condensation forming on the chip surface. Contact microarray printing exploits surface tension and adhesion between the print solution and the print substrate to produce spots. Pre-printing or blotting is normally required to remove excess solution from the microarray pin to yield uniformly sized spots. Do not discard the sacrificial pre-print coverslip since it can be used to assess batch quality.\nPrepare syringes, tubing and concentric nozzle for dispensing addressable droplets\nDisassemble 100 µL (for the aqueous droplet) and 1 mL (for the capping oil) glass Hamilton syringes and rinse parts with distilled H2O.\nFeed a 100 mm length of 150 µm ID/360 µm OD fused silica tubing through a 40 mm length of 1.0 mm ID/1/16\" OD PFA tubing until it protrudes by 2 mm. This will form the concentric nozzle.\nApply a thin layer of cyanoacrylate glue to the end of a 10 µL pipette tip and insert into the 40 mm piece of 1.0 mm ID/1/16\" OD PFA tubing. If required, reposition the fused silica tubing to maintain a 2 mm protrusion at the nozzle before the adhesive sets.",
    "Insert the other end of the fused silica capillary into the end of a 200 mm length of 0.014\" ID/0.062\" OD PTFE tubing and connect this to a 100 µL Hamilton syringe filled with 4% bovine serum albumen (BSA) in phosphate-buffered saline (PBS) (PBSA).\n\t\tNOTE: Proteins and other biochemical species may non-specifically bind to surfaces and can be lost or denatured. BSA is used to 'block' surfaces to minimize non-specific binding by sacrificially binding to those surfaces.\nInsert a 400 mm length of 1.0 mm ID/2.0 mm OD FEP tubing into a 200 µL pipette tip until it forms a seal. Apply a thin layer of cyanoacrylate glue to another 200 µL pipette tip and push this into the first tip to fix the tubing in place. Connect the open end of the 1.0 mm ID/2.0 mm OD FEP tubing to a 1 mL Hamilton syringe filled with mineral oil.\nInsert the 200 µL pipette tip assembly into the 10 µL pipette tip of the concentric nozzle. Place the syringes in separate syringe pumps as they will need to be operated independently.\nFill the 100 µL syringe with 4% PBSA blocking solution. Reattach and flush the 'aqueous' tubing with the blocking solution. Repeat twice for a total of 3 flushes.\nFill the 100 µL syringe with 0.125 µg mL-1 detection antibody (anti-p53 antibody (DO-1) labelled with Alexa 488) in 4% PBSA and re-attach tubing. Replace blocking solution in tubing by dispensing 25 µL detection antibody solution.\nFlush the 'oil' tubing with mineral oil until all tubing and the nozzle fills with oil. Refill the 1 mL syringe with mineral oil and re-attach tubing. Secure the tubing and nozzle assembly to an XYZ manipulator.\nPrepare microinjector and micromanipulator",
    "NOTE: Steps below make specific reference to components of the microinjector and micromanipulator apparatus specified in the Table of Materials, but are generally applicable to any such apparatus.\n\t\nAssemble the microinjector by attaching the pressure tubing and the capillary holder.\nSlowly rotate the piston dial until the mineral oil completely fills the line.\nMount the capillary holder into the translation head mount.\nFix the capillary in the capillary holder with the grip head.\nPipette a solution of 4% PBSA into one of the wells of the isolator.\nTranslate using the micromanipulator and immerse the tip of the capillary into the solution.\nSlowly fill the capillary with 4% PBSA and leave to block for 10 min.\nEject the microcapillary and swivel the translation module so that the assembly is clear of the chip.\n2. Form Addressable Droplets and Load with Single Cells\nForm addressable droplets\nSecure the chip on the microscope stage.\n\t\tNOTE: The microscope is an inverted fluorescence automated microscope capable of single molecule TIRF fitted with an an encoded XY stage and an electron multiplying charge-coupled device camera (EM-CCD).\nRecord the microscope stage coordinates of each spot in the array using the automated microscope control software.\nSet the XYZ manipulator on the microscope stage. Place the nozzle at an angle of 50-60°. Ensure that the nozzle has sufficient length and clearance to reach the chip. Set the 'aqueous' and 'oil' syringe pumps to dispense 10 nL at 100 µL/min and 5 µL at 100 µL/min, respectively.\n\t\tNOTE: During preparation, the aqueous solution at the head of the nozzle may dry.\nDispense aqueous solution until a bead of fluid is visible at the head of the nozzle. Dab with a dust free wipe to remove it.",
    "NOTE: Depending on the number of conditions under investigation, reserve a number of wells to serve as reservoirs for cells. For a single cell line/type a single reservoir will suffice.\nUsing the automated microscope control software, set the microscope stage coordinates to an antibody spot in the array and focus on the coverslip surface.\nCareful not to disturb the spot, using the XYZ manipulator, align the glass capillary tip of the concentric nozzle to the side of the antibody spot and dispense 10 nL of aqueous solution. Without moving the stages, dispense 5 µL of oil to cap the aqueous solution. Slowly raise the nozzle clear of the droplet and move to the next well.\nRepeat step 2.1.6 for all antibody spots in the array.\nAfter 30 min, image all spots in the array using the automated microscope control software to determine the background of single molecules bound to each antibody spot prior to loading cells.\nLoad addressable droplets with cells\nRemove the cell culture flasks from the incubator and detach cells using trypsin/EDTA solution.\n\t\tNOTE: In this study, the BE human colon carcinoma cell line was used and cultured using Dulbecco's Modified Eagles Medium (DMEM) supplemented with 10% (v/v) foetal bovine serum (FBS) in a CO2 incubator.\nIf required, fluorescently stain cells.\n\t\t\nResuspend cells in a solution of 0.125 μg/mL detection antibody (anti-p53 antibody (DO-1) labelled with Alexa 488) in 10% FBS in L-15 media. To ensure a single cell suspension, filter the cell solution through a 40 µm pitch cell strainer.\nCount cells using a hemocytometer and dilute or concentrate the cell solution to a concentration of 25-400 × 103 cells/mL. This ensures that cells sediment with sufficient spacing to comfortably manipulate the microcapillary.",
    "Load single cells into addressable droplets from the cell reservoir using the micromanipulator and microcapillary.\n\t\tNOTE: Non-adherent cells may be loaded in bulk into the micropipette and dispensed one by one into addressable droplets. Despite surface blocking treatment, adherent cell lines will tend to non-specifically stick to the glass microcapillary inner wall and be lost.\nUsing a 10× objective to observe, use the microinjector to aspirate a single cell into the microcapillary from the cell reservoir.\nStore the micromanipulator stage coordinates if using an electronic manipulator stage or manually note the z-position.\nRetract the micropipette by translating it upwards to clear the 1 mm height of the chip. Perform this manually with a joystick or automatically using the 'Eject' feature of an electronic manipulator stage.\nSet the stage coordinates to that of an addressable droplet the using automated microscope control software. 'Inject' the micropipette by returning it to the stored (or noted) z-position. Perform this manually with a joystick or automatically if using an electronic manipulator stage.\n\t\tNOTE: The microcapillary will pierce the capping oil and be located within the aqueous portion of the addressable droplet.\nDispense the cell in the addressable droplet using the microinjector. The volume of a 10 nL addressable droplet will increase by less than 1%.\nRepeat 2.2.5-2.2.9 for the remaining addressable droplets leaving some free for the experimental control where addressable droplets do not contain a cell.\n\t\tNOTE: A simpler alternative to loading single cells into addressable droplets using a microcapillary and micromanipulator is to replace the solution in step 1.2.8 with a solution of detection antibody in 4% PBSA containing cells at a concentration on the order of 105 cells/mL, equivalent to 1 cell/10 nL. Single cell occupancy will be Poissonian and the cell concentration will need to be optimized.",
    "Lyse cells and image array\nImage cells in droplets using brightfield microscopy, including any fluorescence imaging.\n\t\tNOTE: Imaging takes approximately 3 min to image ~100 droplets using an automated microscope. Perform imaging with a 60 NA = 1.49 oil-immersion objective. No filters are required for brightfield imaging whereas standard filter sets are used for fluorescence imaging.\nImage all spots in the array using single molecule TIRF microscopy.\n\t\tNOTE: Settings are used as in step 2.3.1 with a specialized TIRF filter set. These images will be subsequently analyzed in section 3 to determine the background of single molecules bound to each antibody spot prior to lysis. Single molecule imaging using total internal reflection fluorescence (TIRF) microscopy takes approximately 5 min to image ~100 spots.\nFocus on a cell in an addressable droplet. Achieve complete optical lysis by focusing a single 6 ns laser pulse (wavelength 1064 nm, pulse energies 14.1 ± 0.3 µJ per pulse) close to the location of the cell.\n\t\tNOTE: The laser pulse sets up an expanding cavitation bubble that shears the cell and liberates cellular constituents into the droplet volume.4,31 The mechanical processes due to laser-induced lysis do not disturb the oil-water interface at low pulse energies. Optical lysis typically takes approximately 20-30 min to lyse 100 cells. As discussed in the Discussion section, there are a number of alternative methods to lyse single cells if optical lysis setup is not possible.\nRepeat for all cell-containing addressable droplets leaving 5 free for the experimental control where addressable droplets contain an un-lysed cell.\nNote the time at which each cell is lysed.",
    "NOTE: These times will be used to correct individual binding curves for each spot in step 3.1.9. Often it is sufficient to note the times when the first and last cells are lysed and estimate the rest assuming an adequately consistent time between lysis events.\nAcquire single molecule images using TIRF microscopy of all spots every 10 min for the first 30 min then every 20 min for a further 60 min. If only interested in the amount of protein bound at equilibrium, image all spots after incubating the chip for 90 min at room temperature.\n\t\tNOTE: The time to reach equilibrium will depend on the droplet volume and the affinities of the antibodies used in the assay. TIRF microscopy is performed using a laser excitation source at = 488 nm and 1.5 mW power as measured at the back aperture using an optical power meter. Single molecule images are acquired by setting the acquisition settings on the EM-CCD camera to 900 ms acquisition time, 16-bit digitization at 1 MHz readout rate and an EM gain factor of 10. The isolator may be re-used by carefully removing the coverslip.\n3. Data Analysis\nSingle molecule counting (non-congested/digital regime)\nUsing Fiji (or Matlab), for any non-congested antibody spot, load the image acquired before lysis (background, BKD).\n\t\tNOTE: The operations in the following steps are straightforwardly performed using Fiji image analysis software. A user guide may be found at the following link https://imagej.nih.gov/ij/docs/guide/146.html.\nIn Fiji, select the BKD image. Under the \"Image\" menu select \"Duplicate\" to duplicate BKD. Select the duplicate image and under the \"Process > Filters\", select \"Gaussian Blur\" and specify a 50 pixel radius.",
    "Flatten the BKD image so that there is an effective uniform intensity distribution of the excitation light source by dividing the BKD image by the blurred BKD image, producing BKD_FLAT.\n\t\t\nUnder \"Process\" select \"Image calculator…\", specifying the operation \"Divide\", the images required, and selecting the boxes \"Create new window\" and \"32-bit (float) result.\"\nSubtract each pixel in the image by 1 (\"Process > Math\", select \"Subtract…\" and specify a value of 1). The average pixel intensity should be 0.\n\t\tNOTE: Field flattening and flattened background images may be checked easily since the sum of all pixels should be 0 and any remaining offset may be more straightforwardly compensated for.\nSelect a 50 pixel × 50 pixel area in any of the 4 corners of the BKD_FLAT image. Measure the pixel intensity standard deviation (σ) by selecting \"Analyze\" and \"Measure\".\n\t\tNOTE: The summary statistics of the selection will be presented in a Results window. This determines off-spot background where there is unlikely to be a high density of single molecules. The area to be measured may be manually selected using the default menu selection tools or by running the macro code \"makeRectangle(x, y, width, height)\"; this creates a rectangular selection, where the x and y arguments are the coordinates (in pixels) of the top left corner.\nSet the image threshold to 3σ and create a binary image SM_MASK.\n\t\t\nUnder \"Image > Adjust\", select \"Threshold…\" and set the lower threshold level to 3σ.\n\t\t\tNOTE: Pixels whose value are below the threshold are set to zero and pixels exceeding the threshold are set to 1. The threshold will determine the confidence with which thresholded pixels belong to a single molecule.",
    "In the segmented image SM_MASK, set pixel intensity values to zero of any objects that do not have a size of 4-9 pixel2 and a circularity of 0.5 - 1 by selecting \"Analyze\" followed by \"Analyze Particles\" and specifying the size and circularity.\n\t\tNOTE: The pixel size may need to be optimized for other fluorophores and microscope set ups. Due to the type of camera noise single pixels may be above this threshold and not be discarded despite not being single molecules. The pixel size criterion will correctly discard such pixels. Single molecules are generally circular in shape. A circularity value of 1 indicates a perfect circle whereas a value approaching 0 indicates an increasingly elongated shape. The remaining objects are single molecules and may be counted. A mask may be set to demarcate the area of the spot to discriminate on-spot and off-spot counts per frame. This is easier for frames acquired at later times when there is a sufficient signal on-spot which can then be applied to earlier frames.\nFor the same non-congested antibody spot, load and repeat steps 3.1.1 - 3.1.7 for all image frames captured as a time-resolved series acquired post lysis. Use the lysis times noted in step 2.3.5. to correct any binding curves.\nSingle molecule counting (congested/analogue regime)\nIn order to calculate the average intensity of a single molecule, before proceeding, repeat steps 3.1.1 - 3.1.8.\nMultiply the images BKD_FLAT and SM_MASK to produce an image whereby non-zero pixel values are associated with single molecules.\n\t\t\nTo perform this, under the \"Process\" menu, select \"Image calculator…\", specify the operation \"Multiply\" and the images required, and select the boxes \"Create new window\" and \"32-bit (float) result.\"",
    "Sum all pixel intensity values by selecting \"Analyze\" and then \"Measure\"; the summary statistics of the selection will be presented in a Results window. Divide by the number of counted single molecules as per step 3.1.8 to calculate the average intensity per single molecule.\nFor any congested antibody spot, load the image acquired post-lysis and flatten with a blurred background image as per steps 3.1.2 and 3.1.3.\nSubtract each pixel in the flattened image by 1 (\"Process > Math\", select \"Subtract…\" and specify a value of 1)\nSelect a 50 pixel × 50 pixel area in any of the 4 corners of the image and measure the pixel intensity standard deviation (σ). See step 3.1.5 for details.\nCreate a binary image mask by setting the image threshold to 3σ and set pixel intensity values to zero of any objects with a size less than 4 pixel2. To perform this, under the \"Analyze\" menu, select \"Analyze Particles\" and specify the size and circularity.\nMultiply the flattened congested antibody spot image by the binary image mask.\n\t\t\nTo perform this, under the \"Process\" menu, select \"Image calculator…\", specify the operation \"Multiply\" and the images required, and select the boxes \"Create new window\" and \"32-bit (float) result.\"\nSum of the remaining pixel intensities by selecting \"Analyze\" followed by \"Measure\"; the summary statistics of the selection will be presented in a Results window.\nDivide the sum of pixel intensities by the average single molecule intensity to calculate the number of single molecules bound to the congested spot.\nCalibration curve for absolute quantification\nRepeat sections 1 and 2 to form 10 nL addressable droplets with the detection antibody in 4% PBSA solution spiked with a known concentration recombinant protein.",
    "Perform a concentration series of 102- 107 recombinant proteins per droplet by varying the known concentration of recombinant protein added to the solution. It is recommended to work in terms of number of proteins per droplet to make calibrating single cell data straightforward.\nUse the concentration series data in step 3.3.2 to calibrate any single molecule counts per spot to protein abundance per droplet and by extension protein abundance per single cell.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}