{
  "id": 19483,
  "origin_website": "Jove",
  "title": "Enrichment of Astrocyte-Derived Extracellular Vesicles from Human Plasma",
  "procedures": [
    "The research described in this protocol has been conducted with human plasma samples from healthy adult donors of both sexes (age range 65.9-81.3 years, 45.5% females), from the Sant Pau Initiative on Neurodegeneration (SPIN) cohort, Barcelona, Spain36. Participants gave informed consent. The study has been conducted following the international ethical guidelines for medical research contained in the declaration of Helsinki and the Spanish law. The Sant Pau Research Ethics Committee (CEIC) reviewed and approved the protocol for the collection and storage of human plasma samples from the SPIN cohort (#16/2013).\n1. Enrichment of astrocyte EVs from human plasma\nNOTE: This protocol involves the use of human plasma samples. All details about reagents and laboratory material used in this protocol are included in the Table of Materials. No special equipment is required for this procedure, however, please review the safety considerations of each reagent, as specified individually by each manufacturer.\nSample collection and storage\n\t\nCollect blood in lavender EDTA vacutainer tubes, following standardized protocols for the collection of plasma36,37. Centrifuge at 2000 x g for 10 min at 4 °C within 30-120 min after collection for plasma separation. Separate the plasma, which is the upper clear liquid that appears as supernatant, in 500 µL aliquots.\nTo remove cell debris, centrifuge the aliquots at 3000 x g for 15 min at room temperature. Recover the supernatant. Store the plasma at -80 °C until analysis. As is common practice for biofluid analyses, aliquot the samples before storage and avoid more than three freeze-thaw cycles.\nTotal EV enrichment\n\tNOTE: All reagents used must be filtered through a 0.22 µm filter.\n\t\nThaw 500 µL of plasma samples. Add thrombin in a 1:100 proportion to remove coagulation factors. Mix by inversion three times and let it sit for 5 min at room temperature.",
    "Complete the volume to reach 1 mL with Dulbecco's phosphate-buffered saline (DPBS) working solution: DPBS + 3x concentrated protease inhibitor cocktail (diluted from 10x protease inhibitor cocktail stock). Mix by inversion.\nCentrifuge the samples at 6000 x g for 20 min at 4 °C. Recover the supernatant. Complete the volume with DBPS working solution to reach 1 mL.\nAdd 252 µL of the EV precipitation solution and mix by inversion three times. Incubate at 4 °C for 60 min.\nCentrifuge the samples at 1500 x g for 20 min at 4 °C to precipitate the total EV fraction (pellet). Collect 1 mL of the supernatant. Label the fraction as EV-depleted plasma to use as a negative control of EV enrichment markers (No EVs) and store at -80 °C.\nCentrifuge the remaining pellet at 1500 x g for 5 min at 4 °C. Discard the remaining supernatant. Resuspend the pellet in 500 µL of ultrapure water containing concentrated protease and phosphatase inhibitors (final concentration 3x, diluted from a stock of 100x, see Table of Materials).\nPipette up and down vigorously to loosen the pellet, avoiding foaming; vortex and agitate on a rotatory tube shaker for 30 min at room temperature until complete resuspension. Ensure complete pellet resuspension, since it is a critical step for the subsequent immunocapture step.\nImmunocapture of ADEVs\n\tNOTE: ADEVs carry astrocyte markers. The selected marker for ADEV enrichment via immunocapture is GLAST. GLAST, which stands for glutamate-aspartate transporter (UniProtKB-P43003), is the most abundant glutamate transporter predominantly expressed by astrocytes in the cerebellum and cerebral neocortex38. The anti-GLAST (ACSA-1, astrocyte cell surface antigen-1) antibody is specific for an extracellular epitope of GLAST and has been developed for the identification of astrocytes. It is the most widely used target for the immunocapture of ADEVs from human plasma12,20,34.",
    "Add 10 µL of anti-GLAST (ACSA-1) biotinylated antibody to each sample containing the total EV preparation. Mix well and gently. Incubate for 1 h at 4 °C on a rotatory tube shaker.\nAdd 10 µL of magnetic microbeads conjugated to monoclonal anti-biotin antibodies (mouse IgG1). Mix well and gently. Incubate for 1 h at 4 °C on a rotatory tube shaker.\nPlace a micro column in the magnetic field of a MACS separator. Prepare the column by rinsing it with 500 µL of PBS-0.5% bovine serum albumin (BSA). Discard the flow-through.\nLoad the EV/ACSA-1/microbead suspension onto the column. Do not push with the plunger at this step. Collect the flow-through. Label this as non-astrocytic EVs (No ADEVs) and keep as a control if needed.\nWash the column twice with 500 µL of PBS-0.5% BSA. Discard the flow-through.\nRemove the column from the magnetic separator and place it in a low-adhesion 1.5 mL collection tube. Pipette 500 µL of PBS-0.5% BSA on the column. Push firmly with a plunger into the column and collect the eluate.\nLabel as ACSA-1+ EVs (ADEVs). Store non-lysed EVs at -20 °C for short periods or at -80 °C for longer periods (>6 months).\n\t\tNOTE: Anti-ACSA-1 antibodies will bind to the GLAST-1/EAAT-1 epitope. Magnetic microbeads will bind with affinity to the anti-ACSA-1-EV complex. MACS micro columns contain an optimized matrix to generate a strong magnetic field when placed in a magnet, which is required to retain the labeled ADEVs.\n\t\tFor a schematic representation of the ADEV enrichment procedure, see Figure 1.\nLysis of EVs\n\tNOTE: EVs must be completely lysed for the detection of intravesicular markers. The use of two sequential methods, such as chemical followed by mechanical lysis, is recommended.",
    "Perform a chemical lysis of EVs by adding protein extraction reagent (see Table of Materials) in a proportion of 100 µL sample per 150 µL extraction reagent. Add 100x protease and phosphatase inhibitors to reach a 1x final concentration. Vortex vigorously and let sit at room temperature for 15 min.\nPerform a mechanical lysis by a two-step procedure: pass the chemically lysed EV solution through a syringe twice (G29 needle). Then, sonicate the samples for 45 s in an ultrasonic cold-water bath. Freeze the lysed EVs at -80 °C.\nThaw the samples at 37 °C for 5 min. Freeze again at -80 °C for the storage of lysed EVs. Thaw again for 5 min at 37 °C before analysis.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64107/64107fig01.jpg\nFigure 1: Schematic representation of the two-step procedure for the enrichment of astrocyte derived EVs. In the first step, EVs are enriched from defibrinated human plasma by polymer-based precipitation and centrifugation steps. After total EV resuspension, astrocyte EVs are then selected by immunocapture with biotinylated anti-GLAST (ACSA-1) antibodies and anti-biotin magnetic microbeads. Abbreviations: ACSA-1 = astrocyte cell surface antigen-1; ADEVs = astrocyte-derived extracellular vesicles; DPBS = Dulbecco's phosphate-buffered saline; EVs = extracellular vesicles; GLAST = glutamate-aspartate transporter; No ADEVs = non-astrocytic extracellular vesicles; No EVs = No extracellular vesicles (EV-depleted plasma); PIC = protease inhibitor cocktail; RT = room temperature. Figure created with BioRender. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64107/64107fig01large.jpg]\n2. Protocol validation\nCharacterization of total EV fraction prior to immunocapture\n\t\nUse lysed total EVs (resuspended pellet after polymer-precipitation) and diluted plasma samples for Western blot analysis. Supplement the samples with 4x Laemmli sample buffer (5 µL for 15 µL of sample), boil for 10 min at 90 °C, and load onto 10% stain-free acrylamide gels.",
    "Perform SDS-polyacrylamide gel electrophoresis (SDS-PAGE) in Tris/Glycine/SDS buffer at 80 V for 30 min, followed by 200 V for 40 min. Following the SDS-PAGE, remove the gel from the glass plates and visualize the total protein content after a 1 min UV excitation.\nTransfer the proteins from the gel to a methanol-activated 0.2 µm PVDF membrane through a semi-dry system at 25 V, 2.5 A for 10 min (see Table of Materials for details about equipment). After the transfer, block the membrane in blocking buffer for 5 min at room temperature and subsequently incubate overnight at 4 °C with the primary antibodies to Alix (1:1000), CD9 (1:1000), or Calnexin (1:1000); see Table of Materials for details.\nWash the membrane in Tris-buffered saline with 0.1% Tween 20 (TBST) three times for 10 min and incubate for 1 h at room temperature with an anti-rabbit HRP secondary antibody diluted at 1:7500 in blocking buffer. Wash the membrane in TBST four times for 10 min. Perform all washes and incubation steps with gentle agitation of the membrane on a bench rocker.\nMix in a 1:1 ratio the chemiluminescent solution with the peroxide buffer and incubate the membranes for 5 min at room temperature. Expose and acquire bands using a chemiluminescence imaging system (see Table of Materials for details).\nValidation of the enrichment of astrocyte-specific markers in ADEV fraction",
    "​NOTE: Glial fibrillary acidic protein (GFAP) is the main intermediate filament protein in astrocytic cells and an essential element of their cytoskeleton during development. GFAP can be detected in brain tissue and biofluids being a well-known astrocyte marker39. Therefore, this marker was quantified using a commercial biomarker detection technology to demonstrate the enrichment of astrocyte-derived markers in the ADEV fraction. This biomarker technology is an ultrasensitive technique that allows the measurement of single protein molecules with a sensitivity of up to 1,000 times greater than conventional immunoasays. This technique is based on the use of paramagnetic microparticles coupled with antibodies designed to bind to specific targets40,41 (see Table of Materials).\n\t\nUse lysed EV samples for biomarker analysis. To test the enrichment of astrocyte markers, compare GFAP levels in the eluate (ADEVs) versus the flow-through (No ADEVs) using a commercial ultrasensitive immunoassay.\nDilute the samples in a 1:4 ratio (25 µL of EVs + 75 µL of assay buffer), prepare the calibrators, and conduct the assay in the biomarker detection equipment, as specified by the manufacturer's instructions (see Table of Materials). The samples can be diluted directly on the plate.\nTest the samples and calibrators in duplicate. The quantification range for the GFAP assay was 1.37-1000 pg/mL. Use the manufacturer's software analysis platform to calculate GFAP concentrations from the calibration curve.\nTo estimate the coefficient of variation (CV) of the protocol for the enrichment of astrocyte markers, measure the GFAP levels in ADEV preparations obtained from identical replicates of pooled human plasma samples and calculate the CV as standard deviation/mean x 100. In this protocol, the CV was calculated using N = 10 identical plasma samples.\nValidation of the enrichment of EV markers in ADEV fraction",
    "To validate the enrichment of EV markers, measure Alix and CD81 levels by ELISA (see Table of Materials) in lysed undiluted EV samples, following manufacturer's recommendations. Test samples and calibrators in duplicate.\nRead the plates at 450 nm and 570 nm using a microplate reader. Use a linear calibration curve to calculate Alix and CD81 concentrations. The quantification range for the Alix assay was 47-3000 pg/mL and for CD81 it was 0.156-10 ng/mL.\nCharacterization of the size and morphology of ADEVs\n\t\nNanoparticle tracking analysis\n\t\t\nUse nanoparticle tracking analysis (NTA) to measure the particle concentration and size distribution of fresh non-lysed EV preparations.\nDilute fresh, non-lysed ADEV suspensions (10 µL) with filtered PBS according to the detection range of the instrument (20-100 particles/frame), using the supplied software, record three 60 s videos with settings as follows: syringe flow rate at 30 a.u., camera level at 13, and the detection threshold at 5. Correct the particle concentrations for the input sample volume, volume of EV resuspension, and dilution necessary for NTA reading.\n\t\t\tNOTE: It is recommended to pre-visualize a sample containing the EV vehicle solution to verify the matrix effect and the purity of the medium in which EVs are resuspended.\nCryo-electron microscopy\n\t\t\nUse cryo-electron microscopy (Cryo-EM) to confirm the presence and morphology of Evs in fresh, non-lysed ADEV suspensions (4 µL). Vitrify the samples using a commercial plunge freezer on Holey carbon grids with the following settings: 3.9 µL of sample, wait time 10 s, blot time 2 s.\nPlunge into liquid ethane-nitrogen in a cryo-workstation. Transfer the grids to a cryoholder maintained at -179 °C for transmission electron microscope analysis. Examine the EVs with a transmission electron microscope operating at an accelerating voltage of 200 kV and equipped with a CCD camera. Acquire micrographs using software.\nAnalysis of lipoprotein co-precipitation",
    "Determine human ApoB levels in undiluted plasma, lysed total EV samples, and lysed ADEV samples with an immunoturbidimetric assay using a commercial kit adapted for a commercial autoanalyzer (see Table of Materials for further details).\nAnalysis of inflammatory markers in ADEVs\n\t\nUse a bead-based assay (see Table of Materials) to quantitate the concentration of 25 inflammatory markers: eotaxin, IFN Alpha2, IFN Gamma, IL-1 Alpha, IL-1 Beta, IL-3, IL-6, IL-8, IL-10, IL-12 (p40), IL-12 (p70), IL-15, IL-17A, IL-17E/IL-25, IL-17F, IL-18, IP-10, MCP-1, MCP-3, MDC, MIP-1 Alpha, MIP-1 Beta, TGF Alpha, TNF Alpha, TNF Beta.\nUse lysed undiluted EV preparations (25 µL) and incubate the samples with the beads overnight at 4°C, following the manufacturer's instructions. Wash the plate, incubate with 25 µL of detection antibodies, and incubate for 1 h with agitation at room temperature.\nAdd 25 µL of Streptavidin-PE to each well and incubate for 30 min at room temperature. Add 150 µL of sheath fluid and incubate for 5 min under agitation. Read the plate on the plate reader attached to the system.\n\t\t​NOTE: This technique is based on immunoassays using antibodies that bind to the surface of fluorescent-coated magnetic microbeads. This technology internally codes microspheres by their color with different dyes. Each type of microsphere is coated with a specific capture antibody, such that multiple conjugated beads capture the analytes embedded in samples, allowing the quantitative multiplex detection of dozens of analytes simultaneously. The system uses the bead-based multiplexed immunoassay platform for signal detection43.\n3. Data analysis\nPerform statistical analyses with commercial software. Assess data normality with the Shapiro-Wilk test. Test two-group comparisons with the Mann-Whitney U test and three-group comparisons with the Kruskal-Wallis test and Dunn's post-hoc correction. Set the significance at p < 0.05.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}