{
  "id": 6576,
  "origin_website": "Bio",
  "title": "A Novel Technique for Imaging and Analysis of Hair Cells in the Organ of Corti Using Modified Sca/eS and Machine Learning",
  "procedures": [
    "Modified Sca/eS protocol (see Figure 1)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190818/20190818224033_6390.jpgFigure 1. Time course of modified Sca/eS. The inner ear embedded in the temporal bone was removed (panel A) and dissected along the fistula (B) (dotted lines in the left of panel A). The cochlea was separated (dotted line in panel C) from the semicircular canals along the fissure (red arrow in panel C). The cochlea was removed [panel D and (i)] and decalcified (ii). The sample was cleared immediately after being submerged in solution 1 (iii). The sample was then submerged in solution 2 and its transparency gradually increased (iv-viii). A: anterior, P: posterior, M: medial, L: lateral, C: cochlea, SC: semicircular canal, RI: refractive index. Scale bar: 1 mm.Extraction of the cochlea from the temporal boneFix the cochlea in 4% paraformaldehyde prepared in PBS overnight at 4 °C with gentle shaking.Wash the cochlea three times (15 min each) with PBS.Incubate the samples in 500 mM EDTA prepared in PBS for 48-120 h at 37 °C.Note: The incubation duration depends on the sample size. For example, 48 h for pups, 72 h for young (2-week-old) mice, and 120 h for middle-age (6-month-old) mice. Wash the cochlea three times (15 min each) with PBS.Remove excess bone tissue surrounding the cochlea.Remove the vestibule and semicircular canal.Tissue de-lipidation (see Figure 1 and Solution 1 in Recipes)Incubate the samples in Solution 1 for 2 h at 37 °C.Antibody staining (see Figure 1)Wash the samples with PBS containing 0.1% Triton X-100 for 30 min with continuous rocking at 40 rpm.Incubate the samples in a solution containing the appropriate dilutions of primary antibodies for 2-48 h at 37 °C.Wash the samples three times (30 min each) with PBS containing 0.1% Triton X-100 with continuous rocking at 40 rpm.",
    "Detect primary antibodies by incubating the samples with a solution containing secondary antibodies for 12-48 h at 37 °C followed by three washes with PBS containing 0.1% Triton X-100.Sample preparation for imaging (see Figures 2 and 3)Roll up a piece of Blu Tack into a cylindrical shape that is slightly thicker than the cochlea [Figure 2 (i)].Align Basukoku in a horseshoe shape on the glass slide [Figure 2 (ii)].Place the Blu Tack on the Basukoku [Figure 2 (iii, iv)].Place a drop of Basukoku inside the Blu Tack horseshoe to make a pedestal for the cochlea [Figure 2 (v)]. Carefully place the cochlea on the pedestal [Figure 2 (vi)].Note: Position the cochlea so that the axis of the center of the cochlea is aligned perpendicular to the glass slide (Figure 2). Place the cover glass on the surface of the Blu Tack and gently push it toward the surface of the cochlea [Figure 2 (vii)].Note: Keep pushing the cover glass until it reaches the surface of the cochlea. This process is critical to image the whole cochlea [Figure 2 (vii-a)]. With the horseshoe opening facing upward, add 100 μl of solution 2 (see Recipes) to the gap within the horseshoe until the imaging chamber is filled [Figure 2 (viii)].Note: Images iv-viii in Figure 1 show how transparent the cochlea becomes after 20 min (images were acquired at increments of 5 min). Fill the gap between the Blu Tack with Basukoku to seal the horseshoe opening [Figure 2 (ix)].Note: Air bubbles should not remain in the chamber; this would indicate potential leaking of solution 2 and cause the sample to dry out. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190818/20190818224247_4281.jpgFigure 2. Sample preparation for the imaging stepimgsrc:https://en-cdn.bio-protocol.org/attached/image/20190818/20190818224425_6599.jpgFigure 3. Cochlea position. The center of the first (green) and second (red) turns of the cochlea.",
    "Images on the left are the ideal position for imaging of HCs in the whole cochlea, where d represents the distance between the centers of the green and red areas. Upper panels (A) show all HCs imaged using a two-photon microscope in a successful case. Lower panels (B) are representative cases where the approach failed. Images on the left are from the top view, while images on the right are from the side view. The modiolus of the cochlea should be perpendicular to the slide glass [i.e., centers should overlap (purple)].Imaging of the samplePlace one drop of distilled water on the cover glass and then place the objective lens against the cover glass.Note: Use an appropriate immersion media for high-resolution imaging. Water-immersion lenses perform much better than air-immersion objective lenses. To image the whole cochlea, images should be successively acquired with 10-40% overlap [Figure 2 (i)].See example images of sample processed with previous well known clearing methods (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190818/20190818224500_9574.jpgFigure 4. Comparison with other clearing methods. MYO7A-immunopositive HCs in samples were not detected by 3DISCO, iDISCO, CLARITY, or CUBIC (A). Microdissection of the membrane labyrinth of the iDISCO-processed samples in panel A confirmed the presence of MYO7A-immunopositive HCs, suggesting that the surrounding bone tissue prevented the detection of fluorescence (B). Scale bars: 500 µm in panel A and upper image of panel B, 100 µm in lower image of panel B.Automated HC analysis protocol based on machine learningHCs were automatically detected and analyzed using custom MATLAB scripts (R2017b, MathWorks), the details of which were provided in a previous study (Urata et al., 2019). The MATLAB source code is available on GitHub (https://github.com/okabe-lab/cochlea-analyzer.git[href=https://github.com/okabe-lab/cochlea-analyzer.git]). Data analysis procedures including statistical analysis were described in the original publication of the protocol (Urata et al., 2019).",
    "The actual running of the program was shown in this protocol paper.The main0.m program (1 min) checks the integrity of the software so that automated analysis can be flawlessly performed (see Video 1).Note: If an error occurs during the process, double check to see if any required files are absent under “Function Files” on GitHub (https://github.com/okabe-lab/cochlea-analyzer.git[href=https://github.com/okabe-lab/cochlea-analyzer.git]). <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Checking the integrity of the software before performing automated analysis using main0.m The main1.m program merges all the files together to create a linearized image of HCs, which takes about 15 min in total (Step B2 in Figure 5 and see Video 2).Note: If the main0.m program completes without an error, it is guaranteed to function properly. A TIFF image is produced in this step.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Merging of all the acquired files together to create a linearized image of HCs using main1.m imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190818/20190818224616_5297.jpgFigure 5. Image generation by the programs. Raw images are stitched (Step 1), and the lines between inner and outer HCs are illustrated (orange line in Step 2). Finally, HCs are linearized and representative images of the apical, middle, and basal portions are enlarged. Colored dots in Step 3 and Step 4 indicate the presence of HCs, and asterisks represent loss of HCs.The main2.m (inner HCs, duration 5 min, see Video 3) and main3.m (outer HCs, duration 3 min, see Video 4) programs detect 169 HCs. Notes:An EXCEL file containing the coordinates of recorded (or imaged) HCs is generated in this step. Advanced analysis is available using the main4-6.m programs. The main4.m program analyzes (< 1 min) the spatial distribution of outer HCs and the main5.m program generates (< 1 min) a holocochleogram (see Video 5). The main6.m program analyzes (10 min) clusters of HC loss (see Video 6).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 3. Imaging of inner HCs using the main2.",
    "m program <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 4. Imaging of outer HCs using the main3.m program <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 5. Analysis of the spatial distribution of outer HCs using the main4.m program and generation of a holocochleogram using the main5.m program <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 6. Analysis of clustered HC loss using the main6.m program"
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}