{
  "id": 5270,
  "origin_website": "Bio",
  "title": "Preparation of Purified Gram-positive Bacterial Cell Wall and Detection  in Placenta and Fetal Tissues",
  "procedures": [
    "Preparation of pneumococcal CW: peptidoglycan-teichoic acid complexNotes: Prepare all the solutions and do all washes with distilled water (use cell culture distilled water from Sigma [#W3500] with low endotoxin concentration). Filter all the solutions before use (with filter 0.22 µm). Preferably use new clean glassware and equipment to avoid any contamination with endotoxin (LPS). Prior to large-scale growth, check pneumococcal stock on blood plate without antibiotics to confirm the absence of contamination. The protocol described here uses C+Y medium (see Recipes) as a partially defined growth medium. Other commercially available media are also suitable but have more diverse contaminating components such as endotoxin that needs to be removed for achieving a pure preparation. Preparation of stock of Streptococcus pneumoniaeCW can be purified from any pneumococcal strain. However, the procedure is most successful with unencapsulated strains such as R6 (Tuomanen et al., 1985b).Streak strain on TSA agar (20 g TSA per 500 ml water, autoclave) containing 3% (v/v) sterile defibrinated sheep blood and incubate the plate at 37 °C, 5% CO2 for 16-18 h (Figure 1). The growth on blood agar allows for the visualization of hemolysis, which is characteristic for S. pneumonia.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161129/20161129022440_4009.jpgFigure 1. Overnight growth of unencapsulated strain R6 on TSA blood agar. Pure culture of pneumococcus is the source of bacteria for seed stocks made in step A1b.Scrape all the colonies off the agar plate with an inoculation loop, and inoculate into 10 ml C+Y medium in a test tube. Incubate the culture at 37 °C, 5% CO2. When the optical density of the culture at 620 nm (OD620) reaches 0.4, harvest the culture by centrifugation at 1,500 x g, 4 °C for 10 min in a microcentrifuge.Remove the culture supernatant carefully. Resuspend the bacterial pellet in 5 ml of freezing medium (2.5 ml C+Y medium and 2.",
    "5 ml 80% [v/v] glycerol), and make 1 ml aliquots. Store the stocks in cryovials at -80 °C. These stocks contain approximately 1 x 107 cfu/ml.Large scale cultivation of pneumococcusPrepare 10 L of C+Y medium (see Recipes) and aliquot in three 4,000 ml Erlenmeyer flasks (3,300 ml per flask). Incubate the medium at 37 °C, 5% CO2 overnight to confirm absence of contamination.Inoculate 1 ml/flask of pneumococcal stock (107 cfu/ml) into the medium. Incubate the culture at 37 °C, 5% CO2 without shaking.Notes: To estimate bacterial growth in flasks, transfer one 10 ml aliquot (using sterile serological pipet) from flask into a sterile glass tube when the culture begins to appear turbid. Read the culture turbidity at 620 nm (OD620) of this transferred culture. Keep the bacterial culture in the glass tube, and incubate it in the incubator with the flask culture. Monitor the OD620 of the glass tube culture over time. OD620 in flask will be approximately 0.1 higher than OD620 in glass tube.When the OD620 in the flask reaches 0.7-0.8, remove the flask from the incubator and immerse it into ice for 15 min. Swirl the flask every 2 min to cool culture rapidly.Pour the cooled culture into pre-chilled 1,000 ml centrifuge bottles, and harvest the culture by centrifugation at 4 °C, 4,000 x g for 10 min in the Sorvall centrifuge.Decant supernatant carefully by pouring. Pellets can be stored at -80 °C until usePreliminary harvest and mechanical breakage of the bacterial cellsNote: The operational definition of crude CW is material that is precipitable by boiling in SDS. Resuspend each pellet with 10 ml/bottle ice cold 50 mM Tris-HCl, pH 7.0 (see Recipes). Note: Perform this step as quickly as possible to avoid bacterial autolysis.",
    "Boil 200 ml 5% (v/v) SDS (see Recipes) in a 500 ml beaker on a hotplate. Carefully monitor temperature control to prevent boiling over the beaker’s edge.Combine the resuspended bacterial pellets and add the bacterial suspension into the boiling SDS slowly.Boil the suspension for 15 min, and cool it to room temperature.Aliquot the boiled suspension into 30 ml centrifuge tubes. Centrifuge the suspension at room temperature, 12,000 x g for 10 min in the Sorvall centrifuge. Discard the supernatant carefully to avoid dislodging the pellet.Resuspend the pellet in 20 ml/tube 1 M NaCl (see Recipes). Centrifuge the suspension at room temperature, 12,000 x g for 10 min in the Sorvall centrifuge. Discard the supernatant gently and carefully. Repeat this step for another 2 times.Resuspend the pellet in 20 ml/tube water. Centrifuge the suspension at room temperature, 12,000 x g for 10 min in the Sorvall centrifuge. Discard the supernatant gently and carefully. Repeat this step for another 7 times to remove detergent.Resuspend the pellet in 2 ml water, and add equal volume of glass beads. Vortex the pellet-glass beads suspension at 4 °C, maximum speed for 16-18 h.Elimination of DNA, RNA, and proteins Harvest the broken CWs by centrifugation at room temperature, 5,000 x g for 10 min in the Sorvall centrifuge.Carefully transfer the supernatant (contains CW) into a fresh 30 ml centrifuge tube.Add 10 ml water to the pellet and vortex vigorously. Incubate the suspension at room temperature for 20 min to separate supernatant by sedimentation. Then, remove the supernatant carefully with a sterile serological pipette. Transfer the supernatant into the centrifuge tube in step A4b. Repeat this step at least 5 times until the supernatant appears clear.Centrifuge the CW containing supernatant at room temperature, 27,000 x g for 15 min in the Sorvall centrifuge.",
    "Discard the supernatant gently and carefully resuspend the pellet in 10 ml 100 mM Tris, pH 7.5 (see Recipes).Add 0.2 ml of 1 M MgSO4 (see Recipes) into the suspension to make a final concentration of 20 mM.Add 10 μl DNase I and 50 μl RNase A into the suspension at final concentration of 10 and 50 µg/ml respectively. Incubate the suspension at 37 °C for 2 h.Add 0.1 ml of 1 M CaCl2 (see Recipes) into the suspension to make a final concentration of 10 mM.Add 0.1 ml of trypsin (10 mg/ml) to make a final concentration of 100 µg/ml and 0.3 U of α-amylase.Incubate the suspension at 37 °C for 12-15 h.Removal of non-covalent adducts and contaminating endotoxinResuspend the pellet in 10 ml 8 M LiCl (see Recipes), incubate at 37 °C for 15 min.Centrifuge the suspension at room temperature, 27,000 x g for 15 min in the Sorvall centrifuge. Discard the supernatant.Resuspend the pellet with 10 ml 100 mM EDTA (see Recipes), and incubate at 37 °C, for 15 min.Centrifuge the suspension at room temperature, 27,000 x g for 15 min. Discard the supernatant.Resuspend the pellet in 10 ml water, centrifuge the suspension at room temperature, 27,000 x g for 15 min in the Sorvall centrifuge. Discard the supernatant.Resuspend the pellet in 10 ml acetone, centrifuge the suspension at room temperature, 27,000 x g for 15 min in the Sorvall centrifuge. Discard the supernatant very carefully because the pellet is very loose.Resuspend the pellet in 10 ml water, centrifuge the suspension at room temperature, 27,000 x g for 15 min in the Sorvall centrifuge. Discard the supernatant. Repeat this step for another 5 times.Resuspend the pellet in 2 ml water.",
    "Test the CW suspension for endotoxin by PierceTM LAL Chromogenic Endotoxin Quantitation Kit according to the manufacturer’s instruction.Record the weight of the microcentrifuge tubes, and aliquot the CW suspension into the tubes.Lyophilize the CW suspension in a Speed-vac.Record the weight of the tube containing lyophilized CW. Subtract the weight of the empty tube to obtain mass of CW. Reconstitute the dried CW by adding 348 μl H2O per 46 mg CW material, which results in CW stock equivalent to 106 cfu/µl. Store the CW stocks at 4 °C. The composition of this CW material has been described (Holtje et al., 1975).Notes: The CW stock will have a ‘milky’ appearance (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161129/20161129190137_7423.jpgFigure 2. Final appearance of purified pneumococcal CW FITC labeling of CWPipet the desired amount (100-200 μl depending on the number of mice) of CW from the CW stock into a fresh microcentrifuge tube.Sonicate the CW in a water-bath sonicator for 30 min.Resuspend the sonicated CW in 500 μl FITC solution (1 mg/ml, dissolved in sterile carbonate buffer; see Recipes). Protect the preparation from light by wrapping in aluminum foil. Incubate the suspension at room temperature for 1 h.Centrifuge the FITC-labeled CW at room temperature, 17,000 x g for 2 min in a microcentrifuge. Discard the supernatant, and resuspend in 1 ml DPBS. Repeat this step 2 times.Resuspend the FITC-labeled CW pellet in DPBS to a concentration of 1 x 106 bacterial equivalents/μl.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161129/20161129190313_8229.jpgFigure 3. Final appearance of FITC labeled pneumococcal CWDetection of CW distribution in placenta and fetal tissuesAll experiments should be performed in compliance with national and institutional guidelines (for example, National Institute of Health).General descriptionTo study CW distribution to the placenta and fetus in mice, FITC labeled CW is injected intravenously into gestating mice. Male and female mice are purchased and bred in the animal facility on-site.",
    "Healthy mice at a body weight of 15-20 g and no signs of dehydration or illness are anesthetized by isofluorane. The mice are kept under isofluorane throughout the duration of the procedure (~5-10 min). Mice recover from the 10 min procedure in ~15-20 min.CW injection of the mousePersonnel wear shoe covers, gown, hat, mask upon entering the surgical suite.Pregnancy is dated by ultrasound by a trained animal husbandry technician to target E10-E15 dams. Unless otherwise noted (such as knockout mice), C57Bl6 mice are used.In the surgical suite, the mouse is warmed on a heating pad 10-15 min before injection to dilate blood vessels. The mouse is then restrained with tail access.Bacterial equivalents of 2 x 107 of FITC CW (20 μl of the FITC CW preparation) is diluted into a total volume of 100 μl sterile PBS and injected into the tail vein. The injection is done using a 25 gauge needle.For recovery, the mice are moved to a recovery table and monitored by respiration rate, toe pinch for capillary refill time and a heating pad for maintaining body temp. They are monitored visually for at least 30 min post-operationally until they are moving freely in the cage to assure they can access water and food.Harvesting tissues at Embryonic Day E18-20Mice are euthanized and placenta and embryo heads are excised and fixed overnight at 4 °C in 4% paraformaldehyde (PFA) in a 50 ml conical tube.Drain the PFA and fill the tube with 30% sucrose. Tissue should initially float at the top of the tube.Keep tissue in sucrose at 4 °C for 3-5 days until tissue rests at or near the bottom of the tube.Remove tissue one at a time to a clean 10 cm dish.",
    "Cut with a razor blade according to the diagram in Figure 4 for either coronal or sagittal sectioning.Visualization of CW in the placenta and fetal tissuesimgsrc:https://en-cdn.bio-protocol.org/attached/image/20161129/20161129190713_0181.jpgFigure 4. Cross sections of mouse brain. For sectioning, make incision along dotted line. Coronal section is preferred to remove cerebellum and create flat surface for embedding the cortex.Place in embedding mold with cut surface on bottom of mold. Add OCT compound slowly to cover, avoiding bubbles.Place on dry ice to freeze for 30 min.Wrap each mold in aluminum foil and label. Store at -80 °C.Cut 20 μm sections with a cryostat microtome using superfrost slides, 3-5 serial sections per slide.Once dried, apply a thin layer of Prolong Gold anti-fade mounting medium with DAPI and carefully cover with a glass coverslip to avoid introducing air bubbles.Allow slides to cure overnight at room temperature and analyze the following day with confocal microscope.Fluorescent images were acquired with an inverted confocal microscope (LSM510; Carl Zeiss MicroImaging, Inc.). Argon laser (excitation 488 nm) and a filter set to detect FITC emission (BP500 – 550) for imaging FITC; Chameleon laser (excitation 740 nm) and a filter set to detect DAPI emission (BP435 – 485) for imaging DAPI. Cells were observed using a 20x/0.75 Plan Neofluor objective with the confocal pinhole set to one Airy unit. Imaging parameters, such as gain and offset levels, and line averaging, are optimized to avoid oversaturation of pixels and to improve signal:noise ratio. Images were acquired using Zen 2008 software package (Carl Zeiss MicroImaging, Inc.). CW pieces per section were counted using the particle analysis tool in ImageJ (imagej.net/Particle_Analysis[href=http://imagej.net/Particle_Analysis])"
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}