{
  "id": 5526,
  "origin_website": "Bio",
  "title": "Simple Spectroscopic Determination of Nitrate, Nitrite, and  Ammonium in <em>Arabidopsis thaliana</em>",
  "procedures": [
    "Extraction of ammonium from A. thaliana shoots or rootsExcise and weigh fresh shoots or roots (approximately 10-100 mg fresh weight), put them into 2 ml safe-lock tubes, and freeze them in liquid N2.Note: Samples can be stored at -80 °C before use.Crush frozen samples into a fine powder with a sample disruptor using 5 mm zirconia beads (one bead per tube) or with a mortar and pestle under liquid N2 conditions.Add 1 ml of extraction reagent 2 (see Recipes), and vortex gently until the solution dissolves and becomes homogeneous.Add 500 µl of chloroform. Vortex the mixture gently at 4 °C for 15 min.Centrifuge the extracts at 12,000 x g for 10 min at 8 °C.Transfer the aqueous phase into a 1.5 ml microtube containing approximately 50 mg of acid-washed activated charcoal and then vortex the mixture.Centrifuge the extracts at 20,400 x g for 5 min at 8 °C. Use the supernatants for ammonium determination.Note: A series of purification steps eliminates interfering compounds for ammonium determination. Determination of ammonium from A. thaliana shoots or rootsMix 200 µl of the supernatant with 800 µl of the deproteinization reagent in the ammonia test kit in a 1.5 ml microtube and vortex.Note: The deproteinization reagent contains sodium tungstate and phosphate salt.Centrifuge the mixture at 2,300 x g for 5 min at 4 °C.Mix 200 µl of the supernatant with 200 µl of reagent A in the ammonia test kit and vortex.Note: Reagent A contains sodium nitroprusside and phenol.Add 100 µl of reagent B in the ammonia test kit and vortex.Note: Reagent B contains potassium hydroxide.Add 200 µl of reagent C in the ammonia test kit and vortex.Note: Reagent C contains sodium hypochlorite and potassium carbonate.Incubate at 37 °C for 20 min.Measure the absorbance at 630 nm using a spectrophotometer.",
    "Note: If the ammonium concentration exceeds the range of the standard dilution series, dilute the supernatant with the extraction reagent 2. In general, ammonium accumulates at higher levels in plant tissues grown under ammonium-containing conditions. Preparation of ammonium standard curvePrepare an ammonium dilution series using ammonium chloride (0, 12.5, 25, 50, 100, 200, and 400 µM) in the extraction reagent 2 (freshly prepared).Note: Ammonia Test Wako includes solutions for the preparation of the dilution series. However, their background composition resembles deproteinized blood because this kit is designed to measure ammonium in blood. Thus, the dilution series should be prepared with the extraction reagent 3.Mix 200 µl of the standard solution with 800 µl of the deproteinization reagent in the ammonia test kit in a 1.5 ml microtube and vortex.Note: The deproteinization reagent contains sodium tungstate and phosphate salt.Centrifuge the mixture at 800 x g for 5 min at 4 °C.Mix 200 µl of the supernatant with 200 µl of reagent A in the ammonia test kit and vortex.Add 100 µl of reagent B in the ammonia test kit and vortex.Add 200 µl of reagent C in the ammonia test kit and vortex.Incubate at 37 °C for 20 min.Measure the absorbance at 630 nm using the spectrophotometer (Figure 5). A picture of a representative ammonium dilution series is shown in Figure 6.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170511/20170511215500_8241.jpgFigure 5. Standard curve generated using the absorbance at 630 nm for known concentrations of ammoniumimgsrc:https://en-cdn.bio-protocol.org/attached/image/20170511/20170511215529_9244.jpgFigure 6. Picture of a representative ammonium dilution series"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}