{
  "id": 17187,
  "origin_website": "Jove",
  "title": "Labelling and Visualization of Mitochondrial Genome Expression Products in Baker's Yeast Saccharomyces cerevisiae",
  "procedures": [
    "1. Yeast culture preparation\nStreak yeast from the frozen stock cultures on fresh plates with the appropriate medium. Put the plates in a culture incubator at 30 °C for 24–48 h.\n\tNOTE: Let the temperature-sensitive mutants grow at the permissive temperature.\nInoculate yeast cultures in 2 mL of YPGal medium (2% peptone, 1% yeast extract, 2% galactose) from the fresh streak in 15 mL tubes and incubate them overnight agitating at 200 rpm at 30 °C.\nMeasure the optical density of the culture at a wavelength of 600 nm (OD600).\nTake the volume corresponding to 0.2 absorbance units in sterile tubes, pellet yeast cells at 9,000 x g for 30 s at room temperature, and discard the supernatant.\nWash cells with 0.5 mL of sterile water by vortexing for 5 s. Pellet yeast cells at 9,000 x g for 30 s at room temperature and discard the supernatant. Dilute cells in 2 mL of fresh YPGal medium.\nIncubate agitating at 200 rpm and 30 °C until OD600 reaches 1.5–1.9 values.\n\tNOTE: Yeast growth rates vary, so be prepared to wait. It is reasonable to make steps 1.3–1.6 early in the morning. It usually takes 4–5 h, but can take longer.\n2. Radioactive isotope incorporation\nTransfer the culture volume equivalent to one optical unit in a microcentrifuge tube. Spin the tubes at 3,000 x g for 1 min and discard the supernatant. Wash with 0.5 mL of sterile water by vortexing for 5 s.\n\t\nPellet yeast cells at 9,000 x g for 30 s at room temperature and discard the supernatant. Resuspend yeast cells in 0.5 mL of sterile translation buffer. Place the suspension in a 15 mL tube.\n\t\tNOTE: Translation buffer is a solution containing 2% galactose (w/v) and 50 mM potassium phosphate with pH 6.0.",
    "Add cycloheximide to cell suspension up to a final concentration of 0.2 mg/mL. Incubate for 5 min agitating at 200 rpm and 30 °C to inhibit cytosolic translation.\n\tNOTE: Cycloheximide solution (20 mg/mL, in ethanol) should be prepared fresh before the experiment. Chloramphenicol can be successfully substituted with anisomycin in the same concentration7.\nAdd 25–30 μCi of 35S-methionine to the cell suspension and incubate for 30 min agitating at 200 rpm and 30 °C.\n\tNOTE: The mixture of 35S-methionine and 35S-cysteine can also be used. Pure 35S-methionine results in the strongest signal and the best signal-to-noise ratio. Generally, methionine is more effective than cysteine because the content of this amino acid in mitochondrial proteins is higher. However, the EasyTag mixture of 35S-methionine and cysteine is less expensive and gives comparable results7.\n\tCAUTION: 35S-methionine is radioactive. Follow the usual safety practices for handling radioactive materials.\n\tNOTE: It is well known that the incorporation of radioactivity reaches a limit due to which the total signals level off over time. Once this limit is reached, it is almost impossible to determine the rates by which the different translation products are synthesized. To analyze the rate of mitochondrial translation, it is imperative to be in a condition in which the signal intensity increases with time of incubation with 35S-methionine in a linear manner. For common laboratory wild-type strains, the signal is already saturated for incubation times far shorter than the 30 min. Translational mutants can behave very differently. A time-course should be performed to establish the kinetics of radioactivity incorporation and thus the rate of translation, at least when working with a new strain. For this, we suggest taking samples with an interval of several minutes (e.g., 2.5, 5.0, 7,5, 10, and 20 min).",
    "Add unlabeled \"cold\" methionine (final concentration should be 20 mM) and puromycine (final concentration should be 1–10 μg/mL) to stop the labeling. Incubate for 10 min agitating at 200 rpm and 30 °C.\n\tNOTE: This step is critical to give ribosomes time to finish translating the peptides. Otherwise, all polypeptides shorter than full-length will be detected at a different size. A time-course experiment (pulse-chase) can be done at this step to determine the stability of mitochondrial translation products. For this, continue the incubation taking samples with an interval of 30 min (e.g., 30, 60, 90, and 120 min).\n3. Yeast cell lysis and extraction of proteins\nCollect yeast cells by centrifugation at 9,000 x g for 30 s. Wash the cells with 0.5 mL of sterile water by vortexing for 5 s. Pellet yeast cells at 9,000 x g for 30 s at room temperature. Discard the supernatant.\n\tNOTE. The protocol can be paused here. Store the samples at -20 °C.\nAdd 75 μL of lysis buffer to the pellet and vortex for 5–10 s.\n\tNOTE: Lysis buffer is a solution of 1.8 M NaOH, 1 M β-mercaptoethanol, and 1 mM PMSF in water. Avoid excessive incubation with lysis buffer leading to alkaline hydrolysis of proteins. Immediately proceed to step 3.3.\nAdd 500 μL of 0.5 M Tris-HCl buffer with pH 6.8. Vortex briefly.\n4. Precipitation of proteins\nCAUTION: Methanol and chloroform are organic solvents. Follow the usual safety practices for handling organic substances.\nAdd 600 µL of methanol to the sample. Vortex for 5 s.\nAdd 150 µL of chloroform to the sample. Vortex for 5 s.\nCentrifuge the samples for 2 min at 12,000 x g. Carefully discard the upper phase with a sampler.",
    "Add 600 µL of methanol to the sample. Mix carefully by inverting the tube several times.\nCentrifuge the samples for 2 min at 12,000 x g. Discard the supernatant.\nAir-dry the pellet for 2 min at 80 °C.\n\tNOTE: All of the liquid should evaporate. There is a risk to have an aberrant separation of proteins in the gel if the pellet was dried insufficiently. However, it is not possible to over-dry the pellet, so it can even be stored overnight at 4 °C.\nDissolve precipitated proteins in 60 µL of 1x Laemmli sample buffer.\nHeat for 10 min at 40 °C.\n\tNOTE: Avoid boiling the samples at 95 °C, because this causes aggregation. If the aggregates still form, Spin the samples at 12,000 x g for 2 min and collect the supernatant. Samples can be stored at -20 °C. The protocol can be paused here.\n5. SDS-PAGE\nCast the 17.5% Laemmli SDS-polyacrylamide gel.\n\tNOTE: 6 M urea can be added to the gel to resolve better atp8 and atp9. Gradient 15%–20% gels can also give better resolution.\nLoad 15 μL (40–50 µg) of each sample in the pockets.\n\tNOTE: It is not necessary to measure protein concentration if OD600 values were close in step 1.6. If not, measure protein concentrations using the assay with detergent-compatible reagents.\nRun the gel in a cold room until the blue dye reaches approximately 65% of the gel length.\n\tNOTE: For the system used (e.g., Protean II xi cell), we use either of the two modes: 16–17 h at 5 V/cm or 5 h at 15 V/cm. No proteins run faster than the bromophenol blue dye, but long runs can result in blurring of atp8 and atp9 signals.",
    "Stain the gel with Coomassie brilliant blue and make a scan or photo, which is required as a loading control.\n\tNOTE: An alternative way to make a loading control is immunoblotting with an antibody to mitochondrial “house-keeping” gene, e. g., porin 1.\n6. Autoradiography\nDry the gel in a gel-dryer. Keep it in the cassette with a storage phosphor screen for 3–5 days.\n\tNOTE: An alternative to screening the dried gel is the transfer of proteins to a nitrocellulose membrane by electro-blotting and screening it thereafter. It results in stronger signals and sharper bands.\nScan the screen on a phosphorimager.\n\tNOTE: As an alternative to phosphor imaging, X-ray film can also be used to reveal the signals.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}