{
  "id": 5234,
  "origin_website": "Bio",
  "title": "Heterologous Expression and Purification of the Magnesium Transporter A (MgtA) in <em>Escherichia coli</em>",
  "procedures": [
    "Overexpression of MgtAThe mgtA gene was amplified from E. coli DH5α genomic DNA using PfuUltra II Fusion HS DNA polymerase with the primers described earlier (Subramani et al., 2016). The reaction mixture and PCR conditions were made as suggested by the PfuUltra II Fusion HS DNA polymerase manual. The amplified gene was inserted between NcoI and XhoI restriction sites in pETM11 vector (EMBL). Thus the expressed MgtA will include 6x His tag followed by a tobacco etch virus (TEV) protease site at the N-terminus. Transform the pETM11(mgtA) plasmid into C43(DE3) competent cells and plate on LB kanamycin plate and incubate at 37 °C for 16 h. Select 5 colonies at random and inoculate in a 500 ml baffled bottom Erlenmeyer flask containing 200 ml LB media with 50 µg/ml of kanamycin. Incubate the flask at 37 °C with 150 rpm for 16 h.For large scale over expression of MgtA in C43(DE3) cells, we used the LEX 48 bioreactor system (Harbinger Technology LEXTM).Note: The LEX system delivers filtered compressed air through a sparger that passes through the screw cap. It provides both aeration and mixing of bacterial culture in the screw cap bottle. The culture flasks are placed in a temperature controlled water bath and the LEX 48 can accommodate 24 x 2 L standard screw cap bottles. Normally only 75% of the bottle capacity is used to avoid overflow of media during aeration. Inoculate 1% of overnight culture into 2 L screw cap bottles containing 1.5 L of growth media, 50 µg/ml of kanamycin and 1.5 ml of polypropylene glycol (PPG) P2000 (antifoaming agent). Place the bottles in the Lex 48 bioreactor water bath. Set the temperature of the water bath at 37 °C and initiate airflow through the spargers. Measure the optical density at 600 nm (OD600) every hour.",
    "The antifoaming agent PPG P2000 can become cloudy under these conditions and can be cleared upon incubation in ice for 5 min. Therefore, prior to the measurement at OD600, withdraw 1 ml of culture from the 2 L bottles and incubate on ice for 5 min.When the OD600 is ~0.6-2, stop the airflow and cool the water bath to 17 °C by adding ice. Leave the culture bottles at 17 °C for 30 min to ensure an equivalent temperature of the bacterial culture. In order to check the level overexpression by Western blot (see step 12), pellet 1 ml of bacterial culture at 12,000 x g, 4 °C and mark as SUI (uninduced). Add 1 mM of IPTG and an additional 1.5 ml of PPG P2000 to each bottle. Begin the airflow and leave the bottles at 17 °C for 16 h with continuous airflow.To terminate the induction, transfer the culture bottles to ice. Pellet 1 ml of bacterial culture from each bottle at 12,000 x g, 4 °C and mark as SI (induced) for Western blot analysis. Centrifuge rest of the bacterial culture at 7,000 x g for 20 min at 4 °C and divide the resulting cell pellet into 50 g aliquots in 100 ml disposable cups and store at -20 °C until further use.Suspend the SUI and SI sample pellets in 1x SDS-PAGE loading buffer to normalize the OD600 to 10 and incubate at RT for 5 min. Centrifuge the lysed cells at 20,000 x g for 20 min at 4 °C. For Western blot analysis use 10 µl of the supernatant and blot against Penta·His HRP conjugated antibody to check MgtA overexpression.",
    "Note: Confirmation of MgtA overexpression by Western blot against Penta·His HRP antibodies is highly recommended before beginning protein purification process as the detergents used during purification process are expensive and any problem associated with overexpression can be identified at this stage. Do not boil the samples used for SDS-PAGE and Western blot analysis. Cell lysis and solubilisationThaw the frozen cell pellet on ice and suspend in buffer A at 1:10 (wt/vol) ratio.Lyse the cells using EmulsiFlex-C3, a high pressure homogenizer (HPH) by passing the cell suspension three times at 11,000 psi. Always store the samples on ice unless otherwise stated. Note: We did not test the other lysis methods like sonication and bead beater. But we believe, that they could also be used. The protein yield should be expected to vary depending on the lysis method.Centrifuge the cell lysate at 20,000 x g for 20 min at 4 °C to remove unlysed cells and inclusion bodies.Collect the supernatant and centrifuge at 100,000 x g for 2 h at 4 °C to pellet both the inner and outer membrane (mixed membranes).Note: This step requires ultracentrifuge with the rotors and tubes selected according to the volume of the sample. For example, if the sample size is 70 ml, then 45 Ti rotor and 70 ml polycarbonate ultracentrifugation tube can be used with ultracentrifuge OptimaTMXE. It is important to fill the tubes used for ultracentrifugation until the neck of the tube with possibly no gap between the liquid and cap of the tube to avoid the implosion of tubes during centrifugation. Suspend the resulting mixed membrane pellet in buffer B using Potter-Elvehjem-type tissue homogenizer with 10 strokes. Use 1:10 (wt/vol) mixed membrane to buffer B ratio.",
    "Before adding the required amount of buffer B to membrane pellet, remove 10 ml to dissolve the detergent.Note: The membrane suspension can be flash frozen with liquid nitrogen and stored at -80 °C if not used immediately.We used 1% β-dodecyl maltoside (β-DDM) to solubilize the membrane proteins. Weigh the required amount of detergent powder and dissolve in the reserved 10 ml of buffer B. Add the dissolved β-DDM drop wise into the mixed membrane suspension while stirring at 150 rpm, 4 °C. The suspension is left to stir for another 60 min at 4 °C.Purification of MgtAPrior to use, wash the Histrap HP 5 ml column with 5 column volume (CV) of degassed MQ water and equilibrate with 10 CV of buffer C. Add 20 mM imidazole (pH 7.6) to the sample prepared in step B7 and load on the Histrap column at 2 ml/min.After loading solubilized membrane sample, wash the Histrap column with 10 CV of buffer C and 3 CV of 15% buffer D at 3 ml/min. We observed a small peak (Figure 1A, peak 1) while washing with 15% buffer D.Elute MgtA from the Histrap column by passing 50% buffer D at 3 ml/min. We observed a relatively large peak (Figure 1A, peak 2) while washing with buffer D.Take 5 µl sample from each fraction and perform SDS-PAGE electrophoresis with 12% polyacrylamide gels.We observed that Peak 1 contained a small proportion of MgtA along with other impurities, whereas peak 2 contained > 80% pure MgtA, as assessed by SDS-PAGE (Figure 1A).Pool the fractions corresponding to peak 2 and concentrate to 6 mg/ml using a vivaspin 20 (protein concentrator with 50 kDa cutoff).While concentrating the fractions, prepare a HiLoad 16/600 Superdex 200 pg column connected to the ÄKTA purifier by washing with 1.",
    "5 CV of degassed MQ and 1.5 CV of buffer E at 0.5 ml/min.Load 1 ml of concentrated MgtA (6 mg/ml) on the HiLoad 16/600 Superdex 200 pg column at 0.5 ml/min and pass 1.5 CV of buffer E. We observed a small peak at the void volume (44 ml), followed by a major monodisperse peak (Figure 1B, peak S1) at ~55 ml. For SDS-PAGE analysis, load 5 µl of fractions corresponding to the observed peaks on 12% polyacrylamide gels. We observed that the void peak contained mostly impurities, whereas peak S1 contained MgtA at > 95% purity as analyzed by SDS-PAGE (Figure 1B).Pool the fractions from peak S1 and concentrate to 3 mg/ml using vivaspin 20.Divide the concentrated MgtA as 50 µl aliquots and flash freeze with liquid nitrogen and store at -80 °C. In our experience, the protein was stable under these conditions for more than 1 year. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161108/20161108222547_9822.jpgFigure 1. Representative figures of MgtA purification profile. A. Chromatogram of Histrap FF affinity column (left). The fractions from Peak 1 (lanes 1-4) and Peak 2 (lanes 6-11) were analyzed using SDS-PAGE and the Coomassie stained gel (right) shows the purity of the respective peaks. B. Chromatogram of size exclusion chromatography (left). The fractions from void (lanes 1-5) and Peak S1 (lanes 7-14) were analyzed using SDS-PAGE and the Coomassie stained gel (right) shows the purity of the respective peaks. In both SDS-PAGE gel pictures, MgtA runs at 100 kDa."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}