{
  "id": 3630,
  "origin_website": "Cell",
  "title": "Protocol for precision editing of endogenous Chlamydomonas reinhardtii genes with CRISPR-Cas",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nRNP assembly\nTiming: 20 min\n      This step prepares the Cas9 ribonucleoprotein (RNP) complexes required for\n      transformation.\n    \n      The CRISPR-Cas system requires a guide RNA (gRNA) bound to the Cas9\n      enzyme, known together as the RNP. The gRNA is usually hybridized from a\n      variable CRISPR RNA (crRNA) and an invariable trans-activating crRNA\n      (tracrRNA). Optionally these two parts can be combined during synthesis\n      and are commercially available as single-guide RNA (sgRNA).\n    \nNote: We used AltR Cas9, crRNA and\n      tracrRNA from IDR for all of our work, but we expect RNA from other\n      suppliers such as STEMCELL Technologies, Thermo Fisher or GenScript to\n      work as well.\n    \nCritical: crRNA and tracrRNA must be\n      sourced from the same supplier, as suppliers may use proprietary\n      hybridization regions which may not be compatible.\n    \n        Dissolve crRNA and tracrRNA to 100 μM each in duplex buffer. If using\n        sgRNA, dissolve to 50 μM and skip sub-step a.\n        \nMix 5 μL of crRNA with 5 μL of tracrRNA.\n            Heat to 95°C for 2 min then let cool on the bench.\n            \nNote: This results in 50 μM gRNA.\n            \n            Mix 16 μL of duplex buffer with 2 μL of (s)gRNA and 1.6 μL of Cas9\n            enzyme (62 μM glycerol stock) in 1.5 mL tube\n          \n            Flick the tube briefly or pulse vortex to mix.\n            \nNote: This results in a 5 μM RNP\n              solution.\n            \nNote: In our hands, left-over gRNA\n              can be frozen at −20°C for months without any notable decrease in\n              efficiency.\n            \nNote: We generally avoid storing\n              assembled RNPs and instead prefer to scale down the amount of\n              freshly prepared to match the number of needed reactions in order\n              to reduce losses. One electroporation of 10 μL needs 1 μL of RNP\n              solution and we generally do four repeat reactions.\n            \nTransformation\nTiming: 2 days",
    "In this step, Chlamydomonas cells are transformed with donor DNA\n      and RNPs to induce precise genetic changes.\n    \n      Since transformation efficiency is cell cycle dependent, it is critical to\n      perform this step at the proper time. Given a start of the light cycle at\n      8:00 o’clock, electroporation should generally be performed between 12:00\n      and 14:00. Perform all steps in a strictly sterile fashion.\n    \n      In our hands, this transformation procedure results in a transformation\n      efficiency of about 200 colonies per 10 μL electroporation reaction. Of\n      picked colonies, on average 65%–90% have an insertion genotype sufficient\n      to knock out the gene of interest and about 20% of colonies have an\n      error-free scarless integration sufficient for endogenous tagging.\n    \n        Harvest.\n        \n            Scrape cells from the culture plate into TAP medium in a 1.5 mL\n            tube.\n          \n            Centrifuge at 600 RCF for 1 min and aspirate supernatant to remove\n            debris.\n          \nResuspend pellet in 100 μL TAP medium.\n            Measure new total volume to determine total pellet volume. For each\n            planned mutant line, dispense the equivalent of 15 μL of pellet\n            (\n∼ 15\n·\n1  0 6 \n            cells) into a new 1.5 mL tube.\n          \nNote: Each aliquot from this step serves\n      for transforming two different constructs.\n    \n        Remove cell walls.\n        \n            Fill up with autolysin to 1.2 mL.\n            \nNote: For fully cell wall\n              deficient lines such as CW92 autolysin can be replaced by TAP-N,\n              however many cw strains still have a partial wall and should\n              undergo the full autolysin treatment.\n            \n            Using a higher concentration of cells will result in cell death\n            after heat shock, which drastically reduces transformation\n            efficiency. Incubate for 40–60 min.\n          \nCentrifuge cells at 500 RCF for 3 min.\nCarefully aspirate supernatant.\nResuspend in fresh autolysin.\n            Incubate for 40–60 min at 20°C–30°C on a light board.\n            \nCritical: Cells without cell",
    "walls are much more delicate and can lyse when centrifuged too\n              hard.\n            \n            Mix a 20 μL sample with 1 μL of 10% IGEPAL CA-630 (0.5% final) and\n            observe cell lysis under a phase contrast microscope. Lysing cells\n            should dissolve smoothly and not leave behind remnants of the cell\n            wall.\n          \n            If any cell walls remain, repeat from step c.\n            \nNote: Typically 2–3 cycles of\n              autolysin treatment are needed to fully strip all cell walls.\n            \n            Heat shock cells by placing the tubes in a thermoblock for 30 min at\n            40°C with mild shaking (200–400 rpm).8[href=https://www.wicell.org#bib8],9[href=https://www.wicell.org#bib9]\n        Set up electroporation environment.\n        \nFill a clean, sterile Neon tube with 3 mL of Neon Buffer E.\n            Place the Neon tube in the Neon pedestal by clicking it in place.\n          \n            Prepare a 24 well plate by filling the wells with 1 mL TAPS medium.\n            \nNote: We usually repeat the\n              electroporation up to 4 times. With 4 repeats a single 24 well\n              plate can accommodate up to 6 different constructs.\n            \n            Pick up a new Neon tip.\n            \nFully pushing the plunger of the Neon Pipette\n                Press the pipette vertically onto a fresh tip (Figures 3[href=https://www.wicell.org#fig3]A and 3B) until the tip clicks into place.\n                \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3194-Fig3.jpg\n                      Figure 3. Chlamydomonas electroporation procedure\n                      using the Neon electroporator\n                    \n                      (A) Push the plunger of the positive displacement pipette\n                      to the end and push onto 10 μL Neon tip.\n                    \n(B) Correctly attached Neon tip.\n                      (C) Fill the Neon tip with cell/DNA/RNP mixture by slowly\n                      releasing the pressed plunger of the pipette, making sure\n                      no bubbles are aspirated.\n                    \n                      (D) Insert the filled pipette into the electroporation\n                      pedestal.\n                    \n                      (E) Fully inserted pipette with filled tip ready for\n                      electroporation by 3 pulses at 2300 V for 12 ms (set and\n                      started by Neon touchscreen).\n                    \n                      (F) Release successfully electroporated reactions slowly\n                      into 1 mL TAPS buffer in a 24-well plate.",
    "(G) After overnight recovery, spread one reaction per\n                      plate on 1.5% TAP-Agar plates with the correct antibiotic\n                      added. Use a homemade glass or disposable plastic\n                      spreading loop to distribute cells evenly across the\n                      plate.\n                    \n                Release the plunger.\n                \nNote: Each new construct\n                  should be electroporated with a fresh tip, but multiple\n                  repeats can be performed with the same tip.\n                \n        Wash cells three times in TAPS.\n        \nCritical: MMP1, the cell wall\n          removing enzyme in autolysin is highly cytotoxic when electroporated\n          into cells and will result in cells dying if not removed thoroughly.\n        \nCentrifuge at 500 RCF for 2 min.\nResuspend gently in 1.2 mL TAPS.\nRepeat.\n        Prepare electroporation reactions.\n        \nCentrifuge at 500 RCF for 2 min.\n            Resuspend cells in 50–90 μL TAPS to a final cell density of\n            \n 1 − 2 \n·\n1  0 8 \n            cells/mL.\n          \n            Re-aliquot 50 μL of this solution per into fresh 1.5 mL tubes at one\n            tube per intended construct.\n          \nAdd 5 μL RNP solution to a tube.\n            Add 1.5 μg of cut donor DNA matching the RNPs to the same tube and\n            flick tube to mix.\n          \n        Perform the electroporation.\n        \n            Draw 10 μL of the final mixture into the Neon pipette, making sure\n            there are no bubbles in the pipette (Figure 3[href=https://www.wicell.org#fig3]C).\n            \nNote: Unlike most electroporators,\n              the Neon system can diagnose bad contacts and will alert the\n              operator to the presence of bubbles or bad contacts.\n            \n            Push pipette with filled pipette tip into the filled Neon tube\n            placed in the pedestal until a click is felt (Figures 3[href=https://www.wicell.org#fig3]D and 3E).\n          \n            Electroporate for 3 pulses at 2300 V for 12 ms by setting the\n            parameters on the Neon touch screen and pressing the large round\n            “Start” button.\n            \nNote: Some versions of the Neon\n              system might fail at this step with a warning that the chosen",
    "parameters are over the power limit. Lowering the Voltage slightly\n              to 2200 V should resolve the problem in these cases without\n              significantly impacting the transformation result.\n            \n            Discharge pipette into 1 mL of TAP + 50 mM sucrose in a 24 well\n            plate.\n            \nNote: Repeat this step up to 5\n              times per pipette (Figure 3[href=https://www.wicell.org#fig3]F), one well per\n              transformation. Pooling reactions is not recommended and should\n              generally not be necessary.\n            \nCritical: When transforming\n              multiple constructs using background strains which are already\n              resistant to any of the resistance vectors used, transform\n              resistant cells last or exchange the Neon cuvette to avoid\n              contamination colonies.\n            \n        Recover and select transformants.\n        \n            Let the cells recover 16–24 h in the light.\n            \nCritical: Do not skip recovery\n              as transformation efficiency will drastically decrease especially\n              for Nourseothricin or Blasticidin S.\n            \n            Plate one well per plate on selective 1.5% TAP agar plates (Figure 3[href=https://www.wicell.org#fig3]G).\n            \nNote: An ethanol-sterilized glass\n              spreader made from a long glass Pasteur pipette works best in our\n              hands for achieving an even spread, but other spreading tools such\n              as disposable plastic loops can be used.\n            \nNote: In our hands, 2 plates per\n              construct are almost always sufficient. On a single plate,\n              typically between 100 and 800 colonies will form.\n            \nNote: Concentrating the\n              transformation mixture before plating by centrifugation at 500 RCF\n              for 2 min is recommended to reduce the plating volume to ∼100 μL.\n            \nWait for colonies to develop.\n            Pick 24–48 colonies for knock-outs and 48–96 colonies for knock-ins\n            into a 96 well plate filled with 200 μL TAP per well.\n          \n            Proceed to section\n            Screening by qPCR[href=https://docs.google.com/document/d/1NnUhLXrrU-Id83JsMsD-X6vpbRBmezCpRMO5GOTvPfY/edit].\n          \nScreening by qPCR\nTiming: 3–4 h\n      Due to inefficiencies in the mutagenesis process, the picked colonies need\n      to be screened for correct insertion. Here, a qPCR screen is used to\n      identify candidates that have undergone the expected homology directed\n      repair.",
    "Prepare crude extracts.\n        \n            Transfer 5–20 μL of cells of interest into a 96-well PCR plate.\n          \n            Add the same volume of QuickExtract solution to each well and seal\n            the plate with PCR foil.\n          \nQuickly vortex the plate to mix.\n            Centrifuge for a few seconds to collect all liquid in the bottom of\n            the wells.\n          \n            In a thermocycler, heat the plate to 65°C for 6 min, then to 98°C\n            for 2 min to lyse cells.\n          \nBriefly vortex again.\n        Assemble 96-well or 384-well qPCR plate with 6 μL reactions with primers\n        either specific to the desired genotype or a mix of the two primer pairs\n        for each mating type.\n      \ntable:files/protocols_protocol_3194_12.csv\nCritical: Most PCR master mixes,\n      especially those marketed for qPCR fail to amplify reliably when crude\n      Chlamydomonas lysate is used. When using other products than\n      suggested here, the reaction products should be verified for specificity\n      before the master mix is used for large scale screening.\n    \nNote: It is highly recommended to premix\n      all ingredients except the template (cell lysate) in bulk and dispense to\n      reduce pipetting errors.\n    \nCritical: Most PCR master mixes,\n      especially those marketed for qPCR fail to amplify reliably when crude\n      Chlamydomonas lysate is used. When using other products than\n      suggested here, the reaction products should be verified for specificity\n      before the master mix is used for large scale screening.\n    \nNote: It is highly recommended to premix\n      all ingredients except the template (cell lysate) in bulk and dispense to\n      reduce pipetting errors.\n    \nNote: When using a 384 well format, the\n      total reaction can be halved to 3 μL per well, but care should be taken to\n      work quickly to prevent wells from evaporating. We recommend electronic\n      repeater pipettes for dispensing the PCR mix into the wells.\n    \nNote: When determining mating type by\n      qPCR, two primer pairs (crMTM_q_1F, crMTM_q_1R, crMTP_q_1F and crMTP_q_1R)",
    "need to be used. We keep these primers at double the normal concentration\n      for ease of use. These four primer pairs can be used as a reliable\n      positive control and will result in two easily distinguishable peaks for\n      the two mating types in high resolution melting analysis.\n    \n        Run the qPCR reaction.\n        \nSeal plate with qPCR foil.\nBriefly vortex to mix.\nCentrifuge at 1000 RCF for 1 min to remove any air bubbles.\n            Cycle reactions in a qPCR machine with the following conditions:\n          \ntable:files/protocols_protocol_3194_13.csv\n        Analyze resulting melting curves for quantitation cycle Cq\n        values per gene of interest (see Figure 4[href=https://www.wicell.org#fig4] for\n        example).\n        \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3194-Fig4.jpg\n              Figure 4. qPCR analysis of FACS sorted progeny of back-crossing\n              IFT46-mScarlet drc4::PAR x CC-125\n            \n              (A) Amplification plot showing difference between positive\n              amplifications (Cq<25) and nonspecific\n              amplifications (Cq>25).\n            \n(B) Presence-absence plate map for all probed targets.\n              (C) High-resolution melting (HRM) of IFT-46 c-terminus\n              amplification, showing two similar but distinct profiles for\n              IFT46-mScarletI and wild-type IFT46.\n            \n              (D) HRM based mating type analysis unambiguously distinguishing\n              MT(-), MT(+) and empty wells.\n            \n              (E) HRM of amplification specific to c-terminal\n              mScarlet fusion of IFT46 with specific and\n              non-specific curves.\n            \n              (F) HRM of amplification specific to paromomycin resistance gene\n              (AphVIII) with specific and non-specific curves.\n            \nNote: Successful amplifications generally\n      have a Cq of 18-28, with higher values indicating the absence\n      of the selected amplicon and subsequent non-specific amplification.\n    \nNote: Cq values for the same\n      gene of interest should clearly cluster, but the average Cq can\n      vary somewhat. Combined mating type primers should always amplify, and\n      mating type can be directly determined from the high resolution melting\n      profile of the finished reaction.\n    \nSelection and verification\nTiming: 2 days\n      Among the candidates identified in Screening by qPCR, only a subset will\n      have integrated the donor DNA without additional mutations. The most",
    "common defects encountered are micro-homology driven fragment exchanges in\n      the donor DNA. This step selects for mutants that have integrated the full\n      donor DNA without additional unwanted changes.\n    \n      Nuclear transformation in Chlamydomonas however suffers from\n      unwanted side effects, ranging from commonly encountered non-specific\n      integration of donor DNA, donor template recombination or Cas9 off-target\n      activity, to rarer but highly problematic events such as interchromosomal\n      crossover. In the context of creating engineered Chlamydomonas cell\n      lines, genetic insertions should be unconditionally verified by sanger\n      sequencing to confirm the integrity of the desired mutation.\n    \nNote: For cell lines that result from a\n      crossing experiment, the results of the qPCR screening in combination with\n      phenotypic controls is generally sufficient to select a progeny line for\n      long term propagation or storage.\n    \n        Select 5–10 colonies that were identified to have correct homology\n        directed repair flanks in\n        Screening by qPCR[href=https://docs.google.com/document/d/1NnUhLXrrU-Id83JsMsD-X6vpbRBmezCpRMO5GOTvPfY/edit].\n        \n            Select primers suitable to amplify the functional part of the wanted\n            insertion.\n          \nAssemble 12 μL PCR reactions with the following composition:\ntable:files/protocols_protocol_3194_14.csv\nNote: If extremely high GC content is\n      present in the amplified regions (>30 bp islands over 90% GC) the added\n      Betaine concentration can be increased up to 5 M (2 M final). This can\n      slightly decrease amplification efficiency for amplicons with less GC\n      content.\n    \nCycle using the following conditions:\ntable:files/protocols_protocol_3194_15.csv\n        Select reactions with the expected size band.\n        \n            Run 0.5 μL of the product in loading buffer on an agarose gel.\n          \n            Identify bands with approximately the expected size.\n            \nNote: The correct band is\n              generally the consensus size on the gel.\n            \nPurify selected reactions.\n            Mix products with sequencing primers and send for Sanger sequencing.\n          \nVerify the absence of indels and SNPs in resulting sequences.\nCrossing by FACS\nTiming: 2 weeks\n      Here, the genome of two Chlamydomonas lines of opposite mating type is",
    "combined via meiosis in a rapid process that utilizes the ability of\n      modern FACS sorters to isolate single cells directly from a liquid\n      suspension.\n    \n      Despite the general ease of introducing exogenous DNA into the genome of\n      Chlamydomonas when following this protocol, it is still frequently\n      desirable to cross different lines. Some common reasons for wanting to do\n      so include:\n    \nCombining or transferring insertions: Crossing allows for rapid\n      combination of multiple desired traits without the need for re-sequencing\n      the loci of interest. Additionally, traits can generally be combined even\n      if they express the same antibiotic resistances.\n    \nDetecting and removing unwanted insertions: Since\n      Chlamydomonas cells tend to integrate exogenous DNA by random\n      insertion, this can lead to undesired secondary inserts during CRISPR-Cas\n      mediated mutagenesis. Back-crossing to a wild-type by this protocol offers\n      simultaneously an easy readout for multiple insertions as well as a means\n      of selecting for single-copy insertions. When screening the crossing\n      progeny for the endogenous edit (by primers flanking the insertion) as\n      well as for the used resistance (both primers on the resistance cassette),\n      ideally only endogenous edit positives are also resistance positive. If\n      endogenous edit negative but antibiotic resistance positive wells are\n      detected, secondary insertions are likely present and re-crossing progeny\n      with high Cq(resistance)/Cq(endogenous insert) is\n      advised.\n    \n      Changing mating type: If opposite mating types are required for downstream\n      experiments, crossing naturally produces progeny of both mating types\n      which can be identified purely based only on qPCR analysis. This is also a\n      direct result of the back-crossing workflow above.\n    \nConversely, there are cases in which crossing should be avoided:\nSubtle phenotypes: If a gene of interest causes a very mild\n      phenotype with no specific readout available, crossing can introduce\n      phenotypic differences that outweigh the studied one, especially when very\n      disparate source lines are used.",
    "Genes in close proximity: If genes are in too close proximity on\n      the same chromosome (<200 kbp) recombination frequency becomes\n      prohibitively low and CRISPR-Cas editing should be used instead.\n    \n        Derp Prepare mating competent cells.\n        \n            Dissolve streaks of source cells of opposite mating type in TAP\n            medium and plate on TAP 1.5% agar. Place plates in constant light\n            for 5–7 days.\n          \n            Scrape cells off both plates and dissolve in TAP-N medium in\n            separate 1.5 mL tubes.\n          \n            Wash cells once by centrifuging at 600 RCF for 1 min to remove\n            debris and resuspend in at least 1 mL of TAP-N.\n          \n            Leave cells for 6–8 h in high light. Ensure that cells develop\n            cilia.\n          \n            Mix a small aliquot of both mating types and check for mating under\n            a microscope.\n          \n        Mate cells when sufficient competency is reached.\n        \nCombine both tubes into one.\n            Check for mated cells after 20–30 min in a phase microscope.\n            \nNote: High efficiency mating like\n              for autolysin preparation is not required for crossing.\n            \n            Spread mating mixture on TAP 1.5% agar plates and place in constant\n            light for about 18 h.\n          \n        Wrap plates in aluminum foil and place in the dark for at least 5 days.\n      \nPause point: Plates can be kept in\n      the dark for weeks to months, but hatching efficiency will decrease over\n      time.\n    \n        Isolate mating progeny.\n        \nRemove aluminum foil.\n            Wash plates thoroughly by pipetting to remove all unmated cells.\n            \nNote: A dense layer of highly\n              adherent zygospores should be visible as a yellow sheen on the\n              agar surface.\n            \nCritical: Continue washing\n              until barely any swimming cells can be observed in a cell culture\n              microscope.\n            \n            Place the plate in constant light and wait for zygospores to hatch\n            (1–2 days).\n          \n            Scrape some of the hatched cells off the plate with an inoculation",
    "loop and dissolve in 200–2000 μL of TAP medium in a FACS tube.\n          \nLoad FACS tube into FACS machine.\n            Record forward and side scatter profile and sort the peak as single\n            cells into a 96-well plate filled with TAP medium.\n            \nCritical: If palmelloids\n              (multiple cells held together by a parental cell wall) are present\n              in the solution, add 0.1 V autolysin to the tube and briefly\n              vortex in order to sort only single cells.\n            \nNote: sorting only the peak\n              reduces the probability of sorting debris or cell clumps.\n            \n        Wait for cells to grow (typically ∼5–7 days), optionally re-plate by\n        desired phenotype and proceed to\n        Screening by qPCR[href=https://docs.google.com/document/d/1NnUhLXrrU-Id83JsMsD-X6vpbRBmezCpRMO5GOTvPfY/edit]."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Cell Biology",
    "Genetics",
    "Crispr"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}