{
  "id": 17703,
  "origin_website": "Jove",
  "title": "Single Myofiber Isolation and Culture from a Murine Model of Emery-Dreifuss Muscular Dystrophy in Early Post-Natal Development",
  "procedures": [
    "All the experimental procedures were performed under the ethical approval of the Italian Ministry of Health and the Institutional Animal Care and Use Committee (authorization n. 83/2019-PR). The animals were maintained in an authorized facility at San Raffaele Hospital, Milan, Italy (authorization n. N. 127/2012-A).\n1. Muscle dissection and myofiber culture\nEquipment preparation.\n\t\nBefore starting, prepare all the necessary solutions as described in Table 1. These solutions need to be freshly prepared.\nClean all the surfaces and tools that will be used during the procedure with 70% ethanol.\nBefore starting with mice sacrifice, perform coating of 100 mm and 35 mm Petri dishes using Horse Serum (HS). Coat all dishes to prevent myofibers from attaching to the plastic. Consider using one 100 mm dish and four 35 mm dishes per mouse.\nAfter removing the excess of HS, store coated dishes in an incubator at 37 °C for 30 min. Then fill it with washing solution or culture medium (two 35 mm dishes per mouse).\n\t\tNOTE: Alternatively, a solution of 10% HS in Dulbecco's modified Eagle's medium (DMEM) can be used to coat dishes. Always use coated dishes. It is possible to use culture dishes of different size, but small dimension Petri dishes are recommended.\nFor fibers isolation, prepare sterile Pasteur pipettes as shown in Figure 2. For each mouse prepare one large hole bore pipette for muscle handling and mechanical disaggregation (Figure 2A) and one small hole pipette for fibers selection (Figure 2B). Cut each glass pipette, possibly using a diamond pen, to the desired length and smooth pipette’s edges on a flame.\nCoat each pipette by briefly wetting it with HS before use.\nMouse sacrifice and muscle dissection",
    "Pre-warm the digestion solution at room temperature for 10 min before starting the dissection procedure. Polypropylene FACS round-bottom tubes are the most suitable containers for the purpose.\nImmediately before the beginning of muscle retrieval, sacrifice the mouse according to proper national IACUC recommendation.\nWet its lower body with 70% ethanol before cutting the skin to make the removal of the hair easier.\nPut the mouse in a prone position on a support of polystyrene covered with aluminum paper and cut the skin starting from the middle of the back longitudinally and in the direction of the legs.\nCarefully remove the skin without touching the muscles and tendons. It is possible to rip off all the skin.\nCut the two legs of the mouse and rapidly proceed with the dissection.\n\t\tNOTE: If it is more comfortable, it is possible to continue the dissection on the entire mouse but working on the leg allows more mobility and precision in the later cuts.\nFix the leg on the support at the level of the foot using a pin and start isolating skeletal muscles of interest in this order: TA, EDL, Gastrocnemius and Soleus.\nLift the lower tendon of TA with a sharp tweezer at ankle height and cut it, then cut with fine scissor all around the TA muscle to the other tendon at the level of the patella (Figure 3A). Transfer into the digestion solution.\nLift the lower tendon of EDL and separate it from other muscles by gently pulling it upward up to the other tendon. Cut and place it into the digestion solution.",
    "NOTE: Since EDL may be extremely small to be cut separately from TA, they can be dissected together (Figure 3B). Then, if the entire muscle is too big, cut it in 2-3 pieces starting from the tendon and following the fibers in a longitudinal direction (Figure 3C).\nRotate the leg showing the back muscles and fix the foot using the pin. Lift the Achille’s tendon, Gastrocnemius will automatically separate from other muscles. The upper tendon is up in the back of the patella. Cut it and add the muscle to digestion.\nLift the external tendon of the leg (with respect to the body) and obtain the Soleus. Gently separate it from the other muscles by scrolling under with the tweezer.\nDo the same for the other leg (steps from 1.2.7. to 1.2.11.).\nMuscle digestion\n\t\nIncubate the digestion solution containing all the muscles in a water bath at 37 °C for about 45-50 min. During the digestion time, regularly check the muscle to avoid over-digestion. Every 10 min invert the digestion tubes 10x with an energetic movement (avoid vortexing).\nStop the digestion when muscles start to loosen up and myofibers are visible.\nAt the very end of the digestion time shake the samples.\nTo stop the digestion, carefully transfer the digestion suspension to a pre-warmed 100 mm Petri dish with 10 mL of washing solution.\n\t\tNOTE: Avoid muscle over-digestion as this will inevitably result in the isolation of hyper-contracted myofibers. Usually with this protocol, muscles of homozygous mutant mice take 45 min to be digested, while muscles of wild type mice take 50-55 min. Digestion time needs to be experimentally validated.\nSingle myofibers isolation",
    "First isolate the fibers already dissociated under a dissecting microscope by picking them individually with a coated P200 pipette or small hole Pasteur and transfer them from the 100 mm Petri into a new 35 mm Petri dish with 5 mL of pre-warmed washing solution.\nTo release further myofibers, pipette the muscle up and down using a large hole bore glass pipette with warm medium, until fibers are mechanically released. Do not be too persistent as this will result in damaging fibers.\nContinue releasing myofibers from the muscle until the dish contains a desirable amount. If the Petri dish is kept at room temperature for more than 8 min, stop and perform a minimum of 5 min incubation at 37 °C, 5% CO2 to re-equilibrate the medium.\nBefore transferring the single myofibers to the culture medium, leave them at 37 °C, 5% CO2 in wash dish for at least 1 h. This helps myofibers to adjust to the in vitro condition.\n\t\tNOTE: Adult myofibers are less susceptible to stress and can be washed ~ 2-3x. However, in this condition (at 19 days post-natal age) it is better to perform only one washing step to prevent myofiber damage. Therefore, always pay attention to keep selected myofibers sufficiently clean by not carrying debris or hypercontracted fibers.\nSingle myofiber culture\n\t\nTransfer individual myofibers to a new pre-warmed dish with the appropriate culture medium (high serum medium to allow satellite cells activation, see Figure 1).\nChange the medium to the isolated myofibers, by transferring them to a new coated dish with new culture medium, only after 48-72 h of culture to avoid any stress that will lead to myofibers hypercontraction and disruption.\n2. Downstream applications: Myofibers crosslinking and immunofluorescence",
    "NOTE: The myofibers-associated satellite cells can be visualized by immunofluorescence (IF) at the time of interest. Since most of the published protocols are optimized to perform IF on adult myofibers, here a detailed protocol is presented to obtain reliable results also on myofibers isolated from post-natal muscles.\nMyofiber crosslinking\n\t\nBefore starting, prepare all the necessary solutions as described in Table 2.\nPrecoat with HS as many 1.5 mL microcentrifuge tubes as the number of samples. Be sure to remove all HS before proceeding. Since crosslinked fibers are tougher than the living ones and more difficult to pipette, be sure to crosslink about 200-300 fibers separately per tube.\nUnder a dissecting microscope, collect all the fibers that can be considered healthy, transfer them to the microcentrifuge tube and leave the tube vertical for 5 min inside the incubator to allow fibers to settle.\nRemove the supernatant very slowly from the tube.\nCrosslink fibers by adding 1 mL of 4% paraformaldehyde (PFA) at RT to the tube. Do it gently to avoid fibers distress.\nTo prevent fibers interweaving during the crosslinking, keep the tube in very gentle agitation for 10 min.\nKeep the tube in a vertical position for 5 min at RT to allow fibers to settle, then discard the supernatant ensuring to remove the majority of PFA volume.\nAdd 1 mL of phosphate buffered saline (PBS) and keep the tubes vertical for 5 min at RT to let the fibers to sediment.\nRemove the supernatant and repeat the washing procedure (step 2.1.8.) twice again.\nKeep crosslinked samples at 4 °C.\n\t\tNOTE: It is possible to keep crosslinked myofibers at 4 °C for a week. If the fibers remain more than a week in this condition, this will inevitably result in myofibers intertwinement.\nImmunofluorescence",
    "Keep the tubes containing the fibers standing at RT for at least 5 min to allow for fiber sedimentation.\nRemove the supernatant, leaving just a small volume to be sure not to remove any fiber.\nAdd 1 mL of 0.5% Triton X-100 in PBS and incubate for 5 min with gentle agitation.\nPut tubes in vertical position for 5 min, then remove supernatant.\nAdd 1.5 mL of PBS and incubate with gentle agitation for 5 min.\nKeep tubes in vertical position for 5 min, then remove the supernatant.\nAdd 1 mL of blocking solution and incubate for 1 h at RT with gentle agitation.\nKeep tubes 5 min in vertical position, then remove the supernatant.\nDilute primary antibodies in blocking solution, add them to the tubes and incubate over-night at 4 °C in gentle agitation (for suggested concentrations see Table of Materials).\n\t\tNOTE: Alternatively, the primary antibody can be incubated for 3 h at RT. However, overnight incubation gave optimal staining. The incubation volume for both primary and secondary antibodies should be of 300 µL when sedimented fibers reach the 100 µL notch of the 1.5 mL microcentrifuge tube. When fibers are less abundant, a volume of 100-200 µL is recommended.\nLeave the tubes in vertical position for 5 min and then remove the supernatant.\nPerform 3 washes in 1 mL of 0.25% Tween-20 in PBS, incubating for 5 min in gentle agitation and then leaving the tubes standing for 5 min each time.\n\t\tNOTE: From here on, perform all the steps in the dark, to avoid fluorochromes bleaching.\nDilute secondary antibodies in blocking solution, add them to the tubes and incubate for 1 h at RT with gentle agitation (for concentrations see Table of Materials).",
    "Wash twice in 1 mL of 0.1% Tween-20 in PBS, incubating for 5 min with gentle agitation and then leaving the tubes in standing position for 5 min.\nRemove the supernatant, add 1 mL of DAPI solution and incubate for 5 min with gentle agitation.\nLet the tubes stand vertically in a rack for 5 min, then remove the supernatant.\nWash with 1 mL of PBS, incubating for 5 min with gentle agitation and then leaving the tubes stand in a rack for 5 min.\nRemove the supernatant, leaving a volume of about 50 µL.\nMounting of fluorescently labeled myofibers on microscope slides\n\t\nCut a P200 pipette tip and coat it with blocking solution\n\t\tNOTE:To coat the tip, pipette the solution up and down several times before picking the fibers, this will avoid fibers to stick to the tip wall.\nCollect the fibers from the tube and spread them on a microscope glass slide.\nUnder a dissecting microscope, using only the natural light reflected by the mirror, use a new (not cut) P200 pipette tip to spread the fibers and to remove the excess liquid solution.\nLeave the slides to air dry in the dark for about 10-15 min, until very low amount of solution remains.\nAdd the mounting medium on the slide (the proper amount of mounting medium should be calibrated on the dimension of the coverslip: for a 24 x 40 mm coverslip, 20 µL is enough) and then slowly lay a cover glass on the area containing the fibers. Be careful not to create bubbles between the glasses.\nPress the coverslip so that the fibers will lay on a single horizontal plan.\nFix the coverslip using nail polish.\nStore the samples at 4 °C for up to 4 weeks.",
    "Acquire the desired images of fluorescently labeled myofibers with a confocal microscope."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}