{
  "id": 3218,
  "origin_website": "Cell",
  "title": "A differentiation protocol for the generation of pancreatic beta-like cells from human embryonic stem cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThis paper contains protocols for hESCs cultures, 2D planar culture differentiation of hESCs to pancreatic progenitor, 3D culture differentiation of pancreatic progenitor to beta-like cells and negative enrichment of beta-like cells through CD9. The schematic of the protocol and representative images of cells at different stages are shown in Figure 1[href=https://www.wicell.org#fig1]. It also contains protocols for immunostaining of beta-like cells, flow cytometry and in vitro glucose-stimulated insulin secretion assay (GSIS).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2788-Fig1.jpg\nFigure 1. Overview of differentiation protocol for hESC derived beta-like cells\n(A) Schematic of the protocol used to differentiate hESCs toward beta-like cells. Summary of 6-stage differentiation including 2D planar culture and 3D culture. At the final of stage 6, CD9 negative cells were sorted by FACS and re-aggregated with AggreWell 400.\n(B) Representative brightfield images of cells at different stages. On day 0, hESC; Day 3, stage 1, definitive endoderm; Day 6, stage 2, primitive gut tube; Day 8, stage 3, posterior foregut; Day 13, stage 4, pancreatic progenitor. Cells were treated with Dispase and broke into cell aggregates on day 13 and transferred to ultra-low wells for 3D culture. On Day 14, cell aggregates formed 3D spheroids spontaneously. Day 20, stage 5, immature beta-like cells; Day 28, stage 6, mature beta-like cells. On Day 29, cells were dissociated into single cells and sorted for CD9 negative cells. CD9- cells self-organized into spheroids on day 30.\nThaw and culture hESCs\nTiming: 2 weeks\nThese steps describe how hESCs are thawed and how to culture hESCs on a hESC-qualified Matrigel coated T75 flask for maintenance culture.\nThaw hESCs.\nCoat one T75 flask with 5 mL hESC-qualified Matrigel coating solution.\nIncubate the flask in a cell culture incubator at 37°C and 5% CO2 for 1 h.",
    "Prepare 25 mL mTeSR™1 medium with 10 μM Rock inhibitor.\nEquilibrate the medium in a biological safety hood to room temperature (20°C–25°C).\nNote: Rock inhibitor will be used overnight (18–24 h) to enhance the survival of hESCs after the cells are cryopreserved or dissociated into single cells. Therefore, it is of importance to add Rock inhibitor when hESCs are thawed or passaged when hESCs are dissociated ito single cells.2[href=https://www.wicell.org#bib2]\nRemove one cryogenic vial of hESCs from liquid nitrogen tank.\nQuickly thaw cells in a 37°C water bath by gently shaking the vial until only a small frozen cell pellet remains.\nTransfer the cells to 15 mL conical tube.\nAdd 9 mL mTeSR™1 medium with 10 μM Rock inhibitor dropwise to the 15 mL tube and mix gently.\nCentrifuge the cells at 300 × g for 5 min to pellet the cells.\nAspirate the supernatant and resuspend the pellet in 1 mL mTesR™1 medium with 10 μM Rock inhibitor.\nCount the cell number by hemocytometer.\nPrepare 1,125,000 cells (15,000 cells / cm2) in 15 mL mTeSR™1 with 10 μM Rock inhibitor\nSeed the cells in one T75 flask precoated with hESC-qualified Matrigel.\nNote: For the H9 hESC line, our experience shows that the flask will reach 90% confluency in 5 days at this seeding density. One T75 can generate 20 million hESCs approximately when it reaches 90% confluency. For different cell lines, the doubling times may be different, and the seeding density should be optimized.\nDistribute the cells by moving the flask back and forth, left and right for several times.\nPlace the flask in a humidified incubator at 37°C and 5% CO2.\nOn the next day, refresh the medium with 15 mL fresh mTeSR™1 medium without Rock inhibitor.\nChange medium every day until hESCs reach 90% confluency.\nEnzymatic Passaging.",
    "Before passaging hESCs, coat one T75 flask with 5 mL hESC-qualified Matrigel coating solution at 37°C for 1 h.\nPrepare mTeSR™1 medium with 10 μM Rock inhibitor and equilibrate in a biological safety hood to room temperature (20°C–25°C).\nAspirate the hESC medium and rinse the cells with 5 mL PBS.\nAspirate the PBS and add 5 mL Accutase.\nIncubate the cells for 6 min in a cell culture incubator at 37°C and 5% CO2.\nObserve under microscope to make sure all the cells are detached.\nAdd 3-fold volume of DMEM/F12 to quench the Accutase.\nTransfer the cells to conical tube and centrifuge at 250 × g for 5 min.\nAspirate the supernatant and resuspend the pellet with 5 mL mTeSR™1 with 10 μM Rock inhibitor.\nCount the cell number with hemocytometer.\nSeed the cells on hESC qualified Matrigel-coated culture ware for maintenance or GFR-Matrigel coated culture ware for differentiation.\nNote: Before differentiation, hESCs are adapted to grow for at least two passages after thawing.\nPancreatic progenitor differentiation\nTiming: 2 weeks\nPancreatic progenitor differentiation comprises 4 stages: from day 0 to day 2, stage 1 for definitive endoderm; day 3 to day 5, stage 2 for primitive gut tube; day 6 to day 7, stage 3 for posterior foregut; day 8 to day 12, stage 4 for pancreatic progenitor. This part is modified from.3[href=https://www.wicell.org#bib3]\nHere describes the setting of pancreatic beta-like cell differentiation from H9 on a T75 flask.\nNote: before changing the medium every day, warm the differentiation medium in a 37°C water bath and keep the growth factors on ice and chemicals at room temperature (20°C–25°C).\nOn day -1, seed hESC for differentiation.\nPrepare 20 mL mTeSR™1 with 10 μM Rock inhibitor and prewarm in a biological safety hood to room temperature (20°C–25°C).",
    "Coat one T75 flask with 5 mL GFR-Matrigel coating solution and incubate it in a cell culture incubator at 37°C and 5% CO2 for 1 h.\nPrepare 20 mL mTeSR™1 with 10 μM Rock inhibitor and prewarm in a biological safety hood to room temperature (20°C–25°C).\nDissociate 90% confluent hESC cultures into single cell suspension using Accutase (Refer to enzymatic passaging).\nAfter centrifugation, resuspend cell pellet in 5 mL mTeSR™1 supplemented with 10 μM Rock inhibitor.\nCount the cell number by hemocytometer.\nSeed 11,250,000 hESCs (150,000 cells / cm2) in 15 mL mTeSR™1 supplemented with 10 μM Rock inhibitor on a T75 flask coated with GFR-Matrigel.\nNote: Scale the media volumes and cell densities when different cultureware is used based on the surface area.\nOn day 0, aspirate the hESC culture medium and wash the flask with 5 mL PBS twice.\nAdd 15 mL RPMI medium supplemented with 15 μL of 100 μg/mL hActivin A and 3 μL of 10 mM Chir99021.\nOn day 1, refresh the medium with 15 mL RPMI medium supplemented with 15 μL of 100 μg/mL hActivin A, 15 μL of 50 mg/mL Vitamin C and 7.5 μL of 10 μg/mL hFGF-2.\nOn day 2, refresh the medium with 15 mL RPMI medium supplemented with 15 μL of 100 μg/mL hActivin A, 15 μL of 50 mg/mL Vitamin C and 7.5 μL of 10 μg/mL hFGF-2.\nOn day 3, refresh the medium with 15 mL B27-RPMI medium supplemented with 7.5 μL of 100 μg/mL hKGF and 15 μL of 50 mg/mL Vitamin C.\nOn day 4 and 5, replace the medium with the same medium as day 3.",
    "On day 6, refresh the medium with 15 mL B27-DMEM medium supplemented with 7.5 μL of 0.5 mM SANT-1, 7.5 μL of 4 mM Retinoic acid, 7.5 μL of 100 μg/mL hNoggin, 7.5 μL of 100 μg/mL hKGF and 15 μL of 50 mg/mL Vitamin C.\nOn day 7, refresh the medium with the same medium as day 6.\nOn day 8, refresh the medium with 15 mL B27-DMEM medium supplemented with 7.5 μL of 100 μg/mL hNoggin, 7.5 μL of 100 μg/mL hEGF, 150 μL of 1 M Nicotinamide and 15 μL of 50 mg/mL Vitamin C.\nOn day 9–12, refresh the medium with the same medium as day 8.\nOn day 13, the pancreatic progenitor cells are ready for harvesting.\nPancreatic beta-like cells differentiation\nTiming: 16 days\nDifferentiation of pancreatic beta-like cells from progenitor cells contains 2 stages: day 13 to day 19, stage 5 for immature beta-like cells; and day 20 to day 28, stage 6 for mature beta-like cells. This part is modified based on.4[href=https://www.wicell.org#bib4],5[href=https://www.wicell.org#bib5]\nOn day 13, change to 3D culture.\nPrewarm 5 mL 1 U/mL Dispase in a 37°C water bath.\nAspirate the medium and rinse the cells with 5 mL PBS twice.\nAdd 5 mL prewarmed Dispase into the culture and place the culture ware in a 37°C and 5% CO2 humidified incubator for 7 min.\nGently aspirate the Dispase and use 5 mL DMEM to wash the culture once.\nAdd 10 mL DMEM and gently detach the cells by a cell lifter.\nNote: Take care to minimize the breakup of colonies.\nTransfer the detached cell aggregates into a 15 mL conical tube.\nGently use pipette to break the cell patches into cell aggregates (100–200 μm).",
    "Critical: This process must be very gentle. Too small aggregates may die during differentiation, and too big aggregates may cause lower differentiation efficiency.\nCentrifuge the cell aggregates at 80 × g for 2 min and aspirate the supernatant.\nAdd 12 mL MCDB131 differentiation medium supplemented with 6 μL of 0.5 mM SANT-1, 6 μL of 200 μM Retinoic acid, 2.4 μL of 50 mM RepSox, 2.4 μL of 5 mM GC1, 12 μL of 1 mM Compound E, 1.2 μL of 1 mM LDN193189, 12 μL of 50 mg/mL Vitamin C and 12 μL of 10 mM Rock inhibitor into the pellet.\nGently pipette the cell aggregates up and down.\nAliquot 2 mL into each well of one Ultra-Low Attachment 6 Well plate.\nNote: One Ultra-Low Attachment 6 Well plate is enough for one T75 flask of cell aggregates.\nOn day 14, the cell aggregates will form 3-dimensional (3D) spheroids spontaneously.\nCheck the 3D culture.\nNote: The diameter of most aggregates should be between 100 to 200 μm.\nRefresh medium in 3D culture.\nTransfer the culture into a 15 mL conical tube.\nLet the cell spheroids settle down for 10 min with no disturbance.\nNote: Cell spheroids will gather at the bottom of the tube.\nRemove the supernatant and replace with the same differentiation medium as day 13.\nPlate the cell spheroids back to the same Ultra-Low Attachment 6 Well plate.\nOn day 15, check the cell spheroids without changing medium.\nNote: If big clumps formed, disrupt the clumps by triturating with a P200 pipettor gently when necessary.",
    "On day 16 to day 19, refresh the medium with 12 mL MCDB131 differentiation medium supplemented with 2.4 μL of 50 mM RepSox, 2.4 μL of 5 mM GC1, 12 μL of 1 mM Compound E, 1.2 μL of 1 mM LDN193189, 12 μL of 50 mg/mL Vitamin C and 12 μL of 10 mM Rock inhibitor every other day.\nOn day 20 to day 28, refresh the medium with 12 mL MCDB131 differentiation medium supplemented with 2.4 μL of 50 mM RepSox, 2.4 μL of 5 mM GC1, 2.4 μL of 50 mM Trolox, 2.4 μL of 10 mM R428, 24 μL of 500 mM N-acetyl cysteine and 12 μL of 50 mg/mL Vitamin C every other day.\nOn day 29, the human beta-like cells are ready to harvest for quality examination including immunofluorescence assay or downstream functional assays.\nNegative enrichment of human beta-like cells through CD9\nTiming: 2 days (for steps 23 to 25)\nThis part describes steps for negatively enriching beta-like cells through targeting the cell surface marker CD9 based on fluorescence activated cell sorter, followed by re-aggregation of the CD9 negative cells by AggreWell 400.\nOn day 29, collect the beta-like cells.\nTransfer the beta-like cell clusters into a 50 mL conical tube.\nLet the cell clusters settle down for 10 min without disturbance.\nNote: Cell clusters will gather at the bottom of the tube.\nPrewarm 10 mL TrypLE Express in a 37°C water bath in the meantime.\nAspirate the supernatant and add 5 mL PBS to wash the cell clusters.\nLet the clusters settle down again for another 10 min without disturbance and aspirate the supernatant.\nAdd 10 mL prewarmed TrypLE Express.\nGently pipette up and down by P1000 for 12 min.",
    "Note: Pipetting must be very gentle to reduce the damage to the cells during dissociation.\nAdd 20 mL MCDB131 differentiation medium to quench the enzymatic dissociation.\nCentrifuge the cells at 500 × g for 5 min.\nAspirate the supernatant.\nWash the cells once with 5 mL FACS buffer.\nStaining of CD9 for sorting.\nCount the cell numbers with a hemocytometer.\nAdd 5 μL conjugated anti-human CD9-PE antibody per 1 million cells in 100 μL FACS buffer.\nPrepare isotype control staining at the same time.\nIncubate on ice for 30 min in the dark.\nCells are then washed twice with FACS buffer and resuspended in 1 mL FACS buffer.\nPerform fluorescence activated cell sorting.\nNote: Dead cells are excluded by Dapi positive staining for live cell analysis. Dapi is diluted freshly in PBS (1:10,000). Use isotype control for gating out the CD9 negative population.\nUse FACS Collection buffer to collect cells and sort 600,000 CD9 negative cells in each collection tube.\nNote: Generally, one Ultra-Low Attachment 6 Well Plate of beta-like cell culture can generate 3 million cells.\nRe-aggregate the CD9 negative cells.\nPrepare one AggreWell™400 24-well plate according to the product instructions.\nAfter sorting, centrifuge the collection tubes at 500 × g for 5 min.\nPrepare 5 mL MCDB131 differentiation medium supplemented with 1 μL of 50 mM RepSox, 1 μL of 5 mM GC1, 1 μL of 50 mM Trolox, 1 μL of 10 mM R428, 10 μL of 500 mM N-acetyl cysteine, 1 μL of 50 mg/mL Vitamin C and 1 μL of 10 mM Rock inhibitor.\nResuspend each pellet by 1 mL of the above medium and seed the cells into one well of one AggreWell™400 24-well plate.\nAfter overnight (18–24 h) culture, sorted CD9 negative cells will spontaneously self-organize into spherical 3D organoids.",
    "Note: Cells can then be harvested for downstream functional assay, such as in vitro glucose-stimulated insulin secretion.\ntable:files/protocols_protocol_2788_19.csv\nImmunofluorescence assay for frozen section of beta cells\nTiming: 2 days\nThis part describes steps for preparation of frozen section of pancreatic progenitors and beta-like cells clusters and immunofluorescence staining assay.\nPreparation for OCT frozen section.\nTransfer the progenitor or beta-like cell clusters into 1.5 mL centrifuge tube.\nCentrifuge the tube at 80 × g for 2 min.\nNote: The cell clusters will be pelleted, and dead cells will be in the supernatant.\nAspirate the supernatant and add 1 mL PBS to wash the cell clusters.\nCentrifuge the tube at 80 × g for 2 min and remove the supernatant.\nFix the cell clusters with 1 mL 4% PFA for 1 h at room temperature (20°C–25°C).\nCentrifuge the tube at 80 × g for 3 min to pellet the cell clusters.\nRemove the supernatant PFA and add 1 mL PBS to wash the cell clusters for 3 times.\nEquilibrate the cell clusters with 30% sucrose at 4°C overnight (18–24 h).\nNote: Cell clusters will be settled down at the bottom after overnight (18–24 h) equilibration.\nRemove the sucrose as much as possible.\nAdd one drop of OCT compound to the cell clusters and transfer the cell cluster with OCT to a disposable base mold (7 × 7 mm). Store at −80°C.\nCut 5 μm sections by a cryostat and place on Superfrost plus slides.\nPause point: The slides can be used for immunostaining directly or stored at −80°C.\nImmunofluorescence staining assay\nPut the slides at room temperature (20°C–25°C) for 1 h prior to immunostaining.\nWash the slides in PBS once to remove the OCT.\nNote: All washing step is performed in coplin staining jar at room temperature (20°C–25°C).",
    "Permeabilize the cells by incubating the slides with 0.5% Tween-20 in PBS for 10 min.\nUse Pap pen to draw a liquid repellent barrier around the section of cell clusters.\nAdd 200 μL 10% donkey serum in PBST to the middle of the section for blocking for 30 min.\nTap off the blocking buffer.\nIncubate the section with 100–200 μL primary antibodies diluted in 1% BSA PBST (PDX1 1:200, NKX6.1, 1:400; C-peptide, 1:1000) at 4°C overnight (18–24 h).\nThe second day, remove the primary antibody and wash the slides with PBST for 3 times.\nIncubate the sections with 200 μL secondary antibodies (Alexa-Donkey anti rat 488 or Alexa-Donkey anti rabbit 488, Alexa-Donkey anti goat 594, 1:600 dilution) diluted in 1% BSA PBST for 1 h at room temperature (20°C–25°C).\nNote: Prepare the secondary antibodies freshly and protect from light for staining.\nRemove the secondary antibodies.\nAdd Dapi or Hoechst 33342 (1:10,000 diluted in distilled water) for 10 min.\nNote: Prepare the Dapi or Hoechst 33342 freshly and protect from light.\nWash the slides with PBST for 3 times.\nAdd one drop of mounting medium to the center of section.\nPlace the coverslip on top of the mounting media.\nThe slides can be imaged using a fluorescence microscope.\nIntracellular flow cytometry for C-peptide and NKX6.1 of beta cells\nTiming: 2 days\nIntracellular staining for flow cytometry.\nTransfer one well of 6-well ultra-low attachment plate to 15 mL conical tube.\nLet the cell clusters settle down for 10 min without disturbance.\nNote: Cell clusters will gather at the bottom of the tube.\nPrewarm 2 mL TrypLE Express in a 37°C water bath in the meantime.\nAspirate the supernatant and add 2 mL PBS to wash the cell clusters.\nLet the clusters settle down again for another 10 min without disturbance.",
    "Aspirate the supernatant.\nAdd 2 mL prewarmed TrypLE Express and pipette gently up and down by P1000 for 12 min.\nNote: Pipetting must be very gentle to reduce the damage to the cells during dissociation.\nAdd 2 mL MCDB131 differentiation medium to quench the enzymatic dissociation.\nCentrifuge the cells at 500 × g for 5 min.\nAspirate the supernatant and wash the cells once with PBS.\nAdd 1 mL cold 4% PFA to fix the cells on ice for 1 h.\nCentrifuge the cells at 500 × g for 5 min and remove the PFA.\nNote: Swinging bucket rotor is recommended for centrifuge to avoid the loss of cells.\nWash the cells with PBS twice.\nIncubate the cells with 300 μL Perm/Blocking buffer on ice for 1 h.\nCentrifuge the cells at 500 × g for 5 min.\nResuspend the pellet in 200 μL Perm/blocking buffer with goat anti-NKX6.1 antibody (1:200 dilution) and rat anti-C-peptide antibody (1:500 dilution).\nIncubate at 4°C overnight (18–24 h).\nWash the cells with Perm/Blocking buffer twice.\nIncubate the cells with 200 μL Perm/Blocking buffer with Alexa-Donkey anti rat 488, Alexa-Donkey anti goat 647 (1:1000 dilution) at room temperature (20°C–25°C) for 1 h.\nNote: Prepare the secondary antibodies freshly and protect from light for staining.\nWash the cells with Perm/Blocking buffer for 3 times.\nResuspend the cells in 500 μL FACS buffer for flow acquisition.\nAcquire flow cytometry data with a CytoFLEX Platform (can be replaced with other flow cytometry) using excitation lines at 488 nm and 635 nm.\nNote: Intact cells are identified based on forward and side light scatter. Cells stained with secondary antibody alone are used for background estimation and gating strategy.\nGlucose stimulated insulin secretion assay\nTiming: 1 day (for step 29)",
    "This part describes steps for glucose-stimulated insulin secretion assay for beta-like cell clusters from Aggrewell400. It can also be used for beta cell clusters from ultra-low attachment plates. All buffers are equilibrated to 37°C before use.\nGlucose stimulated insulin secretion assay for CD9- beta-like cells.\nCollect the beta cell clusters from Aggrewell400 to 1.5 mL micro-centrifuge tubes.\nCentrifuge the tube at 80 × g for 2 min\nWash the cell pellets with Krebs buffer twice.\nIncubate the cell clusters with 1 mL low glucose Krebs for 1 h in a 5% CO2/37°C incubator.\nWash the cell cluster with Krebs buffer twice.\nIncubate in 1 mL low glucose Krebs for 40 min.\nCentrifuge the tube at 80 × g for 2 min and collect the supernatant.\nWash the cell cluster with Krebs buffer twice.\nIncubate in 1 mL high glucose Krebs for 40 min.\nCentrifuge the tube at 80 × g for 2 min and collect the supernatant.\nWash the cell cluster with Krebs buffer twice.\nIncubate in 1 mL KCl Krebs buffer for 40 min.\nCentrifuge the tube at 80 × g for 2 min and collect the supernatant.\nDissociate the cell pellets with TrypLE Express Enzyme.\nCount the cell number by hemocytometer.\nFilter all the supernatant is through 0.22 μm syringe filter.\nPause point: Filtered supernatant can be used for determination of insulin directly or stored at −80°C until use.\nQuantify the human insulin with human ultrasensitive insulin ELISA kit and normalize the data by cell number.\nNote: The incubation time for each step can be adjusted from 30 min to 2 h depending on the cell number. The supernatant can be diluted to make sure the insulin measurements are within the range of the standard."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}