{
  "id": 10923,
  "origin_website": "Jove",
  "title": "Isolation of Primary Human Colon Tumor Cells from Surgical Tissues and Culturing Them Directly on Soft Elastic Substrates for Traction Cytometry",
  "procedures": [
    "The protocol described below follows the guidelines of UIUC human research ethics committee.\n1. Collection and Digestion of Surgical Tissue Sample\nCollect the tumor tissue sample right after colon resection (Figure 1A and 1B). Collect tissue from an adjacent healthy site as well.\nTransfer the tissue immediately to a 15 ml vial containing 12 ml HBSS solution. Keep the vial on ice inside an insulated foam box.\nTransport the tissue containing vial to a tissue culture hood for further processing within 45 min. Keep the vial on an ice block inside the hood.\nPour the supplied tissue into a 6 well plate containing 6-7 ml of HBSS solution using a pipette.\n\tNote: Amount of tissue per well is not critical in this rinsing step.\nKeep the 6 well plate on an ice block. Rinse the tissue in HBSS solution twice.\nCut tissue cleanly into separated sections with sterile scissor. Mince tissue into smaller sections no greater than 1-2 mm3 in size with a sterile scalpel blade.\nWeigh a labelled 0.1% trypsin vial (containing 1 ml of 0.1% trypsin solution) before transferring the tissue. Transfer ~20 mg tissue into each of the 0.1% trypsin vials with a pipette.\nTry to minimize the transfer of HBSS into the trypsin vial to avoid further dilution of trypsin.\nWeigh the trypsin vials after tissue transfer; document the difference as the tissue mass.\nPour ~20 mg tissue and 1 ml trypsin into each well of a 24 well plate.\nPut the 24 well plate on shaker in fridge at 4 °C for 16-20 hr. During this wait period or at an earlier time, prepare polyacrylamide gel substrates and functionalize them with ECM proteins as described in section 3.",
    "2. Enzymatic Dissociation of Tissue Sample into Single Cell Suspension and Culturing Isolated Cells on ECM Functionalized Elastic Substrates and Rigid Polystyrene Dishes\nAfter 16-20 hr of incubation in trypsin well at 4 °C on shaker, transfer tissue from 4 °C trypsin to 4 °C complete growth media vial (containing 2-3 ml of complete growth media) using a pipette. Ensure minimal transfer of trypsin into growth media.\n\tNote: Complete growth media formulation is as follows: RPMI 1640 base medium supplemented with horse serum to a final concentration of 10% and penicillin-streptomycin to 1% of total solution.\nPlace the tissue containing media vial in a warm water bath at 37 °C for 12-15 min.\nTransfer the tissue to a 15 ml vial containing HBSS solution using a pipette, shake gently.\nRepeat 2.3.\nRemove tissue from HBSS solution and transfer to 0.1% collagenase solution (in HBSS) vial containing 1 ml solution. Incubate for 45 min at 37 °C and 5% CO2 environment in a humidified cell culture incubator. During the wait period, warm growth media in a 15 ml vial at 37 °C in water bath.\nPull out all tissue fragments into pipette minimizing collagenase carryover. Eject just the tissue fragments into pre-warmed culture media vials.\nPlace a 40 µm well-insert filter into each well of a 6 well plate. Moisten the filter with 1 ml cell culture media.\nTriturate tissue in media with a 10 ml glass pipette several times until tissue is completely dissociated.\nMaintain the pipette tip as close as possible to the base of the vial.\nDeposit the solution onto the filter to remove debris and undissociated parts.\nCentrifuge filtered cell suspension in media at 150 x g for 5 min at RT.\nRemove the supernatant afterwards and resuspend cell pellet with 2 ml fresh culture media.",
    "Count the cells using a hemocytometer (if required). Seed isolated primary cells on extracellular matrix (ECM) functionalized gels and polystyrene dishes at desired concentration.\n3. Preparation and Functionalization of Different Stiffness Polyacrylamide (PA) Gels and Polystyrene Substrates\nNote: For visual demonstration of Section 3, the viewers/readers are referred to a recent Journal of Visualized Experiments (JoVE) article17.\nAdopting published protocols18, 19, activate 12 mm2 glass cover slips chemically to ensure covalent binding of the hydrogel.\n\t\nFirst, treat glass cover slips with 3- Aminopropyltrymethoxysilane (ATS) for 7 min at RT.\nRemove the ATS completely with DI water rinse and treat cover slips with 0.5% Glutaraldehyde (diluted in PBS from 70% Glutaraldehyde stock solution) solution for 30 min.\nObtain 2 kPa gel solutions by mixing 5% w/v acrylamide solution and 0.05% N,N'-methylenebisacrylamide (bis) solution in 10 mM HEPES-buffered saline20. Use 8% w/v acrylamide and 0.13% N,N'-methylenebisacrylamide (bis) solution in 10 mM HEPES-buffered saline for 10 kPa gel20.\n\t\nIn both cases, use 1:200 ammonium persulfate (10% w/v) and 1:2,000 N,N,N',N'-tetramethylethylenediamine (TEMED) as the initiator and catalyst for the polymerization process, respectively.\nAlso, add 100 µl fluorescent beads to 2 kPa gel solution as fiduciary markers 21, 22.\nDeposit a drop of 20 μl pre-polymer PA gel solution on the 12 mm2 activated glass cover slip. Place another 12 mm2 regular glass cover slip on the drop. Ensure that the drop spreads between the cover slips due to capillarity. Invert the sandwich for 2 kPa gels to ensure that most of the beads come near the cell culture surface.\nCure the PA gel for 45 min at RT.\nPeel off the top cover slip using a single edge razor.\n\tNote: During peeling, detachment proceeds from one edge of the sandwich. The gel remains adherent to the activated glass slide.",
    "Store the gels in PBS solution before use.\nFunctionalize PA gels and glass with ECM molecules, human fibronectin at a concentration of 50 µg/ml following published methods 23.\n\t\nBriefly, incubate substrates with 2 ml pure hydrazine hydrate O/N.\nRemove hydrazine hydrate and rinse the substrates thoroughly with DI water.\nWash the substrates with 5% acetic acid for 30 min.\nRemove acetic acid and rinse the substrates thoroughly with DI water.\nKeep the substrates immersed in DI water for 30 min.\nIncubate the substrates with oxidized fibronectin for 35 min at a concentration of 50 µg/ml.\nRinse the substrates with PBS on shaker at low rpm for 10 min.\nIncubate all substrates at 37 °C in 2-3 ml culture media for 30 min before plating the cells.\n\t\tNote: Plate cells in a sparsely populated manner (1,000-3,000 cells/cm2). Each gel-covered glass slip needs to be contained in a 35 mm Petri dish. Allow cells to adhere completely before any microscopy (at least O/N).\n4. Traction Force Microscopy and Immunofluorescence Microscopy Assays\nTraction Force Microscopy Assay\n\t\nWarm 0.25% trypsin-EDTA / 10% SDS solution at 37 °C in water bath for 10 minutes before traction experiments start.\nRemove one gel from the cell culture incubator at a time and place on the fluorescent inverted microscope stage (32X magnification).\nFind a single cell in field of view. Remove the Petri dish lid.\nTake a phase contrast image of cell (e.g., Figure 3).\nSwitch the imaging mode to fluorescence and select appropriate filter. Don’t move the microscope stage or sample during this time.\nTake an image of the fluorescent beads displaced by cellular traction (Figure 4C).",
    "Add 1 ml trypsin/SDS solution to Petri dish to detach the cell from gel. Don’t move the microscope stage or sample during this time. Also, take a control image of the cell to ensure complete removal from gel.\nTake a reference (null force) image of the beads after the cell is removed.\nRepeat steps 4.1.2-4.1.8 for all other gels.\nMake an image stack using ImageJ from the two images acquired in step 4.1.6 and 4.1.8 for each case. To generate the image stack, use following sequence of commands in ImageJ after opening the images: Image → Stacks → Images to stack.\nTo obtain the displacement field and traction, use ImageJ plugins following published methods 21, 22. Obtain codes and detailed tutorials for these plugins using the following link: https://sites.google.com/site/qingzongtseng/imagejplugins[href=https://sites.google.com/site/qingzongtseng/imagejplugins].\n\t\t\nAlign the images in the stack using the ‘Template Matching’ plugin. Use following sequence of commands in ImageJ after opening the image stack generated in step 4.1.10: Plugins → Template Matching → Align Slices in Stack → OK. Save the image stack consequently. Use this new image stack in the following steps.\nObtain the displacement field using the PIV (particle image velocimetry) plugin (Figure 4D). Use following sequence of commands after opening the image stack saved in step 4.1.11.1: Plugins → PIV → Iterative PIV (Basic) → OK → Accept this PIV and output → Ok. Save the PIV output in the same directory as in the original image stack. Use this as input in next step.",
    "Finally use the FTTC (Fourier transform traction cytometry) plugin to obtain the traction map (Figure 4E). Use following sequence of commands: Plugins → FTTC → Insert material properties, i.e., Young’s modulus and Poisson’s ratio of PA gel → OK → Select the PIV output file saved in step 4.1.11.2 → OK. Save FTTC results in the same directory as in the image stack and PIV output.\nImmunofluorescence Microscopy Assays\n\t\nTake the substrates to be immunostained to the laminar hood and remove the culture media.\nRinse the substrates with PBS and fix the cells with 4% paraformaldehyde in PBS for 20 min at RT.\nWash the substrates with PBS for 3 times (5 min each time). Consequently, incubate the substrates with 500 µl signal enhancer for 30 min and rinse with PBS.\nIncubate cells with monoclonal anti-vinculin antibody at a 1:250 dilution in PBS for 45 min at RT. Wash the substrates with PBS for 3 times (5 min each time).\nIncubate the samples with secondary antibody Alexa Fluor 488 goat anti-mouse IgG at a 1:200 dilution in PBS at RT for 30 min. Wash the substrates with PBS for 3 times (5 min each time).\nTo visualize the F-actin structure, incubate cells with TRITC phalloidin conjugates at a concentration 50 µg/ml for 45 min at RT. Wash the substrates with PBS for 3 times (5 min each time).\nImage the samples using confocal scanning laser microscope (Figure 5A-5D).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}