{
  "id": 4741,
  "origin_website": "Bio",
  "title": "<em>Bean Pod Mottle Virus</em> (BPMV) Viral Inoculation Procedure in Common Bean (<em>Phaseolus vulgaris</em> L.)",
  "procedures": [
    "Growth of common bean ‘Black Valentine’ plants for primary inoculation by direct DNA rubbingSow the common bean ‘Black Valentine’ (Note 3) seeds in plastic pots (7 x 7 x 6 cm) filled with moisted vermiculite. Be careful to place the seed just under the vermiculite surface.Put the pots in a tub full of tap water and place in a growth chamber at 23 °C under a 16 h light/8 h dark cycle and 75% relative humidity (Note 4).Water the seedlings by regularly filling the tub with tap water so that watering is done by capillarity (approximately every two days, in our hands).Let the seedlings grow during 10-12 days (the stage at which primary leaves are fully-expanded).At this stage of development, the plants are ready to be inoculated (Figure 1A). If you need to maintain the plant for longer than two weeks after inoculation, we recommend to transplant three seedlings in moist vermiculite in a 20 cm diameter pot. Place the pot in a saucer full of water.Place the plants in a dark room at 19 °C and 75% relative humidity for 24 h prior to inoculation (Note 4).Mechanical inoculation of BPMV vectors by direct DNA rubbing of BPMV-derived infectious plasmidsFor mechanical inoculation of common bean using BPMV-derived infectious plasmids, provide 12 ‘Black Valentine’ plants for each BPMV construct.To inoculate one plant, mix 5 μg pBPMV-IA-R1M with 5 μg pBPMV-IA-V1 in a final volume of 20 μl of 50 mM potassium phosphate buffer pH 7 in an Eppendorf microfuge tube (Note 5).To inoculate one plant, mix 5 μg pBPMV-IA-R1M with 5 μg pBPMV-GFP2 or gene expression construct plasmid DNA in a final volume of 20 μl of 50 mM potassium phosphate buffer pH 7 in an Eppendorf microfuge tube (Note 5).",
    "To inoculate one plant, mix 5 μg pBPMV-IA-R1M with 5 μg pBPMV-PvPDS391bp or VIGS construct plasmid DNA in a final volume of 20 μl of 50 mM potassium phosphate buffer pH 7 in an Eppendorf microfuge tube (Note 5).Vortex briefly and spin down the tubes in a microcentrifuge.Powder the upper surface of one primary leaf per plant with carborundum (for the procedure see Video 1). The approximate amount of dusted carborundum should be as in Video 1 and Figure 1B. Don’t dust too much carborundum because it can generate undesirable necrotic areas after rubbing.    <p>imgsrc:https://bio-protocol.org/javascript:;</p>                                                           Video 1. BPMV primary inoculation in Phaseolus vulgaris (step B6)  Using a pipetman, put 20 μl DNA plasmid mix on the upper leaf surface at the junction between petiole and blade (Figure 1C).Make a rapid spreading of the DNA plasmid drop all over the leaf surface with a gloved finger (Video 2).    <p>imgsrc:https://bio-protocol.org/javascript:;</p>   Video 2. BPMV primary inoculation in P. vulgaris (steps B8-9)  Rub the leaf surface by making 6 passages with a gloved finger. Make this sequential progress twice (Video 2). All the leaf surface should be rubbed. Be careful not to rub too hard.At ~3-4 min after rubbing, rinse the inoculated leaf with tap water contained in a wash bottle until all carborundum is removed (Figure 1D).Remove gently the excess of water on the upper side of the leaf using absorbant paper (Figure 1E). As the leaf is weakened, be careful not to tear the leaf (Figure 1F).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150702/20150702221423_6122.jpgFigure 1. Mechanical inoculation by direct DNA rubbing of BPMV-derived infectious plasmid. A. A fully-expanded primary leaf of ‘Black Valentine’ at 10-12 days. B. One primary leaf per plant powdered with carborundum. C. 20 μl of DNA plasmid mix is put on the upper leaf surface at the junction between petiole and blade.",
    "Spreading of the DNA plasmid drop all over the leaf surface is made with a gloved finger as shown in Video 1. D. The inoculated leaf is rinsed intensively with tap water contained in a wash bottle. E. The excess of water is soaked up with absorbant paper. F. The dried inoculated primary leaf.Place the inoculated plants in a greenhouse or a growth chamber at 19 °C under a 16 h light/8 h dark cycle and 75% relative humidity (Note 4).Fertilize plants after mechanical inoculation by pouring the nutritive solution directly in the pot saucer (approximately 500 ml in a 20 cm diameter saucer). Fertilize at a 3-4 days interval.Viral symptoms induced by BPMV-Wt occur at about 3 to 4 weeks post-inoculation on the upper systemic leaves that become mottled and bloated (Figure 2A). Successful infection rate using the BPMV-Wt vector is 92-100% (Pflieger et al., 2014).Green fluorescence by BPMV-GFP (=pBPMV-IA-R1M + pBPMV-GFP2) can be seen on the primary leaves at about 9 days post-inoculation under UV light and after 17 days post-inoculation on the upper systemic leaves (in Pflieger et al., 2014, see Figure 1). Successful infection rate using the BPMV-GFP vector is 55% (Pflieger et al., 2014).White photobleaching phenotype corresponding to PDS gene silencing induced by BPMV-PvPDS391bp (=pBPMV-IA-R1M+pBPMV-PvPDS391bp) is not always observed for primary-inoculated plants (Figure 2B). Successful infection rate using the BPMV- PvPDS391bp vector is 58-91% (Pflieger et al., 2014).For each BPMV construct, harvest systemic infected leaflets at 3 to 4 weeks post-inoculation. Preferably choose young upper leaves. Place one leaflet in aluminum paper and freeze the sample in liquid nitrogen.Store all the leaflet samples at -80 °C until use for mechanical inoculation of infected leaf tissues (=secondary inoculation).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150702/20150702221456_7311.jpgFigure 2. Representative symptoms obtained in P. vulgaris cv.",
    "‘Black Valentine’ plants after mechanical inoculation of BPMV vectors by direct DNA rubbing of BPMV-derived infectious plasmids. A. BPMV-Wt, at 4 weeks post-inoculation. B. BPMV-PvPDS391bp, at 3, 5 weeks post-inoculation.Growth of common bean plants for mechanical inoculation of BPMV vectors using infected leaf tissues (=secondary inoculation)Follow the same protocol as described in A (Note 6).When other bean genotypes than ‘Black Valentine’ are analyzed, the growth duration of 10-12 days may be delayed until reaching the full-expanded stage of primary leaves.Mechanical inoculation of BPMV vectors using infected leaf tissuesPut a fresh or a frozen infected leaflet of common bean ‘Black Valentine’ in a mortar (Figure 3A).Grind briefly the tissue with a pestle to obtain a green mash (Figure 3B).Add ~3-4 ml of pH7 50 mM potassium phosphate buffer to make leaf sap.Grind again with the pestle to obtain a green leaf sap (Figure 3C). As leaf sap is usually heterogeneous, let it settle a few minutes.Powder the upper surface of one primary leaf per plant with carborundum (Video 1 and Figure 1A). Don’t dust too much carborundum because it can generate undesirable necrotic areas after rubbing (Note 7).Cut a Miracloth piece of ~8 x 6 cm (Figure 3D) and fold it in four (Figure 3E).Soak the folded Miracloth in the leaf sap (Figure 3F).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150702/20150702221507_8695.jpgFigure 3. Mechanical inoculation of BPMV vectors using infected leaf tissues. A-C. Preparation of infected leaf sap by grinding an infected leaflet with a mortar and pestle. D-E. The Miracloth piece is folded in four. F. The folded Miracloth piece is soaked in the leaf sap. Make a rapid rubbing with the soaked Miracloth all over the leaf surface (Video 3).    <p>imgsrc:https://bio-protocol.org/javascript:;</p>   Video 3. BPMV secondary inoculation in P. vulgaris  Rub the leaf surface by making 6 passages with the folded Miracloth (Video 3).",
    "Make this sequential progress only once. All the leaf surface should be rubbed.At ~3-4 min after rubbing, rinse the inoculated leaf with tap water contained in a wash bottle until all carborundum is removed (Figure 1D).Remove the excess of water using absorbant paper (Figure 1E).Place the inoculated plants in a growth chamber or greenhouse at 19 °C under a 16 h light/8 h dark cycle and 75% relative humidity.Fertilize plants after mechanical inoculation by pouring the nutritive solution directly in the pot saucer (approximately 500 ml in a 20 cm diameter saucer). Fertilize at a 3-4 days interval.Viral symptoms induced by BPMV-Wt occur on the upper systemic leaves at about 2 to 4 weeks post-inoculation depending on the genotype tested (in Pflieger et al., 2014, see Figure 3).Green fluorescence by BPMV-GFP (=pBPMV-IA-R1M + pBPMV-GFP2) can be seen on the primary leaves at about 4 to 9 days post-inoculation under UV light and after 10 to 17 days post-inoculation on the upper systemic leaves (in Pflieger et al.,  2014, see Figure 1).White photobleaching phenotype corresponding to PDS gene silencing induced by BPMV-PvPDS391bp (=pBPMV-IA-R1M + pBPMV-PvPDS391bp) is generally observed at 3 to 4 weeks post-inoculation (in Pflieger et al., 2014, see Figure 6), generally on the young upper leaves.For all BPMV vectors, the successful infection rate of secondary inoculation is close to 100% (Pflieger et al., 2014)."
  ],
  "subjectAreas": [
    "Microbiology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}