{
  "id": 10059,
  "origin_website": "Jove",
  "title": "Gelatin Methacryloyl Granular Hydrogel Scaffolds: High-throughput Microgel Fabrication, Lyophilization, Chemical Assembly, and 3D Bioprinting",
  "procedures": [
    "NOTE: See the Table of Materials for details related to all materials, instruments, and reagents used in this protocol.\n1. GelMA synthesis\nNOTE: GelMA synthesis should be conducted in a chemical fume hood, and proper personal protective equipment (PPE) should be used all the time.\nAdd 200 mL of Dulbecco's phosphate buffered saline (DPBS, 1x) to an Erlenmeyer flask and heat the solution until it reaches 50 °C. Cover the flask with aluminum foil to prevent evaporation.\nAdd 20 g of gelatin powder to the DPBS solution at 50 °C while stirring at 240 rpm until the powder is completely dissolved.\nAdd 16, 2.5, or 0.5 mL of methacrylate anhydride (MA) to the gelatin solution dropwise via a glass Pasteur pipette to synthesize GelMA with a high, medium, or low degree of methacryloyl substitution, respectively.\n\t​CAUTION: MA is a hazardous material. Proper PPE should be used when working with MA. MA is also light-sensitive, so protect the reaction from light by wrapping the flask with aluminum foil.\nAfter 2 h, add 400 mL of DPBS at 50 °C to stop the reaction. Allow stirring to continue at 50 °C for 10 min.\nPour the solution into a dialysis membrane tubing with 12-14 kDa molecular weight cutoff,  and then place the tubing in a 5 L beaker filled with 40 °C ultrapure water. Stir the water at 240 rpm and 40 °C.\nDialyze the solution against ultrapure water for 10 days and change the water 2x a day to remove unreacted methacrylate anhydride, byproducts, and other impurities.\nAfter 10 days, add 400 mL of ultrapure water at 40 °C to the GelMA solution. Stir the solution at 240 rpm for 15 min.\nFilter the solution twice using coffee filters, followed by vacuum filtration via a 0.2 µm vacuum filtration unit.",
    "Pour 25 mL of the filtered solution into 50 mL centrifuge tubes and freeze them at -80 °C, placing the tubes horizontally.\nAfter 2 days, remove the caps and cover the centrifuge tubes with laboratory wipes. Use tape or a rubber band to hold the wipes tightly.\nLyophilize the frozen GelMA solution to yield white solid GelMA.\nTo conduct proton nuclear magnetic resonance (1H NMR) spectroscopy, separately add 30 mg of gelatin powder (control) or lyophilized GelMA in 1 mL of deuterium oxide (D2O) and maintain the samples at 37 °C until the gelatin powder or GelMA is entirely dissolved.\nObtain the 1H NMR spectra and determine the degree of methacryloyl substitution by integrating the aromatic acids and lysine methylene proton peaks at chemical shifts of ~6.5-7.5 and ~3.0 ppm, respectively. Use the aromatic acids peak as a reference and determine the degree of substitution (DS) using lysine methylene peaks based on equation (1):\n\tDS (%) = [1 - (Area of lysine methylene in GelMA / Area of lysine methylene in gelatin)] × 100    (1)\nimgsrc://cloudfront.jove.com/files/ftp_upload/64829/64829fig01.jpg\nFigure 1: GelMA synthesis and characterization. (A) GelMA synthesis reaction. Gelatin is modified with methacrylic anhydride at 50 °C for 2 h. (B) The proton nuclear magnetic resonance (1H NMR) spectra of gelatin and GelMA: (a) the peak for aromatic acids, which is selected as the reference for calibration, (b) vinyl functional group peaks after the MA modification of gelatin, and (c) the peak for lysine proteins. In this example, the MA degree of substitution was 71% ± 3% (n = 3). This figure has been modified with permission from Ataie et al.11 Abbreviations: GelMA = gelatin methacryloyl; DPBS = Dulbecco's phosphate-buffered saline; MA = methacryloyl. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64829/64829fig01large.jpg]\n2. High-throughput GelMA microgel fabrication",
    "Device master mold microfabrication\n\tNOTE: Master molds may be microfabricated via soft lithography using the KMPR 1000 negative photoresist series19.\n\t\nThaw KMPR 1025 and 1035 overnight. Avoid any light exposure.\nTo coat the first layer on the wafer, add KMPR 1025 directly to the middle of the wafer to make an approximately 5 cm circle of photoresist. Run the spin coater at 3,000 rpm for 30 s.\nSoft bake for 12 min on a 100 °C hotplate. Then, cool down on the cooling plate for 5 min.\nAttach the first layer mask to the blank soda lime, then expose the coated wafer to UV light using a mask aligner for 645 mJ/cm2 of dosage.\nPost bake for 3 min on a 100 °C hotplate. Cool down on the cooling plate for 5 min.\n\t\tNOTE: Do not develop after this step. Develop only once at the end of the process.\nSpin coat the second layer on the wafer using the KMPR 1035. Run the spin coater at 1,000 rpm for 30 s.\nSoft bake for 30 min on a 100 °C hotplate. Cool down on the cooling plate for 5 min.\nAttach the second layer mask to the blank soda lime and align the second mask using the aligner through standard alignment signs. Expose to UV light using a mask aligner up to 2,000 mJ/cm2.\nPost bake for 5 min on a 100 °C hotplate.\nDevelop for >6 min in the SU-8 developer.\n\t\tNOTE: If the wafer looks milky, development should be continued for a longer time. Use fresh developer each time and in between for a better outcome.\nSpray with isopropanol. Make sure the wafer is clear, with no milky residues. Thoroughly dry the wafer using nitrogen (N2) gas.\nMicrofluidic device fabrication",
    "Pour 50 g of polydimethylsiloxane (PDMS) base part into a transparent plastic cup. Then, add 5 g of the crosslinker to the plastic cup. Mix the base and crosslinker using a spatula vigorously until a creamy texture is obtained.\nVacuum degas the mixture using a desiccator for 20 min until it becomes clear. Pour the mixture onto the master mold, which is placed inside and taped to a Petri dish.\n\t\tNOTE: Make sure the thickness (height) of the poured PDMS is ≤8 mm.\nPut the Petri dish into the desiccator and vacuum degas the PDMS mixture again for 20 min until all the bubbles are removed. Place the Petri dish in a 70 °C oven for 2 h until the PDMS is crosslinked. Take the Petri dish out of the oven and allow it to cool down.\nCut the devices out of the mold using a scalpel. Detach the devices slowly from the master mold. Use the biopsy punch (1.5 mm diameter) to cut holes through the inlets and the outlet.\nRemove any dust from the PDMS devices and the glass slides using masking tape, and place the glass slides and the devices in a plasma cleaner chamber. Perform the plasma treatment for 45 s (starting when the chamber turns purple) with air pressure under 400 mTorr. Remove the slides and devices from the chamber, put the device on the glass slides, and apply slight pressure. Put the device in the 70 °C oven for 30 min to enhance the bonding.\nFill the devices with trichloro(1H,1H,2H,2H-perfluorooctyl)silane (F-silane, 2% v/v) in the engineered fluid to render the channel surface fluorophilic. Inject the F-silane solution through the outlet and make sure all the devices are exposed. Wait for 5-10 min.",
    "NOTE: F-silane should be prepared freshly. In addition, F-silane should not be exposed to air for a long time.\nAspirate the F-silane solution out of the device through the aqueous solution inlet. Wash the device twice using the engineering fluid and aspirate again. Place the device in the 70 °C oven for 30 min to evaporate the remaining oil.\nDroplet formation and GelMA microgel fabrication\n\t\nAdd 10 mg of lithium phenyl-2,4,6-trimethylbenzoylphosphinate (LAP) to 10 mL of DPBS to prepare a photoinitiator (PI) solution (0.1% w/v). Protect the solution from light by wrapping it in aluminum foil.\nDissolve the desired amount of GelMA in the PI solution and place it in the 37 °C oven for 1 h until a clear solution is obtained. Protect the solution from light by wrapping in aluminum foil.\nTo prepare the oil phase, make a 2% v/v of biocompatible surfactant solution in the engineering fluid.\nInsert the Tygon tubing in the inlets and outlet of the PDMS device. Insert a 25 G blunt needle in the other end of Tygon tubing for inlets. Use the minimum possible tubing length.\nPlace the device under the microscope. Keep the environment warm (~40 °C) using a hair dryer and/or a space heater.\nLoad the aqueous and oil solutions in separate syringes, connected to the device. Start the syringe pumps with flow rates of 160 and 80 µL/min for the oil (continuous) and aqueous (dispersed) phases, respectively.\n\t\tNOTE: Start the oil phase first; make sure the oil fills the channel, then start the aqueous phase.\nCollect the droplets in a container and evaluate them in the imaging chamber via optical microscopy imaging.",
    "Place the droplets at 4 °C overnight while protecting them from light to initiate GelMA HMP physical crosslinking and convert the droplets to stable microgels at 4 °C.\n3. Converting microgels to resuspendable powder via the microengineered emulsion-to-powder (MEtoP) technology\nNOTE: The MEtoP technology to convert the water-in oil emulsion-based HMPs to microparticle powder (micro-aerogels) with preserved properties, such as resuspendability, shape, size, and assembly, has been developed.\nTo implement the MEtoP, collect the physically crosslinked HMPs in the engineering fluid using thermally durable microcentrifuge tubes or cryovials. Open the tube caps and seal them with a laboratory wipe and tape.\nDeep-freeze the physically crosslinked HMPs in liquid nitrogen (-196 °C) for 10 min.\nTransfer the flash-frozen tubes to a freeze-dryer instrument. Lyophilize the tubes at low pressure (e.g., 0.06 mbar) for at least 6 h to yield powder.\n\tNOTE: When the lyophilization cycle is finished, break the pressure slowly so the powder is not lost.\nAdd 1 mL of cooled PI solution (0.1% w/v, 4 °C) to the powder to make microgel suspensions. Vortex for 5 s, then centrifuge at 3,000 × g for 15 s. Discard the supernatant.\nTransfer the packed microgel suspension to a mold using a positive displacement pipette, followed by UV light exposure at 400 nm wavelength with an intensity of 15 mW/cm2 for 60 s to form GHS.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64829/64829fig02.jpg",
    "Figure 2: GelMA microparticle powder preparation via MEtoP technology. (A) Images of GelMA powder obtained from the MEtoP technology or conventional lyophilization of HMP. In MEtoP technology or conventional lyophilization, HMPs are suspended in oil-surfactant or aqueous media, respectively. The engineering fluid protects the dispersed phase (HMPs) from aggregation and preserves the physiochemical properties of GelMA microparticles during lyophilization. (B) Schematic illustration of dried HMPs prepared via the MEtoP compared with conventionally lyophilized HMP in an aqueous medium. (C) SEM images of dried GelMA microparticles prepared via the MEtoP compared with conventional lyophilization. Scale bars = 2 mm (left; A), 500 µm (right; A), 10 µm (left; C), and 200 µm (right; C). This figure was modified with permission from Sheikhi et al.26 Abbreviations: GelMA = gelatin methacryloyl; DPBS = Dulbecco's phosphate-buffered saline; MEtoP = microengineered emulsion-to-powder; HMP = hydrogel microparticle; SEM = scanning electron microscopy. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64829/64829fig02large.jpg]\n4. GelMA GHS formation\nNOTE: This protocol is for preparing 400 µL of microgel suspension. For larger quantities, scale-up is needed. To keep the GelMA HMPs physically crosslinked, all the steps should be performed at about 4 °C by placing the microgel containers in an ice-water bucket.\nAdd 400 µL of 1H,1H-perfluoro-1-octanol (PFO) solution in the engineering fluid (20% v/v) to the physically crosslinked GelMA HMPs. Then, vortex for 5 s and centrifuge for 15 s at 300 × g.\n\tNOTE: The PFO solution in the engineering fluid should be prepared freshly and stored in an enclosed container to prevent evaporation.\nRemove the oil phase from the GelMA HMPs via pipetting.",
    "Add 400 µL of PI solution (0.1% w/v) at 4 °C to the microgel suspension. Then, vortex for 5 s and centrifuge at 300 × g for 15 s. Discard the oil afterward.\nRepeat the previous step but centrifuge at 3,000 × g. Remove the supernatant of packed GelMA HMPs via pipetting.\nTransfer the packed GelMA HMPs to a mold using a positive displacement pipette, followed by UV light exposure (wavelength = 400 nm, intensity = 15 mW/cm2, exposure time = 60 s).\n5. Nanoengineered granular bioinks (NGB) for the 3D bioprinting of GHS with preserved microporosity\nAdd 100 mg of nanoplatelet powder to 3 mL of 4 °C ultrapure water to form a nanoparticle dispersion (3.33% w/v). Vortex the dispersion vigorously inside a 4 °C fridge for 15 min to exfoliate the otherwise aggregated nanoparticles. Properly exfoliated nanoparticles yield a clear dispersion.\nDissolve 50 mg of LAP in 5 mL of 4 °C ultrapure water to prepare a stock PI solution (1% w/v).\nAdd 333 µL of PI solution (1% w/v) to the exfoliated nanoparticle dispersion. Wrap in aluminum foil to protect against ambient light. Vortex for 1 min to mix the nanoparticle dispersion and PI. The final clay and PI concentrations are 3% w/v and 0.1% w/v, respectively.\nAdd PFO 20% v/v in engineering fluid (4 °C) to the physically crosslinked GelMA HMPs at a 1:1 volume ratio. Vortex thoroughly for 5 s. Then, centrifuge at 300 × g for 15 s and discard the oil phase containing the surfactant.\nAdd the LAP-supplemented nanoparticle dispersion (4 °C) to the washed GelMA HMPs. Vortex for 15 s, centrifuge at 3,000 × g for 15 s, and discard the remaining oil at the bottom as well as the supernatant dispersion.",
    "Store the suspension at 4 °C while protecting it from light using aluminum foil for 1 day. The product of this step is the GelMA NGB.\nLoad the NGB into a 3 mL syringe, seal the loaded syringe with a cap and parafilm, and pulse centrifuge at 200 × g to remove the trapped air. Transfer the bioink to a 3 mL cartridge using a female-female Luer-Lok connector. Centrifuge the cartridge briefly at 200 × g again to remove the trapped air. Keep the NGB at 4 °C in a fridge before using.\nBefore cell-laden bioink preparation, prepare a concentrated cell suspension (e.g., NIH/3T3 murine fibroblast cells), containing ~24 million cells in 100 µL of cell culture medium. Load the cell suspension into a 3 mL syringe, couple the NGB-loaded syringe and the cell-loaded syringe using a female-female Luer-Lok connector, and mix the cells and NGB gently by pushing back and forth 40x.\nPrint the NGB or cell-laden NGB using a proper bioprinter with a standard conical nozzle. Load the nozzle into the 3 mL printhead. Keep the printing bed temperature below 10 °C. Optimize printing parameters such as speed and back pressure prior to printing.\nSelect the substrate and nozzle type (pneumatic 3 mL syringe equipped with standard conical nozzle), calibrate the bioprinter using the device guidelines, select desirable gcode or STL file, and start printing.\n\tNOTE: When performing cell-laden bioprinting, all the materials and devices should be maintained under the biological safety cabinet to minimize contamination.\nAfter the printing, expose the construct to UV light for photocrosslinking (wavelength = 400 nm, intensity = 15 mW/cm2, exposure time = 60 s).\nimgsrc://cloudfront.jove.com/files/ftp_upload/64829/64829fig03.jpg",
    "Figure 3: Schematics of GelMA microgel and GHS formation. (A) Schematics of GelMA microgel separation from oil and NGB preparation. PFO (20% v/v in engineering fluid) was added to the GelMA microgel-oil emulsion at a 1:1 volumetric ratio, followed by vortexing and centrifugation at 300 × g for 15 s. To fabricate GelMA GHS, the PI solution (LAP 0.1% w/v in DPBS) was added to the GelMA HMPs, followed by vortexing and centrifugation at 3,000 × g for 15 s. For preparing the NGB, the PI solution (LAP 0.1% w/v in ultrapure water) and nanoplatelet dispersion (3% w/v in ultrapure water) were added to the GelMA HMP suspension, followed by vortexing and centrifugation at 3,000 × g for 15 s. Figure 3A was modified with permission from Ataie, Z. et al.11 (B) Exposing packed GelMA HMPs to light yields GHS. Figure 3B was modified with permission from Sheikhi et al.15 Abbreviations: GelMA = gelatin methacryloyl; GHS = granular hydrogel scaffold; NGB = nanoengineered granular bioink; PFO = 1H,1H-perfluoro-1-octanol; PI = photoinitiator; LAP = lithium phenyl-2,4,6-trimethylbenzoylphosphinate; HMP = hydrogel microparticle; DPBS = Dulbecco's phosphate-buffered saline. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64829/64829fig03large.jpg]Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}