{
  "id": 8493,
  "origin_website": "Jove",
  "title": "Induction of Complete Transection-Type Spinal Cord Injury in Mice",
  "procedures": [
    "All procedures were carried out with the approval of the Griffith University Animal Ethics Committee (ESK/04/16 AEC and MSC/04/18 AEC) under the guidelines of the National Health and Medical Research Council of Australia.\n1. Animal set-up procedure for the surgery\nAnesthetize and stabilize the animal.\n\t\nUse 8–10-week old female C57BL/6 mice. Use 5% isoflurane in 1 L/min oxygen for induction of anesthesia. For maintenance of anesthesia, use 1.5–2% isoflurane in 1 L/min oxygen. Confirm appropriate anaesthetization by establishing a lack of pain reflex in tail and hind paws.\n Administer buprenorphine (0.03 mg/kg body weight) for analgesia and enrofloxacin (10 mg/kg body weight) for antibiotic cover, subcutaneously according to body weight. Meloxicam (2 mg/kg body weight) can be given for long term analgesia if required. \nKeep the animal’s body temperature steady at 37 °C with a heating pad\n\t\nShave the back fur to expose the surgical area over the dorsal spine. Remove the shaved fur from surgical area before sterilizing the incision site. Sterilize the shaved area with sterile cotton swabs soaked in povidone iodine antiseptic liquid and surgical spirit.\nTape the paws of the mouse to the surgical area to stabilize the animal (Figure 1A). Place an oval window drape over mouse (Figure 1B).\n2. Laminectomy\nMake a vertical midline incision at the T10 vertebral level using a surgical scalpel.\n\t\nLocate the spinous process of T10 vertebra to determine the site of laminectomy. The body of the vertebra lies slightly cranial to the tip of the spinous process8 (see Figure 2). The tip rests approximately at the midpoint of the T11 vertebra8.\nMake the incision ~2.5 cm long, so that the spine of T10 vertebra is approximately at the middle of the length of the incision.\nReflect the skin and retract with retractors.",
    "Use the straight forceps to lift the skin from the underlying fascia. This will create space for the retractors to be placed; these will keep the surgical field open.\nPerform blunt dissection of subcutaneous tissue and fascia to expose the spinous processes.\n\t\nUse the blunt edge of the scalpel to make a small midline incision in the subcutaneous tissue and underlying fascia to expose the spines of T9–T11 vertebrae. Use the fine tip forceps (non-sharp) to perform blunt dissection and reflect the fascia.\nSplit and separate the para-spinous muscles to expose the laminae.\n\t\nUse the blunt tip of the scalpel to split the dorsal trunk muscles and para-spinous muscles along the spines of the T9–T11 vertebrae. Use the blunt fine tip forceps to perform blunt dissection of the muscles in layers and expose the laminae of the vertebrae. This should minimize any bleeding.\n\t\tNOTE: If there is any bleeding, use warmed saline (37 °C) irrigation and cotton swabs to control it and clear blood from the surgical field.\nUse the same forceps to make small pockets around the transverse processes of T10 vertebra. Use the curved forceps to stabilize the T10 vertebral body by hooking its prongs under the transverse processes, in the pockets created (Figure 1C).\nThoroughly rinse the T10 laminae with warm saline and gently wipe clean with cotton swabs to clearly visualize the bony surface. Make sure that no muscle/ligament attachments remain along the surface bilaterally.\nUse a drill with a fine tip (0.55 mm diameter, 7 mm length) to break the laminae bilaterally.",
    "Use the tip of the drill to trace a vertical path from T9–T10 intervertebral space to T10–T11 intervertebral space along both the T10 laminae, without turning the drill on. This is to ensure that the drill bit does not catch any tissue (Figure 1D).\nNow turning the drill on, slowly and carefully dig a vertical trench on the right lamina of the T10 vertebra. This part of the laminectomy should create a precise surgical defect throughout the thickness of the bone in a straight vertical line. Maintain the grip with the curved forceps to keep the vertebra stable.\nMake sure that the tip of the drill does not penetrate through the bone and injure the spinal cord. Repeat the same process on the left side of the lamina, keeping the vertebra stable with the curved forceps. Irrigate with warm saline to wash away any remaining bone fragments.\nLift and remove the posterior part of the neural arch (Figure 1F).\n\t\nUse the angled fine tip forceps to grip the spinous process and remove the whole dorsal segment of the laminae separated by the bilateral drilling. Irrigate and swab again if there is any bleeding, to clearly visualize the spinal cord exposed under the laminectomy window (Figure 1E).\n3. Transection\nInduce the spinal cord injury by transection of the exposed cord with a single slice of the blade.\n\t\nUse the narrow, round cutting edged blade to slice the cord at the center of the laminectomy window. Ensure to sweep the lateral recesses of the spinal column to induce a complete transection injury (Figure 1G).\nConfirm completeness of the transection injury using the blunt fine tip forceps and remove any remaining connections at the transection site.\nControl the bleeding if any, before closing the surgical layers.",
    "Use the warm saline to irrigate and clear any bleeding that occurs from the transected cord stumps. Use a cotton swab to apply gentle pressure to achieve hemostasis if needed. Take care not to compress the spinal cord.\n4. Closure and immediate post-operative care\nBring the muscles together and suture in layer.\n\t\nOnce hemostasis is achieved at the transection site, release the curved forceps grip on the T10 vertebrae. Bring the edges of dissected muscles together along the midline to achieve good apposition.\nSuture the muscles in a layer using 5-0 polyglactin 910 absorbable sutures. Make sure that the natural curvature of the spine does not cause any tension at the suture line or open up the sutures, exposing laminectomy site.\nClose subcutaneous tissue and skin.\n\t\nUse 5-0 non-absorbable silk sutures to close the skin incision. Make sure that there is no bleeding, clots or debris remaining under the skin before closure. A final irrigation with warm saline may be necessary at this step.\nStop the anesthesia. Observe the animal for 10–30 min until recovery. The animal should remain on the heating pad for this duration. Provide water gel and hydrated food in the cage.\nFor post-operative care, include buprenorphine (twice daily), enrofloxacin (once daily) for the first two days prophylactically. Additionally, manually empty the bladder at least twice daily, adhering to the animal ethics committee’s guidelines.",
    "NOTE: The animals in this experiment were assessed twice daily for their general health and wellbeing, which included checking for persisting pain (to give additional doses of buprenorphine) or infection (additional enrofloxacin), their nutrition and hydration status (give injectable fluids if dehydrated) and any signs of autotomy (provide wound care if minor autotomy). It is strongly recommended that these aspects of post-operative care, including the euthanasia decisions must be determined with the guidance of the institutional animal ethics committee.\n5. Evaluation of the injury model\nEstablishing the loss of motor function.\n\t\nAssess motor behavior on the injured mice 2, 7, 14, 21 and 28 days after the injury in an open field using the Basso Mouse Scale (BMS) to determine the loss of function9 (Figure 3C–E).\nHistological confirmation of injury\n\t\nHarvest the injured spinal cords with the vertebral columns after euthanasia (done with carbon dioxide in this experiment, as approved by the animal ethics committee).\nFix the tissue by overnight submersion in 4% paraformaldehyde and decalcify the bones by treatment with 20% ethylene diamine tetraacetic acid (EDTA) over 3 weeks, replacing fresh EDTA every 48 h.\nPrepare the decalcified spines for cryo-sectioning and cut them into 30 µm thick sections.\nMount the sections on gelatin-coated glass slides for immuno-staining with anti-GFAP antibodies and Hoechst 33342.\nImage the slides on a fluorescent microscope (Figure 3A) and perform measurements of the injury size using image analysis software (e.g., Nikon analysis software - NIS Elements [Figure 3B]).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}