{
  "id": 5094,
  "origin_website": "Bio",
  "title": "Determination of Intra- and Extracellular Glucose in Mycelium of <em>Fusarium oxysporum</em>",
  "procedures": [
    "F. oxysporum f.sp. lycopersici wild type strain 4287 (race 2) was obtained from J. Tello, Universidad de Almeria, Spain. Δcon7-1 mutant, lacking a transcription factor essential for morphogenesis and virulence, was described previously (Ruiz-Roldan et al., 2015). Strains are stored at -80 °C with 30% glycerol as microconidial suspension. For fresh microconidia production, aliquots of frozen microconidial stocks are inoculated into 100 ml of potato dextrose broth (PDB) and incubated for 3 days at 150 rpm and 28 °C in an orbital incubator. Cultures are then filtered through Monodur nylon filters placed on funnels to separate mycelia (Figure 1A), and centrifuged at 3,020 x g for 5 min to collect microconidia. Finally, pellets containing fresh microconidia are resuspended into 1 ml sterile dH2O and counted using a hemocytometer. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160714/20160714001330_4896.jpgFigure 1. Filtration and mycelia harvesting procedure. A. Filtration of a fungal culture through a Monodur nylon membrane placed on a funnel. B. Subsequent harvesting of mycelia by scraping a nylon membrane using a spatula.Aliquots containing 4 x 108 freshly obtained microconidia are inoculated into 100 ml of SM containing either 0.05 or 2.5% glucose and grown at 170 rpm and 28 °C for 24 h.After harvesting by Monodur filtration, mycelia are washed twice with sterile dH2O, separated from the filter by scraping using a spatula (Figure 1B) and finally lyophilized. Mycelia dry-weight is determined using a precision weighing scale.Note: Normally, the amount of dry mycelia obtained from 100 ml cultures varies between 5 and 10 µg.After dry-weight determination, samples are introduced into 2 ml-Eppendorf tubes containing a 5 mm-diameter glass bead and disrupted by 3 cycles of 30 sec agitation each using a Mini-BeadBeater homogenizer. Samples are then resuspended into 250 μl of 0.25 M Na2CO3 and incubated at 95 °C on a water bath for 4 h.",
    "The supernatant is harvested by centrifugation at 5,000 x g for 3 min. The amount of glucose remaining in culture supernatants from the different strains is also determined.Glucose levels are calculated from glucose standard curves and referred to mycelium dry-weight in each strain. Aliquots (40 μl each) are used for quantification of intracellular glucose levels using the glucose determination kit GAGO (https://www.sigmaaldrich.com/content/dam/sigma-aldrich/docs/Sigma/Bulletin/gago20bul.pdf[href=https://www.sigmaaldrich.com/content/dam/sigma-aldrich/docs/Sigma/Bulletin/gago20bul.pdf]) following these instructions of the manufacturer with some modifications (indicated in underlines).Note: The assay was repeated three times with independent biological samples. Reagent PreparationGlucose Oxidase/Peroxidase Reagent. Store the unopened kit reagent at 2-8 °C. Each capsule contains 500 units of glucose oxidase (Aspergillus niger), 100 purpurogallin units of peroxidase (horseradish) and buffer salts. Dissolve the contents of the capsule in an amber bottle with 39.2 ml of deionized water. The solution is stable up to one month at 2-8 °C and for at least 6 months frozen at -20 °C. Discard if turbidity develops.o-Dianisidine Reagent. Store the unopened kit reagent at 2-8 °C. Minimize exposure to light. The preweighed vial contains 5 mg of o-dianisidine dihydrochloride. Reconstitute the contents of the o-dianisidine vial with 1.0 ml of deionized water. Invert the vial several times to dissolve. Avoid exposing the reagent to light. Solution is stable for 3 months at 2-8 °C.Prepare the Assay Reagent by adding 0.8 ml of the o-Dianisidine Reagent to the amber bottle containing the 39.2 ml of Glucose Oxidase/Peroxidase Reagent. Invert bottle several times to mix. Minimize exposure to light. Solution is stable up to 1 month at 2-8 °C. Discard if turbidity develops or color forms.Glucose Standard Solution. D-Glucose, 1.0 mg/ml in 0.1% benzoic acid. This standard is traceable to a NIST standard and is supplied ready-to-use. It is stable at 2-8 °C for at least six months. Discard if turbidity develops.",
    "Standard curvePrepare low-concentration D-Glucose standard solutions by diluting the 1.0 mg/ml stock solution in dH2O to final concentrations ranging from 0 (reagent blank) to 80 μg/ml.Pipette 40 µl aliquots of diluted D-Glucose standard solutions into a microtiter plate.Start the reaction by adding 80 µl of Assay Reagent to each well and mixing.Incubate exactly 30 min at 37 °C. Stop the reaction by adding 80 µl of 12 N H2SO4 into each well. Mix thoroughly by pipetting several times.Measure the absorbance against thereagent blank at 540 nm.Plot Absorbance at 540 nm (Y-axis) vs. µg of glucose (X-axis) (Figure 2). If the standard curve is not linear, results will be inaccurate. R-values of around 0.99 are normally obtained with this kit.Sample analysisFollow the directions given in Standard Curve, substituting D-Glucose standard solutions for 40 µl fungal experimental samples diluted 250 times. Note: Depending on the sample, it might be necessary to optimize the dilution factor.Calculate the amount of D-glucose in the experimental samples from the standard curve (Figure 2). Multiply the mg glucose determined above by the dilution factor made in sample preparation (x 250).Express mg of glucose in µg and divide it by the amount of dry mycelium in each case expressed in µg."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}