{
  "id": 10392,
  "origin_website": "Jove",
  "title": "A Human 3D Extracellular Matrix-Adipocyte Culture Model for Studying Matrix-Cell Metabolic Crosstalk",
  "procedures": [
    "Adipose tissues are procured from human subjects undergoing elective bariatric surgery under institutional review board approval.\n1. Preadipocyte isolation and culture reagent preparation\nPrepare 2% bovine serum albumin (BSA) in 1x phosphate buffered saline solution (PBS). Filter sterilize, and store at 4 °C.\nPrepare Type II collagenase: 2 mg/mL in 2% BSA in 1x PBS. Prepare immediately before use.\nPrepare Red Blood Cell (RBC) Lysing Solution: 1.5 M NH4Cl, 100 mM NaHCO3, 10 mM disodium EDTA in deionized water (DI/H2O). Store at 4 °C. Prepare 1x RBC Lysing Solution from 10x stock solution in DI/H2O immediately before use.\nPrepare Growth Media: 15% fetal bovine serum (FBS), 1% antibiotic-antimycotic solution (ABAM) in Dulbecco's Modified Eagle Medium:Nutrient Mixture F-12 (DMEM/F12). Filter sterilize, and store at 4 °C.\nPrepare Preadipocyte Freezing Solution: 10% Dimethyl Sulfoxide, 15% FBS in DMEM/F12 media. Filter sterilize, and store at 4 °C.\nPrepare Differentiation Media: 10 mg/L transferrin, 33 µM biotin, 0.5 µM human insulin solution, 17 µM D-pantothenic acid hemicalcium salt, 100 nM dexamethasone, 2 nM 3,3',5-Triiodo-L-thyronine sodium salt (T3), 1 µM ciglitizone, 540 µM 3-Isobutyl-1-methylxanthine (IBMX),1% ABAM in DMEM/F12.Filter sterilize, and store at 4 °C.\n2. ECM reagent preparation\nPrepare Freezing Buffer Solution: 10 mM Tris base, 5 mM EDTA, 1% ABAM, 1% phenylmethylsulfonyl fluoride (PMSF) in DI/H2O. Stir solution to dissolve EDTA. Adjust pH to 8.0 with HCl or NaOH.Store at 4 °C for up to 3 months.\nPrepare Enzymatic Solution #1: 1% ABAM in 0.25% trypsin-EDTA. Store at 4 °C for up to 3 months.\nPrepare Rinsing Buffer Solution: 137 mM NaCl, 2.68 mM KCl, 7 mM Na2HPO4, 1.5 mM KH2PO4, 1% ABAM, 1% PMSF in sterilized DI/H2O. Stir to dissolve salts. Adjust pH to 8.0 with HCl or NaOH. Store at 4 °C for up to 3 months.",
    "Prepare Enzymatic Solution #2: 55 mM Na2HPO4, 17 mM KH2PO4, 4.9 mM MgSO4∙7H2O, 1% ABAM, 1% PMSF in DI/H2O. Store 4 °C for up to 3 months. Stir to dissolve salts. Immediately prior to use, add 80 U/mL lipase from porcine pancreas, type VI-S; 160 U/mL deoxyribonuclease I from bovine pancreas, type II-S; and 100 µg/mL ribonuclease A from bovine pancreas, type III-A.\nPrepare Polar Solvent Extraction Solution: 1% ABAM, 1% PMSF in isopropanol.\n\tCAUTION: Isopropanol is flammable; store in a flammable cabinet at 25 °C and dispose in flammable waste.\nPrepare 70% ethanol, 1% ABAM, 1% PMSF in DI/H2O. Add ABAM and PMSF just prior to use.\n\tCAUTION: Ethanol is flammable; store in a flammable cabinet at 25 °C and dispose in flammable waste.\nPrepare Storage Solution: 1% ABAM, 1% PMSF in 1x PBS. Store at 4 °C for up to 3 months.\n3. Metabolic phenotyping reagent preparation\nGlucose uptake\n\t\nPrepare Serum Starvation Media: DMEM/F12, 1% ABAM. Filter sterilize, and store at 4 °C\nPrepare 200 nM human insulin solution in 1x PBS immediately before use.\nPrepare 200 nM human insulin, 0.1 mM 2-Deoxy-D-glucose, 1 µCi/well Deoxy-D-glucose, 2-[1,2-3H(N)]-, in 1x PBS. Prepare immediately before use.\nLipolysis\n\t\nPrepare Isoproterenol diluted in PBS: 3 mM stock solution. Dilute to working concentration of 3 µM for assay.\nOil Red-O Staining\n\t\nPrepare 4% Formalin in DI/H2O. Store at room temperature.\nPrepare Oil Red-O Working Solution. Dilute Oil Red-O Solution (ORO) with DI/H2O in a 3:2 ratio (ORO:DI/H2O). Prepare immediately before use. Filter through filter paper (Table of Materials).\n4. Adipose tissue procurement",
    "NOTE: Visceral adipose tissue (VAT) is collected from the greater omentum at the beginning of the operation by the surgeon and transported back to the laboratory on ice for immediate processing. Universal precautions should be used when handling all human tissues and caustic reagents, including performing all work in a laminar flow hood, using complete laboratory safety wear, and no recapping of needles.\nAdd 5-10 g of intact VAT to 15-25 mL of Freezing Buffer Solution in a 50 mL conical tube to immerse the tissue sample. Store samples at -80 °C until decellularization, for up to 1 month.\nUse a separate fresh sample of VAT for preadipocyte isolation as described in section 5.\n5. Preadipocyte isolation\nPlace 2 g of intact VAT in 20 mL of the collagenase, type II, solution in a 50 mL conical tube. Then mince thoroughly by inserting sterile scissors into the conical tube and mincing the tissue within the tube. Once fully minced to a fine slurry, incubate the tissue in the collagenase solution on an orbital shaker at 130 rpm and 37 °C for 60 min.\nFilter the resultant digestate through a 100 µm nylon mesh into a fresh 50 mL conical tube by pouring the digestate from one conical tube through a piece of mesh folded over the top of a fresh conical tube. The digestate at this point should be a yellow-orange liquid with moderate viscosity, with small amounts of residual strands of undigested fibrous tissue. The mesh should capture larger pieces of undigested tissue, which are discarded.\nCentrifuge the sample at 270 x g for 10 min. Remove the supernatant and resuspend the cell pellet in 2 mL of 1x RBC Lysing Solution with a pipette.",
    "Incubate for 1 min at 25 °C and then add 10 mL of 15% FBS-DMEM/F12. Centrifuge at 270 x g for 10 min.\nRemove the supernatant and resuspend the cell pellet in 10 mL of 15% FBS-DMEM/F12 with a pipette. Transfer the cell suspension to 100 mm Petri dish with a pipette and incubate at 37 °C and 5% CO2, until cells reach 80-100% confluence, typically 2-6 days. Change the media every 2-3 days.\nDetach and wash cells.\n\t\nRemove media with a pipette and apply 4 mL of 0.25% trypsin-EDTA to adherent cells. Incubate at 37 °C for 10 min, periodically swirling the plate gently to detach the cells.\nAdd 20 mL of 15% FBS-DMEM/F12 and resuspend the detached cells in this media with a pipette. Then transfer to a fresh 50 mL conical tube and centrifuge 270 x g for 10 min.\nRemove the supernatant and discard. Wash the cell pellet once in 1x PBS, and then resuspend the cell pellet in 20 mL of fresh 15% FBS-DMEM/F12 with a pipette. Transfer the cell suspension to a T-150 culture flask.\nCulture cells at 37 °C and 5% CO2. Split and expand cells every 2-3 days as they reach 80-100% confluence by applying 7 mL of 0.25% trypsin-EDTA, expanding from one flask to 8 flasks.\n\tNOTE: This typically requires 3-4 passages, which permits appropriate expansion and retains adipogenic potential and patient- and depot-specific cellular metabolic phenotypes. Passaging preadipocytes in excess of 4-5 passages leads to loss of adipogenic potential.\nDetach cells in 8 flasks with 7 mL of 0.25% trypsin-EDTA per flask as described above, and incubate at 37 °C for 10 min.",
    "Add 8 mL of 15% FBS-DMEM/F12 per flask and resuspend the detached cells with a pipette. Transfer the entire cell suspension divided evenly into three 50 mL conical tubes and centrifuge at 270 x g for 10 min.\nResuspend the resultant cell pellets in 5 mL of 15% FBS-DMEM/F12 in a 15 mL conical tube and count cells using cell counter and Trypan blue.\nCentrifuge the cell suspension at 270 x g for 10 min. Then resuspend the cell pellet in Preadipocyte Freezing Solution to a final cell concentration of 1 x 106/mL, and aliquot 1 mL of cell suspension per 1.5 mL cryovial tube.\nStore cells in cryovials for 1 days at -80 °C. Then transfer cryovials to liquid nitrogen for long-term storage for 3-6 months.\nWhen ready for use, thaw one cryovial in a 37 °C water bath for 3-5 min. Resuspend the cells in 20 mL of 15% FBS-DMEM/F12, and centrifuge at 270 x g for 10 min.\nResuspend the cell pellet in 20 mL of 15% FBS-DMEM/F12, pipette into a single T-150 flask, and then grow to 80% confluence over 2-3 days at 37 °C and 5% CO2.\nDetach cells with 7 mL of 0.25% trypsin-EDTA per flask as described above in step 5.6. Resuspend at 3 million cells per mL (i.e., 6 x 104 cells per 20 µL) in 15% FBS-DMEM/F12, and use as outlined below (section 7, step 7.4).\n6. Adipose tissue ECM preparation\nDay 1: Freeze-thaw and enzymatic digestion #1",
    "Freeze-thaw previously frozen (step 4.2) VAT samples stored in Freezing Buffer Solution in 50 mL conical tubes from -80 °C to 37 °C in a preheated water bath, incubating 20 min with gentle periodic manual agitation. Once thawed, transfer back to -80 °C and incubate 20 min. Repeat freeze-thaw 3x, ending by thawing samples in a 37 °C water bath.\nUsing sterile forceps, transfer the VAT samples to fresh 50 mL conical tubes containing 15-25 mL of Enzymatic Solution #1, ensuring that the VAT samples are fully immersed. Then incubate overnight on an orbital shaker (130 rpm, 37 °C).\nDay 2: Enzymatic digestion #2\n\t\nWash samples 3x with 15-25 mL of Rinsing Buffer Solution on an orbital shaker (130 rpm, 37 °C, 20 min each wash). Pour off Rinsing Buffer Solution after each wash.\nTransfer samples to fresh 50 mL conical tubes containing 15-25 mL of Enzymatic Solution #2 and incubate on an orbital shaker (130 rpm, 37 °C, overnight).\nDay 3: Delipidation\n\t\nWash samples 3x with 15-25 mL of Rinsing Buffer Solution on an orbital shaker (130 rpm, 37 °C, 20 min each wash). Pour off Rinsing Buffer Solution after each wash.\nTransfer samples to fresh 50 mL conical tubes containing 15-25 mL of Polar Solvent Extraction Solution and incubate on an orbital shaker (130 rpm, 25 °C, overnight). After this step, a majority of the lipid should be removed, and the samples should be white or translucent in color.\n\t\tCAUTION: The polar solvent extraction solution is flammable and should be stored and used at 25 °C.\nDay 4: Wash and storage\n\t\nTransfer samples to fresh 50 mL conical tubes containing 15-25 mL of Rinsing Buffer Solution. Wash samples 3x on an orbital shaker (130 rpm, 37 °C, 20 min each wash).",
    "Wash samples 3x with 15-25 mL of 70% ethanol on an orbital shaker (130 rpm, 37 °C, 20 min each wash) pouring off the 70% ethanol solution after each wash.\nWash samples once with Storage Solution on an orbital shaker (130 rpm, 37 °C, 20 min each wash).\nUsing sterile forceps, transfer samples to fresh 50 mL conical tubes containing 15-25 mL of Storage Solution. Ensure enough Storage Solution is used to fully immerse samples. Store at 4 °C for up to 1 month.\n7. ECM-adipocyte preparation\nTransfer stored ECM fragments to individual wells of 24-well plate using sterile forceps. Add as many ECM fragments into as many wells as required for the planned downstream assay (e.g., glucose uptake or lipolysis, see below), including duplicates or triplicates. Wash with 500 µL of 70% ethanol 3x on an orbital shaker (130 rpm, 37 °C, 20 min each wash).\nRehydrate ECM by washing 3x in sterile 1x PBS on an orbital shaker (130 rpm, 37 °C, 20 min each wash).\nUsing sterile scissors, cut and weigh ECM into 100 mg fragments. Using sterile forceps, place one 100 mg fragment in each well of a 24-well plate. Incubate at 25 °C for 15 min to allow excess PBS to extrude from fragments. Carefully remove any excess PBS with a pipette.\nSeed each 100 mg ECM fragment with 20 µL of preadipocyte cell suspension (3 million cells per mL, 6 x 104 cells per 20 µL, in 15% FBS-DMEM/F12, from step 5.10). Pipette the cells directly into the ECM by placing the tip of pipette in the ECM and gently expelling the cell suspension into center of the matrix, taking care that the cell suspension does not overflow and end up on the bottom of the well.",
    "If the cell suspension is overflowing from the ECM where the pipette tip has been placed, remove the tip from that location and insert somewhere else in the ECM. Incubate seeded ECM for 40 min at 37 °C.\n\t\tNOTE: For RNA extraction for qrtPCR, seed each 500 mg ECM fragments with 3 x 105 cells in 100 µL (3 million cells per mL, i.e., 3 x 105 cells per 100 µL, in 15% FBS-DMEM/F12).\nFill each well of the 24-well plate with 500 µL of growth media to cover the seeded ECM fragments. Culture at 37 °C and 5% CO2 for 72 h.\nAfter 72 h, carefully aspirate 15% FBS-DMEM/F12, tilting the plate slightly to allow media to pool below fragment, and placing the pipette tip just adjacent to the ECM fragment without disturbing it. After aspirating, add 500 µL of Differentiation Media, changing media every 2-3 days using a similar technique, for a total culture period of 14 days.\n\t\nCheck for differentiation using light microscopy: cells will accumulate lipids, turn brown-yellow in color and more spherical in shape.\n\t\tNOTE: Seeded matrices can be used for metabolic testing (e.g., glucose uptake assay, lipolysis assay, ORO), histology or immunohistochemistry (IHC), or standard tissue imaging. For fixed tissue ORO staining and imaging, freeze ECM-adipocyte samples in liquid nitrogen.\n8. Metabolic phenotyping\nScanning electron microscopy\n\t\nFix samples in 2.5% glutaraldehyde in Sorensen's phosphate buffer at 25 °C for 12 h. Postfix in 1% osmium tetroxide in Sorensen's phosphate buffer at 4 °C for 1 h.\nSerially dehydrate samples in ethanol. Wash in hexamethyldisalizane, and air-dry. Then mount on a scanning electron microscopy stub with colloidal graphite. Dry, and sputter-coat with gold.\nCapture images with a scanning electron microscope.\nOil Red-O Staining\n\t\nLive Tissue: Oil Red-O Solution",
    "Carefully aspirate media from wells with a pipette. Then wash samples once with 500 µL of 1x PBS per well.\nFix samples with 200 µL of 4% formalin in sterile deionized H2O at 25 °C for 15 min. Aspirate formalin with a pipette, wash samples two times with 1x PBS (500 µL each wash).\nAdd 200 µL of 60% isopropanol samples at 25 °C for 5 min. Aspirate 60% isopropanol with a pipette.\nStain samples with Oil Red-O working solution at 25 °C for 5 min. Aspirate Oil Red-O with a pipette and then wash samples 3x with 1x PBS (500 µL each wash). Then image with an optical microscope.\nFixed Tissue: Oil Red-O Stain Kit\n\t\t\nFlash-freeze ECM-adipocyte samples in optimal cutting temperature (OCT) compound and section (5 µm) on a cryostat.\nPlace the slide in 85% propylene glycol in DI/H2O for 2 min. Place the slide in ORO stain at 60 °C for 6 min. Place steh lide in 85% propylene glycol in DI/H2O for 1 min. Rinse the slide twice with DI/H2O.\nPlace the slide in Modified Mayer's Hematoxylin from Oil Red-O staining kit for 1 min. Rinse the slide twice with tap water. Rinse slide twice with DI/H2O.\nMount the coverslip using aqueous mounting medium and image on a microscope.\nRNA extraction from ECM for qrtPCR\n\t\tNOTE: To maximize RNA yield, use 500 mg ECM fragments seeded with 3 x 105 preadipocytes in 100 µL and differentiate as above in 6-well plates in 3 mL of Differentiation media per well.\n\t\t\nOnce differentiated, transfer each individual ECM-adipocyte sample into a 50 mL conical tube on ice using sterile forceps.\nWash empty well with 500 µL of Buffer RLT. Add Buffer RLT to 50 mL conical tube with matching ECM-adipocyte sample.",
    "Using sterile scissors, finely mince each ECM-adipocyte sample within the 50 mL conical tube, while holding the tube on ice, inserting the scissors into the conical tube to mince the tissue.\nCompletely freeze and thaw the conical tubes from -80 °C to 37 °C 3x.\nCentrifuge conical tubes at 500 x g and 4 °C for 10 min.\nCarefully remove the supernatant with a pipette and use for RNA extraction with a Fibrous Tissue RNA extraction Kit (Table of Materials).\nGlucose uptake assay\n\t\nDifferentiate 6 x 104 preadipocytes in 100 mg ECM fragments in 0.5 mL of differentiation medium in 24-well plates as described above (section 5).\nAfter 14 days of differentiation, remove the medium and wash ECM-adipocytes once with 1x PBS. Add 0.5 mL/well Serum Starvation Medium and culture at 37 °C and 5% CO2 for 12 h.\nRemove medium and wash cells twice with 1x PBS. Add 0.5 mL/well 2% BSA in PBS and culture at 37 °C and 5% CO2 for 2 h.\nWash cells once with 1x PBS, add 0.5 mL/well 1x PBS with or without 200 nM insulin, and incubate at 37 °C for 40 min.\nAspirate 1x PBS, add 0.5 mL/well 1X PBS with 0.1 mM 2-deoxy-D-glucose, 2 µCi/mL deoxy-D-glucose, 2- [1,2-3H(N)], with or without 200 nM insulin, and incubate at 37 °C and 5% CO2 for 40 min. Use standard precautions for handling and disposal of all radioactive reagents and waste, as mandated by local institutional regulatory statutes.\nRemove medium with a pipette and wash cells 3x with 1x PBS. Add 420 µL of 1% SDS solution in DI/H2O, and lyse cells with vigorous pipetting. Incubate 25 °C for 10 min.",
    "Collect 5 µL from each well for Bradford protein assay. Transfer 400 µL of remaining cell lysate into 2 mL of scintillation fluid in a scintillation vial. Count 3H-2DG activity on scintillation counter. Analyze data as counts per minute normalized to protein, mg/mL.\nLipolysis assay\n\t\nDifferentiate 6 x 104 preadipocytes in 100 mg ECM fragments in 0.5 mL of human differentiation medium in 24-well plates as described above (section 5).\nAfter 14 days of differentiation, remove medium and wash cells twice with warm 1x PBS. Add 0.5 mL of serum starvation medium (without insulin) with or without 3 µM isoproterenol, and culture adipocytes at 37 °C and 5% CO2 for 72 h.\nCollect culture supernatants, which may be stored at -80 °C until ready for assay. Collect the ECM in microcentrifuge tubes for DNA quantitation for data normalization.\nPipet 2 µL of each supernatant into a 96-well microplate. Reserve wells for blanks (distilled H2O) and glycerol standard solution provided in Triglyceride Determination Kit.\nAdd 270 µL of free glycerol reagent from Triglyceride Determination Kit to each well, pipette to mix. Incubate plate at 37 °C for 5 min.\nMeasure absorbance at 540 nm on a microplate spectrophotometer.\nCalculate the concentration of glycerol and normalize with DNA from ECM:\nimgsrc://cloudfront.jove.com/files/ftp_upload/60486/60486eq1.jpgSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}