{
  "id": 3383,
  "origin_website": "Cell",
  "title": "Quantification of total and phosphorylated STAT3 by calibrated western blotting",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDay 1: Cell culture\nTiming: 24 h\n      In this step a defined number of cells is seeded on three cell culture\n      dishes. Cells on one dish (control) will be used to determine the exact\n      number of cells at the time-point of cell lysis. The cells on the other\n      two dishes will be used to quantify STAT3 (unstimulated) and (p)Y STAT3\n      (stimulated), respectively (Figure 1[href=https://www.wicell.org#fig1]).\n    \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2965-Fig1.jpg\n          Figure 1. Schematic overview of the experimental set up to quantify\n          STAT3 and (p)Y STAT3\n        \n          The figure was generated using bioRender (https://biorender.com[href=https://biorender.com]).\n        \n        Seed 106 cells/cell culture dish on three 10 cm cell culture\n        dishes in standard medium and incubate at 37°C, 10% CO2 in a\n        humidified atmosphere for 24 h.\n      \nCritical: Always use a certified\n      sterile hood and sterilised equipment and solutions, and follow aseptic\n      technique when working with cells.\n    \nCritical: Depending on the strength of\n      expression of the protein of interest, the efficiency of the IP, and the\n      linear range of the calibrator proteins, the number of cells analyzed\n      needs to be adjusted in preliminary experiments. The amount of the\n      precipitated proteins of interest should always be within the linear range\n      of the calibration curve. Avoid any extrapolation as the linear range of\n      quantitative western blot is restricted.\n    \nNote: For HEK293 cells standard medium\n      refers to DMEM plus 10% FCS plus Pen/Strep. For other cell types adjust\n      medium and supplements.\n    \nDay 2: Stimulation, cell lysis and immunoprecipitation\nTiming: 24 h\nTiming: 40 min (for step 7)\nTiming: 20 h\n(for steps 8 and 9)\n      Next, the cells will be starved and subsequently cells on dish 1) will be\n      counted to determine the cell number, cells on dish 2) will be left\n      untreated and cells on dish 3) will be stimulated with cytokines (e.g.,",
    "IL-6) to induce phosphorylation of STAT3. The cells on dish 2) and dish 3)\n      are then lysed, and target proteins of interest will be isolated from the\n      cell lysates by IP.\n    \n        Remove cell culture medium from all three cell culture dishes by vacuum\n        aspiration and gently wash cells once with sterile PBS.\n      \n        Replace PBS on each dish with 4 mL FCS-free cell culture medium warmed\n        up to 37°C and starve cells at 37°C, 10% CO2 in a humidified\n        atmosphere for 2 h.\n      \nNote: Since washing and starving the cells\n      might affect cell number and/or receptor expression, and thus the strength\n      of cytokine-induced STAT3 phosphorylation, it is necessary to treat the\n      cells on all three cell culture dishes identically.\n    \nNote: Cells are starved to reduce basal\n      signaling induced by FCS in the medium. Starvation time needs to be\n      adjusted for your cell type of choice to find the best trade-off between\n      reduced basal STAT3 activation and reduced responsiveness to stimulation\n      caused by e.g., receptor internalization or cell stress.\n    \n        Determination of number of cells.\n        \n            Remove starvation medium from the first cell culture dish (Figure 1[href=https://www.wicell.org#fig1], control) by vacuum aspiration.\n          \nAdd 1 mL trypsin to the cells on this dish.\nIncubate cells at 37°C for 5 min.\nStop the reaction with 5 mL medium + FCS.\nResuspend the cells by pipetting up and down.\n            Count the number of cells in the suspension e.g., with a Neubauer\n            chamber.\n          \nDiscard cells after counting.\nNote: Make sure that all cells on the cell\n      culture dish are detached, so that the determined cell number/dish is\n      correct.\n    \nNote: Make sure to log the number of\n      cells/dish and not the number of cells/mL.\n    \n        Stimulate cells on one of the two remaining cell culture dishes with\n        cytokine (e.g., 20 ng/mL IL-6 + 200 ng/mL sIL-6R) by directly adding the",
    "cytokine solution into the serum-free medium on the cell culture dish to\n        induce STAT3 phosphorylation (Figure 1[href=https://www.wicell.org#fig1], stimulated).\n        Keep the cells on the second cell culture dish unstimulated (Figure 1[href=https://www.wicell.org#fig1], unstimulated).\n      \n        Incubate cells at 37°C, 10% CO2 in a humidified atmosphere\n        for 15 min.\n      \nNote: Stimulation of cells expressing\n      membrane-bound IL-6 receptor (IL-6R) with ≥20 ng/mL IL-6 for 15 min\n      induces strong phosphorylation of STAT3. However, most cells, e.g., HEK293\n      cells, do not express membrane-bound IL-6R. For cells that do not express\n      membrane-bound IL-6R, add 200 ng/mL sIL-6R to 20 ng/mL IL-6.2[href=https://www.wicell.org#bib2]\n      Pre-mix IL-6 and sIL-6R before stimulation to allow formation of an\n      IL-6:sIL-6R complex.\n    \nNote: It is not necessary to quantify the\n      amount of (p)Y STAT3 for each time point and each dose of IL-6/sIL-6R of\n      interest, as this is very expensive and time-consuming. Alternatively, you\n      can quantify the amount of (p)Y STAT3 at one dose and time of stimulation\n      (reference sample). With this knowledge you can convert semi-quantitative\n      STAT3 phosphorylation kinetics from relative to absolute values by\n      following the rule of proportion.1[href=https://www.wicell.org#bib1]\n        Cell lysis.\n        \n            Remove the starvation medium from the two remaining cell culture\n            dishes containing stimulated and unstimulated cells (Figure 1[href=https://www.wicell.org#fig1]) by vacuum aspiration.\n          \nGently wash cells with ice-cold PBS.\nPlace cell culture dishes on ice.\n            Add 300 μL RIPA lysis buffer (supplemented with phosphatase and\n            protease inhibitors) per dish.\n          \n            Detach cells from the cell culture dish surface with a rubber\n            scraper.\n          \nTransfer cell suspensions to 1.5 mL reaction tubes.\n            Incubate lysates on ice for 20 min. Vortex lysates every 10 min\n            rigorously. Pre-cool the table top centrifuge during incubation to\n            4°C.\n          \n            Remove cell debris by centrifugation at 4°C, 13.800 × g for 15 min\n            in a table top centrifuge.\n          \nTransfer the supernatants to fresh 1.5 mL reaction tubes.\nDiscard the pellets.",
    "Note: Keep all buffers and samples on ice\n      to avoid protein degradation and dephosphorylation.\n    \nNote: If the cells are detaching very easy\n      from the cell culture dish do not wash them with PBS before addition of\n      RIPA lysis buffer as the number of cells on the cell culture dish could be\n      reduced.\n    \n      A certain unknown percentage of the proteins of interest will not be\n      isolated during the following IP and will thus reduce the amount of\n      quantified protein. To correct for this, the Pre-IP samples, i.e., input\n      samples, are essential to determine the efficiency of the IPs as described\n      in the\n      quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis]\n      section.\n    \n        Preparation of Pre-IP samples.\n        \n            Transfer 15 μL of the lysates from unstimulated and stimulated\n            cells, respectively, into fresh 1.5 mL reaction tubes.\n          \nAdd 5 μL 4× Laemmli buffer to each lysate.\nDenature the Pre-IP samples for 5 min at 95°C.\n            Store the samples at 20°C–22°C until the next day. They are now\n            ready for SDS-PAGE.\n          \nAlternatives: You can also bypass\n      the determination of IP efficiency in some cases. To do so, you spike\n      known increasing amounts of calibrator protein into the samples before IP.\n      In this case, the efficiencies of the IP of the protein of interest and of\n      the IP of the calibrator protein are identical and no correction for\n      efficiency of IP needs to be done. Additionally, protein of interest and\n      spiked calibrator protein are detected within the same lane of the western\n      blot, which reduces the influence of background signals on the\n      quantification. However, this approach is only possible if the antibody\n      used for IP binds both protein of interest and calibrator protein. This is\n      not the case when (p)Y STAT3 is analyzed and an unphosphorylated STAT3\n      calibrator protein is used. In addition, you must be able to distinguish",
    "your protein of interest and the calibrator protein on the basis of\n      different protein masses and the associated different mobility in\n      SDS-PAGE.\n    \n        IP of proteins of interest.\n        \n            Add 1 μg of anti-STAT3 and anti-(p)Y STAT3 antibody to the lysates\n            of unstimulated and stimulated cells, respectively.\n          \n            Incubate the lysates for 16–20 h at 4°C on an overhead shaker.\n          \nCritical: Antibodies with very high\n      affinity to their epitopes should be chosen to precipitate proteins of\n      interest. These antibodies should almost completely precipitate the\n      protein of interest from the lysate. With the antibodies listed in the\n      key resources table[href=https://www.wicell.org#key-resources-table] we achieve\n      efficiencies above 90% for IPs of STAT3 and (p)Y STAT3.\n    \nDay 3: SDS-PAGE and western blot\nTiming: 28 h\nTiming: 4.5 h (for step 10)\n    \nTiming: 1 h (for step 11)\n    \nTiming: 30 min\n(for step 12)\nTiming: 15 min (for step 13)\n    \nTiming: 20 min (for step 14)\n    \nTiming: 1.5 h (for step 15)\nTiming: 2 h (for step 16)\n    \nTiming: 16 h (for step 17)\n    \n      On this day, IPs are completed. Then, the precipitated proteins are\n      separated by SDS-PAGE along with a serial dilution of the calibrator\n      protein. Finally, the proteins are transferred to a nitrocellulose\n      membrane and stained with specific antibodies that bind with the same\n      affinity to the calibrator protein and the protein of interest. In\n      addition, the IP efficiencies are determined.\n    \n        Incubation of lysates with Protein G Dynabeads.\n        \n            Washing of Protein G Dynabeads.\n            \n                Spin down and vortex Protein G Dynabeads to resuspend them in\n                the storage buffer into a homogeneous bead slurry.\n              \n                Transfer 10 μL of Protein G Dynabeads/IP into a fresh 1.5 mL\n                reaction tube.\n              \nAdd 1 mL of ice-cold RIPA wash buffer and vortex for 5 s.\n                Spin down Protein G Dynabeads to ensure that no beads remain on",
    "the inner lid of the reaction tube.\n              \n                Isolate the Protein G Dynabeads by placing the reaction tube on\n                a magnetic rack until all beads are bound to the magnet (app. 15\n                s).\n              \n                Carefully remove the supernatant by gentle vacuum aspiration\n                with the tube still on the magnetic rack.\n              \n                Resuspend the Protein G Dynabeads in 10 μL RIPA wash buffer/IP.\n              \n            Add 10 μL of the Protein G Dynabeads to the lysates of unstimulated\n            and stimulated cells, respectively. Make sure no beads remain on the\n            wall of the tube.\n          \nIncubate the lysates at 4°C on an overhead shaker for 4 h.\nNote: Use a 10 μL pipette tip placed on\n      the end of the vacuum aspirator to carefully remove all buffer from the\n      beads without sucking up the beads. Alternatively, you can remove the\n      supernatant with a pipette. Make sure that you do not touch the beads\n      bound to the magnet with large pipette tips.\n    \nNote: During the 4 h incubation time in\n      step 10 prepare SDS gels (step 11) and dilute calibrator proteins (step\n      12).\n    \nNote: Dynabeads are coupled to either\n      Protein A or Protein G. The choice of Protein A or Protein G depends on\n      the host and isotype of the antibody used for IP. Protein G generally\n      binds to mouse and rat IgGs with higher affinity than Protein A, while\n      Protein A binds to rabbit IgGs with higher affinity than Protein G.\n      Consult the bead manufacturer to determine which beads are more suitable\n      to isolate your IP antibody.\n    \nNote: Reducing agents and chelators such\n      as DTT and EDTA might reduce the binding capacity of the beads. We,\n      however, even observe high IP efficiencies when cells are lysed in RIPA\n      lysis buffer containing 1 mM EDTA.\n    \nAlternatives: Isolation of\n      precipitates with Protein A/G agarose or sepharose is also possible. Usage",
    "of magnetic beads has the advantage that precipitates are nicely visible\n      and no centrifugation steps are necessary.\n    \nCasting of SDS gels.\n      Prepare two discontinuous SDS polyacrylamide gels with 10% separating gel\n      and 4% stacking gel and a minimum of 10 sample pockets.\n    \nNote: Many types of SDS-PAGE chambers are\n      available, so the exact procedure is not described here.\n    \nNote: It is not necessary to use\n      pre-casted commercial gels for quantitative western blots. To obtain good\n      results of SDS-PAGE and western blot, however, always freshly prepare SDS\n      gels right before use.\n    \nNote: The acrylamide concentration of the\n      separation gel must be chosen according to the molecular weight of the\n      proteins of interest and the calibrator proteins. STAT3 has a molecular\n      weight of 86 kDa and the STAT3 calibrator protein used here of 35 kDa.\n    \n        Preparation of the dilution series of the calibrator protein.\n        \n            Dilute 0.1, 0.5, 1, 2, and 3 pmol of the calibrator protein in 15 μL\n            RIPA lysis buffer, respectively.\n          \nAdd 5 μL 4× Laemmli buffer to each dilution.\nDenature the samples for 5 min at 95°C.\n            Store the samples at 20°C–22°C. They are now ready for SDS-PAGE.\n          \nNote: We describe calibrator proteins\n      consisting of a fragment of STAT3. Thus, it is necessary to calculate the\n      number of calibrator proteins in pmol instead of the mass of the\n      calibrator proteins.\n    \nNote: Recombinant calibrator proteins can\n      be either bought commercially or expressed at site, e.g., in\n      E.coli. For proper quantification, it is important that 1) the\n      epitope of the detection antibody is present in both the calibrator\n      protein and the protein of interest, 2) the molecular weight of the\n      standard protein is known, and 3) the concentration of the calibrator\n      protein is given.\n    \n        Preparation of Post-IP samples.\n        \n            Place the lysates - now containing complexes of protein of interest,",
    "IP antibody and Protein G Dynabeads - on a magnetic rack until all\n            beads are bound to the magnet (app. 15 s).\n          \n            Transfer 15 μL lysate from the reaction tubes containing lysates\n            from unstimulated or stimulated cells, respectively, into fresh\n            1.5 mL reaction tubes.\n          \nAdd 5 μL 4× Laemmli buffer to each lysate.\nDenature the Post-IP samples for 5 min at 95°C.\nStore samples at 20°C–22°C. They are now ready for SDS-PAGE.\nNote: This control is necessary to\n      determine the efficiency of IP. A certain unknown percentage of the\n      proteins of interest will not be isolated in the IP and will thus reduce\n      the amount of quantified protein. The Post-IP sample contains the\n      non-isolated protein of interest and is thus essential to determine the IP\n      efficiency as described in the\n      quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis]\n      section.\n    \n        Isolation of precipitated proteins.\n        \n            Leave the remaining lysates - containing complexes of protein of\n            interest, IP antibody and Protein G Dynabeads - on a magnetic rack.\n          \n            Carefully remove the supernatant by gentle vacuum aspiration with\n            the tube still on the magnetic rack.\n          \n            Wash the Protein G Dynabeads three times with 1 mL ice-cold RIPA\n            wash buffer. Do not vortex the lysates at this point, as this would\n            destroy the immune complexes, but slowly pipette the sample up and\n            down several times. Make sure to also remove RIPA wash buffer from\n            the inner side of the lid.\n          \n            After removing the RIPA wash buffer, wait two additional minutes\n            after the last wash step to remove any remaining RIPA wash buffer\n            that accumulates at the bottom of the reaction tube. Otherwise, the\n            volume of the IP will be too large to load it onto the SDS-PAGE.\n          \n            Remove the reaction tubes from the magnetic rack and resuspend the",
    "Protein G Dynabeads in 15 μL 2× Laemmli buffer. Make sure no beads\n            remain on the wall of the tube.\n          \nDenature the precipitated proteins for 5 min at 95°C.\n            Store samples at 20°C–22°C. They are now ready for SDS-PAGE.\n            \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2965-Fig2.jpg\n                  Figure 2. Quantification of STAT3 and p(Y) STAT3 by calibrated\n                  western blot\n                \n                  (A) HEK293 cells stably expressing membrane-bound IL-6\n                  receptor were either left untreated or stimulated with\n                  20 ng/mL IL-6 for 15 min. Subsequently, cells were lysed and\n                  STAT3 and (p)Y STAT3 were precipitated using specific\n                  antibodies against STAT3 and (p)Y STAT3, respectively.\n                  Precipitates together with recombinant STAT3 calibrator\n                  proteins were analyzed by western blot using a specific\n                  antibody against STAT3.\n                \n                  (B) Before (Pre) and after (Post) IP aliquots of the lysates\n                  were taken and analyzed by western blot using specific\n                  antibodies against STAT3, (p)Y STAT3, and HSC70. HSC70 serves\n                  as loading control. Figure 2[href=https://www.wicell.org#fig2] is modified\n                  from1[href=https://www.wicell.org#bib1] with permission of Royal\n                  Society of Chemistry.\n                \nNote: Quantification results are best if\n      precipitates are not stored at this point but directly loaded onto the\n      SDS-PAGE.\n    \n        SDS-PAGE.\n        \n            Load precipitated STAT3 and precipitated (p)Y STAT3 together with\n            the dilutions of the calibrator protein onto one SDS gel. This gel\n            is from now on called quantification gel (Figure 2[href=https://www.wicell.org#fig2]A).\n            \nNote: Randomized loading of the\n              samples disrupts lane correlation i.e., the influence of\n              experimental artefacts on adjacent samples.\n            \nNote: Keep the reaction tubes with\n              the precipitated proteins in the magnetic rack while loading the\n              samples to avoid loading the magnetic beads onto the SDS gel.\n            \nNote: Sometimes the lanes that\n              include precipitated proteins widen during the SDS-PAGE. To avoid\n              affecting other samples, load 10 μL of 2× Laemmli buffer in the\n              lanes next to the lanes containing the precipitated proteins.\n            \n            Load Pre- and Post-IP samples for STAT3 and (p)Y STAT3 on the second",
    "gel. Separate the pairs of STAT3 and (p)Y STAT3 samples with a\n            marker. This gel is from now on called efficiency gel (Figure 2[href=https://www.wicell.org#fig2]B).\n            \nNote: The marker between the STAT3\n              and phosphorylated STAT3 Pre- and Post-IP pairs, respectively, is\n              necessary as you will cut this membrane in two parts after western\n              blot.\n            \nRun the SDS-PAGE.\n        Western blot and blocking of membrane.\n        \n            Blot the two SDS gels onto nitrocellulose membranes following an\n            established western blot protocol.\n            \nNote: Any established western blot\n              protocol can be used here.\n            \nNote: For detection of proteins\n              with fluorophore-coupled secondary antibodies nitrocellulose\n              membrane is preferred against PVDF membrane as it results in less\n              background staining.\n            \n            Block free binding sides on nitrocellulose membranes with 10% BSA at\n            20°C–22°C for 1 h.\n            \nNote: If you observe high\n              background when detecting the membranes, you can also use\n              commercially available blocking reagents. Avoid using milk powder\n              as blocking reagent when detecting phosphorylated proteins.\n            \n        Staining of proteins of interest and calibrator proteins with specific\n        antibodies.\n        \n            Cut the membrane that contains the Pre-IP and Post-IP samples\n            (efficiency gel) vertically along the marker in two parts.\n            \nNote: To cut the membrane,\n              carefully transfer it to a clean glass plate without touching the\n              membrane with your fingers. Use a clean scalpel to cut and avoid\n              drying the membrane.\n            \n            Incubate the three membrane parts with primary antibodies for\n            16–20 h at 4°C on an orbital shaker.\n            \n                Quantification membrane: anti-STAT3 antibody (1:1,000 in TBS-N).\n              \n                STAT3 IP efficiency membrane: anti-STAT3 and anti-HSC70\n                antibodies (each 1:1,000 in TBS-N).\n              \n                (p)Y STAT3 IP efficiency membrane: anti-(p)Y STAT3 and\n                anti-HSC70 antibodies (each 1:1,000 in TBS-N).\n                \nCritical: The antibody\n                  used to stain proteins on the quantification membrane detects\n                  STAT3, (p)Y STAT3 and the calibrator protein with the same\n                  affinity. If you adjust this protocol to another protein of",
    "interest, choose a detection antibody that detects an epitope\n                  that is present on all three variants of your protein of\n                  interest and that is not changed by posttranslational\n                  modification of the protein of interest upon stimulation with\n                  cytokines.\n                \nCritical: If you buy sets\n                  of GST-tagged recombinant proteins and (polyclonal) antibodies\n                  for detection, make sure to test whether the detection\n                  antibody (also) detects GST by staining pure GST or any other\n                  GST-tagged protein with this antibody. In case the antibody\n                  detects GST, you must replace the detection antibody.\n                \nNote: Staining of HSC70 on the\n                  two IP efficiency membranes serves as loading control. You can\n                  also stain any other housekeeping protein, that is not\n                  affected by stimulation with the respective cytokine (Step 5)\n                  here.\n                \nNote: To avoid stripping\n                  artefacts you can mix the anti-STAT3 or anti-(p)Y STAT3\n                  antibodies with the anti-HSC70 antibodies as the stained\n                  proteins differ in size. To stain two proteins of similar size\n                  together you have to use secondary antibodies coupled to\n                  different fluorophores.\n                \nDay 4: Detection of the stained proteins\nTiming: 3 h\n      On this day the membranes will be incubated with secondary antibodies to\n      allow detection of the stained proteins. Finally, results will be\n      quantified and absolute numbers of STAT3 and (p)Y STAT3 will be\n      calculated.\n    \n        Detection.\n        \n            Wash the membranes three times in TBS-N at 20°C–22°C on an orbital\n            shaker for 10 min.\n          \n            Incubate the three membrane parts with fluorophore-coupled secondary\n            antibodies at 20°C–22°C on an orbital shaker in the dark for 30 min.\n            \n                Quantification membrane: anti-mouse antibody (1:10,000 in\n                TBS-N).\n              \n                STAT3 IP efficiency membrane: anti-mouse antibody (1:10,000 in\n                TBS-N).\n              \n                (p)Y STAT3 IP efficiency membrane: anti-mouse and anti-rabbit\n                antibodies (1:10,000 in TBS-N).\n                \nCritical:\n                  Fluorophore-coupled secondary antibodies are light-sensitive.\n                  Thus, membranes should be incubated e.g., in dark boxes with\n                  lids.\n                \nAlternatives:\n                  Detection of western blots with horseradish peroxidase",
    "(HRP)-coupled secondary antibodies is possible. However, the\n                  linear range of enzymatic detection methods is smaller than\n                  that of fluorescence-based detection methods. In both cases\n                  you must titrate the calibration curve and the number of cells\n                  analyzed in preliminary experiments, to guarantee that the\n                  standard curve is linear and samples are in the range of the\n                  standard curve.\n                \n            Wash the membranes three times in TBS-N at 20°C–22°C on an orbital\n            shaker in the dark for 10 min.\n          \n            Detect fluorescence using a fluorescence scanner.\n            \nCritical: Make sure to work in\n              the linear range of the fluorescence scanner and avoid saturated\n              signals and thus overexposure. In case of saturation of the\n              fluorescence intensity reduce the detector gain. If you are using\n              HRP-coupled secondary antibodies, reduce the exposure time when\n              signals are saturated.\n            \n            Calculate the amount of STAT3 and (p)Y STAT3 as described in the\n            quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis]\n            section."
  ],
  "subjectAreas": [
    "Signal Transduction",
    "Protein Biochemistry",
    "Antibody"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}