{
  "id": 13013,
  "origin_website": "Jove",
  "title": "Gut Isolation from Zebrafish Larvae for Single-cell RNA Sequencing",
  "procedures": [
    "All zebrafish husbandry and experiments were conducted according to the institutional guidelines of the Erasmus MC and Animal welfare legislation. The use of zebrafish larvae at 5 days post fertilization falls under the category of experiments that do not require formal ethical approval, as outlined by the Dutch regulations.\n1. Obtaining 5 days post fertilization (dpf) wildtype and tg(phox2bb:GFP) larvae\nSet up breeding of wildtype zebrafish and collect 50 eggs in HEPES-buffered E3 medium (hereafter referred to as E3) in a 15 cm Petri dish. Use these fish as a negative control for fluorescence-activated cell sorting (FACs).\nSet up breeding of tg(phox2bb:GFP) zebrafish and collect approximately 300 eggs in E3 in a 15 cm Petri dish.\nKeep fertilized eggs in E3 (maximum 50 eggs/dish) on a 14 h/10 h light/dark cycle, in an incubator at 28.5 °C.\nAt 1 dpf, remove unfertilized eggs and let the fertilized ones develop to 5 dpf.\nSelect tg(phox2bb:GFP) larvae at 1 dpf.\n2. Wildtype whole larvae dissociation\nAnesthetize 5 dpf larvae with 0.016% Tricaine.\nChop 30 zebrafish into small pieces using a razor blade in a Petri dish containing 1 mL of 10x trypsin-EDTA solution.\nTransfer the chopped zebrafish into a microcentrifuge tube with a total volume of 2 mL of 10x trypsin-EDTA solution and leave on ice for 3 h. Pipette up and down with a P1000 pipette every hour to stimulate dissociation.\n3. Gut isolation\nPlace 6-10 5 dpf larvae anesthetized with 0.016% Tricaine in a row, on a 1.8% agarose plate (0.45 g of agarose in 25 mL of E3), under a dissection microscope\nPut one insect pin in the head of the zebrafish.\nRemove all remaining E3 using a tissue.",
    "Isolate the intestine using another insect pin, without disturbing any other organs. Make sure that the yolk is removed (Supplementary Figure S1A).\nOnce isolated, inspect the intestine and remove all non-intestinal material (e.g., skin, fat, liver) if needed.\nCollect the intestine with tweezers and place it in a microcentrifuge tube, containing phosphate-buffered saline (PBS) with 10% fetal calf serum (FCS), on ice.\n\t​NOTE: A minimum of 244 intestines should be isolated, keeping the total dissection time at 3 h. This is feasible with two people working in parallel.\n4. Gut dissociation\nImmediately after the dissection of all intestines, centrifuge the microcentrifuge tube at full speed (13,800 × g) for 30 s.\nRemove the PBS/10% FCS but leave a small amount (~100 µL) to prevent the intestines from drying out. Add 500 µL of 2.17 mg/mL papain in HBSS containing CaCl2 and MgCl2, to dissociate cells.\nActivate papain with 2.5 µL of cysteine (1 M).\nIncubate the guts in a water bath at 37 °C for 10 min. Pipette up and down halfway (after 5 min) to stimulate enzymatic tissue digestion.\nTransfer cells into a FACS tube using a 35 µm cell strainer, prewetted with 0.5 mL of PBS/10% FCS.\nWash the strainer by adding a total of 2 mL of PBS/10% FCS in 0.5 mL steps.\nCentrifuge at 700 × g for 5 min at 4 °C.\nRemove the supernatant and resuspend the pellet in 300 µL of PBS/10% FCS.\nAdd 1 µg/mL of 4',6-diamidino-2-phenylindole (DAPI) to label dead cells (1:1,000) and incubate for 5 min to allow their exclusion during FACS.\n5. FACS enrichment\nUse the wildtype sample to set the gates of the sorted cell population by recording 3,000 cells on the flow cytometer (Supplementary Figure S1B-E).",
    "Use a 100 µm nozzle, set sort precision on purity, and put the collection tube containing 200 µL of PBS/5% FCS, in the FACS machine.\nLoad the cell suspension of the guts and sort live (DAPI-negative), single cells into the collection tube (Figure 2C), by excluding doublets (Figure 2B) and dead cells (Figure 2C).\n\tNOTE: For the tg(phox2bb) zebrafish, the proportion of GFP+ cells is only checked for reference, as all single live cells are sorted.\nKeep the collection tube on ice after cell sorting.\nCount the cell suspension with a hemocytometer, including a viability check with trypan blue. If the viability is at least 80%, continue with the next step.\nCells are now ready to process for scRNAseq (i.e., 10x Genomics Chromium platform). Use approximately 20,000 cells per sample.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}