{
  "id": 17373,
  "origin_website": "Jove",
  "title": "A Murine Model of Hemodialysis Access-Related Hand Dysfunction",
  "procedures": [
    "All procedures were approved by the Institutional Animal Care and Use Committee (IACUC) of the University of Florida and Malcom Randall Veterans Affairs Medical Center.\nNOTE: Young adult (8-10 weeks old) male C57BL/6J mice were purchased from The Jackson Laboratory and housed in a light (12 h light: 12 h dark cycle), temperature (22 °C ± 1 °C), and humidity (50% ± 10%) controlled animal facility. Five mice were allowed to dwell per cage (W:18 cm x L:29 cm x H:12.5 cm) with nesting materials, food, and water being made available ad libitum. Following 7 days of habitat acclimation with standard chow, the mice were changed to a casein-based chow diet for 7 days as a diet transition phase. Thereafter, mice were fed the casein-based chow with 0.2%-0.15% adenine supplementation for 2-3 weeks to induce renal dysfunction (CKD) prior to the AVF surgery as previously described22,23,24. Control mice received a casein-based chow diet without adenine supplementation (control). The control and CKD diets were maintained throughout the postoperative recovery period (POD).\n1. Pre-operative measurements\nAssess baseline/pre-operative outcome measurements, aortoiliac vessel diameters and hemodynamic flow parameters using duplex ultrasound imaging and the hindlimb perfusion via laser Doppler as previously described25.\nDetermine the unilateral hindlimb grip strength and treadmill gait appraisal to establish baseline hindlimb function as previously described25,26.\nAssess kidney function by measuring glomerular filtration rate (GFR) via FITC-inulin clearance and/or serum blood urea nitrogen (BUN) level as previously described22,24,27.\n2. Surgical preparation",
    "Prepare the following surgical tools and supplies (Table of Materials): a hot bead sterilizer, eye lubricant, a pen trimmer, alcohol preps, chlorhexidine wipes, extra-fine Graefe forceps, sterilized 0.9% saline, 29 G and 31 G needle syringes, 2 x 2 non-woven sponges, medium single-ended round (SC-9) and small double-ended hard, sharp, pointed (SC-4) cotton swabs, low-temperature cautery, straight Dumont forceps, 45° angled Dumont forceps, straight Vannas spring scissors, curved Vannas spring scissors, round handled needle holders, multiple sizes of sutures (4-0 silk, 5-0 PGA, 6-0 silk, and 10-0 nylon sutures), heparin, absorbable gelatin sponge, a straight needle holder, and buprenorphine.\n\tNOTE: Extremity fixing rubber bands and retractors for the abdomen and legs were handmade.\nSterilize surgical preps using autoclave with steam sterilization at 120-125 °C for 30 min followed by drying for 30 min prior to the surgery. Utilize 70% ethanol cleansing followed by hot bead sterilization (240-270 °C for 3 min) between each animal surgery.\nPrepare sterilized 0.9% normal saline, heparinized saline (100 IU/mL), and buprenorphine (0.01 mg/mL) using 29-31 G needle syringes.\n3. Anesthesia and positioning\nInitiate mouse anesthesia in the induction chamber (0.8 mL/min, 2.5% isoflurane). Once the mouse is adequately anesthetized, place the mouse in a supine position on the surgery station covered by a sterile drape. Taper the isoflurane concentration down to ~1.2% during the shaving and positioning steps.\nApply the ocular lubricant to protect the eyes from drying during the surgery.\nUsing a pen trimmer, shave the abdominal hair for the operation and the leg hair for postoperative perfusion measurements. Clear the hair off the surgical field.",
    "Fixate the upper and lower extremities with rubber bands and tacks, check the depth of anesthesia by monitoring the toe pinch reflex, and titrate anesthesia as necessary. Perform the respiratory pattern evaluation every 3-5 min throughout the surgical procedure to calibrate the level of anesthesia.\n4. Exploration of the surgical target area\nClean the shaved skin area several times, alternating between alcohol prep and chlorhexidine wipes in a circular pattern to disinfect the surgical field.\nMake a midline laparotomy from the lower edge of the sternal margin to the pubis symphysis. Dissect out the pubis fat pad to obtain a wider operative field.\nOpen the celiotomy to access the peritoneal contents with retractors and eviscerate the small and large intestines using medium, single-ended round cotton swabs. Cover the bowels with a saline-soaked non-woven sponge.\nOnce adequate exposure of the retroperitoneal vasculature is obtained, cover the remaining bowel, kidneys, and ureters with small saline-soaked non-woven sponges. Evacuate a distended bladder by gently squeezing the bladder dome with medium, single-ended round cotton swabs as needed.\nCarefully dissect out the perivascular fascia and adipose tissue from approximately 1 cm proximal to the aortic bifurcation extending to the level of the left iliac bifurcation using straight Dumont forceps and small double-ended hard, sharp, pointed cotton swabs.\n\tNOTE: The left iliac artery and vein are left adherent to one another while isolating the arteriovenous structures en masse. This step will provide sufficient vessel mobilization to facilitate AVF creation.\nIf any small venous branches are encountered originating from or converging with the left common iliac vein, ligate them using low-temperature cautery with or without 6-0 silk suture as needed.",
    "Pass the tip of the angled forceps under the left common iliac vascular bundle and gently spread multiple times to mobilize the vessels from the underlying retroperitoneal musculature (Figure 1A).\n5. Creation of a common iliac arteriovenous fistula anastomosis\nPlace two 4-0 silk sutures around the isolated left common iliac arteriovenous bundle and use them as ligatures (e.g., cross-clamps) to the vascular bundle. Create a single knot with each 4-0 silk tie and apply them sequentially from proximal to distal.\nMake sure that the silk-tie cross-clamps are placed sufficiently far apart to isolate ~2 mm of vessel length, and the sequential application of the suture ligatures will precipitate left iliac vein engorgement.\nUsing the 4-0 silk suture strings as handles, rotate the left iliac arteriovenous vascular bundle clockwise and fine-tune the position to temporarily locate the vein anterior to the artery (Figure 1B).\nMake a longitudinal venotomy (~1 mm) with straight Vannas spring scissors and gently flush out residual blood from the venous lumen with 0.9% saline (Figure 1C). Use caution during this step, as a high-pressure saline flush can cause venous disruption.\n\tNOTE: The region of red color that remains in the iliac artery after venous flushing provides a visual window for the following step.\nPlace an imbricating 10-0 nylon suture through the posterior wall of the vein.",
    "NOTE: This portion of the iliac vein should be in immediate apposition to the anterior wall of the iliac artery, and the walls are naturally adherent. The suture should go through both walls and tie the suture down with a single knot (Figure 1D). Note that a small amount of bleeding, which originates from the stagnant blood in the iliac artery, will appear once the needle passes through both walls. If intra-luminal bleeding continues during this step, the silk suture cross-clamps may be too loose and need to be further tightened.\nGrasp the imbricated suture ends and place them under gentle tension to displace the anterior wall from the posterior wall of the iliac artery. Make a ~1.0 mm x 0.3 mm elliptical incision using curved Vannas spring scissors, removing the adherent walls of both the iliac artery and vein.\n\tNOTE: The arteriovenous fistula is thereby created once this common channel is established. It is possible to injure the lateral walls of the vein during this step as the posterior iliac vein/anterior iliac artery wall incision is performed through venotomy exposure. Caution should be taken to avoid this complication as this can considerably reduce the fistula diameter and lead to thrombus development.\nGently flush out residual blood of the exposed arterial lumen with 0.9% saline and heparinized saline (100 IU/mL)28 (Figure 1E).\nFollowing the creation of the AVF, repair the initial anterior wall venotomy using two or three 10-0 nylon sutures in an interrupted fashion (Figure 1F).\nRestore the vascular bundle to its original anatomic orientation and place a small piece of saline-soaked absorbable gelatin sponge adjacent to the repaired venotomy to facilitate hemostasis.\nLoosen the 4-0 single-knot cross-clamp ligatures sequentially from distal to proximal. Monitor the venotomy site closely for excessive bleeding while loosening each suture.",
    "If the repair is not adequately hemostatic, reapply the cross clamps and place another 10-0 nylon suture at the site of bleeding. If hemostasis is assured, remove the sutures and then the absorbable gelatin sponge.\nGently rub the vascular bundle with small double-ended hard, sharp, pointed cotton swabs, which further facilitate the restoration of blood flow. Confirm technical success of the operation using visualization of pulsatile, bright red oxygenated blood entering the iliac vein and mixing with dark venous blood returning from the hindlimb.\nInject heparinized saline (0.2 IU/g)15 into the IVC for systemic anticoagulation to improve AVF patency outcomes.\n\tNOTE: Although this step occurs after the vascular reconstruction (as opposed to the human analog where heparinization occurs prior to vessel cross-clamping), a reduction in intraoperative bleeding and improved AVF patency were observed when performed at this stage of the procedure. Injection into a site covered by fascia and/or fat is preferable to prevent bleeding from the puncture site.\nRe-inspect the surgical site for hemostasis after the injection of heparinized saline. If there are no bleeding concerns, close the midline fascia and then the skin incision with absorbable 5-0 PGA sutures in a running fashion.\nFor sham operations, follow all the key steps of the procedure except for AVF formation. Apply a single knot of the 4-0 silk ligature at the proximal end of the left iliac arteriovenous bundle and match the clamp times to AVF surgeries (e.g., ~20 min, depending on microsurgeon proficiency).\n6. Postoperative care and measurement\nAfter laparotomy closure, measure the blood perfusion of the bilateral tibialis anterior muscles and ventral paws using laser Doppler imaging.\n\tNOTE: Unilateral perfusion deficits will confirm fistula diversion of arterial flow (\"steal\").",
    "Administer 0.1 mg/kg buprenorphine subcutaneously and return the mouse to a prewarmed mouse cage with highly absorbable soft bedding with nest.\nAllow the mouse to recover in the prewarmed mouse cage until the anesthesia wears off, which will be obvious when the mouse is ambulatory and interactive (~2 h). During recovery, give the mouse easy access to a moisturized, soft diet.\nAdminister buprenorphine and/or subcutaneous saline hydration every 12 h up to 48 h and perform daily monitoring for 5 days post-operatively. Euthanize animals with a deteriorating condition or excessive tissue necrosis, classified as a modified ischemia score ≥229.\nUse serial duplex ultrasound assessments to evaluate fistula patency post-operatively; mice with fistula thrombosis are excluded from subsequent analyses unless the purpose of the experiments is to characterize AVF maturation failure.\nDetermine other postoperative outcome measurements such as local hemodynamics, grip strength, and gait performance during the recovery time period. Collect fistula and muscle tissues to assess histomorphology at the end of the experiment during the sacrifice25,27.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}