{
  "id": 13453,
  "origin_website": "Jove",
  "title": "Corneal Tissue Engineering: An In Vitro Model of the Stromal-nerve Interactions of the Human Cornea",
  "procedures": [
    "This protocol follows the guidelines of the University of Oklahoma Health Sciences Center/Institutional review board (IRB #4509). All parts of the protocol met the tenets of the declaration of Helsinki. Corneal samples were obtained from the National Development and Research Institute (NDRI) and the Oklahoma Lions Eye Bank.\n1. Isolation of Primary Cells\nUpon receipt of the human cornea tissue samples, transfer the tissues into a 21.5 cm2 Petri dish containing 2 mL of sterile Dulbecco's phosphate-buffered saline (DPBS) (1x).\nScrape and remove the corneal epithelium by positioning the cornea dome face-up. To ensure complete removal, scrape off the epithelial layer thoroughly using a razor blade at a 45° angle. Next, flip the cornea dome face-down and thoroughly scrape off the endothelium from the stroma with a razor blade at a 45° angle to ensure complete removal. Wash the stromal tissue with DPBS.\nCut the stromal tissues into small pieces, using a number 10 surgical blade, keeping the stromal pieces wet at all time using DPBS. Pick stromal pieces up with sterile forceps and place into a T25 culture flask without media (4 or 5 pieces of 2 x 2 mm tissue per flask).\nAllow the explants to adhere to the bottom of the flask at 37 °C for about 30 - 40 min. Once adhered, slowly add Eagle's minimum essential medium (EMEM) containing 10% fetal bovine serum (FBS) and 1% Antibiotic/Antimycotic to the flask without disturbing the explants.\nGently place the flask in the incubator at 37 °C, 5% CO2. Leave the explants undisturbed until the cells begin isolating and migrating in the flask. After approximately 2 - 4 weeks, cells should reach 100% confluence. Upon 100% confluence, passage the cells by removing the tissue culture media and wash the cells with DPBS.",
    "Add trypsin to the cells and then incubate them at 37°C. After approximately 5 min, view the cells under light microscopy to confirm that they have detached, and then halt the proteolysis by adding fresh media.\nTransfer the cell suspension into a 15 mL conical tube for centrifugation at 1,000 x g. Remove the supernatant carefully without disturbing the pellet and suspend the cells in fresh EMEM 10% FBS 1% Antibiotic. Count the cells and seed about 1 x 106 cells in T75 culture flask for further expansion with fresh EMEM 1% FBS 1% Antibiotic.\n2. Primary HCFs Culture and 3D Constructs Assembly\nTo assemble 3D constructs from explants previously grown in EMEM 10% FBS 1% Antibiotic/Antimycotic, passage and count HCFs.\nSeed approximately 1 x 106 cells/well of primary HCFs on polycarbonate membrane inserts with 0.4-µm pores from the 3D constructs, along with 1.5 mL of fresh EMEM 10% FBS 1% Antibiotic/Antimycotic to the top of the construct. Add another 1.5 mL of the same media to the bottom of each construct.\nAfter 24 h of cell seeding, culture the cells with EMEM 10% FBS 1% Antibiotic/Antimycotic, stimulated with 0.5 mM 2-O-α-D-glucopyranosyl-L-ascorbic acid (Vitamin C) by adding 1.5 mL on the top and 1.5 mL on the bottom of each construct.\nMaintain the cultures in an incubator at 37 °C, 5 % CO2 for 3 weeks and supply fresh media every other day during the entire study period. No further passage is needed.\n3. Cell Differentiation and Co-cultures\nAfter 3 weeks, add 8 x 103 cells/well of SH-SY5Y human neuroblastoma cells on the top of the previously assembled 3D constructs containing 1.5 mL of the EMEM containing 10% FBS, 1% Antibiotic/Antimycotic, and 0.5 mM 2-O-α-D-glucopyranosyl-L-ascorbic acid (Vitamin C).",
    "Allow the SH-SY5Y neuroblastoma cells to grow on top of the cornea stromal cells for at least 24 h before initiating cell differentiation.\nInitiate SH-SY5Y cell differentiation by stimulating the cells with EMEM containing 1% FBS and 1.5 mL of 10 µM Retinoic Acid on top of the construct. Add 1.5 mL of the EMEM 10% FBS 1% Antibiotic/Antimycotic 0.5 mM 2-O-α-D-glucopyranosyl-L-ascorbic acid (Vitamin C) to the bottom of the construct. Note that the Retinoic Acid step should be performed in the dark.\n\t\nContinue to culture the cells in this differentiation media for 5 days.\nWhen the cells reach the differentiation phase, switch the cells to 1.5 mL of serum-free media containing 2 nM of Brain-derived neurotrophic factor (BDNF) and 1% Antibiotic/Antimycotic added to the EMEM, by adding to the top of the construct. Add 1.5 mL of the EMEM 10% FBS 1% Antibiotic/Antimycotic 0.5 mM 2-O-α-D-glucopyranosyl-L-ascorbic acid (Vitamin C) to the bottom of the construct. Note that the BDNF step should be performed in the dark.\nCulture the cells for 2 additional days before processing for any further analysis as indicated in Table 1.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}