{
  "id": 2091,
  "origin_website": "Cell",
  "title": "An optimized FusX assembly-based technique to introduce mitochondrial TC-to-TT variations in human cell lines",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDesigning and synthesis of FusXTBE arms\nTiming: ∼4 Days\nTo edit a target cytosine residue, we employ dual chain FusXTBE arms (left and right arms binding to the forward and reverse strands, respectively). In this protocol, we describe how to design the FusXTBE arms, which bind target DNA sequences flanking the protospacer region. Once the FusXTBE arms are designed, we will describe the process of synthesizing them. As an example, to demonstrate FusXTBE-mediated base editing in human cells, we introduced a point mutation by changing a TGA codon to a TAA codon in the MT-ND4 gene which encodes for NADH subunit 4. This protein is part of the mitochondrial enzyme complex I (Mimaki et al., 2012[href=https://www.wicell.org#bib7]). The protospacer length, target cytosine position, and split orientation are all determinants of the base editing efficiency of split-DddAtox. The human mitochondrial sequence information can be retrieved from the “MITOMAP” server (https://www.mitomap.org/MITOMAP[href=https://www.mitomap.org/MITOMAP]).\nDetermining the target sequence.\nThe first step is to identify the target “cytosine” residue on the mitochondrial genome that we want to edit to “thymine”. Some of the utilities of base editing can be to introduce a premature termination codon (PTC) in an ORF, revert a pathogenic T-to-C mutation, generate in vitro/in vivo disease model, and generate mutant proteins. Therefore, we need to choose the target “cytosine” nucleotide accordingly.",
    "Example: Recently, we targeted the human MT-ND4 gene to introduce a premature stop codon (Sabharwal et al., 2021[href=https://www.wicell.org#bib9]). The position of the target cytosine on human mtDNA was m.11922 and was present in the antisense strand, preceded by a thymine nucleotide. C-to-T transition at m.11922 position results in G-to-A on the forward strand, thereby introducing a stop codon [TGA (W)>TAA (stop)] in the ORF of MT-ND4. We selected the 14 bp (TCCTGATCAAATAT), spanning from m.11918 to m.11931 as the “target protospacer” (Figure 2[href=https://www.wicell.org#fig2]). Within the protospacer, two other cytosine residues at m.11919 and m.11925 were amenable to C-to-T editing (undesired in the context of our experiment).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1575-Fig2.jpg\nFigure 2. Schematic presentation of the design of the FusXTBE arms to target MT-ND4 locus\nWithin the protospacer (blue highlighted), the target cytosine nucleotide is highlighted within the solid square. The dotted squares represent the cytosine nucleotides which are amenable for base editing but not desired. Star mark indicates the presence of 5′ T nucleotide before target cytosine. Two FusXTBE arms are represented by the arrows design and the circles represent the 5′ T nucleotide upstream of the left and right binding regions.\nDetermining the binding regions of the FusXTBE arms and converting the nucleotides to the corresponding RVD sequences.\nAfter selecting the target “cytosine” residue, the DNA-binding regions of the FusXTBE arms flanking the protospacer region (Figure 2[href=https://www.wicell.org#fig2]) are designed.\nNote: Keep in mind the requirement for a 5′ terminal “thymine” nucleotide upstream of the binding region.\nNote: Try to position the target “cytosine” within the middle third of the protospacer for optimal editing (try to avoid extreme ends of the protospacer).\nWrite the FusXTBE bound DNA sequence (position by position) of each arm in the “FusXTBE Builder Template” to generate the RVDs sequences.",
    "Note: For the left arm of the FusXTBE, write the top strand (5′-3′) and for the right arm write the bottom strand (5′-3′) in the “FusXTBE Builder Template” (Data S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1575-Mmc2.zip], FusXTBE Builder Template, related to step 2). This “FusXTBE Builder Template” can generate the RVD sequences for multiple target DNA sequences.\nNote: Start with the “FusXTBE Builder Template” to add nucleotide sequences in respective cells. This Excel sheet is designed to generate the RVD sequence for targeting 15 nucleotides. Depending upon the availability of an upstream 5′-T nucleotide, FusXTBEs designed to bind 16 nucleotides instead of 15 can be made, in which the 16th RVD sequence is added manually in the “FusXTBE Builder Template” (AH column). We use the following TALE cipher code: NI for A, HD for C, NN for G, and NG for T.\nExample: We designed the FusXTBE_ND4_Left Arm to bind 5′-GCTAGTAACCACGTTC-3′ (sense strand, 16 bp) and FusXTBE_ND4_Right Arm to bind 5′-GTAAGTAGGAGAGTG-3′ (antisense strand, 15 bp). After writing each nucleotide into their designated position in the “FusXTBE Builder Template”, here is the snapshot of the outcome (Figure 3[href=https://www.wicell.org#fig3]). We have manually input “HD” for the last “C” nucleotide of FusXTBE_ND4_Left Arm in the AH column as it had a 16-nucleotide binding target.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1575-Fig3.jpg\nFigure 3. Screenshots from the “FusXTBE Builder Template”\nThe left and right binding region of MT-ND4 locus specific FusXTBE arms were used as “input” (TALE#1 and TALE#2) to obtain RVDs sequence as an “output”.",
    "Conversion of RVD sequences to the FusX recipe. Next, paste the RVD sequences generated in the previous step into the FusX recipe tool (http://www.talendesign.org/pFUXrecipeInput.php[href=http://www.talendesign.org/pFUXrecipeInput.php]) to get the information about which plasmids from the FusX kit need to be used in the next “assembly step” to generate the required FusXTBE arms. Example: Below are the snapshots of the outcome for the TAL1- FusXTBE_ND4_Left Arm, and TAL2- FusXTBE_ND4_Right Arm (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1575-Fig4.jpg\nFigure 4. Example of conversion of RVD sequences to FusX recipe\nScreenshots of the input fields in the tale design site to obtain the respective plasmid’s FusX recipe for the assembling step from the RVD sequences. Here we are using the MT-ND4 locus as an example. Note that ‘pFUX’ and ‘pFusX’ terminology are used interchangeably.\nAlternatives: Steps 1–3 can be automated using TALE Writer. TALE Writer is a Python-based script for the computer-aided design of TALE-based technologies. Additionally, it can be used to identify potential target sites for TC-to-TT base editing in mitochondrial genomes (Sabharwal et al., 2021[href=https://www.wicell.org#bib9]). Here, we provide a step-by-step explanation on how to use TALE Writer, targeting the MT-ND4 gene as an example. To make TALE Writer available to the broader scientific community, we use Google Collaboratory (Colab), a product from Google Research. Colab requires no setup and provides free access to computing resources.\nTo access TALE Writer, go to https://colab.research.google.com/github/srcastillo/TALE-Writer/blob/main/TALE_Writer_Colab.ipynb[href=https://colab.research.google.com/github/srcastillo/TALE-Writer/blob/main/TALE_Writer_Colab.ipynb] (you must be logged in with a Google Account to use this resource). You will be taken to the TALE Writer Colab interface.\nScroll down to the “Setup” section and follow the on-screen instructions.\nInstall third-party software by pressing the Play button to the left of the corresponding instruction.",
    "Note: Third-party software installation takes place in the cloud and not on your computer. If you get the message “Warning: This notebook was not authored by Google”, click on “Run anyway”.\nDefine libraries and functions by pressing the play button to the left of the corresponding instruction.\nOnce third-party software installation is done, and libraries and functions are defined, scroll down to the “Design” section, and click on the play button to the left of the corresponding instruction.\nChoose the type of TALE-based technology you wish to design (TALENs or base editors). For this protocol, to design FusXTBEs, select the base editors option by typing in ‘B’ and pressing ENTER (Figure 5[href=https://www.wicell.org#fig5]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1575-Fig5.jpg\nFigure 5. Screenshots depicting the execution of TALE Writer at setup and designing steps\nChoose the type of target you wish to edit (5′-TC-3′ motifs or PTC motifs only). To design FusXTBEs for premature termination codon induction, select this option by typing in ‘B’ and pressing ENTER (Figure 5[href=https://www.wicell.org#fig5]B).\nChoose whether to use the default design parameters or your own design parameters. For FusX-based assembly, we recommend using the default parameters. Type in ‘B’ and press ENTER. The default parameters will be printed (Figure 5[href=https://www.wicell.org#fig5]C).\nNote: A detailed explanation of all the inputs and outputs of TALE Writer, including the design parameters, is available at https://github.com/srcastillo/TALE-Writer/blob/main/README.md[href=https://github.com/srcastillo/TALE-Writer/blob/main/README.md].\nPaste the DNA sequence you wish to screen for targets for PTC induction and find their corresponding FusXTBEs in the textbox and press ENTER.",
    "Note: For PTC induction, the input DNA sequence must correspond to the sense strand of a protein-coding gene and must be in-frame with the ORF of that gene. In this example, we are analyzing part of MT-ND4 gene. This sequence is in frame with the MT-ND4 ORF and corresponds to the PCR amplicon generated with the ND4 primers utilized in our previous report (Sabharwal et al., 2021[href=https://www.wicell.org#bib9]). For FusXTBE design, TALE Writer can identify loss and gain of restriction sites after TC-to-TT editing, which can facilitate genotyping. TALE Writer identifies such sites by analyzing the entire input sequence, which is why we recommend using the DNA sequence of a PCR amplicon as the input sequence for TALE Writer (Figure 5[href=https://www.wicell.org#fig5]D).\nA table containing all identified targets for FusXTBE-based C-to-T editing will be automatically generated (see a section of this table below). From left to right, the table contains:\nTGT, the target index.\nDSG, the design index.\nLOSS, the enzymes whose restrictions are lost after C-to-T editing.\nGAIN, the enzymes whose restriction sites are gained after C-to-T editing.\nX, the number of potential off-target edits within the protospacer region.\nLEFT SEQUENCE, the 5′-to-3′ top strand TALE binding sequence of the left arm of the FusXTBE.\nRIGHT SEQUENCE, the 5′-to-3′ bottom strand TALE binding sequence of the right arm of the FusXTBE.\nSPACER SEQUENCE, the 5′-to-3′ top strand sequence of the protospacer region, with the on-target PTC motif highlighted in blue, and other 5′-TC-3′ off-target sites highlighted in red (Figure 5[href=https://www.wicell.org#fig5]E).\nTo save the results, type in ‘Yes’ and press ENTER (Figure 5[href=https://www.wicell.org#fig5]F).\nType in an alphanumeric filename (e.g., ‘ND4’) and press ENTER (Figure 5[href=https://www.wicell.org#fig5]G).\nIf you wish to analyze a new sequence using the same parameters, type in ‘Yes’, otherwise type in ‘No’ and press ENTER (Figure 5[href=https://www.wicell.org#fig5]H).",
    "If you wish to begin a completely new analysis, type in ‘Yes’, otherwise type in ‘No’ and press ENTER (Figure 5[href=https://www.wicell.org#fig5]I).\nThe saved file will be available in the Files section on the left of the Colab interface. This file can be viewed and downloaded (Figure 6[href=https://www.wicell.org#fig6]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1575-Fig6.jpg\nFigure 6. Screenshots depicting how to save the of TALE Writer output and execution at assembly step\nFrom the output table depicted in step ‘j’, a specific design or set of designs for their subsequent FusX-based assembly must be chosen. Choosing a specific design will depend on the experimental needs of the user.\nTo obtain the FusX recipes of the chosen FusXTBEs, scroll down to the Assembly section and follow the on-screen instructions. Click on the Play button.\nSpecify the number of targets you wish to find the corresponding RVDs for. For example, we have two targets (left arm and right arm of the ND4 FusXTBE). Type in ‘2’ and press ENTER (Figure 6[href=https://www.wicell.org#fig6]B).\nPaste the target sequence of the left arm and press ENTER. In this example, the TALE binding sequence of the left arm of the ND4 FusXTBE is 5′-GCTAGTAACCACGTTC-3′ (Figure 6[href=https://www.wicell.org#fig6]C).\nPaste the target sequence of the right arm and press ENTER. In this example, the TALE binding sequence of the right arm of the ND4 FusXTBE is 5′-GTAAGTAGGAGAGTG-3′ (Figure 6[href=https://www.wicell.org#fig6]D).\nA table with the target sequences and their corresponding RVDs will be automatically generated (Figure 6[href=https://www.wicell.org#fig6]E).\nPaste the RVD sequences generated in the previous step directly into (http://www.talendesign.org/pFUXrecipeInput.php[href=http://www.talendesign.org/pFUXrecipeInput.php]) to get the FusX recipe.\nGolden gate assembly protocol.\nSet-up the assembly reaction by adding the following reagents in a PCR tube.\ntable:files/protocols_protocol_1575_2.csv\nNote: Any of the following plasmids (FusXTBE-G1397-DddAtox_Nterm, FusXTBE-G1397-DddAtox_Cterm, FusXTBE-G1333-DddAtox_Nterm, FusXTBE-G1333-DddAtox_Cterm) can be used as the receiving plasmid.",
    "Note: The plasmid stock concentration of receiving plasmid and FusX plasmids should be adjusted to 75 and 50 ng/μL respectively for easy pipetting.\nNote: Add the FusX kit components according to their “Stock number” to the reaction.\nNote: The schematic representation of the workflow of the single Golden Gate cloning step was represented in Figure 1[href=https://www.wicell.org#fig1]A.\nExample: We have put RVDs specific to the left and right arms of the MT-ND4 target into the two receiving plasmids: 1. FusXTBE-G1397-DddAtox_Nterm, and 2. FusXTBE-G1397-DddAtox_Cterm. Thus, a total of four different plasmids were generated, which allowed to try out two different orientations (see expected outcomes[href=https://www.wicell.org#expected-outcomes]).\ntable:files/protocols_protocol_1575_3.csv\nIncubate the reaction mixture at 55°C for 1 h.\nAdd the following reagents to all tubes.\ntable:files/protocols_protocol_1575_4.csv\nCritical: Always use fresh ATP or fresh ligase buffer as ATP breaks down during freeze-thaws. Make aliquots of freshly received ATP and store them at −20°C for single use.\nRun the following cycle in PCR machine.\ntable:files/protocols_protocol_1575_5.csv\nNote: Esp3I is an isoschizomer of BsmBI. It is active at 37°C (instead of 55°C).\nAdd 0.5 μL of Plasmid-Safe ATP-Dependent DNase and 0.5 μL of 25 mM ATP to each tube.\nIncubate at 37°C for 1 h.\nInactivate the DNase by incubating at 70°C for 30 min.\nPause point: The assembling protocol can be paused here, and the samples can be stored at −20°C for next day.\nTransform 2.5 μL of assembly product into 25 μL of DH5α competent cells (any subcloning efficiency DH5α competent cell should work fine).\nPlate 50–100 μL of transformed culture onto LB-kanamycin agar plates previously supplemented with 40 μL of X-Gal and 40 μL of IPTG for blue/white screening (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]). Incubate at 37°C for 12–18 h.",
    "Note: After the heat shock during bacterial transformation, either SOC or LB liquid media can be used to recover the cells. Recovery time should be 1 h.\nNote: The FusXTBE receiving plasmids contain a kanamycin resistance gene.\nPause point: Optionally, the plates having colonies can be stored at 4°C for a few days before colony PCR.\nValidation of FusXTBE plasmid assembly.\nRun a colony PCR to verify the final FusXTBE plasmids. For this, pick 4–8 white colonies from each plate.\nNote: Only individual white colonies have to be picked for the colony PCR. Sample the bacterial colony either with a sterile toothpick or a pipette tip, briefly dip in the colony PCR master mix (do not mix around vigorously) and subsequently inoculate the same toothpick or tip in a culture tube containing LB media supplemented with kanamycin. Alternatively, some portion of the colony can be used in colony PCR and the remaining of the colony can be used for inoculation in LB media after colony PCR screening.\nSet up the following PCR with MyTaq DNA Polymerase.\ntable:files/protocols_protocol_1575_6.csv\nRun the following PCR cycle.\ntable:files/protocols_protocol_1575_7.csv\nRun all the PCR samples on a 1% gel and look for a smear pattern (Figure 7[href=https://www.wicell.org#fig7]A shows a representative agarose gel for this step).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1575-Fig7.jpg\nFigure 7. Validation of correct FusXTBE plasmid assembly\n(A) Representative gel image from colony PCR showing the smear pattern from the correctly assembled clones. Lanes marked by star represents the clones with unsuccessful assembly reaction and should be excluded for further experiments.\n(B) Gel image showing the expected restriction digestion pattern (an insert of ∼1,750 bp) for the correct clones. The star marked lane represents how the restriction digestion of the wrong clones would look.",
    "Note: In our study, we used Meridian Bioscience DNA polymerase. Other Taq-based polymerases can also be used, following their corresponding protocols.\nNote: If there is a high proportion of white to blue colonies, then probability of true positive colonies is high. We recommend screening at least 4 white colonies per assembly.\nNote: The smeary ladder results from amplicon slips from one repeat region to another during denaturation and renaturation, especially when the extension is incomplete. These partial products can bind at a different RVD location due to the repetitive nature of TALE repeats. The partial products bind to either full-length or partial products in different locations to make longer or shorter end products. Once they are made, they can be readily amplified by the standard primers, which contributes to the laddering. Negative colonies result in a single band due to the absence of TALE repeats (Figure 7[href=https://www.wicell.org#fig7]A, lanes 5 and 6).\nCulture one or two confirmed colonies for 14–16 h, in LB media supplemented with kanamycin.\nPurify the plasmid DNA by using a plasmid isolation kit/protocol.\nNote: We isolate plasmid DNA with the QIAprep Spin Miniprep Kit (QIAGEN). The supplier’s protocol should be followed during plasmid DNA purification. The extraction of the plasmid can be scaled up using a QIAGEN Plasmid Maxi Kit (Cat#12163).\nAlternatives: Other plasmid extraction kits, such Monarch Plasmid Miniprep Kit (NEB Cat. No. T1010S) can also be used.\nSet up the following diagnostic digest reaction for verification of the isolated plasmids.\ntable:files/protocols_protocol_1575_8.csv\nIncubate the digestion mixture at 37°C for 1–2 h.\nRun all the digested samples on a 1% agarose gel. Look for a band corresponding to ∼1,750 bp (Figure 7[href=https://www.wicell.org#fig7]B depicts a representative diagnostic digest).\nMeasure the plasmid DNA concentration using a NanoDrop UV-Vis spectrophotometer or a similar method.",
    "Prepare the plasmid samples for Sanger sequencing, using the TAL-F1 and TAL-R1 primers. Many sequencing services are available, we use Genewiz (https://www.genewiz.com/[href=https://www.genewiz.com/]).\nPerform the sequence confirmation analysis of the FusXTBE plasmids obtained by chromatogram/fasta sequence from Sanger sequencing either by translating the amplicon (unorthodox but easy to perform) or by making the in silico plasmids for sequence alignment.\nTranslating the sequence reads: After getting the sequencing results back, use ExPASy Translate (http://web.expasy.org/translate/[href=http://web.expasy.org/translate/]) to convert the nucleotide sequences into their corresponding amino acid sequences. Subsequently, search for the “VVAIAS“ consensus amino acid sequence, which appears immediately before each RVD.\nNote: The ExPASy Translate tool outputs amino acid sequences for all six possible reading frames. Using the sequence file generated by sequencing with the forward primer (TAL-F1), the sequence of interest will be within the first three frames; using the reverse primer (TAL-R1), the sequence of interest will be within the last three frames.\nNote: You should observe 32 amino acids in between the RVDs. A good sequencing result gives between 8-9 RVDs. Both the forward and reverse primer-generated sequencing files should be used to validate all the RVDs of a plasmid.\nIn silico design of FusXTBE plasmids: Use the SnapGene software to build the in silico FusXTBE plasmids. Open the correct receiving plasmid and go to Actions > Restriction and Insertion Cloning > Insert Multiple Fragments. To build the plasmid, use the appropriate FusX library plasmids according to the FusX recipe. In the SnapGene interface, cut every plasmid with BsmBI. Subsequently, Sanger sequencing files can be aligned with the resulting FusXTBE plasmid maps for cloning confirmation.\nNote: The FusX library plasmids can be downloaded one by one from Addgene (https://www.addgene.org/kits/ekker-fusx/[href=https://www.addgene.org/kits/ekker-fusx/]). The pLR plasmids can be downloaded from Addgene as well (https://www.addgene.org/Daniel_Voytas/[href=https://www.addgene.org/Daniel_Voytas/]).\nThe sequence-verified plasmid samples should be used for future experiments.",
    "Example: Here, we are showing the translation of Sanger sequencing reads of the FusXTBEs for MT-ND4 (left and right arms, Figure 8[href=https://www.wicell.org#fig8]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1575-Fig8.jpg\nFigure 8. Representative figure showing the “Expasy translate” output\nThis figure shows the translation of fasta sequence obtained from Sanger sequencing of MT-ND4 specific FusXTBE left and right arm as an example. Sequencing by both the forward and reverse primers is necessary to check all the RVDs. The underlined amino acids represent the RVDs.\nPause point: The base editing plasmids can be stored at −20°C for long term storage and can be used for future transfection experiments.\nCell culture and transfection of FusXTBE arms\nTiming: ∼1 week\nCell culture.\nThe protocol described below provides the steps for maintaining HEK293T cells, including how to start a cell culture from frozen vials of cells in cryogenic storage. Similar procedures can be used for HT1080 cells as well.\nThaw cryopreserved cells by putting the cryogenic vials in a 37°C water bath. Spray the thawed vial with 70% ethanol and wipe carefully to reduce the possibility of contamination. Transfer thawed liquid contents into a 10 mL conical tube prefilled with 9 mL fresh complete culture medium (DMEM supplemented with 10% fetal bovine serum and 1% Pen-Strep).\nCollect cells for plating.\nCentrifuge at 500 × g for 5 min, discard the supernatant, and resuspend the cells in 1 mL of fresh DMEM supplemented with 10% fetal bovine serum and 1% Pen-Strep.\nPlate ∼1–2 × 106 cells in a T75 flask and incubate cultures at 37°C.\nPassage the HEK293T cells upon 80%–90% confluency (it usually takes 4–6 days). Subculture ratio is 1:10.\nNote: Culture medium should be prewarmed to 37°C before use.\nCell preparation for transfection.\nCell dissociation before plating.",
    "Discard culture medium and subsequently rinse the adhered cells with PBS. Aspirate PBS and add 3 mL 0.25% Trypsin solution (with EDTA) to the T-75 flask and incubate at 37°C for ∼5 min.\nTap the flask gently on the side to dislodge the cells completely and add 7 mL of DMEM to the flask to deactivate the Trypsin. Transfer the cells to a 15 mL conical tube (Tube A).\nCount the cells/mL by using a hemacytometer.\nAlternatives: Automated cell counters such as ThermoFisher Scientific Countess 3 FL Automated Cell Counter (Catalog# AMQAF2000) can be used for cell counting.\nSeeding of cells at a suitable density.\nTypically, for the base editing experiments in a 6-well plate, take 18 mL of DMEM in a 50 mL conical tube and add media from tube A containing ∼1.8 × 106 cells. Mix the sample gently and transfer about 3 mL of media into each well (∼0.3 × 106 cells/well). Incubate cells at 37°C for 14–16 h in 5% CO2 incubator. The number of 6-well plates can be scaled up according to the needs of the experiments.\nBy the next day, the cells should be at 70%–80% confluent in each well and ready for transfection.\nNote: To save time, cell culture and seeding can be started ahead of time so that plasmids can be transfected immediately after sequence verification.\nNote: Alternatively, cells can be seeded on 24 or 48-well plates. Seeding density should be adjusted accordingly.\nTransfection with FusXTBE plasmids.\nThe following steps describe the detailed procedures for using Lipofectamine 3000 to transfect HEK293T cells with the FusXTBE left and right arms plasmid DNA.\nAdd 1.2 μg (0.6 μg per arm) of FusXTBE plasmid DNA to a microcentrifuge tube, adjust the volume to 122 μL with Opti-MEM and add 3 μL of P3000 Reagent.",
    "Add 120 μL Opti-MEM and 5 μL lipofectamine 3000 to a separate microcentrifuge tube.\nMix the contents of both tubes thoroughly by pipetting up and down. Spin briefly.\nIncubate the transfection mix at room temperature (∼25°C) for 10–15 min.\nAdd the transfection mix to the cells dropwise, swirl the plate to evenly distribute the mixture, and incubate the cells for at 37°C.\nAfter 10 h of transfection, exchange media with fresh culture medium.\nNote: The aforementioned transfection protocol is suitable for a single well from a 6-well plate (with a surface area of 9.6 cm2). If larger or smaller wells are used, the recipe should be adjusted accordingly.\nHarvest cells 4–6 days post transfection for genomic DNA isolation.\nPause point: The cells can be stored at −80°C until genomic DNA isolation.\nNote: Transfection of each pair of FusXTBE plasmids should be done in triplicate.\nNote: Untransfected control (wild type) should be set up and cells should be collected. We recommend setting up a positive transfection control by transfecting with a GFP plasmid for easy transfection confirmation.\nNote: The amount of plasmid DNA used may need to be decreased or increased to achieve the best editing efficiency.\nSequencing readout of C-to-T editing\nTiming: 2 days\nThis final section will describe the genomic DNA isolation from the cells, followed by genotyping to interrogate for C-to-T edits in the protospacer region.\nMitochondrial DNA isolation.\n4–6 days post transfection aspirate the media, wash with 1 mL of PBS and trypsinize the cells by adding 300 μL trypsin to each well.\nAdd 300 μL of DMEM and transfer the contents to 1.5 mL tubes.\nSpin the tubes at 300 × g for 5 min. Discard the supernatant and aspirate the residual media from the tubes.",
    "Subsequently, we isolate the genomic DNA from the cells by using DNeasy Blood & Tissue Kit (QIAGEN) following the manufacturer’s instructions. (DNeasy Blood & Tissue Handbook).\nAlternatives: Different genomic DNA isolation kits like ThermoFisher’s PureLink Genomic DNA Mini Kit (Cat#K182001) or NEB’s Monarch Genomic DNA Purification Kit (Cat#T3010S) can be used.\nPause point: Extracted DNA can be stored at −20°C until use.\nValidation of C-to-T editing.\nTo validate C-to-T editing, perform PCR to amplify the region around the protospacer. Prepare the PCR and mix by pipetting up and down 5–10 times.\ntable:files/protocols_protocol_1575_9.csv\nRun the following PCR cycle.\ntable:files/protocols_protocol_1575_10.csv\nAlternatives: Different high-fidelity polymerases, such as NEB’s Phusion High-Fidelity DNA Polymerase enzyme (Cat. No. M053S) or ThermoFisher’s AccuPrime Taq DNA Polymerase (Cat. No. 12346086) can be used.\nExtract PCR-amplified target DNA of each sample from the 1% agarose gel with QIAquick Gel Extraction Kit from QIAGEN (Cat#28706).\nAlternatives: Different gel extraction kits, such as NEB’s Monarch DNA Gel Extraction Kit (Cat#T1020L) can be used. Alternatively, PCR clean up kits can be used if only a single, clean amplicon is present.\nOptional: Measure DNA concentration using a NanoDrop UV-Vis spectrophotometer.\nPause point: PCR amplicons can be stored at −20°C until further use.\nSubmit the DNA sample for Sanger sequencing, using the forward or reverse PCR primer as the sequencing primer.\nAs a negative control, sequence DNA from wild type cells (with no FusXTBE transfection).\nPause point: Analysis of Sanger sequencing data can be conducted at any time.\nEvaluate C-to-T base editing efficiencies from Sanger sequencing results using EditR (Kluesner et al., 2018[href=https://www.wicell.org#bib5]).\nObtain Sanger sequencing reads in .ab1 extension format.\nOptional: Directly visualize the Sanger sequencing traces using a program such as SnapGene.\nVisit the EditR website (https://moriaritylab.shinyapps.io/editr_v10/[href=https://moriaritylab.shinyapps.io/editr_v10/]).\nEnter the protospacer region as the gRNA sequence for analysis.",
    "Upload the .ab1 sequencing file for the intended sample under “Upload .ab1 File”.\nIf the .ab1 sequencing file is generated by using the reverse primer in Sanger sequencing sample, tick the “Guide sequence in reverse complement” option.\nPress the “Predicted Editing” button in the upper panel section to evaluate C-to-T base editing at the target site.\nThe editing report can be downloaded by clicking on “Download Report”.\nNote: To evaluate the off-target edits across the amplicon, 10–15 nucleotide length regions around the protospacer region can be entered as gRNA sequence for analysis.\nNote: Usually, we observe baseline heteroplasmy using EditR. We recommend confirming the edits by doing next generation sequencing to assess the edited frequency of TC-to-TT in each allele after observing significant base editing from Sanger sequencing data. We use the NGS: AMPLICON-EZ service by Genewiz.\nNote: At this time, we don’t recommend the regular passaging of edited cells as the percentage of heteroplasmy may go down. For any down-streaming experiment that requires edited cells carrying a specific level of heteroplasmy, the expectation is the fresh preparation of cells after editing without long-term passaging of the cells."
  ],
  "subjectAreas": [
    "Crispr",
    "Cell Biology",
    "Genetics",
    "Molecular Biology",
    "Sequencing"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}