{
  "id": 3270,
  "origin_website": "Cell",
  "title": "A protocol for high-throughput screening for immunomodulatory compounds using human primary cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThawing cryopreserved cells\nTiming: 45 min\nUsing cryopreserved rather than fresh blood samples enhances throughput as cryopreserved cells can be kept in long term storage with a relatively small decline in cell viability.3[href=https://www.wicell.org#bib4],4[href=https://www.wicell.org#bib5] In theory, fresh cells may be alternatively utilized, though this may limit longitudinal validation experiments across study participants. For all steps in this experiment, attention to the potential toxicity of the reagents (Figure 1[href=https://www.wicell.org#fig1]) is important.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2862-Fig1.jpg\nFigure 1. Recommended safety procedures\nPictograms represent the Globally Harmonized System of Classification labels that accompany each compound. Recommended safety handling procedures are depicted. A more thorough handling guideline as well as additional hazards may be found through the safety data sheet for each chemical.\nFully thaw autologous platelet poor plasma (PPP) in 15 mL tube in 37°C water bath.\nNote: Fully autologous PPP can be isolated from whole blood by collecting the supernatant from platelet rich plasma spun down at 3000 g for 10 min (high acceleration/medium deceleration) as described.2[href=https://www.wicell.org#bib2]\nCentrifuge thawed plasma at 3000 g for 8 min (high acceleration / medium deceleration).\nNote: Utilizing lower to medium deceleration in this step ensures proper separation of any solid particulates that may be isolated from the thawed plasma.\nTransfer supernatant of the centrifuged plasma to new 15 mL tube under sterile conditions.\nNote: Avoid collecting any sediments (e.g., white pellet) at the bottom of the tube.\nThaw human PBMCs (5 e7/mL) in 37°C water bath.\nTransfer 1 mL of the PBMC from its 2 mL cryotube to new 50 mL tube under sterile conditions.\nUse 2 mL of autologous PPP to collect any remaining cells on the side of the cryotube and transfer this PPP to the 50 mL tube.",
    "Add 27 mL of Dulbecco’s Modified Eagle Medium (DMEM) to the PBMC/plasma mixture in the 50 mL tube.\nMedia stocks are stored at 4°C until expiration and diluted media kept at 4°C for day of use.\nNote: This constitution can be scaled up if more cells are needed for a 10% cells/plasma and 90% DMEM composition. Additionally, a plasma-supplemented media is used because plasma contains age-specific soluble mediators of immunity that can contribute to relevant leukocytic responses.5[href=https://www.wicell.org#bib6] While alternative, commercial serums can be utilized, this may affect the accurate capture of these responses.\nCentrifuge cells at 500 g for 10 min (high acceleration / medium deceleration).\nWhile cells are centrifuged, create a freshly prepared media composition of 50 mL with 10% autologous PPP and 90% DMEM.\nDiscard supernatant from centrifuged cells and resuspend cell pellet with 10 mL of media.\nDilute samples 1:10 in trypan blue (10 μL cells + 90 μL 0.4% trypan blue) and count cells.\nNote: Bear in mind typical cell loss is 40–70% from each freeze-thaw cycle.\nDilute cells to 1.67 e6 cells/mL, which will allow distribution of 50,000 cells/well. Keep cells on ice until ready for use.\nDilute assay-specific controls (e.g., DMSO for negative control, R848, ODN-2395) in media for manual addition later in step 18. The dilution of DMSO should be calculated to match the concentration in experimental wells.\nPinning compounds and controls\nTiming: 1 h + 72-h incubation\nPinning compounds allow for a rapid plating of experimental conditions, which is optimal for a high-throughput framework.\nWash a standard-bore Combi cassette with 50 mL of sterile water for irrigation (St. H2O) followed by a 50 mL ethanol (EtOH) wash, and another wash with 50 mL of St. H2O using the Multidrop™ Combi Reagent Dispenser.",
    "Note: Conduct all steps utilizing reagent or cell dispensing with the Combi reagent under sterile conditions to limit contamination.\nPrime approximately 10–15 mL of the cell suspension through the manifold.\nPrior to dispensing cells to each microplate, lightly agitate the cell suspension to ensure the cells stay in solution and do not settle.\nNote: Solutions dispensed using the Combi cassette are primed to prevent dilution from adherent fluids in the cassette from previous washes.\nDispense 30 μL per well to 384-well Corning 3656 microplates (Corning, Corning, NY) on the low-speed setting to ensure minimal cell loss.\nNote: The Combi equipment can be adapted to fill plates partially in the settings of the machine, allowing for adjustments in the case of limited reagent/cell availability.\nWash the Combi cassette with 50 mL of St. H2O, followed by a 50 mL EtOH wash, and another wash with 50 mL of St. H2O using the combi reagent dispenser.\nTransfer 100 nL of compound from source library plates into the destination cell plates using the Seiko Compound Pin Transfer Workstation, allowing for a final concentration of 33 μM for our selected library plate.\nNote: This volume transfer can be optimized for different library plates. Each library plate was tested over four biological replicates with two technical replicates per donor.\nManually add 5 μL of positive and negative controls to each plate on designated wells that do not have experimental compounds pinned into them, using a multichannel pipette.",
    "Note: R848 and ODN-2395 serve as strong positive controls while DMSO, which is a typical solvent of choice for chemical libraries, serves as an effective negative control. The controls are manually added in this step because many library plates do not have positive controls on them so they need to be directly added to cell plates. There are minimal differences found between manually added and pinned positive controls (Figure 4[href=https://www.wicell.org#fig4]). While this manual addition is feasible for positive controls, automated addition of experimental compounds allows for scalability of this protocol to assay 10–30 library plates at a time.\nCover and incubate plate for 72 h in 37°C, 5% CO2 humidified incubator.\nNote: Chemical screening libraries are often produced from diverse sources. This protocol is optimized for commercially available, small molecule libraries that were dissolved in DMSO. Thus, we used DMSO at 1% as a negative control to match the precise diluent used for screening. This would be used to asses any background activity that may have been caused due to the solvent on the screened cells. For other libraries, the selection and volume of negative control should be optimized to match experimental conditions.\nFixation and staining of cells\nTiming: 4.5 h\nFixation of cells limits cell degradation and decomposition, enabling preservation of cell protein structures.6[href=https://www.wicell.org#bib7] This is particularly important for flow cytometry readouts.7[href=https://www.wicell.org#bib8] In this high throughput context, fixation is imperative to prevent cell atrophy and to capture accurate cell activation.\nCentrifuge plate at 500 g for 10 min (9 g acceleration, 7 g deceleration).\nAspirate 2 μL of supernatant from each well on the cell plate\nDispense into a labeled PerkinElmer AlphaPlate-384 (#6005359) using the Agilent VPrep.\nRepeat this 2 μL transfer process into another labeled AlphaPlate.",
    "Note: Supernatant is harvested prior to staining and is analyzed for cytokine quantification starting at step 54.\nReplace the cover the cell plate and store at 4°C, while completing supernatant transfer for any remaining cell plates. This is to minimize additional cell death or degradation for larger throughput experiments.\nSeal the two AlphaPlates with aluminum seals and store overnight at −80°C.\nRemove the cell plate from 4°C storage and centrifuge at 700 g for 10 min. Flick the supernatant off.\nNote: Flick the supernatant off only once after centrifugation. This is to prevent excessive cell loss. If a considerable amount of supernatant is retained in some wells, re-centrifuge the plate before flicking again.\nWash a standard-bore Combi cassette with 50 mL St. H2O, followed by a 50 mL EtOH wash, and 50 mL St. H2O wash using the Combi.\nDilute 500 mM EDTA 1:2 with PBS to generate a 250 mM stock of EDTA. Keep the 250 mM EDTA solution on ice.\nPrime approximately 10–15 mL of the 250 mM EDTA through the manifold, then dispense 20 μL per well.\nWash the standard tube cassette with 50 mL distilled water, followed by a 50 mL ethanol wash, and another wash with 50 mL distilled water using the Combi.\nShake covered cell plate at 700 rpm for 10 min at room temperature.\nCentrifuge plate at 750 g for 10 min (9 g acceleration, 7 g deceleration) at room temperature.\nWhile plate is centrifuged, dilute antibody cocktail 1:200 in dPBS by volume. Prepare 2 mL of cocktail per plate with 10–15 mL excess for priming and deadweight loss.\nAntibody cocktail is stored at 4°C until expiration.",
    "Attach and wash a small-bore Combi cassette with 30 mL St. H2O, followed by a 30 mL EtOH wash, and 30 mL St. H2O wash using the Combi.\nPrime approximately 5–10 mL of the antibody solution through the cassette, then dispense 5 μL per well.\nWash the small-bore Combi cassette with 30 mL St. H2O, followed by a 30 mL EtOH wash, and 30 mL St. H2O wash using the Combi.\nIncubate cell plate at 4°C for 30 min during antibody incubation.\nAttach and wash a standard-bore Combi cassette with 50 mL St. H2O, followed by a 50 mL EtOH wash, and another wash with 50 mL St. H2O using the Combi.\nPrime approximately 10–15 mL of PBS through the cassette, then dispense 40 μL per well.\nCentrifuge plate at 750 g for 10 min (9/7 g acceleration and deceleration).\nWash the standard-bore Combi cassette with 50 mL St. H2O, followed by a 50 mL EtOH wash, and another wash with 50 mL St. H2O using the Combi.\nWhile plate is centrifuged, dilute 16% PFA to 1% PFA in dPBS, calculating for 10 mL per plate and an excess 10–15 mL for priming and deadweight loss.\nWhen plate finishes centrifugation, flick the supernatant off.\nPrime approximately 10mL of 1% PFA through the cassette, then dispense 25 μL per well.\nWash the standard-bore Combi cassette with 50 mL St. H2O, followed by a 50 mL EtOH wash, and another wash with 50 mL St. H2O using the Combi.\nIncubate the cell plate at 4°C during cell fixation.",
    "Pause point: The cell plates can be kept covered with plate lids in this fixative solution up to a week. We avoid keeping the cells in this condition longer than 7 days and recommend shorter storages when using tandem dye conjugated antibodies. This fixation step can be alternatively skipped if the flow cytometry can be run immediately. However, at large enough throughputs, we recommend fixating your cells to prevent undesirable cell death or degradation.\nFlow cytometry\nTiming: 30 min to 1 h\nHigh throughput flow cytometry is now compatible with multiplexed cell-based screening.8[href=https://www.wicell.org#bib9] This is particularly useful for immunological screening with diverse cell types such as PBMCs. We measured the presence of cell-surface activation markers for each of our profiled cell types (CD80/86 and HLA-DR for Monocytes and B cells, OX40 for T Cells) to detect any general innate immune responses that the screened compounds induced (Figure 2[href=https://www.wicell.org#fig2]). Alternatively, the panel of antibodies can be tailored to the focus of different screening efforts. However, the REAffinity antibodies used in this protocol prevent their binding to Fc receptors. Thus, if other antibodies are used, blocking steps may be necessary to prevent non-specific binding. Similarly, antibodies should be carefully selected and assessed for potential spectral overlap of fluorophores, in which case compensation should be performed.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2862-Fig2.jpg\nFigure 2. Representative schematic of the high throughput flow cytometry system\nA total of 5 μL of antibodies diluted 1:200 in PBS were added to each well containing 30 μL of cells (50,00 cells/well). This flow cytometry system captures the total events or cells per well in addition to the antibody activity, which measures markers including the surface receptors Ox40, CD80/86, and HLA-DR. The flow cytometry approach also identifies B cells, T cells, and monocytes.",
    "Retrieve cell plates from 4°C storage and centrifuge at 750 g for 10 min (9/7 g acceleration and deceleration).\nWhen plate finishes centrifugation, flick the supernatant off.\nNote: This step can be alternatively skipped to reduce cell loss in aspiration steps if proper disposal of PFA can be arranged for the waste content from the flow cytometry.\nWash a standard-bore Combi cassette with 50 mL St. H2O, followed by a 50 mL EtOH wash, and 50 mL St. H2O wash using the Combi.\nPrime approximately 10 mL of PBS through the cassette, then dispense 25 μL per well.\nCentrifuge plate at 750 g for 10 min (9/7 g acceleration and deceleration).\nWhen plate finishes centrifugation, flick the supernatant off.\nUsing the Combi, dispense 20 μL of PBS per well.\nWash the standard-bore Combi cassette with 50 mL St. H2O, followed by a 50 mL EtOH wash, and 50 mL St. H2O wash using the Combi.\nAssess plates on the iQue to collect flow cytometry results.\nNote: One of the added benefits of using this set-up is the throughput of the IQue Flow Cytometer, as each cell plate can be ideally run in less than an hour. Alternatively, other flow cytometers may be used, though with elongated flow collection periods that may limit throughput.\nAlphaLISA assay\nTiming: 2.5 h\nAlphaLISA assays demonstrate a unique rapidity and ease of use.9[href=https://www.wicell.org#bib10] This makes it uniquely compatible in a high throughput setting for cytokine induction measurements. We used detection of TNF-α, IFN-λ, and IL-10 secretion as a broad panel to capture induction of innate immune responses (Figure 3[href=https://www.wicell.org#fig3]). Alternatively, this panel of cytokines may be adapted to fit the focus of other screening efforts.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2862-Fig3.jpg\nFigure 3. Representative schematic of the AlphaLISA assay system",
    "A total of 8 μL of acceptor bead solution, containing biotinylated antibodies as well as acceptor beads, were added to each well containing 2 μL of supernatant. After a 1 h incubation, a 10 μL solution of Streptavidin donor beads were added to this solution and incubated for 30 min. Both beads are manufactured to be specific to a binding site for the cytokine of interest. When read on the EnVision Plate Reader, bound donor and acceptor beads, due to their proximity, will emit a 615 nm luminescence when excited by a 680 nm wavelength. The intensity of this luminescence reflects the concentration of bound beads or the concentration of the cytokine.\nPause point: The AlphaPlates can be kept at −80°C up to two weeks. We typically conduct the assays on these plates the next day to increase throughput and enable real-time monitoring of assay performance.\nPrepare AlphaLISA buffers and the AlphaLISA Acceptor beads + Biotinylated Antibody mixtures for each cytokine of interest.\nPrepare 15 mL of extra reagent for priming on the Combi as well as potential deadweight volume loss.\nAlphaLISA assay systems are stored at 4°C until expiration and any dilutions are prepared immediately prior to conducting the assay.\nReconstitute AlphaLISA standards in 100 μL of MilliQ water and prepare standard dilutions as described in the AlphaLISA protocols.\nManually add 2 μL of standards on a new AlphaPlate using a multichannel pipette.\nNote: The volume of standard added per well was scaled down to 2 μL to match the volume of supernatant being tested. This enables consistent reagent dispensing.\nRetrieve AlphaPlates with supernatant from −80°C storage and remove aluminum seal.\nWash a small-bore Combi cassette with 30 mL St. H2O, followed by a 30 mL EtOH wash, and 30 mL St. H2O wash using the Combi.",
    "Prime approximately 10 mL of the Acceptor beads+ Biotinylated Antibody mixture through the cassette, then add 8 μL per well.\nRepeat steps 5–6 for each cytokine/AlphaLISA kit of interest.\nAllow the AlphaPlates to incubate at room temperature for an hour.\nNote: AlphaLISA kits are light sensitive so incubate in the dark without sealing the plates.\nWash a different small-bore Combi cassette with 30 mL St. H2O, followed by a 30 mL EtOH wash, and 30 mL St. H2O wash using the Combi.\nPrepare Streptavidin Donor Beads for each cytokine of interest in the dark, as described in their published protocols.\nPrepare 10 mL for priming on the Combi as well as potential deadweight volume loss.\nPrime approximately 5–10 mL of donor beads through the cassette, then add 10 μL per well.\nAllow the AlphaPlates to incubate at room temperature in the dark for 30 min.\nQuantitate fluorescent signal in each well using the EnVision to determine cytokine levels in the supernatant.\nNote: The following apertures must be used: Mirror Module = Barcode 444, EMS filter = Barcode 244 (570 nm)."
  ],
  "subjectAreas": [
    "Immunology",
    "Biotechnology And Bioengineering",
    "Flow Cytometry",
    "Cell-Based Assays",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology"
  ]
}