{
  "id": 10046,
  "origin_website": "Jove",
  "title": "Three-Dimensional Culture of Vascularized Thermogenic Adipose Tissue from Microvascular Fragments",
  "procedures": [
    "This study was conducted in compliance with the Animal Welfare Act and the Implementing Animal Welfare Regulations in accordance with the principles of the Guide for the Care and Use of Laboratory Animals. All animal procedures were approved by the Institutional Animal Care and Use Committee at the University of Texas at San Antonio.\nNOTE: For the steps described below, male Lewis Rats are utilized. Slight protocol adjustments must be made for a female, as well as mouse microvascular fragment (MVF) collection29. For protocols using human MVFs (h-MVFs), the only steps required are the resuspension of h-MVFs following the manufacturer's protocol, growth media preparation (1.3), formation of fibrin hydrogels (5), and culturing (6). For an overview of the protocol, please see Figure 1.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64650/64650fig01.jpg\nFigure 1: Experimental outline. Breakdown of six key steps, prior to analysis, for the formation of thermogenic adipose tissue using MVF. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64650/64650fig01large.jpg]\n1. Reagent preparation\nNOTE: Reagents below correspond to one rat, weighed and made inside a biohood.\nPrepare bovine serum albumin (BSA) in PBS.\n\t\nPrepare 10 mg/mL (1.0%) BSA in PBS to be diluted for wash steps (1 mg/mL, 0.1%) and digestion (4 mg/mL, 0.4%).\nPrepare different concentrations of BSA, as mentioned in step 1.1.1, following steps 1.1.3-1.1.5.\n10 mg/mL BSA in PBS (1% BSA in PBS)\n\t\t\nAdd 500 mg of BSA and 500 mL of PBS to a 50 mL conical tube and vortex the solution to dissolve the BSA.\nIf excessive bubbles form, centrifuge the solution at 350 x g for 2 min. Filter sterilize the solution with a 0.22 µm nylon net filter.\n1 mg/mL BSA in PBS (0.1% BSA in PBS)",
    "Dilute 15 mL of 10 mg/mL BSA in PBS 1:10 with PBS by adding 15 mL of 10 mg/mL BSA in PBS to 135 mL of PBS in a 500 mL sterile bottle and gently shake the bottle to ensure a homogenous mixture.\n4 mg/mL BSA in PBS (0.4% BSA in PBS)\n\t\t\nDilute 35 mL of 10 mg/mL BSA in PBS 1:2.5 with PBS by adding 35 mL of 10 mg/mL BSA in PBS + 57.5 mL of PBS in a 100 mL sterile bottle and gently shake bottle to ensure a homogenous mixture.\nPrepare collagenase in BSA for the digestion of minced fat pads.\n\t\nPrepare 6 mg/mL collagenase.\n\t\t\nIn a 50 mL conical tube, weigh 72 mg of collagenase (label \"for Epi\").\nIn three 50 mL conical tubes, weigh 144 mg of collagenase (label \"for Ing 1\", \"for Ing 2\", and \"for SubQ\") each.\nStore the weighed out collagenase at 4 ˚C until use.\n\t\t\tNOTE: Do not add BSA/PBS until right before digestion.\nAdd 12 mL of 4 mg/mL BSA in PBS to the tube containing 72 mg of collagenase.\nAdd 24 mL of 4 mg/mL BSA in PBS to the tubes containing 144 mg of collagenase.\nShake the tubes to ensure a homogenous solution and filter sterilize the solution with a 0.22 µm nylon net filter.\nPrepare growth media supplemented with Aminocaproic Acid (ACA) to feed/differentiate the isolated MVF.\n\t\nGrowth media (GM): Supplement DMEM with 20% FBS, 1% penicillin-streptomycin (pen strep), 0.2% mycoplasma prophylactic, and 1 mg/mL ACA.\nPrepare white adipogenic media (WAM).\n\t\t\nWAM induction: Supplement DMEM/F12 with 20% FBS, 1% pen strep, 0.2% mycoplasma prophylactic, 10 µg/mL insulin, 10 µm of forskolin, 1 µm of dexamethasone, and 1 mg/mL ACA.\n\t\t\tNOTE: For h-MVFs, in addition, add 125 µM of indomethacin.",
    "WAM maintenance: Supplement DMEM/F12 with 20% FBS, 1% pen strep, 0.2% mycoplasma prophylactic, 5 µg/mL insulin, and 1 mg/mL ACA.\n\t\t\tNOTE: For h-MVFs, change the insulin concentration to 10 µg/mL.\nPrepare beige adipogenic media (BAM).\n\t\t\nBAM induction: Supplement DMEM/F12 with 20% FBS, 1% pen strep, 0.2% mycoplasma prophylactic, 10 µg/mL insulin, 10 µm of forskolin, 1 µm of dexamethasone, 1 µm of rosiglitazone, 20 nM 3,3′,5-Triiodo-L-thyronine (T3), and 1 mg/mL ACA.\n\t\t\tNOTE: For h-MVFs, change the concentration of T3 to 120 nM.\nBAM maintenance: Supplement DMEM/F12 with 20% FBS, 1% pen strep, 0.2% mycoplasma prophylactic, 5 µg/ml insulin, 10 µm of forskolin, 1 µm of rosiglitazone, 20 nM T3, and 1 mg/mL ACA.\n\t\t\tNOTE: For h-MVFs, change the insulin concentration to 10 µg/mL and the T3 concentration to 120 nM.\nPrepare thrombin (only need to be made if the stock aliquoted solution is not available) to make the clotting agent to be used in fibrin gels.\n\t\n10 U/mL thrombin in ddH2O:\n\t\t\nResuspend thrombin powder using 1-5 mL of ddH2O in the vial from the manufacturer and transfer the resuspension to a 250 mL beaker.\nBring up the solution to 100 mL and pipet the solution up and down numerous times to ensure a homogenous mixture. Aliquot the solution into 15 mL conical tubes (~10 mL/tube) and store the aliquots in a -20 ˚C freezer.\n\t\t\tNOTE: To use, thaw the thrombin at room temperature (RT).\n2. Tool/materials preparation\nNOTE: All instrumentation should be autoclaved/sterilized prior to use.\nEpididymal/inguinal/subcutaneous fat isolation (surgery to be done in a defined surgical area)\n\t\nEnsure the availability of disposable underpads, two scissors, one hemostat (optional), two forceps, and four 50 mL conical tubes with 10-15 mL of 1 mg/mL BSA (0.1%) in PBS.\nMicrovascular fragment isolation",
    "For mincing (to be done in a biohood), ensure the availability of three uncoated sterile 100 mm Petri dishes, one pair of forceps, and one pair of curved scissors.\nFor digestion and isolation (to be done in a biohood), ensure the availability of one pair of scissors, one pair of forceps, eight uncoated sterile 100 mm Petri dishes, three uncoated sterile 35 mm Petri dishes, collagenase weighed and at 4 ˚C, four 250 mL flasks, one plastic holder with a hole at the center, four 500 µM screens (cut into 3 in rounded squares), four 37 µM screens (cut into 3 in rounded squares), and 11 50 mL conical tubes.\nFibrin resuspension\n\t\nFor fibrin hydrogels (to be done in a biohood), ensure that fibrinogen, thrombin, and growth media (made during reagent preparation) are available.\n3. Fat isolation protocol\nPreliminary steps\n\t\nFill a beaker with ethanol to wash and sanitize the surgical instruments before using them. Next, prepare the table for handling the rat and have a vacuum ready to aspirate the fur generated during the shaving step.\nPrepare a bucket with ice where the previously prepared 50 mL conical tubes, each containing 10 mL of 1 mg/mL BSA, will be placed. Label the tubes accordingly.\n\t\tNOTE: It might be necessary to have two separate conical tubes for the inguinal fat, since two sides need to be extracted and the amount of fat gathered from this region tends to be the largest compared to epididymal and posterior subcutaneous.\nStart with a euthanized rat in the defined surgical area with the required surgical tools. Generally, CO2 is used to euthanize the rats following IACUC protocols.",
    "Using hair clippers, shave the rat around the area of interest. Specifically, shave between the groins and half of the abdomen for epididymal and inguinal fat isolation (use the smaller shaver for the fur in this region). Shave the entire back to get the posterior subcutaneous fat located between the scapulas (it is best to use a larger shaver as the fur is thicker on the backside of the rat).\nAseptically prepare the rat by spraying it down with 70% ethanol. Generally, it is recommended to clean the area that is going to be cut twice.\nIsolation of different fat depots\n\t\nInguinal (subcutaneous)\n\t\t\nIn the supine position, lift the skin below the penis with a pair of scissors. Begin the incision with scissors, starting in the center and cutting laterally, forming a \"V\" shape and looping to the rat's backside to access the entire fat depot. Remember to cut superficially so that the fat below is intact. During the cutting step, ensure the separation of the skin from the fat by cutting the interconnected fascia tissue (Figure 2A).\nOnce the fascia is appropriately cut, ensure that the two sides of the inguinal fat are visible (the inguinal fat extends from the groin area toward the back). Next, remove the fat from the two sides in two separate conical tubes containing 10 mL of 1 mg/mL BSA (Figure 2B).\nEpididymal (visceral)\n\t\t\nHarvest the epididymal fat by cutting through the abdominal skin and carefully through the thin layer surrounding the testicles (Figure 2C).\nWith forceps, gently pull the fat tissue out and cut it out using scissors. Avoid dissecting any major visible blood vessels (should the testis and epididymis be harvested, remove them during the cleaning step in the biohood).",
    "Carefully place the removed fat into a 50 mL conical tube with 10 mL of 1 mg/mL BSA in PBS.\n\t\t\tNOTE: The removal of the epididymal fat should be done after the inguinal fat has been removed. The epididymal fat is generally smaller in volume and located below the inguinal fat, below the abdominal skin surrounding the testis and epididymis.\nPosterior subcutaneous\n\t\t\nTurn the rat prone (dorsal side up) and, using large scissors, cut the skin of the back (the skin in this region is thick) all the way up to the scalp, taking care not to cut too deep, just below the skin (Figure 2D).\nCut the fascia connecting the skin to the tissue; the fat is located in the interscapular region. Make a note to differentiate/separate the subcutaneous fat from the brown fat. The brown fat is closer to the spine (Figure 2E).\nIsolate and place the fat in the corresponding 50 mL conical tube(s) with 10 mL of 1 mg/mL BSA in PBS.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64650/64650fig02.jpg\nFigure 2: Isolation of different adipose tissue depots. (A) Initial incisions needed for excision of the inguinal adipose tissue. (B) Location of the inguinal fat depot. (C) Location of the epididymal fat depot, noting incision of the outer skin needed for access. (D) Additional incisions needed once the mice are placed prone to access additional fat. (E) Location of the posterior subcutaneous fat depot. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64650/64650fig02large.jpg]\n4. Microvascular fragment isolation protocol\nPlace 50 mL conical tube(s) containing excised fat from the rat into biohood.\nUsing forceps, place the fat in a standard 100 mm Petri dish (with ~0.5 mL of 1 mg/mL BSA in PBS to keep the tissue hydrated).\nClean and remove any visible blood vessels and muscle/extraneous tissue from fat.",
    "Mince the fat with scissors for ~10 min (mince enough so that it can be transferred with a 10 mL pipet).\nCheck for lumps by adding ~0.5 mL of 1 mg/mL BSA in PBS; continue mincing if necessary.\nTransfer the minced fat to a sterile 250 mL flask with a 10 mL pipet.\n\tNOTE: Note the volume using a pipet.\nAdd enough BSA (1 mg/mL) so the final volume is 20 mL.\nAdd 4 mg/mL BSA in PBS to collagenase (collagenase final concentration: 6 mg/mL) (i. e., 12 mL for the 72 mg of collagenase or 24 mL for the 144 mg of collagenase).\n\tNOTE: Do not add until the mincing is complete as it is time sensitive.\nGently shake the conical tube to ensure a homogenous solution and filter sterilize the solution with a 0.22 µm nylon net filter.\nFor the epididymal fat, digest for ~8-10 min; for the inguinal and posterior subcutaneous fat, digest for ~15-20 min in a 37 °C water bath, shaking the flask in a circular motion throughout (stop at the moment the fat gets to where there are only a few clumps remaining).\nTransfer the digested fat into a 50 mL conical tube (there should be ~30 mL/tube), and label the tube as \"digested fat\".\nSpin the tube at 400 x g for 4 min; post spinning, the pellet must be red (Figure 3A).\nDuring the spin, place the sterile 37 µM screen and 500 µM screens in a sterile Petri dish with 5 mL of 1 mg/mL BSA in PBS to presoak before use.\nAfter the spin, decant the supernatant into a 50 mL conical tube labeled as \"waste\". Perform the decantation gently to remove the superficial fat and to not disturb the pellet made of MVFs.",
    "Add 10 mL of 1 mg/mL BSA in PBS to the tube containing the pellet (\"digested fat\"). Triturate (pipet up and down) the pellet 2x.\nAvoid being too rough on the pellet in order not to disrupt the fragments.\nPlace the 500 µM screen in a new Petri dish above the plastic screen holder (Figure 3B).\nPipet 10 mL from the \"digested pellet\" tube over a 500 µM screen using concentric circles (Figure 3C).\nWash the filter with an additional 5 mL of 1 mg/mL BSA in PBS. The desired cells will filter through into the Petri dish; therefore, discard the 500 µM screen but save the filtered liquid inside the Petri dish.\nPlace the 37 µM screen in a new Petri dish above the plastic screen holder.\nChange out the pipet to eliminate any clumps before using the 37 µM screen.\nPipet the liquid obtained from the first filtration over the 37 µM screen using concentric circles.\nWash the filter with an additional 5 mL of 1 mg/mL BSA in PBS. The desired cells will remain in the filter, therefore discard the filtered liquid, but save the 37 µM screen.\nSlide the 37 µM screen into a new Petri dish containing 5 mL of 1 mg/mL BSA in PBS.\nShake the dish by tapping it against a conical holder to dislodge the fragments. Do not shake too vigorously, as the liquid/cells may spill out of the Petri dish.\nRinse the filter with an additional 5 mL of 1 mg/mL BSA in PBS. The desired cells will remain in liquid solution in the Petri dish. Save the 37 µM screen and the dislodged fragment containing liquid inside the Petri dish for the following steps.\nTransfer the BSA + fragment containing liquid to a sterile 50 mL conical tube.",
    "Repeat rinsing of the 37 µM screen several more times (each time with ~5 mL of 1 mg/mL BSA in PBS) and add to the conical tube. Repeat until the total volume collected is ~15-20 mL. Ultimately, the desired cells will be collected from the liquid solution in the Petri dish and placed in a conical tube; at this point, discard the 37 µM screen after the final rinse but save the dislodged fragments containing liquid inside the 50 mL conical tube.\nClip the end off of a 200 µL pipet tip using scissors. Gently shake the 50 mL tube, remove two samples of 20 µL, and put them in a clean 35 mm Petri dish.\nCount the number of fragments in each sample in the Petri dish to obtain the total number of MVFs isolated.\n\tTotal Fragments = imgsrc://cloudfront.jove.com/files/ftp_upload/64650/64650eq01.jpg\nSpin the remaining dislodged fragment containing liquid in a 50 mL conical tube at 400 x g for 4 min to collect the MVF.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64650/64650fig03.jpg\nFigure 3: Isolation of MVFs. (A) Post digestion of the adipose tissue, depiction of the separation of MVFs containing pellet and supernatant following a spin-down. (B) Layout of supplies for filtration and entrapment of MVFs. (C) Illustration of the concentric circle method for filtration/washing steps. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64650/64650fig03large.jpg]\n5. Formation of fibrin hydrogels\nExample calculations:\n\tNOTE: Below are the calculations for MVFs seeded at ~15,000-20,000 MVF/mL and the fibrinogen:thrombin gel ratio at 2:5, with fibrinogen used at a 20 mg/mL concentration.\n\t\nFor making five 250 µL gels, a total volume of 1,250 µL is required. Always account for pipetting errors, therefore, make enough for 1.5 mL of gels.\n\t\t\nCalculate the volume of fibrinogen required as follows:\nimgsrc://cloudfront.jove.com/files/ftp_upload/64650/64650eq02.jpg, X1 = 428.57 µL of fibrinogen",
    "Calculate the volume of thrombin required as follows:\nimgsrc://cloudfront.jove.com/files/ftp_upload/64650/64650eq03.jpg, X2 = 1,071.43 µL of thrombin\nFor the required volume of 428.57 µL, make 500 µL of fibrinogen as follows:\n\t\t\t20 mg/mL * 0.5 mL = 10 mg of fibrinogen. Resuspend this in 500 µL of DMEM\nTo obtain each gel, calculate the volume of fibrinogen and thrombin as follows:\n\t\t\t\nFibrinogen:\nimgsrc://cloudfront.jove.com/files/ftp_upload/64650/64650eq04.jpg, X1 = 71.43 µL of fibrinogen (in DMEM) + MVF\nThrombin:\nimgsrc://cloudfront.jove.com/files/ftp_upload/64650/64650eq05.jpg, X2 = 178.57 µL of thrombin\nMVF fibrin gel casting\n\t\nDecant most of the liquid in the spun-down fragment in the 50 mL conical tube. Use a pipette to remove the small volume of liquid that catches on the rim of the conical tube.\nAdd thrombin into wells where gels will be made (Figure 4A).\nClip the end of a 200 µL pipet tip and resuspend the MVFs gently using fibrinogen to obtain a final density of ~15,000-20,000 MVF/mL once in the gel.\nClip the end of a 200 µL pipet tip and pipet MVF+Fibrinogen into the thrombin solution gently. Quickly pipet up and down to ensure a homogenous mixture. Repeat until all gels are made (Figure 4B).\nPlace the well plate(s) in an incubator (37 °C, 5% CO2) for ~15 min to allow for gel crosslinking (Figure 4C).\nAdd 100-150 µL of growth media to each well.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64650/64650fig04.jpg\nFigure 4: Formation of MVF fibrin gels. (A) A 5/7-part thrombin mixture gets pipetted into the corresponding well. (B) Next, with a clipped pipet tip (to not disturb MVFs), a 2/7-part fibrinogen+MVF mixture is pipetted into the well and gently mixed. (C) Lastly, all completed gels are placed into an incubator at 37 °C, allowing hydrogel to solidify fully before the media is placed on top. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64650/64650fig04large.jpg]",
    "6. Culturing conditions of MVFs\nFor culturing non-vascularized white and beige adipose tissue (+ GM Control), use the timelines19 shown in Figure 5.\nFor culturing of vascularized white and beige adipose tissue (+ GM Control), use the timelines19 shown in Figure 6.\nHydrogels should be maintained in an incubator (37 °C, 5% CO2) for the duration of culture for the study, with the media being changed every other day. For fixation and handling of samples for analysis, refer to previously published works16,19,20.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64650/64650fig05.jpg\nFigure 5: Timing for non-vascularized adipose tissue formation. This figure has been modified from Acosta et al.19. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64650/64650fig05large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/64650/64650fig06.jpg\nFigure 6: Timing for vascularized adipose tissue formation. This figure has been modified from Acosta et al.19. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64650/64650fig06large.jpg]Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}