{
  "id": 2015,
  "origin_website": "Cell",
  "title": "SARS-CoV-2 proteome microarray for COVID-19 patient sera profiling",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation of proteins\nTiming: 7 days\nBesides the E. coli expression system, to cover the proteome of SARS-CoV-2 as complete as possible, and to obtain proteins with post-translational modifications (PTM), especially glycosylation, recombinant SARS-CoV-2 proteins were also produced using yeast cell-free systems or mammalian cell expression systems from a variety of commercial sources. Here we describe the affinity purification procedure (key resources table[href=https://www.wicell.org#key-resources-table]).\nThe genes synthesized by Sangon Biotech (Shanghai, China) were cloned into pET32a or pGEX-4T-1 vector and transformed into E. coli BL21 strain. Express the recombinant proteins in E. coli BL21 by growing cells in 200 mL LB medium to an A600 of 0.6 at 37°C.\nInduce protein expression. Add 0.2 mM isopropyl-β-d-thiogalactoside (IPTG) before incubating cells for 16 h at 16°C.\nPrepare and re-suspend the cell pellets in lysis buffer, and lyse by a high-pressure cell cracker.\nCentrifuge the Cell lysates at 12,000 × g for 20 min at 4°C.\nAffinity purification. Purify the supernatants with Ni2+ Sepharose beads, then wash with lysis buffer and elute with buffer containing 10% glycerol, 50 mM Tris-HCl pH8.0, 500 mM NaCl and 300 mM imidazole.\nVerify the purified proteins by SDS-PAGE followed by western blotting using an anti-His antibody and Coomassie brilliant blue staining (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1499-Fig1.jpg\nFigure 1. Expected outcomes\n(A) The SARS-CoV-2 proteins included in this proteome microarray. The upper panel is western blotting with an anti-6×His antibody. The lower panel is Coomassie brilliant blue staining. These proteins were prepared and collected from different sources (Jiang et al., 2020[href=https://www.wicell.org#bib2]).\n(B) The image of the SARS-CoV-2 proteome microarray, which was incubated with Anti-6×His antibody followed by Cy5 labeled secondary antibody.",
    "(C) A image of serum sample profiling with the microarray same as in (B). Green, the 532 nm channel, IgG response; Red, the 635 nm channel, IgM response.\n(D) The correlations of the overall IgG and IgM signal intensities between two repeats probed with the same serum.\n(E) Construction of an antibody response landscape against SARS-CoV-2 proteome (Li et al., 2021c[href=https://www.wicell.org#bib6]).\n(F) Boxplots of IgG response for S1 and S2 proteins. The proteins labeled with bold and red were overexpressed in mammalian cell lines.\n(G) Two examples of microarray scanning results. The right panel shows a good example which has a clear background and the signals are not over-exposed or too weak. In contrast, the left panel shows a bad example.\n(H) The 16-well chamber.\nSome of recombinant SARS-CoV-2 protein were also collected from commercial sources (please see the key resources table[href=https://www.wicell.org#key-resources-table]).\nNote: Please refer to Jiang et al. (2020)[href=https://www.wicell.org#bib2] for more details.\nProtein microarray fabrication\nTiming: 2 days\nHigh quality microarray is essential to ensure the final results. The detailed process of fabricating the microarray is as follows.\nTransfer the proteins and controls to a 384-well plate.\nDilute the proteins and controls with Printing buffer (1× PBS with 25% glycerol) to a final concentration of 0.3 mg/mL.\nAdd the proteins into the predetermined wells of a 384-well plate. For the SARS-CoV-2 proteome, the layout of the array was set as 32 × 6 features, each protein was repeated for 3 spots (Figure 1[href=https://www.wicell.org#fig1]B). The appropriate volume range for each well is 10 μL–50 μL.\nNote: the volume range varies among different types of 384-well plates.\nAfter adding the protein samples, centrifuge the 384-well plate at 800 × g for 1 min at 4°C.\nNote: the plate with protein samples could be stored at −80°C for at least one year.",
    "Protein printing on microarray slide.\nUse the printer (Super Marathon) to print the proteins on to the PATH substrate slides according to the manufacturer’s instruction.\nNote: The website of the printer: https://www.arrayjet.co.uk/instruments/printers-in-detail[href=https://www.arrayjet.co.uk/instruments/printers-in-detail].\nIncubate the microarrays at 4°C with humidity less than 50% overnight (over 12 h) for complete immobilization of proteins on the microarray.\nPut the slides into the dedicated slide box (5 or 1 slide(s) per box), seal the box with Parafilm and store the box at −80°C.\nGAL (GenePix Array List) file generation.\nCreate an Excel file and mark the position of samples on the 384-well plate.\ntable:files/protocols_protocol_1499_7.csv\nCreate GAL file using the printer software (Marathon V 2.2).\nMicroarray quality evaluation. The purpose of this step is to detect whether all proteins are printed on the slides and whether the immobilized proteins are still active, so as to ensure that the subsequent sera profiling can be carried out.\nBlocking.\nTake out the microarrays from −80°C and leave them at 4°C for 30 min, then transfer them to room temperature for 15 min to enable temperature equilibrium.\nCritical: for PATH substrates, pay attention to sealing in the process of rewarming, avoid condensation on the slide surface.\nPrepare the blocking buffer (1× PBS with 3% BSA), add 30 mL blocking buffer to a container and kept at 25°C.\nFace down the microarray and immerse the barcode side into blocking buffer, while keep the other side out, then slowly lay down the microarray until it is completely immersed into the buffer. Gently shake the microarray to make sure the bubbles on the microarray surface are driven out, turn over the microarray and immerse it into buffer.\nNote: the whole process of this step should be slow and take at least 1.5 min to avoid trailing effect on the microarray.",
    "Shake the microarrays at 20–30 rpm/min on a shaker for 3 h at 25°C.\nWash and dry the microarrays.\nDiscard the blocking buffer. Add 20–30 mL 1× PBS into the container, keep shaking (20–30 rpm) for 5 min at 25°C.\nDiscard the PBS buffer. Add 20–30 mL 0.2× PBS into the container, keep shaking (20–30 rpm) for 5 min at 25°C.\nDiscard the PBS buffer. Add 20–30 mL ddH2O into the container, keep shaking (20–30 rpm) for 5 min at 25°C.\nPut the microarrays into the slide centrifuge SlideWashTM 8 with default parameters. Centrifuge the microarrays at 500 × g for 1–2 min to dry them.\nNote: the dried microarrays can be stored at 4°C in a sealed box.\nAntibody incubation.\nPrepare incubation buffer. Dilute the Anti-His antibody at 1:5000 in PBST buffer (0.1% Tween 20 in 1× PBS buffer).\nAdd 3 mL incubation buffer into the microarray slide container. Shake the container at 4°C and 20–30 rpm for 12 h.\nDiscard the incubation buffer. Add 5 mL PBST buffer and shake at 25°C for 5 min. Repeat this step for 3 times.\nSecondary antibody incubation.\nDilute Cy5 labeled Anti-Rabbit secondary antibody at a ratio of 1:1000 in PBST buffer.\nAdd the secondary antibody into the microarray slide container, shake at 25°C for 1 h.\nDiscard the incubation buffer. Add 5 mL PBST buffer and shake at 25°C for 5 min. Repeat this step for 3 times.\nDry the microarrays by centrifugation with SlideWashTM 8. Centrifuge the microarrays at 500 × g for 1–2 min.\nMicroarray scanning\nTurn on the microarray scanner Genepix 4200A and warm up for 15 min.",
    "Scan the microarray at both 532 nm (IgG) and 635 nm (IgM) channel. Recommended scanning parameters: 95% power, PMT 200-300. However, the optimal scanning parameters should be adjusted according to the overall signal intensity.\nAfter scanning is completed, save the two images as a single TIF file (Figure 1[href=https://www.wicell.org#fig1]B).\nSerum profiling\nTiming: 2 days\nBlocking. This step is same as the blocking step of quality evaluation.\nSera sample preparation. Centrifuge the tube with sera at 12,000 × g at 4°C for 20 min. Dilute the sera in incubation buffer which contains 1% BSA and 0.1% Tween 20 in 1× PBS (1:200).\nSample incubation.\nInstall a 16-well chamber on the microarray to physically separate the subarrays.\nDilute the sera sample and the positive control at a ratio of 1:200 with incubation buffer (1× PBS with 0.1% tween-20 and 1% BSA). (To our experience, the dilution could range from 1:50 to 1:1000, however, to balance foreground and background, 1:200 is the best dilution for serum profiling on protein microarray. Thus, in the COVID-19 study, we empirically chose 1:200).\nAdd 200 μL diluted serum sample to each subarray. For each microarray, the last two subarrays are added with incubation buffer (1% BSA in PBST) and the positive sera sample as blank control and positive control, respectively. The blank control is to monitor unexpected contaminations.\nIncubate the microarrays at room temperature (25°C) for 2 h.\nNote: Immediately record the sample number, including the block position and the slide number.\nWash the microarrays.\nRemove the sera from each subarray with a multichannel pipette, add 200 μL wash buffer (1× PBS with 0.1% tween-20), and pipette up and down for 10 times.\nRepeat the above step twice.",
    "Uninstall the 16-well chamber, place the microarrays in a container with ∼30 mL wash buffer. Keep the container on a shaker (90–100 rpm) at room temperature (25°C) for 10 min. Repeat this step twice.\nNote: Do not leave the surface of the slide dry.\nSecondary antibody incubation\nDilute the Cy3 labeled anti-Human IgG and Alexa Fluor 647 (635 nm excitation) labeled anti-Human IgM secondary antibody (1: 1000) with incubation buffer.\nDiscard the Wash buffer from the container and add 15 mL diluted secondary antibodies.\nKeep the container on a shaker (20–30 rpm) for 1 h at room temperature (25°C). Keep the microarrays shielded from light.\nNote: 1) if only one microarray is used, a smaller container would be suggested with a smaller incubation volume. 2) Depending on the isotypes of antibody of interest, multiple isotypes could be detected simultaneously, only if the isotype specific fluorescence labeled secondary antibodies are available and compatible with the microarray scanner.\nWash and dry.\nRemove the solution from the container and add 30 mL Wash buffer. Keep the container at room temperature (25°C) and shake for 90–100 rpm on a shaker for 10 min. Repeat this step for three times.\nWash the slide with ddH2O for 10 min, and rinse with ddH2O for 10 s.\nDry the slide by centrifugation.\nNote: From step 15 on, the slides should be kept under dark.\nMicroarray scanning.\nTurn on the microarray scanner Genepix 4200A and warm up for 15 min.\nScan the microarray at 532 nm (IgG) and 635 nm (IgM) channel. Recommended scanning parameters: 95% power, PMT 200-300. However, the optimal scanning parameters should be adjusted according to the overall signal intensity.\nAfter scanning is completed, save the result as one single TIF file (Figure 1[href=https://www.wicell.org#fig1]C).",
    "Critical: The same scanning parameters should be applied to the microarrays in the same experiment.\nCritical: Avoid scratching on microarray surface in any way during the whole process.\nMicroarray data processing\nTiming: 1 day\nQuantitative signal intensity of each protein indicates the antibody response of one serum sample, which can be acquired by transforming the fluorescence intensity of each spot in the microarray image to digital signal, i. e., the microarray data extraction. The data are normalized to calibrate the differences among different microarrays.\nExtract microarray data.\nThe software Genepix 6.0 enables automatic alignment. Using the GAL file (step 10) to align the features of the microarray image, before extract the data, it is necessary to double check the aligned features and adjust the incorrectly aligned features.\nClick the “analysis” button to extract the data of all features and generate a GPR file (raw data) for each microarray.\nCalculate signal intensity.\nCalculate signal intensity for each feature: subtract Foreground Median (F median) with Background Median (B median). IgG (532 nm channel) and IgM (635 nm channel) are calculated separately.\nCalculate the average of the triplicates of each protein in the same subarray.\nNormalization among microarrays. Use the data of block #14 in each slide (the positive sera sample) to calculate the normalization factor (Factor N) for each microarray. IgG (532 nm channel) and IgM (635 nm channel) are calculated separately.\nExclude the features with low signal intensity (< 300).\nWith the data of block #14 of all microarrays, calculate the overall average signal intensity for each protein (without the controls) to create a reference data set.\nCalculate the Pearson correlation coefficient between the reference data set and each data set of block #14. Exclude the spots which away from the diagonal line when the coefficient is less than 0.98.",
    "Calculate the Factor N for each using the following function in Excel software: LINEST (Y, X i, FALSE), where the Y is the reference data set, the X i is the data of block #14 from slide i , and FALSE means to make the constant term equal to 0.\nFor each slide, all the signal intensities are normalized by multiplying the corresponding Factor N."
  ],
  "subjectAreas": [
    "Immunology",
    "Health Sciences",
    "Biotechnology And Bioengineering",
    "Proteomics",
    "Protein Expression And Purification",
    "Clinical Protocol",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}