{
  "id": 7046,
  "origin_website": "Bio",
  "title": "Native Co-immunoprecipitation Assay to Identify Interacting Partners of Chromatin-associated Proteins in Mammalian Cells",
  "procedures": [
    "Preparation of nuclear lysateCollect 2 x 107-3 x 107 cells with culture medium in 50 ml conical tube and centrifuge at 800 x g for 3 min at 4 °C.Discard the supernatant and suspend the cells in 10 ml of pre-chilled PBS and centrifuge at 800 x g for 3 min at 4 °C.Discard the supernatant, suspend the cells in 1 ml of pre-chilled PBS, and transfer to 1.5 ml tube and centrifuge cells at 800 x g for 3 min at 4 °C.Discard the supernatant, suspend the cells in 950 µl of pre-chilled RSB containing 1x protease inhibitor cocktail, and incubate at ice for 15 min.Add 20 µl of 10% TritonTM-X100 (v/v), invert tube 6-10 times, and centrifuge at 1,200 x g for 5 min at 4 °C.Discard the supernatant (cytoplasmic fraction), suspend the nuclear pellet in 200 µl of pre-chilled LSB1 and mildly sonicate at Bioruptor® for 5 min at low power (pulse 30 s, rest 60 s). Keep on ice for 5 min, and repeat sonication for 5 min at low power (pulse 30 s, rest 60 s). Rotate end-over-end for 1 h at 4 °C.Centrifuge at 8,000 x g for 10 min at 4 °C and collect supernatant in fresh tube (S1).Immediately suspend the pellet with the help of pipette tip in 150 µl of pre-chilled LSB2, and rotate end-over-end for 30 min at 4 °C.Centrifuge at 8,000 x g for 10 min at 4 °C and collect supernatant in fresh tube. Add 50 µl of RSB containing 1x protease inhibitor cocktail to S2 and keep at ice (S2).Immediately suspend the pellet with the help of pipette tip in 150 µl of pre-chilled LSB3, and rotate end-over-end for 30 min at 4 °C.",
    "Centrifuge at 8,000 x g for 10 min at 4 °C and collect supernatant in fresh tube. Add 50 µl of RSB containing 1x protease inhibitor cocktail to S3 and keep at ice (S3).Immediately suspend the pellet with the help of pipette tip in 150 µl of pre-chilled LSB4, and rotate end-over-end for 30 min at 4 °C.Centrifuge at 8,000 x g for 10 min at 4 °C and collect supernatant in fresh tube. Add 100 µl of RSB containing 1x protease inhibitor cocktail to S4 and keep at ice (S4).Pool extracts S1, S2, S3 and S4. Invert few times to mix and centrifuge at 3,000 x g for 5 min at 4 °C and collect supernatant in a fresh tube. Save 30 µl of pooled extract, add 30 µl of 2x SDS-sample buffer, and heat for 10 min at 95 °C. This will be used as input in western blotting.Co-immunoprecipitationTransfer 30 µl of GFP-Trap® agarose for GFP-fused proteins or 30 µl FLAG®-M2 agarose for FLAG®-tagged proteins to 1.5 ml tube.Add 500 µl of pre-chilled RSB, invert 4-6 times, and centrifuge at 800 x g for 3 min at 4 °C. Discard the supernatant carefully without disturbing the resin.Transfer pooled nuclear lysates to the washed GFP-Trap® agarose or FLAG®-M2 agarose, and rotate end-over-end for 1-2 h at 4 °C.Centrifuge at 80 x g for 3 min at 4 °C, and discard supernatant. Low speed centrifugation at this stage prevent precipitation of insoluble proteins aggregates that may have formed during incubation lysates with GFP-Trap® or FLAG®-M2 agarose at 4 °C. Discard the supernatant carefully without disturbing the resin.To wash resin, add 800 µl of pre-chilled WB, invert 8-10 times, centrifuge at 800 x g for 3 min at 4 °C, and discard the supernatant carefully without disturbing the resin.",
    "Repeat washing 3 more times, and discard the supernatants carefully without disturbing the resin. Proceed to elution of the bound proteins.ElutionElution by boilingSuspend resin in 100 µl 2x SDS-sample buffer, and heat for 10 min at 95 °C.Centrifuge at 1,800 x g for 3 min at 25 °C and collect supernatant in a fresh tube.Elution by competitionSuspend resin in 75 µl of 3x-FLAG® elution buffer containing 500 µg/ml of 3x-FLAG® peptides at 25 °C for 20 min with mild shaking.Centrifuge at 1,800 x g for 3 min at 25 °C and collect supernatant in a fresh tube.Add 25 µl of 4x SDS-sample buffer, and heat for 10 min at 95 °C.Analysis of the immunoprecipitated proteinsRun 5-10 µl of input lysates and 10 µl of eluates (with SDS sample buffer) on SDS-PAGE gels followed by western blotting.For silver staining, run 2-3 µl of input lysates and 10 µl of eluates (with SDS sample buffer) on SDS-PAGE gels and stain with SilverQuest TM Silver Staining Kit.For identification of proteins by mass spectrometry, eluates from 4-10 Co-IP experiments can be pooled. To load the pooled eluates in one single lane of SDS-PAGE, pooled eluates can be concentrated using a method that utilizes MS-compatible reagents such as methanol/chloroform based method. Run concentrated proteins on 4-20% SDS-PAGE gradient gel SDS-PAGE gels and stain with Quick-CBB stain. Cut the gel lane into 8-10 slices and process for MS analysis."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}