{
  "id": 4146,
  "origin_website": "Cell",
  "title": "Protocol to Generate and Characterize Potent and Selective WNT Mimetic Molecules",
  "procedures": [
    "Step-by-Step Method Details\nStep-by-Step Method Details\nThis protocol is divided into four main sections. Since the sources of binders can be diverse, and there are many well-established methodologies to identify antibody or various other scaffold-based binders, the protocols described here start after the identification and selection of appropriate binders. The protocols start with the Molecular Cloning section where a few representative formats are described to generate active WNT mimetics. This is followed by Protein Expression and Purification section. In this section, a critical step to profile the activities of protein of interest across a SEC column is discussed. This is then followed by Protein-Protein Interactions section to characterize the binding between WNT mimetic molecules and their receptors. The protocols end with a functional assay to further characterize and understand the biological activities of the WNT mimetics. Other critical considerations, limitations, and troubleshooting are also discussed. It is also important to highlight that alternatives to reagents or methods described in these protocols can also be utilized. For example, different scaffolds or binders, different expression cell lines or systems, different purification resins, biophysical characterization methods, or organoid systems can be used, as long as the general principles of the protocols are followed.\nMolecular Cloning of WNT Mimetics\nOnce the appropriate binders have been selected, the first step in generating a WNT mimetic is to assemble the binders into bi- or multi-specific formats. The assembled molecule should include one or more FZD binding arms as well as one or more LRP binding arms. Binding to either FZD or LRP alone does not result in WNT mimetic activity. Many different formats could be utilized for this purpose; only the 1:1 bispecific tandem scFv, 2:2 tetravalent bispecific scFv, and 1+1:1+1 tetravalent multi-specific scFv formats will be described here (Chen et al., 2020[href=https://www.wicell.org#bib2]).",
    "Molecular Cloning of 1:1 Bivalent Bispecific Tandem scFv-His6 Molecules\nTiming: 4 days\nDesign the 1:1 bivalent bispecific tandem scFv-His6 molecules as depicted in Figure 1[href=https://www.wicell.org#fig1]A. For more information, please also see Chen et al., 2020[href=https://www.wicell.org#bib2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/91-Fig1.jpg\nFigure 1. Diagram of Various WNT Mimetic Molecule Constructs\n(A) 1:1 bivalent bispecific tandem scFv-His6 format. Each circle represents an scFv domain. The purple thick line at the end of the molecule represents a 6xHis tag.\n(B) 2:2 tetravalent bispecific tandem scFv-Fc format.\n(C) 1+1:1+1 tetravalent multi-specific tandem scFv-Fc format.\nNote: Adding a 6xHis tag to the C-terminus of the bivalent bispecific tandem scFv will simplify the protein purification process. It is important to add a flexible 15-mer linker such as (G4S)3 between the VH and VL for each of the scFv sequences. It is also important to consider a flexible linker between the two scFvs, however the optimal linker length will need to be determined experimentally (Chen et al., 2020[href=https://www.wicell.org#bib2]).\nSynthesize the fragment as a gBlock.\nClone the gBlock into the pcDNA3.1(+) expression vector:\nAliquot 5 μL of 2X NEBuilder HiFi DNA Assembly Master Mix into a PCR tube.\nAdd 100 ng gel purified linearized pcDNA3.1(+) vector to that PCR tube.\nAdd the required amount of gBlock fragment (molar ratio of fragment:vector = 5:1) to that PCR tube.\nAdd nuclease free water to reach a final reaction volume of 10 μL.\nMix gently, then allow reaction to proceed at 50°C for 60 min.\nTransform 2 μL of the assembled products into NEB 5-alpha Competent cells according to the manufacture’s transformation protocol.\nNote: gBlock can be ordered from GenScript or Integrated DNA Technologies (IDT). Alternative cloning methodologies, such as PCR based methods, can also be used.",
    "Note: Treatment of the linearized pcDNA3.1(+) vector by Alkaline Phosphatase, Calf Intestinal (CIP) can reduce the background of the cloning from the vector self-ligation.\nAlternatives: Besides the NEB 5-alpha Competent cells, other competent cells such as Top10 can also be used for the transformation.\nMolecular Cloning of 2:2 Tetravalent Bispecific Tandem scFv-Fc Molecules\nTiming: 4 days\nDesign the 2:2 tetravalent bispecific tandem scFv-Fc molecule as depicted in Figure 1[href=https://www.wicell.org#fig1]B and see Chen et al., 2020[href=https://www.wicell.org#bib2].\nSynthesize the tandem scFv-Fc fragment and assemble as described in Step 3 of Molecular Cloning of 1:1 Bivalent Bispecific Tandem scFv-His6 Molecules.\nMolecular Cloning of Asymmetric 1+1:1+1 Tetravalent Multi-specific Tandem scFv-Fc Molecules\nTiming: 4 days\nDesign the asymmetric 1+1:1+1 tetravalent multi-specific tandem scFv-Fc molecule as depicted in Figure 1[href=https://www.wicell.org#fig1]C and see Chen et al., 2020[href=https://www.wicell.org#bib2].\nSynthesize the tandem scFv-Fc fragments and assemble as described in Step 3 of Molecular Cloning of 1:1 Bivalent Bispecific Tandem scFv-His6 Molecules.\nNote: Only tandem scFv or tandem scFv-Fc formats are described here to illustrate the principles of generating WNT mimetics. Other formats, such as those reviewed by Brinkmann and Kontermann (2017)[href=https://www.wicell.org#bib1], can also be utilized. A particular FZD and LRP binder pair may have different preferences for format. The relative orientation between the two binders, attachment sites, and linker lengths between the binders should be explored to achieve optimal activity.\nNote: For the formation of Fc heterodimerization, only “knobs-into-holes” is described here as an example. The Fc chain containing the knob (T366W) mutation has a Flag tag (DYKDDDDK) on its C-terminus, and the other Fc chain containing the hole (T366S/L368A/Y407V) mutations has a 6xHis tag on its C-terminus. Other asymmetric Fc heterodimerization architecture can also be utilized (Brinkmann and Kontermann, 2017[href=https://www.wicell.org#bib1]).\nProtein Expression and Purification",
    "Once the DNA constructs are ready, expression, purification, and characterizations come next. This section describes expression, purification, as well as characterization of the purified molecules in a WNT-responsive HEK293 STF reporter assay. Various expression systems could be utilized. The Expi293 based transfection/expression system will be described here. FreeStyle 293 Expression System could be used instead, although the protein expression levels tend to be lower than Expi293 Expression System. Three different purification methods are described here depending on the affinity tags present and the formats used. Activity characterization in a reporter cell, especially a critical step to test all fractions across a purification column, will also be highlighted in this section.\nProtein Expression\nTiming: 6 days\nThe day before transfection, seed the cells at a density of 2.0 × 106 viable cells/mL and incubate at 37°C in Multitron Pro Incubator shaker rotating at 125 rpm with 8% CO2 and humidity set at 85%.\nOn the day of transfection, determine number and viability of the cells using an automated cell counter.\nDilute the cells to 2.95× 106 viable cells/mL with pre-warmed Expi293 Expression Medium.\nAdd 34 mL cell suspension to each sterile, disposable, vented 125-mL Erlenmeyer shaker flask for each 40-mL transfection. Return the cells to the incubator.\nMeanwhile, for each 40-mL transfection, prepare lipid-DNA complexes as follows:\nDilute 40 μg of plasmid DNA in 2 mL Opti-MEM I Reduced Serum Medium. Mix gently.\nDilute 108 μL of ExpiFectamine 293 Reagent in 2 mL Opti-MEM I Reduced Serum Medium. Mix gently and incubate for 5 min at 20–25°C.\nAfter the 5 min incubation, add the diluted DNA to the diluted ExpiFectamine 293 Reagent to obtain a total volume of 4 mL. Mix gently.\nIncubate DNA-ExpiFectamine 293 Reagent mixture for 20–30 min at 20–25°C to allow the DNA-ExpiFectamine 293 Reagent complexes to form.",
    "Critical: The incubation time in Step 12 is critical. Do not incubate the ExpiFectamine 293 Reagent and DNA-ExpiFectamine 293 Reagent mixture longer than the time listed. Add DNA-ExpiFectamine 293 Reagent mixture to the flask from Step 11 immediately after Step 12 d is complete.\nAfter the DNA-ExpiFectamine 293 Reagent complex incubation is complete, add 4 mL of DNA-ExpiFectamine complex to each shaker flask from Step 11. Gently swirl the flask.\nReturn and incubate the cells in the incubator.\nApproximately 16–18 h post-transfection, add 200 μL of ExpiFectamine 293 Transfection Enhancer 1 and 2 mL of ExpiFectamine 293 Transfection Enhancer 2 to each flask. The final volume should be approximately 40 mL in each 125-mL flask. Return the cells to the incubator for another three days.\nNote: Use aseptic techniques since the cell culture media has no antibiotics and is prone to contamination.\nNote: The settings for the shaking speed is dependent on the orbital diameter of the shaker and the size of the flasks. Most incubator shakers for mammalian cell culture have an orbital diameter of 25 mm. If using a shaker with different orbital diameter, the shaking speed needs to be adjusted. The new speed can be calculated using the formula r2 = R2x(d1/d2). d1 = the orbital diameter for the old shaker, d2 = the diameter for the new shaker, R = the rpm for the old shaker and r = the rpm for the new shaker.\nNote: Use good quality plasmid DNA for transient transfection is important for high expression levels. The EndoFree Plasmid Kit suppliers include Qiagen and Takara Bio, as well as alternative kits from other suppliers can be used. It is important to check the integrity of the purified DNA by agarose gel electrophoresis to ensure plasmid DNA is supercoiled for high transfection efficiency.",
    "Note: After the transfection, the cells can be cultured in the incubator for 4–5 days. It is optional to measure the cell viability on the harvest day. The cell viability varies depending on the transfected and expressed protein, which is usually higher than 60%.\nHis-Tag Affinity Purification\nTiming: 2 days\nPurification of the 1:1 tandem scFv-His6 molecules\ncOmplete® His-tag resin preparation:\nTransfer the required amount of slurry (0.2 mL resin for a 40 mL transfection sample) into a gravity column.\nAllow the resin to settle, then let the excess buffer drain through the column by gravity flow.\nWash the resin with 5 column volumes Milli Q water.\nWash the resin with 5 column volumes Buffer A.\nCell culture conditioned media preparation:\nTransfer the transfected cells to 50 mL conical tubes.\nSpin down at 4,000 rpm (∼3,500 g) for 30 min at 4°C.\nPour supernatant into new, labeled conical tubes.\nProtein binding and elution:\nAdd the equilibrated resin to the conditioned media (0.2 mL resin for a 40 mL transfection sample).\nBind at 20–25°C for 3 h on a Tube Rotator.\nAllow the resin to settle for 5 min at 4°C.\nPellet the resin at 2000 rpm (∼850 g) for 5 min at 4°C.\nRemove most of the supernatant.\nTransfer the resin to the gravity flow column and let the conditioned media drain.\nWash the resin with 20 column volumes Buffer A.\nWash the resin with 20 column volumes washing buffer (Buffer A +5 mM imidazole).\nWash the resin with 1 column volume washing buffer (Buffer A +20 mM imidazole).\nElute the protein with 5 column volumes Buffer B, collect each elution fraction (200 μL) in prelabelled Eppendorf tubes.\nMeasure the protein concentration of each fraction by measuring the A280 on NanoDrop 2000.",
    "Run the fractions on SDS-PAGE gel at both reducing and non-reducing conditions to characterize the eluted proteins.\nPolish the protein using Superdex 200 Increase 10/300 GL column on AKTA pure:\nPool the main fractions from Step 18, usually most proteins are eluted in fractions 2–4.\nFilter the pooled proteins using a 0.2 μm spin filter.\nPolish the protein on Superdex 200 Increase 10/300 GL column using 1XHBS as the mobile phase at the flow rate of 0.75 mL/min.\nRun the protein fractions on SDS-PAGE gel at both reducing and non-reducing conditions to characterize the products.\nNote: 0.2 mL resin is usually enough to capture almost all the proteins from a 40 mL transfection since the protein expression level here is in the range of 20–100 mg/mL. Therefore, each elution fraction is 0.2 mL. About 85% of the eluted proteins (mass amount) can be loaded onto the Superdex 200 Increase 10/300 GL column which has the maximal sample loading volume of 500 μL.\nNote: The elution volume of the tandem scFv-His6 molecules is usually around 16 mL on Superdex 200 Increase 10/300 GL column (Figure 2[href=https://www.wicell.org#fig2]A). The aggregates are usually observed but the percentage of the aggregates varies depending on a particular binder and the assembly molecules.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/91-Fig2.jpg\nFigure 2. STF Activities across SEC Fractions\n(A–C) L1:5:F1 SEC profiles. (A) Protein trace across SEC. (B) STF activity trace across SEC. (C) Overlay of (A) and (B). Results show that the peak STF activity did not coincide with monomer protein peak, suggesting the monomer is inactive.\n(D–F) F1:10:L1:Fc SEC profiles. (D) Protein trace across SEC. (E) STF activity trace across SEC. (F) Overlay of (D) and (E). Results show that the peak STF activity coincided with the monomer protein peak, suggesting the monomer is active (Chen et al., 2020[href=https://www.wicell.org#bib2]).",
    "Critical: Use ultra-pure imidazole, which has the least absorbance at A280 nm.\nCritical: Collect all fractions of the SEC run for assays later.\nProtein A Affinity Purification\nTiming: 2 days\nPurification of the 2:2 tandem scFv-Fc molecules\nThe CaptivA Protein A affinity resin preparation:The preparation of CaptivA Protein A affinity resin is same as the above described procedure (Step 16) for the cOmplete® His-tag purification resin, except the resin here is washed twice with 1xPBS instead of with Buffer A (Step 16d). 0.2 mL Protein A resin is used for a 40 mL transfection sample.\nConditioned media preparation:The preparation of the conditioned media is same as the above described procedure (Step 17).\nProtein binding and elution:\nBinding and washing procedures are the same as the His-Tag Affinity Purification Steps 18 a-g, except 1xPBS is used here to wash the resin, instead of using Buffer A.\nElute the protein with 5 column volumes elution buffer (100 mM glycine pH3.3), collect each elution fraction (200 μL) in prelabelled Eppendorf tubes which contain 20 μL neutralization buffer.\nInvert the Eppendorf tubes gently 3–4 times immediately.\nCritical: Invert the Eppendorf tubes gently 3–4 times immediately to mix each elution with neutralization buffer to prevent the reduction or loss of the protein activity in the acidic elution buffer.\nMeasure the protein concentration of each fraction by measuring the A280 on NanoDrop 2000.\nRun the fractions on SDS-PAGE gel at both reducing and non-reducing conditions to characterize the eluted proteins.\nPolish the protein using Superdex 200 Increase 10/300 GL column on AKTA pure as Step 19.\nNote: The elution volume of the tandem scFv-Fc molecules is usually around 12–13 mL on Superdex 200 Increase 10/300 GL column (Figure 2[href=https://www.wicell.org#fig2]D), the exact elution volume depends on the protein structure and sequence.",
    "Alternatives: Other Protein A resin such as POROS MabCapture A Select Resin (Cat#82079) from Thermo Fisher Scientific can also be used for the purification.\nCritical: Collect all fractions of the SEC run for assays later.\nanti-Flag M2 Affinity Purification\nTiming: 2 days\nFour steps purification (Protein A, His-Tag, anti-Flag M2, and SEC) to purify asymmetric 1+1:1+1 multi-specific tandem scFv-Fc molecules\nThe asymmetric tandem scFv-Fc recombinant proteins are first purified by Protein A resin as described in Steps 20–22.\nPool the main eluted protein fractions from Step 24 into the 1.5 mL Eppendorf tube and add 0.2 mL cOmplete® His-tag purification resin, then perform His-Tag Affinity Purification as described in Steps 18 b-l.\nThe anti-Flag M2 Affinity Purification:\nThe anti-Flag M2 affinity resin preparation:The preparation of anti-Flag M2 affinity resin is same as Step 16, except no Milli Q water wash, and the resin here is washed with 5 column volumes TBS buffer instead of with Buffer A.\nProtein binding and washing:Pool the main eluted protein fractions from Step 25 into the 1.5 mL Eppendorf tube and add 0.4 mL anti-Flag M2 affinity resin. Perform binding and washing as Steps 18 b-g, except TBS is used here to wash the resin, instead of using Buffer A.\nProtein elution:Elute the protein with 4–5 column volumes 3xFlag peptide elution solution, collect the eluted proteins at 200 μL per fraction in prelabelled individual Eppendorf tubes.\nCharacterize the eluted individual fractions as Steps 18 k-l.\nPolish the protein using Superdex 200 Increase 10/300 GL column on AKTA pure as Step 19.",
    "Note: The binding capacity of anti-Flag M2 affinity resin is low, therefore typically 0.4 mL resin is needed for the binding to get enough protein for SEC polishing and downstream assays. The eluted protein is usually enriched in three fractions, therefore most protein can be loaded to SEC column without the need to pool all the fractions and concentrate. The elution can be terminated when A280 of the eluted fraction is close to zero.\nAlternatives: 3xFlag peptide can also be ordered from other companies such as ThermoFisher Scientific or custom order from the peptide synthesis companies if large amount is needed.\nCritical: Use the 3xFlag peptide elution solution to blank the NanoDrop since the elution solution has an absorbance at A280.\nCritical: Store the purified proteins from Steps 19, 23 and 27 at 4°C for less than 1 week. If the assays cannot be completed in one week, the proteins should be aliquoted and frozen at −80°C.\nCritical: Collect all fractions of the SEC run for assays later.\nSuper Top Flash (STF) Assay across the SEC Column\nTiming: 3 days\nOnce mimetic molecules are purified via various means, the essential next step is to assess their activities across the SEC column fractions that are saved. The activity assay can be performed on a WNT-responsive cell line such as the HEK293 Super TOP-FLASH (STF) luciferase reporter cells (Janda et al., 2017[href=https://www.wicell.org#bib4]).\nSeed 100 μL HEK293 STF cells at a density of 10,000 per well in 96-well plates 24 h prior to adding the assay proteins. IWP2 is added when seeding the cells with the final concentration of 3 μM to inhibit the production of endogenous WNTs.",
    "Measure the protein concentration of the peak protein fraction from the SEC column by measuring A280 on NanoDrop. Calculate the volume required from this peak protein fraction to dilute with HEK293 cell culture media to achieve a concentration of 10 nM.\nTake the same volume from all the other protein fractions and dilute with the same dilution factor with media as in the above step for the peak fraction.\nAfter removing 10 μL media from each well, add 10 μL diluted fractions to each well containing the remaining 90 μL medium in the 96-well plates. This will result in equal volumes (but not equal concentrations) for each of the fractions to be tested. Only the peak protein fraction is at 1 nM final concentration.\nIncubate the plate for 18 h in the cell culture incubator.\nRemove growth medium from the cultured cells.\nDispense 100 μL of 1X lysis reagent into the 96-well plate and incubate for 5 min at 20–25°C on a shaker.\nMix 20 μL of cell lysate with 10 μL of Luciferase Assay Reagent.\nMeasure the light produced on the plate reader.",
    "Critical: Ensuring that the activity profile matches the monomer protein peak on the SEC column is an essential step. Generation of agonists is more prone to artifacts. As illustrated in Figures 2[href=https://www.wicell.org#fig2]A–2C, aggregated protein products may potently stimulate signaling (Chen et al., 2020[href=https://www.wicell.org#bib2]). Since multiple formats could be utilized to generate WNT mimetics (Chen et al., 2020[href=https://www.wicell.org#bib2]; Janda et al., 2017[href=https://www.wicell.org#bib4]; Tao et al., 2019[href=https://www.wicell.org#bib8]), and the different formats and binders may have different tendencies for aggregation, it is essential to ensure that the observed agonist activities are from the monomer forms of the molecules generated. The typical approach of pooling the monomer peak from the SEC column without thorough examination of the activities from each of the fraction containing different species may lead to false conclusions. As shown by some of the examples here and in Chen et al., 2020[href=https://www.wicell.org#bib2], the monomer pools may contain tailing of higher molecular weight species (HMW). If the HMW species are active or highly active, any activity observed in the monomer pool will be complicated by the contribution from the HMW species which may affect consistency and reproducibility. If the monomer is inactive and HMW is active, this will lead to a false conclusion of the molecule described. HMW species may also have altered receptor specificity which further complicates the interpretation from activity assays.\nNote: For the STF assay across SEC column fractions, we recommend starting with a concentration of 1 nM equivalent for the protein peak fraction. If saturating STF activities are observed in fractions of highly potent molecules, repeating the STF assay at a lower concentration is necessary. At saturating STF conditions, discerning the peak fraction becomes difficult. In addition, as some mimetics show bell-shaped curves, saturating conditions may not accurately reflect the actual activity peak.",
    "Dose Response STF Assay for a Mimetic Molecule\nTiming: 3 days\nSeed 100 μL HEK293 cells at a density of 10,000 per well in 96-well plates 24 h prior to adding the assay proteins. IWP2 is added when seeding the cells with the final concentration of 3 μM to inhibit the production of endogenous WNTs.\nDilute the recombinant WNT mimetics with the HEK293 cell culture media. An example of a dilution series is 100 nM, 10 nM, 1 nM, 0.1 nM, 0.01 nM, 0.001 nM, 0.0001 nM.\nAfter removing 10 μL media from each well, add 10 μL diluted WNT mimetics to each well in the 96 well plates to achieve a final assay concentration of 10 nM, 1 nM, 0.1 nM, 0.01 nM, 0.001 nM, 0.0001 nM, 0.00001 nM.\nIncubate the plate for 18 h in the cell culture incubator.\nRemove growth medium from the cultured cells.\nDispense 100 μL of 1X lysis reagent into the 96-well plate and incubate for 5 min at 20–25°C on a shaker.\nMix 20 μL of cell lysate with 10 μL of Luciferase Assay Reagent.\nMeasure the light produced on the plate reader.\nProtein-Protein Interactions\nTo further characterize the assembled molecules, for example, to understand if the geometry affects binding to their respective receptors for further optimization, or in the case of no activity, to ensure the geometry does not impact binding, additional protein-protein interaction assays such as biolayer interferometry (BLI) assay or surface plasmon resonance assay, may be necessary. Here, we used Octet-based BLI assay. The following sections describe a step-binding assay to ensure the assembled molecule can bind to two target receptors simultaneously.\nStep-Binding Assay by BLI (Validating the Simultaneous Bindings of the Two Antigens by the Tandem scFv Molecule)\nTiming: 30 min",
    "Rehydrate streptavidin biosensors (Dip and Read, Pall ForteBio) in a biosensor rack with a 96-well plate containing 200 μL/well of 0.5% (wt/vol) bovine serum albumin (BSA) in PBST for at least 10 min at 20–25°C.\nOpen Data Acquisition 9.0 software (Pall ForteBio) and design the assay protocol with the following time durations:\ntable:files/protocols_protocol_91_2.csv\nPerform runs with 50 nM biotinylated antigen 1 solution for the loading step, the combination of two association steps with the following design and Octet buffer for the two baseline steps. All proteins are diluted in the Octet buffer.\ntable:files/protocols_protocol_91_3.csv\nFor example, biotinylated FZD8-CRD as antigen 1, L2:5:F3 or F3:5:L2 as tandem scFv, and LRP6E3E4 as antigen 2, as shown in Figure 4 of Chen et al., 2020[href=https://www.wicell.org#bib2].\nNote: The protein concentration for loading step needs to be optimized before the assay. The concentrations for both tandem scFv and antigen 2 also need to be determined by 1:1 binding assays. In the assay of Chen et al., 2020[href=https://www.wicell.org#bib2], while 50 nM biotinylated FZD8-CRD was used to reach the response of ∼1.5 nm in the sensorgram, 1 μM and 2 μM for L2:5:F3 or F3:5:L2 and LRP6E3E4, respectively, were used.\nNote: Use the same concentrations of Tandem scFv as in the “Association 2” step to avoid the possible dissociation of the bound Tandem scFv in “Association 1.” If the tandem scFv binding in “Association 1” is high affinity with no obvious dissociation during washing step, “antigen 2 in buffer” in “Association 2” can be considered instead of “antigen 2 in tandem scFv” to avoid unnecessary consumption of additional protein.",
    "Alternatives: For the step-binding assay, we designed the protein binding orientation as “classical sandwich” method (antigen 1 → tandem scFv → antigen 2). However, “in tandem” binding method (tandem scFv → antigen 1/2 → antigen 2/1) can also be considered. The tandem scFv can be captured on biosensor chip first and both antigens can be added on top sequentially.\nCollect the step-binding data with Data Analysis 9.0 software (Pall ForteBio).\nNote: See Figure 3[href=https://www.wicell.org#fig3] for the assay plate design adapted from Figure 4 in Chen et al., 2020[href=https://www.wicell.org#bib2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/91-Fig3.jpg\nFigure 3. Step-Binding Assay by BLI\nSensorgrams (right) are generated by a BLI assay with the designed assay plate (left). Biotinylated FZD8-CRD is captured on the SA-chip surface (Step 2) and L2-F3 is then added (Step 4). The additional binding of LRP6E3E4 on the complex is detected in step 5. Steps 1 and 3 indicate baselines. The protein assemblies on each sensor chip is depicted on the right panel. The assay is adapted from Chen et al., 2020[href=https://www.wicell.org#bib2].\nIntestinal Organoid Culture and Proliferation Assay\nTiming: 7 days\nWNT mimetic molecules should be evaluated in additional functional assays in vitro and in vivo. This section describes one such in vitro functional system, mouse intestinal organoids (O'Rourke et al., 2016[href=https://www.wicell.org#bib7]), for the evaluation of WNT mimetics.\nThawing organoids:\nWarm IntestiCultTM Organoid Growth Medium to 37°C. Pre-warm a 48-well tissue culture plate at 37°C for at least 30 min.\nQuickly thaw a tube of mouse intestinal organoids by holding the tube in hand.\nTransfer the organoids in freezing medium into a 15 mL conical tube and add 10 mL DMEM. Spin down organoids at 4°C for 3 min at 150 g. Slowly take out supernatant and repeat the wash with IntestiCultTM Organoid Growth Medium.",
    "After spinning down, slowly take out as much supernatant as possible without disrupting the organoid pellet.\nResuspend organoids in 200 μL Matrigel on ice, mix gently and quickly dispense 25 μL of the mixture into the center of each well of the pre-warmed 48-well plate. Return the plate to 37°C without shaking and allow Matrigel to solidify for 5 min. A Matrigel dome should form in the center of the well.\nGently overlay 300 μL of IntestiCultTM Organoid Growth Medium on top.\nIncubate organoids at 37°C for 5–7 days before passaging. IntestiCultTM Organoid Growth Medium should be changed every 3–4 days.\nNote: After growing for 5–7 days, organoids should reach a good differentiated state with a slight phase-dark lumen and many phase-light finger-like protruding crypts.\nPassaging organoids:\nPre-warm a new 48-well tissue culture plate containing Basal Medium and Gentle Cell Dissociation Reagent to 37°C.\nCarefully aspirate the IntestiCultTM Organoid Growth Medium from the organoid culture plate without disturbing the Matrigel dome.\nApply 200 μL Gentle Cell Dissociation Reagent to each well and incubate at 37°C for 5 min.\nCollect organoids by gently pipetting up and down a few times and transfer and pool the content of each well to a 15 mL conical tube.\nAdd 10 mL Basal Medium to the tube and spin down organoids at 150 g for 3 min at 4°C.\nSlowly take out the supernatant without disturbing the organoid pellet. Add appropriate amount of Matrigel to the organoid pellet on ice. Using a P200, gently disrupt organoids into smaller pieces on ice 20 times.",
    "Note: we typically do 1 to 4–6 splits, i.e. 1 well of organoid split to 4–6 wells. For example, in a 1 to 4 split, if starting from 1 well of organoid, 100 μl (4x25 μl) of Matrigel should be added to the resuspend organoids. The degree of organoid dissociation, incubator condition, and the time of media change may all affect how the organoids grow. The appropriate split ratio should be determined empirically by the operator.\nQuickly dispense 25 μL of the organoid/Matrigel suspension to the center of each well of the pre-warmed 48-well plate and let solidify for 5 min at 37°C.\nGently overlay 300 μL of IntestiCultTM Organoid Growth Medium on top.\nOrganoids need to be passaged again after growing at 37°C for 5–7 days if not used for the assay below. IntestiCultTM Organoid Growth Medium should be changed every 3–4 days.\nPlating organoids for mimetic treatment:\nGrow and passage organoids as necessary until organoids are in a good differentiated condition and sufficient amount for WNT mimetic treatments. We generally split organoids 1 to 8 to set up for mimetic treatment.\nPrepare WNT mimetic dilution series as desired in Basal Medium with 1 μM IWP2. Keep the protein dilution series on ice. Thaw a few aliquots of Matrigel on ice.\nDissociate organoids.\nPre-warm a new 48-well tissue culture plate containing Basal Medium and Gentle Cell Dissociation Reagent to 37°C.\nCarefully aspirate the IntestiCultTM Organoid Growth Medium from the organoid culture plate without disturbing the Matrigel dome.\nApply 200 μL Gentle Cell Dissociation Reagent to each well and incubate at 37°C for 5 min.\nCollect organoids by gently pipetting up and down a few times and transfer and pool the content of each well to a 15 mL conical tube.",
    "Add 10 mL Basal Medium to the tube and spin down organoids at 150 g for 3 min at 4°C.\nPlate organoids.\nSlowly take out the supernatant without disturbing the organoid pellet. Depending on the number of organoids, apply Matrigel to the organoid pellet. Using a P200, gently disrupt organoids into smaller pieces on ice 20 times.\nNote: Density and starting size of organoids will affect sensitivity of the assay, as intestinal organoids secrete growth factors and help each other grow. At the time of imaging, ∼50 organoids per well is ideal. (Splitting organoid at a ratio of 1 to 8 has been a good starting point for us.) For example, in a 1 to 8 split, if starting from 1 well of organoid, 200 μl (8x25 μl) of Matrigel should be added to the resuspend organoids.\nQuickly dispense 25 μL of the organoid/Matrigel suspension to the center of each well of the pre-warmed 48-well plate and let solidify for 5 min at 37°C.\nGently apply 300 μL of Basal Medium with 1 μM IWP2 or the protein dilution serious to the well. Prepare a minimum of 4 wells for each treatment condition for technical repeats.\nIncubate the plate at 37°C for 3 days and change medium with fresh protein dilutions on day 4. On day 7, image organoids under a transmitted light microscope equipped with phase contrast or DIC. Example images of organoids under various treatments are shown in Figure 4[href=https://www.wicell.org#fig4].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/91-Fig4.jpg\nFigure 4. Treating Mouse Intestinal Organoids with WNT Mimetics\n(A–C) Images showing mouse intestinal organoids in Basal Medium (A), Basal Medium+IWP2 (B), and Basal Medium+IWP2+mimetic L1-F1-Fc (C) (Chen et al., 2020[href=https://www.wicell.org#bib2]). Scale bars: 200 μm."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}