{
  "id": 7808,
  "origin_website": "Bio",
  "title": "Isolation of RNA from the Murine Colonic Tissue and qRT-PCR for Inflammatory Cytokines",
  "procedures": [
    "Isolation of colon from the exposed mice (Figure 1) Expose female C57BL/6 mice (6–8 weeks) to E-cig aerosols produced from JUUL mango or JUUL mint or to air for one and three months using the InExpose system.Note: A detailed protocol on mouse exposure and composition of JUUL pods is present in the original article (Moshensky et al., 2022). Briefly, C57BL/6 mice (6–8 weeks of age) were placed in an exposure chamber and exposed to E-cig aerosol for 20 min three times daily, for a total of 60 min per day, for 4–12 weeks. All experiments were conducted with the approval of the UCSD Institutional Animal Care and Use Committee (IACUC protocol S16021). At the end of exposure, euthanize mice by regulated slow (~50% flow rate) carbon dioxide inhalation followed by cervical dislocation.Using scissor and forceps, cut the whole colon of a mouse from the anus to the cecum (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4634/bioprotoc-13-06-4634-g001.jpgFigure 1. Flow of the design experiment. Mice are exposed either to air or Juul pods (mango or mint) through the InExpose system. After three months of exposure, mice are sacrificed and colons are collected, cleaned from any remaining stool, and then stored in RNAlater solution. The colon is either processed immediately or stored at -80 °C until processing.Put the colon in a Petri dish containing PBS to rinse away any blood. Remove any attached adipose tissue from the colon.Use a cotton swab to empty the colon from remaining stool.Cut the colon into small pieces and transfer part of the colon into a 1.5 mL Eppendorf containing 400–500 μL of RNAlater.Notes:  Saving the whole colon in RNAlater solution is an option if no other procedures/techniques are required, such as processing of the mouse colon into formalin-fixed paraffin-embedded blocks. Therefore, step A6 is optional.",
    "In case histology is required for the colon, cut it into three parts: proximal, mid, and distal colon. The distal colon is used to assess the transcripts of inflammatory cytokines. Mid and proximal colons are used for histology and other purposes. The amount of RNAlater can be increased (600 μL to 1 mL) if a larger part or the whole colon will be saved. The RNAlater should cover the part/whole colon saved as shown in Figure 1. Store the colon samples at -80 °C.Note:  If RNA extraction is done on the same day of euthanasia, step A7 is not required. Saving the tissue in RNAlater is important when the downstream processing will be performed later. Extraction of RNA from the colon tissues (Figure 2) Thaw the colon samples on ice; then, use scissors and forceps to cut the colon tissues into small pieces.Note: Ensure that no precipitated salts are around the tissue. Wash the colon with PBS to remove any precipitated salts. Weigh the colon piece using a scale/balance and ensure that the weight is ≤ 20 mg/piece.Notes:  It is very important to weigh the mouse colon; ideally, tissues between 5 and 20 mg give good RNA yield. Using larger tissue pieces gives a poor RNA yield due to column blockage during the RNA extraction process. It is recommended to mince/cut the colon into small pieces after weighing to speed up the homogenization step. Transfer the colon piece into a 1.5 mL Eppendorf containing 600 μL of TRI reagent solution.Homogenize the colon piece in TRI reagent solution using the 150 handheld homogenizer for 1–2 min until complete disruption of tissue.Notes:  It is important to clean and disinfect the homogenizer using 70% ethanol and water between samples to avoid cross contamination.",
    "Make sure that the weighted piece is completely disintegrated and no visible tissue remains. In case of tough tissue, you can increase the volume of TRI reagent to 800 μL and/or increase the homogenization time. The homogenizer has three different speeds (low, middle, and high). It is recommended to use the middle speed, since the highest could be destructive to tissues if it is continued for a long time and the lowest could take a long period of time to disintegrate the tissue. Centrifuge the tissue suspension at a maximum speed of 13,000 × g for 2 min.After the centrifugation step, you can see a precipitated debris at the bottom of the Eppendorf and a clear supernatant solution above it (Figure 2). Collect the supernatant into a new 1.5 mL Eppendorf and discard the tube containing the precipitated debris.Mix the supernatant from step B6 with an equal volume (approximately 600 μL) of ethanol (95–100%).Transfer the previous mixture into a Zymo-SpinTM IICR column in a collection tube (this column is a part of Direct-zolTM RNA Miniprep kit).Note: The maximum capacity of Zymo-SpinTM IICR is 700 μL and the volume of each sample is approximately 1,200 μL (600 μL TRI/tissue mix + 600 μL ethanol). Therefore, step B8 is repeated twice on the same column. Centrifuge the mixture from step B8 at 13,000 × g for 1 min. Then, discard the flow through waste into 15 or 50 mL falcon tubes and discard the collection tube.Note: At this step, the flow through waste can be used to purify the protein from the mouse colon. Transfer the Zymo-SpinTM IICR column to a new collection tube.Add RNA wash buffer (a part of Direct-zolTM RNA Miniprep kit) (400 µL/sample) to the column and centrifuge at 13,000 × g for 30 s to 1 min.",
    "Discard the flow through and transfer the column to a new collection tube.Add 80 µL of DNase I treatment preparation (Recipe 1) per column. Incubate the mixture with the column at room temperature for 15 min.Notes:  DNase I (part of Direct-zolTM RNA Miniprep kit) is provided as lyophilized powder. Reconstitute it using with DNase/RNase-free water according to the manufacturer’s instructions. Mix well and then store the aliquots at -20 °C until use. This step is highly recommended to get rid of DNA present in the sample. Add 400 µL of Direct-zolTM RNA PreWash buffer (part of Direct-zolTM RNA Miniprep kit) to the column and centrifuge at 13,000 × g for 1 min. Discard the flow through and repeat this step one more time.Note: RNA PreWash buffer is provided as a concentrate buffer. You should dilute it with ethanol according to the manufacturer’s instructions. Add 700 µL of RNA wash buffer to the column and centrifuge at 13,000 × g for 1 min to remove the wash buffer.Note: RNA wash buffer is provided as a concentrate buffer. You should dilute it with ethanol according to the manufacturer’s instructions. Centrifuge the empty column present in a new collection tube at 13,000 × g for 5 min to ensure complete removal of the ethanol that is present in RNA PreWash buffer and RNA wash buffer.Note:  It is important to get rid of ethanol since any residual amount can impact the downstream qPCR steps and/or the yield and purity of extracted RNA. Transfer the column carefully into an RNase-free tube, add 50 µL of DNase/RNase-free water directly to the column matrix, incubate at room temperature for 2–5 min, and then centrifuge at 13,000 × g for 1 min.Repeat step B16 using the RNA eluted from the column.",
    "Transfer the eluted RNA into the same column, incubate at room temperature for 2 min, and then centrifuge at 13,000 × g for 1 min.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4634/bioprotoc-13-06-4634-g002.jpgFigure 2. Steps of RNA isolation from the colon. Colon samples are cut into small pieces, weighted, and then homogenized. The homogenized samples are centrifuged to remove the tissue debris and the supernatants are processed for RNA extraction. The extracted RNA is used for quantification of the transcripts of inflammatory cytokines.RT-qPCR for the inflammatory transcript in the mouse colon Conversion of RNA into cDNA Convert the extracted RNA (approximately 500–750 ng) into cDNA using qScript cDNA SuperMix according to manufacturer’s instructions.To a 0.2 mL thin-walled PCR tube placed on ice, add the components as shown in Recipe 2. The volume of RNA added depends on the concentration. Total RNA added should be between 500 and 750 ng. The volume of free water added depends on the volume of RNA, according to Recipe 2.Note: When comparing samples, it is preferred to use the same amount of RNA. For example, to compare the transcripts from mouse colon derived from air-exposed groups and from JUUL mango pods, use the same amount of RNA to form cDNA; either 500 or 750 ng for all samples or in between concentrations. Vortex the mixture gently and then centrifuge for 10 s to collect contents.Place the PCR tubes in a MiniAmp Plus thermal cycler using the following program (Table 1):Table 1. PCR program for synthesis of cDNA using qScript cDNA synthesis kit table:",
    "﻿Number of cycles,Temperature,Time\n1.0,25 °C,5 min\n1.0,42 °C,30 min\n1.0,85 °C,5 min\n,4 °C,Hold\nDilute the cDNA product into 1/5 or 1/10 using nuclease-free water and store the diluted cDNA at -20 °C until analysis.qRT-PCR reaction system Use the synthesized cDNA as a template for qPCR reaction with 2× SYBR Green qPCR Master Mix.Using a MicroAmpTM optical 96-well reaction plate, add the PCR reaction mixtures according to Recipe 3.Add optical adhesive covers GPLE to the plate, put in the machine, and run the following PCR program (Table 2):Table 2. PCR program table:\n﻿0,1,2,3,4,5,6,7\nStep,Hold,PCR (40 cycles),PCR (40 cycles),PCR (40 cycles),Melt curve (1 cycle),Melt curve (1 cycle),Melt curve (1 cycle)\nStep,Hold,Denaturation,Anneal,Extend,Melt curve (1 cycle),Melt curve (1 cycle),Melt curve (1 cycle)\nTemperature,95.0 °C,95.0 °C,60.0 °C,72.0 °C,95.0 °C,60.0 °C,95.0 °C\nTime,10 min,15 s,30 s,30 s,15 s,60 s,15 s"
  ],
  "subjectAreas": [
    "Immunology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}