{
  "id": 18132,
  "origin_website": "Jove",
  "title": "Stepwise Dosing Protocol for Increased Throughput in Label-Free Impedance-Based GPCR Assays",
  "procedures": [
    "1. Cell seeding on electrode arrays\nNOTE: Selection of electrode layout is a trade-off between sensitivity and number of cells under study. The smaller the electrode, the more sensitive is the measurement but the smaller is the number of cells under study. For cells showing strong impedance fluctuations over time under baseline conditions, bigger or interdigitated electrodes are preferable.\nPre-warm all solutions needed for standard cell passaging and seeding in a 37 °C water bath. For assays with human U-373 MG cells it takes: phosphate buffered saline (PBS) without calcium and magnesium, 0.05% (w/v) trypsin, cell culture medium (Eagle's Minimum Essential Medium (EMEM) supplemented with 5% (v/v) fetal calf serum (FCS), 2 mM L-glutamine and 100 µg/mL penicillin/streptomycin).\nRinse the cell layer of the stock culture grown on the bottom of conventional cell culture flasks or dishes with PBS twice.\nRemove the PBS, add the trypsin solution (1 mL for 25 cm2) and let the cells incubate at 37 °C for 5 min (applies to U-373 MG cells).\nControl for complete detachment of the cells from the bottom of the growth substrate by microscopy.\nStop the trypsin reaction as soon as the cells are completely detached by adding 9 mL of cell culture medium per 1 mL of trypsin to the cell suspension. Carefully rinse remaining cells from the bottom of the cell culture substrate by pipetting the suspension over the substrate.\nCollect the cell suspension with a pipette and transfer it to a centrifugation tube (15 mL or 50 mL tube).\nSpin down the cells by centrifugation at 110 x g for 10 min at room temperature.\nCarefully remove the supernatant and thoroughly re-suspend the cell pellet in culture medium before counting the cells (e.g. by using a hemacytometer for phase contrast microscopes and manual counting).",
    "Adjust the cell suspension to the desired cell density. For experiments with U-373 MG cells, use 100 000 cells/cm2 to grow a confluent cell layer within 48 h. This translates to a cell density of 200 000 cells/mL for 8-well electrode arrays with a growth area of ~0.8 cm2 and a well volume of 400 µL.\n\tNOTE: For reproducible GPCR activation experiments, cells should be grown to confluent monolayers on the electrode arrays. To ensure proper receptor expression on the cell surface, cells should be seeded at least 36 h before performing the experiment. Testing different cell densities for cell seeding is often meaningful to identify the best experimental conditions.\nAdd the cell suspension to the wells of the electrode array and let the sells settle down at room temperature for 10 – 15 min in order to ensure homogenous distribution of cells on the bottom of the wells.\nGrow cells for at least 36 h in a standard cell culture incubator with 5% CO2 (dependent on medium type) at 37 °C and humidified atmosphere. Change cell culture medium 24 h prior to the experiment.\nOn the day of the experiment, inspect the cell layers on the electrode arrays by (phase contrast) microscopy to ensure complete coverage of electrodes with cells.\n2. Equilibration of cells in serum-free medium\nPre-warm serum-free medium, in this study: Leibovitz's L15 medium.\nRemove cell culture medium from cells grown on electrode arrays and replace by pre-warmed serum-free medium. Use 200 µL for 8-well format electrode arrays, and 150 µL for 96-well electrode arrays.",
    "Let the cells equilibrate in serum-free medium at 37 °C for at least 2 h. The equilibration time strongly depends on the cell type. For example, U-373 MG cells need 2 h, CHO cells need 4 h, BAEC may require overnight equilibration in L-15 medium.\n\tNOTE: L-15 medium is CO2 independent and requires a CO2-free atmosphere. For equilibration in L-15 set the incubator to 0 % CO2. Equilibration can be monitored by impedance readings, which we recommend to do for the first experiments.\n3. Monitoring cell equilibration with impedance readings\nPlace the electrode array into the connecting array holder of the impedance analyzer.\nEnsure proper low impedance contact between electrodes and impedance analyzer. This check is individually different for different instruments.\n\tNOTE: If the instrument fails to make connection to the electrodes, open the contact clamp again, readjust the electrode array for proper positioning inside the holder and retry.\nSelect electrode type and/or multi-well format from the user interface of the software.\nSet up the measurement parameters. Different options are available.\n\tNOTE: To select the most sensitive AC frequency, we refer to the literature and instrument manuals as it depends on electrode layout and cell type under study. Typically, the sensing frequency is in the range of 4 kHz – 50 kHz. Here, U-373 MG cells were grown on circular working electrodes of 250 µm diameter and they were monitored at an AC frequency of 12 kHz.\n\t\nIf single and multiple frequency data acquisition modes are available, select the single frequency mode to ensure maximum time resolution. The measurement will be performed at this single frequency. For the most widely spread instruments, there is a number of pre-set frequencies along the available frequency window.",
    "If the number of wells under study is low or time resolution is not critical, select multiple frequency recordings instead. Impedance readings at a specified number of frequencies will be recorded for every well for later in-depth analysis.\n\t\tNOTE: The time resolution decreases with increasing number of frequencies recorded per well and increasing number of wells. The options for frequency and data acquisition mode selection vary with instrument type and version.\nStart acquisition of time course data.\nFollow the cell layer impedance (at least 2 h) until the impedance has stabilized. In the meantime, prepare the agonist solutions.\nWhen the cell layers have reached a stable impedance level, either (i) proceed to the serial agonist addition within the same experiment or (ii) terminate data acquisition and start a new dataset for monitoring agonist-induced receptor activation.\n4. Preparation of agonist solutions for experiments in agonist mode\nCalculate the concentration of agonist solutions as needed for each step of serial dosing according to equation (1). n ranges from 1 to the total number of serial additions i. x denotes concentration and volume in the well at step n. y denotes concentration and volume of the \"solution-to-be-added\" in step n.\nimgsrc://cloudfront.jove.com/files/ftp_upload/60686/60686equ01.jpg",
    "NOTE: Consider the number of replicates and calculate the total volume of \"solution-to-be-added\" for each concentration step. Results of a typical calculation are given in Tables 1-4. It takes a general idea about the agonist concentration range to be studied as the range defines the concentrations and number of portions to be administered during serial addition. Using the serial agonist addition protocol the agonist concentration is increased stepwise. Therefore, the amount of agonist already in the well when the next dose is added has to be taken into account. When the number of agonist molecules already present in the well is nx = cx ∙Vx (with the current concentration cx and volume Vx) and the number of molecules in the well after the next addition is nx+y, the number of molecules to be added ny is determined by the concentration cy and volume Vy of the solution to be applied to the well (ny = cy ∙ Vy). After adding a portion of agonist, the new amount of agonist molecules in the well is: cx+y ∙ Vx+y = cx ∙ Vx + cy ∙ Vy. This calculation applies for each subsequent step. Because of the interdependence of agonist concentration in the well and the amount of agonist in the portions to be added with each step, it is important to define final concentrations after each step in advance.\nMode 1: The volume in the well will increase with each step as liquid is continuously added.\nUsing this mode and an 8-well format, use Vx1 = 200 µL and Vy1 …. Vyi = 30 µL.\nMode 2: The volume in the well is constant as the volume added with each step is removed just before the subsequent addition.",
    "Using this mode and a 96-well format, use Vx1 = 150 µL and Vy1 …. Vyi = 75 µL.\nPrint the data sheet with the total volume per concentration and detailed instructions for pipetting.\nPrepare all solutions in the required amount. Make all agonist solutions in the same serum-free medium as used for equilibration of the cells.\n\tCAUTION: Histamine dihydrochloride is considered hazardous by the 2012 OSHA Hazard Communication Standard (29 CFR 1910.1200). Histamine causes skin irritation, serious eye irritation, may cause an allergic skin reaction, allergy, asthma symptoms or breathing difficulties if inhaled and may cause respiratory irritation. Please consider the safety data sheet.\n\tNOTE: Make agonist solutions as fresh as possible. Stability of agonists in solution may vary considerably. Store solutions at 4 °C or below until use in the experiment. For some molecules additional stabilizing additives, like BSA when using peptide-based or lipid-based molecules, may be considered to prevent adsorption to the walls of wells and tubes.\nIf performing the experiment in 96-well format, transfer solutions to a conventional 96-well plate (no electrodes) and use an 8- (or 12-) channel pipet for quick liquid transfer to the electrode array.\n5. Preparation of agonist solutions for experiment in antagonist mode\nNOTE: Prepare the antagonist solution(s) with the concentration to be applied throughout. Volume and concentration of antagonist solution depend on the mode of agonist addition (1 or 2). Examples for experiments in 8-well or 96-well format in addition mode 2: (A) 8-well format (Vx1 = 200 µL, VAntagonist = 200 µL); (B) 96-well format (Vx1 = 150 µL, VAntagonist = 75 µL).\nCalculate the concentration of each agonist solution needed for each step of serial dosing as described in step 4.1.",
    "Make all agonist solutions in the same serum-free medium as used for equilibration of the cells and add the antagonist at the same final concentration as planned for the respective wells in the experiment.\n\tNOTE: In this case the histamine stock solution (10 mM) is prepared in L-15 medium. When agonists are dissolved in other solvents (e.g., dimethyl sulfoxid (DMSO), ethanol) a solvent control should be included to account for the increasing solvent load with each step of addition.\n6. Performing the serial addition protocol in agonist mode\nStart data acquisition as described in steps 3.1 – 3.5.\nPre-warm the agonist solutions prior to use by placing them in the incubator about 10 – 15 min before addition.\n\tNOTE: When using thermo-labile substances, the solutions should not be kept at 37 °C for too long. If pre-warming for 10 – 15 min is considered critical, bring solutions to 37 °C shortly before addition in a water bath.\nRun the agonist serial dosing dependent on the selected addition mode. Following mode 1 the total volume in the well increases with each addition of the next dose. In mode 2 the same volume which is added with each step is also removed again just before adding the next higher dose.\n\tNOTE: Time needed for equilibration of the cell layer in between two subsequent agonist doses depends on the cells' response time. An initial experiment in parallel mode (one well – one concentration) reveals (i) cell response times for different agonist concentrations and (ii) the most sensitive curve parameter (e.g., impedance maximum, impedance after time x).\nA: Mode 1 / 8-well format\nAdd 30 µL of the first solution with the lowest concentration of agonist to the cells that were equilibrated in 200 µL of serum-free medium.",
    "Let the cells respond and equilibrate for the pre-defined period of time (e.g., 15 min).\nAdd 30 µL of the second solution with the next higher concentration.\nRepeat steps 6.3.1-6.3.3 with the third, fourth, and so on, agonist solution.\n\tNOTE: Working with 10 concentration steps will result in a total volume of 500 µL in the end of the experiment, which is just below the maximum applicable volume of these wells of ~ 550 µL.\nB: Mode 2 / 96-well format\nNOTE: Pause data acquisition during each liquid handling step (addition/removal) via the impedance instrument's software when running experiments in 96-well format. The more elaborate liquid handling may interfere with data acquisition. Use a multi-channel pipette.\nPause data acquisition.\nAdd 75 µL of the first solution with the lowest concentration of agonist to the cells that were equilibrated in 150 µL of serum-free medium.\nResume data acquisition.\nLet the cells respond and equilibrate for the pre-defined period of time (e.g., 15 min).\nAbout 1 – 2 min before the regular equilibration time ends, pause the measurement and remove 75 µL from each well.\n\tNOTE: The time point at which solution should be removed depends on the number of wells monitored in parallel and the pipetting speed. Time needed for removal of the solutions should not exceed the time between subsequent steps.\nAdd 75 µL of the second solution with the next higher concentration and resume the measurement.\nRepeat steps 6.3.8-6.3.10 with the third, fourth, and so on, agonist solution.\n7. Performing the serial addition protocol in antagonist mode\nStart the measurement as described in steps 3.1 – 3.5.\nDuring equilibration of the cell layers, prepare antagonist solution (e.g., 200 µL of 1.5 µM diphenhydramine hydrochloride in L15 medium).",
    "CAUTION: Diphenhydramine hydrochloride has potential acute health effects. It is harmful if swallowed or inhaled, may cause eye and skin irritation. It may cause respiratory and digestive tract irritation. Please consider the safety data sheet.\nPre-warm the antagonist and agonist solutions by placing them in the incubator about 10 – 15 min before addition to the cell cultures (cf. 6.2). If antagonist-free wells are included in the assay as well, also pre-warm serum-free medium.\nAdd the antagonist solution to the designated wells. Let the cells equilibrate with antagonist for 15 – 20 min. If antagonist-free wells are included, add the same volume of serum-free medium to these wells.\nAccording to antagonist addition in mode 2, remove solution from the wells\n\t(A) 8-well format (200 µL)\n\t(B) 96-well format (75 µL)\nRun the agonist addition sequence as described in step 6.3.\n8. Data export and analysis\nExport data using the impedance instrument's software in order to convert all recorded data from proprietary into common data formats (e.g., csv). This step allows for data re-organization and presentation with other software packages.\nLoad the csv-formatted data to scientific data analysis software.\nNormalize impedance values by subtracting the impedance of the last data point before the first addition of agonist solution and by setting the time of addition to t = 0. Plot the time course of normalized impedance.\nPlot the individual time courses and identify the maxima in impedance after each addition step. Compose a data sheet with these values.\nPlot the values of maximum (or minimum, if applicable) impedance changes as a function of agonist concentration. This can be done for individual wells or for the averages (mean ± SD).",
    "Use a data fitting routine to determine half-maximal effective concentrations (EC50) and maximum response (EMax) by using the four parameter logistic model (equation 2):\nimgsrc://cloudfront.jove.com/files/ftp_upload/60686/60686equ02.jpg\nNOTE: c indicates the agonist concentration, A1 is the minimum and A2 is the maximum asymptote of the sigmoidal dose-response curve (A2 = EMax). EC50 is the concentration at the inflection point of the curve, and n corresponds to the Hill slope.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}