{
  "id": 2476,
  "origin_website": "Cell",
  "title": "Evaluation of mTORC1 signaling in mouse atherosclerotic macrophages by flow cytometry and immunofluorescence",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nHarvest whole aorta and aortic root\nTiming: 20 min\nPerfusion and exposure of aorta.\nPrepare 1.7 mL tubes containing pre-cooled DMEM medium, OCT medium and disposable base molds before dissection.\nEuthanize mouse with carbon dioxide chamber.\nPlace mouse on a surgical board and sterilize the body using 70% ethanol.\nOpen the skin and expose the chest cavity using tweezers and dissecting scissors, then cut through the ribcage to expose the heart.\nTake the syringe containing 30 mL PBS and insert the 21-g needle into the apex of the left ventricle.\nCut the right atrium to let the blood flow out.\nStart injecting PBS into the lumen of ventricle slowly.\nNote: The liver should become pale after perfusion.\nCarefully remove all other organs/tissues from the coelom except the heart and aorta.\nPrepare the aorta and heart samples.\nRinse the coelom with PBS and remove extra liquid with sterile gauze, then transfer the mouse into the platform of dissection microscope.\nSeparate the aorta from the dorsal surface of the coelom with sterile micro-scissors and micro-forceps.\nCarefully remove the perivascular adipose tissue along the aorta while avoid cutting the aortic wall (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1986-Fig1.jpg\nFigure 1. Representative pictures of exposing and isolating heart and aorta from ApoE KO mouse fed with Western diet for 2 months\n(A) Exposure of heart and aorta after perfusion and removing adipose tissue. Organs are labeled in the schematic diagrams. Plaques inside the aorta are indicated by black arrows.\n(B) Presentation of heart and aorta after removal from mouse. Plaques inside the aorta are indicated by white arrows.\nCut the aorta above the base of heart and make sure keeping the intact of aortic arch, innominate artery, carotid arteries and subclavian arteries (Jeong et al., 2018[href=https://www.wicell.org#bib2]).",
    "Transfer the aorta immediately into a 1.7 mL tube filled with pre-cooled DMEM medium and keep on ice before digestion.\nTake the heart and cut it into halves using a razor. Put the half of heart into a base moldand make sure the heart lies vertically inside the chamber with the aortic root on the bottom. Add enough OCT medium to embed all tissues inside.\nPut the chamber containing heart into −80°C freezer for frozen sectioning.\nCritical: Perivascular adipose tissue should be completely removed from the aorta to prevent contamination from adipose tissue macrophages (ATMs) (Figure 1[href=https://www.wicell.org#fig1]B).\nEnzymatic digestion of aorta and preparation of single-cell suspension\nTiming: 45 min\nPut the aorta into a sterile dish containing 0.5 mL digestion buffer and mince finely using a razor.\nTransfer the aorta with a pipette into a 15 mL tube, centrifuge 700 rpm (50 × g) for 5 min at 4°C, discard the supernatant, and then add 3 mL pre-warmed digestion buffer to re-suspend the pellet.\nPlace the tube containing minced aorta on a shaker at 37°C to digest. Shake the tube every 10 min for a thorough digestion (may take 30–40 min).\nPrepare a 50 mL tube containing 5 mL pre-cooled complete DMEM. Place a 70 μM cell strainer into this tube then add the mixture after digestion through the cell strainer. Wash the strainer once with 2 mL pre-chilled DMEM Complete Medium.\nNote: A pellet should be visible after the washing step.\nTo stop the digestion process, add 500 μM EDTA into the strained mixture to a final concentration of 1 μM and mix well.",
    "Centrifuge the mixture at 700 rpm (50 × g) for 5 min at 4°C, remove the supernatant, and re-suspend the pellet with 1 mL red cell lysis buffer. Transfer to a 15 mL Eppendorf tube and incubate on ice for 5 min.\nAdd 5 mL cold FACS buffer and centrifuge cell suspension at 700 rpm (50 × g) for 5 min at 4°C, discard all the supernatant and keep the tube on ice.\nCritical: The digestion step should not exceed 45 min. Long-term enzymatic digestion can lead to increased cell death and generation of cellular debris.\nExtracellular staining for flow cytometry\nTiming: 45 min\nRe-suspend the cell pellet with 10 μL Fc block solution, keep the tube on ice and incubate in the dark for 5 min.\nAdd 90 μL prepared antibody cocktail (Table 1[href=https://www.wicell.org#tbl1]) into the tube, mix well and incubate on ice in the dark for 30 min.\ntable:files/protocols_protocol_1986_10.csv\nAdd 500 μL FACS buffer into the mixture, wash cells twice by centrifuging at 2500 rpm (630 × g) for 5 min at 4°C.\nDiscard all the supernatant, add 500 μL 2% PFA to re-suspend cells while vortex the tube gently, then keep the tube in the dark at 4°C before intracellular staining.\nNote: Protect samples from light for next step (intracellular staining).\nPause point: Samples can be kept at 4°C for 6–12 h until ready to proceed to the next step.\nIntracellular staining for flow cytometry\nTiming: 2 h\nCentrifuge the fixed cells at 5000 rpm (2,400 × g) for 5 min at 25°C, remove all the supernatant and wash the pellets with 1 mL PBS.\nDiscard supernatant and add 500 μL permeabilization/blocking buffer to re-suspend the pellets, then incubate at 25°C in the dark for 30 min.",
    "Centrifuge at 5000 rpm (2,400 × g) for 5 min at 25°C, remove all the supernatant and add 100 μL anti-mouse p-S6 (1:150 diluted in permeabilization/blocking buffer). Mix well and incubate at 25°C in the dark for 30 min.\nWash the cells by adding 500 μL washing buffer and centrifuge at 5000 rpm (2,400 × g) for 5 min at 25°C. Repeat once more.\nDiscard all the supernatant and add 100 μL Alexa Fluor 488-conjugated secondary antibody (1:200 diluted in permeabilization/blocking buffer). Mix well and incubate at 25°Cin the dark for 30 min.\nWash the cells twice with 500 μL washing buffer. Remove all liquids after washing and re-suspend the cells in 300 μL washing buffer.\nRemove debris by filtering the cell suspension through a 70-mm cell strainer into a 50 mL tube, then transfer the liquid into a 5 mL FACS flow tube.\nAnalyze the samples with a flow cytometer.\nImmunofluorescence staining of aortic roots\nTiming: 1–2 days\nMake frozen sections (10 μm) using a cryostat. Start collecting sections when plaque lesion appears and stop when most of lesion areas are gone. The slides can be kept at −80°C for 6 months.\nSelect the slide containing the sections with the largest lesion area. Embed this slide into 10 mL pre-chilled 4% PFA at 4°C for 15 min.\nWash the slide 3 times by adding pre-chilled (4°C) PBS onto the surface of the slides with a pipette, with subsequent gentle shaking every 1–2 min.\nBlock/permeabilize the sections in Roth Buffer at 25°C for 1 h.\nIncubate the slide with the first primary antibody (Rat anti-mouse CD68 diluted at 1:250 in Roth buffer) at 25°C for 2 h.",
    "Optional: The incubation with primary antibody can be alternatively done at 4°C for 12 h, then transfer the slides into 37°C for 30 min before moving to the next step.\nWash the slide with cold PBS for 5 min. Repeat the washing twice.\nIncubate the slide with the correlating secondary antibody (Alexa Fluor 594 conjugated goat anti Rat IgG diluted at 1:250 in Roth buffer) at 25°C for 1 h.\nWash the slide with cold PBS for 5 min. Repeat the washing twice.\nIncubate the slide with the second primary antibody (Rabbit anti-mouse phosphor-RPS6 diluted at 1:100 in Roth buffer) at 25°C for 2 h.\nOptional: The incubation with primary antibody can be alternatively done at 4°C for 12 h, then transfer the slides into 37°C for 30 min before moving to the next step.\nWash the slide with 100 mL cold PBS for 5 min. Repeat the washing twice.\nIncubate the slide with the correlating secondary antibody (Alexa Fluor 488 conjugated goat anti Rabbit IgG diluted at 1:200 in Roth buffer) at 25°C for 1 h.\nWash the slide with cold PBS for 5 min. Repeat the washing twice.\nStain the nucleus using 1× DAPI stock in PBS for 3 min at RT.\nWash the slide with 100 mL cold PBS for 5 min. Repeat the washing twice.\nRemove all the liquid on the surface of sections, lay one drop of Vectashield® fluorescence mounting medium around the sections on slide, then slowly put the coverslip on the slide.\nDry the slide in the dark for 4 h, then it is ready for imaging with a confocal microscopy.\nCritical: Protect the samples on the slides from drying out during the staining process."
  ],
  "subjectAreas": [
    "Cell Isolation",
    "Immunology",
    "Flow Cytometry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology"
  ]
}