{
  "id": 17178,
  "origin_website": "Jove",
  "title": "A Rabbit Aortic Valve Stenosis Model Induced by Direct Balloon Injury",
  "procedures": [
    "All animal research procedures were approved and performed in accordance with the Laboratory Animals Welfare Act, the Guide for the Care and Use of Laboratory Animals, and the Guidelines and Policies for Animal Experiments provided by the Institutional Animal Care and Use Committee (IACUC) at the College of Medicine of The Catholic University of Korea (approval number: CUMC-2021-0176-05). The present study utilized 3 month old male New Zealand white (NZW) rabbits weighing 3.5-4.0 kg, which were maintained under standard conditions in individual cages. The rabbits were fed either a normal diet or a 0.5% cholesterol-enriched diet supplemented with 50,000 U of vitamin D2 (see Table of Materials). The experimental design and analysis methods for the induction of the AVS rabbit model are depicted in Figure 1.\n1. Preparation for the operation\nEnsure that all the medical and surgical instruments (see Table of Materials) are sterilized at the beginning of the operation.\nPrepare the dilation balloon catheter set following the steps below.\n\t\nConnect the in-deflation device filled with a mixture of saline and commercially available contrast medium (1:1) to the luer lock part of the balloon catheter (see Table of Materials).\nFill the balloon with inflation solution, and remove any air from the balloon catheter.\n\t\t​NOTE: For the present study, the inflation solution consisted of 30% iodixanol with 0.9% saline (see Table of Materials).\nVerify proper balloon inflation by purging the balloon lumen with the inflation solution.\n2. Surgical procedure for the aortic valve injury\nAdminister an intramuscular injection of tiletamine & zolazepam (15 mg/kg) and xylazine (5 mg/kg) (see Table of Materials) to anesthetize the animal.",
    "NOTE: Before administering the anesthesia, the rabbits were pre-treated with a subcutaneous glycopyrrolate injection (0.05 mg/kg) as a pre-anesthetic anticholinergic agent. The adequate anesthesia level was determined by a combination of criteria, including a lack of response to a toe pinch and a steady respiratory rate.\nInsert a 24 G intravenous (IV) catheter into the marginal auricular vein, and connect an infusion set with heparinized saline (100 U/kg heparin).\nConnect the rabbit with a multiparameter veterinary monitor (see Table of Materials) to continuously monitor the vital signs, such as the oxygen saturation signal (SpO2), temperature, and blood pressure.\n\tNOTE: For the SpO2 monitoring, attach the SpO2 sensor to the rabbit's tongue. For the temperature monitoring, insert the probe into the rabbit's rectum. For the blood pressure monitoring, place the cuff on the forelimb.\nPlace the rabbit in a supine position on an operating table equipped with a C-arm fluoroscopy (see Table of Materials), and remove the hair from the ventral neck area using animal hair clippers (Figure 2A).\nSterilize the incision area with iodine, and cover the rabbit with surgical towels.\nPosition the rabbit's heart at the center of the C-arm image.\n\tNOTE: All researchers must wear protective gear with attached thermoluminescent dosimeters (TLDs) to reduce radiation exposure while performing the C-arm-guided surgery.\n\t\nTurn on the C-arm, and select the fluoroscopic mode for cardiac imaging.\nAdjust the position of the rabbit to ensure that the heart is at the center of the imaging field.\nMake a longitudinal incision of approximately 3 cm in the skin of the neck, and use surgical scissors to cut the fascia and fat tissue.\nExpose the left common carotid artery (LCCA) by carefully separating the muscles until approximately 3-3.5 cm of the LCCA is exposed (Figure 2B).",
    "Ligate the LCCA with a 3-0 silk suture (see Table of Materials) at the top and end of the exposed LCCA to stop the blood flow.\nInsert a 22 G IV catheter into the LCCA, and introduce a guide wire (0.016 in, see Table of Materials) into the left ventricle (LV) through the IV catheter, ensuring that the tip of the catheter is properly positioned in the imaging field of the C-arm.\n\tNOTE: When inserting the IV catheter, carefully loosen the ligature suture on the way down to the aortic valve to allow for the advancement of the catheter.\nWithdraw the IV catheter, leaving the guide wire, and place a 4-F sheath (see Table of Materials) over the guide wire into the LCCA to introduce the balloon catheter (Figure 2C).\n\tNOTE: After replacing the IV catheter with the sheath, any trapped air should be removed from the sheath device.\nCarefully insert the 8 mm balloon catheter over the guidewire into the aortic valve under C-arm fluoroscopic guidance (Figure 2D).\nPlace the balloon catheter tip approximately 1-2 cm distal to the aortic valve, and inflate the balloon by purging the inflation solution with a pressure inflator at 6 atm.\nAdvance the balloon into the LV apex, and pull it back into the LV outlet. Repeat this procedure five times, and then deflate the balloon (Figure 2E, F).\nRepeat steps 2.8-2.9 three times to ensure adequate valve injury.\nWithdraw the balloon catheter and guidewire. Slowly remove the sheath from the LCCA, and immediately tie the LCCA with the suture on the way down to the aortic valve.\nClean the incision area with saline to remove the blood clots, and inspect the punctured site for arterial bleeding.",
    "Close the muscle and skin with a 3-0 non-absorbable suture, and sterilize all the sides of the wound with iodine.\n3. Post-operative care\nRemove the monitoring patches and clips, and keep the rabbit in an intensive care incubator.\n\tNOTE: After surgery, the rabbits were closely observed for 1 day in an intensive care incubator and then moved to a home cage.\nManage post-operative pain with 5 mg/kg tramadol and 3 mg/kg ketoprofen and administer antibiotics (4 mg/kg gentamicin) twice daily for 3 days via subcutaneous injection (see Table of Materials).\n\tNOTE: Post-operative pain management should adhere to veterinary and IACUC guidelines (e.g., opioid, NSAID, local anesthetic or combination).\nFeed a 0.5% cholesterol-enriched diet with 50,000 U of vitamin D2 (HC + VitD2) for 8 weeks.\n4. Echocardiography\nAfter 8 weeks of balloon injury, anesthetize the rabbit using the same procedure described in step 2.1.\nVisualize the aortic valves using two-dimensional transthoracic views, and record M-mode images in short-axis and long-axis views.\n\t\nPlace the rabbit in a supine position on an echo table.\nShave the chest area using clippers and hair removal cream.\nApply ultrasound transducer gel (see Table of Materials) to the chest.\nAdjust the transducer to obtain the parasternal long-axis view and the parasternal short-axis view of the aortic valve.\nUse M-mode imaging to record images of the aortic valve in both long-axis and short-axis views, and save the images for later analysis.\n5. Histological analysis\nAfter the echocardiography, euthanize the rabbit by administering an intravenous injection of potassium chloride (KCl, 3 g/20 mL, 1 mL).\nOpen the thoracic cavity, harvest the heart with the ascending aorta7, and place it on ice in phosphate-buffered saline (PBS).\nImmediately immerse the heart in a 4% paraformaldehyde (PFA) solution, and embed it in a paraffin block (see Table of Materials).",
    "Cut the paraffin-embedded heart block into 4 µm thick sections using a microtome, and stain the sections with Masson's trichrome (MT), Alizarin Red, and von Kossa (see Table of Materials) to assess the collagen deposition and valve calcification, respectively8,9.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}