{
  "id": 8453,
  "origin_website": "Jove",
  "title": "Minimizing Hypoxia in Hippocampal Slices from Adult and Aging Mice",
  "procedures": [
    "The protocol is carried out in accordance with the Guide for the Care and Use of Laboratory Animals of the National Institutes of Health and approved by the Stanford University Institutional Animal Care and Use Committee. Methods are also in accordance with the Policies of the Society for Neuroscience on the Use of Animals and Humans in Neuroscience Research.\nNOTE: All mice were maintained in a pathogen-free environment. Wild-type mice on mixed C57Bl/ 6 x SV/ 129J genetic background were used here, unless otherwise noted.\n1. Setup\nPrepare 1 L of 1x aCSF (in mM): 125 NaCl, 26 NaHCO3, 2.3 KCl, 1.26 KH2PO4, 1.3 Mg2SO4·7H2O, 2.5 CaCl2, 25 glucose (Table 1). Use this solution for the recovery chamber and subsequent recordings.\n\tNOTE: Store aCSF as a 10x stock solution that contains NaCl, NaHCO3, KCl, and KH2PO4. Store Mg2SO4·7H2O and CaCl2 as 1 M stock solutions. Prepare the working solution on the day of experiment from the above stock solutions, and add glucose before adjusting the final volume with 18 MΩ water.\n\tNOTE: Depending on the brain region or mouse strain, chilled aCSF can be also used for transcardial perfusion with success11,15,26.\nPrepare 300 mL of NMDG-aCSF (in mM): 135 NMDG, 1 KCl, 1.2 KH2PO4, 1.5 MgCl2, 0.5 CaCl2, 20 choline bicarbonate, 10 glucose (Table 1). This volume of NMDG-aCSF is sufficient for both transcardial perfusion and cutting steps.\n\tNOTE: Store NMDG-aCSF as a 3x stock solution at 4 °C. Prepare working solution on the day of the experiment; add choline bicarbonate and glucose before adjusting the final volume with 18 MΩ water. Bubble the solution with 95%O2/5%CO2 to buffer it, and saturate with oxygen.",
    "NOTE: NMDG stock starts as highly alkaline, and requires concentrated hydrochloric acid (HCl) to adjust pH to ~7.4. Addition of hydrochloric acid should be slow once below pH 8, as it is easy to acidify the solution to ~pH 3 with excess HCl. This adjustment should be done prior to adding divalent cations. This NMDG-aCSF recipe is sodium-free. Previously published NMDG recipes use 30 mM NaHCO3 for buffering, which results in 30 mM sodium present in NMDG-aCSF13,20.\nSet the vibrating microtome cutting tray and mounting disk to -20 °C.\nPrepare the recovery chamber.\n\t\nFill the recovery chamber to just above the slice-holding mesh, keep it on the bench at room temperature, and bubble.\n\t\tNOTE: The slice recovery chamber used here is very similar to the classical chambers described previously by Edwards and Konnerth3. aCSF is kept in a glass beaker (400 mL) that holds a round acrylic frame with black nylon mesh glued to the bottom. The acrylic frame is suspended in the middle of the beaker via an acrylic hook resting over the edge of the beaker. The glass bubbler is inserted all the way to the bottom. The design allows for oxygenation of both sides of slices. Bubbling also provides constant mixing of aCSF in the recovery chamber. The black mesh provides a high contrast against the off-white slices, which are then easier to see.\nPrepare the transcardial perfusion and cutting solution.\n\t\nChill the entire 300 mL of NMDG-aCSF in a freezer, until ice crystals start to form on the surface and the walls of the bottle. DO NOT over-freeze!\nPlace the bottle with chilled NMDG-aCSF on ice and bubble. The solution should be between 0‒2 °C.",
    "NOTE: Slushy NMDG- aCSF implies having most of the solution as liquid, while a small fraction of slushy ice present will keep the solution near 0 °C throughout perfusion and cutting. Care should be taken to keep away ice crystals from the brain during cutting.\nPrepare the tissue-mounting disk.\n\t\nTake the disk out of the freezer, wipe it dry if needed.\nCut out a block of 5% agar from the previously prepared agar plate, and glue it in the center of the disk using a thin layer of cyanoacrylate glue. The agar piece should be about the size of a mouse brain. Place the disk with glued agar on ice, and cover with paper towels until it is ready to use.\n\t\t\nFor 5% agar plate, dissolve 5 g of agar in 100 mL of 18 MΩ water by microwaving, and pour into a clean petri dish. Keep at 4 °C.\nTake the cutting tray out of the freezer, place it into the microtome, surround it with ice, and load the blade.\n2. Transcardial perfusion and brain extraction\nOverdose mice via an intraperitoneal injection of anesthetic cocktail. Check for the anesthesia depth by checking the pain reflex (toe pinch); a mouse should not exhibit the reflex once it reaches deep anesthesia.\n\tNOTE: Rodent anesthesia cocktail recipe: Ketamine HCl (66 mg/mL), xylazine HCl (6.6 mg/mL), acepromazine maleate (0.1 mg/mL), 18 MΩ water to final volume. Dose: 0.4 mg/g body weight, 0.04 mg/g body weight, 6 x 10-4 mg/g body weight for ketamine, xylazine, and acepromazine, respectively.\nSet-up the peristaltic pump for transcardial perfusion. Insert one side of the pump tubing into the bottle with iced NMDG-aCSF. Fit the other side of the tubing with the 27 G needle that will be inserted into the left ventricle.",
    "Set the pump speed at approximately 3.5 mL/min. At this speed, the outflow of NMDG-aCSF is a fast drip, not continuous flow.\n\tNOTE: Perfusion by gravity is a good substitute for the peristaltic pump perfusion, as long as the same approximate flow-rate can be achieved. A perfusion at high flow-rate will result in burst blood vessels in the brain. A telltale sign of an overly fast perfusion and increased pressure in blood vessels is solution coming out of the nose of the animal.\nPerfusion\n\t\nPlace the properly anesthetized mouse on its back on a diaper. Using paper tape, tape down its front and hind legs so that the chest and abdomen are exposed.\nCut out a large patch of the skin atop of the chest, going from below the sternum to the throat; this should provide a large working area. Grab the sternum with forceps, lift gently, and start cutting through the rib cage on both sides until the chest cavity is exposed.\nCut through the diaphragm in order to expose the chest cavity. The flap of the rib cage should be left attached via a thin piece of muscle. It should be possible to set it on a side without having it fall back onto the exposed chest cavity. Check that the heart is still beating. Ensure that most of the liver is visible.\nInsert the 27 G needle into the left ventricle; the mouse’s left ventricle looks lighter in color than the right. Locate the dark red-colored right atrium. Cut through the right atrium with small scissors; the blood should start flowing out.",
    "Start the pump that has been preset to the correct flow speed. If everything was done correctly, the liver should start to change color from red to brown soon after the start of perfusion. Monitor the liver color to determine the length of the perfusion; the liver should turn pale brown.\nRun the pump for few more minutes. If using rectal thermometer, the body temperature should fall down to 28‒29 °C, and animal’s nose should be cold to the touch.\nBrain extraction.\n\tNOTE: For this step, have the following dissection tools ready: decapitation scissors, small scissors with straight or angled blade, scalpel and #10 blade, single edge blade, #3 forceps, spatula with one side bent to 90°, a spatula, a “60°” tool (Figure 1A,B), and a small soft brush.\n\t\nDecapitate the mouse with large decapitation scissors. Using a scalpel with #10 blade, cut open the skin on top of the skull. With small angled scissors, cut the skull at the midline. Next, using the #3 forceps, pry away the right and left halves of the skull, being careful to take the dura away with it. The brain should be exposed now.\n\t\tNOTE: If the dura detaches from the skull, it will stay over the brain and has to be removed separately. The edges of the remaining dura can tighten and slice deep through the brain, potentially damaging the brain region of interest.\nRemove the brain by scooping it out with a small spatula. Drop the brain into the NMDG-aCSF solution placed in a separate small beaker on ice. Leave it there for up to a minute.\n\t\tNOTE: In addition to hypothermia, exposure to the ice-cold saline firms up the brain, which is necessary for even cutting. The entire procedure from decapitation to the brain extraction should be under 30 s.",
    "3. Slicing\nTake the brain out of the NMDG-aCSF and place it on a piece of filter paper.\nCut and remove a 60° wedge from the rostral end of the forebrain using a “60°” tool centered at the midline. Cut surfaces will be used for mounting to achieve the proper angle for transversal hippocampal slices as discussed below (Figure 1A,B).\n\tNOTE: Two single-edged blades held together via a home-made holder make an easy-to-use tool for making the 60° cut (Figure 1A).\nSeparate hemispheres down the midline with the scalpel.\nGlue the hemispheres onto the mounting disk as follows. Take the mounting disk that has been on ice until now. If needed, wipe it dry again. Glue each hemisphere in front of the agar block, cut side down.\nEnsure that the ventral side of each hemisphere is touching the agar block. The agar block provides additional support during cutting and is essential for even slices. Dorsal sides of each hemisphere should be facing the blade. When glued on the cut side, each hemisphere is oriented relative to the blade in a way that results in transverse slices of dorsal hippocampus in situ (Figure 1B).\nSubmerge the disk with hemispheres into a cutting chamber containing ice-cold carbogenated NMDG-aCSF.\nCut 400 µm sections. Cutting should be done in less than 10 min. Different microtomes will require different settings to achieve this time. A total of 8‒10 slices from the dorsal hippocampus region will be obtained.\n4. Recovery\nTransfer slices to a recovery chamber containing carbogenated aCSF at room temperature using disposable transfer pipettes with cut-off tips (Figure 1C).",
    "NOTE: It is highly recommended to fortify recovery chamber-aSCF with 5 mM Na-ascorbate and 3 mM Na-pyruvate. Pyruvate is an energy substrate shown to boost the production of ATP in slices28, while Na-ascorbate is a free-radical quencher29.\nIncubate at room temperature (22‒24 °C) for approximately 2 h before recording (up to 4 h).\n\tNOTE: A longer incubation at room temperature results in healthier slices for longer periods of time, relative to the standard incubation at 37 °C for 30 min followed by room temperature incubation. Rewarming at 37 °C can introduce cytotoxic edema13.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}