{
  "id": 11771,
  "origin_website": "Jove",
  "title": "Screening Ion Channels in Cancer Cells",
  "procedures": [
    "1. Immunolabeling ion channels in cultured cells\nPreparing the cells and experimental set-up\n\t\nMaintain the cells as an actively growing culture in 75 cm2 culture flasks. Passage the cells once until they become 50%-90% confluent, depending on the doubling time of the cell line being used.\n\t\tNOTE: For the present study, D283 cells, a Group 3 medulloblastoma cell line, were used.\nCollect the cells from the culture flask into a centrifuge tube (15 mL or 50 mL), and add 2 mL of 0.25% trypsin-EDTA to detach adherent cells. Incubate for 5 min at room temperature (RT). After 5 min, tap the flask three to five times to help detach the cells. Collect the cells in 10 mL of medium with 10% FBS to stop the action of the trypsin.\nCentrifuge at 480 x g for 5 min at RT. Gently aspirate the medium. Do not disturb the cell pellet.\nResuspend the cells in 5 mL to 10 mL of medium, depending upon the density of the culture.\n\t\tNOTE: The density must be consistent with actively growing cells and is dependent upon the confluency of cells in the flask. Visual assessment should be used to approximate the optimal cell density; specifically, the cells should be between 40%-90% confluent and evenly distributed.\nRemove 100 µL of cells, and add to a 1.5 mL tube containing 100 µL of 0.4% trypan blue to mark non-viable cells. Incubate 5-15 min at RT, depending upon the cell line.",
    "Count the cells manually using a hemocytometer (see the Table of Materials) in 10 µL of solution. Count the live, unstained cells in each of the four corners of the 16 squares of the hemocytometer. Multiply the average cell number with the dilution factor and by 10,000 to give the cells per milliliter (cells/mL). Alternatively, an automated cell counter can be used.\nDilute cells to 1 x 105 cells/mL into the culture medium specified for each cell line. Seed 1. 8 mL of cells into each well of a 6-well plate containing a 22 mm x 22 mm coverslip pre-coated with 0.1 mg/mL poly-D-lysine as per the manufacturer's instructions (see the Table of Materials).\n\t\tNOTE: One may want to test the use of both poly-D-Lysine and poly-L-Lysine, as there are reports of cell line-specific preferences17,18. Some cell lines have proteases that can break down poly-L-lysine, while there are reports that poly-D-lysine is toxic to some cell lines. In contrast, neuronal cells, such as PC12, have been reported to be healthier on poly-D-lysine surfaces.\nGrow the cells in an incubator with a humidified 5% CO2 environment at 37 °C overnight to allow the cells to attach to the coverslip. Examine the attachment of the cells under an inverted microscope with a 20x objective.",
    "NOTE: The cells must be fully attached to the coverslip before treatment or direct immunostaining. At this time, the cells can be treated with drugs (or vehicle control) by either the addition of a concentrated stock (for example, 600 µL of a 4x stock solution) or the replacement of the medium with fresh medium containing the drug at the desired 1x concentration; the cells can then be returned to the incubator for up to an additional 48 h. Solvent-treated cells are included to assess the effects of the drug on the level and localization of the target molecule. In the present study, D283 cells were treated with 600 µL of a 3.2 µM solution of a GABAA receptor-positive allosteric modulator, QH-II-06614 (see the Table of Materials), for 48 h. The control cells were treated with an equivalent volume of DMSO.\nPreparation for immunolabeling: Fixation, permeabilization, and blocking\n\t\nRinse the cells with 2.5 mL of 1x PBS (137 mM NaCl, 2.7 mM KCl, 8 mM Na2HPO4, 2 mM KH2PO4, see the Table of Materials), and immediately aspirate the solution.\nFix the cells using 1 mL of 4% PFA in 1x PBS for 1 h at RT.\n\t\tNOTE: While 4% PFA is the standard fixative for immunostaining, glutaraldehyde or glyoxal can also be used to fix membrane proteins for immunofluorescence. Alcohol-based fixation methods, such as treatments with ice-cold methanol, may lead to less well-preserved morphology and a loss of membrane proteins19,20.",
    "Wash six times with 2.0 mL of 1x PBS (5 min per wash) by agitation on a shaker. Incubate for 1 h at RT in a blocking buffer composed of 1x PBS with 0.8% Triton X-100 and 10% normal serum matching the host species of the primary antibody (alternatively, 3% BSA or bovine serum fraction V albumin can be used in place of normal serum).\n\t\tNOTE: This step is employed to block non-specific binding.\nImmunolabeling\n\tNOTE: After adding the antibodies conjugated to fluorophores, measurements must be taken soon to prevent photobleaching. Incubations with conjugated antibodies need to be protected from light. The use of a mounting medium that contains agents that scavenge free radicals will reduce photobleaching. Store the slides in a light-tight, opaque container (at 4 °C) after sealing the coverslips. When imaging, photobleaching can be minimized by limiting the intensity of the excitation illumination and the exposure times.\n\t\nPrepare a humidified chamber by lining the bottom of a 150 mm culture dish with filter paper. Moisten the filter paper with sterile distilled water. Draw a 3 x 2 grid on a piece of laboratory film cut to fit on top of the filter paper, and label it to preserve the orientation of the coverslips in the 6-well plate. Place the laboratory film on top of the filter paper, exposing the upper and lower edges to humidify the chamber.\nPrepare 100 µL per coverslip of the desired dilution of primary antibody in 1x PBS with 3% BSA. To detect the GABRA gene protein product, use rabbit recombinant monoclonal primary antibody at a dilution of 1:200 (Gabra5 antibody, middle region; see the Table of Materials).",
    "NOTE: To empirically determine the primary antibody concentration that produces the optimal signal over background, use a dilution series of the primary antibody while holding the secondary concentration constant. Dilutions of 1:100, 1:250, 1:500, 1:750, and 1:1,000 are recommended to establish optimal primary antibody concentrations.\nTransfer the coverslip from the block solution in the 6-well plate to the proper location on the grid drawn on the laboratory film. Discard the block solution from the 6-well plate, and retain the plate for the wash steps.\nCarefully add 100 µL of diluted primary antibody to the center of each coverslip. Avoid placing the solution over the edge of the coverslip. Incubate for 1 hr at RT.\nAdd 2.5 mL of 1x PBS to each well of the 6-well plate. Transfer the coverslip back to the appropriate location in the 6-well plate.\nPerform six washes for 5 min each with 2.5 mL of 1x PBS.\n\t\tNOTE: Do not allow the coverslips to dry during the rinse steps, as this can contribute to a background fluorescence signal.\nReturn the coverslips to the proper location on the laboratory film. For each coverslip, add 100 µL of secondary antibody diluted in 1x PBS + 1%-5% BSA.\n\t\tNOTE: Initially, secondary antibodies conjugated to Alexa Fluor 488 (see the Table of Materials) are used at a 1:1,000 dilution in 1x PBS + 3% BSA. The secondary antibody concentration may be optimized by increasing the concentration to detect low-abundance target proteins or decreasing the concentration to reduce the background, if necessary.\nFor the remaining steps, minimize the light exposure to prevent the photobleaching of the conjugated secondary antibody. Cover the culture dish with aluminum foil, and incubate for 1 h at RT.",
    "Transfer the coverslips back to the 6-well plate. Using a shaker, perform six washes for 5 min each with 2.5 mL of 1x PBS. Remove the PBS by inverting the plate over the sink or a waste receptacle. After the last wash, leave the PBS in the well to facilitate the removal of the coverslip.\nLabel a microscope slide for each coverslip. Add a drop of glycerol-containing mounting medium with DAPI (to stain the nuclei) (see the Table of Materials) to the center of the slide.\nUsing forceps, remove the coverslip from the well, and gently place it on the drop of mounting medium on the center of the slide.\n\t\tNOTE: Avoid the formation of air bubbles in the mounting medium.\nUse small pieces of filter paper to remove excess mounting medium. Seal the edges of the coverslip with nail polish, and allow the polish to dry completely before imaging. Store the glass slides at 4 °C in an opaque plastic box.\nImaging and analysis\n\t\nAcquire images with a fluorescence microscope under a 40x objective with immersion oil (see the Table of Materials).\nVisualize the fluorescence images with the appropriate filters.\nNOTE: For Alexa Fluor 488, use an excitation/emission of 496 nm/519 nm; for DAPI, use an excitation/emission of 358 nm/461 nm.\nCapture and save the digital image files. A binning value of 4 x 4 is used to facilitate the image collection rates and reduce the background.\nPrepare the final images. The images can be processed with ImageJ or commercially available software. Results are illustrated in Figure 1.\n2. Testing the polarized state of mitochondria",
    "NOTE: This protocol utilizes the TMRE (tetramethylrhodamine, ethyl ester) assay to label the membrane potential in active mitochondria, maintaining a negative charge21,22. TMRE is a cell-permeable, red-orange, positively charged dye accumulating in active mitochondria because of their relative negative charge. Inactive or depolarized mitochondria have reduced membrane potential and fail to proportionally sequester TMRE. FCCP (carbonyl cyanide 4-[trifluoromethoxy] phenylhydrazone), an ionophore uncoupler of oxidative phosphorylation (OXPHOS), depolarizes mitochondrial membranes, thus preventing the accumulation and sequestration of TMRE23. This is illustrated in Figure 2.\nPreparing the cells and experimental set-up\n\t\nMaintain the cells in 75 cm2 culture flasks. Aspirate the culture medium, and rinse the cells with 1x PBS without calcium and magnesium.\nAdd 2 mL of 0.25% trypsin-EDTA to detach the adherent cells. Incubate for 5 min at RT, and resuspend the cells in 10 mL of medium.\nCollect the cells from the culture flask into a 15 mL centrifuge tube. Centrifuge at 480 x g for 5 min at RT. Aspirate the medium.\nResuspend the cells in 5 mL to 10 mL of medium, depending upon the original confluency of the culture, so that the cell concentration is 50-100 cells per square on the hemocytometer. Adjust the volume, if necessary, to provide the needed cell density for accurate counting.\nRemove 100 µL of cells, and add to a 1.5 mL tube containing 100 µL of 0.4% trypan blue. Count the cells using a hemocytometer or automated cell counter. Dilute the cells to 3 x 104 cells/mL in culture medium without phenol red.\n\t\tNOTE: DMEM medium lacking phenol red is used because phenol red exposure inhibits membrane permeability and may contribute to background autofluorescence.",
    "Seed 2.5 mL of the cell suspension (75,000 cells) per well into a 6-well plate containing a 22 x 22 mm coverslip pre-coated with poly-D-lysine as per the manufacturer's instructions (see the Table of Materials).\nGrow the cells in an incubator with humidified 5% CO2 at 37 °C overnight to allow the cells to attach to the coverslip.\nExamine the attachment of cells under an inverted microscope with a 20x objective. The cells must be fully attached to the coverslip before proceeding further.\nPreparing stock solutions\n\t\nTo prepare a 1 mM stock solution (1,000x) of TMRE (MW = 514.96 g/mol) (see the Table of Materials), dissolve 1 mg of TMRE in 1.94 mL of DMSO. Aliquot and store at −20 °C protected from light. Avoid repeated freeze/thaw cycles.\nTo prepare a 50 mM (2,500x) stock solution of FCCP (MW = 254.17 g/mol) (mitochondrial oxidative phosphorylation uncoupler), dissolve 10 mg of FCCP in 786.9 µL of DMSO. Aliquot and store at −20 °C protected from light. Avoid repeated freeze/thaw cycles.\nNOTE: Prepared stock solutions are part of the TMRE Mitochondrial Membrane Potential Assay Kit (see the Table of Materials).\nEstablishing the TMRE concentration for the cell lines\n\t\nPrepare a 500 nM working TMRE solution in cell culture medium. Protect the working solution from light.\nAdd TMRE to cells grown on the coverslips in medium to a final concentration range between 50-200 nM. Do this by first aspirating the culture medium and replacing it with culture medium containing TMRE.\nIncubate for 20 min at 37 °C. Ensure to stagger the treatment times to allow for imaging, since the cells are viewed live.\nWash the cells twice with 1x PBS, and invert the coverslip on a microscope slide labeled with the final TMRE concentration.",
    "Immediately image the live cells (peak Ex/Em = 549 nm/575 nm).\n\t\tNOTE: Immediately image the samples once removed from the culture conditions, since the mitochondrial health is compromised once the cells are removed from the medium and placed on a microscope slide. As an alternative to coverslips, the cells can be imaged in glass-bottom dishes.\nCapture the images using the available microscope and software.\n\t\tNOTE: Establish experimental microscopy imaging parameters during the TMRE concentration optimization process, and maintain the same conditions in subsequent experiments to ensure accurate data comparison. The protocol detailed employed a confocal microscope and compatible software (see the Table of Materials).\nSelect the optimal TMRE concentration, which is cell line-dependent.\n\t\t​NOTE: The TMRE concentration that provides the best signal to resolve changes in mitochondrial TMRE levels is generally the lowest TMRE concentration, giving an even and readily-detectable fluorescence signal.\nTesting the polarized state of a cell\n\t\nAssay preparation\n\t\t\nPrepare the treatment stock solutions at the desired concentrations, and prepare media with the final compound concentration to be assayed. For FCCP, the stock solution should be 20 mM (prepared with DMSO from a 50 mM stock solution).\nWorking on a single coverslip at a time, add 1.8 mL of medium plus the test compound to the cells.\nIncubate the cells with the test compound at 37 °C and 5% CO2 in a humidified environment for the desired period of time.",
    "NOTE: The treatment times will vary depending upon the mechanism by which the test compound may alter the mitochondrial membrane potential. Potent protonophores like FCCP that rapidly and directly depolarize mitochondrial membrane potentials require analysis shortly after treatment (within minutes). In contrast, treatment effects with compounds that indirectly impact the mitochondrial electron transport chain function, such as those that alter protein activation or protein turnover or require protein synthesis, may take longer to show an effect.\nDuring incubation, turn on the microscope, and set it to the predetermined optimal imaging parameters, including in terms of the gain, laser intensity, image capture rate, averaging, and exposure time.\nAfter the drug treatment period, add 200 µL of 10x TMRE (optimal concentration determined above) to the control and drug-treated cells.\nIncubate for 15-30 min at 37 °C in 5% CO2 in a humidified environment. Gently aspirate the medium, and rinse the cells once with 1x PBS.\nRepeat the 1x PBS rinse step to avoid background caused by the cell culture medium or treatment compounds, and invert the coverslip on a microscope slide labeled with the treatment conditions.\nImage the cells live at Ex/Em = 549 nm/575 nm. Using a confocal microscope, collect several z-stack fields with high-speed image capture (512 pixels x 512 pixels, averaging = 4) prior to the loss of cell integrity.\nSave and store the image file for analysis. The procedure is repeated for the next experimental condition.\nExperimental controls\n\t\t\nUse a no-treatment (negative) control, performed as outlined above (steps 3.1.1-3.1.8), lacking the test compound in the medium.",
    "Use a mitochondrial membrane potential disruption (positive) control consisting of the protonophore compound FCCP. Add 1.8 mL of 20 µM FCCP (see the Table of Materials) in medium to the cells. As described above (steps 3.1.1-3.1.2; and cell imaging, as outlined in steps 3.1.3-3.1.8), incubate for 10 min at 37 °C in 5 % CO2 in a humidified environment prior to staining with TMRE.\n\t\t\tNOTE: Both positive and negative controls are required for these experiments.\nQuantification\n\t\t\nMeasure the captured pixel intensities of individual cells from a single representative image from the central region of each z-stack. In this work, a single plane of focus was selected to facilitate analysis.\nAnalyze the pixel intensities from at least 30 cells (in their entirety) per treatment. Use Excel or Prism to average the pixel intensities for each treatment, and present in bar graph format with the standard error of the mean.\n\t\t\t​NOTE: ImageJ can also be used for fluorescence quantification. Alternatively, TMRE staining fluorescence can be quantified with commercial software platforms.\n3. Establishing ion channel function using electrophysiology\nNOTE: The procedure in this section describes the use of an automated electrophysiology assay to screen test compounds in a cancer cell line (Figure 3).\nPreparing the cells\n\t\nHarvest cells from a healthy culture that lacks dead cells and/or cell overgrowth. Use either the chemical cell detachment solution TrypLE or a manual cell scraper to harvest adherent and clustered cells. Dissociate cells that grow in clumps or spheres, which are particularly common amongst CNS cancer cells.\n\t\tNOTE: Gentle dissociation of the cells helps maintain the integrity of the membrane proteins essential for ion conductance.",
    "Centrifuge the cells at 561 x g for 10 min at RT. Discard the supernatant, and suspend the pellet in DMEM (without phenol red), HEPES, and penicillin/streptomycin with 20% FBS and 4 mM L-glutamine (see the Table of Materials) maintained at 37 °C.\n\t\tNOTE: DMEM medium lacking phenol red is used because phenol red exposure inhibits membrane permeability.\nPlate the cells on a poly-L-lysine-coated coverslip at low density, so there is separation between the single cells.\n\t\tNOTE: Poly-L-lysine is used here, and not poly-D-lysine, as poly-L-lysine has better coating properties.\nIncubate the cells at 37 °C and 5% CO2 in a humidified chamber for 12 h to 24 h (an optimum time will need to be established) before taking a recording.\nElectrophysiology recording\n\t\nRemove the medium from the coverslips. Gently wash the cells twice with 1x PBS. Add ~300 µL of TrypLE solution. Using the pipette, gently pipette up/down four to five times until the cells are detached.\nAdd serum-free medium (DMEM) (phenol red-free), and maintain a final cell count per volume of at least 1 million cells/mL. Using a 1 mL pipette, declutter the cells to obtain a cell suspension lacking cell clusters.\nTransfer the cell suspension to a 1 mL tube. Incubate the cells at 4 °C for 10 min to stabilize the cell membrane. Keep the cells rotating on a shaker (gentle cycle) to avoid the formation of cell clumps.\nPrepare the Port-a-Patch setup (see the Table of Materials). Turn on the computer, amplifier, and perfusion system. Open the Patch-Master software, and create a new file.\nBring the buffers (extracellular and internal) to RT, and then load the buffers into the respective perfusion tubes.",
    "NOTE: Recordings of the GABAA receptor require both an \"extracellular (bath) solution\" containing 161 mM NaCl, 3 mM KCl, 1 mM MgCl2, 1.5 mM CaCl2, 10 mM HEPES, and 6 mM D-glucose (pH adjusted to 7.4 using NaOH) and an \"internal solution\" containing 120 mM KCl, 2 mM MgCl2, 10 mM EGTA, and 10 mM HEPES (pH adjusted to 7.2 using NaOH).\nFill the bottom of an electrode chip (manufacturer-provided) with 5 µL of internal solution, and place the electrode chip on the Faraday top of the Port-a-Patch. Add 10 µL of external solution to the chip, and observe the rectangular pulse on the oscilloscope using the Patch-Master software (see the Table of Materials).\n\t\tNOTE: The resistance may be in the range of 2-3 MΩ, but this is cell line-dependent.\nStart recording once the rectangular pulse is visible, after the initial electronic adjustments, and after the software prompts the user to add cells.\nGently add 20 µL of single-cell suspension onto the central part of the electrode, and wait for cell patch followed by a Giga-Ohm seal by observing the resistance values in the software.\nThe live progress of cell patching can be observed on the left column of the software. Once the cell is \"maintained in whole-cell mode\", begin the recordings by opening a protocol within the software.\nSet the holding potential at −80 mV. Run a gap-free continuous recording protocol using the Patch-Master software to record the current from the cell.\nObtain a stable baseline, and switch to a ligand and respective compound application for a specified duration by using the automated perfusion tab on the left panel of the software.\nAcquire data using the Patch-Master software.\n\t\tNOTE: The data are low-pass filtered at 1 kHz and digitalized at 100 kHz.",
    "Perform data analysis by computing the maximum amplitude of the current response using the Nest-o-Patch software (see the Table of Materials).\n4. In vitro potency\nNOTE: This procedure details a MTS assay to determine drug potency. The One Solution Cell Proliferation Assay combines all the required assay reagents into a prepared solution that can be added in one step to cell culture wells to assess the cell viability and proliferation after treatment with experimental compounds. The reagent is reconstituted as per the manufacturer's recommendations (see the Table of Materials), aliquoted, and stored at −20 °C. The section describes the use of the assay to determine the IC50 of test compounds in a particular cell line (Figure 4). This MTS reagent can also be used for the high-throughput screening of large numbers of compounds at known concentrations.\nPreparing the cells\n\tNOTE: The cell number depends upon the growth and metabolism of each individual cell line. Determine the optimal cell number experimentally prior to using the assay to evaluate any investigational treatments.\n\t\nHarvest adherent cells from the culture by trypsinization, and use Accutase (see the Table of Materials) to dissociate the cells that grow in clumps or spheres.\n\t\tNOTE: Glioblastoma and primary medulloblastoma cell lines often require Accutase as they tend to grow in clumps or spheres.\nCount the cells, and make a cell solution with 10,000 cells per well in a 75 µL volume. Make dilutions of the stock for the cell numbers to be tested. Prepare at least 1 mL per dilution.\nPlate 75 µL of each dilution into sets of five consecutive wells in a 96-well plate. Incubate at 37 °C and 5% CO2 overnight in a humidified environment (i.e., an incubator).",
    "NOTE: Cell lines with slow growth or metabolism (that acidify their growth medium in more the 3 days) may require more than 10,000 cells as the upper cell number range, while cell lines that grow rapidly (generally faster than 20 h doubling time) require fewer cells. Cell lines with a high metabolism may require fewer than 1,000 cells per well. The cell range can be adjusted to determine the optimal plating density for the MTS assay for these cell lines.\nMock treatment control\n\t\nAdd 25 µL of medium per well to simulate the addition of the test compound in the MTS assay.\n\t\tNOTE: In the actual MTS assay, 25 µL of a 4x stock of the chosen treatment concentration for the test compound (here a GABAA receptor modulator, QH-II-066) will be added to the cells to give the 1x final treatment concentration in a total volume of 100 µL per well.\nIncubate at 37 °C and 5 % CO2 in a humidified environment for 48 h. This simulates standard incubation in the presence of a drug.\nMTS assay\n\t\nThaw the required aliquots of the MTS reagent. Add 20 µL of MTS reagent per well. Incubate at 37 °C and 5 % CO2 in a humidified environment for 1 h.\nCentrifuge the plate (1,350 x g for 5 min) at room temperature to remove bubbles, which can interfere with the absorbance reading.\n\t\tNOTE: Remove any bubbles with a fine-gauge needle.\nRead the absorbance at 490 nm. Save the data as an Excel file.\nReturn the plates to 37 °C in 5% CO2, and read repeatedly within the 4 h linear range period of the assay.",
    "NOTE: There is no need to re-centrifuge before reading the absorbance. Data from later readings, especially the 2 h reading, may be important for examining how fast a cell line metabolizes the MTS reagent and are useful in selecting the number of cells to the plate for the assay.\nPlot the absorbance optical density (OD) at 490 nm (OD490) versus the plated cell number using Excel or Prism.\nSelect the cell number for the assay. The optimal number of cells will be in the linear range and below saturation (OD490 = 1).\n\t\tNOTE: For cells with slow growth, the highest cell number plated can be adjusted to 20,000 cells per well, and 500 cells per well can be left out of the assay.\nDetermining the IC50\nDay 1: Plate the cells for the MTS assay\n\t\t\nRecord the cell line name and passage number of each line in the study. To counter evaporation during the assay, at a minimum, fill the outer perimeter top and bottom rows and the end left and right perimeter columns of the 96-well plate with 1x PBS, 100 µL per well, to counter evaporation during the assay.\nPlate the optimal number of cells for each cell line as determined prior to the start of the assay. Plate the cells in 75 µL per well of phenol red-free, antibiotic-free medium that does not contain HEPES buffer. The FBS can be increased to 20% to support the growth of the cell lines.\n\t\t\tNOTE: Medium lacking phenol red is used because phenol red exposure inhibits membrane permeability.\nPlate the sample in at least quintuplicate for treatment concentration. Count the cells using a manual or automated hemocytometer.",
    "NOTE: To use a manual hemocytometer, (1) prepare a 1:1 dilution of cells resuspended in medium in trypan blue; (2) incubate 5-15 min, depending upon the cell line; (3) load 10 µL of the cells in trypan blue into the hemocytometer counting chamber; (4) count the viable cells in the four corners and middle squares, and determine the average number of cells per square; (5) calculate the viable cells per milliliter as follows:\n\t\t\t​Viable cells per mL = Average viable cells × 2 (dilution factor) × 104\nUse a sufficient volume to prepare the desired concentration of cells in phenol red-free, antibiotic-free medium that does not contain HEPES buffer (i.e., 75 µL per well x 60 wells per plate = 4.5 mL of cells per plate).\n\t\t\tNOTE: Each plate needs to have a medium-only control for the background subtraction. The medium control can replace the PBS wells if necessary.\nDay 2: Adding the treatment compound\n\t\t\nPrepare the experiments treatments at 4x the desired final concentration to give the desired final concentration when 25 µL of treatment solutions are added to cells plated in 75 µL of medium (= 100 µL total volume per well).\nPrepare the test solutions (in this case, the GABAA receptor modulator QH-II-066) by serial dilution of the highest-concentration stocks. For example, if the final drug concentrations are to be 5.0 µM, 2.5 µM, 1.25 µM, 0.625 µM, and 0.3125 µM, then prepare 1:1 serial dilutions beginning with 20 µM to obtain 10 µM, 5 µM, 2.5 µM, and 1.25 µM concentrations, respectively.",
    "NOTE: Each plate requires two cell-based controls in addition to the medium-only control: untreated cells (medium alone) and cells solvent-treated (often DMSO) at a known concentration. It is good practice to ensure that the vehicle does not affect cell proliferation in the active range of the compound.\nOnce the test compound is added, incubate the cells at 37 °C and 5% CO2 in a humidified environment for 48 h.\nDay 3: Performing the cell proliferation assay (MTS)\n\t\t\nCalculate the volume of MTS reagent needed (20 µL per 100 µL of testing culture), and thaw the required volume of aliquoted MTS reagent (see the Table of Materials).\nVortex, and ensure that the reagent is completely in solution before use. Pipet the thawed reagent into a sterile 25 mL reagent reservoir.\nPipet 20 µL of MTS reagent (using a multichannel pipette) into each well of the 96-well plate containing samples in 100 µL of culture medium.\nIncubate the plate at 37 °C and 5% CO2 in a humidified environment for 1 h to 4 h. Plates can be read at multiple time points. Generally, the plates are read at 1 h and at 2 h or 3 h.\nBubbles in the medium can lead to erroneous results. Prior to reading in the plate reader, spin the plate at 1,350 x g for 5 min at room temperature. A needle or a pipette tip can be used to remove any bubbles that remain after centrifugation.\nMeasure the absorbance at 490 nm using a suitable microplate reader or spectrophotometer (see the Table of Materials).\nSave the data as an Excel file.",
    "NOTE: The incubation time in the presence of the test compound will vary depending upon the rate of metabolism and the growth of the cell line under study, in addition to the compound being tested. An incubation period of 48 h is a good starting point for most cell lines and test compounds.\nData analysis\n\t\nTransfer the data in an Excel file, and organize the data for each replicate by increasing test compound concentration. Average the medium-only control value, and subtract this value from the experimental data.\nDetermine the percent of cell proliferation in the treatment wells compared to the vehicle wells (or solvent-treated control wells) by setting the control to 100% proliferation for each replicate.\nTransfer the data generated in Excel into a program of choice. The authors generally use Prism software (see the Table of Materials) to determine the drug concentration that inhibits the cell proliferation by 50% (IC50).\nIn Prism software, create a data table with X-column as cell numbers and Y-column as the average OD for five replicate values in side-by-side sub-columns.\nEnter the treatment concentration values in the X column when analyzing a drug treatment. Label the x-axis with the treatment compound name and concentration units.\nEnter the calculated replicate cell viability values from the Excel analysis into the Y sub-columns. Label the y-axis as cell proliferation (%).\nUsing the analysis tool, select Non-linear regression (curve fit) under XY analyses.\nSelect dose-response [inhibition] vs. normalized response- variable slope.\nPerform the analysis function. View the results table to see the calculated best-fit values for IC50 and the curve fit graph. The x-axis of the graph can be changed to a log scale if desired.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}