{
  "id": 10838,
  "origin_website": "Jove",
  "title": "Preparation of Thermoresponsive Nanostructured Surfaces for Tissue Engineering",
  "procedures": [
    "1. Synthesis of Polystyrene-block-poly(N-isopropylacrylamide) by Two-step Reversible Addition-fragmentation Chain Transfer (RAFT) Radical Polymerization\nDissolve styrene (153.6 mmol), 4-cyano-4-(ethylsulfanylthiocarbonyl) sulfanylpentanoic acid (ECT; 0.2 mmol), and 4,4'-Azobis(4-cyanovaleric acid) (ACVA; 0.04 mmol) in 40 ml of 1,4-dioxane. Freeze the solution in liquid nitrogen under vacuum for 15-20 min to remove the reactive species and gradually thaw at RT. Make sure that the solution is completely thawed and repeat this freeze-pump-thaw degassing cycle three times.\nObtain the polystyrene (PSt) (Mw: 13,500) as a macro RAFT agent by polymerization at 70 °C for 15 hr in an oil bath.\nPrecipitate PSt macro RAFT agent with 800 ml of ether and dry in vacuo.\nDissolve IPAAm monomer (4.32 mmol), PSt macro RAFT agent (0.022 mmol), and ACVA (0.004 mmol) in 4 ml of 1,4-dioxane.\nRemove the oxygen in the solution by the freeze-pump-thaw degassing cycles as mentioned in step 1.1.\nPerform a polymerization at 70 °C for 15 hr in an oil bath after degassing. Obtain synthesized St-IPAAm molecule (Mw: 32,800) in the same manner as the PSt macro RAFT agent.\n2. Preparation of Silanized Hydrophobic Modified Glass Substrates\nWash glass substrates (24 mm x 50 mm) with an excess of acetone and ethanol and sonicate for 5 min to remove surface contaminants.\nDry the substrates in an oven at 65 °C for 30 min. Then use oxygen plasma (400 W, 3 min) to activate the surfaces of the substrates at RT.\nImmerse the substrates in toluene containing 1% hexyltrimethoxysilane overnight at RT to silanize the substrate.\nWash the silanized substrates in toluene and immerse in acetone for 30 min to remove unreacted agents.\nAnneal substrates for 2 hr at 110 °C to thoroughly immobilize the surface.",
    "Cut the silanized substrates by a glass cutter to 25 mm x 24 mm to fit the cell culture dishes (dish size: φ35 mm).\n3. Preparation of Langmuir Films and Film-transferred Surface\nPlace the Langmuir film instrument in a cabinet to prevent the accumulation of dust.\nWash the Langmuir trough (size: 580 mm x 145 mm) and barriers with distilled water and ethanol to remove contaminants.\nDry the trough and barriers by wiping with a lintless towel. Then fill the trough with approximately 110 ml of distilled water, and set the barriers on both sides of the trough. Note that distilled water should be added without spilling in the following steps from 3.5 to 3.13.\nHeat a platinum Wilhelmy plate (perimeter: 39.24 mm) for monitoring the surface tension with a gas burner until the plate turns red and then wash with distilled water to remove contaminants. Suspend the Wilhelmy plate on a wire attached to the surface-pressure-measurement instrument.\nZero the surface-pressure-measurement instrument according to manufacturer's protocol. Compress the air-water interface on the trough by the barriers on the both sides of the trough until the interface reaches approximately 50 cm2 without any drops of polymer.\nAspirate small contaminants until the surface pressure is nearly 0 mN/m.\nReposition the barriers on both sides, and add distilled water to compensate for the decrease of distilled water from step 3.6.\nDissolve 5 mg of the synthesized St-IPAAm molecule in 5 ml of a development solution of chloroform.\n\tNote: Dichloromethane or toluene can also be used as the solvent.\nGently drop 27 µl of St-IPAAm dissolved in chloroform onto the trough using a microsyringe or micropipette.",
    "After waiting for 5 min to allow complete evaporation of chloroform, move both barriers horizontally to compress the St-IPAAm molecule at the interface. Maintain compression rate of the barriers at 0.5 mm/sec until the target area of 50 cm2 is reached.\n\tNote: A rapid compression rate causes defects in the Langmuir film.\nMeasure the surface pressure (π)-Am isotherms with the platinum Wilhelmy plate attached to the surface-pressure-measurement instrument during compression according to manufacturer's protocol.\nAfter reaching the target area size, maintain the surface for 5 min to allow the St-IPAAm molecules to relax; the molecules do not reach equilibrium immediately after compression.\nTransfer the Langmuir film to a hydrophobically modified glass substrate using a transfer apparatus for 5 min to robustly adsorb the film. Fix the hydrophobic glass substrate in parallel on the device. Connect the device to an alignment stage and move perpendicularly.\nLift the substrate horizontally with the transfer apparatus and dry for 1 day in a desiccator.\n4. Culturing Cells and Optimizing Cell Adhesion and Detachment on the Langmuir Film Transferred Surface\nTo prepare cell suspensions, culture bovine carotid artery endothelial cells (BAECs) to one third confluence at 37 °C in 5% CO2 and 95% air on tissue culture polystyrene (TCPS) with Dulbecco's Modified Eagle Medium (DMEM) containing 10% fetal bovine serum (FBS) and 100 U/ml penicillin.\nAfter confluence is reached, treat BAECs with 3 ml of 0.25% trypsin-EDTA for 3 min at 37 °C in 5% CO2 and 95% air.\nDeactivate the trypsin-EDTA by adding 10 ml of the DMEM containing 10% FBS, and collect the cell suspension to a 50 ml conical tube.\nCentrifuge at 120 x g for 5 min, and aspirate the supernatant. Re-suspend the cells with 10 ml of the DMEM.",
    "Place the St-IPAAm surfaces under ultraviolet light on a clean bench for sterilizing for 5 min.\nSeed the recovered cells on the St-IPAAm surfaces at a concentration of 1.0 x 104 cells/cm2 counted by a disposable hemocytometer and observe the cells on the surfaces by a microscope equipped with an incubator at 37 °C with 5% CO2 and 95% air.\n\tNote: Sterilize the St-IPAAm surfaces by ultraviolet light equipped to a clean bench.\nRecord time-lapse images of adherent BAECs for approximately 24.5 hr at 37 °C by a phase-contrast microscope with 10X magnification. After BAEC adhesion, record detachment of the BAECs from the St-IPAAm surface at 20 °C for approximately 3.5 hr.\n5. Cell Sheet Fabrication on the Langmuir Film-transferred Surfaces\nCulture BAECs used in the same manner described in Section 4.\nSeed a total of 1.0 x 105 cells/cm2 on St-IPAAm surfaces and incubate for 3 days at 37 °C in 5% CO2. Confluent BAECs spontaneously detached at 20 °C.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}