{
  "id": 17276,
  "origin_website": "Jove",
  "title": "Ganglioside Extraction, Purification and Profiling",
  "procedures": [
    "Tissue collection was performed under conditions authorized by the Johns Hopkins Animal Care and Use Committee.\n1. Small scale ganglioside extraction and partial purification\nCAUTION: Use appropriate ventilation when working with volatile and toxic solvents. Avoid plastic throughout; solvents will extract chemical components from many plastics that interfere with subsequent analyses. Polytetrafluoroethylene (PTFE) is an exception; PTFE-lined closures should be used to cap glass storage vials.\nExtraction\n\t\nWeigh a single fresh or thawed mouse brain (or sagittal half-brain, ~ 0.2-0.5 g) and place in a Potter-Elvehjem homogenizer prechilled in a bucket of ice.\n\t\tNOTE: Previously frozen brains can be used after thawing at 0-4 °C.\nAdd 4.1 mL per g tissue wet weight of water and homogenize with 10 strokes.\n\t\tNOTE: Accurate solvent ratios are key to optimal extraction and partition, the goal is chloroform-methanol-aqueous (4:8:3) assuming brain tissue is 80% aqueous.\nAdd 13 mL per g tissue wet weight of methanol, shift to ambient temperature (22 °C) and mix.\n\t\t​NOTE: The solution will appear cloudy. Addition of methanol at this step, without chloroform, optimizes protein precipitation. All subsequent steps are at ambient temperature (22 °C).\nTransfer to a thick-walled glass screw-capped tube with a PTFE-lined screw cap at ambient temperature (22 °C) and mix thoroughly. Add 6.5 mL per g tissue wet weight of chloroform, cap, and mix thoroughly. Centrifuge at 450 x g for 15 min. Transfer the clear supernatant to a fresh screw-capped tube and measure the volume, \"recovered extract volume\".\nPartition\n\t\nAdd 0.173x \"recovered extract volume\" of water to the clear supernatant, cap, vortex vigorously, and centrifuge as described in step 1.1.4.",
    "NOTE: The goal is to have chloroform-methanol-aqueous in the ratio 4:8:5.6. The mixture will be cloudy and resolve into two phases: an upper aqueous-rich phase and a lower chloroform-rich phase at ~ 4:1 ratio. Wait for 60 min or centrifuge at 450 x g for 15 min for complete phase separation.\nTransfer the upper phase, which contains the gangliosides, into a fresh glass tube with a PTFE-lined screw cap.\nReverse phase cartridge chromatography\n\t\nUsing a 5 mL glass syringe, wash a tC18 solid phase extraction cartridge (400 mg) with 3 mL of methanol, then 3 mL of chloroform-methanol-water (2:43:55). Load the upper phase from step 1.2.2 onto the tC18 cartridge using the same glass syringe, collect the flow-through and reload it onto the column to optimize adsorption.\nUsing the glass syringe, wash the cartridge with 3 mL of chloroform-methanol-water (2:43:55) then 3 mL of methanol-water (1:1).\nElute the gangliosides with 3 mL of methanol into a fresh screw-capped tube. Evaporate to dryness under a gentle stream of nitrogen at ≤ 45 °C. Dissolve in methanol at 1 mL per g of original tissue wet weight.\n2. Large scale ganglioside extraction and purification\nCAUTION: When working with volatile solvents, use explosion resistant blenders. Do not use plastics except PTFE. Tetrahydrofuran, chloroform, and ethyl ether are toxic volatile organic compounds. Work in a fume hood with protective gloves and safety goggles.\nExtraction\n\t\nThaw frozen bovine brain at 4 °C for several hours. Dissect the grey matter from meninges and white matter.\n\t\tNOTE: The following procedure is described for 100 ± 20 g of isolated brain grey matter and is scalable.",
    "Place 100 g of brain grey matter in a blender and add 1 mL per g brain wet weight of chilled 10 mM potassium phosphate buffer pH 6.8. Homogenize on low for 20 s. Add 8 mL tetrahydrofuran per g brain wet weight and homogenize on low for 10 s. Decant into glass centrifuge bottles and centrifuge at 5,000 x g for 15 min at ambient temperature (22 °C).\nCollect the supernatant, measure its volume, and transfer to a glass separatory funnel. Add 0.3 mL of ethyl ether per mL of the supernatant. Shake vigorously, then allow to sit undisturbed for 30 min during which two phases, an upper ether phase and a lower aqueous phase, separate. Collect the lower phase, which contains the gangliosides, into a glass bottle with a PTFE-lined cap.\nTo the upper (ether) phase remaining in the separatory funnel, add 0.1 mL water per mL of original supernatant (step 2.1.3). Shake vigorously, allow phases to separate, collect the lower (aqueous) phase and combine with the previous lower phase. Evaporate the combined lower phases to a dry powder and weigh.\nSaponification\n\t\nAdd 10 mL of 100 mM aqueous NaOH per g powder in a sealed tube. Mix and incubate at 37 °C for 3 h. Allow to cool and adjust to pH 4.5 by dropwise addition of 100 mM aqueous HCl. Measure the volume and transfer to a glass separatory funnel.\n\t\tNOTE: Sialic acids are acid labile; avoid acidification below pH 4.5.\nBased on the aqueous volume, add 2.67 volumes of methanol, mix gently, then add 1.33 volumes of chloroform to create a single-phase solution of chloroform-methanol-aqueous (4:8:3). Mix well.",
    "Based on the original aqueous volume, add 2.6 volumes of water to bring the mixture to chloroform-methanol-aqueous to a ratio of 4:8:5.6. Shake vigorously, then allow to sit undisturbed to separate two phases, a polar upper phase containing the gangliosides and a nonpolar lower phase. Collect the upper phase in a glass bottle with a PTFE-lined cap.\n\t\tNOTE: Non-sialylated lipids will not appear on thin layer chromatography (TLC) plates stained using resorcinol but will appear when using a p-anisaldehyde stain. The purpose of this saponification is to remove the O-acetylated compounds such as phospholipids.\nReverse phase chromatography\n\t\nPre-wash a large scale (10 g) tC18 solid phase extraction cartridge by passing 50 mL of each of the following three solvents through the column using vacuum or pressure (<1 min each wash): methanol, methanol-water (1:1), then chloroform-methanol-water (2:43:55). Load the upper phase from step 2.2.3 onto the column by vacuum or pressure, collect the flow through, reload, and collect the flow through.\nWash the column with 30 mL of chloroform-methanol-water (2:43:55), then 30 mL methanol-water (1:1), then elute the gangliosides with 50 mL methanol, and again with 10 mL methanol, collecting each wash and each elution separately. Using TLC (below) confirm that ganglioside is absent from the flow through and washes and eluted in the first elution (50 mL methanol). Evaporate the eluted gangliosides to a dry powder and weigh.\n\t\tNOTE: The purpose of tC18 chromatography is to separate gangliosides from both less and more polar contaminants. Mixed brain ganglioside yield after saponification is ~ 120 mg per g dry brain extract (step 2.1.4). Appearance of gangliosides by TLC in the flow through or washes indicates the solid phase extraction column was saturated. After methanol elution, the column may be further eluted with chloroform-methanol (1:1) to capture less polar lipids.",
    "HPLC purification of individual gangliosides\n\t\nPrepare HPLC Solvent A: acetonitrile-5 mM aqueous sodium phosphate buffer pH 5.6 (83:17) and Solvent B: acetonitrile-20 mM sodium phosphate buffer, pH 5.6 (1:1). Degas both solvents for 5 min.\nPre-equilibrate an HPLC column (20 x 250 mm column packed with amine bonded (NH2) silica spheres, 5 µm diameter, 100 Å pore size) with 100% Solvent A for 20 min at 5 mL/min. Set a UV HPLC column effluent detector to 215 nm.\nDissolve the ganglioside powder from the reverse phase eluate in water at 5 mg/mL. Inject 0.5 mL of the ganglioside mixture onto the HPLC and run the solvent gradient (Table 1) at 5 mL/min, collecting fractions. Gangliosides will appear as A215 peaks with retention times (major brain gangliosides) of 25-70 min: GM1 ≈ 28 min; GD1a ≈ 38 min; GD1b ≈ 46 min; GT1b ≈ 65 min. Re-equilibrate 20 min with Solvent A after each run. Analyze fractions by thin-layer chromatography.\ntable:\n﻿0,1,2\nTime (min),%A,%B\n0,100,0\n7,100,0\n12,63,37\n82,54,46\n82.01,0,100\n92,0,100\nTable 1: Solvent gradient for HPLC.\n3. Thin layer chromatography (TLC) analysis of gangliosides\nCAUTION: Chloroform is a toxic volatile organic compound. Work in a fume hood with protective gloves and safety goggles.\nRunning solvent and TLC plate preparation\n\t\nPrepare a running solvent of chloroform-methanol-aqueous 0.25% KCl (60:35:8 by volume). Pour into a 10 cm x 10 cm glass TLC chamber with a stainless-steel cover so that the solvent depth is ~ 0.5 cm. Cover and allow to equilibrate in an area free of air currents for >10 min.\n\t\tNOTE:To isolate the TLC chamber from air currents, an acrylic 5-sided box can be constructed or purchased  (Figure 2). Do not use solvent-saturated filter paper inside the chamber.",
    "Place a 10 cm x 10 cm or 5 cm x 10 cm silica gel coated glass-backed high performance TLC plate in a drying oven at 125 °C for 10 min. Allow to cool. Use a dulled #2 pencil to draw 5-mm spotting lines with 2-mm separations along a line 1 cm above bottom of the plate and at least 1 cm from either side (Figure 3). Avoid disturbing the silica layer while marking.\nPrepare a standard mix of pure gangliosides in methanol containing 100 µM GM1, 50 µM each of GD1a and GD1b and 33 µM of GT1b.\n\t\tNOTE: This mixture contains 100 pmol of ganglioside sialic acid per µL for each of the four gangliosides, a quantity that provides a strong colorimetric signal by resorcinol staining, which is sialic acid dependent.\nGanglioside resolution\n\t\nWash a 10-µL Hamilton syringe with a beveled needle with methanol. Draw 1 µL methanol into a glass syringe to fill the needle dead volume and then 1 µL of sample or standard. Spot the sample evenly onto the 5-mm premarked lines until <1 µL of solvent (methanol) remains in the syringe. Allow the plate to dry at ambient temperature (22 °C) after all samples are spotted.\n\t\tNOTE: Wash the syringe with methanol between sample loading. An unheated air blower set at low can be used to accelerate drying.",
    "Place the spotted and dried plate into the preequilibrated TLC chamber with the bottom edge immersed in the running solvent and cover and protect from air currents (Figure 2). Allow the running solvent to advance up the plate by capillary action until the solvent front reaches within 1 cm of the top of the plate. Remove and mark the solvent front at the edge of the plate with a pencil. Allow the solvents to evaporate completely either undisturbed or under mild air flow.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62385/62385fig02.jpg\nFigure 2: Ganglioside TLC equipment and set up. A twin trough chamber is filled to ≈ 0.5 cm on both sides with running solvent. The plate is placed against one side with the origin end immersed in the running buffer. The chamber is covered with an acrylic box to avoid air currents. Panel A, side view prior to plate insertion. The solvent level is visible a few mm above the chamber bottom; Panel B, front view during development. The solvent front is visible at about 40% of the way up the plate. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62385/62385fig02large.jpg]\nGanglioside staining\n\tCAUTION: Reagent stains are toxic. Hydrochloric acid is corrosive and toxic. Prepare and spray reagents in a fume hood with protective gloves and safety goggles.\n\tNOTE: The plate can be imaged for qualitative image analysis or stored by removing the clamps and securing the cover plate in place with clear tape. Quantitative analysis can be performed by measuring densitometry of ganglioside standards spotted in adjacent lanes.",
    "Prepare resorcinol spray reagent for the detection of gangliosides based on their sialic acids. Dissolve 6 g of resorcinol in 100 mL water for a 6% resorcinol stock. Dissolve 1 g of CuSO4 in 100 mL of water to make a 1% stock. To 64.7 mL of water add 5 mL of the 6% resorcinol stock, 0.31 mL of the 1% CuSO4 stock then slowly add 30 mL of concentrated HCl and stir gently. May be stored at 4 °C for a month.\nIn a chemical fume hood, place the TLC plate with resolved gangliosides, origin end up, in a cut-away cardboard box to protect the walls of the hood from acid spray. Place resorcinol spray reagent in a glass TLC sprayer, attach to a source of pressurized nitrogen, and lightly spray the plate diagonally in the vertical and horizontal directions. Spray the TLC sorbent surface uniformly, but lightly.\nImmediately cover the plate with a clean dry glass cover plate of the same dimensions and secure the cover plate in place with binder clips (Figure 3). Heat the covered plate at 125 °C for 20 min. Gangliosides will appear dark purple against a white background.\n\t\tNOTE: The plate should not appear wet when spraying is complete. Cover plates can be fashioned by scraping the sorbent from previously used TLC plates using a single-edge razor blade.\n\t\tCAUTION: Silica powder is toxic to lungs. Use a mask and dispose silica in a sealed container.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62385/62385fig03.jpg",
    "Figure 3: TLC plate of resolved mixed ganglioside. TLC plate of resolved mixed ganglioside standards (left lane) and purified mixed bovine grey matter gangliosides (right lane) after resorcinol staining and heating with glass cover plate clipped in place. Standard gangliosides (top to bottom) are GM3, GM2, GM1, GD3, GD1a, GD1b, GT1b and GQ1b. After cooling, the plate can be imaged and/or the cover plate taped in place for storage. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62385/62385fig03large.jpg]\nGeneral lipid staining for gangliosides and phospholipids.\n\t​CAUTION: Sulfuric acid is toxic and corrosive. Addition of concentrated acid to ethanol is exothermic and must be done slowly. Prepare staining reagent in a fume hood with protective gloves and safety goggles.\n\t\nPrepare p-anisaldehyde stain by slowly adding 15 mL of concentrated sulfuric acid to 500 mL of ethanol. Stir for 30 min to allow the solution to cool before proceeding. Add 15 mL p-anisaldehyde and stir gently. This may be stored at room temperature (22 °C) up to six months.\nIn a chemical fume hood, dip the TLC plate with resolved gangliosides, origin end down, into a beaker containing the p-anisaldehyde stain. Submerge to the running front for ≥ 2 s. Remove TLC from stain and allow to drain. Heat the TLC plate on a hot plate at low temperature to develop.\n\t\tNOTE: Lipids will appear dark against a purple background. Staining solution may be recovered for repeated use.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}