{
  "id": 9392,
  "origin_website": "Jove",
  "title": "In vivo Postnatal Electroporation and Time-lapse Imaging of Neuroblast Migration in Mouse Acute Brain Slices",
  "procedures": [
    "This procedure is in accordance with the UK Home Office Regulations (Animal Scientific Procedures Act, 1986). Scientists should follow the guidelines established and approved by their institutional and national animal regulatory organizations.\n1. Postnatal Electroporation\n1.1. Preparation of Glass Capillaries, DNA Solution and Electroporator\nPrepare pulled glass capillaries (O.D.: 1.5 mm, I.D.: 0.86 mm) for DNA injection. (Indicative settings for a Sutter P-97 capillary puller are: Heat 283; Pull 50; Velocity 90; Time 50). Make a mark on the capillary corresponding to a volume of approximately 2 µl.\nSet the voltage of the electroporator to 5 square pulses, 50 msec/pulse at 100 V, with 850 msec intervals (100 V, pulse ON 50 msec, pulse OFF 850 msec, pulse 5).\nDilute high-purity (OD 260/280 > 1.80) endotoxin-free plasmid DNA to a final concentration of 1-2 µg/µl with endotoxin free Tris-EDTA buffer or PBS. It is recommended to add 0.1% Fast Green to the DNA solution (the dye should spread in the ventricle when successfully injected).\nPrepare the 5-7 mm electrodes, the electrode gel and warm up the heating pad.\n1.2. Electroporation\nRemove a postnatal day 2 mouse pup from cage and anesthetize it by isoflurane inhalation (at a flow of ~0.6 L/min).\nAfter approximately 1 min, determine the state of anesthetization using the foot pinch response. If no movement occurs, proceed with intraventricular injection.\nLoad capillary needle with 1-2 µl of DNA using an aspirator tube connected to the capillary.\nUnder a cold light source, hold the head of the pup between your thumb and index finger of your less dominant hand. Slightly pull the skin back on the head to help identification of the right injection point.",
    "Consider a virtual line between the eye and the craniometric landmark lambda (Figure 1A). Insert the capillary needle at about one third of the length of this line from the lambda (about 1 mm from the line midpoint)15. Insert the capillary about 2 mm deep, making sure to avoid deep penetration in the brain.\nInject plasmid by blowing slowly through mouth (a syringe connected to the capillary can also be used). During this procedure, make sure your fingers are not applying too much pressure on the brain, as this can prevent successful plasmid injection.\nStop injection when a minimal amount of DNA solution is left in the capillary. It is advisable to inject less than 1 µl to avoid deleterious increase in intracranial pressure.\nCoat both electrodes with gel and place them with the positive side on the lateral side of the hemisphere where the DNA was injected (Figure 1A). For DNA incorporation into the rostral SVZ, place electrodes slightly rostral to the injection point. Varying electrode position can achieve regional specificity of electroporation in different areas of the SVZ22,25.\nInitiate current transfer by pressing the pulse footswitch pedal. When the electroporation is complete, check the voltage on the electroporator display (voltage values should not be below 90 V, since lower voltage values correlate with poor electroporation efficiency).\nReanimate the pup under oxygen on heating pad for a few minutes and return it to the cage, placing it away from the mother. Make sure the mother retrieves the pup and reunites it with the rest of the litter. After electroporation, leave pups with their mother for 4-7 days before next step.\n2. Preparation of Acute Brain Slice Cultures\n2.1. Preparation of Solutions and Tools",
    "The following solutions are required (it is also possible to use high-glucose DMEM for dissecting and imaging17):\nDissection Medium (500 ml)\n\tGey's Balanced media - 500ml\n\t45% Glucose - 5ml\nMovie Medium (10 ml)\n\t45% Glucose - 0.110 ml\n\tHEPES 1 M - 0.100 ml\n\tPen/Strep - 0.100 ml\n\tFCS - 0.500 ml\n\tB27 - 0.100 ml\n\tGlutamine - 0.200 ml\n\tDulbecco Modified Eagle Medium (phenol red-free) - 8.89 ml\nWarm up movie medium at 37 °C.\nPlace Millicell inserts into a 35 mm glass bottom culture dish containing 1 ml of movie medium and place in a humidified incubator at 37 °C/5% CO2.\nPrepare vibratome accessories (screwdriver, chamber, razor blades, glue).\nPrepare dissection tools: scissors, small spatula, straight forceps.\nPrepare tools for handling slices: small paintbrush or soft inoculating loop (size: 10 µl), plastic Pasteur pipettes, an ice box and several 6 cm plastic dishes.\nPrecool the dissection medium at 2-4 °C.\n2.2. Preparation of Brain Slices\nFill a 6 cm dish with precooled dissection medium and place it on ice (to keep freshly cut slices).\nFollowing cervical dislocation, use scissors to decapitate the mouse pup. Remove the scalp with a scalpel, cut the skull along the mid-sagittal suture from the OB to the cerebellum and gently remove the cranial flaps using forceps. Make sure the entire brain is exposed and carefully dissect it out using a spatula, taking special care not to damage the tissue. The dissection has to be done carefully but at the same time very quickly (less than a minute if possible). Cervical dislocation is our preferred method because terminal anesthesia with drugs/gas anesthetics can influence the migratory properties of the neuroblasts and the healthy state of the brain slice cultures, which need to be imaged relatively quickly following animal sacrifice.",
    "Hemisect the brain with a razor blade (Figure 2). Discard uninjected hemisphere or use for other experiments.\nPlace a small piece of tape on the vibratome holder and use the minimal necessary amount of glue to attach the brain hemisphere on top of it (Figure 2). This prevents damaging of the holder surface due to repeated glue applications.\nLet the glue dry for a few seconds.\nPlace holder in the vibratome tray filled with precooled dissection solution. Point the olfactory bulb towards the blade (Figure 2).\nBegin cutting the brain hemisphere using appropriate settings. The following parameters are recommended: slice thickness 300 µm; speed ~3-5; frequency ~9. High frequency and low speed are recommended to prevent damage to the slice.\nCollect slices using a small paintbrush or a soft inoculating loop. Only keep slices with visible OB (usually 2-3 slices/brain). Typically, the slice containing most of the RMS can be found at ~300 µm from the bottom surface.\nCheck slices under a standard fluorescent microscope for GFP signal (making sure to flip them over to check fluorescence on both sides), and choose the ones showing bright fluorescence along most of the RMS.\n2.3. Culturing Brain Slices\nIn a cell culture hood, cut away the most caudal third of the brain slice and remove any glue traces using fine straight tweezers or a microdissection scalpel.\nDelicately aspirate the slice using a plastic Pasteur pipette (cut the tip of the pipette to create a bigger opening, this will avoid damaging the slice) and place it on the center of a prewarmed Millicell insert.\nMake sure the side with the brightest fluorescent signal is placed in contact with the Millicell insert (for imaging with an inverted microscope).\nRemove excess dissection solution on top of the insert with a pipette.",
    "Leave slice cultures to settle in a 37 °C/5% CO2 incubator for at least for 1 hr before imaging.\n3. Time-lapse Imaging of Neuroblast Migration\nAt least 2 hr before imaging, turn on the Perkin Elmer UltraViewVoX confocal spinning disk system, inverted Nikon Ti-E microscope, Hamamatsu C10600-10B (ORCA-R2) cooled digital CCD camera, and heating system (Solent Scientific) set at the constant temperature of 37 °C.\nOpen the Volocity software Acquisition module and click on \"VIz\" button and select the laser(s) for imaging.\nWithin 2 hr of brain slice preparation, place the glass bottom dish containing the brain slice in the imaging chamber on the microscope stage.\nUse a Nikon CFI Super Plan Fluor ELWD 20X/0.45 objective under the appropriate fluorescent light to select and focus the area of the slice that will be imaged (e.g. the first descending part of the RMS just after the injection site, or the elbow region of the RMS, or just after the elbow before neuroblasts enter the OB).\nSet up the time-lapse imaging with the following actions:\n\t\nOn the microscope, click on the L100 button to allow laser scanning of the sample.\nIn Volocity, open the UltraVIEW Laser Changer by selecting the appropriate laser (e.g. 488 nm laser for GFP).\nSet the exposure time (usually between 100-500 msec) and the laser intensity (usually 20-30%) depending on the intensity of the fluorescent signal.\nAdjust the image digital gain to improve cell visualization.\nSelect the z-stack interval to image inside the brain slice (usually over a 100-120 µm interval). Choose an interval with a suitable number of isolated cells to avoid possible overlaps as much as possible (this will facilitate the subsequent tracking analysis).\nSelect the spacing between each z-stack image (usually 2-4 µm).",
    "Choose the time interval between each z-stack capture (e.g. 3 min) and the total imaging duration (e.g. 3 hr).\nClick on the \"save\" icon to save the changes to the imaging parameters.\nPress the recording button to start imaging.\nAlternate imaging of control and experimental samples (for example vehicle/drug treatment or different electroporated plasmids) throughout the same day.\n4. Analyzing Neuroblast Migration\nIn the Volocity Quantitation module, open the desired library created after completing a time-lapse experiment. Select \"Extended Focus\" from the top left box (Figure 4A, step 1).\nClick on the \"Measurements\" tab to display the Measurement window (Figure 4A, step 2).\nA list of tasks is visible in the bottom left of the screen. Drag \"Track\" (present under the \"Miscellaneous\" heading at the bottom of the list) on the space above. This will prompt the opening of a new window called \"Track\" at the top left section of the screen (Figure 4A, step 3).\nSelect \"Points\" from the \"Input\" tab in the Track window (Figure 4A, step 4).\nClick on the Point Tool (Figure 4A, step 5).\nStart tracking the migrating neuroblast by clicking with the mouse on the central area of the cell body and keep tracking the cell movement until the last time point of the time-lapse is reached (for example point number 61 for a 3 hr-long movie).\nTo obtain data choose \"Make Measurement Item\" from the Measurements Menu (Figure 4B, steps 6-7). A window will appear at the center of the screen.",
    "In this window, select \"A new measurement item called:\" and type a name (Figure 4C, step 8). Remember to select the \"All timepoints\" option before pressing OK (Figure 4C, step 9). A measurement item file will appear under the time-lapse file and will contain parameters for quantitative analysis (e.g. migration distance, velocity, displacement, and displacement rate).\nDouble-click on the measurement item file to open it as a window (Figure 4D, step 10).\nTo visualize the single tracks of analyzed cells, choose \"Tracked Point\" from the \"Display\" options (Figure 4D, step 11).\nRight click on the Measurement Item file and export it as a text file, which can then be imported in programs like Excel to analyze migration parameters.\nTo measure movements between consecutive frames and pauses made by each cell during the filming period, in the Measurement Item file select from the \"Display\" options \"Point\" or \"Populations\" and click on ID (every track has an unique ID). Export the resulting file by proceeding as explained in step 4.10.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}