{
  "id": 8893,
  "origin_website": "Jove",
  "title": "Visualization and Live Imaging of Oligodendrocyte Organelles in Organotypic Brain Slices Using Adeno-associated Virus and Confocal Microscopy",
  "procedures": [
    "The procedures described here have been approved by the Norwegian Animal Research Authority. Suppliers and catalog numbers for the consumables and other required equipment are available in the materials list at the end of the document.\n1. Preparation of Organotypic Slices\nNOTE: This recipe uses two mouse pups at postnatal day 7-9 (p7-9), which yield 24 organotypic slices divided on two six-well culture dishes. Unless stated otherwise, all procedures should be done in a sterile hood and nitril or latex gloves should be used. Only cell culture grade ingredients should be used.\nAutoclave bottles, dissection tools (1 large scissor, 1 small scissor, 1 large flat spatula, 1 small rounded and sharpened spatula and 1 forceps, see Materials list for details), glass pipettes, pipette tips and tissue wipes used for the slice preparation.\nAs half of the glass pipettes should be used with the large opening, break off the narrow end.\nScore with a diamond scriber pen (if available) around the pipette just below the point where the glass starts narrowing. Then place the pointy end of the pipette into a nitrile glove or similar. Carefully break off the tip by bending the pipette while pushing it against a work bench.\nThen blunt the broken end by rubbing on a piece of sand paper or melt slightly on a Bunsen burner. The broken pipettes are used to transfer cut brain slices with the broken end turned into the rubber bulb and the large open end touching the solution/slices.\n\t\tNOTE: This is not done in a sterile hood and can be done several days in advance.\nPrepare culture dishes.\n\tNOTE: This can be done the day before slicing or at least 2 hours before slicing.",
    "Sterilize Polytetrafluoroethylene (PTFE) membranes (\"confetti\"). Use two sterile forceps to remove single confetti from the surrounding blue plastic pieces and sterilize by dipping twice into a Petri dish containing 96% ethanol (EtOH). Then lay confetti flat in a sterile large Petri dish to dry.\n\t\tNOTE: The confetti are hydrophilic PTFE membranes similar to the membranes in the culture inserts. The use of confetti aids the live imaging because single slices can be easily transferred from the insert to the microscope setup by lifting the confetti with forceps (see 4.8. for details). Alternatively, the brain slices can be cultured without the confetti (in which the slices will attach directly to the membrane of the culture insert). In this case, the membrane insert must be cut with a scalpel to transfer the slice to the microscope bath.\nAdd 1 mL of culture medium (recipe in Reagents' table) to each well of the six-well culture dishes.\nPlace one culture insert in each well using sterile forceps. Avoid air bubbles between the insert and the culture medium.\n\t\tNOTE: To save money and the environment, it is possible to reuse the culture inserts. This can be done by thorough rinsing in distilled H2O (dH2O) followed by incubation in 70% EtOH for a minimum of 24 h until reuse. When preparing for new culture, dry the inserts in a cell culture plate under ultraviolet (UV) light for 15-30 min.\nPlace two (sterilized and dry) confetti on each of the culture inserts. Place the confetti towards the edges of the inserts to get minimal overlap.\nPut the plates in the cell culture incubator at 37 °C with 5% CO2.",
    "Bubble cold dissection medium (recipe in Reagents' table) with bioxide gas (95% O2/5%CO2). To keep the solution sterile, connect the tube from the gas cylinder to a sterile syringe filter (0.22 µm pore size).\nCouple the other end of the syringe filter to a sterile tube connected to a sterile glass pipette. Place the glass pipette in the solution, cover with parafilm and turn on the gas. Keep the dissection medium on ice.\nPrepare the dissection/slicing area.\n\tNOTE: Ideally, this procedure should be done in a sterile hood. If this is not possible, the vibratome can be left on a work bench. In this case, it is recommended to use a hair net and face mask.\n\t\nUsing a single edge razor blade, cut out a rectangular piece (approximately 2 cm x 0.5 cm) of agarose gel (recipe in Reagents' table) and glue this onto the vibratome stage such that the long side faces the vibratome blade.\nClean all surfaces and the vibratome parts with 70% EtOH and wipe with autoclaved tissue wipes.\n\t\tNOTE: It is important that all the pieces that will be in contact with the brain tissue are completely dry since EtOH can damage the cells.\nAttach a sterile razor blade to the vibratome and perform vibration check if the vibratome has this function.\nPlace autoclaved dissection tools in the hood together with autoclaved tissue wipes, four small Petri dishes, a round-edge scalpel, 2 glass pipettes with rubber bulbs, two open-end glass pipettes (see pt. 1.1) and super glue (sprayed with EtOH).\nPour bubbled dissection medium into the vibratome boat and into the four small Petri dishes.\n\t\tNOTE: This step should only be done immediately before dissection since medium from this point on is not bubbled or kept on ice.\nDissect and mount brains.",
    "NOTE: To obtain healthy slices, this step must be done quickly and precisely. Some practice is needed.\n\t\nEuthanize animal #1 by dislocation of the neckor according to local guidelines and then decapitate with the large scissors.\nUsing small, sharp scissors, quickly remove the skin by making a sagittal incision from the neck to the nose and pull aside to reveal the skull.\n\t\t\nCut along the sagittal suture, followed by lateral incisions over the interior part of the frontal bones and the lamboid suture (the border between cerebrum and cerebellum).\nUse forceps to bend open the skull on each side. The cranial nerves are cut off from the brain by inserting a rounded, sharp spatula under the ventral side of the brain and gently moving the spatula laterally.\nUse a single edge razor blade to make a coronal cut rostral to the cerebellum.\n\t\tNOTE: This cut will determine the angle at which the slices are cut. It should, therefore, be made at a straight angle.\nFlip the brain out of the skull and into a small Petri dish containing dissection medium.\nRepeat steps 1.6.1. - 1.6.4. for animal #2 and place this brain in a second Petri dish.\n\t\tNOTE: The animals are not sterile. Perform the dissection on one side of the hood and then move to the other, clean side once the brains have been removed from the skull.\nChange gloves.\nAttach brain to vibratome stage: add a thin layer of super glue to the stage just in front of the mounted agarose gel. Hold brain #1 with a large flat spatula with the freshly cut (caudal) side touching the spatula and the ventral side facing (and being as close as possible to) the agarose gel.",
    "Then gently place the brain onto the glue by pushing it off the spatula with a set of forceps. Make sure to leave enough space for brain #2.\n\t\t\tNOTE: It is important that the brains are well attached to the stage, but without excessive glue, as this can obstruct the cutting.\nImmediately after mounting of brain #1, use the large spatula to add some drops of dissection medium on top of the brain. This will keep the brain moist, harden the glue and prevent it from sticking to the sides of the brains.\nRepeat steps 1.6.7 and 1.6.8. for brain #2.\nAttach the stage onto the vibratome boat.\nCut 230 µm thick coronal slices with an amplitude of 1 - 1.5 mm, a frequency of 85 Hz and a velocity of 0.2 mm/s. Collect slices approximately between 1.4 mm rostral and 2.1 mm caudal to Bregma.\nCollect slices after each slice has been cut by using open-end glass pipettes (pt. 1.1). Transfer slices to a Petri dish containing dissection medium. Use a rounded scalpel to cut the slices into two pieces, dividing the two hemispheres.\nWhen all the slices are cut, place slices into the culture dishes.\nTake the culture dish (one at the time) out of the incubator.\nUsing the open-end glass pipettes, carefully transfer one slice to each of the confetti.\n\t\tNOTE: The slices should lay flat in the middle of the confetti. This requires some skill. However, if some slices are not perfect, it is better to leave them than to spend time trying to move them as it is important to get all the slices into the incubator as fast as possible.\nUse a glass pipette (pointy end) to gently remove excess medium without touching the slice.",
    "NOTE: Slices should not be immersed in liquid during the incubation. Thus, excess medium must be aspirated such that the slices are exposed to the air (a thin film of medium will still cover the slices). Slices that remain immersed in liquid will usually be unhealthy or die (4 and our observations).\nMove the dish back in the incubator once all the confetti have one slice.\nRepeat steps 1.7.8. - 1.8.4. for dish #2.\nChange the culture medium.\n\tNOTE: This should be done the day after slicing (day 1 in vitro, DIV1) and then every 2-3 days.\n\t\nPreheat culture medium in a water bath or the incubator.\nIn a sterile hood, use vacuum suction or a regular pipette with a sterile tip to aspirate culture medium from each well. This is done by gently tipping the dish (by about 30 degrees) and placing the pipette tip at the edge of the culture insert.\nRemove approximately 800 µL from each well (leaving just enough medium to keep the bottom of the insert covered in medium). Then, using a clean pipette, add 800 µL of the pre-heated medium to each well. Then place the dishes back in the cell culture incubator.\n2. Viral Transduction\nPurchase or make AAVs with a plasmid of interest, as described previously10,11.",
    "NOTE: This protocol describes the use of AAV serotype 2/8 (AAV 2/8) carrying mitochondrial targeted dsred or GFP as a reporter gene under the transcriptional control of the myelin basic protein promoter12 (AAV2/8 MBP_mito_dsred or AAV2/8 MBP_mito_GFP) to visualize oligodendrocyte mitochondria. AAV 2/8 carrying GFP or tdtomato as reporter gene driven by the general CAG promoter (AAV 2/8 CAG_GFP or AAV 2/8 CAG_tdtomato) is used to visualize oligodendrocyte cytoplasm. Thus, the combination of AAV2/8 MBP_mito_dsred with AAV 2/8 CAG_GFP gives red mitochondria and green cytoplasm in oligodendrocytes, whereas combining AAV2/8 MBP_mito_GFP and AAV 2/8 CAG_tdtomato gives green mitochondria and red cytoplasm. The constructs are described in more detail elsewhere13.\nOn day 7 in vitro (DIV7), transduce oligodendrocytes with the AAVs.\n\tCAUTION: Follow safety regulations for working with AAVs. Make sure to have the proper training and the Biosafety Level approval required. All the following points should be carried out in a Class II biosafety cabinet using gloves and lab coat. Here, application of AAV to the cortex area of the slices is described, as this is the area that shows the best recovery.\n\t\nDilute the AAV in pre-heated (37 °C) culture medium. Dilutions around 2 × 109 genome copies/mL (GC/mL) are recommended to get a sparse transduction of oligodendrocytes which enables imaging of single cells within the slice. However, a pilot using different titers should be done to ensure a density of transduced oligodendrocytes that is suitable for the specific experiments. If two different AAVs are used, they should be mixed in the same solution and added to the slice simultaneously.",
    "Add around 1.3 µL diluted AAV to each slice: Make sure the outside of the pipette tip is dry. Pipette 1.3 µL diluted AAV and hold the pipette above the cortex, as close as possible without touching the slice with the pipette tip (about 1 mm away).\nThen slowly push solution out of the pipette. When the solution touches the slice, move the pipette tip over the cortex to spread the solution over the whole cortex area.\n\t\tNOTE: This procedure should be done as fast as possible to avoid keeping the slices out of the hood for longer than necessary. Do this on one dish at the time and put the first dish back in the incubator before starting on dish #2. To get a satisfactory distribution of AAV without damaging the tissue requires some practice and a steady hand.\nIf an upright fluorescence microscope is available in the cell lab, protein expression can be checked during the time in culture by placing the dish under the microscope.\n\tNOTE: The dish should not be kept out of the incubator for more than 2 - 5 minutes.\n3. Time-lapse Imaging\nNOTE: The imaging can be performed whenever the expression levels of the fluorescent markers are sufficient and the slices look healthy (usually DIV11-14).\nEnsure that the microscope, perfusion and heating are set up correctly so that bubbled imaging solution is heated and can enter and exit the bath.\n\tNOTE: Various solutions exist for bath chambers. A simple version is presented here.\n\t\nMake in- and outlets of the bath by blunted syringe needles (bent at ~45°) that are attached to the sides of the bath by blu-tack/fun tack.",
    "Ensure that tubing goes from a bottle of continuously bubbled imaging solution, via the peristaltic pump, through the heating tube of the heater unit, and then to the inlet syringe needle in the bath.\nConnect another tube to the syringe needle outlet. This tube then goes via the peristaltic pump and back to the bottle of imaging solution (or to a waste bottle).\nBubble imaging solution (recipe in Reagents' table) with bioxide gas.\n\tNOTE: This should be started at least 15 minutes before imaging and continue throughout the experiment.\nTurn on peristaltic pump and heater and run solution through the bath to obtain optimal bath temperature (37 ± 0.5 °C). Ensure that the thermometer sensor connected to the temperature unit is submerged in the bath solution.\nTurn on the microscope, fluorescence lamp and appropriate lasers.\nSet up a suitable light path for the sample.\n\tNOTE: This will vary depending on microscope setup and probe. General knowledge of how to use the confocal microscope is required and will not be dealt with here.\nUse a water immersion objective with the appropriate magnification and numerical aperture (n.a.). We use a 40x water immersion plan-apochromat objective (n.a. 1.0).\nOpen pinhole to achieve an optical section of approximately 2 - 2.5 µm for the time-lapse video. This reduces the occurrence of mitochondria moving out of focus during time-lapse.\nTransfer organotypic slice to the bath:\nAdd a drop of imaging solution or culture medium to a small plastic Petri dish.\nIn a sterile hood, use sterile forceps to transfer one organotypic slice from the membrane insert to the drop. The forceps should only touch the confetti and not the slice.\nPut the lid on the Petri dish.\nImmediately put the culture dish containing the rest of the slices back in the incubator.",
    "Bring Petri dish containing slice to the microscope.\nTurn off peristaltic pump while transferring slice to microscope bath. First, use forceps to lift confetti with slice from Petri dish to the top of the bath (the confetti will float). Then place the two tips of the forceps on each side of the confetti so that they touch the confetti without touching the slice, and push the confetti through the solution to the bottom of the bath. Center the confetti in the middle of the bath.\nUse forceps to place the hold-down anchor (harp) on top of the confetti without touching the slice.\n\t\tNOTE: A harp is a horseshoe-shaped platinum anchor that is used to prevent the slice from floating or drifting in the bath. For acute slices, thin strings run from one side of the harp to the other (resembling a music harp). For organotypic slices, the harp should be stringless and fit the size of the confetti in such a way that it can lay on top of the confetti without touching the slice.\nTurn peristaltic pump back on.\nLower the objective down to the sample.\nSelect cell and region to image.\n\tNOTE: Avoid excessive exposure of the cells to laser light as this can cause cell toxicity (see tips in the points below).\n\t\nUse the eyepieces and the fluorescent lamp to find a healthy-looking oligodendrocyte with the correct expression. Typically, oligodendrocytes that have a strong overexpression of fluorescent protein appear unhealthy. Unhealthy oligodendrocytes will have processes with a blobby appearance, and the mitochondria will appear fragmented. In healthy oligodendrocytes, the soma and processes appear smooth and mitochondria have various lengths (although typically much shorter than in neurons and astrocytes13,14,15).\nPlace the cell of interest in the middle of the field of view.",
    "Use the \"live\" function in the software (for Leica and Zeiss microscopes) to identify the cell on the screen and choose an area of interest, e.g., a part of the cell that contains several primary processes or myelin sheaths, or a single process or myelin sheath.\n\t\tNOTE: To be able to image as much of the processes/sheaths as possible, choose areas containing processes that lay relatively flat in the x-y direction.\nZoom in on the field of interest (typically producing an image with pixel size of 0.14 - 0.30 µm).\nUsing the \"regions\" tool, draw a rectangle around the area and choose the option to scan only the selected region. Scanning time, and thus laser exposure, is reduced by only scanning the selected region.\n\t\tNOTE: Horizontal rectangular regions will be scanned faster than vertical regions due to the shorter number of scanned lines needed. If a vertical rectangle region is scanned, the scanning time can be reduced by rotating the scan field by 90 degrees (using the rotation tool).\nAdjust laser power and gain to get a good view on mitochondria.",
    "NOTE: Use the minimal laser power needed. If possible, turn up gain rather than increasing laser power. In addition to causing cell toxicity, too high laser power will bleach the imaged objects over time, thus requiring a further increase of laser power or gain during scanning. The required laser power and gain will depend on the expression level and the microscope. With an LSM700 confocal microscope, we use a 555 nm laser at a power of 20-40 µW to image dsred or tdtomato and a 488 nm laser is used at 20 - 30 µW to image GFP (laser power measured at the back aperture of the objective). Gain is set high for live imaging, usually in the range of 700 - 800 for GFP and 850-980 for dsred and tdtomato. The high gain may cause some more background noise, which is removed by increasing the digital offset (offset values typically lay between 0 and 15). In our experience, using MBP_mito_GFP gives a better signal-to-noise than MBP_mito_dsred.\nSelect scan speed.\n\tNOTE: Minimize scanning time by using a fast scanning speed and by drawing a small scanning region (see point 4.10.5 below). It is also possible to save scanning time by performing a bidirectional scan. However, this is not recommended due to poorer image quality.\nSet frequency and duration of time-lapse recording, e.g. capture images every 2 seconds for a total of 20 minutes for mitochondrial imaging in oligodendrocytes.",
    "NOTE: The frequency and duration should be set according to the mobility of the objects of interest. A higher frequency will expose the specimen to more laser light, but faster-moving objects also require a shorter total duration of time-lapse videos (e.g. mitochondria in neurons, which move more frequently and at a much higher speed than mitochondria in oligodendrocytes, are typically imaged every second for a total of 2 minutes16).\nStart time-lapse recording.\n\tNOTE: The mitochondria may move out of focus and/or drift out of the imaged region during the recording. To minimize vibrations and movement, adjust in- and outlets of the bath and reduce pump speed if needed. Small changes in focus usually still occur. Thus, continuous monitoring of the screen during imaging is required, with small adjustments of the focus during the recording.\nCapture a z-stack of the whole cell for future identification of cell and imaged process.\n\tNOTE: For better resolution, the pinhole should be reset to 1 airy unit for the z-stack.\nOptional: Visualize unstained myelin.\n\tNOTE: In oligodendrocytes transduced with (cytoplasmic) GFP, the myelin sheaths can usually be identified as straight lines of cytoplasm (the cytoplasmic ridges) connected to a primary process (see Figure 2 A and B). However, if GFP expression is too weak or a cytoplasmic marker is not used, it is possible to visualize the myelin sheath by confocal reflectance microscopy (CoRe) as explained here.\n\t\nSet up a new light path in the software with laser excitation at 488 nm and capture emitted light around the same wavelength, e.g. 470-500 nm.\nAdjust laser power and gain until myelin is visible (see example in Figure 3). Using an LSM 510 Meta microscope, we typically use a laser power of 7 - 12 µW (measured at the back aperture of the objective).",
    "Optional: preparation of slices for immunostaining.\nIf the imaged cell must be identified after immunostaining, capture a low magnification image (10x) of the cell and indicate its location in the image by drawing an arrow or similar. To aid detection of the cell, it is recommended to also draw a manual map of the whole slice, indicating the location of the cell.\nFix slice in 4% paraformaldehyde (PFA) on shaker for 1 hour in room temperature.\n\t\tCAUTION: PFA is harmful. Use protective wear and only use in a ventilated hood.\nDilute fixative 1:10 in PBS and leave at 4°C until starting immunohistochemistry as described elsewhere17.\n\t\tNOTE: Although slices can be left in diluted fixative for several weeks, fluorescence may fade. Performing immunohistochemistry within 10 days of fixation is recommended.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}