{
  "id": 11323,
  "origin_website": "Jove",
  "title": "Fabrication of Biologically Derived Injectable Materials for Myocardial Tissue Engineering",
  "procedures": [
    "1. Pre-processing Tissue Preparation\n\tBefore using this protocol, one must have already decellularized the tissue of choice.  For this example, fresh porcine and human pericardium samples are decellularized using hypotonic and hypertonic rinses in deionized (DI) water and sodium dodecyl sulfate (SDS).\n\tSpecifically, first wash the porcine pericardium in DI water for 30 minutes, then stir continuously in 1% SDS in phosphate buffered saline (PBS) for 24 hours, followed by a 5 hour DI water rinse. For human pericardia, first rinse in DI water for 30 minutes, then stir continuously in 1% SDS in PBS for 60-65 hours, followed by an overnight DI rinse. Remove all specimens from their final solution and rinse again under running DI water 1. \n\tTo verify decellularization, remove a small piece, fresh freeze it in O.C.T. freezing medium, and take 10 μm tissue sections every 100 μm throughout the sample for examination via histological analysis, as previously reported 34-36.\n\tUse hematoxylin and eosin (H&E) stains to examine the tissue for the absence of nuclei. One could also use a fluorescent Hoescht 33342 stain (1.0 μg/mL) for DNA to verify the H&E results; briefly, fix the sections, rehydrate and rinse in water, stain for 10 minutes, and then rinse well and store in the dark. Alternatively, one can use a kit such as the Qiagen DNeasy Blood and Tissue kit, which is designed to quantify the total DNA content of a sample.\n2. Preparation of Injectable ECM\n\tLyophilization\n\tAfter appropriate preparation, freeze the decellularized samples with liquid nitrogen or by storing at -80 °C.  Lyophilize the samples until completely dry.  Depending on your system and the water content of your samples, this may take anywhere from 12 to 72 hours.\n\tMilling",
    "Once completely dry, a Wiley Mini Mill is used to grind the dry ECM into a fine powder.  Choose the appropriate sieve size for your purposes; here, the 40 gauge mesh is used.  Once the majority of the sample has come through the filter, remove the collection jar with the milled ECM powder.  If there is only a small sample, the rest of the sample can be extracted from the mill in a variety of ways; here, a Q-tip is used to remove the ECM stuck behind the stationary blades of the mill.\n\tAlways make sure that the mill is clean and free of debris.  It is also important to make sure that both the mill and your sample are totally dry; any remaining moisture will cause the ECM to aggregate and clump together, preventing successful milling.  The ECM may pick up moisture from the air and so should go directly from the lyophilizer to the mill.\n\tDigestion\n\tTo form the injectable ECM, the powder is digested pepsin. The following protocol was modified from Freyetes, et al. (2).\n\tIt is important to maintain as sterile a product as possible, as it will be injected in vivo and contamination may cause complications.  Thus, use sterile vials and weigh spoons and filter all solutions before use.  A lyophilization step after milling and before digestion will also help maintain sterility.\n\tWeigh out the desired amount of ECM powder into an appropriate scintillation vial.  For total volumes smaller than 1 mL, it is recommended you use a 2 mL vial and for larger volumes, a 20 mL vial.  This ensures that there is enough liquid in the bottom of the vial to stir effectively.",
    "Weigh out the desired amount of pepsin into a scintillation vial.  Add 0.1 M HCl such that the pepsin is at a concentration of 1 mg/mL.  Make sure the pepsin is fully dissolved (no particulates) before use   this can be hastened by vortexing the pepsin solution.\n\tAdd the pepsin/HCl solution to the scintillation vial with the ECM powder so that the ECM is at a concentration of 10 mg/mL.\n\tStir solution continuously for 60-65 hours, periodically scraping down the sides of the vial with a weigh spoon or spatula.\n\tpH Adjustment\n\tThis step is performed to bring the liquid matrix material to physiological pH and to inactivate the pepsin, keeping it from cleaving the ECM further. Again, be sure to use filtered solutions made with Millipore water.\n\t1 M NaOH is added to be 1/10 the original volume.  Test the pH at this point and add small amounts (2-10 μl) of NaOH or HCl such that the desired pH (7.4) is reached.  Keep track of all small amounts added for neutralization or removed for pH testing.  Once the solution has been neutralized, add 10x PBS to be 1/10 the final volume (1/9 the current volume).  Determine the concentration of the injectable ECM and then add 1x PBS to reach desired final concentration, here 6 mg/mL.\n\tCharacterization of the injectable ECM can be done via SDS-PAGE, Blyscan Colorimetric GAG Assay, and mass spectroscopy.\n\tAt this point, the matrix material can be injected in vivo to form a scaffold for myocardial tissue engineering.\n\tBiotin-Labeling\n\tThe ECM can be tagged with biotin before injection for easy visualization of the injected ECM.",
    "Prepare a 10mM solution of Biotin and add to the injectable ECM at a ratio of 0.3mg/mg.  The ECM should be at the desired concentration for injection.  If injecting at a concentration of 6 mg/mL, add 40 μL Biotin per 1 mL of ECM.  Prior to injection, keep the biotin-ECM solution on ice for at least 1 hour.\n\tAll processing steps can be performed at room temperature.  To keep the injectable matrix from gelling, the pH adjustment step may be done on ice. \n3. Myocardial Injections\nInjection preparation\nFor the female rats (225-250 g) used here, 75 μL injections of pH 7.4 injectable ECM were prepared in 0.1 mL syringes tipped with 30 gauge needles. If male rats  (375-400 g) were used, 90 μL could be injected.\nAll surgical supplies should be sterilized prior to surgery; here we use an autoclaved surgical pack that contains all the necessary tools.\nOn the day of surgery, a Harlan Sprague-Dawley rat is anesthetized using isoflurane at 5%, intubated using an otoscope, and then maintained at 2.5% isoflurane throughout the procedure.\nAdd artificial tear ointment to the animal's eyes to protect against dryness and hair.  Administer 3 mL of Lactated Ringers solution for hydration during surgery.  This should be done via subcutaneous injection in the lower abdominal area.\nPlace the animal in supine position on the surgical table and gently tape down limbs.  Use clippers to remove the hair on the abdomen and vacuum free hair prior to scrubbing.",
    "Make a series of small injections (approximately 50 μL each) of 2% lidocaine along a diagonal from the zyphoid process to the lower right-hand side of the abdomen.  Then scrub three times with betadine, starting in the middle and moving outward.  Repeat with 70% ethanol.  Cover the animal using a surgical drape with a pre-made circular window; secure with towel clamps, if necessary.\nUsing a No. 10 scalpel make a 3-4 cm incision from the xyphoid process to the lower right-hand side of the abdomen.  Locate xyphoid process and dissect vertically down through the muscle to the right, being careful to avoid the large vessel on the right.  Once you have dissected through the muscle, use scissors to cut laterally through the muscle, exposing the diaphragm.  Be careful to avoid the liver.\nUsing a 36 inch length of 3-0 Vicrile suture and a pair of hemostats, drive one needle through the zyphoid process and pull the suture halfway through.  Tape the ends of the suture together and fix that to a point above and behind the animal   essentially lifting the zyphoid up and exposing the diaphragm.  With another 36 inch length of 3-0 Vicrile suture, drive a needle through the muscle closest to the xyphoid process and, again, pull through and fix the ends to another point to the right of the surgical table, fully exposing the surgical cavity.",
    "At this point, you should be able to see the heart through the diaphragm.  Using a small pair of rat tooth microforceps, grab the center of diaphragm, pull it out toward you and make a very small incision with blunt scissors.  It is extremely important to use very blunt scissors in order to avoid poking the lungs.  Once this hole has been made, the lungs will retract, allowing you to make a 2-3 cm incision vertically through the diaphragm to visualize the heart.\nInsert a 3-inch Q-tip to the left of the cavity to push the lungs out of the way.  Use a towel clamp to secure the Q-tip in place.  Use another Q-tip to move the right lung out of the way in order to locate the pericardial sac.  Using a pair of microforceps and a pair of large serrated forceps, tear through the pericardial sac, exposing the apex of the heart.  If the animal has previously undergone an infarction procedure, the pericardium will already be absent.\nGrab the apex of the heart with the rat tooth microforceps and inject the liquid matrix material a third of the way up from the apex.  Insert the needle parallel to the epicardial surface and inject with the beveled edge of the needle to the left.  Be sure to avoid the great cardiac vein.  Wait a couple seconds before removing the needle.  You should see a whitening of the tissue at the site of injection.",
    "Clean up blood in the cavity and remove the towel clamp and Q-tip that was holding the right lung.  Use curved microhemostats and the rat tooth microforceps to close the diaphragm.  Make an initial knot and then use the serrated forceps and microhemostats to close the diaphragm with a continuous suture and a tapered needle.  Before closing entirely, insert PE160 suction tubing and use a 10 mL syringe to evacuate the chest cavity as the suture is tightened.\nWhen properly evacuated and closed, the diaphragm should be concave.  A convex diaphragm indicates that there is still air in the cavity.\nAt this point the isoflurane can be turned down to 1%.\nTake out both 3-0 Vicrile sutures holding the cavity open.  Use sterile water to hydrate the muscle, wiping excess away with a Q-tip or sterile gauze.  Use a new length of 3-0 suture to close the muscle layer with intermittent sutures.\nAt this point, the isoflurane can be turned off.\nClean area with sterile water and use staples to close skin.  If staples will interfere with the study, 5-0 proline suture can also be used.  In that case, use a reverse cutting (RC) needle to close the skin with intermittent sutures.  In both cases, spot surgical glue over the closed incision.\nUse a Q-tip to anoint the incision site with a triple-antibiotic ointment.\nAllow the animal to recover under 100% oxygen.\nWhen the animals starts to breathe around the ventilator, remove the trachea tube.\nOnce the animals are sternal, administer a subcutaneous injection of 0.05 mg/kg of buprenorphine hydrochloride and return them to their home cage on a sterile towel.\nThe animals should receive post-operative observation and care.",
    "At the time points of interest, the animals are euthanized and the hearts removed for analysis.  Short axis cross sections are taken and can be stained with hematoxylin and eosin (H&E) for gross tissue analysis.  At short time points, the injected region will appear as a pink, fibrous network that has spread interstitially.  At later time points, one will observe an influx of cells and an eventual degradation of the injected matrix after 2 to 3 weeks.  If the ECM was labeled with biotin before injecting, it can be more directly visualized by staining the biotin with HRP-conjugated streptavidin. Immunohistochemical staining can be used to identify specific cells or structures in the injection region, here the slides have been co-stained with a FITC-conjugated isolectin that binds to endothelial cells and fluoresces green and an anti-smooth muscle actin antibody with an Alexafluor secondary antibody that reports the SMCs in red.\n4. Representative Results",
    "Previous characterization of matrix materials prepared in this way demonstrated the retention of a variety of macromolecules.  Specifically, multiple fibrous proteins and glycoproteins were identified via mass spectrometry (Table 1).  If the matrix materials processed according to this protocol are found to no longer contain a complex array of macromolecules, it could be that the decellularization protocol employed is too harsh. Once fully lyophilized, the dried pericardial ECM looks like very stiff, crumpled paper.  Other tissue types will resemble packing peanuts.  If milled well, the ECM should fall through the sieve and be collected in the jar at the bottom.  If there is moisture left in the sample, the ECM will clump together and get stuck in the milling chamber.  After digestion, the ECM solution should be a milky color and completely free of visible particulates.  It will also be slightly more viscous than the HCl alone.  If the ECM does not digest well, there will still be large particulates in the vial; alternatively, the ECM may crash out of solution.  After pH adjustment, there is no visible change in the solution, and the ECM is still a cloudy, homogeneous liquid. If it starts to gel, the viscosity will increase and it will be difficult or impossible to draw the material up into a syringe. If this happens, perform the pH adjustment step on ice, with pre-chilled solutions. Once the injections have been prepared, keep them on ice until use. If the injection is successful, the region around the needle tip whitens and a small bolus is visible. If this is not observed, the injection may have gone into the chamber instead of into the wall. When suturing the animal up after injection, careful closing of the diaphragm is the most important step.",
    "If done correctly, the diaphragm will be tight against the lungs and will appear concave. If there is any air left inside the lungs, the diaphragm will remain convex, or have an area where it balloons out. When examining the histology of the injection region at an early time point (30 minutes to 4 hours post-injection), one should see a pink, fibrous area that is devoid of cells   this is the reassembled matrix material post-injection (Figure 2). The network often spreads interstitially and may be present throughout many sections. A possible explanation for seeing only a very small area of matrix gel is that a portion of the injection missed the intramural target and was either injected into the LV chamber or leaked out of the injection location. Additionally, depending on the gelation time, the interstitial spread may vary.",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/2109/2109fig1.jpg\nFigure 1. Polyacrylamide gel electrophoresis (PAGE) results.  (A) Molecular weight standard. (B) Rat tail collagen Type I (2.5 mg/mL) compared to the solubilized human (C) and porcine (D) pericardial ECM (7 mg/mL). Note the presence of collagen as well as several other proteins and peptides in the pericardial matrix samples.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2109/2109table1.jpg\nTable 1. ECM components identified with mass spectroscopy.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2109/2109fig2.jpg\nFigure 2. Myocardial injections: in vivo gelation. H&E stain of human (A) and porcine (B) pericardial matrix injections that have gelled in vivo after 45 minutes. Arrows denote matrix location, stained lighter pink than the myocardium. Scale bar is 500 μm.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2109/2109fig3.jpg\nFigure 3.Vascular cell infiltration. Fluorescent stains for vessels in the injected human (A-C) and porcine (D-F) matrix gels at two weeks. Endothelial cells are labeled green (A, D), while smooth muscle cells are labeled red (B, E).  Merged images are shown in C and F. Scale bar is 100 μm. The white dotted lines indicate the area of matrix injection, as determined by H&E analysis of a nearby section.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2109/2109fig4.jpg\nFigure 4. Stem cells within matrix injection region. A Hoescht stain for nuclei (blue) and c-kit (green) identifies stem cells in the human (A) and porcine (B) matrix injection regions. Scale bar is 50 μm.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}