{
  "id": 10476,
  "origin_website": "Jove",
  "title": "Production of Extracellular Matrix Fibers via Sacrificial Hollow Fiber Membrane Cell Culture",
  "procedures": [
    "1. Production of Extracellular Matrix Using Sacrificial Hollow Fiber Membranes\nCAUTION: N-methyl-2-pyrrolidone is an irritating solvent and reproductive toxicant. Exposure to NMP may cause irritation to the skin, eyes, nose, and throat. Solvent-resistant personal protective equipment should be used when handling NMP. Use of NMP should be performed within a fume hood.\nPreparation of polysulfone polymer solution for hollow fiber membranes\nWeigh 70 g of polysulfone pellets (molecular weight of 35 kD) in a weigh boat using an analytical balance.\nTransfer 314 mL (323.3 g) of N-methyl-2-pyrrolidone (NMP) to a clean borosilicate flask.\nPlace a stir bar in the flask with NMP and place flask onto stirrer. Set the stirrer to a moderate rate of rotation.\nUse a dry funnel to slowly insert the prepared 70 g of polysulfone into the flask with NMP.\nAllow the polymer “dope” solution to stir for three days at room temperature, or until homogenized.\nSetting concentricity and cleaning of the hollow fiber membrane spinneret\n\tNOTE: Spinnerets are commercially available; correct spinneret dimensions are critical to successful membrane fabrication and are listed in the Table of Materials. Handle the spinneret very gently, as the spinneret needle is particularly fragile.\n\t\nUse a screwdriver or drill with an appropriate screwdriver bit to carefully disassemble the spinneret.\nGently flow acetone through the inlet and outlet of the spinneret, collecting any acetone and residual polymer in a glass beaker for disposal.\nSecure the upper body of the spinneret with the needle facing upward in a table vise.\nPlace the outlet (bottom) body of the spinneret onto the upper body.\nMove the outlet body of the spinneret laterally while holding the upper body fixed on the vise until the spinneret needle is directly in the center of the outlet body.",
    "Carefully and slowly reinsert the screws connecting the two bodies of the spinneret while ensuring that the needle visible at the spinneret outlet remains centered.\nFabrication of polysulfone hollow fiber membranes\nPrepare a “bore solution” containing 45 mL of N-methyl-2-pyrrolidone and 255 mL of deionized water, forming a 15% mixture of NMP with deionized water.\nMount a concentric hollow fiber membrane spinneret 8 cm above the surface of a room-temperature tap water bath.\nConnect the polymer inlet of the spinneret and the bore inlet of the spinneret to two separate steel pressure vessels having an inner volume of at least 350 mL. Both vessels must have check valves at their outlets.\nConnect each of the pressure vessels to the regulators of separate N2 gas cylinders\nUse a funnel to insert the prepared dope solution (~315 mL) into the pressure vessel connected to the polymer inlet of the spinneret. Ensure that the top of the vessel is tightly sealed.\nUse a funnel to insert the prepared bore solution (300 mL) into the pressure vessel connected to the bore inlet of the spinneret. Ensure that the top of the vessel is tightly sealed.\nOpen the check valve for the bore vessel first, then the polymer vessel second. If the spinneret is sufficiently clean, the bore solution will begin to stream out of the spinneret outlet.\nPressurize both vessels to 1 PSI. Visually confirm that both polymer and bore solutions are exiting the spinneret, with a continuous white filament precipitating as the combined streams contact the water bath.\nUse long forceps to guide the nascent fiber under the rollers in the center of the bath, and then wind the nascent fiber around a rotating wheel connected to a motor.",
    "Set the take-up wheel and motor to rotate at a rate of approximately two meters per minute.\nMake minor adjustments to the regulators or take-up wheel speed as needed until a steady-state flow is achieved. The nascent fiber should form a 90° angle with the surface of the water bath.\nClose the N2 cylinder regulators and pressure vessel check valves and disengage the take-up wheel motor after all polymer and bore solution has been extruded from the vessels.\nRemove the prepared hollow fiber membranes and place them into a deionized water bath for three days, exchanging deionized water once per day to remove residual solvent.\nSterilize the hollow fiber membranes by autoclaving them at 121 °C for 30 minutes or by immersing them for one day in 70% ethanol.\nCell seeding of hollow fiber membranes\n\tNOTE: All cell culture procedures should be performed within a biosafety cabinet.\n\t\nTreat the hollow fiber membranes with a 20 µg/mL solution of bovine plasma fibronectin in PBS (pH = 7.4) to promote cell attachment.\n\t\t\nWeigh 1 mg of powdered bovine plasma fibronectin in a weigh boat and dissolve it in 1 mL of sterile PBS (pH = 7.4) in a sterile 1.5 mL microcentrifuge tube.\nIncubate the 1 mg/mL bovine plasma fibronectin solution in the incubator for 30 minutes. Add the solution to 49 mL of sterile PBS in a sterile 50 mL conical centrifuge tube.\nIncubate the fibers in the prepared 50 mL of bovine plasma fibronectin in an incubator at 37 °C with 5% CO2 for 1 hour. Recollect the fibronectin solution for later use and store in a sterile 50 mL conical centrifuge tube at 4 °C.\nUse sterile microscissors to cut the fibers to desired length (<6 cm).",
    "Seed fibroblast cells directly into the lumina of the hollow fiber membranes at a seeding density of 100,000 cells per fiber using a 21-gauge needle with 1 mL syringe.\n\t\tNOTE: A practicable target for preparing the cell-suspension for loading in the syringe is a suspension density of 100,000 cells for every 30 microliters of medium.\nPlace six seeded fibers into a 6 cm diameter Petri dish. Allow the seeded fibers to incubate at 37 °C with 5% CO2 for five minutes.\nRemove the seeded fibers from incubation and culture them for up to 3 weeks in DMEM/F-12 containing final concentrations of 50 µg/mL L-ascorbic acid and 150 µg/mL L-ascorbic acid 2-phosphate (freshly prepared and sterile filtered), 5 ng/mL TGF-β1 (from sterile filtered aliquots stored at -20 °C), and 1% penicillin-streptomycin in a 6 cm Petri dish within a 5% CO2 incubator at 37 °C. Exchange cell medium every two days.\nExtraction of extracellular matrix from cultured hollow fiber membranes\nPlace cultured fibers into individual scintillation vial using forceps.\nPlace up to 5 mL of NMP into each vial using a glass pipette.\nImmerse the hollow fibers in NMP, performing a total of three exchanges of NMP. Slowly aspirate the old NMP using a 1 mL pipette to prevent tearing of extracted ECM.\n\t\tNOTE: When adding fresh NMP, it is helpful to tilt the vial and allow the NMP run down the sides, otherwise the remaining ECM scaffold is subjected to shear which may cause tearing.\nRemove NMP and rinsed the resulting ECM thread 3 times in deionized water.\nCut a 1/32-inch thick sheet of silicone rubber to a length of 3 inches, width of 1 inch and cut an 8 mm by 4 mm rectangular mold in the center of the length of rubber.",
    "Place the prepared piece of rubber onto a standard 3-inch by 1-inch microscopy slide and autoclave at 121 °C for 30 minutes.\nLay each ECM fiber side by side in the 8 mm by 4 mm silicone mold until there is no visible open space.\nPlace the mold into a 50 mL conical centrifuge tube and freeze at -80°C until completely frozen.\nLyophilize frozen ECM mesh overnight or until completely dry. Store the mesh at 4°C until ready for decellularization.\n2. Decellularization of Extracellular Matrix\nPrepare a solution of 1% (w/w%) sodium dodecyl sulfate (SDS) in deionized water.\nIncubate extracted extracellular matrix in the mold in 1% SDS for 24 hours at room temperature on a rocker with gentle agitation.\nRinse extracted extracellular matrix three times in sterile phosphate-buffered saline (PBS) with gentle agitation, using 3 mL of PBS per rinse.\n\tNOTE: Rinses should be performed gently to minimize tearing of prepared scaffolds.\nPrepare 1 L of DNAse/RNAse digestion buffer.\n\tNOTE: DNAse/RNAse digestion buffer may be stored for several months at 4°C.\n\t\nWeigh 1.54 g of Tris HCl, 308 mg of MgCl2, and 56 mg of CaCl2 in separate weigh boats.\nCombine Tris HCl, MgCl2, and CaCl2 with 1 L of deionized water in a large flask with a stir bar and stir until all components are dissolved.\nSterile filter the digestion buffer with a 0.22 µm filter into a sterile 1 L borosilicate bottle and store at 4°C.\nPrepare 5 mL of DNAse/RNAse digestion solution.\n\tNOTE: Digestion solution should be used within 24 hours of preparation.\n\t\nWeigh 0.125 mg (50 kU) of DNAse I in a weigh boat and add to 5 mL of digestion buffer.\nAdd 75 µL of RNAse A stock solution to the digestion buffer.",
    "Fill each mold with digestion solution and incubate at 4 °C for 6 hours.\nAspirate the digestion solution and rinse three times in sterile PBS.\nAspirate the PBS and incubate scaffolds overnight in 10% penicillin-streptomycin in PBS at 4°C.\nAspirate the penicillin-streptomycin and rinse scaffolds three times in sterile PBS.\nPlace the mold into a 50 mL conical centrifuge tube and freeze at -80°C.\nLyophilize the decellularized ECM mesh overnight or until completely dry.\nTransfer the lyophilized scaffolds within a biosafety hood to a sterile container at 4°C pending use.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}