{
  "id": 17211,
  "origin_website": "Jove",
  "title": "A Protocol for Constructing a Rat Wound Model of Type 1 Diabetes",
  "procedures": [
    "The protocol was conducted following the Declaration of Helsinki, and all animal experiments were approved by the Management Committee from Chengdu University of Traditional Chinese Medicine (Record No. 2021-13).\n1. Preparation of the streptozotocin injection\nSelect 15 SD male specific pathogen-free (SPF) rats aged 8 weeks and weighing 220 g ± 20 g. Using the simple randomization method, divide the rats into a diabetic group (n = 10) and a normal group (n = 5).\nMeasure the initial weight of the rats, and determine the dosage of STZ through the administration of 55 mg/kg.\n\tNOTE: Based on pre-experiments, 55 mg/kg is the optimal STZ dose.\nWeigh the STZ powder accurately, and place it in a light-proof container.\nAdd an appropriate amount of 0.1 mol/L sodium citrate buffer (pH 4.5) to dissolve the STZ to a concentration of 1 %.\n\tNOTE: The sodium citrate buffer must be pre-cooled for 2 h in a 4 °C refrigerator before use. The preparation of the STZ solution must assure sterility.\nShake for 30 s using a drug oscillator. Place in an ice box, and set aside.\n\t​NOTE: The injection should be used within 15 min.\n2. Induction of the T1DM model\nBefore the STZ injection, fast the rats for 18 h, and allow free access to water.\nPerform an intraperitoneal injection of 1% STZ solution.\n\t\nGrasp the rat, and expose the abdominal skin and the injection site (the intersection of the line connecting the roots of the two thighs and the midline of the abdomen).\nDisinfect the injection site twice using a cotton ball soaked in 75% alcohol (once clockwise and once counterclockwise). Place the rat's head below the abdomen.",
    "Insert the needle parallel to the abdominal midline at an angle of 45°, and after piercing the skin, reduce the needle angle to 30°, and then insert the needle 2-3 mm. Gently pull the needle plug, ensuring no blood or fluid is sucked into the syringe. Inject the STZ solution, pull out the needle, and stop the bleeding with a cotton swab.\n\t\tNOTE: If a yellow fluid is drawn back into the syringe, the needle may have penetrated the bladder, and if a dark green fluid is drawn, the needle could have penetrated the large intestine or caecum. In either case, the needle should be removed immediately. The animal should be evaluated by veterinary personnel.\nMeasure the casual (non-fasting or fasting) blood glucose levels at 09:00 am on day 3 and day 7 after STZ induction.\n\tNOTE: The time for random the blood glucose measurement is fixed. In this protocol, it is fixed at 09:00 am. However, it is not the only time used. Blood collected from the caudal vein by a needle puncture is less susceptible to tissue fluid than blood taken from a severed tail, so blood glucose values are more accurate.\n\t\nImmobilize the rat using a rat fixator (Figure 1).\nFind the location of the caudal vein. Disinfect the tail of the rat twice using a cotton ball soaked in 75% alcohol.\nPuncture the caudal vein to induce bleeding, and measure the blood glucose using a glucometer. Stop the bleeding with a cotton swab.\n\t\tNOTE: A glucose level higher than 16.7 mmol/L on day 7 after the STZ injection is considered T1DM.\nWeigh the rats weekly, and measure the blood glucose levels and other parameters, including diet, water intake, and urine output.\nFeed the animals normally for 8 weeks after STZ induction.",
    "3. Construction of the wound model\nShave the rats with an electric razor 1 day before wound modeling. A shaved area of 5 cm x 5 cm on the dorsum side of the rat is generally ideal.\nWipe the shaved area with a warm normal saline cotton ball, allow it to dry, and then apply depilatory cream for 5 min. Clean the area with gauze, and wash any residual depilatory cream with warm normal saline.\nWeigh the rats, and calculate the required dose of Nembutal based on the 35 mg/kg standard. Dissolve the Nembutal using normal saline to a concentration of 3%. Other general anesthetics such as ketamine/xylazine or isoflurane can be used for this procedure. Please work with Institutional Animal Care and Use Committees to ensure what is best.\n\tNOTE: To ensure efficacy, the solution should be freshly prepared, and the Nembutal powder and solution should be protected from light.\nFast the rats for 12 h before anesthetization. Inject the anesthesia intraperitoneally. Use tetracycline eye ointment or a general eye lubricant to prevent eye dryness following the anesthesia administration.\n\tNOTE: Anesthesia was considered moderate when the rat's muscles were relatively relaxed, the eye movements disappeared, the breathing was regular, and the response to painful stimuli was small.\nDisinfect the dorsal skin twice using cotton balls soaked in iodine (once clockwise and once counterclockwise) and 75% alcohol (alternative rounds).\nAfter drying, cut the skin with a 20 mm diameter circular biopsy punch.\nTent the skin with sterile forceps, and then use sterile surgical scissors to remove the full-thickness skin along the punch cut marks. Stop the bleeding with a normal saline cotton ball.",
    "NOTE: The wound's superior border should be 5-10 mm below the lower scapular border and 5-10 mm to the right/left of the spine of the rat (Figure 2). The wounds are symmetrical along the spine when two wounds are constructed.\nUse Vaseline gauze to cover the wounds, and wrap them with a gauze and breathable bandage held in place with rubber tape. Inject carprofen subcutaneously (5 mg/kg) once daily to relieve postoperative pain. Change the wound bandage once a day (use of carprofen for pain relief).\n\tNOTE: Observe the rat's movement and respiration for any abnormalities after the bandage is completed, and ensure that the breathable bandage is appropriately tight.\nPlace a ruler under the wound, and photograph the wound with a digital camera until day 14. Euthanize the rats on day 14 according to the institutional animal care and use guidelines. Cut the wound skin tissue 5 mm from the wound edge. Divide the tissue sample into two parts, wash them with PBS to remove visible blood stains, and then fix them with 4% paraformaldehyde solution.\n4. Calculation of the wound area with ImageJ software\nClick on the File button after opening the software, and then drop down and click on Open to open the wound pictures.\nSelect the Straight tool, and draw a straight line of 1 cm along the ruler in the wound pictures.\nClick on the Set Scale command in the Analyze menu, and set the Known distance to 1.\nSelect the Freehand selections tool, and sketch the outline of the wound on the picture.\nClick on the Measure command in the Analyze menu, and read the Area value after the result pops up.\n5. Hematoxylin and eosin (H&E) staining",
    "Remove the skin tissue from the fixative, cut it into thin sections with a scalpel in a fume hood, and place it in a dehydration cassette.\nPut the dehydration cassette in a dehydration machine, and dehydrate the tissues in the following steps: 75% alcohol for 4 h; 85% alcohol for 2 h; 90% alcohol for 2 h; 95% alcohol for 1 h; anhydrous ethanol I and II for 30 min each; alcohol benzene for 5-10 min; xylene I and II for 5-10 min each; and wax I, II, and III for 1 h each.\nEmbed the tissues in wax. Cool at −20° on a freezing table, and correct the wax block neatly.\nCut the wax blocks longitudinally using a paraffin sectioning machine into 3 µm thick sections.\nSequentially soak the section in xylene I and II for 20 min each, anhydrous ethanol I and II for 5 min each, and tap water for 5 min.\nFlood the tissues with hematoxylin stain for 3-5 min, 0.5% aqueous hydrochloric acid solution differentiation, 0.5% aqueous ammonia solution back to blue, and rinse with water.\nDehydrate the tissue sections with 85% and 95% alcohol. Flood the tissues with eosin staining solution for 5 min.\n\tNOTE: Normally, eosin staining takes 30 s to 2 min, and the time can be adjusted according to the staining results and requirements.\nDehydrate the sections sequentially with the following solutions: anhydrous ethanol I, anhydrous ethanol II, anhydrous ethanol III, xylene I, and xylene II, each for 5 min. Finally, cover the glass slides with neutral balsam.\nExamine the H&E-stained tissues under the microscope at 40x, 20x, and 10x, and take pictures to retain representative images of each slide.\n6. CD31 immunofluorescence staining",
    "Soak the tissue sections in xylene I and II for 15 min each, anhydrous ethanol I and II for 5 min each, 85% alcohol for 5 min, and 75% alcohol for 5 min, and rinse with distilled water.\nAntigen repair\n\t\nAdd a suitable 10 mM citric acid buffer of pH 6.0 to a microwave oven container, heat it to boiling on high, and then place the glass slide into it.\nBoil for 8 min on a medium heat, stop for 8 min, and then boil again at a medium-low heat for 7 min.\nAllow the slides to cool, place them in PBS (pH 7.4), and wash them three times for 5 min each using a decolorization shaker.\nAdd 5% goat serum dropwise in the circle, and incubate for 30 min.\nGently shake off the closure solution (5% goat serum), and add rabbit anti-CD31 antibody (diluted using PBS at a ratio of 1:200) dropwise onto the sections. Place the sections in a wet box, and incubate overnight at 4°C.\nWash the slides three times with PBS (pH 7.4) on a decolorization shaker for 5 min each. Lightly shake the sections to dry them, and then cover them with a circular drop of FITC-labeled goat anti-rabbit IgG. Incubate at room temperature for 50 min in darkness.\nWash the slides three times with PBS (pH 7.4) on a decolorization shaker for 5 min each. Air-dry the sections with light shaking, and add DAPI staining solution. Incubate the sections in the dark for 10 min at room temperature.\nAfter drying the sections, draw circles around the tissue with the PepPen (to prevent the loss of antibodies), add an autofluorescence quenching agent (0.3% Sudan Black B) to the circles for 5 min, and thereafter rinse them under running water for 10 min.",
    "Wash the slides three times with PBS (pH 7.4) on a decolorization shaker for 5 min each. Shake the sections slightly, and seal them with an antifade mounting medium.\nObserve and photograph the sections under a fluorescence microscope at 40x, 20x, and 10x.\n\t​NOTE: The DAPI UV excitation wavelength is 330-380 nm, and the emission wavelength is 420 nm (blue light). The FITC excitation wavelength is 465-495 nm, and the emission wavelength is 515-555 nm (green light).\n7. Statistical analysis\nCollect and analyze the data using SPSS.\nReport the data as mean ± standard deviation.\nUse an independent samples t-test to analyze the differences between the diabetic and normal groups.\nSet the statistical significance at **p < 0.01 and *p < 0.05."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}