{
  "id": 11239,
  "origin_website": "Jove",
  "title": "A Protocol for Detecting and Scavenging Gas-phase Free Radicals in Mainstream Cigarette Smoke",
  "procedures": [
    "1. Materials\nAll solvents used in this work were reagent grade. The spin trap, including N-tert-butyl-α-phenylnitrone (PBN) and the standard spin label 2,2,6,6-tetramethyl-1-piperinyoxyl (TEMPO) were obtained from Sigma and were used as supplied. The plant antioxidants were obtained commercially from Swanson, Inc. USA.\n2. Preparation of cigarette smoke and analysis of free radicals\nTo introduce antioxidants into the filter, the antioxidants pycnogenol and grape seed extract were first dissolved in 95% ethanol, while lycopene was dissolved in acetone. The solvent volumes were different depending on the antioxidant solubility.\nThe amount of antioxidants of 0.4 mg/filter was used. They were then coated with 10 mg of activated carbon. For this purpose activated carbon was stirred for ~12 hrs with the antioxidant solution in anaerobic conditions, filtered and dried under vacuum.\nAntioxidants were then introduced into the conventional acetate filter (CA filter). For this purpose, the filter was cut into two pieces. The coated plant antioxidants were inserted between two pieces of the filter and wrapped with a piece of tape to form a filter - antioxidant -filter sandwich (Fig. 1A). This combined filter was subsequently attached to cigarette rods containing tobacco. The control filter was made in the same way as the antioxidant filter except no antioxidant was added.\nPrior to the smoking simulation, the research cigarettes were unpacked and kept in a constant humidity environment (20 °C, 60% relative humidity) using a saturated NaBr solution for a minimum of 2 days.",
    "Smoking simulation for routine analysis was performed at ambient temperature using a single-port smoking device which, as shown in Fig.1, consists of a water aspirator or GAST DOA-P104-BN Vacuum Pump/Air Compressor (Benton Harbor, Mich) connected to the spin-trapping assembly through a T-junction with one end open. Puffs were performed by plugging the open end which remained open between puffs. The gas flow was checked by flow meter and set at ~2.2 SCFH = 17.5 mL/s by adjusting a valve placed between the pump and the vent.\nThe research cigarettes were smoked under the condition of puff volume of 35 mL for a duration of 2 seconds repeated every 60 seconds, similar to1. Smoking simulation for quantitative estimation of gas-phase free radicals was performed in conjunction with the spin trapping system as shown in Fig. 1.\nTen intense puffs (35 mL/puff) were taken for each cigarette. Gas-phase free radicals were collected by passing the MCS through a Cambridge filter pad and then introduced into the spin trapping solution (0.05 M PBN in benzene, 2.0 mL).\nAfter the last puff, the bubbled trapping solution was readjusted to its initial volume (2.0 mL) with the same benzene. An aliquot was transferred into a ~250 mm long, 3 mm ID glass tube sealed at one end.\nThe trapping solution was deoxygenated using a freeze-pump-thaw procedure. It was frozen under liquid nitrogen, and a vacuum was applied. Then it was thawed under argon atmosphere, allowing trapped gas bubbles to escape, and frozen again. After this cycle was repeated three times, the tube was flame-sealed under vacuum and used in further ESR measurements. This step is required because oxygen, which is well soluble in benzene, broadens ESR lines of organic radicals. Deoxygenation dramatically improves the signal-to-noise ratio.",
    "X-Band ESR spectra were recorded on a Bruker EMX spectrometer at a frequency of 9.34 GHz under standard conditions. The spectrometer settings used in most experiments were: center field 3312.5G, scan width 80G, modulation amplitude 0.5G, time constant 82 microseconds, scan time 40 sec.\nThe spin trap adducts are relatively stable at the experiment conditions, which in some cases required 25 accumulations, which typically took ~20 min. However, after 12 hrs the intensity of the ESR signals in benzene solution decreased by a factor of ~5.\nTo quantify the concentration of the trapping adduct, its initial first-derivative ESR spectrum was integrated. The resulting absorption spectrum shows a broad singlet background, most likely due to soot/tar products contained in the smoke.\n\tAfter subtraction of this background the separated triplet of the trapping adduct was integrated one more time (Fig. 2).\n3. Representative Results",
    "Most of the free radicals in burning cigarette-produced smoke (gas phase) are instantaneous and unstable. In order to observe these radicals a spin trap technique is employed. It captures gas-phase free radicals by transforming them into a spin adduct which is more stable and can be detected by ESR (Fig.1). In the present study, the spin-trap solution of 0.05 M PBN was used to collect smoke gas phase free radicals, which are a mixture of oxygen- and carbon- centered radicals which are difficult to separate15. In our case, however, the observed hyperfine splitting constants aN = 13.7G and aH = 1.95G are very similar to the corresponding values for trapping adducts of alkoxyl free radicals (RO.)2, suggesting that they are the major product. We showed that weak ESR signals and low reproducibility observed in our initial measurements (Fig. 2) were due to the moisture in the smoke flow. To resolve this problem, we added a liquid nitrogen (LN2) trap between the Cambridge filter and the spin trap solution. The LN2 trap removed water from the MCS flow by quick freezing and capturing it on the inner wall of the glass tube. This greatly improved ESR signals and allowed for highly reproducible results (Fig. 3).",
    "The amount of trapped free radicals was determined using a reference sample. For control samples without antioxidants, the typical adduct concentration in benzene estimated by comparison of its double integral spectrum with a double integral spectrum for known concentration of TEMPO was 1.24 μM (Fig.2). Since the amount of air passed through each cigarette during smoking was ~350 ml, this gives an estimate for the free radical concentration in the gas phase of MCS of ~7.1X10-9M, and a total number of radicals trapped from the gas phase of a whole cigarette of ~1.5X1015. An estimate for the total amount of free radicals in the smoke of a whole cigarette, including both gas and particulate phase, was ~1016 free radicals9.\nDifferent levels of the scavenging effect of plant antioxidants on gas-phase free radicals in main stream cigarette smoke were observed. Their scavenging rates were presented in Fig. 4. Lycopene and grape seed extract showed the highest rates while lower rate was observed for pycnogenol (Fig.4).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3406/3406fig1.jpg\nFigure 1. A diagram of improved smoking simulation design for collecting gas-phase free radicals in mainstream cigarette smoke (MCS) using spin trap. MCS was drawn by a water aspirator through CA filter, then Cambridge filter (yellow filter) and passed through a liquid nitrogen trap to remove H2O. The gas-phase products finally went to spin trap and bubbled through the spin trap solution. Plant antioxidant was placed between two pieces of conventional acetate filters (Enlarged in circle A) attached to cigarette to scavenge free radicals in MCS.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3406/3406fig2.jpg\nFigure 2. A quantitative estimate for the spin-trapping adduct concentration in benzene requires subtracting a broad background signal from the first integral spectrum. The hyperfine splitting parameters for the spin-trapping adduct are aH = 1.95 G, aN = 13.7G.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3406/3406fig3.jpg",
    "Figure 3. Passing through LN2 trap substantially improves the quality of ESR signals obtained by spin-trapping of MCS.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3406/3406fig4.jpg\nFigure 4. Effect of natural antioxidants on the concentration of free radicals in MCS. The relative signal intensities are: control - 100%, pycnogenol - 55%, grape seed extract - 12%, lycopene - 10%."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}