{
  "id": 18754,
  "origin_website": "Jove",
  "title": "In Vitro Ubiquitination and Deubiquitination Assays of Nucleosomal Histones",
  "procedures": [
    "1. GSH-agarose Affinity Purification of the GST-RING1B(1-159)-BMI1(1-109) E3 Ubiquitin Ligase Complex\nUse the pGEX6p2rbs-GST-RING1B (1-159 aa) - BMI1 (1 -109aa) bacteria expression construct to transform BL21 (DE3) bacteria (see Table of Materials)23. This construct allows the expression of murine RING1B domain 1-159 fused to BMI1 domain 1-109 with GST tag in pGEX-6P-2 backbone.\nPerform an overnight starter culture by inoculating RIL-bacteria expressing GST-RING1B (1-159 aa) - BMI1(1 -109 aa) in 20 mL of LB broth medium in presence of 100 µg/mL ampicillin and 50 µg/mL chloramphenicol. Incubate by shaking at 37 °C overnight. On the next day, add the starter culture to a 1 L flask containing 500 mL of fresh LB broth medium (1/26 dilution) with ampicillin and incubate the culture in the shaker at 37 °C for 2 to 4 h.\nDuring the incubation time, measure the OD at 600 nm with a spectrophotometer. When bacteria culture reaches 0.6 OD units at 600 nm, take a 1 mL aliquot in an 1,5 mL tube as the non-induced sample. Add 400 µM of Isopropyl β-D-1-thiogalactopyranoside (IPTG) to the 1 L culture to induce protein expression. Incubate bacteria at 25 °C for 6 h to overnight.\nCentrifuge the 1 mL aliquots at 14,000 x g for 30 s, discard the supernatant, resuspend the pellet in 200 μL of Laemmli sample buffer, and keep for SDS-PAGE and Coomassie blue analysis of protein induction.\nTransfer the induced bacteria culture from the flask into a clean centrifugation bottle and spin down at 3,500 x g for 15 min at 4 °C. Discard the supernatant and resuspend the pellet with 40 mL of cold PBS and spin down at 3,500 x g for 15 min at 4 °C.",
    "Discard the supernatant and freeze the pellet at -80 °C or proceed to the next step. If the proteins are induced at the expected molecular weight, proceed to the next step.\nResuspend the bacteria pellet in 25 mL of ice-cold lysis buffer A (50 mM Tris-HCl pH 7.5, 100 mM NaCl, 1 mM EDTA, 1% NP40, 1 mM PMSF, 0.5 mM DTT, and 1/100 anti-protease cocktail containing AEBSF, Aprotinin, Bestatin, E-64, Leupeptin, and Pepstatin A). Make sure that all the bacteria pellet is resuspended. PMSF and anti-protease cocktail must be freshly added to the lysis buffer, only at the time of bacteria lysis.\nCAUTION: Always keep the sample on ice.\nNOTE: Lysozyme at 100 µg/mL can be added to enhance bacteria lysis.\nIncubate the bacteria lysate on ice for 15 min. Use a probe sonicator and sonicate at 70% output amplitude for 30 s (4–5x), and then centrifuge at 21,000 x g for 20 min at 4 °C.\nCAUTION: During sonication, keep always the samples on ice.\nDuring the time of centrifugation, take 500 µL packed GSH-agarose beads (50% slurry) in a 15 mL tube and add 10 mL of buffer A without PMSF and anti-proteases. Mix briefly and spin at 2,500 g for 3 min at 4 °C, repeat this wash step two more times and keep the beads on ice.\nFollowing bacterial lysate centrifugation, collect the supernatant and transfer it into a 50 mL conical tube. Take an aliquot of 100 μL as a total lysate and add 100 μL of 2x Laemmli sample buffer for SDS-PAGE and Coomassie blue analysis.",
    "Filter the lysate through 0.45 μm pore syringe filter and mix it with the GSH beads. Incubate at 4 °C with shaking for 5 h. Spin down the beads at 2,500 x g for 3 min, remove, and save the supernatant as the flow through. Wash the proteins-GSH bound beads 6 times (5 mL each) with buffer A containing anti-protease cocktail and PMSF.\nAfter the last wash, transfer the beads along with 10 mL of buffer into an empty chromatography column, add 1.5 mL buffer A containing 25 mM glutathione, and collect the elution by gravity into 1.5 mL microtubes. Repeat the elution procedure 4 times.\nNOTE: Glutathione stock solution is prepared at 200 mM concentration in 50 mM Tris-HCl, pH 7.5\nTake an aliquot of 10 µL from each one of the 4 elutions and add 10 µL of 2x Laemmli sample buffer. These samples will be used for SDS-PAGE and Coomassie blue analysis to determine the presence and the purity of the purified proteins.\nNOTE: Following the last elution, keep the beads in buffer at 4 °C for recycling and future use.\nChoose the eluted fractions showing reasonable amounts of purified proteins for further analysis. Make small aliquots of the preparation. Store the purified proteins in -80°C. Usually, protein concentration will range from 0.5 µg to 2 µg per µL and samples can be stored in this state.\nOPTIONAL: Concentrate the sample or change buffer using a 10K centrifugal filter unit\n2. Purification of the BAP1/DEUBAD (ASXL2) Deubiquitinase Complex\nUse pET30a+-His-BAP138 and pDEST-MBP-DEUBAD (ASXL2)35 bacterial expression constructs to transform BL21 (DE3) RIL bacteria for the production of His-BAP1 and MBP-DEUBAD respectively.",
    "Perform two separate overnight starter cultures by incubating His-BAP1 and MBP-DEUBAD (ASXL2) expressing bacteria in 20 mL of LB broth of ampicillin medium containing 50 µg/mL chloramphenicol and the corresponding antibiotic for each plasmid, 100 µg/mL of kanamycin or 100 µg/mL of ampicillin respectively. Place on shaker at 37°C.\nPerform steps 1.3­–1.6.\nResuspend the bacteria pellets in 25 mL of ice-cold lysis buffer B (50 mM Tris pH 7.3, 500 mM NaCl, 3 mM β-Mercaptoethanol, 0.2% Triton X-100, 1 mM PMSF and 1/100 anti-protease cocktail). Mix equal volumes of the His-BAP1 with the MBP-DEUBAD lysates and incubate on ice for 15 min. Sonicate and then centrifuge the lysate as indicated in protocol 1 (step 9).\nDuring the centrifugation, prepare 500 µL packed Ni-NTA agarose beads (50% slurry) by washing them three times with buffer B without PMSF and anti-protease cocktail.\nFollowing bacterial lysate centrifugation, collect the supernatant and transfer it into a 50 mL conical tube. Take an aliquot of 100 μL as a total lysate and add 100 μL of 2x Laemmli sample buffer for SDS-PAGE and Coomassie blue analysis.\nFilter the lysate through 0.45 μm pore syringe filter and mix it with the Ni-NTA beads. Incubate at 4°C with shaking for 5 h. Spin down the beads at 2,500 x g for 3 min, remove, and save the supernatant as the flow through.\nWash the beads 6 times (5 mL each) with buffer B containing 20 mM 1,3-Diaza-2,4-cyclopentadiene (Imidazole).\n\t\tNOTE: Make a stock solution of 2 M imidazole at pH 7.3.",
    "After the last wash, transfer the beads with 10 mL of buffer into an empty chromatography column, add 1 mL buffer B containing 200 mM Imidazole and collect the elution by gravity into 1.5 mL microtubes containing 10 µL DTT (500 mM) and 2 µL EDTA (500 mM, pH: 8). Repeat the elution procedure 4 times. Take 10 µL of each elution fraction and add 10 µL of 2x Laemmli sample buffer for SDS-PAGE and Coomassie blue analysis. Pool the desired eluted fractions.\nNOTE: Keep the beads in buffer at 4 °C for recycling and future use.\nDilute the eluted complex 3 times with buffer C (50 mM Tris pH 7.3, 300 mM NaCl, 1% Triton X-100, 5 mM DTT, 1 mM EDTA, 1 mM PMSF, and 1/100 protease inhibitor cocktail) prior to incubation with the amylose agarose beads.\nPrepare amylose agarose beads (500 µL packed) by washing them 2 times with the buffer C without adding PMSF and anti-protease cocktail. Add the beads to the diluted elution and incubate overnight at 4 °C.\nCentrifuge at 2,500 x g for 3 min and keep the flow through. Wash the proteins-bounds beads with 5 mL of buffer C (5–6x).\nKeep the purified His-BAP1/MBP-DEUBAD complex on the amylose agarose beads in buffer D (50 mM HEPES pH 8.0, 50 mM NaCl, 10% Glycerol, and 1 mM DTT) and store at -80 °C. Take 20 µL of the beads fraction (50% beads solution) and add 20 µL of 2x Laemmli sample buffer for SDS-PAGE and Coomassie blue analysis.\n3. Purification of the Nucleosomes from HEK293T Cells\nCulture HEK293T cells in complete Dulbecco's modified Eagle's medium (DMEM) supplemented with 5% newborn calf serum (NBS), 2 mM L-glutamine, and 1% penicillin/streptomycin.",
    "Plate around 12 x 106 HEK293T cells in 20 mL of complete media per 15 cm culture dish one day before the transfection (10 dishes were used). Before transfection, change the cell’s medium to 12 mL of serum-free medium and transfect the cells with 21 µg of pCDNA-Flag-H2A using 63 µl of polyethylenimine (PEI) at 1 mg/mL36. Change to complete medium 12 h later.\nThree days post-transfection, wash the cells with 15 mL ice-cold PBS (twice) and harvest them in 3 mL of ice-cold PBS using a cell scraper. Centrifuge at 2,100 x g for 8 min at 4 °C. Discard the PBS and proceed to the lysis step or freeze the cell pellet at -80 °C.\nResuspend the cell pellet in about 10 volumes of buffer E (50 mM Tris-HCl pH 7.3, 420 mM NaCl, 1% NP-40, 1 mM MgCl2, 1 mM PMSF, 1/100 protease inhibitor cocktail, and 20 mM of N-methylmaleimide (NEM)) and incubate on ice for 20 min. Adding N-methylmaleimide (NEM) is critical to inhibit DUBs that co-purify with nucleosomes.\nAfter centrifugation at 3,000 x g for 5 min, discard the supernatant and resuspend the chromatin pellet in 10 volumes of buffer E. Mix by inversion and centrifuge at 3,000 x g for 5 min.\nRepeat the wash step another time using buffer E and two times using buffer F \"MNase Buffer\" (20 mM Tris-HCl pH 7.5, 100 mM KCl, 2 mM MgCl2, 1 mM CaCl2, 0.3 M sucrose, 0.1% NP-40, 1 mM PMSF, and 1/100 protease inhibitor cocktail).\n\t\tCAUTION: Pellet will float during washes and centrifugation.\nResuspend the chromatin in 5 mL buffer F and treat the pellet with Micrococcal nuclease (MNase) (3 U/mL for 10 min at room temperature).\nNOTE: The reaction can be aided by mixing using a Dounce Homogenizer.",
    "After incubation, take a 40 μL aliquot of the mixture for analysis of nucleosomal DNA fragments. Mix this aliquot with 40 μL of Phenol/chloroform and 20 μL of 6x DNA loading buffer, vortex, spin at 18,000 x g for 2 min, and load the DNA on a 2% agarose gel.\nWhen the DNA is predominantly a 147 bp fragment corresponding to mononucleosomes, stop the reaction by adding 5 mM EDTA at final concentration.\nFollowing centrifugation at 21,000 x g for 20 min at 4°C, incubate the soluble chromatin fraction with anti-Flag resin overnight at 4 °C. Wash the beads with 6x Buffer G (50 mM Tris-HCl, pH 7.3, 5 mM EDTA, 150 mM NaCl, 1% NP-40, 1 mM PMSF, 1 mM DTT, 1/100 protease inhibitors cocktail).\nTransfer the beads with 5 mL buffer G into an empty chromatography column. Elute the beads-bound nucleosomes with 200 μg/mL of Flag elution peptide. Use an elution buffer composed of buffer G containing 200 μg/mL Flag elution peptides (see Table of Materials) and 1/5 (vol:vol) 1 M Tris, pH 8.0. Elute the nucleosomes 3x with 260 μL Flag elution Buffer (2 h each elution).\nTest the 3 elutions by taking an aliquot for phenol-chloroform extraction and load the DNA in a 2% agarose gel. Take 10 µL of each elution fraction and add 10 µL of Laemmli sample buffer 2x for SDS-PAGE and Coomassie blue analysis and load each elution for Western Blot detection of ubiquitinated H2A. Store the elution at -80 °C. In general, purification from human cells yields less amount of proteins than that from bacteria, with concentrations ranging from 0.1 to 0.5 μg/μL.\n4. Nucleosome Ubiquitination Assay Using BMI1/RING1B E3 Ubiquitin Ligase Complex",
    "Centrifuge the nucleosomes through 10K pore 0.5 mL centrifugal filters to change the substrate from the elution buffer to the reaction buffer H (25 mM Tris, pH 7.5; 10 mM MgCl2, and 5 mM ATP). Alternatively, commercially available nucleosomes can be used for the assay.\nNOTE: Changing substrate suspension solution to reaction buffer ensures reproducibility and prevents potential E3 ligase inhibition by compounds present in the Flag elution mixture.\nIncubate 1 μg of the nucleosomes in 40 μL total volume of buffer H. Add Ub Activating Enzyme (UBE1) (250 ng), Ub (50 ng/μL) and E2 Ub-conjugating enzymes (672 ng), and 1 μg of BMI1/RING1B E3 ubiquitin ligase complex. Incubate the reaction for 3 h at 37 °C with occasional shaking.\nNOTE: Several controls can be conducted in parallel including omitting, E1, E2, E3, ATP and ubiquitin. This ensures the specificity for the ubiquitination reaction.\nStop the reaction by adding 40 μL of 2x Laemmli sample buffer and analyze histone H2A K119 ubiquitination by SDS-PAGE and western blotting, according to standard procedures. Use either anti-H2A or anti-H2A K119ub antibodies (see Table of Materials).\n5. In Vitro Nucleosomal H2A DUB Assay Using BAP1/DEUBAD\nUse the purified nucleosomes for the in vitro deubiquitination assay. Resuspend 100–500 ng of nucleosomes in 40 μL buffer I (50 mM Tris-HCl, pH 7.3, 1 mM MgCl2, 50 mM NaCl, and 1 mM DTT). Add 1 μg of BAP1 bacteria-purified His-BAP1 and MBP-DEUBAD. Carry out the deubiquitination reaction for 3 h at 37 °C with occasional shaking.\nStop the in vitro reaction by adding 40 μL of 2x Laemmli buffer and analyze by immunoblotting.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}