{
  "id": 18837,
  "origin_website": "Jove",
  "title": "Urinary Bladder Distention Evoked Visceromotor Responses as a Model for Bladder Pain in Mice",
  "procedures": [
    "The following protocol has been approved by the Institutional Animal Care and Use Committee at Duquesne University and is consistent with guidelines from the National Institutes of Health.\n1. Surgical Implantation of Wire Electrodes and Urinary Bladder Catheter Using Sterile Techniques (total time 5-10 min)\nThe following items should be prepared prior to starting surgery:\n\t\nActively monitor and adjust body temperature to 37.5±0.5 °C using temperature monitoring system with a battery-operated heating pad and animal body temperature probe (Materials List) Connect automatic system to a low-wattage heat lamp for additional control of body temperature.\nEquipment needed for isoflurane anesthesia includes compressed air (e.g. 100% O2), isoflurane vaporizer, isoflurane, isoflurane induction chamber (for initial knockdown), nose cone, and exhaust system.\nAssemble the proper surgical instruments, IV catheter, and electrodes (Materials List)\nInduce anesthetic state in induction chamber at 2-3% isoflurane. Remove mouse from chamber when righting reflex is lost (0-1 min).\nPlace mouse in nose cone with 2-2.5% isoflurane. Pinch toe to check for full anesthesia. There should be no response from the animal. Start timer.\nPlace 1 drop of ophthalmic ointment on each eye of mouse.\nTurn mouse over so dorsal side is facing down.\nInsert catheter through urethra and into bladder.\nDip catheter in surgical lube to lubricate catheter.\n\t\nGently hold urethral opening with pointed forceps perpendicular to animal’s body. Holding catheter with the 2nd set of forceps, gently insert catheter end into urethra at an angle perpendicular to animal’s body.\nWhen catheter has gone into urethra ~1-2 mm, gently adjust catheter so that it is now parallel to the body aiming toward the head. This movement is necessary to avoid the pubic bone.",
    "Gently push catheter toward the mouse’s body. The catheter should slide into the body cavity smoothly and without resistance. Do not force catheter. If catheter does not enter smoothly, return to the perpendicular catheter position and start again.\nWith catheter fully inserted in the bladder, gently push down on the mouse’s abdomen to expel bladder contents. Remove all urine from catheter by pushing a small piece of paper towel into catheter opening. When paper towel is soaked with urine, replace. Remove urine continuously throughout the remaining protocol including during bladder distention experiments (see Protocol 3 below.)\nInsert two silver wires into left abdominal muscles and one silver wire into chest (as a ground.)\n\t\nUse alcohol or iodine to disinfect area lateral to the right of catheter (animal’s left side of body.)\nExpose left abdominal muscle.\n\t\t\nHold skin near left abdominal muscle with forceps. Make a small 1-2 cm incision with medium surgical scissors.\nInsert tip of scissors into incision and gently expand incision to 2 cm.\nUse forceps to move overlying fascia to expose superior oblique abdominal muscle. Be careful not to cut/rip any of the major blood vessels that are located in this region.\nBend three silver wires in half. Use sharp 21 G needle to take a small bite of the muscle. Then, push needle through muscle. When inserting in muscle be careful not to puncture any internal organs or induce unnecessary damage to the muscle.\nStick a free end of one silver wire into the opening of the 21 G needle. Gently pull needle back through the muscle to draw the silver wire through the muscle bite. When needle is free from muscle, gently pull silver wire through muscle until the loop in the wire is flush with the muscle bite.",
    "Repeat steps 1.7.3-1.7.4 for second muscle wire. This wire should be placed ~0.5 cm from the first muscle wire. It is important that the two wires do not touch after insertion.\nInsert the third silver wire (ground) in the chest inferior to the heart.\n\t\t\nUse sharp 21 G needle to take a small bite of skin (it is not necessary to make an incision or shave the skin) and push needle through the skin.\nInsert silver wire as described above and pull through skin.\nPlace a small amount of 37.5 °C sterile mineral oil over the exposed muscles to keep them moist and pull skin over as much exposed muscle as possible.\nInject 0.5 ml saline subcutaneously to help maintain fluid levels during subsequent steps.\nGently roll animal onto side so that body temperature can be easily maintained.\n2. Partial Anesthesia Step-down Procedure (total time ~75 min)\nThe following anesthesia protocol has been approved by the Institutional Animal Care and Use Committee at Duquesne University and is consistent with guidelines from the National Institutes of Health.\nImmediately after Section I (above) is complete, lower isoflurane to 1.5%. Hold at this level for 15 min.\nLower isoflurane such that the animal is partially anesthetized.\n\t\nLower isoflurane by 0.125% every 15 min until animal exhibits a flexion response to toe pinch but does not vocalize or otherwise move.\nTypically, a level of 0.8-1.0% isoflurane is optimal, however levels can vary due to differences in anesthesia setups. Vocalization and/or ambulation are extremely rare events when anesthesia is at the proper level.\n3. Electromyogram (EMG) Recording During Bladder Distension with Graded Pressures (15-75 mmHg) (total time – variable depending on experiment)\nSetup the following items for EMG recording and bladder distention:",
    "Setup an amplifier, a digitizer, and recording software. In this setup, the digitizer has one input for the amplifier and two inputs for the pressure regulator (pressure and stimulus marker inputs, see below section 3.1.2). Exact hardware and software setup is customizable (see Materials List for specific instructions).\nSetup a system to deliver specific bursts of air pressure to animal. This system is referred to as the “timed pressure regulator” in the following protocol. It allows for automated pressure delivery including digitization of air pressure, control of trial length, inter-trial interval automation, control of trial number, and stimulus onset digital signal (see Anderson et al.14 for schematic of a timed pressure regulator).\nConnect all lead wires from mouse (2 abdominal wires + 1 ground wire) to the amplifier and the digitizer and begin recording EMG signal in digitizer software. Note what time “Write” is selected in digitizer software.\nRemove paper towel from bladder catheter. Connect catheter to air tubing (from timed pressure regulator.)\nDeliver a single 20 sec trial at 60 mmHg distention pressure.\n\t\nSet the flow regulator to 60 mmHg (check pressure using an analog sphygmomanometer.)\nSet the timed pressure regulator to deliver a 20 sec prepressure interval (this will be the 2V stimulus signal recorded in digitizer software) followed by a 20 sec pressure distention pulse.\nStart the trial (prepressure interval + pressure distention trial). When the actual pressure trial begins, double check the pressure using the 3 sphygmomanometers connected to the system.\nDuring the pressure distention trial, a strong EMG signal (>0.5 V) should be observed during and possibly after the 20 sec distention. The animal may exhibit abdominal movement but the animal should not vocalize or otherwise move. Although rare, if abnormal movements or vocalizations are observed, increase the isoflurane level.",
    "If the 1st 60 mmHg distention produces an appropriate EMG signal, repeat step 3.4 two more times with an intertrial interval of 1-2 min.\nUpon receiving strong signals from the three 60 mmHg trials, perform experimental distentions.\n\t\nMany studies use graded distensions starting at low pressure (10-15 mmHg) and working up to noxious pressures (75-80 mmHg) in 10-15 mmHg increments. See representative results below for example traces at different pressures.\nTypical trials include a 20 sec prepressure interval, a 20 sec pressure distention trial, and a 1-2 min intertrial interval.\nPerform three distentions at each pressure and then average across the three trials (to obtain a single visceromotor response for each pressure). In an alternative method, perform five distensions at each pressure, discard the high and low trials, and then average the remaining three responses.\nOnce experimental distensions are complete, stop recording, save the experiment file, and sacrifice animal using approved methods.\n4. Analysis of Raw EMG Traces\nAnalysis of visceromotor responses (i.e. EMG recordings) are easily done using on-board digitizer software or through a third-party program (Materials List) The following instructions are general instructions that could be used to analyze this data using multiple programs or using manual analysis.\nTo export EMG, pressure, and stimulus signal data from digitizer software do the following:\n\t\nOpen experimental file.\nClick “File” “Export as.”\nChange the file type to “spreadsheet text (.txt),” name the file and click “Save.”\nIn the pop-up window, change the output sample rate to “1000,” change the start time to the moment data collection began and change the end time to “MaxTime().” Select the box marking “time shift output so first line is a 0.0 sec,” and click “OK.”",
    "The data will now be exported as a text file that can be opened in a variety of programs. The file should contain four columns (Timer, VMR (EMG), Pressure, Stimulus).\nFor each experimental animal tested, perform the following mathematical operations.\n\t\nRectify EMG signal for the entire data set by calculating the absolute value of each time point.\nDetermine the average EMG response during the background section of the experiment.\nSubtract this average background EMG response from every rectified data point in the experiment to obtain the background corrected data set.\nDetermine the area under the curve (AUC) for each 20 sec prepressure interval in the background corrected data set.\nDetermine the AUC for each 20 sec pressure distension trial in the background corrected data set.\nDivide each pressure distension trial AUC (obtained in step 4.3.5) by the lowest prepressure interval AUC from the whole experiment (obtained in step 4.3.4.). This is the normalized and background corrected AUC for each complete pressure distention trial.\nFor each experimental animal, average multiple normalized trials from a single pressure to obtain the normalized VMR in Volts*sec (Vsec).\nPerform the appropriate statistics on the data depending on the experimental design.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}