{
  "id": 6750,
  "origin_website": "Bio",
  "title": "Photoactivable Cholesterol as a Tool to Study Interaction of Influenza Virus Hemagglutinin with Cholesterol",
  "procedures": [
    "Part I: Photocholesterol labeling of HA in living cells HA expression in CHO cells by transfectionSeed 0.9 x 106-1.1 x 106 CHO cells into one well of a 6-well plate one day before transfection such that they reach 70-90% confluency the next day.Dilute 3 µg plasmid (pCAGGS) encoding HA in 300 µl serum-free Opti-MEM and mix by pipetting.Briefly vortex TurboFect reagent and add 6 µl to the diluted DNA. Mix immediately by vortexing.Incubate 15-20 min at room temperature.During the incubation time, remove the old cell medium and replace by 1 ml serum-free DMEM.Add the DNA/TurboFect reagent mixture dropwise to the cell medium.Gently rock the plate to achieve an even distribution of the DNA/TurboFect complexes.Incubate at 37 °C in a CO2 incubator.Photocholesterol labeling of HA inside cells and crosslinking    At 6 h post transfection, replace the cell medium with 1 ml fresh serum-free DMEM to remove the transfection reagent.Add 5 μl photocholesterol (from a 5 mg/ml stock in ethanol, which is stored at -20 °C, ﬁnal concentration: 50 μM) to each well and gently rock the plate to achieve an even distribution.Incubate at 37 °C in a CO2 incubator until the next step.At 24 h post transfection, replace the cell medium with 1 ml fresh serum-free DMEM to remove dead cells floating in the culture supernatant.Put the plate in the cold room (~8 °C, Figure 3B) or on ice as long as the “UV lamp/6-well plate/ice box” can be protected from light. Cold temperature slows down the mobility of lipids within the membrane and prevents conformational changes of proteins, and is thus better suited for subsequent crosslinking.Take off the lid from the plate and from the UV lamp since plastic will absorb UV-light (Figure 3C).",
    "Put the UV lamp directly on top of the 6-well plate, turn on the UV lamp (wavelength 320-365 nm, power 8 W, 3.5 A, 60 V) to expose cells to UV light for 10-20 min in the dark to activate the diazirine group to trigger crosslinking (Figure 3D). The cells are still attached to the 6-well culture plate and are covered by 1 ml serum-free DMEM at this stage. Wear protective googles during illumination.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200218/20200218172838_5247.jpgFigure 3. Crosslinking with photocholesterol. A. UV lamp (wavelength 320-365 nm, power 8 W, 3.5 A, 60 V). B. Cold room (Tm: ~8 °C). C. Preparation before UV illumination by taking off the lid from the tissue culture plate and from the UV lamp. D. UV illumination of the culture plates in the dark.Immunoprecipitation of HA (buffers should be cold and procedures are performed at 4 °C)After exposure to UV light cells are still attached to the 6-well culture plate and are covered in DMEM. Put the 6-well plate on ice and detach the cells by scraping without changing medium.Transfer cells to 1.5 ml microcentrifuge tubes and centrifuge at 1,200 x g for 5 min at 4 °C.Wash the cell pellet once with 1 ml PBS and resuspend the cells in 500 μl cell lysis buffer.Lyse the cells for 30 min at 4 °C and centrifuge at maximal speed (13,500 rpm/17,000 x g ) for 15 min at 4 °C to remove insoluble material.Transfer the supernatant to a new 1.5 ml microcentrifuge tube without disturbing the pellet.Remove 50 μl from the lysate for analysis of protein expression by Western blot. Add 12 µl 5x non-reducing loading buffer to this 50 μl lysate, incubate at 95 °C for 5 min and store at -20 °C.",
    "Add anti-HA2 antiserum (1:1,000) to the remaining 450 μl lysate and incubate at 4 °C with agitation overnight (12-16 h) in the cold room.Prepare working solution of protein-G-sepharose beads according to the manufacturer’s instruction.a.The stock of protein-G-sepharose is stored in ethanol. Thus, centrifuge the stock solution at 12,000 x g for 30 s to remove the ethanol.b.Wash the protein-G-sepharose beads once with PBS by adding the same volume of PBS to the beads and centrifuge at 12,000 x g for 30 s.c.Resuspend the protein-G-sepharose beads in PBS by adding the same volume of PBS (1:1 dilution).Add 50 μl of the protein-G-sepharose beads to each sample and incubate at 4 °C for another 4 h in the cold room with agitation.Centrifuge at 12,000 x g for 30 s to pellet the HA/antibody/protein-G-sepharose complex.Remove the supernatant and wash the complex twice with 1 ml IP-buffer and then twice with 1 ml PBS to exclude the possibility that chemicals from the IP-buffer affect the click chemistry reaction in the next step (described in Part I Section D). For the same reason, remove the liquid as completely as possible after the last washing with PBS.Proceed to the click chemistry reaction (described in Part I Section D) as soon as possible. Storing the HA/antibody/protein-G-sepharose complex on ice for 1 h is fine, but storing for longer time (e.g., overnight at -20 °C) is not recommended.(Cu(I))-catalyzed Azide-Alkyne Click chemistry reactions (CuAAC) according to the manufacturer’s instructionPrepare stock solutions in ddH2O: 250 mM THPTA, 100 mM CuSO4, 1 M Na-Ascorbate. The efficiency of the reaction is higher when all the reagents are freshly prepared.Prepare stock solution of Picolyl-Azide-Sulfo-Cy3 (2 mM, dissolved in H2O, red color).Prepare CuSO4:THPTA-premix freshly (molar ratio of 1:5) for each experiment.",
    "6 µl (2 µl CuSO4 + 4 µl THPTA) mixture is used here for each reaction. (The ratio of CuSO4:THPTA is recommended as 1:5 in the manufacturer’s instruction, but could be changed.)Resuspend HA/antibody/protein-G-sepharose complex in 164 µl of H2O.Add 10 µl of 2 mM Picolyl-Azide-Sulfo-Cy3 to the mixture and mix by pipetting.Note: The amount of Azide-Cy3 added here is adjusted based on the amount used in labeling of immunoprecipitated HA. The same final concentration of photocholesterol (50 µM) is used for HA labeling. The molar ratio of alkyne:azide in click chemistry reaction is 1:4, which could be adjusted to get a better result. A higher ratio would give a stronger fluorescence signal. A ratio of 1:10 is recommended in the manufacturer’s instruction. Add 6 µl CuSO4:THPTA-premix to the mixture and mix by pipetting.Add 20 µl Na-Ascorbate to the mixture, such that the final volume of each reaction is 200 µl. Mix by pipetting.Incubate samples at room temperature for 1 h with gentle mixing (avoid vortexing) every 10-15 min. Protect samples from light by wrapping the tubes in aluminum foil.Wash samples with 1 ml PBS (at least 4 times) until no red color from Azide-Cy3 is seen in the supernatant. However, extensive washing of the beads is not recommended since the amount of beads becomes slightly reduced after each washing step.Resuspend samples in 40 µl 1x reducing loading buffer (diluted from 4x reducing loading buffer in ddH2O) and incubate at 95 °C for 5 min.Run SDS-PAGE.Wash the gel with ddH2O for at least 1 h with periodic changes (e.g., 10 min each). Sometimes overnight (> 12 h) washing is required to reduce the background signal from uncoupled Picolyl-Azide-Sulfo-Cy3.Scan the gel with a biomolecular imager (Typhoon FLA 9400 scanner, Excitation = 550 nm, Emission = 560 nm for Cy3).",
    "Note: The order of Steps D4-D7 should not be changed. Part II: Photocholesterol labeling of immunoprecipitated HA Transfect CHO cells to express HA as described in Section A of Part I. 24 h after transfection, immunoprecipitate HA with anti-HA2 antiserum as described in Section C of Part I, and then proceed to crosslinking.Crosslinking between immunoprecipitated HA and photocholesterol:Resuspend the washed HA/antibody/protein-A-sepharose complex in 100 µl PBS.Add 0.5 µl photocholesterol (from a 5 mg/ml stock dissolved in ethanol, ﬁnal concentration: 50 µM), and mix by pipetting. Transfer the solution into one well of a 24-well plate such that a thin liquid layer covering the bottom of the well is formed.Expose samples to UV light (see Figure 3).Transfer the labeled protein to a microcentrifuge tube and wash the mixture twice with 1 ml IP buffer and then twice with 1 ml PBS.Proceed to click chemistry reaction as described in Section D of Part I.Part III: Western blot to determine the expression level of HA Prepare gel for SDS-PAGE. The concentration of acrylamide in the stacking gel is 4%, while that in the separation gel is 12%.Run SDS-PAGE at constant voltage. Use low voltage (80-100 V) while proteins are in the stacking gel and high voltage (160 V) for the separation gel.Transfer the proteins from the SDS-gel onto a polyvinylidene difluoride (PVDF) membrane at 200-220 mA for 1 h using a semi-dry transfer system.Note: The time could be adjusted based on the molecular weight of the protein under study. Larger proteins require longer transfer time. Incubate the membrane with blocking solution for 30 min at room temperature.Incubate the membrane with primary antibody (anti-HA2 antiserum, diluted 1:1,000 in blocking solution) for 2 h at room temperature or overnight (12-16 h) at 4 °C.",
    "Wash the membrane 4 times (5 min each) with PBST (see Recipes) on an orbital shaker.Incubate the membrane with secondary antibody coupled to horseradish peroxidase (1:5,000 dilution in blocking solution) for 1 h at room temperature.Repeat Step 6 in Part III.Apply the ECL plus reagent to the membrane according to manufacturer’s instruction, which reacts with horseradish peroxidase to give the chemiluminescent signals.Detect the protein with a Fusion SL camera system."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}