{
  "id": 2177,
  "origin_website": "Cell",
  "title": "Real-time visualization of exo- and endocytosis membrane dynamics with confocal and super-resolution microscopy",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPrimary culture of bovine adrenal chromaffin cells – day 1\nTiming: 3–4 h\nThe procedure described below is intended for two or three glands. Sterilize and inject Locke’s solution and collagenase solution into the adrenal glands with a 0.22-μm syringe filter attached to a 30-mL syringe. Exercise care when performing the injections as the glands may rupture with excessive pressure. All the procedures below are performed in a cell culture hood.\nTissue Dissection.\nUnfold autoclaved surgical pack Ι (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1655-Fig1.jpg\nFigure 1. Prepare primary culture of bovine chromaffin cells\n(A) Composition of sterile surgical packs (Pack Ι: upper part; Pack ΙΙ: lower part).\n(B) Bovine adrenal glands from local abattoir.\n(C) Bovine adrenal glands after surrounding fat and connective tissue are removed.\n(D) Cleaning the adrenal glands with Locke’s solution.\n(E) Bovine adrenal glands in a beaker, ready for digestion.\n(F) Opening bovine adrenal glands and collecting the medulla.\n(G) Bovine adrenal glands after collecting the medulla.\n(H) Collected medulla in Locke’s solution.\n(I) Minced medulla in Locke’s solution.\n(J) Dissociating minced medulla by titrating the material with a 50-mL stripette.\n(K) Pass the tissue through an 80–100 μm nylon mesh to remove bulk debris.\n(L) Pass the cells through an 80–100 μm cell strainer to further remove debris.\nChoose only intact glands and discard those with visible signs of internal blood coagulation. Smaller glands normally yield cells with better release activity (Figure 1[href=https://www.wicell.org#fig1]B).\nRemove the surrounding fat and connective tissue from the glands. Try to remove as much fat as possible. Also remove the fat and connective tissue surrounding the adrenal vein (Figure 1[href=https://www.wicell.org#fig1]C).",
    "Place the glands in a sterile petri dish for adrenal glands cleaning. To remove blood, inject each gland from the adrenal vein 10–20 times with 1.5–3 mL Locke’s solution at 20°C–22°C (Figure 1[href=https://www.wicell.org#fig1]D).\nNote: When injecting Locke’s solution into the glands, you should feel it swell slightly.\nNote: It is essential to remove all blood when washing the glands.\nWash the glands with 2–3 mL collagenase solution to get rid of the Locke’s solution remaining in the glands. Hold the syringe and maintain constant pressure for a few seconds to keep the collagenase solution in the end of the adrenal vein.\nInject the glands with 2–3 mL collagenase solution and maintain constant syringe pressure for a few seconds to ensure the collagenase solution reaches the end of the adrenal vein. Place the glands in a glass beaker. Cover the beaker with foil and incubate for 10 min in the 37°C water bath (Figure 1[href=https://www.wicell.org#fig1]E).\nAfter 10 min, inject another 1–2 mL collagenase solution into the adrenal vein. It is not necessary to maintain constant syringe pressure for the second injection, as the gland is partially digested, and the collagenase solution will get into the vein easily. Cover the beaker with foil and incubate for another 10 min in the water bath.\nNote: Use less collagenase solution for the second injection to avoid over-digestion and rupture of the glands.\nAfter 10 min, take the glass beaker out of the water bath. The glands should be noticeably softer, indicating success of the digestion.",
    "Unfold autoclaved surgical pack ΙΙ (Figure 1[href=https://www.wicell.org#fig1]A) and open the gland longitudinally (along its length) using a sterile scissor. It should appear with the cream-colored section representing the medulla (Figure 1[href=https://www.wicell.org#fig1]F). Use curved fine forceps to collect the medulla material and transfer it to a clean petri dish containing 50 mL Locke’s solution (Figures 1[href=https://www.wicell.org#fig1]F–1H). Do not collect any red or purple material that contains cortical cells.\nUsing a sterilized small scissor, cut the medulla tissue into small pieces (Figure 1[href=https://www.wicell.org#fig1]I).\nTriturate the material 5–10 times with a 50-mL stripette (Figure 1[href=https://www.wicell.org#fig1]J). Pass the dissociated material into a beaker through an 80–100 μm sterilized nylon mesh to remove the bulk debris (Figure 1[href=https://www.wicell.org#fig1]K). Collect the cells in a 50-mL conical tube.\nCentrifuge at 48 × g for 3 min; discard the supernatant. Resuspend the pellet in 20 mL Locke’s solution and triturate it with a stripette 5–10 times.\nPass the cell suspension through an 80–100 μm cell strainer and add fresh Locke’s solution to produce a final volume of 40–50 mL (Figure 1[href=https://www.wicell.org#fig1]L).\nCentrifuge at 48 × g for another 3 min; discard the supernatant. Resuspend the pellet by 20 mL culture medium and triturate it with a stripette 5–10 times.\nCount the cell number in a Neubauer hemocytometer.\nNote: Use low acceleration and deceleration speed when centrifuging to avoid cell damage.\nNote: Avoid air bubbles when triturating or transferring cells to avoid cell damage.\nNote: A typical yield is around 3–9 × 107 chromaffin cells from three adrenal glands.\nNote: Normally, two repetitions with 10 min each are optimal for digestion. However, the total digestion time may need to be adjusted according to the activity of the collagenase P, which may vary from one batch to another. A total of 18–25 min digestion time is recommended.",
    "Note: In general, optimal exocytosis and endocytosis are usually observed up to 3 days after plating.\nBovine chromaffin cells electroporation – day 1\nTiming: 1.5–2 h\nCells are transfected by electroporation using the Basic Primary Neurons Nucleofector Kit and NucleofectorTM 2b device (both Lonza), according to the manufacturer’s protocol (https://bioscience.lonza.com/protocol[href=https://bioscience.lonza.com/protocol]). Here we describe the transfection of mNeonGreen (mNG)-tagged phospholipase C δ1 PH domain (PH-mNG) (Zhao et al., 2016[href=https://www.wicell.org#bib37]). PH-mNG binds specifically to phosphatidylinositol-4,5-bisphosphate (PtdIns(4,5)P2, PI(4,5)P2), a phospholipid that labels the plasma membrane. Other plasmids or siRNAs can be transfected using the same method.\nCentrifuge 2.5–3 × 106 cells at 48 × g for 2 min at 20°C–22°C in a 15-mL conical tube.\nDiscard the supernatant and resuspend the cell pellet carefully in 100 μL Nucleofector® solution per sample.\nCombine 100 μL cell suspension with 1–5 μg PH-mNG plasmid, appropriate amount of siRNA or other substrates.\nTransfer cell/plasmid suspension into a certified cuvette (sample must cover the bottom of the cuvette without air bubbles).\nSelect program O-005 from the program list of the electroporation device.\nNote: Different programs were tested for bovine chromaffin cell electroporation. With program O-005, about 20%–30% transfection efficiency of PH-mNG could be obtained with high viability of cells, whereas other programs tested for bovine chromaffin cells are either with lower efficiency or higher toxicity.\nInsert the cuvette with the cell/plasmid suspension into the Nucleofector® cuvette holder and start the selected program.\nTake the cuvette out of the holder once the program is complete.\nImmediately add 1,500–1,600 μL pre-warmed culture medium to the cuvette and gently aspirate 2–3 times. Transfer 200–300 μL cell suspension onto the 25-mm diameter poly-D-lysine- and laminin-coated coverslips prepared in the culture dish. Use the supplied pipettes and avoid air bubbles in the cell suspension.",
    "Incubate cells in a humidified 37°C/9% CO2 incubator for 1–1.5 h.\nAdd 2 mL pre-warmed culture medium to each dish and incubate cells in a humidified 37°C/9% CO2 incubator.\nNote: Use the slowest speed of the electronic pipette controller when adding culture medium and avoid adding medium directly on cells.\nWhole-cell voltage-clamp and capacitance recordings – days 2–4\nTiming: 1–5 h\nNote: Prepare patch-clamp recording pipettes that have electrode resistances ranging from 2–4 MΩ after filling the pipette with recording electrode internal solution.\nIn this section, we describe whole-cell voltage-clamp and capacitance recordings, which are performed at room temperature (20°C–22°C) with an EPC-10 amplifier together with the software lock-in amplifier (PULSE, HEKA) (Chiang et al., 2014[href=https://www.wicell.org#bib7]). A duration of 1 s depolarization is used for stimulation in chromaffin cells. Although this section does not cover imaging, patch-clamp recordings are performed simultaneously with either confocal or STED imaging described in the following two sections. Hence, start the steps described in this section only after the imaging configurations are ready and a good cell has been chosen for either confocal or STED imaging.\nNote: The experiments could also be performed at physiological temperature (37°C) using a temperature-controlled recording chamber.\nFilter recording electrode internal solution using a 1-mL syringe attached with a 0.20-μm Millex-FG syringe filter unit; keep the internal solution on ice during the experiment.\nPlace the coverslip with cells in the chamber (Figures 2[href=https://www.wicell.org#fig2]A–2E, Methods video S1[href=https://www.wicell.org#mmc1]). Add bath solution with 30–50 μM Atto 655 (A655) or Atto 532 (A532) dye (Figures 2[href=https://www.wicell.org#fig2]F and 2G, Methods video S1[href=https://www.wicell.org#mmc1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1655-Fig2.jpg\nFigure 2. Mount the magnetic chamber with chromaffin cells on the confocal microscope\n(A) The magnetic chamber has two components, the upper one (A, left) and the lower one (A, right).",
    "(B and C) Take out of one coverslip with chromaffin cells (B) and put it in the lower component (C).\n(D and E) Add the upper component on top of the coverslip with magnets unmatched (D), then rotate it to stick all magnets of the two components (E).\n(F and G) Add bath solution with A655 with a pipette.\n(H) Mount the chamber on the confocal microscope. The confocal mounting stage is controlled by XYZ adjustment knobs while the electrode of patch-clamp recording is controlled by a micromanipulator via the headstage.\n(I) Enough space above the chamber allows movement of the electrode.\n(J) Put ground wire into bath solution and then use electrodes to perform patch-clamp recordings on chromaffin cells. See also Methods videos S1[href=https://www.wicell.org#mmc1] and S3[href=https://www.wicell.org#mmc1].\nChoose a healthy transfected chromaffin cell (Figure 3[href=https://www.wicell.org#fig3]A, Methods video S2[href=https://www.wicell.org#mmc1]), which has a smooth membrane and large cell foot (Figure 3[href=https://www.wicell.org#fig3]B) visible through the differential interference contrast microscope. Then, move the target cell foot area into the middle of the imaging area.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1655-Fig3.jpg\nFigure 3. Troubleshooting for healthy cell selection and cell bottom identification in confocal imaging\n(A) Healthy cells (left panel) are chosen, and cells too small, fibroblasts, and unhealthy cells (right panel) are avoided for patch-clamp recording and confocal imaging. Scale bars: 20 μm.\n(B) Confocal images of PH-mNG (green), A655 (red), and FFN511 (cyan) with XY scanning of the cell foot. Scale bar: 5 μm. See also Methods video S2[href=https://www.wicell.org#mmc1].\nFill a pipette with recording electrode internal solution. Tap the pipette a few times to eliminate any air bubbles in the tip of the pipette (Methods video S3[href=https://www.wicell.org#mmc1]).",
    "Place the glass pipette in the pipette holder (Methods video S3[href=https://www.wicell.org#mmc1]). Apply light positive pressure through a syringe and hold the pressure in the pipette by closing the valve (Methods video S4[href=https://www.wicell.org#mmc1]).\nPlace the pipette tip in the bath with a micromanipulator (Figures 2[href=https://www.wicell.org#fig2]H–2J, Methods video S4[href=https://www.wicell.org#mmc1]). Set the amplifier to voltage-clamp and correct the pipette offset.\nApproach the coverslip by moving the micromanipulator and monitoring the pipette height closely. Stop moving the glass pipette just before touching the cell layer on the coverslip and change the settings of the micromanipulator to smooth and slow motion (Methods video S4[href=https://www.wicell.org#mmc1]).\nApproach the cell body by moving the glass pipette carefully until the tip touches the cell, and a very small dimple is seen on the cell membrane (Methods video S4[href=https://www.wicell.org#mmc1]).\nRelease the positive pressure and apply negative pressure gently with the syringe to obtain a giga Ω seal. Then, adjust the holding potential to -80 mV and press C-fast/Auto to compensate fast capacitance (Methods video S4[href=https://www.wicell.org#mmc1]).\nTo break through the membrane, apply a short suction pulse using the syringe. Press C-slow/Auto to compensate slow capacitance (Methods video S4[href=https://www.wicell.org#mmc1]).\nFor capacitance measurements, the frequency of the sinusoidal stimulus is 1,000–1,500 Hz with a peak-to-peak voltage ≤ 50 mV.\nFor stimulation, we used a 1-s depolarization from the holding potential of -80 mV to +10 mV (depol1s). We used this stimulus because it induces robust exo-endocytosis as reflected in capacitance recordings (Shin et al., 2018[href=https://www.wicell.org#bib24], 2021[href=https://www.wicell.org#bib25]; Zhao et al., 2016[href=https://www.wicell.org#bib37]).\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Prepare recording chamber with chromaffin cells, related to step 25\n    Your browser does not support HTML5 video.\n  \nMethods video S2. Mount the chamber and choose a healthy chromaffin cell for recording, related to steps 26 and 40",
    "Your browser does not support HTML5 video.\n  \nMethods video S3. Fill a pipette with internal solution and place it in the pipette holder, related to steps 27 and 28\n    Your browser does not support HTML5 video.\n  \nMethods video S4. Patch-clamp recording with imaging data acquisition, related to steps 28–35 and 41\nConfocal imaging – days 2–4\nTiming: 1–5 h\nIn this section, we describe a typical process for acquiring confocal imaging using a Leica TCS SP5 microscope equipped with a 100 × 1.4 NA oil immersion objective and operated with LAS-X imaging software. The protocol described here is for imaging PH-mNG (excitable at 514 nm, labels plasma membrane), A655 (excitable at 633 nm, labels opened Ω-shaped profiles) and FFN511 (excitable at 458 nm, fluorescent false neurotransmitter for labeling intracellular vesicles). However, this protocol is also applicable to any other fluorescent molecules excitable at other wavelengths (e.g., mTFP-1, Alexa Fluor 488, FFN206). The imaging Z-axis location is fixed to focus on the cell foot, about 200–300 nm above the cell bottom adhering to the coverslip. PH-mNG expression shows the contour of plasma membrane at the XY-plane except the cell foot. At the cell foot, A655 spots can also be observed, reflecting Λ-shape or Ω-shape membrane invaginations (Figure 3[href=https://www.wicell.org#fig3]B).\nIncubate cells with 5–10 μM FFN511 for 20–30 min at 37°C to label intracellular vesicles.\nSet up microscope and imaging chamber (Methods videos S1[href=https://www.wicell.org#mmc1] and S5[href=https://www.wicell.org#mmc1]).\nTurn on Leica SP5 microscope.\nTurn on light source.\nSelect 100 × 1.4 NA oil objective on the microscope.\nPrepare 300–600 μL bath solution with 50 μM A655.\nGently remove the FFN511 solution and rinse the chromaffin cells two times with bath solution at 20°C–22°C.",
    "Use a pair of fine forceps to transfer the coverslip into the magnetic imaging chamber and add 300–600 μL bath solution with 50 μM A655 (Figures 2[href=https://www.wicell.org#fig2]A–2G).\nApply Leica immersion oil to the objective and mount the chamber on the confocal microscope (Figures 2[href=https://www.wicell.org#fig2]H–2J).\nConfigure Leica software (Methods video S5[href=https://www.wicell.org#mmc1]).\nOpen LAS X software (Figure 4[href=https://www.wicell.org#fig4]A). Activate the resonant scanner to allow for fast laser scanning, then click “OK” to start the software (Figure 4[href=https://www.wicell.org#fig4]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1655-Fig4.jpg\nFigure 4. Walkthrough of the LAS AF software for configuration to acquire timelapse confocal images\n(A) Double click the LAS AF icon to start the software.\n(B) Select “Activate Resonant Scanner” and click “OK” to open the software.\n(C) In “Configuration”, set basic configurations.\n(D) In “Experiment Configuration”, select different modules. Set “Objective” to 100× oil objective.\n(E) Select “Laser” in (D) to turn on Argon laser and HeNe laser. Set the power of Argon laser to 70% of maximum. Maximum power of Argon laser: 25 mW; Maximum power of HeNe laser: 20 mW.\n(F) In “Acquire”, set basic parameters for confocal scanning.\n(G) Choose “Experiments” to create, save, open and rename files, and “Acquisition” to set the scanning parameters. Select “xyt” time series as the acquisition mode; set “Format” to 512 × 512 pixels; set “Speed” to 8,000 Hz; set “Pinhole” to 1 A. U.; check “Bidirectional X”; set “Zoom factor” to 3.0–6.0.\n(H) Click “seq” to open “Sequential Scan” module. Select “between lines” in sequential scan module. Click “+” to add sequential scans.\n(I) In sequential “scan 1”, turn on Argon laser 458 nm and HeNe laser 633 nm to detect FFN511 and A655 signal respectively, detailed parameters shown in (J and K).\n(J) Set the power of 458 nm laser to 20%; and the power of 633 nm laser to 75%.",
    "(K) Set the collected fluorescence at 465–505 nm with HyD 1 detector; and the collected fluorescence at 650–800 nm with PMT 4 detector.\n(L) In sequential “scan 2”, set parameters for 514 nm to detect PH-mNG signal, detailed parameters shown in (M and N).\n(M) Set the power of 514 nm laser to 10%.\n(N) Set the collected fluorescence at 520–600 nm with HyD 3 detector.\n(O) Set 1 min scanning with minimal interval.\n(P) When starting to record the patch-clamp data, click “Start” to acquire timelapse confocal images simultaneously. See also Methods videos S4[href=https://www.wicell.org#mmc1] and S5[href=https://www.wicell.org#mmc1].\nIn “Configuration” (Figure 4[href=https://www.wicell.org#fig4]C), choose “Laser” configuration (Figure 4[href=https://www.wicell.org#fig4]D) to turn on lasers including Argon laser and HeNe 633 laser (Figure 4[href=https://www.wicell.org#fig4]E).\nIn “Acquire” (Figure 4[href=https://www.wicell.org#fig4]F), use “Experiments” to manage files, and “Acquisition” to set the scanning parameters in the following steps (Figure 4[href=https://www.wicell.org#fig4]G).\nSelect “xyt” time series as the acquisition mode.\nChoose “512 × 512” format.\nScan speed “8,000 Hz”. Make sure to turn on the resonant scanner in step 38a to reach to this scan speed.\nChoose pinhole 1 A.U.\nChoose “bidirectional” or “unidirectional” scan mode.\nZoom factor: 3–6. The zoom factor will be adjusted according to different cell sizes. The pixel size ranges from about 50 nm to 100 nm.\nDesign appropriate light path configuration to avoid crosstalk between FFN511 and mNG signals. For the fluorophore used in this protocol, low laser power of 514 nm (∼1–4 mW) and 458 nm (∼2–4 mW) is used to image mNG and FFN511 signal to avoid being bleached, while high laser power (∼12–15 mW) of 633 nm is used to bleach A655 dye in closed Ω-profiles or closed vesicles (Methods video S5[href=https://www.wicell.org#mmc1]).",
    "Click “seq” (Figure 4[href=https://www.wicell.org#fig4]H) to choose sequential scan (Figure 4[href=https://www.wicell.org#fig4]I) and select “between lines” mode. Click “+” and “-” to add and delete more sequential scans. In sequential “scan 1” (Figure 4[href=https://www.wicell.org#fig4]I), set excitation and emission laser parameters for FFN511 and A655 (Figures 4[href=https://www.wicell.org#fig4]J and 4K). In sequential “scan 2” (Figure 4[href=https://www.wicell.org#fig4]L), set excitation and emission laser parameters for PH-mNG (Figures 4[href=https://www.wicell.org#fig4]M and 4N).\nCritical: As the spectra of mNG and FFN511 are close to each other, sequential scanning should be chosen to avoid crosstalk between them.\nIn “scan 1”, set the power of 458 nm laser to 10%–20% (∼2–4 mW) (Figure 4[href=https://www.wicell.org#fig4]J), and the collected fluorescence at 465–505 nm with HyD 1 detector (Figure 4[href=https://www.wicell.org#fig4]K); Set the power of 633 nm laser to 60%–75% (∼12–15 mW) (Figure 4[href=https://www.wicell.org#fig4]J), and the collected fluorescence at 650–800 nm with PMT 4 detector (Figure 4[href=https://www.wicell.org#fig4]K).\nIn “scan 2”, set the power of 514 nm laser to 5%–20% (∼1–4 mW) (Figure 4[href=https://www.wicell.org#fig4]M), and the collected fluorescence at 520–600 nm with HyD 3 detector (Figure 4[href=https://www.wicell.org#fig4]N).\nSet 1 min scanning with minimal interval, the sampling rate is about 70 ms per frame (Figure 4[href=https://www.wicell.org#fig4]O).\nChoose a healthy transfected chromaffin cell (Figure 3[href=https://www.wicell.org#fig3]A, Methods video S2[href=https://www.wicell.org#mmc1]).\nPerform patch-clamp recording and start imaging (Figure 4[href=https://www.wicell.org#fig4]P) when the depol1s protocol starts (Methods video S4[href=https://www.wicell.org#mmc1]).\n    Your browser does not support HTML5 video.\n  \nMethods video S5. Configurations for confocal imaging, related to steps 37–39\nSTED imaging – days 2–4\nTiming: 1–5 h",
    "STED images are acquired with a Leica TCS SP8 STED 3× microscope that is equipped with a 100× 1.4 NA HC PL APO CS2 oil immersion objective, white light laser source (WLL) and 592 nm STED depletion laser. The protocol below follows the general guideline for Leica SP8 STED scanning, but details given here are specific to mNG/A532 combination or mNG/FFN511 combination. It is adaptable to other fluorophores with parameter adjustment. The resolution obtained for Leica SP8 STED 3× microscope is ∼60 nm for XY and ∼150–200 nm for Z (Shin et al., 2018[href=https://www.wicell.org#bib24]).\nCritical: Use only #1.5 thickness coverslips, which have an ideal thickness of 170 μm for STED imaging. Do not use #1 or other thickness coverslips. The best super-resolution STED images can only be captured with correct (#1.5) thickness glass coverslip, which matches the objectives optimal thickness (0.17 mm). The image intensity and resolution will be reduced significantly even with small deviations from the optimal coverslip thickness.\nTurn on and warm up the Leica SP8 STED 3× microscope.\nTurn on the “PC microscope”, “Scanner Power”, “Laser Power” and “Laser Emission” buttons sequentially to start the machine (Figure 5[href=https://www.wicell.org#fig5]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1655-Fig5.jpg\nFigure 5. The first step guidance for configuration of Leica SP8 STED 3× microscope\n(A) Turn on the “PC Microscope”, “Scanner Power”, “Laser Power” and “Laser Emission” buttons sequentially from left to right.\n(B) Open the LAS X software and turn on the “Resonant” and “STED” to open the resonant scanner and STED laser respectively. Click “OK” to start the LAS X software.",
    "(C) In “Configuration”, select “Laser Config” to adjust laser settings. Turn on white light laser (WLL) and set the power to 70% of the maximum. Also turn on the 442 Diode laser if FFN511 is used. Turn on the STED 592 nm depletion laser and set the power to 70% of the maximum. Also turn on other STED lasers such as 660 nm and 775 nm depletion laser if needed. Select “STED” for STED settings, detailed parameters shown in (D).\n(D) In “STED Settings”, use default values and click “Align Beams” to align STED beams.\n(E) Beam Alignment working in progress.\n(F) Beam Alignment successful. Click “Close” to finish the STED beam alignment.\nOpen the LAS X software and turn on the “Resonant” and “STED” to open the resonant scanner and STED laser respectively. Click “OK” to start the LAS X software (Figure 5[href=https://www.wicell.org#fig5]B).\nTurn on excitation lasers and STED depletion lasers. In “Configuration” of the software, select “Laser Config” to adjust laser settings. Turn on white light laser (WLL) and set the power to 70% of the maximum power (maximum power: 25 mW). Also turn on the 442 Diode laser if FFN511 is used. Turn on the STED 592 nm depletion laser and set the power to 70% of the maximum power (maximum power: 1.5 W). Also turn on other STED lasers such as 660 nm and 775 nm depletion laser if needed (Figure 5[href=https://www.wicell.org#fig5]C).",
    "After warming up the lasers, align STED beams by select “STED” for STED settings (Figure 5[href=https://www.wicell.org#fig5]C). Check the “Auto Beam Alignment” and “STED Mappings” parameters (Figure 5[href=https://www.wicell.org#fig5]D), use system optimized and default values and click “Align beams” (Figure 5[href=https://www.wicell.org#fig5]D). While the beam alignment is working (Figure 5[href=https://www.wicell.org#fig5]E), lasers through the objective should be seen, do not move any axis of the microscope. Once it is successful, click “Close” to finish the STED beam alignment (Figure 5[href=https://www.wicell.org#fig5]F).\nNote: Before beam alignment, let the lasers warm up for 10–20 min. In STED laser beam alignment step, no cell samples are need.\nPrepare coverslip and imaging chamber (Figure 2[href=https://www.wicell.org#fig2]).\nPrepare 300–600 μL 30 μM A532 bath solution.\nGently rinse the chromaffin cells two times with bath solution at 20°C–22°C.\nUse a pair of fine forceps to transfer the coverslip on the chamber and add 300–600 μL 30 μM A532.\nSet up scanning parameters. Typical settings:\nScan mode: xyt or xzt, sequential scan and between lines (Figure 6[href=https://www.wicell.org#fig6]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1655-Fig6.jpg\nFigure 6. The second step guidance for configuration of Leica SP8 STED 3× microscope\n(A) Click “Acquire” of the software, and in “Acquisition”, select “xyt” or “xzt” mode, and select “SEQ” for sequential scanning.\n(B) Set “Format” to 1248 × 1000 for xyt scanning or 1248 × 150 for xzt scanning; set “Speed” to 8,000 Hz; keep “Bidirectional X” off; set “Zoom factor” to 6; set “Line Average”, “Line Accu”, “Frame Average”, and “Frame Accu” to 1; set “Pinhole” to 0.5 A. U.\n(C) Set “Time interval” to “minimize”, and “Duration” to 90 s.\n(D) Excitation laser selection and power adjustment. For mNG/A532, set 486 nm at 5% and 540 nm at 30%; For mNG/FFN511, set 505 nm at 5% and 442 nm at 30%.",
    "(E) Detector selection and collection range adjustment. For mNG/A532, collect emission at 490–530 nm and 545–587 nm. For mNG/FFN511, collect emission at 510–587 nm and 447–490 nm, with sequential scanning.\n(F) STED depletion laser selection and power adjustment. Set 10% for mNG and 5% for A532 or FFN511.\n(G) Use the Fluorifier Disc Settings to set the notch filters to NF 445/594.\n(H) When start to record the patch-clamp data, click “Start” to acquire timelapse STED images simultaneously.\nLine scan speed: 8,000 Hz (Figure 6[href=https://www.wicell.org#fig6]B).\nScan direction: Bidirectional or Unidirectional (Figure 6[href=https://www.wicell.org#fig6]B).\nZoom: 5.0–6.0 (Figure 6[href=https://www.wicell.org#fig6]B). The zoom factor could be adjusted according to different cell sizes.\nImage resolution: 1248 × 1000 (xyt scanning) and 1248 × 150 (xzt scanning).\nImage size: 19.38 μm × 15.52 μm (xyt scanning) and 19.38 μm × 2.32 μm (xzt scanning).\nPixel size: 16–20 nm.\nLine Average (scan a line for multiple times before move to the next line, and average the pixel values), Frame Average (scan a frame for multiple times, and average the pixel values), Line Accumulation (scan a line for multiple times and sum the pixel values), and Frame Accumulation (scan a frame for multiple times and sum the pixel values) are all set to 1.\nNote: Both Line-based and frame-based scanning modes have same effect, but the execution ways are different. Multi-time scanning with any of the four modes extends the total scanning time. Average reduces noise and improves signal by averaging each point together, whereas accumulation increases signal intensity to improve signal-to-noise ratio by adding each point together. By setting the value to 1, we do not use these functions. But these functions can be used to improve signal-to-noise ratio.\nPinhole: 0.5 AU (75.8 μm) (Figure 6[href=https://www.wicell.org#fig6]B), which can be adjusted in a range of 0.4–0.6 AU.",
    "Time Interval: minimize (Figure 6[href=https://www.wicell.org#fig6]C).\nGating for HyD detector: 1.0–6.5 ns (Figure 6[href=https://www.wicell.org#fig6]E).\nNotch Filter: NF 445/594 (Figure 6[href=https://www.wicell.org#fig6]G).\nEstablish STED light paths. Typical settings for mNG/A532 combination:\nmNG is excited at 486 nm (∼1–5 mW) (Figure 6[href=https://www.wicell.org#fig6]D) and the gain of the high-sensitivity HyD detector (490–530 nm) is 100 (Figure 6[href=https://www.wicell.org#fig6]E).\nA532 is excited at 540 nm (∼5 mW) (Figure 6[href=https://www.wicell.org#fig6]D) and the gain of the high-sensitivity HyD detector (545–587 nm) is 100 (Figure 6[href=https://www.wicell.org#fig6]E).\n592 nm STED depletion beam is set to 10%–40% (∼105–420 mW) and 5% (∼52.5 mW) for mNG and A532 respectively (Figure 6[href=https://www.wicell.org#fig6]F). Typical settings for mNG/FFN511 combination:\nmNG is excited at 505 nm (∼1–5 mW) and the gain of the high-sensitivity HyD detector (510–587 nm) is 100.\nFFN511 is excited at 442 nm (∼3–5 mW) and the gain of the high-sensitivity HyD detector (447–490 nm) is 100.\n592 nm STED depletion beam is set to 10%–40% (∼105–420 mW) and 5% (∼52.5 mW) for mNG and FFN511, respectively.\nFind a healthy transfected chromaffin cell under bright field and epifluorescence (Figure 3[href=https://www.wicell.org#fig3]).\nCritical: Use a low level of white light and epifluorescence for cell searching because strong light exposure bleaches the fluorescence of interest and causes cell phototoxicity.\nPerform whole-cell voltage-clamp, capacitance recordings and STED imaging with the target cell:\nFind the cell and get a giga Ω seal.\nBreak the cell and hold it at -80 mV.\nBefore stimulation, find the cell foot area with xyt confocal scanning (Figure 3[href=https://www.wicell.org#fig3]B).\nNote: Minimize confocal lasers to 1% (∼0.175 mW) for either mNG/A532 or mNG/FFN511 to avoid bleaching.\nSwitch to xzt mode (Figures 6[href=https://www.wicell.org#fig6]A and 6B), focusing on the plasma membrane.\nNote: Minimize confocal lasers to 1% (∼0.175 mW) (Figure 6[href=https://www.wicell.org#fig6]D) for either mNG/A532 or mNG/FFN511 to avoid bleaching.",
    "Turn off the laser, then set back to the appropriate confocal (Figure 6[href=https://www.wicell.org#fig6]D) and depletion laser power (Figure 6[href=https://www.wicell.org#fig6]F), which has been depicted in step 45.\nStart the depol1s and STED imaging at the same time (Figure 6[href=https://www.wicell.org#fig6]H). In general, the total recording time is 90 s or longer (Figure 6[href=https://www.wicell.org#fig6]C).\nCritical: STED laser exposure to cells only after correct imaging configuration and successful patch-clamp operation.\nNote: Patch less than 5 cells per coverslip, then change to a fresh coverslip.\nSTED image deconvolution using Huygens Professional – days 2–4\nTiming: 0.5–3 h/image\nRun Leica LAS X software.\nOpen a project (experimental data with ∗.lif file).\nRight click the raw data and export it to Huygens Professional.\nRun Huygens Professional program.\nIn Huygens Professional (Figure 7[href=https://www.wicell.org#fig7]A), run “Edit Microscopic Parameter” in “Edit” menu and confirm the parameters, including XYZ pixel sizes, numerical aperture, and pinhole size, of the raw STED image (Figure 7[href=https://www.wicell.org#fig7]B). All parameters should be consistent with the properties of raw data.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1655-Fig7.jpg\nFigure 7. Parameters setting and guidance for deconvolution\n(A and B) After exporting .lif data file into Huygens Professional software, select “Edit” menu (A) to choose “Edit Microscopic Parameters” (B). Make sure the “General parameters” (B, left) such as sampling intervals and optical parameters are consistent with the raw data collected with STED microscope. In “Channel parameters” (B, right), select “STED” for microscope type, review and set all parameters verified.\n(C) Select “Deconvolution” menu (A) to choose “Deconvolution wizard” (C).\n(D) The raw data will present in the “Deconvolution wizard” window.\n(E) Enter the step-by-step deconvolution process, including PSF selection, cropping, inspecting the image histogram, background estimation, deconvolution setup, and then click “Deconvolve” to run the deconvolution.",
    "(F) Maximum iterations, signal to noise ratio, quality threshold, and integration mode could be automatic or adjusted by users. Reports will be shown after deconvolution finished, and the iteration numbers will be optimized by the software.\n(G) The deconvoluted image will be shown for users to review. Save the deconvoluted images for analysis.\nRun “Deconvolution wizard” in “Deconvolution” menu of the software (Figure 7[href=https://www.wicell.org#fig7]C). Raw images can be deconvoluted by entering this wizard (Figure 7[href=https://www.wicell.org#fig7]D). Check the parameters of the deconvolution of each channel step-by-step, such as the mapping functions, background estimation, deconvolution algorithm, signal to noise ratio and maximum iterations (Figure 7[href=https://www.wicell.org#fig7]E). Deconvolution can be done by using the default parameters (Figure 7[href=https://www.wicell.org#fig7]F). However, different parameters can be adjusted until the deconvolution images (Figure 7[href=https://www.wicell.org#fig7]G) cannot be improved further. In general, the most important parameter is “Maximum Iterations”, and the parameter can be between 10 to 40. More details can be found in the user guide of the software (https://depts.washington.edu/digmicro/huygens_pdf/ProfessionalUserGuide1505.pdf[href=https://depts.washington.edu/digmicro/huygens_pdf/ProfessionalUserGuide1505.pdf]).\nWhen deconvolution is over, export the deconvolution file back to LAS X. The deconvolution image can be found in “Imported from Huygens” folder.\nElectron microscopy (EM) – days 3–7\nTiming: 1 week\nIn this section, electron microscopy is performed after a 90-s application of 70 mM potassium solution in bovine chromaffin cells. We use high potassium solution to induce depolarization of every cell so that every cell can be examined with electron microscopy. Patch-clamp and depolarization of single cells are not suitable for EM examination, because it is difficult to identify the individual cell being patch-clamped.\nTake the coverslips and immerse them in a solution containing 70 mM KCl, 60 mM NaCl, 10 mM glucose, 10 mM HEPES, 2 mM CaCl2, and 1 mM MgCl2 (pH 7.3, adjusted with NaOH) for 90 s (Figure 8[href=https://www.wicell.org#fig8]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1655-Fig8.jpg",
    "Figure 8. Electron microscopy procedures\n(A) Chromaffin cells were stimulated with 70 mM K+ for 90 s and several steps were applied for visualization of Ω-profile structures.\n(B) A ultramicrotome (Leica UC7) used for sectioning cells.\nFix the cultures with 2% glutaraldehyde/2% paraformaldehyde/4% tannic acid/0.1 M sodium cacodylate for 15 min at 20°C–22°C.\nSwitch to 2% paraformaldehyde/2% glutaraldehyde/0.1 M sodium cacodylate fixative solution for 15 min at 20°C–22°C.\nWash the preparation with 100 mM glycine in 0.1 M sodium cacodylate buffer for 1 min at 20°C–22°C.\nWash 3 × 5 min in 0.1 M sodium cacodylate at 20°C–22°C.\nPause point: The sample can be stored at 4°C for 1–2 weeks.\nStart mixing Epon resin (Embed-812) and leave it on a rotator for 1–2 h.\nTreat with 1% osmium tetroxide in 0.1 M sodium cacodylate for 40 min.\nRinse in 0.1 M sodium cacodylate to wash osmium tetroxide.\nRinse in double-distilled water (DDW).\nDehydrate in ethanol as follows:\n50% Ethanol (EtOH) 1 × 5 min.\n70% EtOH 2 × 5 min.\n2% uranyl acetate in 70% EtOH 30 min (prepare 1:1 Epon/EtOH mix).\n70% EtOH 2 × 10 min.\n85% EtOH 2 × 5 min.\n95% EtOH 2 × 5 min.\n100% EtOH 2 × 5 min.\nCritical: Slide should not dry even for a moment during these steps. Always leave some solution on the top when they are switched.\nPut into a foil dish filled with 1:1 Epon/EtOH mix.\nReplace Epon/EtOH mix with Epon resin alone for 2 h, switch resin and leave for additional 2 h.\nFill molds to brim. Wipe the backs of coverslips with filter paper, and invert over filled circular molds.\nNote: Make sure there are no air bubbles under the coverslip.\nPolymerize Epon at 50°C for 14–18 h.",
    "Transfer to 60°C oven for several days to harden (at least 36 h).\nPause point: The sample can be stored at 20°C–22°C in a desiccator dry box for 2 years.\nImmerse and hold the block in liquid nitrogen for 30 s. Apply gentle pressure on the edge of the coverslip to remove it. Ensure that no glass is left on the surface.\nTrim the block and cut cross sections of 70 nm using a Leica UC7 Ultramicrotome (Figure 8[href=https://www.wicell.org#fig8]B) and place them on a 200 mesh pioloform coated index grid.\nCounterstain sections with uranyl acetate for 5 min and 3 min with lead citrate. Each counterstain is followed by serial washes using DDW.\nPause point: The sample can be stored at 20°C–22°C in a desiccator dry box for several months.\nSingle images were collected at up to 73,000 × magnification on a JEOL JEM-200CX, 120 kV electron microscope with an AMT XR-100 CCD."
  ],
  "subjectAreas": [
    "Microscopy",
    "Cell Biology",
    "Neuroscience",
    "Cell Membrane"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}