{
  "id": 19962,
  "origin_website": "Wiley",
  "title": "The Isolation of Stress Granules From Plant Material",
  "procedures": [
    "To extract SGs from plant cells, the formation of SGs must be induced first. In our case, plants expressing a green fluorescent protein (GFP)-tagged stress granule marker (e.g., Rbp47b) treated with heat stress (at 42°C for 30 min) are used as the starting material. The extraction of intact SGs requires a procedure that will not interfere with their integrity. The first step in the extraction of SGs is the preparation of an SG-enriched fraction, which is then used as the starting input for the affinity purification protocol (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20118#cppb20118-prot-0002]). Frozen plant material, after mechanical grinding and the addition of a lysis buffer, is then homogenized and prepared for differential centrifugation. The first step of centrifugation separates the supernatant from the pellet of cellular debris, membranes, and larger aggregates, which are kept for the next steps of fast centrifugation. Then, a slow centrifugation step is used to release SGs from the pellet.\nFor further analysis of the components of SGs, it is essential to include specific controls. For example, the use of plants expressing a tag only (35S:GFP) or expressing a different protein that is known to not be localized into SGs (forms different kinds of aggregates) might help to exclude unspecific binders (false positives).\nMaterials\nFrozen plant material\nLysis buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20118#cppb20118-rec-0004])\nAcetone\nGrinding mill (e.g., Retsch, cat. no. 207450001)\n5-mm stainless steel grinding balls (e.g., Retsch, cat. no. 05.368.0034)\nLiquid nitrogen\nMortar and pestle\n15-ml conical tube\nRefrigerated centrifuge (e.g., Multifuge #1S-R with Sorvall rotor)\nVortex (e.g., Scientific Industries, cat. no. SI-T236)\n2-ml microcentrifuge tube\nRefrigerated microcentrifuge\nVacuum concentrator (e.g., SpeedVac)",
    "1. Grind frozen plant material using a grinding mill and 5-mm stainless steel grinding balls at 30 Hz for 1 min. Repeat this step two times if needed. Cool samples in liquid nitrogen between grinding steps to avoid thawing.\nA total of 2 g plant material per sample is required. Prepare three times the amount for control conditions and three times the amount for heat stress conditions.\n2. To 2 g sample, add 2 ml lysis buffer (multiply by three to have three replicates), and homogenize using mortar and pestle.\n3. Transfer to 15-ml conical tube, and centrifuge 10 min at 4000 × g, 4°C.\n4. Remove supernatant and dilute pellets of each sample with 1 ml lysis buffer by pipetting up and down a few times. Vortex for a few seconds.\n5. Transfer to 2-ml microcentrifuge tube, and centrifuge 10 min at 18,000 × g, 4°C.\n6. Repeat step 4.\n7. Centrifuge 10 min at 18,000 × g, 4°C, and then repeat step 4.\n8. Centrifuge 10 min at 1000 × g, 4°C.\nAt this step, SGs are released to the supernatant, which corresponds to the SG-enriched fraction.\n9. Take 50 μl SG-enriched fraction for protein extraction to obtain a reference input for the affinity purification step. Briefly, add 150 μl cold (−20°C) acetone to SG-enriched sample if needed, and then precipitate for 2 hr at −20°C. Centrifuge 10 min at 18,000 × g, 4°C. Dry remaining protein pellets in a vacuum concentrator for about 2 hr, and store at −80°C for up to 6 months.\nMicroscopic analysis to ensure the presence of SGs in the SG-enriched fraction",
    "Before proceeding to the next purification step, the presence of SGs in the lysate should be observed under a confocal microscope. About 10 µl of the fraction can be transferred to the top of a glass slide to visualize the GFP signal using excitation of a 488-nm laser and emission between 500 and 520 nm.",
    "Affinity purification using anti-GFP antibodies allows fishing for a GFP-tagged bait and protein-metabolite-RNA complexes specific for SGs.\nMaterials\nDynabeads Protein A (e.g., Thermo Fisher, cat. no. 10002D)\nDiethyl pyrocarbonate (DEPC)-treated phosphate-buffered saline (PBS; see recipe)\nLysis buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20118#cppb20118-rec-0004])\nSG fraction (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20118#cppb20118-prot-0001])\nRNasin plus RNase inhibitor (e.g., Promega, cat. no. N2615)\nAnti-GFP rabbit IgG antibody (e.g., Thermo Fisher Scientific, cat. no. A11122)\nTube rotator\nMagnetic rack\nCentrifuge\n1. Equilibrate 100 μl Dynabeads Protein A per sample with DEPC-treated PBS for 1 hr at room temperature. Rotate beads on tube rotator. For example, for six samples equilibrate 600 μl Dynabeads with 600 μl PBS.\n2. Separate beads using the magnet, and wash once with DEPC-treated PBS for 5 min at 4°C.\n3. Rinse three times with lysis buffer for 5 min at 4°C.\n4. To 370 μl SG fraction, add RNasin (1:100 final dilution) and 30 μl equilibrated Dynabeads.\n5. Incubate on tube rotator for 15 min at room temperature.\n6. Separate beads using the magnet, and place supernatant in a new tube.\n7. Incubate supernatant with 12.5 μl anti-GFP rabbit IgG antibody for 60 min on the tube rotator for 1 hr at room temperature.\n8. Remove excess anti-GFP antibody by centrifuging 15 min at 14,000 × g, 4°C.\n9. Remove supernatant and resuspend pellet with 500 μl lysis buffer supplemented with 5 μl RNasin.\n10. Incubate resuspension with 60 μl equilibrated Dynabeads for 15 min at room temperature on the tube rotator.\n11. Wash three times for 5 min with lysis buffer at 4°C.\n12. Remove supernatant and proceed to Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20118#cppb20118-prot-0003] to extract proteins and metabolites from the beads.\nAs a control for the experiment, check the beads for GFP signal with a confocal microscope before progressing to extraction.",
    "To extract lipids, polar metabolites, and proteins, we use a single-step extraction protocol where a complex extraction buffer containing solvents with different polarities is used (Giavalisco et al., 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20118#cppb20118-bib-0004]). In that way, we separate three independent fractions: organic upper phase containing lipids (nonpolar metabolites), lower polar phase containing polar primary and secondary metabolites, and pellet containing protein and starch. For our interest, lipids, secondary metabolites, and proteins are further analyzed using liquid chromatography–mass spectrometry (LC/MS).\nMaterials\nBeads with attached SGs (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20118#cppb20118-prot-0002])\nExtraction buffer 1 (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20118#cppb20118-rec-0002])\nExtraction buffer 2 (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20118#cppb20118-rec-0003])\nVortex mixer\nRefrigerated shaking incubator\nUltrasonic bath (e.g., Bandelin, cat. no. RK 31)\nCentrifuge\n1.5-ml microcentrifuge tube\nVacuum concentrator (e.g., SpeedVac)\nVacuum pump\n1. To beads, add 1 ml precooled (−20°C) extraction buffer 1 and vortex vigorously.\n2. Incubate for 10 min at 4°C with shaking.\n3. Perform a short, 10-min sonication treatment by partially submerging tubes in an ultrasonic bath to ensure metabolite extraction from the beads.\n4. Add 0.5 ml extraction buffer 2, and mix well by vortexing.\n5. Centrifuge samples 5 min at 18,000 × g, room temperature.\nIn this step, you should observe two separate liquid phases and a protein pellet at the bottom of the tube.\n6. Transfer 500 µl upper (organic) phase to a fresh 1.5-ml tube, and dry in a vacuum concentrator overnight.\nThis fraction is ready for lipid analysis (Giavalisco et al., 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20118#cppb20118-bib-0004]).\n7. Remove the rest of the organic phase with a vacuum pump together with the interphase.\n8. Transfer 500 µl lower (polar) phase to a fresh 1.5-ml tube, and dry using a vacuum concentrator overnight.\nThis fraction is ready for analysis of polar metabolites (see Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20118#cppb20118-prot-0004]).",
    "9. Remove the rest of the polar phase, and air-dry the remaining protein pellet. Freeze pellets at −80°C for up to 6 months, or continue with protein digestion (Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20118#cppb20118-prot-0004]).",
    "Before MS analysis of enriched SG proteins can be performed, proteins need to be digested using trypsin and desalted. This protocol requires 2 days of work and is crucial in order to identify enriched proteins specific for SGs.\nMaterials\nBeads with attached dried protein pellets (see Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20118#cppb20118-prot-0003])\nDenaturation buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cppb.20118#cppb20118-rec-0001])\n100 mM dithiothreitol (DTT)\n300 mM iodoacetamide\nTrypsin/Lys-C Mix (e.g., Promega, cat. no. V5071)\n50 mM ammonium bicarbonate, pH 8 (adjust pH using acetic acid)\nTrifluoroacetic acid (TFA; e.g., Biosolve, cat. no. 202341)\n100% methanol\n0.1% (v/v) TFA/80% (v/v) acetonitrile\n0.1% (v/v) TFA/60% (v/v) acetonitrile\n37°C incubator\nSep-Pak C18 column (e.g., Teknokroma, cat. no. TR-F034000)\n2-ml microcentrifuge tube\nVacuum concentrator (e.g., SpeedVac)\nBead defrosting and trypsin digestion\n1. Solubilize beads with attached proteins in 50 μl denaturation buffer.\nTo increase the solubilization of proteins, perform bath sonication for 15 min.\n2. Reduce cysteine residues by adding 5 μl of 100 μM DTT, and incubate for 30 min at room temperature.\n3. Perform alkylation of samples by adding 5 μl of 300 mM iodoacetamide, and incubate for 20 min at room temperature in the dark.\n4. Digest reduced and alkalized proteins with Trypsin/Lys-C Mix according to the manufacturer's instructions. Add Trypsin/Lys-C Mix to achieve a protein:protease ratio of 25:1.\n5. Dilute urea concentration to 4 M with 50 mM ammonium bicarbonate, pH 8, and incubate for 3 to 4 hr at 37°C. For example, for 70 μl sample (with 4 M urea), add 15 μl of 50 mM ammonium bicarbonate.\n6. Dilute samples to 1 M urea with 50 mM ammonium bicarbonate, pH 8. For example, for 85 μl sample (with 4 M urea), add 255 μl of 50 mM ammonium bicarbonate. Incubate samples overnight at 37°C.",
    "7. Acidify samples with TFA to a final concentration of 1% (v/v) TFA and pH <3.\n8. Store samples at −20°C for up to 6 months, or continue with desalting (step 9).\nPeptide desalting\n9. Desalt peptides using Sep-Pack C18 columns. To do so, first activate column with 1 ml of 100% methanol. Then start vacuum to allow methanol to flow through the column.\n10. Wet column with 1 ml of 0.1% TFA/80% acetonitrile. Start vacuum to allow TFA/acetonitrile to flow through the column.\n11. Wash column twice with 1 ml of 0.1% TFA, and use vacuum to allow TFA to flow through the column.\n12. Load sample on the prepared column. Start vacuum to allow sample to flow through the column.\nPeptides will attach to the filter; therefore, flow-through can be discarded.\n13. Wash filter column with 1 ml of 0.1% TFA. Start vacuum and discard flow-through.\n14. Put clean 2-ml microcentrifuge tubes under columns, and add 600 µl of 0.1% TFA/60% acetonitrile to each column. Activate vacuum and collect flow-through.\n15. Dry peptides on a vacuum concentrator.\nThis might take a few hours. Do not over-dry peptides.\n16. Store dried, desalted peptides at −20°C for up to 6 months, or use directly for LC/MS analysis.",
    "To define proteins associated with SGs, multiple criteria might be used for data analysis. First, because SGs are present only under heat stress conditions but not under control conditions, proteins should be considered if they are either present in the heat-stressed sample and absent in the control or are significantly enriched at least twice in heat-stressed samples in comparison to the control. Second, (here depends on the hypothesis) exclusion can be performed for proteins that are known to be localized in chloroplasts or mitochondria, as those proteins are unlikely to be localized in cytosolic SGs. Third, comparison should be done of the list of SG proteins with the list of proteins enriched in sample affinity purified for GFP (35S:GFP) to exclude unspecific binders to GFP only. Fourth, depending on the question, comparison can be performed of the SG protein list with conserved SG proteins from yeast and human. Analysis can be performed of different SG-specific protein domains, such as RNA-binding or prion-like domains, and ATPase activity.\nData analysis depends not only on the hypothesis and protein used as bait but also on controls used in the experiment. Think about the negative protein list that might be used in your case to clean the final list of SG proteins from false-positive proteins."
  ],
  "subjectAreas": [
    "Plant Biology"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}