{
  "id": 5103,
  "origin_website": "Bio",
  "title": "Mouse Subependymal Zone Explants Cultured on Primary Astrocytes ",
  "procedures": [
    "An overview of the whole procedure is schematized in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160713/20160713003804_4240.jpgFigure 1. Summary of the complete procedure. Scheme of the steps described in the protocol, numbered as in the text (Procedure section).Astrocyte monolayer preparation from cortical tissue We use a modified version of the protocol previously described by Banker and Goslin (1991), as follows:Sacrifice P4-7 old mice by decapitation with sharp scissors. Remove the brains and transfer them to a sterile Petri dish with cold PBS-glucose-HEPES buffer under a stereomicroscope placed in a horizontal laminar flow bench.Remove the meninges with a fine forceps and dissect the cortex, mince it with a scalpel into small pieces of approx. 2 mm of diameter and transfer them to a 15-ml tube with PBS-glucose on ice. We use one tube per ~100-200 μl of tissue, normally we prepare 4 tubes in parallel and the cortex from one mouse is enough to obtain the material.Prepare papain (0.08%)/DNase I (0.001%) (final concentration) in 1 ml of PBS-glucose, add this solution to the tissues and incubate them for 3 min at 37 °C. Immediately pipette out the solution leaving the tissues on the bottom of the tube and wash them twice by adding 1 ml of DMEM-10% serum media at RT, decanting the tissue and removing the solution each time.Resuspend the tissue in DMEM-10% serum and to obtain a single cell suspension gently pipette up and down approx. 20 times with a 200-μl tip until the solution appears homogeneous. Note: In case some tissue pieces remain undigested, discard them from the cell suspension without further pipetting to avoid damaging the cells. Count the cells in a Neubauer chamber and plate them in 75 cm2 plastic flasks at a density of 100,000 cells/ml in DMEM-10% serum.",
    "We plate 2 x 106 cells per flask (20 ml) and keep the cells in culture for at least one week before splitting. To split the cells remove the media and add 2 ml trypsin solution per flask. Incubate the flasks for 5 min at 37 °C and subsequently inactivate the trypsin with 10 ml DMEM-10% FBS. Detach the cells from the flask by stringently pipetting the media and pellet down by centrifugation for 5 min at 800 x g. Discard the media and replace it with 10 ml fresh DMEM-10% FBS.One day prior explant plating, re-plate the astrocytes on glass coverslips coated with poly-lysine (in a 24-well plate). Coating is performed by adding 200 µl of poly-lysine solution on top of each coverslip placed inside a 24-well plate and incubating at 37 °C for 2-3 h. Afterwards the poly-lysine solution should be removed and the wells should be washed 3 times with 1 ml sterile PBS. Plate the astrocytes on the coverslips at a density of 35,000 cells/well in a volume of 150 µl avoiding that the solution spills out of the glass.  Wait until the cells attach (approx. 15 min) and add 350 µl of media to each well. Note: The astrocyte monolayer should be confluent at the time of plating the explants because neuroblasts migrate avoiding the empty surfaces. Manipulation of gene expression in astrocytes via AAV-viral infectionsSpecific gene overexpression or knockdown can be achieved by infecting the cells with recombinant adeno-associated viral (AAV) vectors. The viral backbone contains the sequence of the gene of interest under a general promoter (overexpression) or a shRNA sequence driven by the H1 or U6 promoter (knockdown). In addition, a fluorescent marker is expressed to identify the infected cells.",
    "AAVs are generated with the packaging cell line HEK 293 transfected with the plasmid for the viral backbone and the helper plasmids pDP1 and pDP2. The viral particles are purified as previously described (Alfonso et al., 2015). A detailed protocol can be found in McClure et al., 2011.Infect 70% confluent astrocyte cultures growing in 10 cm plates with the virus by adding the viral solution in the media (1:10 final dilution, the titer of the virus was approx. 106 cfu/µl). Replace the media on the following day and keep the cells in culture for at least 6 days before re-plating in 24-well plates for explant plating. Normally, between 60-90% of the cells are infected with the virus. Alternatively, primary astrocytes can also be infected with lentivirus. Other methods like lipid-mediated transfection or electroporation can also be used to express an exogenous sequence although they usually have a lower efficiency.SEZ dissection and explant platingSacrifice P4-10 old mice by decapitation and remove their brains in cold PBS-glucose-HEPES buffer as before. Cut coronal slices of approx. 400 μm at the level of the lateral ventricles (2 mm posterior to the end of the olfactory bulb) with a breakable scalpel blade and select the sections containing the SEZ (Figure 2A and 2B).Dissect out the wall of the ventricle with a scalpel (Figure 2C-E) and place it in a clean 10 cm Petri dish with PBS-glucose-HEPES on ice. Note: This cut should be as close to the ventricle as possible avoiding that the dissected area contains parts of the striatum.",
    "Mince the tissue in small pieces of ~200-400 μm diameter with a scalpel (Figure 2F), and either incubate them with an AAV-virus before plating (see step 2d), or immediately plate them on top of the primary astrocyte cultures prior replacement of the media with Neurobasal complete media. Plate 2-3 explants (distant from each other) per well (24-well plate) with a pipette (20 μl tip) and carefully transfer the plate to the incubator avoiding shifting the tissues. Note: The explants require approx. 4-6 h to attach to the surface, hence it is important to keep the plates in the incubator avoiding any handling during this time. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160713/20160713005506_2414.jpgFigure 2. Dissection of SEZ-derived explants. A. A brain from a P6-old mouse was placed on a Petri dish and a coronal slice at the level of the lateral ventricles (indicated with the black dotted line) was dissected with a breakable scalpel blade. B. The brain section obtained in (A) was cut with a scalpel along the dotted line and the wall of the ventricle exposed (C) in order to allow its dissection from the brain slice (D and E). F. The dissected tissue was further cut into small pieces, and was then ready to be plated on the coverslips containing the astrocyte cultures. Cx: cortex, LV: lateral ventricle, St: striatum.Manipulation of gene expression in neuroblasts via AAV-viral infectionsAAVs are generated as above (step 1g)After the SEZ-explant dissection, place the small pieces of tissue (30-40 explants) in a Petri dish and cover them with ~20 μl of purified virus (106 cfu/µl) for 15-20 min at room temperature. Dilute the viral solution by adding 200 µl of PBS-glucose and plate the infected tissue as described above (step 2c). Check for positive infection with an inverted fluorescent microscope 2 days after plating. Normally, approx.",
    "70% of the cells are infected with the virus.Neuroblasts visualizationOne day after plating, the explants are attached to the substrate and the neuroblasts migrating out of the tissue can be observed under a bright field microscope.Immunostaining: one to three days after plating, fix the explants by incubating the coverslips in 4% PFA (in PBS) for 30 min at room temperature, permeabilize in 1% PBS-triton for 15 min at RT, block with 3% PBS-BSA for at least 30 min at RT and incubate with goat anti-DCX (neuroblast marker, 1:500) and mouse anti-GFAP (astrocyte marker, 1:1,000) antibodies in 3% PBS-BSA overnight at 4 °C. Next day, wash the coverslips 3 times with PBS, incubate them with the secondary antibodies anti-goat conjugated to Alexa Fluor 488 (1:1,000) and anti-mouse conjugated to Alexa Fluor 647 (1:1,000) for 1 h at RT, wash again 3 times with PBS and mount in Mowiol mounting medium.Image acquisition: the immunostainings can be imaged with a confocal microscope using a 20x objective and the tile-scan function (see examples in Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160713/20160713005827_7158.jpgFigure 3. SEZ-derived explants on astrocytes cultures. Coverslips homogenously (A) or irregularly (B) covered by astrocytes were used as a substrate for SEZ-derived explants. Two days after plating, the cells were stained with antibodies against the astrocyte marker GFAP and the neuroblast marker DCX, as indicated in the pictures. Note that neuroblasts do not migrate over areas devoid of astrocytes. Scale bars: 100 μm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}