{
  "id": 3295,
  "origin_website": "Cell",
  "title": "Inoculation of Arabidopsis seedlings with Ralstonia solanacearum in sterile agar plates",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation of plant materials\nTiming: 11 days\nThis section describes the steps for preparation of pant materials in the first step of the experiment. All these steps should be performed in sterile conditions. Growing healthy plants in good conditions is one of the key factors to obtain reliable and reproducible results using this method.\nSterilize and stratify Arabidopsis seeds.\nAliquot Arabidopsis seeds in 1.5 mL Eppendorf tubes. Sterilize Arabidopsis seeds using 1 mL 1:20 diluted bleach (we use a commercial sodium hypochlorite aqueous solution with 11%–15% available chlorine; can be replaced by commercial bleach) for 8 min.\nWash seeds using sterile water 5 times.\nSow the surface-sterilized Arabidopsis seeds on MS- square plates with a 1 mL pipette tip. If necessary, the seeds can be sown in 3 rows within one 10 × 10 cm sterile plate (Figure 1[href=https://www.wicell.org#fig1]A). Usually 70%–80% seedlings germinate and grow in perfect conditions for subsequent use.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2885-Fig1.jpg\nFigure 1. Preparation of plant materials\n(A) Sterilize seeds and sow them on MS- medium square plate, then put plates to 4°C and dark.\n(B) Transfer 5 day-old seedlings in good conditions to new MS- medium square plate.\n(C) Total 15–20 seedlings in one plate.\nStratify seeds in the dark at 4°C for 3 days.\nAlternatives: In the step of seed sterilization, it is also possible to use 75% ethanol for 10 min and then 100% ethanol for 3 min. When using Arabidopsis genotypes that cannot grow well on MS- medium, seeds can be sown on 1/2 MS plates to grow for the first 5 days.\nGrow plants.\nMove plates to a growth chamber (22 ± 2°C, 16 h light/8 h dark photoperiod, 130 μE m−2 s−1, 65% humidity). Keep plates vertically and let seedlings grow for 5 days.\nTransfer seedlings.",
    "Transfer seedlings that are in good and consistent growth conditions, such as relatively similar root length and shoot growth, to new MS- square plates, placed as one row, using sterilized tweezers (15–20 seedlings/plate) (Figures 1[href=https://www.wicell.org#fig1]B and 1C).\nMove plates to a growth chamber (22 ± 2°C, 16 h light/8 h dark photoperiod, 130 μE m−2 s−1, 65% humidity). Keep plates vertically and let seedlings grow for 3 days.\nAlternatives: Add chemicals into MS- plates if necessary. In this step, move plates to a growth chamber to grow for 5 days, then transfer seedlings to other MS- plates supplemented with chemicals to grow for 3 more days.\nNote: R. solanacearum would grow effortlessly on the surface of MS medium with sucrose, leading to a reduced infection efficiency. Hence, MS- medium is highly recommended.\nPreparation of R. solanacearum inoculum (usually starting from 3 days before inoculation)\nTiming: 3 days\nThis section describes the steps for the preparation of R. solanacearum inoculum. All these steps should be performed in sterile conditions.\nStreak out R. solanacearum strains from the glycerol stock on phi solid medium (with TTC/glucose), and incubate bacteria for 2 days at 28°C (Figures 2[href=https://www.wicell.org#fig2]A and 2B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2885-Fig2.jpg\nFigure 2. Ralstonia solanacearum inoculation of Arabidopsis seedlings\n(A) Bacteria growing on solid phi medium with TTC.\n(B) Picking a pink colony using a pipette tip.\n(C) Bacterial culture after 14 h overnight incubation.\n(D) Bacterial suspension in sterile distilled water.\n(E) Dilute bacterial solution to a final concentration of OD600 = 0.0001, corresponding to 105 cfu/mL.\n(F) Inoculate roots of seedlings (0.5–1 cm from root tip) by placing a 5 μL droplet of R. solanacearum suspension at the inoculation site.\nStart overnight R. solanacearum culture by picking a pink colony to inoculate phi liquid medium and grow at 28°C (Figure 2[href=https://www.wicell.org#fig2]C).",
    "Pellet bacterial cells at 5,000 × g for 10 min at room temperature (23°C–25°C).\nRe-suspend the pellet in sterile water, and dilute to a concentration of OD600 = 0.1.\nMeasure the concentration of the bacterial solution using a Nanodrop spectrophotometer (NanoDrop 2000c). Then dilute the bacterial solution to a final concentration of OD600 = 0.0001, corresponding to 105 cfu/mL, before inoculation (Figures 2[href=https://www.wicell.org#fig2]D and 2E).\nAlternatives: Depending on the purpose of different experiments, one might use different inoculation doses. For bacterial quantification, we use 105 cfu/mL as initial inoculation dose. An inoculum of OD600 = 0.0001 or higher can be used for studying transcriptional responses, fluorescent marker line observation using confocal microscopy, or the observation of developmental responses.\nNote: R. solanacearum undergoes spontaneous phenotypic conversions.8[href=https://www.wicell.org#bib8] Pick pink bacterial colonies instead of the dark red colonies when grown on phi + TTC medium, since this colony color-related phenotypic conversion might correlate with changes in pathogenicity. For R. solanacearum, an OD600 of 0.1 corresponds to approximately 108 cfu/mL.\nInoculation of Arabidopsis seedlings\nTiming: 2–3 h\nIf there is any water condensation in the plates, remove the water before starting. Mark the inoculation site of each primary root, roughly 0.5–1 cm from the root tip of seedlings on MS- plates, and inoculate roots by placing a 5 μL droplet of R. solanacearum suspension on top of the root tissue at the inoculation site (Figure 2[href=https://www.wicell.org#fig2]F).\nKeep the plates under a sterile cabinet for 10 min to let inoculation spots dry.\nMove the plates to a growth chamber with appropriate conditions for R. solanacearum infection (75% humidity, 12 h light, 130 μE m−2 s−1, 27°C) after inoculation. Keep the plates vertically on a rack.",
    "Note: Always include a mock inoculation as a negative control (for example, H2O) to compare the primary root growth inhibition phenotype in seedlings inoculated with R. solanacearum GMI1000. Take a photograph before and after inoculation to record any interesting phenotypes, if necessary.\nSample collection for bacterial quantification\nTiming: 3 days\nTake samples.\nPrepare 2 mL Eppendorf tubes. Label and measure the weight of the empty tubes (ET) on the bench (Figure 3[href=https://www.wicell.org#fig3]A). Usually collect plant samples for quantification of bacterial growth 2 dpi or 3 dpi.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2885-Fig3.jpg\nFigure 3. Sample collection for bacterial quantification after 3 days post inoculation\n(A) Prepare empty 2 mL tubes and weigh; record as empty tube (ET).\n(B) Take shoots of seedlings by using a sterilized blade or scissors; usually take 4 shoots as a sample.\n(C) Wash shoots in sterile water 3 times and dry shoots with tissue paper.\n(D) Weigh samples, record as total weight (TW).\n(E) Grind samples with 200 μL sterile water and metal beads (3 small beads or 1 big beads), then add 800 μL sterile water to 1 mL.\nCollect the aerial part of seedlings by using a sterilized blade or scissors and place samples in plate with sterile water on the bench (Figures 3[href=https://www.wicell.org#fig3]B and 3C). Take 4 seedlings as one sample.\nWash sample with sterile water 3 times. Dry the samples with tissue paper and weigh the seedling materials within the tubes as total weight (TW) (Figure 3[href=https://www.wicell.org#fig3]D). For the collection of root tissues, wash 5 times wash with sterile water.\nCalculate fresh weight (FW) of the seedling materials. Fresh weight of seedling tissue for each sample is calculated as FW = TW – ET.",
    "Note: To minimize the variation in each replicate, the sample volumes could be n = 8–10 per genotype. After plant sample collection, all the following procedures can be performed on the bench.\nGrind plant samples.\nAdd 200 μL of sterile water to each Eppendorf tube containing plant samples, and three small metal beads or one big metal bead on the bench.\nGrind the samples using a Tissue Lyzer at 25 cycles for 1 min with the adapters at room temperature (23°C–25°C) (Figure 3[href=https://www.wicell.org#fig3]E). Afterward, add 800 μL of sterile water to obtain 1 mL of suspension in each tube.\nAlternatives: To grind samples using a drill, put each sample in a 2 mL Eppendorf tube with 200 μL of sterile water. Grind the tissue with a grinder placed in the drill stand. Afterwards, add 800 μL of sterile water.\nMake a series of dilutions from 10−1 to 10−5. Use a 96-well 200 μL plate for serial dilution (Figure 4[href=https://www.wicell.org#fig4]A). Fill the plate with 180 μL sterile water in each well, then add 20 μL bacterial solution (10-fold dilution) from step 13 in the first dilution (10−1 dilution).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2885-Fig4.jpg\nFigure 4. Spread bacterial solution on phi plates\n(A) Make a series of dilutions by 96-well 200 μL plate. Add 180 μL sterile water each well, and add 20 μL bacterial solution from Figure 3[href=https://www.wicell.org#fig3] in the first row and record as 10−1 dilution.\n(B) Spread bacterial solution (usually spread 2 different dilutions) by using 1.5 mL Eppendorf tube with hand on phi plates. Put plates to 28°C for 2 days.\n(C) Count bacterial number after 2 dpi.",
    "For samples from 3 days post-bacterial inoculation, plate 10−4 and 10−5 dilutions on phi plates by hand-spreading (Figure 4[href=https://www.wicell.org#fig4]B) or using any other automated system. Turn the plate upside-down after the suspension is spread and dry.\nIncubate 2 days at 28°C and count colonies (Figure 4[href=https://www.wicell.org#fig4]C).\nNote: After each experiment, make sure that all materials containing R. solanacearum (e.g., plates, gloves, bottles, etc.) are autoclaved to kill the bacteria (bleach is also acceptable to kill the bacteria)."
  ],
  "subjectAreas": [
    "Model Organisms",
    "Plant Sciences",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Ecology & Environmental Biology"
  ]
}