{
  "id": 4084,
  "origin_website": "Cell",
  "title": "Isolation of Microglia from Mouse or Human Tissue",
  "procedures": [
    "Step-by-Step Method Details\nStep-by-Step Method Details\nTiming: for Steps 1–7: (~90 min from end of transcardiac perfusions)\nThis protocol can be adapted depending upon the type of input material as well as the endpoint assay (Figure 2[href=https://www.wicell.org#fig2]). The protocol can be shortened for time-sensitive endpoints such as RNA extraction. The protocol can also use Percoll or Debris Removal Solution to remove myelinated material and other debris for assays in which cells will be cultured, and to isolate microglia in the interphase layer (Percoll). While our lab more commonly uses the Debris Removal Solution protocol when isolating microglia from adult mouse brain tissue, we use the Percoll method for embryonic mouse tissue, as the Debris Removal Solution did not successfully pellet any cells from embryonic tissue (see Limitations[href=https://www.wicell.org#limitations]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/81-Fig2.jpg\nFigure 2. Workflow of Isolation Protocol with Corresponding Steps in Parentheses\nAliquot 5 mL of Enzyme Digestion Mix into 15 mL tubes and weigh tubes.\nSaline transcardiac perfusion (see Note), dissect brain region of interest, chop up with razor blades on ice, and place in cold enzyme digestion mix on ice - for human tissue chop up with razor blades and place in cold enzyme digestion mix on ice.\nNote: Not for embryonic tissue\nNote: We have tested this protocol using human postmortem fresh frozen motor cortices provided by the Massachusetts Alzheimer’s Disease Research Center (ADRC) with approval from Massachusetts General Hospital IRB (1999p009556). Postmortem tissue was obtained as follows: briefly, the brain hemisphere was removed, coronally sectioned, and fresh frozen on metal plates, after which tissue was stored in a -80°C freezer until Step 2.",
    "Note: We have performed this protocol from mouse tissue using whole brain or dissected regions such as the prefrontal cortex, hippocampus, and nucleus accumbens. While we have not tested this protocol from every region of the mouse brain, we believe that it is capable of isolating CD11b+ cells from all regions. Specific regions should be optimized for use.\nNote: Following transcardiac perfusion of mouse with ice cold saline, it is necessary to dissect brain regions of interest/chop of tissue on an ice-cold petri dish using ice-cold dissection tools.\nWeigh samples (make sure to wipe water off the side of tube with kim wipe). Note the weight of the sample (Measurement in Step 3 vs measurement in Step 1), as this input will influence the volume of beads and buffer added in Step 23.\nNote: Make sure to wipe water off the side of tube prior to weighing\nPlace samples in a 37°C water bath for 15 min.\nCritical: Agitate every 5 min. Agitate tubes, but do not invert to mix, as tissue has the tendency to become stuck near the lid of 15 mL tubes.\nDissociation: Dissociate tissue to a single-cell suspension over the course of three separate flame-polished Pasteur pipets (first use #1, then #2, then #3). Pipet up and down 20 times with each pipet. Incubate at 37°C for 15 min in between each numbered pipet step. (Video S2[href=https://www.wicell.org#mmc2], Figure 3[href=https://www.wicell.org#fig3])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/81-Fig3.jpg\nFigure 3. Dissociation of Tissue to a Single-Cell Suspension\nAppearance of tissue (A) prior to and (B) after dissociation steps\nCritical: Agitate every 5 min. For instance, pipet up and down 20 times using #1 pipet, then agitate tubes every 5 min during the 15 min incubation step. Then begin pipetting with #2 pipet.\n        Your browser does not support HTML5 video.\n      \nVideo S2. Dissociation Step 1",
    "Pipet aggregated tissue until all tissue moves freely up into the Pasteur pipet. Then pipet up and down 20 times.\nDuring agitation steps, prepare the 30% and 70% percoll solutions (that were previously brought to ~20°C–25°C if using percoll gradients/embryonic tissue.\nFilter samples into fresh 15 mL tubes. Place 70 μm nylon filters on top of fresh 15 mL tube. Pre-wet each filter as below (Video S3[href=https://www.wicell.org#mmc3]). Add cell suspension over the pre-wet area on each filter. Rinse old 15 mL tubes with 2 mL of HBSS (with calcium/magnesium. Pipet up and down to mix. Add over the filter. Fill the new tubes to 15 mL with HBSS (with calcium/magnesium).\nCritical: Pre-wet each filter by adding 1 mL of HBSS (with calcium/magnesium) to the middle of the filter and then drag to side.\nCritical: After this step, samples should be kept on ice as much as possible, except in the case of the Percoll gradients, which will be at ~20°C–25°C again after Step 7, in preparation for the 23°C spin.\nCentrifuge: 10 min, 300 × g, 4°C, max acceleration, half brake.\nNote: At this point, the protocols diverge depending upon input tissue or endpoint methods. Choose one of the methods below to continue the protocol at step 8, step 15 or step 22.\n        Your browser does not support HTML5 video.\n      \nVideo S3. Pre-wetting Nylon Filters\nDebris Removal Solution Protocol\nTiming: for Steps 8–14: (~30–40 min)\nFor general use for cell applications. This section will remove debris/myelin from single-cell suspension prior to isolation of CD11b+ cells.\nAspirate the supernatant, then resuspend cell suspension carefully with 3,100 μL of ice-cold 1X PBS and transfer cell suspension to a fresh 15 mL tube. DO NOT VORTEX.\nAdd 900 μL of cold Debris Removal Solution.",
    "Mix well by pipetting 10 times slowly up and down.\nSLOWLY layer 4 mL of 1X PBS on top, creating a visible gradient (Video S4[href=https://www.wicell.org#mmc4])\nCentrifuge: 10 min, max speed (at least 3,000 × g), 4°C, max acceleration, max brake (Figure 4[href=https://www.wicell.org#fig4])\n        Your browser does not support HTML5 video.\n      \nVideo S4. Generation of Debris Removal Solution Gradients\nBegin with tube tilted at 45° angle and slowly layer 1X PBS on top of Debris REMOVAL Solution layer. As more 1X PBS is added, slowly bring tube back to a vertical position.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/81-Fig4.jpg\nFigure 4. Debris Removal Solution Gradients\nPhotographs of example gradients (A) before and (B) after centrifugation.\nRemove the top two layers. Fill up to 14 mL with ice cold 1X PBS.\nCentrifuge: 10 min, 1,000 × g, 4°C, max acceleration, max brake.\n(To be continued at Step 23)\nPercoll Gradient Protocol\nTiming: for Steps 15–21: (~60–75 min)\nFor general use for cell applications, especially those utilizing embryonic tissues. This section will remove myelin from single-cell suspension prior to isolation of CD11b+ cells.\nNote: Fast temp the centrifuge to 23°C as soon as samples from step 7 are removed.\nNote: Ensure that 70% Percoll and 30% Percoll solutions are prepared prior to this step.\nAspirate the supernatant, then resuspend cell suspension carefully with 1 mL of 30% Percoll. Then add 4 mL of 30% Percoll on top.\nPlace an unflamed Pasteur pipet in each 15 mL tube (cover the top with a gloved finger while gently placing the tip down to the bottom) and underlay 4 mL of 70% Percoll by pipetting slowly in 1 mL increments into the open top of the Pasteur pipet (Video S5[href=https://www.wicell.org#mmc5])",
    "Critical: When removing the Pasteur pipet, lift tip very slightly off the bottom of the tube to release any last fluid, and then cover the top of pipet with finger and slowly pull up, taking care not to disturb the layers. See Troubleshooting for what to do if the 70% Percoll won’t drain through the tip of the Pasteur pipet.\nNote: There is no visible myelin layer in tissue from embryonic mouse brains\nNote: The addition of a colored powder (such as phenol red) to the Isotonic Percoll solution will result in a darker 70% Percoll solution compared to 30% Percoll. This could allow for easier visualization of the gradient. However, the effects of any powder added to the cells would have to be taken into account.\nCentrifuge: 20 min, 340 × g, 23°C, acceleration of 2, no brake.\nCritical: Note the change in temperature, acceleration, and brake from previous steps.\nNote: Given the lack of brake, this step takes approximately 28–30 min.\nNote: Remove tubes from centrifuge very gently so as not to disturb the gradients.\nNote: Fast temp the centrifuge to 4°C after this step.\nBring all tubes back to the cell culture hood at ~20°C–25°C. Aspirate out the top 1 mL of liquid. With adult tissues, this would be the myelin layer- due to the relative lack of myelination in the fetal brain, you will either see nothing in the top 1 mL of fluid (30% percoll) or may see a few bits of debris (Figure 5[href=https://www.wicell.org#fig5]).\n        Your browser does not support HTML5 video.\n      \nVideo S5. Generation of Percoll Gradient",
    "Use finger to cover Pasteur pipet as it is placed under the 30% Percoll. Slowly pipet 70% Percoll into the Pasteur pipet and let it release under the 30% Percoll layer. Cover pipet with finger and gently remove.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/81-Fig5.jpg\nFigure 5. Post-centrifugation Percoll Gradients\nNote that myelin will separate at the top of the liquid, cells will separate out at the interface of 70% Percoll/30% Percoll, and red blood cells will pellet at the bottom of the conical tube.\nPipette out the interphase cells in 1 mL increments four times (total of 4 mLs) and transfer just this 4 mLs containing the cell layer into a new set of labeled 15 mL tubes. Use a circular pipetting method and depress the top of the pipette as you lower the tip down through the 30% percoll to the interphase layer, so you don’t pick up unwanted 30% percoll. See Troubleshooting for tips on visualizing the interphase layer and how to avoid the 70% percoll layer.\nFill 15 mL tube up to 15 mL volume with Post-Percoll Solution\nCentrifuge: 10 min, 300 × g, 4°C, max acceleration, max brake.\nCritical: After this step, samples should be kept on ice as much as possible\n(To be continued at Step 23)\nMolecular Protocol - for time-sensitive molecular applications such as RNA/DNA extraction\nFor this protocol, can move from the centrifugation (Step 7) straight to Step 23 for adult tissues.\nFor embryonic mouse tissues, steps 15–21 are still required.\nNote: With older animals, we have experienced that not removing debris/myelin with Percoll/Debris Removal Solution can clog the column. If column clogging occurs, either of the first two protocols should be used.\n∗∗∗All Protocols Converge again at This Step∗∗∗\nTiming: for steps 23–40: (~90 min)",
    "Aspirate the supernatant, then re-suspend pellets with 90 μL MACS buffer and 10 μL CD11b microbeads\nCritical: If using a large amount of tissue (i.e. greater than 150 mg), you can increase the amount of MACS buffer/beads. i.e. 135 μL MACS Buffer + 15 μL beads, or 180 μL MACS Buffer + 20 μL beads\nNote: 90 μL MACS buffer and 10 μL CD11b microbeads are used when specific brain regions (i.e. hippocampus, nucleus accumbens) of young animals (i.e. PN30-75) are dissected for isolation. Older animals or larger input tissue (i.e. >150 mg) would require more MACS Buffer/beads. We recommend a titration to determine the optimal bead/buffer volume for your input tissue of interest.\nIncubate on ice for 15 min\nAdd 1 mL of MACS Buffer to samples.\nCentrifuge: 10 min, 300 × g, 4°C\nWhile samples are spinning, set up sorting columns in tissue culture hood (Figure 6[href=https://www.wicell.org#fig6])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/81-Fig6.jpg\nFigure 6. Setup of LS Columns on MACS MultiStand.\n(A) LS Columns are placed in the MACS MultiStand over opened 15 mL tubes. The LS Columns are topped with fresh nylon filters. (B) Ensure that LS Columns are placed tightly in the MACS MultiStand.\nCritical: Place the columns tightly in the magnet (must be fully in place). Then place the “-” tubes that will be used to collect CD11b negative cells under the columns. Top the columns with fresh nylon filters using autoclaved forceps to maintain sterility.\nPrewash each column with 3 mL of MACS Buffer through nylon filter.\nCritical: Pre-wet each filter by adding 1 mL of HBSS (with calcium/magnesium) to the middle of the filter and then drag to side.\nRemove samples from centrifuge and aspirate the supernatant. Resuspend pellets in 500 μL of MACS Buffer.",
    "Add cell suspension to nylon filter, and then rinse the old 15 mL tube with 2 mL of MACS Buffer and add it to the nylon filter.\nAdd 3 mL of MACS Buffer to column.\nOnce liquid has finished flowing through the columns, remove the “-” tubes and place on ice.\nRemove the columns from the magnet, and place on top of “+” tubes that will be used to collect CD11b positive cells (Video S6[href=https://www.wicell.org#mmc6]).\nUsing a serological pipet, add 5 mL of MACS Buffer to the top of the column, and then quickly plunge column as hard as possible using the supplied plunger. Repeat this (for a total of 10 mL volume) for each column. Then place “+” tubes on ice with the “-” tubes (Video S7[href=https://www.wicell.org#mmc7]).\n        Your browser does not support HTML5 video.\n      \nVideo S6. Once Wash Has Flowed through the Columns, Carefully Remove LS Columns from the Magnetic MACS MultiStand and place onto the “+” Tubes\nBe sure to dab top of “-” tube on the bottom of the LS column prior to removal, as there will be a drop of liquid containing negative flowthrough cells.\nCentrifuge: 10 min, 300 × g, 4°C\nAspirate the supernatant (make sure to remove all bubbles, especially those from the “+” tubes)\nCritical: At this point you will only see a robust pellet in the “-” tubes and will not likely see a pellet in the “+” 15 mL falcon tubes. Because you likely will not see the pellet by eye, be sure to only displace the tube once to one side or the other and leave in place while aspirating off the supernatant (see Troubleshooting). Leave a meniscus of liquid covering the bottom of the tube prior to washing the pellet in 1X PBS, to avoid cell loss.",
    "Resuspend pellet in 400 μL of ice-cold 1X PBS\nCritical: washing the pellet in 1X PBS does risk some cell loss at this point and is not necessary for certain downstream applications such as quantification of microglial cytokine production in response to stimuli such as lipopolysaccharide (LPS). Short-term culture/incubation of microglial cells in media with and without pro-inflammatory stimuli can be accomplished by resuspending the pellet directly in your desired media at this point.\n        Your browser does not support HTML5 video.\n      \nVideo S7. Plunge MACS Buffer through LS Columns into “+” Tube\nPlunge column as quickly and with as much force as possible.7\nWashing the pellet in 1X PBS is necessary for downstream applications that could be affected by components of the MACS buffer (most notably the EDTA) such as single-cell RNA sequencing or flow cytometry.\nTransfer the 400 μL of cell resuspension to fresh 1.5 mL centrifuge tubes, rinse the old 15 mL tube with 800 μL of 1X PBS, and add this rinse to the new 1.5 mL tube as well.\nCentrifuge: 10 min, 300 × g, 4°C.\nCritical: Make sure to place all centrifuge tubes in the same orientation, as pellets may be difficult to visualize. See Troubleshooting for more detail on minimizing cell loss here.\nCarefully remove supernatant and resuspend in media of choice.\nThe media of choice will differ depending upon the intended usage for these isolated cells: (i) we use a DMEM-based media for cell culture and single-cell RNA sequencing applications, (ii) we resuspend cells in Trizol for RNA extraction applications, and (iii) we resuspend in PBS for flow cytometry applications. Final choice of media should be optimized in individual laboratories for their intended applications."
  ],
  "subjectAreas": [
    "Single Cell",
    "Cell Isolation",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}