{
  "id": 17138,
  "origin_website": "Jove",
  "title": "A State-of-the-Art Method for Preserving Residual Hearing During Cochlear Implant Surgery",
  "procedures": [
    "The protocol was approved by the Institutional Review Board (5551877) and the Research Ethics Committee of the Northern Savo Hospital District (1690/2019) and was carried out according to the guidelines of the Declaration of Helsinki. Informed consent was taken from all of the patients who volunteered for the study.\n1. Preoperative considerations\nAssessment of the residual hearing threshold\n\t\nEnsure that the preoperative pure-tone threshold averages (PTA) are at 0.250-1 kHz at ≤75 dB and that the patient can clearly hear the stimulus at 500 Hz or 1,000 Hz at ≤100 dB (Figure 1).\nPatient evaluation-inclusion and exclusion criteria\n\t\nEnsure that the patient is suitable for CI surgery to be performed under local anesthesia. Judge the suitability based on the patient's ability to be still and understand the communication during the surgery and the limitations of the surgery. Have the operating surgeon conduct a meticulous interview and examination in the outpatient clinic to assess whether the patient will be able to respond appropriately during the surgery.\nCheck that the patient has normal anatomy in the temporal region based on preoperative imaging (magnetic resonance imaging [MRI] and computed tomography [CT]) and that there are no contraindications (e.g., missing cochlear nerve or obstructed cochlea) for the CI surgery.\n\t\t\nOpen the software for the image viewer for the CT and MRI images, and from the dropdown menu, choose multi-planar reconstruction (MPR).\nIdentify the key anatomical landmarks (mastoid cells, middle fossa dural plate, sinus sigmoideus, facial nerve, external ear canal, cochlea, internal ear canal) from the CT image stack.\nOpen the preoperative MRI scan, and ensure the patient's suitability for cochlear implantation: the cochlea is open without any occlusions, and an intact cochlear nerve is found from the MRI scan.\nEvaluation of the insertion depth and electrode selection according to the size of the cochlea",
    "Open the image viewer and preoperative CT scans. Then, choose MPR from the dropdown bar.\nObtain the cochlea view from the CT images by aligning the images in the MPR in parallel with the cochlea.\nAssess the A-measures and B-measures: the cochlear size, the length from the round window through the modiolus, and the height perpendicular to the A line through the modiolus, according to Escudé et al.21, from the obtained cochlea view and at an insertion depth to 270° from the round window of the cochlea. Measure the distance to 270° by following the outer bony border of the cochlea.\nChoose an electrode length such that there are nine intracochlear electrode contacts with a 270°-300° insertion depth angle (IDA).\nimgsrc://cloudfront.jove.com/files/ftp_upload/64021/64021fig01.jpg\nFigure 1: Preoperative audiogram. Indication thresholds are presented as a green zone. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64021/64021fig01large.jpg]\n2. Perioperative preparations in the operating room (OR)\nEnsure that there is sufficient space between the patient's face and the draping. In addition, check that communication with the patient is possible with their contralateral hearing aid (HA). Connect the HA wirelessly with a remote microphone given to the nurse. For the HA, use a long sound tube to prevent unpleasant feedback.\nAlternatively, if the patient does not have the option for a contralateral HA, use a tablet computer to provide them with written communication. Test the communication with the patient.\nAdminister antibiotics and dexamethasone (e.g., 1.5 g of cefuroxime and 0.1 mg/kg dexamethasone) intravenously before the skin incision.\nInsert the ECochG stimulator earphone into the patient's external ear canal prior to the incision. Seal the external ear canal in the earphone with bone wax (Figure 2).",
    "NOTE: Some manufacturers provide foam earphones in sterile packaging. Alternatively, the earphone can be inserted prior to the draping, and the tube can be fed under the draping to the ECochG computer.\nPlace an iodoform sheet over the operation area, and align the earphone and the sound tube away from the incision area. Take care that the iodoform draping does not bend the sound tube during the preparation.\n3. Partial mastoidectomy, posterior tympanostomy, and drilling the implant bed with a surgical drill\nDrill the partial mastoidectomy and posterior tympanostomy, and prepare the implant bed.\n4. Insertion\nFor the ECochG preparation, ensure the presence of a medical physicist/clinical engineer in the OR, referred to here as the ECochG operator.\n\t\nGet the equipment ready for conducting the ECochG sound stimulation (see the Table of Materials) and response measurement through the CI; the setup varies slightly depending on the CI manufacturer.\n\t\t\nConnect the sound tube to the stimulator.\nConnect the implant coil and cable to the measuring device.\nThread the measuring coil and cable into the sterile wrapping.\nDepending on the manufacturer, launch the measurement program from a laptop, or use a tablet-based system.",
    "The stimulus is a tone burst, and the burst length depends on the stimulus frequency. Select the stimulus frequency (usually, stimuli at the highest preservable frequency of 500 Hz or 1,000 Hz during insertion), the sound pressure to be used, and the stimulus amplitude (e.g., 80-100 dB nHL so that stimulus is well-heard and tolerable) from the ECochG software. Depending on the manufacturer, keep the other measurement parameters at the default values, or change them to the following: a measurement window of 6.5-9.7 ms with a delay up to 2 ms after stimulus onset, and an average of 40-150 recordings per data point. Ideally, repeat the stimulus with alternated polarity and responses with condensation, and subtract the rarefaction polarity to extract the cochlear microphonics component (Figure 3).\nUse the first or the second contact of the electrode for the ECochG measurement. Check the impedance of the measurement channel soon after the contact is in the cochlea and before the first measurement.\nAsk the OR assistant to go to the patient and repeat the instructions to them about the subjective reporting of the changes in the sound stimuli.\nTest the sound stimuli, and confirm from the patient that they can clearly hear the stimuli.\nAdvise the patient to inform about any deviations, such as diminishing or disappearances of the perceived stimuli.\nSurgeon preparations before insertion\n\t\nTake the CI device, and place the receiver/stimulator into the implant bed.\nOpen the round window membrane of the cochlea. Make a slit with a hypodermic needle in the lower boundary of the round window, and carefully lift the membrane backward with a microsurgical hook. Flush the round window area with dexamethasone solution.",
    "Check the alignment of the CI lead wire within the mastoid cavity to avoid any rotational forces on the electrode and intracochlear structures from the lead wire after insertion.\nObtain a good ergonomic position with the best support possible for the hands to facilitate a slow and controlled insertion.\nStart of the insertion\n\t\nHave the surgeon inform the team that the insertion is starting, and make sure that everything is ready.\nTake the electrode with the insertion forceps, and start the insertion of the electrode into the cochlea through the round window.\nAt the beginning of the insertion, first insert the electrode just inside the cochlea (one or two contacts inside the cochlea). Have the ECochG operator measure the impedance after the insertion of the first and/or second contact. If the impedance is very high, change the measuring channel.\nHave the ECochG operator start the measurement after the impedance measurements. Ensure the electrode is progressed very slowly with constant feedback from the person observing the ECochG responses (Figure 4).\n\t\tNOTE: Depending on the manufacturer, there might also be an option that the recording device provides auditory feedback-a tone that becomes louder with an increasing response. However, this tone along with other noise in the OR may disturb the patient's subjective evaluation of the perceived stimulus.\nHave the surgeon continue the insertion with 1-2 mm advancements (one electrode). Between these advancements, obtain feedback from the patient about the loudness of the perceived sound stimuli.\nIf the ECochG responses become weaker or the patient reports a decrease in the perceived loudness of the sound stimuli, discontinue the insertion.\nWait for 30-60 s, and then inquire about the stimuli from the patient. Simultaneously communicate with the ECochG operator about the current state of the ECochG monitoring (CM response).",
    "If either of the responses (the ECochG or subjective responses) do not recover when the electrode is motionless, draw the electrode back gradually by one to two contacts at a time (the value of ~2 mm is dependent on which brand of electrode is being used), and wait for the response each time. Draw the electrode back just enough until the responses have recovered.\nIf the ECochG responses or the perceived loudness do not increase again after adjusting the insertion, but the desired IDA (270°-300°) (based on preoperative measurements and the number of electrodes inside the cochlea) has been achieved, discontinue the insertion. The situation is interpreted as a completed partial insertion.\nIf the responses increase again, continue the insertion as described above (steps 4.4.5-4.4.7).\nSeal the round window with fat tissue gathered from the postauricular incision.\nIn addition, use fibrin glue and bone dust to seal the groove for the lead wire between the receiver/stimulator and the mastoid cavity.\nFix the lead wire inside the mastoid cavity with bone dust and fibrin glue.\nClose the wound with surgical sutures. Monitor the patient after the operation during an overnight stay in the ward.\n5. Postoperative care\nRefer the patient to cone-beam computed tomography (CBCT) for postoperative imaging of the implantation.\n\t\nVerify the electrode's placement from the CBCT images.\n\t\t\nOpen the CBCT images, and choose MPR from the dropdown list.\nObtain the cochlear view in the MPR.\nVerify the IDA and the location of the electrode by scrolling through the images in the MPR. Check the number of intracochlear electrodes from the cochlear view to guide the fitting of the CI, especially in cases where there is a partial insertion, and identify the stimulating electrodes.",
    "Refer the patient for a postoperative audiogram to measure the residual hearing on the first postoperative day after the surgery and 1 month later. Measure the residual hearing routinely during the fitting follow-ups.\n\tNOTE: The 1 month follow-up is more reliable than the first postoperative day in terms of the hearing preservation results.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}