{
  "id": 5120,
  "origin_website": "Bio",
  "title": "EST-SSR Analysis and Cross-species Transferability Study in <em>Lavandula</em>",
  "procedures": [
    "SSR identification from lavender EST librariesExpressed Sequence Tag (EST) databases containing approximately 23,000 sequences are developed for L. angustifolia and L. x intermedia plants (Lane et al., 2010; Demissie et al., 2012). The main steps of EST library development include total RNA isolation, mRNA purification and cDNA library construction, and partial sequencing of random cDNA clones at the 5' ends by Sanger sequencing.EST libraries are sorted manually based on the sources of two species, L. angustifolia and L. x intermedia, and are used for simple sequence repeats (SSRs) identification using web-based SSR analysis tools (Jung et al., 2008; You et al., 2008) (Figure 1). Sorted ESTs in FASTA format are further broken down manually into multiple files with maximum input sequences of 500 ESTs in BatchPrimer3 software (You et al., 2008). For each of input files, SSR screening parameters are set to pick up primer pairs and SSR motifs with minimum lengths of 12 bp for di-, tri- and tetra-nucleotides, 15 bp for penta-nucleotides as well as 18 bp for hexa-nucleotides. Then, additional parameter settings (minimum, optimum and maximum) are carried out for primer length (18, 21 and 25 bp), product size (120, 200 and 300 bp), GC content (40, 50 and 60%), Tm (50, 55 and 60 °C). Finally, screening of SSRs along with primer sets from input sequences are run, and the outputs are displayed as HTML format and saved as tab-delimited text or excel files for further analysis of SSR repeats.Sorted EST files are directly imported into the Genome Database for Rosaceae (GDR) SSR mining server (Jung et al., 2008), and the minimum SSR motifs screening parameters are set to 15 bp for mono- and penta-nucleotides, 12 bp for di-, tri- and tetra-nucleotides, as well as 18 bp for hexa-nucleotides.",
    "Other primer generating parameters are kept as default parameters of the software. The outputs are then generated as tab-delimited text file format, which are easily converted into excel files for further SSR repeats analysis. [Optional: automated SSR identification and potential primer designing can be made using Perl script MIcroSAtelitte (MISA) identification tool.] SSRs with potential primer flanking regions are further filtered out based on primers designed during SSR motif identification using the aforementioned tools. All identified SSRs with primer flanked regions are again characterized, targeting the length of repeats as longer category with SSR length of ≥ 18 bp for tri-nucleotides and ≥ 20 bp for di-, tetra-, penta and hexa-nucleotides, or with lower than those demarcations as shorter category.To predict the putative functional roles of the repeats under longer category, ESTs/unigenes containing SSRs with primer flanking regions are annotated against public databases using Blast2GO online platform (Conesa et al., 2005). In brief, ESTs containing repeats ≥ 18 bp are filtered and uploaded into Blast2GO, followed by blasting against the public database. Then, mapping of ESTs with Blast hit are continued prior to the final putative functional annotation. Lastly, based on the detected annotations, characterization of gene ontology (GO) annotation and putative functions of SSR containing ESTs are made.Depending on the annotated functions or random representation of identified repeats, unigenes/ESTs are selected and used to refine manually the designed primer pairs following accordingly the minimum, optimum and maximum parameters: primer length (18, 21 and 25 bp), product size (120, 200 and 300 bp), GC content (40, 50 and 60%), Tm (50, 55 and 60 °C) and others using OligoAnalyzer 3.1 online software. (Optional: primer designing can be done by any primer designing tools.)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160728/20160728021053_4794.jpgFigure 1.",
    "Overview of SSRs analysis from EST libraries of lavender species and validation of identified SSR on source as well as related Lavandula species. Major steps of SSR analysis from ESTs and subsequent validation include: (1) EST library development; (2) SSR motif identification using web-based mining tools; (3) SSR characterization, primer design and custom-synthesis of primers; (4) genomic DNA isolation; (5) PCR amplification of expected SSR motif-containing fragments; and (6) resolution of DNA fragments on polyacrylamide gel for scoring of amplicons as presence (1) or absence (0).Validating and assessing cross-species transferability of SSRsSelected primer sets from aforementioned procedures are custom-synthesized and resuspended in 10 mM Tris (pH 8.0) buffer and stored at -20 °C until use.Fresh young leaves (~100 mg) per sample of both source and related species (Figures 1 and 2) are ground with liquid N2 to a fine powder with mortar and pestle, and transferred into 1.5 ml centrifuge tube containing 450 µl cell lysis buffer (GP1 or GPX1) and RNase A (5 µl) from the plant genomic DNA extraction kit. Note that GPX1 is used for samples of mature leaf tissues (Figure 2B), mostly rich in phenolic compounds. The samples are then incubated at 60 °C in water bath for 10-15 min, mixing by inverting every 5 min. The remaining procedures are done according to the kit's instructional manual. Finally, each of the samples is eluted with a total of 40 µl elution buffer with two round elution (25 µl and 15 µl, respectively) after 3-5 min incubations at room temperature. Eluted genomic DNA (gDNA) is quantified using NanoDrop 2000 spectrophotometer (1 µl elution buffer for blank and 1 µl gDNA for each sample).",
    "To check the gDNA integrity, 10 µl of the gDNA (100-300 ng) mixed with 1 µl of 10x loading dye and autoclaved water is loaded into each well of an agarose gel (1%) and run on horizontal gel electrophoresis with 1x TAE buffer at 80 V for 30-45 min (Figure 3). DNA image is then visualized and taken by the Gel Imager (Figure 3). Finally, a working solution is made for each sample into 50-70 ng/µl and stored at -20 °C until use.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160728/20160728023450_1805.jpgFigure 2. L. x intermedia cv Grosso plants for genomic DNA extraction. A. Young plants. B. Mature plant.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160728/20160728023813_6361.jpgFigure 3. Agarose gel (1%) resolution of genomic DNA samples (200 ng/well) isolated from young leaf tissues of L. x intermedia (lanes 1-5) and L. angustifolia (lanes 6-12) plants. M, 1kb DNA ladder (300 ng).PCR amplification for each primer set is performed by touch-down PCR using a two-stage amplification program (Figure 1). For the first stage, the Thermocycler is set to 15 min denaturation at 95 °C followed by 11 cycles of 30 sec denaturation at 95 °C, 30 sec annealing at 64-54 or 62-52 °C (depending on the primer type) with dropping of 1 °C in every cycle for annealing and 2 min at 72 °C for extension. For the second stage, the Thermocycler is programmed to perform 24 cycles at 95 °C for 30 sec, 54 °C or 52 °C for 30 sec and 72 °C for 2 min, and completed by a final extension at 72 °C for 10 min. The PCR amplified products are separated on a 6% polyacrylamide gel (Figure 4). Samples that are well mixed with loading dye (9 µl PCR products and 1 µl 10x loading dye) are loaded into gel wells using standard 1-200 µl volume pipette tips.",
    "One well is left empty to load a DNA ladder mix containing 0.35 µl of 50 bp DNA ladder (1 µg/ µl), 1 µl of 10x loading dye and 8.65 µl of autoclaved water. Once all samples and DNA ladder are carefully loaded, the gel is run in vertical gel electrophoresis using 0.5x TBE buffer at 160 V for approximately 45 min. The gel is then carefully transferred into a plastic container with 50 ml 0.5x TBE buffer supplemented with 1 µl SYBR safe and rocked for 30 min. After a quick rinse of the stained gel with fresh 0.5x TBE buffer, a gel image is taken using the Gel Imager (Figure 4). SSR primers from either L. angustifolia or L. x intermedia ESTs are validated for their polymorphism within the donor species (same as source species) as well as cross-species transferability to other related species. (Optional: A single amplicon of every targeted repeat can further be gel purified and sequenced to verify the authenticity of the designed primer sets that amplify the desired fragments.)Because of the complex polyploidy nature of Lavandula genome, we assess the polymorphism and cross-species amplification based on presence or absence of amplified SSR fragments. If the target fragments with expected sizes are detected, the data is recorded as “presence” (1). However, if the target fragments do not meet the expected size or there is no amplification, it is recorded as “absence” (0) for that particular fragment. As a demonstration, strong LAF15 amplicons across the given samples are assessed (Figure 4). Five fragments (~145, 155, 185, 200, 250 bp) from the two species are detected and scored. The scoring is made for each fragment across 15 samples as \"1\" for detected fragments and \"0\" for no or faint amplifications.",
    "For \"~145 bp\" and \"~155 bp\", the patterns of the scoring from sample-1 to sample-15 are \"100100001110100\" and \"111111111111111\" respectively. The remaining three fragments (~185, 200, 250 bp) are scored as \"1000000000100100\", \"000100001100000\" and \"101000000000000\", respectively. These scored data can be managed in excel sheet in line with the formats of the subsequent analysis software. A similar scoring pattern is also used for samples of related species. (Optional: Fluorescent dye-labeled primers can be custom-synthesized and used for automated capillary electrophoresis detection with the help of fluorescent dye tagged to the fragments during amplification with fluorescent dye-labeled primers. This option is also useful to detect the exact numbers and sizes of amplicons per a primer set.) imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160728/20160728024333_7019.jpgFigure 4. Polyacrylamide gel (6%) resolution of EST-SSR (LAF15) amplicons from (A) samples of L. angustifolia (lanes 1-9) and L. x intermedia (lanes 10-15) plants, and from (B) samples of related species, including L. angustifolia (lane 1) and L. x intermedia (lane 3). M, 50 bp DNA ladder; lane 2, L. latifolia; lane 4, L. buchii; lane 5. L. dentata; lane 6. L. lusitanica; lane 7, L. x ginginsii; lane 8, L. stoechas."
  ],
  "subjectAreas": [
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}