{
  "id": 10414,
  "origin_website": "Jove",
  "title": "Preparation and Characterization of Nanoliposomes for the Entrapment of Bioactive Hydrophilic Globular Proteins",
  "procedures": [
    "1. Preparation of tarin liposomal nanocapsules16\nNOTE: All preparations should be prepared in triplicate in order to obtain a larger volume (7 mL) and enable the sample to be centrifuged in an ultracentrifuge (see details below).\nWeigh the liposome components using an analytical balance, as shown in Table 1.\nDissolve the lipid components in chloroform using a 250 mL volumetric flask that fits in a rotary evaporator to avoid loss of material.\nStir the mixture at 150 rpm for 15 min.\nRemove the chloroform using a rotary evaporator under the following conditions:\n\t\nAdjust the volumetric flask mouth to the standard position (25°) for optimal efficiency, while in contact with the water from the heating bath.\n\t\tNOTE: The equipment arm should be inclined at 25° to maintain contact between the volumetric flask and water bath, while not affecting evaporation efficiency or damaging the sample. The standard position can vary according to the equipment brand.\nSet the condenser temperature to a minimum of 3 °C.\nSet the heating bath temperature to 40 ± 1 °C.\nSet the rotation to 120 rpm.\nAdjust the vacuum to 207 mbar and boiling point to 20 °C.\nAfter ~25 min, remove the flask and discard the evaporated solvent, remaining in the condenser, appropriately.\n\t\tNOTE: A thin and opaque film, consisting of the liposome components, is formed in this step and can be easily visualized. The evaporated solvent remaining in the condenser must be stored into disposal recipients (chlorinated) to be handled by a specialized company for appropriate discarding.\nHydrate the lipid film to reach a 0.01 M lipid concentration in 0.3 M ammonium sulfate solution (pH = 7.4) containing tarin at 1 mg/mL to a final volume of 10 mL.\n\t\nStir the mixture for 40 min and incubate overnight at 4 °C.",
    "NOTE: This step can be considered a stop point. Overnight incubation is not obligatory.\nAfter incubation, sonicate the suspension for 1 min at 25 °C (room temperature; RT) to reduce vesicle size and avoid aggregation.\n\tNOTE: Size reduction was performed in an ultrasonic sonicator under the following conditions: 130 W and 40 kHz.\nPerform a 12-cycle extrusion through a 0.2 µm polycarbonate pore membrane.\n\tNOTE: Before the extrusion process, test the mini-extruder assembly using water to avoid sample leakage. A 0.1 µm pore membrane is also suitable. In this case, pre-heat the mini-extruder holder above the lipid transition temperature to facilitate extrusion, while maintaining the physicochemical characteristics of both lipids and proteins.\n\t\nFit the parts of the mini extruder, as described in the manufacturer's manual.\nPlace the polycarbonate membrane between two pre-wet filter supports and place it into the holder.\nInsert a 1 mL empty syringe into the device, fill the other syringe to its total volume with the liposomal suspension, and insert it on the opposite side.\nPerform a 12-cycle extrusion through a 0.2 µm polycarbonate pore membrane. Push the sample from one syringe to another, slowly. Collect the extruded suspension in a pre-cooled tube.\n\t\tNOTE: The polycarbonate membrane should be replaced only when sample transference from one syringe to another becomes difficult. The liposomal suspension should become clear during the extrusion process as a result of size reduction due to the formation of SUVs. About 0.2 mL of the sample can be lost during this step.\nSeparate liposomes by ultracentrifugation.\n\tNOTE: Maintain the samples in an ice bath until the ultracentrifuge is ready to be used. Separate SUVs from the remaining components and ammonium sulfate by ultracentrifugation using an ultracentrifuge with a swing-bucket rotor (see details below).",
    "Weigh the sample in the titanium tube that fits the rotor and balance the tubes. Check the minimum volume required according to the rotor used to avoid damaging the tubes, and adjust the liposomal suspension volume with ammonium sulphate, if necessary.\n\t\tNOTE: The swing bucket should always be supported on the stand when outside of the centrifuge to avoid scratching the \"zebra stripes\" (i.e., the black and white stripes on the bottom), which are used by the centrifuge to determine rotation speed.\nTurn on the vacuum before using the centrifuge to allow it to refrigerate.\nFit the titanium tubes into the swing bucket.\n\t\tNOTE: Lift the tubes to the position they assume when running to ensure that they are perfectly fitted.\nRelease the vacuum, open the centrifuge door, and place the rotor inside.\n\t\tNOTE: Pay attention to the circle mark on the bottom of the rotor, which must fit in the opposite direction of the same circle mark into the centrifuge itself.\nClose the centrifuge door, press Vacuum and wait until the vacuum reaches from 200 to <20 microns or from 26 Pa to <3 Pa.\nAdjust the parameters in the ultracentrifuge display to 150,000 x g (the equivalent to 29,600 rpm for the aforementioned swing bucket) for 90 min at 4 °C (acceleration: max, deceleration: max).\n\t\tNOTE: Always convert the speed to x g if the specific centrifuge is set in rpm. Use the centrifuge website to convert the unit according to the rotor used.\nPress Recall, check the conditions, and press Start to run.\n\t\tNOTE: Wait until the centrifuge reaches the desired speed.\nAfter 90 min, release the vacuum by pressing the Vacuum button and open the centrifuge door when the vacuum reaches 200-700 microns (equivalent to 26-93 Pa).",
    "Switch off the centrifuge, remove the rotor from the inside, and leave it on the bench with the buckets to dry.\nMaintain the ultracentrifuged samples on ice.\nCarefully, separate supernatant from the pellet by turning the tube upside down into a disposable 15 mL centrifuge tube to separate the supernatant and pellet.\n\tNOTE: Store the supernatant containing the unencapsulated protein at 4 °C. It will be used to determine the encapsulation efficiency. The pellet appears as a translucent jelly.\nSuspend the pellet containing the encapsulated protein in HEPES buffered saline (3 mL of 1x HBS).\n\tNOTE: The HBS 2x (stock solution) is prepared by diluting the following amounts of reagents in distilled water: 140 mM NaCl, 1.5 mM Na2HPO4, 50 mM HEPES, then adjusting the pH to 7.4 and final volume to 100 mL. Na2HPO4 can be replaced by NaHCO3or omitted to avoid interference if liposome concentration is to be determined. The HBS 2x stock solution should be diluted in distilled water to obtain HBS 1x before use.\n2. Encapsulation efficiency\nNOTE: Determine the encapsulation efficiency using Peterson's protocol17in order to avoid lipid interference in protein quantification. All samples (BSA standards and liposome supernatant) should be analyzed in triplicate. Also prepare a blank tube.\nPreparation of stock reagents and working solutions17\nFor stock reagents, prepare copper-tartrate-carbonate (CTC) by mixing 10 mL of 20% sodium carbonate, 200 µL of 0.1% copper sulfate, 200 µL of 0.2% potassium tartrate with 9.6 mL of distilled water. Prepare 100 mL of 10% sodium dodecyl sulfate (SDS) and 0.8 N sodium hydroxide (NaOH).",
    "For working solutions, prepare 10 mL of 0.15% sodium deoxycholate (DOC) and 72% trichloroacetic acid (TCA). Dissolve 10 mg of bovine serum albumin (BSA) in 10 mL of distilled water to obtain a 1 mg/mL standard solution. Prepare reagent A by adding equal parts of CTC, NaOH, SDS, and H2O. Prepare reagent B by diluting Folin-Ciocalteu phenol reagent 1:5 in distilled water.\n\t\tNOTE: Reagent A requires 1 mL for each reaction tube, while reagent B requires 0.5 mL. To determine the final volumes of reagents A and B, first define the number of reaction tubes to be used, considering three distinct concentrations of BSA, blank, and samples in triplicate. Reagent A must be well-homogenized before use and can be stored at 25 °C (RT) for 2 weeks. Reagent B is also stable at 25 °C (RT) if stored in an amber bottle.\nPrecipitation\n\tNOTE: This step is performed in microcentrifuge tubes.\n\t\nDilute the liposome supernatant with water to a final volume of 1 mL containing 5-100 µg of protein.\n\t\tNOTE: The blank tube should be filled with 1 mL of distilled water.\nAdd 0.1 mL of 0.15% DOC, homogenize by vortexing, and incubate for 10 min at RT.\nAdd 0.1 mL of 72% TCA, mix well, and centrifuge at 3,000 x g and RT for 15 min.\n\t\tNOTE: DOC-TCA promotes protein precipitation, forming two distinct phases. The target protein can be recovered by centrifugation, avoiding lipid interference.\nCarefully discard the supernatant by verting the tube downwards and laying it on an absorbent paper. Save the pellet for the subsequent step.\n\t\tNOTE: The pellet can be very difficult to see, but the tube should be turned upside down even if it is not visible.\nSpectrophotometry",
    "Suspend the pellet obtained from step 2.2.4 in 1 mL of distilled water. Mix thoroughly to make sure the pellet is dissolved and transfer the sample to a new test tube.\nPrepare dilutions of albumin (BSA) standards to a final volume of 1 mL.\n\t\tNOTE: Protein standards must be prepared between 5-100 µg/mL.\nAdd 1 mL of reagent A to the tubes from step 2.3.1 and 2.3.2 without exception, mix well, and incubate for 10 min at RT.\n\t\tNOTE: SDS can relieve possible lipid interferences while aiding in protein solubilization.\nAdd 0.5 mL of reagent B to the tubes from step 2.3.1 and 2.3.2, mix well, and incubate for 30 min at RT while protected from the light.\n\t\tNOTE: The Follin-Ciocalteu phenol reagent is a mixture of phosphomolybdate and phosphotungstate used for colorimetric assays of some nitrogen-containing compounds, such as proteins. Copper complexation increases the reactivity of phenols towards this reagent, producing a blue/purple complex according to protein concentration.\nDetermine absorbances at 750 nm using a spectrophotometer.\nCalculate the protein concentration in the supernatant based on the standard curve as follows.\n\t\t\nPlot absorbance value (Abs) vs. BSA concentration (mg/mL) to obtain the angular coefficient (k) considering a linear tendency line.\nDetermine the supernatant protein concentration (C) by the ratio between the absorbance value and angular coefficient (k), then multiply by the total volume as follows:\nimgsrc://cloudfront.jove.com/files/ftp_upload/59900/59900eq1.jpg\nDetermine encapsulation efficiency according to the following formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/59900/59900eq2.jpg\nwhere loaded protein = 10 mg, nonencapsulated protein = value of C obtained in step 2.3.6.2.\n\tNOTE: In this case, a total of 10 mg tarin dissolved in ammonium sulfate solution (1 mg/mL) is used to perform the encapsulation procedure, since this concentration is sufficient to obtain satisfactory in vitro effects13,16,18.\n3. Size and stability determination",
    "NOTE: Size distribution and polidispersity index (PdI) of the liposomal preparations are evaluated by dynamic light scattering (DLS). A PdI close to 0.1 indicates a homogeneous preparation. For stability determination, store liposomes at 4 °C and check size distribution and size average regularly.\nTurn on the DLS equipment 30 min before use to warm up the laser lamp.\nTransfer the liposomal preparation obtained in step 1.10 to a disposable sizing cuvette.\nSet the equipment parameters as follows: dispersant type = water (RI = 1.33); material = lipids (RI = 1.45); and RT.\nPress Start and wait while the equipment finishes its reading.\nRemove the cuvette and turn off the equipment.\n\tNOTE: Either transfer the sample from the cuvette back to the disposable 15 mL centrifuge tube for subsequent analyses, or discard it if there is a sufficient amount for new reads.\n4. Morphological characterization\nNOTE: Liposome characterization is performed according to Murtey and Ramasamy19. Samples containing nanoliposomes obtained in step 1.10 are prepared in triplicate.\nFix the glass coverslips (13 mm diameter) in the bottom of a Petri dish with double-sided tape. Cut the tape into small pieces (appropriate size to fix the coverslips), remove the protective paper underneath, and fix it on the bottom of the Petri dish. With the aid of tweezers, remove the protective paper on top of the tape and fix the coverslips on it.\n\tNOTE: Be careful in the following steps not to release the coverslips, and use a strong tape.\nCoat the coverslips with poly-L-lysine. Place wet filter papers inside the Petri dish to maintain moisture and incubate for 1 h at RT (25 °C).\nAfter coating, rinse the coverslips with distilled water.",
    "Fill the coverslips with a drop of the sample from step 1.10 and allow them to dry for 1 h at RT.\nTo fix the samples, cover them with 4% glutaraldehyde prepared in 0.1 M phosphate buffer, pH = 7.2. Place wet filter papers inside the Petri dish and seal the dish to maintain moisture levels. Incubate at 4 °C for 48 h.\nRinse the coverslips 3x for 5 min with the same phosphate buffer.\nDehydrate samples as follows: 35% ethanol 1x for 15 min, 50% ethanol 1x for 15 min, 75% ethanol 1x for 15 min, 95% ethanol 2x for 15 min, and absolute ethanol 3x for 20 min.\nChemically dry the samples by immersion 2x in 1−2 mL of hexamethyldisilazane (HMDS) for 10 min.\n\tNOTE: The HMDS should be manipulated carefully inside a fume hood. Samples should be allowed to dry overnight inside a desiccator or inside the fume hood at RT.\nMount the dried samples on a stub with a carbon conductive adhesive tape.\nSputter the surface of the coverslip in a vacuum with an electrically conductive layer (20 nm thickness) of gold-palladium.\nRecord images with a scanning electron microscope (SEM) at low vacuum mode and low voltage (20 kV)."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}