{
  "id": 9359,
  "origin_website": "Jove",
  "title": "Visualizing Neuroblast Cytokinesis During C. elegans Embryogenesis",
  "procedures": [
    "1. Preparation of Plates for Maintaining Worm Strains and Performing RNAi\nNematode Growth Media Plates\n\t\nPlates\n\t\t\nPrepare Nematode Growth Media (NGM) plates to maintain worm strains and to perform genetic crosses. Combine 3 g NaCl, 17 g Agar and 2.5 g BactoPeptone with 1 L of distilled water in a 2 L flask and add a metal stirring bar.\nAutoclave the flask to dissolve the agar and to sterilize the media. Then place the flask on a stir plate and allow the media to cool while stirring.\nOnce the media has cooled down and is still somewhat warm to touch (45-50 °C), add 1 ml 1 M CaCl2, 1 ml 1 M MgSO4, 1 ml of 5 mg/ml cholesterol solution and 25 ml 1 M potassium phosphate buffer (PPB; recipe in table of reagents/materials; filter sterilize stock solutions) and immediately pour the media into small Petri dishes (60 mm x 15 mm; fill the dishes ~3/4 to the top or 13 ml/plate using an automated dispenser). Note: For long term maintenance of some strains tetracycline can be added to the plates (12.5 μg/ml) to allow Tn10 transposon inactivation of the bacterial RNAse III gene.\nLet the media solidify overnight at room temperature. Note: Plates should be kept in a biological hood or in an area of the lab that is less prone to contamination. Also, remove any condensation that has built up on the lids (e.g. clean with tissue paper) to limit fungal contamination. If Tetracycline is also added to the plates, then cover them with aluminum foil as this antibiotic is light sensitive.",
    "The next day, seed the dry NGM plates with a suspension of E. coli (OP50 strain; see Section 1.1.2) that has been gently vortexed. To make plates for mating, add ∼50 μl of OP50 to the center of each plate (to form a small circle). To make plates for maintaining worm strains, seed each NGM plate with ∼100-200 μl of OP50 (to ensure that it covers a greater area of the plate).\nLet the seeded plates dry O/N at room temperature.\nThe next day, turn the dried NGM plates upside down and stack them in plastic storage containers at 4 °C. Note: Plates are usable up to ∼3-4 weeks. Plates containing Tetracycline should be kept in the dark.\nFood\n\t\t\nUse E. coli OP50 [from the Caenorhabditis Genetics Center (CGC; http://www.cbs.umn.edu/cgc)] as a food source for C. elegans. Note: OP50 can be stored as glycerol stocks at -80 °C (ratio 1:1 in 50% v/v glycerol).\nTo make OP50 for the NGM plates, make a streak plate using a small aliquot of the glycerol stock (<10 μl; use a sterile pipette tip). Spread the bacteria on an LB agar plate (recipe in table of reagents/materials) and leave it at 37 °C for ~16 hr. Note: If there are problems with contamination, streptomycin resistant OP50 can be used, and streptomycin can be added to the LB agar plates (50 μg/ml).\nThe next day, pick a single colony and inoculate 100 ml of liquid LB media (recipe in table of reagents/materials) in a 500 ml flask.\nLet the culture grow O/N at 37 °C with shaking.\nThe next day, use the bacterial suspension for seeding NGM plates. Note: OP50 can be aliquoted in 50 ml conical tubes and stored at 4 °C for ∼4-6 weeks.\nRNAi",
    "Feeding is one of the main ways to perform RNA mediated interference (RNAi; to knockdown a specific gene product) in C. elegans. C. elegans hermaphrodites can be fed E. coli strain HT115 transformed with a feeding vector that expresses dsRNA upon induction. This dsRNA (or its fragments) is transmitted to the gonad, usually resulting in substantial knockdown of the specific gene target.\n\t\nRNAi Plates\n\t\t\nPrepare NGM plates as described above (see Section 1.1.1), but also add 1 ml of 1 M IPTG (isopropylthio-beta-D-galactoside; to induce the expression of dsRNA) and 500 μl of 50 mg/ml ampicillin (Amp; the vectors expressing dsRNA are Amp-resistant) to the warm media (45-50 °C).\nAfter the plates have dried, seed them with ~50-100 μl of E. coli HT115 (see Section 1.2.2). Note: Unseeded plates can be stored at 4 °C for ~4-5 weeks.\nLet the seeded plates dry overnight at room temperature.\nThe next day, turn the dried RNAi plates upside down and store them in a plastic storage container at 15-20 °C. Note: Seeded plates retain RNAi efficiency for up to ∼2-3 weeks.\nRNAi Food\n\t\t\nUse E. coli  HT115 (from the CGC; see Section 1.1.2) transformed with the feeding vector L4440, or L4440 containing cDNA to a gene of interest. Note: Feeding libraries that target the majority of open reading frames in the genome have already been made and are available (clones in L4440 transformed into HT115; e.g. containing a fragment from Y49E10.19 for ani-120-21; http://www.gurdon.cam.ac.uk/~ahringerlab/pages/rnai.html). Note: HT115 can be kept as glycerol stocks at -80 °C (ratio 1:1 in 50% v/v glycerol).\nTo generate a new construct targeting a gene of interest, see the L4440 vector map and clone cDNA between the flanking T7 promoters, which are inducible by IPTG.",
    "Transform HT115 with the L4440 construct using a standard protocol for transformation (e.g. make chemically competent bacteria and perform heat shock transformation).\nAs described for OP50 (see Section 1.1.2), streak bacteria from the glycerol stock on an LB agar plate, but the plate should also contain 50 μg/ml of Ampicillin. Note: If using a pre existing L4440 construct, skip Sections 1.2.2.2-1.2.2.3.\nPick a single colony and inoculate 5 ml of LB media containing 5 μl of ampicillin from a 50 mg/ml stock (LB Amp), and place it at 37 °C with shaking.\nAfter ~16 hr, inoculate 5 ml of fresh LB Amp media with 50 μl of the O/N culture and grow the culture for 7-8 hr with shaking at 37 °C.\nCentrifuge the bacteria for 1 min at 4,000-8,000 x g, discard the supernatant and resuspend the pellet in 500 μl of fresh LB Amp media.\nUse this bacterial solution to seed the RNAi plates as described above (see Section 1.2.1). Note: HT115 should be used immediately and should not be stored.\n2. Cultivating Worm Strains\nMaintain C. elegans strains ordered from the CGC on NGM plates according to standard protocol1. Strains used for this protocol include: C. elegans var Bristol, wild-type (strain ID at CGC N2); unc-119(tm4063); wgIs102 [ham-1::TY1::EGFP::3xFLAG + unc-119(+)] (strain ID at CGC OP102); unc-119(ed3); ltIs44pAA173 [pie-1p-mCherry::PH(PLC1delta1) + unc-119(+)] (strain ID at CGC OD70); ajm-1(ok160); jcEx44 [ajm-1::GFP + rol-6(su1006)] (strain ID at CGC SU159); unc-119(ed3); xnIs96 [pJN455(hmr-1p::hmr-1::GFP::unc-54 3’UTR + unc-119(+)] (strain ID at CGC FT250).\nPick ~3 young adult hermaphrodites that display the correct phenotype to a fresh NGM plate. Note: N2 (var. Bristol; wild-type) can be maintained between 15-25 °C, but they will reach density faster at higher temperatures. New stocks should be made when the worm density is high.",
    "Keep all fluorescent strains (e.g. GFP and/or mCherry-expressing worms) at 20-25 °C for optimal expression of fluorescent proteins. New stocks should be made when the worm density is high and food is low.\nTo pick worms, use a pick made from a pulled glass pipette with a platinum wire fused at the pulled end (~3-5 cm in length). Flatten the wire with a smooth edge. Use the pick to ‘scoop’ up hermaphrodites and transfer them onto new plates. Flame the wire in between use to avoid cross contamination of strains.\n3. RNAi\nPerforming RNAi\n\t\nFirst, place ~8 L4 hermaphrodites on an unseeded NGM plate for ~30-60 min to remove the OP50 bacteria from the worms.\nThen place the 8 hermaphrodites onto an NGM Amp IPTG plate seeded with HT115 that carries the L4440 plasmid expressing dsRNA to a gene of interest (e.g. ani-1; see 1.2) for ~24 hr. Note: Depending on the gene of interest, or the desired phenotypes (which may depend on the strength of knockdown), worms can be left on the RNAi plates for shorter or longer periods of time (after 24 hr, place the hermaphrodites on fresh RNAi plates).\nFor a negative control, place worms on an RNAi plate seeded with HT115 carrying the empty L4440 vector. Note: These embryos should have no phenotypes.\nFor a positive control, place worms on an RNAi plate expressing dsRNA that targets a gene with well-characterized phenotypes. Note: For rho-1 (Y51H4A.3), embryos are 100% lethal after 24 hr and hermaphrodites are sterile after 48 hr.\nRNAi Efficacy",
    "The levels of knockdown by RNAi should be tested, particularly since some tissues may be more resistant than others. During early mid embryogenesis, most tissues are RNAi-sensitive, but in the late embryo or larva, neurons are RNAi-resistant. Different strains can be used to improve RNAi sensitivity (e.g. rrf-3), or to generate tissue-specific RNAi (e.g. sid-1 in combination with a transgene expressed by the neural promoter unc-119).\n\t\nWestern Blotting\n\t\tImmunoblotting using C. elegans proteins can be performed according to standard protocol22.\n\t\t\nAfter performing RNAi, collect ~10 gravid (filled with embryos) hermaphrodites in a microcentrifuge tube, add 20-30 μl 1x SDS-PAGE sample buffer and lyse by boiling for ~ 2 min. Similarly, collect N2 worms in a separate tube for the control sample. Note: The number of hermaphrodites may vary depending on the sensitivity of the primary antibodies.\nCreate dilutions of the control sample (e.g. 3-100%) in sample buffer. Load the control and RNAi samples and run by SDS-PAGE as per standard protocol (the % gel will vary depending on the size of the protein of interest).\nTransfer the gel to a membrane and perform immunoblotting as per standard protocol. Note: Use different primary and secondary antibody dilutions as recommended for each antibody.\nDevelop (e.g. if using chemiluminescence) or scan (e.g. if using fluorescence) the immunoblot and compare the density of bands in the N2 lanes vs. the RNAi lane, and determine the level of knockdown (e.g. the density of the RNAi lane matches the 12% control lane, this suggests that the protein is reduced by 88%). Note: To see the efficiency of ANI-1 knockdown, see Maddox et al.23\nImmunostaining\n\t\tImmunostaining in C. elegans can be performed according to standard protocol22.",
    "After performing RNAi, collect gravid hermaphrodites and harvest embryos using one of two methods. For one of the methods, place hermaphrodites in M9 buffer (recipe in table of reagents/materials) in 1.5 ml siliconized microcentrifuge tubes and pellet via centrifugation (1,000-4,000 x g). Note: Similarly collect N2 gravid hermaphrodites.\nRemove the M9 solution.\nExpel embryos by adding 1 ml of bleaching solution (1 M NaOH, 5% bleach) to the microcentrifuge tube for 3 min. Similarly, bleach N2 hermaphrodites to make control slides.\nVortex gently, then immediately pellet the embryos via centrifugation (4,000-8,000 x g) and remove the bleaching solution. Note: The total time that the worms are incubated with bleach should not exceed 5 min.\nWash the embryos 3x with Tris Buffered Saline (TBS; 50 mM Tris pH 7.5, 150 mM NaCl) and transfer embryos using a glass Pasteur pipette onto a poly-L-lysine-coated microscope slide. Note: To coat a glass microscope slide with poly-L-lysine, first wipe the slide, then add a drop (~20-30 μl) of poly-L-lysine and spread it evenly across the surface and let dry. For optimal results, coat the slides two more times. An alternative method to collect embryos (Sections 3.2.2.1-3.2.2.5) is to place a drop of M9 onto a poly-L-lysine-coated microscope slide and pick ~10 gravid hermaphrodites into the drop.\nAdd a coverslip on top of each microscope slide (to the area that contains most of the embryos) and place the slides in liquid nitrogen. Note: For hermaphrodites placed directly into the drop, put pressure onto the coverslip to break open the hermaphrodites and expel the embryos.\nFreeze-crack the embryos by flicking off the coverslips immediately after freezing them in liquid nitrogen.",
    "Place the slides in ice cold methanol for 20 min to fix the embryos. Note: For some antigens, a crosslinking fixative such as paraformaldehyde may be preferable. See the protocol from Duerr22.\nRehydrate and permeabilize the embryos by washing the slides 4x with Tris Buffered Saline containing Tween-20 (TBST; 50 mM Tris pH 7.5, 150 mM NaCl, 0.1% Tween-20) for 10 min  each.\nDry each slide around the area that contains most of the embryos and draw a circle around the embryos using a liquid blocking pen (e.g. PAP pen).\nAdd ~100 μl of TBST with 5% normal donkey serum (NDS; block) to each slide (circled area) and incubate for 20 min at RT. Note: Place the slides in a ‘wet chamber’ (e.g. a dish with a lid containing wet paper towels).\nRemove the block, add ~50-100 μl of primary antibodies (diluted in TBST) to each slide (circled area) and incubate for 2 hr at RT. Note: Depending on the antibody, the dilution and incubation time may vary. To detect GFP, we use an anti-mouse anti-GFP primary antibody in a 1/200 dilution. To detect ANI-1, we use an anti-rabbit anti-ANI-1 primary antibody in a 1/1600 dilution (kindly provided by Amy Shaub Maddox, UNC Chapel Hill). For longer incubation times, place slides at 4 °C.\nRemove primary antibodies (if possible, keep for future use) and wash slides 3x with TBS for 5 min each.\nRemove the last wash and add ~50-100 μl of secondary antibodies (diluted in TBST) to each slide (circled area) and incubate for 2 hr at RT. Note: Depending on the antibody, dilution may vary. To detect GFP, we use an anti-mouse Alexa Fluor 488 secondary antibody in a 1/250 dilution. To detect ANI-1, we use an anti-rabbit Alexa Fluor 568 secondary antibody in a 1/250 dilution.",
    "Remove secondary antibodies and wash slides 3x with TBS for 5 min each. Note: To stain DNA, add ~50-100 μl of DAPI (4’,6-diamidino-2-phenylindole; 1 mg/ml) at 1/500 dilution in TBST for 5 min.\nRemove DAPI and wash slides 2x with TBS for 5 min each. Note: If DAPI staining is not performed, skip this extra washing step.\nPerform one quick wash with 0.1M Tris (pH 9), remove and add ~15 μl of mounting media prewarmed to 37 °C (4% n-propyl 3.4.5-trihydroxybenzoate (propyl gallate), 50 mM Tris, pH 9 in 50% glycerol) to each slide (circled area).\nAdd a coverslip to each slide (on top of the mounting media in the circled area), wick off the excess liquid and seal the slides with nail polish. Note: Slides can be stored at -20 °C.\nObserve the embryos on the slides using a widefield fluorescent microscope or laser scanning confocal microscope. Importantly, adjust the settings to collect images of optimal pixel intensity using control (N2 or non-RNAi) embryos. Then, collect images from RNAi embryos using the same settings. Examples of images collected for control vs. ani-1 RNAi embryos are shown in Figure 2B.\n4. Preparation of Slides for Live Imaging and Harvesting Embryos\nPreparation of agarose pads for live imaging\n\t\nPlace a clean, pre warmed microscope slide between two other slides, each with 1-2 strips of tape on them.\nUsing a glass Pasteur pipette, add one drop of 2% w/v agarose (dissolved in heated distilled water) to the slide.\nQuickly place a second, clean microscope slide on top of the first slide in a perpendicular manner to flatten the agarose drop. Note: The tape on the neighboring slides provides the thickness for the pad.",
    "Let the agarose pad dry for a 1-2 min before removing the top slide. Slide off the top slide carefully to avoid breaking the agarose pad underneath. Note: Sometimes the pad is transferred to the top slide and is still usable, as long as it remains intact.\nTransfer the embryos onto the agarose pad within a few minutes after its preparation as described below (see step 4.2). Note: The pad should have an opaque appearance; once it is clear, it is too dry to use.\nHarvesting embryos\n\t\nUse the following protocol for collecting embryos for live imaging, which is derived from Sulston et al.24\nPick approximately 4-6 gravid adults (not starved) from NGM or RNAi plates and place them in 20-30 μl of M9 buffer in a well on a depression slide.\nUse a sterilized scalpel to cut the worms on either side of the spermatheca (or alternatively near the vulva) to release embryos into the solution.\nUse a rubber hose with a mouth piece connected to a glass capillary/pipette pulled to have a small bore and suction the embryos by mouth pipetting. Alternatively, collect embryos with a capillary glass tube that is attached to a Pasteur pipette rubber bulb.\nTransfer the suctioned embryos to a second well also containing M9 buffer, to help separate them from the worm debris.\nThen, suction the embryos onto a freshly prepared agarose pad (see step 4.1).\nClump embryos together using an eyelash (glued to a tooth pick) to increase the number of embryos that can be filmed in one x, y plane. Note: To avoid oxygen deprivation, do not clump more than 10 embryos together.",
    "Next, cover the slide with a coverslip and partially seal it with pre heated liquid VALAP (petroleum jelly, lanolin and paraffin; melted and combined 1:1:1) to prevent dehydration of the embryos during imaging. Note: Additional M9 buffer can be added to the pad to ensure that embryos have sufficient liquid for imaging. In place of VALAP, petroleum jelly can be used to partially seal coverslips, but it is less rigid causing the coverslips to slip and could get onto the microscope objectives.\n5. Live Imaging\nTo visualize neuroblasts, obtain a worm strain that expresses a neuroblast-specific protein attached to a fluorescent protein (e.g. HAM-1:GFP, strain ID at CGC OP102). To detect cell membranes, use a worm strain that also expresses a protein domain that recognizes lipids attached to a different fluorescent protein (e.g. mCherry:PH, strain ID at CGC OD70).\nHarvest embryos from fluorescent hermaphrodites kept on control or ani-1 RNAi plates (see Protocols 3 and 4), and prepare slides as described above (see Protocol 4).\nImage embryos in 4D (x, y, z and time-lapse) by epifluorescence microscopy. Use either a widefield system [automated fluorescent microscope with filters for GFP and TexasRed, objectives up to 60X or 100X, a high resolution CCD (charge coupled device) camera, highly motorized stage (e.g. Piezo Z) and specialized acquisition software] or a livescan swept field confocal microscope [automated fluorescent scanning microscope with 488 nm and 561 nm lasers, objectives up to 100X, an EMCCD (electron multiplying CCD) camera, highly motorized stage (e.g. Piezo Z) and specialized acquisition software]. Note: For the widefield system, using LEDs and an EMCCD camera will limit phototoxicity. Also, a spinning disk confocal microscope can be used in place of the swept field system.",
    "To image neuroblast cell division on either system, find x, y frames of embryos using the 10X or 20X objectives, and choose an optimal x, y frame where the embryos are undergoing dorsal intercalation (step prior to ventral enclosure; Figure 1A) or are at early stages of ventral enclosure (∼350 min after the first cell division; Figure 1A).\nOn the swept field microscope, use the 488 nm and 561 nm 100 mW lasers at 40% power with a slit of 50. On the widefield system, use the GFP and TexasRed filters with low-medium light intensity (if controllable). Note: For the widefield system, LEDs have low phototoxicity and are preferable.\nOn either system, use the 60X or 100X oil immersion objectives and collect 20 Z-stacks of 0.2 μm every 2 min for a total of 10 min. Note: Although the HAM-1:GFP and mCherry:PH probes express at relatively high levels, the exposure times for each probe will have to be optimized for different microscopes. Note: For the widefield system, fewer Z-stacks are recommended to limit phototoxicity and for imaging over longer periods of time, use fewer time points.\nTo minimize phototoxicity caused by the exposure of embryos to UV light on the widefield system (if using a mercury bulb), close the aperture to 30% and decrease the light intensity (using an adjustable illumination system). Note: Although gain is not needed using either system, other microscopes may have light sources with lower intensities or objectives with different numerical apertures, which could require the use of gain to obtain images of optimal pixel intensity. Test the conditions using a control embryo to ensure that any observed phenotypes are not due to artifactual phototoxicity.\n6. Analysis of Microscopy Data",
    "To analyze the images, export files as TIFFs and open the TIFFs as a stack using specialized software such as a Java based image processing program (e.g. ImageJ, NIH, http://rsbweb.nih.gov/ij/). Note: Depending on the acquisition software used to collect the images, the files can be kept in their original form and opened in ImageJ. This is preferable as the metadata is kept with the files.\nSeparate the stack into ‘images’ and select time points and Z-planes as desired. Note: Although a stack of 20 Z-planes is taken, many of the neuroblasts are <1 μm thick during mid late embryogenesis and only a few Z-planes are needed.\nRestack the selected Z planes for each time point and make separate Z-stack projections. Then, stack the projections for each time point together to make a time sequence.\nMake adjustments to the brightness/and or contrast for each channel.\nThen, select a region of interest, crop (and rotate if necessary) the region.\nCreate merged images using the ‘merged channels’ function and choose a different color for each channel. Convert merged images to RGB.\nInvert grayscale images for each channel from steps 6.3 or 6.4 (use ‘invert’ function under ‘edit’) to visualize images more clearly.\nSave all final images as 8-bit TIFFs to make figures in vector based software programs or as Quicktime files to make movies.\nIf measurements of pixel size are needed (e.g. to include a scale bar with the images), use ImageJ, or other image processing software to measure the size of the embryo. Note: Images collected using different objectives will have different pixel sizes.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}