{
  "id": 10126,
  "origin_website": "Jove",
  "title": "Viscoelastic Characterization of Soft Tissue-Mimicking Gelatin Phantoms using Indentation and Magnetic Resonance Elastography",
  "procedures": [
    "1. Gelatin phantom preparation\nWeigh gelatin, glycerol, and water according to Table 1. Mix the gelatin powder with water to obtain the gelatin solution.\n\tNOTE: The concentrations of the individual components for preparing the two phantoms are shown in Table 1. The higher the concentration of gelatin, the stiffer the phantom.\nHeat the gelatin solution to 60 °C in a water bath. Add glycerol to the gelatin solution while maintaining the temperature.\n\tNOTE: Glycerol stabilizes gelatin mixtures by increasing their melting temperature and shear modulus17.\nStir the solution and heat it to 60 °C again. Pour the mixed solution into a container that will be used for MRE and indentation tests. Cool the solution to room temperature and wait till the solution is solidified.\n2. MRE test\nPut the vibration plate on top of the gelatin phantom. Ensure that the contact between the phantom and the vibration plate is firm (Figure 1A).\n\tNOTE: The vibration plate is made of Polyamide with a dimension of 50 x 50 x 5 mm3.\nPlace the gelatin phantom into the head coil. Put sponges and sandbags around the gelatin phantom to make sure the phantom is firmly placed. Use a custom-built electromagnetic actuator with a transmission bar14,18. Mount an electromagnetic actuator on the head coil. Connect the transmission bar to the vibration plate (Figure 1B).\nConnect the power lines of the actuator with the amplifier. Connect the control lines with the controller (Figure 1C).\nActuator and MRI scan parameter settings\n\t\nSet the waveform, vibration frequency, and amplitude in the function generator. Set the desired vibration amplitude by adjusting the power amplifier.",
    "NOTE: Here, the waveform is set to sinusoidal in the function generator; the vibration frequency is set to 40 Hz or 50 Hz, and the amplitude is set to 1.5 Vpp. In the power amplifier, the amplification ratio is set to 40%.\nSet the function generator to work in the trigger mode. Connect the trigger line to the external trigger port of the MRI machine.\nSet the MRE scanning (actuator) frequency the same as that from the function generator, so that the motion encoding gradient is synchronized with the motion of the vibration plate.\nData measurement and analysis\n\t\nFollow the routine imaging positioning procedures. Use a 2D gradient-echo (GRE) based MRE sequence for imaging of the gelatin phantom20. Set the GRE-MRE imaging parameters as follows: Flip-angle = 30°; TR/TE = 50/31 ms; Field-of-view = 300 mm; Slice thickness = 5 mm; Voxel size = 2.34 x 2.34 mm2.\nMeasure the phase images at four temporal points in one sinusoidal cycle. Apply both positive and negative motion encoding gradients at each time point.\nBased on the phase image acquired, remove the background phase by subtracting the positive and negative encoded phase images. Unwrap the phase with a reliability sorting-based algorithm21.\nExtract the principal component of the motion by applying fast Fourier Transform to the unwrapped phase images. Filter the phase image with a digital bandpass filter. Estimate the shear modulus with a 2D direct inversion (DI) algorithm to obtain storage modulus G' and loss modulus G''13,14.\n\t\t​NOTE: The cut-off frequency of the bandpass filter is [0.04 0.08]. The size of the fitting window of the DI algorithm is 11 x 11.\n3. Indentation test",
    "Use a circular punch or surgical blade to trim the gelatin phantom into a cylindrical or cuboid sample, respectively. Make sure that the sample thickness is between 3 and 10 mm and the diameter of the cylindrical sample or the long side of the cuboid is larger than 4 mm. Use a sharp blade to trim the surface of the sample to make it as smooth as possible for indentation.\nTurn on the power of the indentation tester. Perform the following using the indenter control program designed to automate the indenter contact procedure (custom program; see Table of Materials).\n\t\nClick on the Back off button in the GUI to initialize the calibration process (Figure 2B). Read the value from the laser sensor and type the value in the BaseLine box.\n\t\tNOTE: During the calibration process, the distance between the laser sensor and the baffle plate is adjusted to a specific pre-defined value.\nPlace a glass slide on the baffle plate and record the value shown by the laser sensor. Next, put the sample on the glass slide and place them together on the baffle plate. Read the value from the laser sensor and type this value in the Sample+Slide box.\n\t\tNOTE: The laser sensor is used to record the displacement of the indentation, but it is also used to measure the sample thickness before the test.\nTake the difference between the two values obtained in step 3.2.2 as the sample thickness at the region of interest (ROI).\nCarefully place the sample along with the underlying glass slide right below the indenter, and then click on the Contact button to initiate automatic contact between the indenter and the sample surface.",
    "NOTE: If the automatic contact is not satisfactory, i.e., the indenter presses deep into the sample or does not have a contact, adjust the indenter position by typing a value in the range of 0.05-0.1 mm in the Offset box and repeat steps 1.2.1-1.2.4.\nBased on the measured sample thickness (step 3.2.3), estimate the indentation displacement (i.e., total indentation depth) by multiplying the thickness with the indented testing strain (here, it is set to ≤8% to keep the indentation within the small strain assumption).\nType the displacement values (step 3.2.5) in the Displacement (mm) box. Set the relaxation time to 180 s in the Dwell Time box. Click on the Indentation button. The displacement and reactive force during the ramp-hold procedure will be automatically recorded and saved in a file at the specified File Path.\n\t\tNOTE: The File Path can be pre-defined as the path for saving testing data.\nExport the indentation data to a spreadsheet. Use a two-term Prony series imgsrc://cloudfront.jove.com/files/ftp_upload/63770/63770eq01.jpg to fit the force relaxation curve1,3,11:\nimgsrc://cloudfront.jove.com/files/ftp_upload/63770/63770eq02.jpg\nEstimate the instantaneous shear modulus (G0) and long-term shear modulus (G∞) based on the fitted parameters:\nimgsrc://cloudfront.jove.com/files/ftp_upload/63770/63770eq03.jpg\n\tNOTE: In the above equations, C0, Ci, and τi are model parameters of the Prony series, F is the indentation force, R is the radius of the indenter, X is the compensation factor for the infinite half space assumption, V is the indentation velocity, t is the time variable, and tR is the ramp time.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}