{
  "id": 7457,
  "origin_website": "Bio",
  "title": "Extraction and Electrophoretic Analysis of Bacterial Lipopolysaccharides and Outer Membrane Proteins",
  "procedures": [
    "Bacterial cultureNote: The culture procedure should be optimized for the bacterium used in the study. The final growth phase for LPS and PEOM extraction should be determined based on the purpose of the study. In general, bacteria grown to at least mid-log phase are preferable for the extraction of LPS and PEOM. Prepare a starter culture at an OD600 of 0.8 by inoculating the bacteria freshly isolated from an agar plate into 5 ml of suitable broth in a Nephelo culture flask for LPS extraction, or 25 ml of broth for extraction of PEOM.Dilute the starter culture 1:20 into 5 ml or 200 ml of fresh broth for LPS extraction or PEOM extraction, respectively.Incubate at 37°C at 180 rpm in an incubator shaker for 3 to 4 h, or until the bacteria reach mid-log phase (approximately 109 CFU/ml for Histophilus somni and some Pasteurellaceae bacteria).Transfer 2 ml of the culture to a microcentrifuge tube and proceed to section B for LPS extraction, or utilize the 200 ml of culture for PEOM extraction (section C).Extraction of LPS/LOS using the hot phenol-water microextraction method (Inzana, 1983)Centrifuge 2 ml of the above bacterial suspension in a microcentrifuge tube at 10,000 × g for 5 min at 4°C.Discard the supernatant and wash the pellet once with 1 ml of PBS.Resuspend the washed cells in 300 μl of distilled water and transfer the suspension to a 1-fluid dram glass vial (or similar) containing a micro stir bar (1/16 × 5/16 inch).Add an equal volume of 90% phenol (pre-warmed to 65-70°C is preferable, but not required) to the bacterial suspension.Place the vials in a beaker of water on a hot plate/stir plate set to 65-70°C.",
    "The water should be no higher than half the length of the vials, and multiple vials can be secured together with a rubber band to prevent tipping.Stir the mixture vigorously at 65-70°C for 15 min.Chill the mixture in the vial on ice only enough to cool to about 15°C and transfer the mixture to a 1.5-ml microcentrifuge tube.Centrifuge at 10,000 × g for 10 min at 15°C.Carefully transfer the supernatant to a 15-ml conical centrifuge tube and set the tube aside.Transfer the phenol phase back into the glass vial.Add 300 μl of water to re-extract the phenol phase and repeat Steps B5 to B9.Pool the aqueous phases in the 15-ml conical centrifuge tube.Adjust the sodium concentration of collected aqueous phases to ~0.5 M by adding one tenth volume of 5 M NaCl.Add 5-10 volumes of cold (-20°C) 95% ethanol to precipitate the LPS and mix the solution thoroughly.Maintain the mixture at -20°C for at least 6 h or overnight.Centrifuge the mixture at 2,000 × g for 10 min at 4°C.Aspirate the ethanol under vacuum with a pasteur pipette until the tube is dry. Tip the tube to the side with the pellet side up so you do not have to get the pipette tip too close to the pellet.Suspend the opaque pellet in 100 μl of distilled water.Transfer the 100 μl of suspension to a 1.5-ml microcentrifuge tube.Repeat Steps B14 to B18 for a second round of precipitation with ethanol.Suspend the precipitate with 50 μl of distilled water.Store the sample at -20°C. Samples may be stored as aliquots to avoid repeated freeze-thawing.Extraction of protein-enriched outer membranes (PEOM)Note: All steps for extraction of PEOM should be performed at 4°C with protease inhibitor.",
    "Centrifuge the 200 ml of bacterial suspension in a 250-ml bottle at 10,000 × g at 4°C for 15 min.Wash the pellet twice in 30 ml of 0.05 M Tris buffer, pH 7.8, containing 2 mM MgCl2 (freeze pellets at -20°C if stopping here).Resuspend the pellet in 25 ml of 10 mM HEPES buffer, pH 7.4, containing protease inhibitor (follow the manufacture’s instruction for the working concentration), and 20 μg/ml each of DNase I and RNase A.Sonicate the suspension in a 50-ml beaker of ice for 12 bursts of 15 s each, with at least one minute of incubation on ice between each burst (keep below 10°C). Alternatively, two passages through a French Press can be used to lyse the cells (8,000 lbs/in2).Transfer the resultant sample into 50-ml conical tubes.Centrifuge at 12,000 × g for 5 min to remove unbroken cells.Transfer the supernatant to ultra-centrifuge tubes.Centrifuge the supernatant at 255,000 × g for 60 min (this yields a total membrane preparation including the IM, peptidoglycan, and OM).Resuspend the pellet in 1 ml of 10 mM HEPES buffer.Homogenize the pellet suspension with a 1-ml syringe using an 18-G, then 20-G, then 22-G needle until thoroughly resuspended. Covering the end of each needle with tubing will prevent scratching the tube (as shown in the graphic abstract). Take care to avoid sudsing.Place aside 0.1 ml of the suspension in a 1.5-ml microcentrifuge tube and freeze at -20°C (do this only once).Transfer the remaining homogenized suspension into ultracentrifuge tubes (~10-ml size).Fill to the top of the tube with 10 mM HEPES buffer containing 2% sodium lauryl sarcosinate. Seal the tubes and tip back-and-forth gently to thoroughly mix.Maintain the tubes at room temperature for 30 min without shaking.Centrifuge at 255,000 × g for 60 min to obtain PEOM.",
    "Remove the supernatant and overlay the pellet with 1 ml of 10 mM HEPES buffer.Repeat Steps C9 to C14, but do not remove 0.1 ml of the suspension again.Resuspend the final pellet in approximately 100-200 μl of distilled water.Dilute the sample from Step C18 to a protein concentration of 0.5-3 mg/ml, based on the result of BCA protein assay performed following the manufacturer's instructions.Aliquot the sample and store at -20°C for future use.SDS-polyacrylamide gel electrophoresis (SDS-PAGE) for LPS/LOSNote: For optimal resolution of LOS/LPS, use high quality reagents throughout the procedure and prepare fresh if indicated. Preparation of 14% separating gel (20 ml for one 18 cm × 16 cm gel with 0.75 mm spacers)Mix 9.3 ml of 30% acrylamide stock, 6.4 ml of 9 M urea, 4 ml of 1.88 M Tris buffer (pH 8.8), and 0.2 ml of 10% SDS in a vacuum flask, gently mix, and degas for 10 min.Add 0.15 ml ammonium persulfate solution (5%) and 5 μl of TEMED.Gently mix the solution and immediately dispense the separating gel solution between the glass plates to 4 cm below the top of the plate using a syringe or pipette.Overlay the gel with 0.1% SDS to a depth of a few millimeters.Allow the gel to polymerize for at least 1 h.Rinse and blot the top of the gel with filter paper after polymerization.Preparation of 3% stacking gel A (10 ml for one 18 × 16 cm gel with 0.75 mm spacers)Mix 1 ml of 30% acrylamide stock, 1 ml of 1.25 M Tris buffer (pH 6.8), 0.1 ml of 10% SDS, and 7.8 ml of HPLC-grade water in a vacuum flask and degas for 10 min.Add 0.1 ml ammonium persulfate solution (5%) and 5 μl of TEMED.",
    "Gently mix the solution and immediately dispense the stacking gel solution between the glass plates to where the bottom of the well comb will be. The bottom of the well comb teeth should just touch the top of the gel after polymerization.Allow the stacking gel to polymerize for ~2 h.Preparation of 3% stacking gel B (10 ml for one 18 × 16 cm gel with 0.75 mm spacers)Mix 1 ml of 30% acrylamide stock, 1 ml of 10× Tris/glycine running buffer lacking SDS, 0.1 ml 10% SDS, and 7.8 ml of HPLC-grade water.Place solution in a vacuum flask and degas for 10 min.Insert the comb chosen for the run about half-way between the glass plates.After degassing, add 0.1 ml ammonium persulfate solution (5%) and 5 μl of TEMED to the acrylamide solution.Gently mix the solution and immediately dispense the stacking gel solution between the glass plates.The teeth of the comb should just touch the top of stacking gel A when fully inserted.Allow the stacking gel to polymerize for ~2 h.The comb can be removed, the wells filled with 1× running buffer, and the gel stored overnight at 4°C after wrapping in plastic wrap.Alternatively, only stacking gel A can be used, but resolution of the bands will be reduced.Preparation of LPS/LOS samplesAdd 1-10 µg (depending on the number of bands) of purified LPS/LOS sample or 5 μl of the micro-extract (prepared as above), and dilute to a volume of 10 µl with HPLC-grade water.Note: If the LPS/LOS gel is overloaded or the development is allowed to proceed for too long, the bands will be obscured, and a smear will form. Normally, 10-12 μg of LPS or 2-3 μg of LOS per well is ideal.",
    "If 5 μl of extracted sample is too much or too little, the volume for each sample should be adjusted for a second gel run. Over-development can be prevented or reversed somewhat by addition of 5% acetic acid, but this will also make the bands yellow. Add an equal volume of 2× solubilization buffer.Boil the samples for 5 min by using a floating pad to secure the samples and placing in a beaker of water on a hot plate set to 100°C.ElectrophoresisRemove the comb and rinse the sample wells with 1× SDS Tris/glycine running buffer, and then fill with the same buffer.Add samples carefully, allowing them to sink to the bottom, and not spilling over into other wells.Place gels into the electrophoresis chamber.Fill the upper (first) and then lower reservoir with cold (4°C) 1× SDS Tris/glycine running buffer. Two liters is the minimum, 4 L is preferred.Run the gel at 9 mAmp/gel constant current through the stacking gels, then at 12 mAmp/gel through the separating gel. The total run time will be about 5 h.When the dye front reaches the bottom of the separating gel, stop the electrophoresis.SDS-PAGE for PEOMsPreparation of protein samplesAdd the PEOM sample to the desired concentration (1-10 µg depending on the number of bands) and dilute to a maximum volume of 7.5 µl (5 μl is preferred) with HPLC-grade water.Add an equal volume of 2× solubilization buffer.Boil the samples for 10 min by using a floating pad to secure the samples and placing in a beaker of water on a hot plate set to 100°C.ElectrophoresisRemove the comb from a commercial 4-12% Bis-Tris gel and rinse the sample wells with distilled water.Place gels into the electrophoresis chamber.Fill the upper buffer chamber and the wells with 1× SDS-Tris/glycine running buffer.",
    "Add samples allowing them to sink to the bottom.Fill the lower buffer chamber with 1× SDS-Tris/glycine running buffer.Run the gel at 180 V constant voltage.When the dye front reaches the bottom of the gel, stop the electrophoresis.Silver staining for LPS/LOS gelsRemove the gel from between the glass plates.Fix the gel in a glass dish with 200 ml of fixative overnight at room temperature covered with plastic wrap; shaking is not required.Discard the fixative.Oxidize the gel in 200 ml of oxidizing solution (made fresh) in the dark by covering the dish with aluminum foil to minimize light exposure.Rotate the dish rapidly (~70 rpm) for 5 min.Discard the oxidizing solution and wash the gel 3 times by rotating slowly with 1 L of distilled water for 15 min each.Prepare the silver stain reagent during the last wash.Dissolve 1 g of silver nitrate into 5 ml of distilled water.In a separate 500-ml flask, add 2 ml of NH4OH to 28 ml of 0.1 M NaOH to make the NaOH/NH4OH solution.While gently shaking, slowly add all the silver nitrate solution dropwise to the NaOH/NH4OH solution. A brown precipitate forms and then becomes clear.Add 115 ml of distilled water. (At this point, the reagent should be perfectly clear. If the solution remains brown, do not use it, and make up again with fresh NH4OH.)Discard the last wash, add the silver stain reagent to the gel, and shake rapidly (~70 rpm) for 10 min.Pour the silver stain reagent into a flask and precipitate with a small amount (large pinch) of CaCl2 before disposing.Wash the gel 3 times with 1 L of distilled water for 10 min each.Discard the last wash and add 200 ml of the developer solution.Stop the reaction just before optimal development by rinsing the gel in cold water.",
    "If over-development occurs, the gel can be destained with 5% acetic acid, but the bands may yellow.Store cold, but photograph or scan as soon as possible.Coomassie blue staining for protein gelsRemove the gel from the cassette and place in a clean tray.Wash the gel three times for 5 min each using distilled water with gentle agitation.Discard the last wash.Add a sufficient volume of the Page Blue protein staining solution to cover the gel.Incubate at room temperature for 60 min with gentle agitation.Discard the staining solution and rinse the gel two times with distilled water.Wash the gel three times for 5 min each using distilled water with gentle agitation (or wash more times until the background becomes clear).Store cold until ready to photograph."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}