{
  "id": 17376,
  "origin_website": "Jove",
  "title": "MS2-Affinity Purification Coupled with RNA Sequencing in Gram-Positive Bacteria",
  "procedures": [
    "1. Buffers and media\nFor MAPS experiments, prepare the following buffers and media:\n\t- Buffer A (150 mM KCl, 20 mM Tris-HCl pH 8, 1 mM MgCl2 and 1 mM DTT)\n\t- Buffer E (250 mM KCl, 20 mM Tris-HCl pH 8, 12 mM maltose, 0.1% Triton, 1 mM MgCl2 and 1 mM DTT)\n\t- RNA loading buffer (0.025% xylene cyanol and 0.025% bromophenol blue in 8 M urea)\n\t- Brain Heart Infusion (BHI) medium (12.5 g of calf brain, 10 g of peptone, 5 g of beef heart, 5 g of NaCl, 2.5 g of Na2HPO4 and 2 g of glucose for 1 L)\n\t- Lysogeny Broth (LB) medium (10 g of peptone, 5 g of yeast extract and 10 g of NaCl for 1 L)\nFor Northern blot assays, prepare the following buffers:\n\t- Blocking solution (1x maleic acid and 1% blocking reagent)\n\t- Hybridization solution (50% formamide, 5x SSC, 7% SDS, 1% blocking solution and 0.2% N-lauryl sarcosine, 50 mM sodium phosphate). Heat with agitation to dissolve.\n\tCAUTION: Carefully follow the safety precautions related to each product.\n\t- 1 M sodium phosphate (58 mM sodium phosphate dibasic and 42 mM sodium phosphate monobasic)\n\t- Saline, sodium citrate (SSC) buffer, 20x concentrate (3 M NaCl and 300 mM trisodium citrate)\n2. Safety issues \nCarry out all steps involving viable pathogenic bacteria in a level 2 containment lab.\n\tNOTE: Only cell extracts can be taken outside after lysis (step 5).\nPut on a lab coat and gloves.\nEnsure that the wrists are covered.\nClean the biological safety cabinet (Class II) with a disinfectant solution.\nDispose solid wastes exposed to bacteria in the appropriate biomedical bin.\nTreat flasks containing contaminated liquids with a disinfectant solution. Then, discard it in a sink.",
    "Carefully wash hands and wrists with soap and remove the lab coat before leaving the level 2 containment lab.\n3. Plasmid construction \nNOTE: For cloning purposes, it is crucial to first identify the boundaries of the endogenous sRNA. The pCN51-P3 and pCN51-P3-MS2 plasmids are described in Tomasini et al. (2017)27. The P3 promoter allows high expression of the sRNA in a cell-density-dependent manner (i.e., when bacteria enter the stationary phase of growth). Many staphylococcal sRNAs accumulate during this growth phase.\nAmplify the sRNA sequence by PCR using a high-fidelity DNA polymerase and a PCR machine. Carefully follow manufacturer’s instructions and read Garibyan and Avashia (2013)31 for more details.\nUse the following templates to design the specific primers:\nimgsrc://cloudfront.jove.com/files/ftp_upload/61731/text12.png\n\tand 5’-CGCGGATCC(N)-3’ for forward and reverse primers, respectively.\n\tNOTE: These oligonucleotides enable to fuse the MS2 sequence (in bold) to the 5’ end of the sRNA of interest. PstI and BamHI restriction sites (underlined) are added at the 5’ and 3’ extremities of the MS2-sRNA construct to clone the amplicon into the pCN51-P3 plasmid27. (N) corresponds to the gene-specific sequence (15-20 nucleotides).\nDigest 1 µg of pCN51-P3 plasmid and 1 µg of the MS2-sRNA PCR product with 2 U of PstI and 1 U of BamHI in the appropriate buffer according to manufacturer’s recommendations.\nIncubate 1 h at 37 °C and purify DNA using a PCR purification kit (see Table of Materials).\nMix the digested pCN51-P3 plasmid (300 ng) and MS2-sRNA amplicon (molar ratio for vector:insert = 1:3) in a 1.5 mL tube. See Revie et al. (1988)32 to maximize ligation efficiency. Add 1 µL of the Ligase Buffer and 10 U of T4 Ligase in each tube. Adjust the volume to 10 µL with ultrapure water.\nIncubate at 22 °C for at least 2 h.",
    "Add 5 µL of ligation mixture to 50 µL of frozen DH5α chemically competent E. coli cells. Read Seidman et al. (2001)33 to learn more about plasmid transformation and chemically competent cells.\nIncubate 30 min on ice.\nHeat shock (45 s at 42 °C) the transformation tube using a heat block or water bath.\nAdd 900 µL of LB medium and incubate at 37 °C for 30 min.\nPlate 100 µL of the bacterial suspension on a LB agar plate supplemented with ampicillin (100 µg/µL).  \n\tNOTE: the pCN51-P3 vector encodes an ampicillin resistance gene, which enables to select only E. coli clones carrying the pCN51-P3-MS2-sRNA plasmid.\nExtract the pCN51-P3-MS2-sRNA plasmid from an overnight bacterial culture (5 mL) grown in the presence of ampicillin (100 µg/µL) using a plasmid DNA miniprep kit (see Table of Materials).\nVerify the construct by Sanger sequencing34 using the following primer, 5’-TCTCGAAAATAATAGAGGG-3’. \nTransform the pCN51-P3-MS2-sRNA plasmid into DC10B chemically competent E. coli cells. Repeat steps 3.7 to 3.11.\nExtract the pCN51-P3-MS2-sRNA plasmid (see step 3.12) and transform 1-5 µg of plasmid DNA into HG001 ΔsRNA electrocompetent S. aureus cells using an electroporation apparatus. Carefully follow manufacturer’s instructions. Read Grosser and Richardson (2016)35 to learn more about methods for preparing electrocompetent S. aureus.\n\tCAUTION: This step involves handling of pathogenic bacteria (see step 2).\nAdd 900 µL of BHI medium and incubate at 37 °C for 3 h.\nCentrifuge 1 min at 16,000 x g. Discard the supernatant.\nResuspend the pellet in 100 µL of BHI and plate the bacterial suspension on BHI agar plates supplemented with erythromycin (10 µg/µL).  \n\tNOTE: The pCN51-P3 vector also encodes an erythromycin resistance gene, which enables to select only S. aureus clones carrying the pCN51-P3-MS2-sRNA plasmid.\n4. Bacteria harvesting\nCAUTION: This step involves handling of pathogenic bacteria (see step 2).",
    "Grow one colony of strains carrying either pCN51-P3-MS2-sRNA or pCN51-P3-MS227 plasmids in 3 mL of BHI medium supplemented with erythromycin (10 µg/µL) in duplicates.\nDilute each overnight culture in 50 mL (≈1/100) of fresh BHI medium supplemented with erythromycin (10 µg/µL) to reach an OD600nm of 0.05. Use 250 mL sterilized flasks (5:1 flask-to-medium ratio).\n\tNOTE: Medium and growth conditions should be set according to the expression pattern of the studied sRNA.\nGrow cultures at 37 °C with shaking at 180 rpm for 6 h.\nTransfer each culture into a 50 mL centrifuge tube.\nCentrifuge at 2,900 x g during 15 min at 4 °C. Discard the supernatant.\nKeep pellets on ice and directly perform mechanical cell lysis (step 5) or freeze and store pellets at -80 °C.\n5. Mechanical cell lysis \nCAUTION: Following steps must be performed on ice and buffers must be at 4 °C. Use gloves and take all precautions to protect samples from RNases.\nResuspend pellets (step 4.6) in 5 mL of Buffer A.\nTransfer the resuspended cells in 15 mL centrifuge tubes with 3.5 g of silica beads (0.1 mm).\nInsert tubes in a mechanical cell lysis instrument (see Table of Materials). Run a cycle of 40 s at 4.0 m/s.\n\tNOTE: If one cycle is not enough to break cells, let the device cool for 5 min while keeping samples on ice. Then, repeat another cycle of 40 s at 4.0 m/s. The efficiency of cell lysis can be tested by plating the supernatant on BHI-agar plate.\nCentrifuge at 15,700 x g for 15 min. Recover the supernatant and keep it on ice.\n6. Column preparation\nCAUTION: Be careful not to allow the amylose resin to dry. If needed, seal the column with an end-cap. Prepare all the solutions before starting the affinity purification.",
    "Put a chromatography column in a column rack (see Table of Materials).\nRemove the column tip and wash the column with ultrapure water.\nAdd 300 µL of amylose resin.\nWash the column with 10 mL of Buffer A.\nDilute 1,200 pmol of MBP-MS2 protein in 6 mL of Buffer A and load it into the column.\nWash the column with 10 mL of Buffer A.\n7. MS2-affinity purification (Figure 1)\nLoad the cell lysate into the column.\n\tNOTE: Keep 1 mL of the cell lysate (Crude extract, CE) to extract total RNA (step 8) and perform Northern blot (step 9) and transcriptomic (step 10) analysis.\nCollect the flow-through fraction (FT) in a clean collection tube.\nWash the column 3 times with 10 mL of Buffer A. Collect the wash fraction (W).\nElute the column with 1 mL of Buffer E and collect the elution fraction (E) in a 2 mL microtube.\nKeep all collected fractions on ice until RNA extraction (step 8) or freeze them at -20 °C for later use.\n8. RNA extraction of collected fractions (CE, FT, W and E)\nUse 1 mL of each fraction (including FT and W) for RNA extraction.\nAdd 1 volume of phenol. Mix vigorously.\n\tCAUTION: Phenol is volatile and corrosive, pay attention and work safely under a fume hood.\nCentrifuge at 16,000 x g for 10 min at 20 °C.\nTransfer the upper phase in a clean 2 mL microtube.\nAdd 1 volume of chloroform/isoamyl alcohol (24:1) and repeat steps 8.3 to 8.4.\n\tCAUTION: Work safely under a fume hood.\nAdd 2.5 volumes of cold ethanol 100% and 1/10 volume of 3 M sodium acetate (NaOAc) pH 5,2.\nPrecipitate overnight at -20 °C.",
    "NOTE: Precipitation can also be performed in an ethanol/dry ice bath during 20 min or at -80 °C during 2 h.\nCentrifuge at 16,000 x g for 15 min at 4 °C. Slowly remove ethanol with a pipette while being careful not to disturb the pellet.\n\tCAUTION: The RNA pellet is not always visible and is sometimes loose in presence of ethanol.\nAdd 500 µL of 80% cold ethanol.\nCentrifuge at 16,000 x g for 5 min at 4 °C.\nDiscard ethanol by pipetting it slowly. Dry the pellet using a vacuum concentrator, 5 min on run mode.\nResuspend the pellet in an appropriate volume (15-50 µL) of ultrapure water. Freeze the pellet at -20 °C for later use.\nAssess RNA quantity (260 nm) and quality (260/280 and 260/230 wavelength ratios) using a spectrophotometer/fluorometer (see Table of Materials). Carefully follow manufacturer’s instructions.\n\tNOTE: 3-4 µg are generally obtained in the elution fraction (E). This mainly depends on tested conditions.\n9. Analysis of MS2-affinity purification by Northern blot36\nDilute 5 µg of RNA of CE, FT, W fractions and 500 ng of E fraction in 10 µL of ultrapure water and mix with 10 µL of RNA loading buffer.\nIncubate 3 min at 90 °C.\nLoad samples into wells of an 1% agarose gel supplemented with 20 mM of guanidium thiocyanate and run the gel at 100-150 V in TBE 1x buffer at 4 °C. Read Koontz (2013)37 for more details.\nTransfer RNAs on a nitrocellulose membrane by vacuum transfer for 1h or capillarity transfer overnight.\n\tNOTE: The capillarity method is more efficient for large RNAs.\nUV cross-link RNAs on the membrane (120 mJ at 254 nm) using an ultraviolet crosslinker.\nInsert the membrane in a hybridization bottle with the RNA side facing up.",
    "Add 10-20 mL of preheated hybridization solution. Incubate 30 min at 68 °C.\nDiscard the solution and add 10-20 mL of fresh hybridization solution supplemented with 1 µL of the sRNA-specific probe. Incubate overnight at 68 °C.\n\tNOTE: The DIG-labelled RNA probe is synthetized using a DIG RNA labelling kit and following manufacturer’s instructions. Alternatively, a radiolabelled probe can be used.\nWash the membrane with 10-20 mL of wash solution 1 (2x SSC and 0.1% SDS) for 5 min at 20 °C. Repeat once.\nWash the membrane with 10-20 mL of wash solution 2 (0.2x SSC and 0.1% SDS) for 15 min at 68 °C. Repeat once.\nIncubate with 10-20 mL of blocking solution for at least 30 min at 20 °C.\nDiscard the solution and add 10-20 mL of the blocking solution supplemented with the polyclonal anti-digoxigenin antibody (1/1000), conjugated to alkaline phosphatase. Incubate 30 min at 20 °C.\nWash the membrane with 10-20 mL of the wash solution 3 (1x maleic acid and 0.3% Tween 20) for 15 min at 20 °C. Repeat once.\nIncubate the membrane with 10-20 mL of the detection solution (0.1 M Tris HCl and 0.1 M NaCl pH 9.5) 5 min at 20 °C.\nPut the membrane on a plastic film and soak it with the substrate (see Table of Materials). Incubate 5 min in the dark.\nSeal the membrane in a plastic film. Put the membrane in an autoradiography cassette.\nExpose the membrane to an autoradiography film in the dedicated dark room.\n\tNOTE: The exposition time depends on the signal strength, from few seconds to minutes.\nReveal the exposed film in an automatic developing device.\n10. Preparation of the samples for RNA sequencing \nNOTE: This step only concerns RNAs extracted from E and CE fractions.",
    "Add to each sample 10 µL of 10x DNase buffer and DNase I (1 U/µg of treated RNAs). Add water for a final volume of 100 µL.\nIncubate 1 h at 37 °C.\nExtract and purify RNAs as previously described (steps 8.2 to 8.11).\nResuspend the RNA pellet in 20 µL of ultrapure water.\n\tNOTE: The presence of remaining DNA can be checked using PCR and specific primers (e.g., 16S gene).\nAssess RNA quantity and quality using a microfluidics-based electrophoresis analysis system (see Table of Materials).\n\tNOTE: 1 µg is generally obtained in the elution fraction (E) after DNase treatment.\nRemove ribosomal RNAs with a bacterial rRNA depletion kit.\n\tNOTE: Large and abundant RNAs (i.e., rRNAs) tend to non-specifically interact with the affinity column. 500 ng of extracted RNA are required to perform this step.\nAgain assess RNA quantity and quality using a microfluidics-based electrophoresis analysis system.\nPrepare cDNA libraries with 10-20 ng of ribodepleted RNA using a cDNA library preparation kit and following manufacturer’s instructions.\nSequence the obtained libraries using a sequencing instrument (e.g., single-end, 150 bp; see Table of Materials).\n\tNOTE: 5-10 million reads per sample are generally enough.\n11. RNAseq data analysis (Figure 2)\nDownload the FastQ sequencing files from the sequencing platform.\nAccess to the Galaxy instance of Roscoff biological station (https://galaxy.sb-roscoff.fr/) and log in.\n\tNOTE: Every mentioned algorithm can be easily found using the search bar. A user guide is provided for each tool.\n\tCAUTION: The version of required tools may differ from the public Galaxy server38.\nClick on Get Data icon and then Upload File from your computer. Upload FastQ sequencing file of each MS2 control and MS2-sRNA samples. Upload also FASTA reference genome file and GFF annotation file.\nRun FastQC Read Quality reports (Galaxy Version 0.69).",
    "NOTE: This tool provides a quality assessment of raw sequences (e.g., quality score, presence of adapter sequences).\nRun Trimmomatic flexible read trimming tool (Galaxy Version 0.36.6) to notably remove adapter sequences and poor-quality reads. Indicate adapter sequences used for library preparation (e.g., TruSeq 3, single-ended). Add the following Trimmomatic operations: SLIDINGWINDOW (Number of bases=4; Average quality=20) and MINLEN (Min length of reads=20).\nRun again FastQC Read Quality reports (Galaxy Version 0.69).\nRun Bowtie2 - map reads against reference genome (Galaxy Version 2.3.2.2). Use the Genome Reference FASTA file from the history to map reads with default settings (very sensitive local).\n\tNOTE: BAM file generated by Bowtie2 tool can be visualized using the Integrative Genomics Viewer (IGV). Associated BAI file will also be required.\nOptionally, Run Flagstat which compiles stats for BAM dataset (Galaxy Version 2.0).\nRun htseq-count - Count (Galaxy Version 0.6.1) which aligns reads overlapping features in the GFF annotation file. Use the Intersection (non-empty) mode.\nArchive all raw counts files from htseq-count analysis into a single Zip file.\nRun SARTools DESeq2 to compare data (Galaxy Version 1.6.3.0). Provide the Zip file containing raw counts files and the design file, a tab delimited file describing the experiment. Carefully follow provided instructions to generate the design file.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}