{
  "id": 9769,
  "origin_website": "Jove",
  "title": "Focal Cerebral Ischemia Model by Endovascular Suture Occlusion of the Middle Cerebral Artery in the Rat",
  "procedures": [
    "MCAO Rat Model\nPresurgical Preparations\nAseptic technique should be used for all survival surgical procedures. Disinfect the surgical work surface with commercial disinfectant and prepare sterile surgical packs of instruments, drapes, gauze, swabs, sutures, and scalpel blades by autoclaving. A surgical mask, hair bonnet and sterile gloves should be worn. A Germinator dry bead sterilizer is also used to resterilize surgical instruments between procedures if multiple rat surgeries will be done during one session. Prewarm a water-jacketed homeothermic blanket and place under an absorbent pad in order to prevent hypothermia of the rat during surgery.\nPlace spontaneously hypertensive rat (or other rat strain of choice) into an induction chamber and induce anesthesia with 5% isoflurane (anesthesia machine should be set to 1.0 L/min O2 and 1.0 L/min N2O). Lower to 1-2% isoflurane to maintain anesthesia.\nApply Artificial Tears ointment to both eyes.\nShave the throat and left neck region beyond the prospective incision site using clippers (Oster A5 with #10 blade).\nApply Betadine to a gauze pad and disinfect the skin starting from the center of the surgical region, spiraling outward. Rinse with sterile gauze pad containing 70% ethanol, moving pad in a similar pattern. Repeat both steps for a total of three cycles.\nInject 0.2  mL of 0.5% bupivacaine subcutaneously along the prospective incision site.\nPlace rat in sterile stockinette or cover with a sterile surgical drape.\nTransient occlusion of MCA\nUnder an operating microscope, a ventral midline incision is performed and the superficial fascia is dissected.\nBeneath the superficial fascia, there is glandular tissue to the left and three muscles which form a triangle: the sternohyoid, which lies midline over the trachea; the digastric (easily identified with its shiny white tendinous portion); and lastly, the sternomastoid muscle.",
    "Careful sharp and blunt dissection is performed within the triangle to identify the carotid artery (exclusive blunt dissection may be preferred by some to minimize accidental tissue damage). The external, internal, and common carotid arteries (ECA, ICA, CCA) are exposed. The carotid artery is large and visibly pulses. The vagus nerve is seen coursing along the lateral aspect of both common and internal carotid arteries and is sharply dissected off the common and internal carotid arteries.\nTwo ECA branches are then dissected sharply, the first branch heading medially and the second branch heading laterally. Both branches are cauterized and cut, which allows for greater ease in mobilizing the larger vessels.\nThe ECA is now dissected more rostrally. The hyoid bone may be encountered and this will limit the extent of rostral dissection. The external carotid artery is tied off as distally as possible with a 6-0 silk suture. \nAnother 6-0 silk suture is placed loosely around the ECA near the bifurcation with the ICA. Make sure not to occlude the vessel as the intraluminal suture to be used for the occlusion will be going through here at a later step.\nMicrosurgical clips are placed on common and internal carotid arteries near the bifurcation. \nAn initial partial arteriotomy is created between the two silk suture ties on the external carotid artery.",
    "Introduce a 2.2 -3.0 cm length of 4-0 monofilament nylon suture, with a kink 2.0 cm from its rounded, silicon-coated tip, into the ECA lumen down toward the CCA where the microsurgical clip is located. These sutures are commercially available (Doccol Corp., Redlands, CA, USA). Cut the remaining portion of the ECA (at the site of the partial arteriotomy)  to free the stump and position the stump below the bifurcation of the ECA and ICA; this will more easily allow the intraluminal suture to slide into the ICA. \nTighten the silk suture around the ECA stump to secure the intraluminal nylon suture and prevent bleeding, and then remove the microvascular clip from the ICA. Open the clip slowly before removing it to check for bleeding.",
    "Continue advancing the nylon suture from the ECA to ICA lumen to the middle cerebral artery (MCA). This length is typically 18-20 mm and is the reason for placing a kink in the suture prior to insertion. After a variable length of nylon suture is inserted, resistance may be felt. If this occurs with much of the nylon suture still present outside of the vessel, it indicates that the suture is likely entering the pterygopalatine artery (see note below). Pull back and curve the suture slightly to continue along the ICA, which will run more medially. Additionally, dissection of the origin of the PPA may be done to better visualize the path of the intraluminal filament. Continue to insert the nylon suture until resistance is felt at and after the 2 cm kinked position. At this point, the intraluminal suture has blocked the origin of the MCA. MCA occlusion can be confirmed by monitoring the reduction in regional cerebral blood flow using a laser Doppler flowmeter (see Materials table for one equipment source). Also note that the origin of the pterygopalatine artery off of the ICA can be directly tied off, if preferred, in order to avoid accidental intubation of this vessel with the intraluminal suture.\nStart the timer and record occlusion start time.\nRemove the microclip from the CCA.\nClose the incision (dermis, panniculus carnosus, subcutaneous tissue layers) quickly with 3-0 silk suture (a simple continuous pattern will facilitate reopening for reperfusion) and carefully place the rat in a recovery cage. Check that the cage floor around the nose and mouth are free of bedding material and monitor recovery from anesthesia.\nRestoration of MCA blood flow (reperfusion)",
    "Shortly before the occlusion period should end, re-anesthetize the rat, disinfect the incision site with Betadine and 70% ethanol (3 cycles, as before) and reopen the incision by removing the closing sutures.\nPlace a microclip on the CCA, as before.\nWithdraw the occluding suture partway from the ICA until the suture end is visible through the ICA. Do NOT fully remove the suture from the ICA/ECA!\nPlace a microclip on the ICA above the end of the intraluminal suture.\nCompletely remove the occluding suture and tightly tie off the ECA stump. Record end of occlusion (reperfusion start) time.\nRemove the microclip from the ICA.\nRemove the microclip from the CCA.\nMoisten the region with several drops of sterile saline and close the incision layers (dermis, panniculus carnosus, subcutaneous tissue) with 3-0 silk suture using a simple interrupted pattern.\nAdminister 0.05 mg/kg buprenorphine (or other appropriate post-operative analgesic following your institutional guidelines) into the peritoneal space.\nInject 5cc of prewarmed saline intraperitoneally. This will provide hydration during the recovery stage.\nMonitor recovery of rat from anesthesia.\nAfter the rat has recovered, test for behavioral indication of infarction by holding the rat by the tail and observing whether the rat can turn to both sides. Curling to one side only is expected. Simple scoring scales can be used to record initial post-infarct behavorial functioning (see Discussion).\nAdditional injections of buprenorphine (same dosage as above) should be given every 6 to 8 hours for 24 hr of pain relief. Extend analgesia if animal is showing signs of discomfort.\nRepresentative Results",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/1978/1978fig1.jpgFigure 1. Occlusion of the middle cerebral artery by endovascular suture. A simplified diagram of the cranial circulatory system of the rat is shown with a silicon-coated intraluminal suture occluding the origin of the MCA. The OA and ST branches off of the left ECA have been ligated and a suture tie around the ECA stump holds the intraluminal suture in place. ACA, anterior cerebral artery; BA, basilar artery; CCA, common carotid artery; ECA, external carotid artery; ICA, internal carotid artery; MCA, middle cerebral artery; OA, occipital artery; PCA, posterior cerebral artery; PComA, posterior communicating artery; PPA, pterygopalatine artery; ST, superior thyroid artery. Figure adapted from Sasaki et al.4 and Lee3.\nimgsrc://cloudfront.jove.com/files/ftp_upload/1978/1978fig2.jpgFigure 2. Representative magnetic resonance imaging of coronal sections of rat brain 24 hours after 1 hour transient MCAO. Brain edema accompanying focal ischemia is visualized in T2-weighted MRI images. The infarct zone appears hyperintense (bright) on T2 images. Similar infarct patterns can be seen with more advanced MRI techniques such as diffusion-weighted imaging and apparent diffusion coefficient mapping5.\nimgsrc://cloudfront.jove.com/files/ftp_upload/1978/1978fig3.jpgFigure 3. Representative coronal sections of rat brain stained with TTC 24 hours after 1 hour transient MCAO. TTC staining reveals white (unstained) infarcted regions of cerebral cortex and striatum in the same rat as that shown in Figure 2. Note that the general pattern of focal ischemic lesions is similar to that seen in the MRI T2-weighted images, although the final infarct area determined histologically may be slightly smaller than the T2 lesion."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}