{
  "id": 19625,
  "origin_website": "Jove",
  "title": "Caenorhabditis elegans as a Model System for Discovering Bioactive Compounds Against Polyglutamine-Mediated Neurotoxicity",
  "procedures": [
    "NOTE: See Table 1 for the recipes of solutions used in this protocol.\n1. Preparation of materials for the Caenorhabditis elegans assay\nMaintenance of C. elegans strains\n\t\nObtain C. elegans (AM141 and HA759) and Escherichia coli (OP50 and NA22) strains (see the Table of Materials).\nMaintain the nematodes on the nematode growth media (NGM) plate seeded with E. coli OP50 at 20 °C for AM14121 or 15 °C for HA75923.\nPreparation of E. coli OP50 bacterial culture\n\t\nPick a single colony of E. coli OP50 from a Luria-Bertani (LB) streak plate and inoculate it into 50 mL of liquid LB culture.\nIncubate the OP50 bacteria in a shaker at 37 °C and 200 rpm until an optical density of ~0.5 at 570 nm (OD570).\nStore the OP50 bacterial culture at 4 °C and use it within two weeks.\nPreparation of NGM plates with OP50 bacteria\n\t\nAdd 20 g of agar, 2.5 g of peptone, 3.0 g of NaCl, and 975 mL of deionized water to a 1 L autoclavable bottle. Autoclave at 121 °C for 30 min.\nPlace the liquid NGM agar bottle on the bench to cool to ~60 °C, and then add the following sterile stock solutions: 1 mL of 1 M CaCl2, 1 mL of 1 M MgSO4, 1 mL of 5 mg/mL cholesterol, and 25 mL of 1 M potassium phosphate (pH 6.0).\nPour 20 mL of NGM into a sterile 90 mm Petri dish, and leave the plates on the bench to cool and solidify. Keep the plates upside down and allow them to dry on the bench at room temperature for 2 days.",
    "Dispense 200 µL of the OP50 bacterial culture onto each NGM plate and spread evenly with a sterile glass coating rod. Close the lids and incubate the plates overnight at 37 °C.\nStore the NGM plates seeded with OP50 in a plastic box with a cover at room temperature and use within two weeks.\nPreparation of age-synchronized C. elegans population\n\t\nCollect gravid adult nematodes into a sterile 1.5 mL microcentrifuge tube and centrifuge at 1000 × g for 1 min. Wash three times and resuspend the nematodes in M9 buffer.\nAdd an equal volume of bleach solution and agitate gently for 3-5 min. Monitor the bleaching every 15 s under a dissecting microscope.\n\t\tNOTE: The bleach solution must be prepared freshly before use by mixing equal volumes of 10% NaOCl and 1 M NaOH (Table 1)20.\nOnce most of the nematodes are broken, stop the digestion by diluting with M9 buffer. Quickly centrifuge to remove the supernatant and resuspend the pellet in M9 buffer to repeat the washing three times.\nResuspend the pellet in S medium. Let the nematode residues settle down by gravity for 2-3 min while the eggs remain in the supernatant.\nAspirate the supernatant into a new sterile microcentrifuge tube. Collect the eggs by centrifugation at 1000 × g for 1 min.\nDiscard ~80% of the supernatant and transfer the eggs into a sterile flask containing 20 mL of S medium. Place the flask in a shaker and incubate the eggs overnight without food at 120 rpm to obtain synchronized L1 nematodes.\n2. PolyQ aggregation assay\nPreparation of nematodes for the polyQ aggregation assay",
    "Transfer 300-500 synchronized L1 larvae of AM141 to each well of a 48-well plate with 500 µL of S medium containing OP50 (OD570 of 0.7-0.8) and 5 mg/mL of astragalan, typically one well per treatment for one time point.\nSeal the plate with parafilm and incubate at 20 °C and 120 rpm for 24, 48, 72, and 96 h.\nHarvest the nematodes in a sterile 1.5 mL microcentrifuge tube and wash with M9 buffer >3 times by centrifugation (1000 × g for 1 min) to remove the remaining OP50. Resuspend the AM141 nematodes in M9 buffer, and keep them ready for image acquisition.\nAcquisition of fluorescent images and data analysis\n\tNOTE: Data are automatically analyzed with this high-content imaging system. If an automated imaging device is not available, a conventional method to prepare an agarose pad for image acquisition can be used to achieve similar performance by using a common fluorescent microscope7,15,17 (see steps 3.2 and 3.3).\n\t\nTransfer 10-15 nematodes into each well in a 384-well plate (final volume 80 µL per well). Set 10 replicate wells for each treatment.\nAdd 10 µL of 200 mM sodium azide to each well to paralyze the nematodes and allow them to settle down to the bottom (5-10 min).\nPlace the plate in a high-content imaging system to acquire fluorescent images (see the Table of Materials for device and software information).\nOpen the image acquisition software and set up the following parameters.\n\t\t\nOpen the Plate Acquisition Setup window and create a new experiment set and name.\nSelect Magnification as 2x, Camera binning as 1, and Plate type as 384-well plate.\nSet the wells and sites (single site) to be visited.\nSelect the fluorescein isothiocyanate (FITC) filter and enable image-based focusing options.\nSet the Exposure as 300 ms.",
    "NOTE: The above settings can be tested and adjusted to optimize the imaging parameters.\nSave Image acquisition settings and click on the Acquire Plate button to run.\nAnalyze the image data by using the image analysis software.\n\t\t\nOpen the Review Plate Data window and select the Test plate for image analysis.\nDouble-click on a test well to display its image.\nSelect the Count Nuclei as the analysis method and click on the Configure Settings button to bring out a window for the following settings.\nDefine the source image from the FITC channel and select the Standard Algorithm.\nSet the image analysis parameters as follows: approximate minimum width = 10 µm (= 2 pixels); approximate maximum width = 50 µm (= 12 pixels); intensity above local background = 1,000-2,000 graylevels.\nTest the current settings to optimize the method of analysis.\nSave the settings and run the analysis on all the wells.\n\t\t\tNOTE: It takes ~20 min to finish analysis for one 384-well plate.\nExport the Total Nuclei as the total number of Q40::YFP aggregates in each well.\nCount the number of nematodes in each well.\nCalculate the average number of Q40::YFP aggregates per nematode in each group, and apply a nonlinear curve fit to the data from each time point.\nCalculate the inhibition index using eq (1) below:\n\t\tInhibition index = imgsrc://cloudfront.jove.com/files/ftp_upload/63081/63081eq01.jpg (1)\n\t\tWhere Ncontrol and Nsample are the average number of Q40::YFP aggregates in the control and the treatment groups, respectively.\n3. PolyQ-mediated neurotoxicity assays\nTreatment of C. elegans with test samples\n\t\nTo prepare nematodes for the polyQ neurotoxicity assay, transfer 300-500 synchronized L1 larvae of HA759 to each well of a 48-well plate with 500 µL of S medium containing OP50 (OD570 of 0.7-0.8) and 5 mg/mL of astragalan, typically three replicate wells for each treatment.",
    "Seal the plate with parafilm and incubate at 15 °C and 120 rpm for 3 days23.\nCollect the nematodes by centrifugation and wash 3-5 times with M9 buffer. Resuspend the nematodes in M9 buffer for use in neuronal survival and avoidance assays.\nPreparation of agarose pad\n\t\nAdd 2 g of agarose to 100 mL of M9 buffer (2%, w/v) and heat the agarose solution in a microwave to near-boiling.\nDispense 0.5 mL of melted agarose onto the center of a 1 mm thick microscopy glass slide placed between two pieces of 2 mm thick glass plates. Cover with another slide vertically. Once the agarose cools down and is solidified, gently remove the top slide.\nASH neuronal survival assay\n\t\nAdd a drop of 20 mM sodium azide onto the agarose pad. Transfer 15-20 HA759 nematodes into the drop to immobilize them.\nPlace a coverslip gently over the nematodes. Keep the slide under a fluorescence microscope fitted with a digital camera. Select a 40x objective lens and FITC filter to detect GFP-positive ASH neurons in the head region of the nematodes.\nSelect more than 50 nematodes in each group randomly to count the number of nematodes with GFP-labeled bilateral ASH neurons in their head region7. Calculate the survival rate of ASH neurons using eq (2) below.\n\t\tNeuronal survival (%) = imgsrc://cloudfront.jove.com/files/ftp_upload/63081/63081eq02.jpg (2)\n\t\t​Where Nsurvival and Ntotal are the number of nematodes with GFP-positive ASH neurons and the total number of tested nematodes in each group, respectively.\nOsmotic avoidance assay",
    "Divide a food-free NGM plate (9 cm) into normal (N) and trap (T) zones by an 8 M glycerol (~30 µL) line in the middle. Spread a 200 mM sodium azide (~20 µL) line at ~1 cm away from the glycerol line to paralyze the nematodes crossing through the glycerol barrier into Zone T.\nTransfer ~200 nematodes each onto Zone N of three replicate plates for each group. Add a drop of 1% butanedione (~2 µL) onto Zone T (1 cm from the plate edge) to attract the nematodes. Cover the lid of the Petri dish immediately, and incubate at 23 °C for 90 min.\nScore the number of nematodes on the N and T zones under a microscope. Calculate the avoidance index using eq (3)20.\n\t\tAvoidance index = imgsrc://cloudfront.jove.com/files/ftp_upload/63081/63081eq03.jpg (3)\n\t\tWhere N and T are the number of nematodes in N and T zones, respectively. Data are presented as means ± standard deviation (SD) of three replicates, representative of >3 independent experiments.\nPerform an unpaired, two-tailed t-test to compare the data from the astragalan and control groups.\n4. Creating a radar chart\nOpen the graphing software and import data from different assays into a new sheet. Input the A(X) column as the titles of the radial axes, A(Y) column as the data from the control group, and B(Y) column as the data from the treatment group.\nSelect the required data and click on Plot | Specialized: Radar button in the toolbar menu to generate a radar chart.\nDouble-click on the radial axis and adjust the Scale, Tick, and Tick labels of each axis as needed.\nClick on File in the menu and select Export Graphs to save the image as *.tiff.",
    "NOTE: The software websites in the Table of Materials provide detailed help documents and video tutorials on creating radar charts."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}