{
  "id": 9750,
  "origin_website": "Jove",
  "title": "Flypub To Study Ethanol Induced Behavioral Disinhibition and Sensitization",
  "procedures": [
    "NOTE: The protocol section details the preparatory, Flypub assay and analysis steps that include (1) assembly of the chamber, (2) fly care and collection, (3) assay station setup, (4) ethanol exposure, (5) courtship scoring and data analysis, and (6) statistical analysis. The key steps for conducting the Flypub assay and analysis is depicted in a workflow (Figure 1).\n1. Assembly of the chamber (Figure 2)\nCut off the bottom portion of the round Drosophila bottle at the 25 mL mark using a razor blade.\nMake a hole, 5 mm in diameter, at the 50 mL mark of the bottle using a hot soldering iron.\n\tNOTE: This is the access point where the flies will be transferred into the chamber.\nCut a mesh sheet into a circle, 54 mm in diameter, to fit in the Drosophila bottle at the 75 mL mark.\nSecure the mesh at the 75 mL mark of the bottle using hot glue.\nCut the polycarbonate plastic sheet into a circle, 70 mm in diameter.\nAttach the polycarbonate plastic sheet to the bottle at the 25 mL mark (bottom open area made in step 1.1) using hot glue.\nPressure down using weights to ensure that the polycarbonate round is firmly attached to the bottom.\nWash the pubs with ethanol to remove any odors and profusely rinse them multiple times under running distilled water. Shake the pubs vigorously to remove excess water.\nDry the pubs by laying them down horizontally on paper towels at room temperature.\n2. Fly care and collection\nMaintain the flies on a standard cornmeal/agar/sugar/yeast food medium (https://bdsc.indiana.edu/information/recipes/harvardfood.html).",
    "Collect one- to two-days old male flies into a group of 33, which represent one data point, under carbon dioxide (CO2) anesthesia. Make sure to select the flies with intact morphology and put them in a food vial to recover.\n\tNOTE: Two more or three less flies per group are tolerable. Behaviors can be sensitive to experimental settings thus a total fly number per pub may need to be adjusted with a control fly line.\n\tNOTE: Make sure that the food vial is laid down on the side so the anesthetized flies do not get stuck to the food.\nKeep the flies in the 25 °C incubator with at least 50% relative humidity and a 12 h light / 12 h dark cycle for 2 days prior to ethanol exposure.\n\tNOTE: CO2 clearance is critical to eliminate any CO2-induced physiological or behavioral effects that may alter ethanol-induced responses.\nUse codes to blind fly genotypes or treatment conditions to the experimenters conducting ethanol exposure and scoring courtship behaviors.\n\tNOTE: Blind tests help eliminate experimental bias.\n3. Assay station set up (Figure 3A)\nSet up a copy stand with an attached center arm on a bench top in a well-ventilated room.\n\tNOTE: The copy stand is not mandatory. Any staging device that provides a level platform is sufficient.\nClamp the two lateral arms to the stand, with each arm approximately 18 cm out from the center of the stand.\nPlace a fluorescent light on each arm of the stand and one in the middle.\nAttach the video recorder to the center arm, approximately 38 cm above the center of the base. This will record the pubs from a top view.\nCover the base of the stand with white paper, which helps visualize dark-colored flies to create contrast.",
    "During the day of exposure, turn on the fluorescent lights and the computer connected to the video camera that is attached to the copy stand (Figure 3A).\n\tNOTE: The light intensity 2100-2200 lux provides good quality of recorded behaviors for scoring. However, ambient lighting conditions in the laboratory are sufficient to observe ethanol-induced courtship activities.\nPrepare the items to be used for ethanol exposure depicted in Figure 3B.\nGather six clean, assembled pubs for a set of experiments and label them with the code 1 through 6.\n\tNOTE: Make sure to place the randomized codes on fly genotypes or treatment conditions.\n4. Ethanol exposure (Figure 3)\nGently transfer a group of 33 males into a Flypub chamber through the hole at the 50 mL mark using a small funnel.\n\tNOTE: To minimize mechanical stress to the flies, place a mouse pad or any cushioning material under the pub during transfer.\nCover the hole with a tape.\n\tNOTE: The tape is used to close the hole, preventing flies from escaping out of the pub.\nAlign the pubs on the stage from 1 to 6.\nAcclimate the flies to the chamber for 10 min (Figure 3D).\nAdjust the camera settings including the focus, zoom and brightness, and record the last 5 min of acclimation to measure a basal courtship level.\n\tNOTE: To eliminate glare generated by light reflection from a pub, place lab wipes (typically 4 layers or less than 1 mm thickness) at the bottom of the pub to adjust the angle.\nPrepare cotton pads for ethanol delivery by cutting a pad into four equal quadrants with clean scissors and then trim the corners to make it fit into a Petri dish during acclimation (Figure 3C).",
    "NOTE: Do not use bare hands to handle the cotton pads. Use forceps to handle the cotton pads to avoid any potential transfer of odors.\nAdd a cotton pad into each Petri dish.\nAdd 1 mL of 95% ethanol to each cotton pad, make sure for ethanol solution to be evenly distributed on the entire area of the pad.\nCover with double-layered lab wipes to avoid fast ethanol evaporation.\nPlace the small Petri dish containing the ethanol-soaked cotton pad and the double-layered lab wipes through the bottom opening of the pub after acclimation.\nAlign the pubs on the stage, begin recording and simultaneously start a timer.\nRecord the pubs containing flies during ethanol exposure until the flies stop courting or moving due to sedation.\nRemove the Petri dish containing ethanol from each pub with a spatula when over 90% of the flies are sedated.\nGently transfer flies back to their assigned vials through the hole at the 50 mL mark in the pub.\n\tNOTE: Place a funnel on top of food vials to aid in transfer. Make sure to place sedated flies on the side of the food vials to prevent them from getting stuck in the food.\nClean the pubs with ethanol to remove any odors and profusely rinse them multiple times under running distilled water. Shake the pubs vigorously to remove excess water.\nDry the pubs by laying them down horizontally on paper towels at room temperature.\nKeep the flies in the 25 °C incubator with at least 50% relative humidity and a 12 h light / 12 h dark cycle.\nRepeat the steps 4.1-4.17 every 24 h for six consecutive days and make sure to conduct the ethanol exposure at the same time of the day to avoid any circadian effects.",
    "NOTE: Change food vials every 2 – 3 days to maintain healthy flies.\n5. Courtship scoring and data analysis (Figure 4-6)\nOpen the recorded videos using a media player (e.g., VLC) and zoom in the video to clearly observe flies to score (Figure 4A).\nAttach the time code to the video (Figure 4B).\nCount the number of males engaged in courtship activities including following, unilateral wing extension, courtship chain, courtship circle, abdominal bending and mounting for every 10 s time block31 (Figure 5).\nEnter the number of males displaying courtship for every 10 s time block into a worksheet (Figure 6A).\nUse the maximal number of courting males in the three consecutive 10 s time blocks as a representative data point (Figure 6B).\nCalculate the average of 10 consecutive data points having the highest value (Figure 6C) and this represents the percentage of intermale courtship per pub (Figure 6A).\n6. Statistical analysis (Supplemental Figure 1)\nOpen statistical analysis software (e.g., Minitab 17) and add courtship data in the worksheet.\n\tNOTE: Any statistical analysis software can be used.\nTo determine the distribution of the data (either normal or non-normal distribution), go to the Stat tab, select Basic Statistics, and click on the Normality Test option (Supplemental Figure 1Ai).\nIn Variable, select individual columns (each column representing a data set of a genotype or treatment under study), choose the Anderson-Darling test, and click OK (Supplemental Figure 1Aii).\n\tNOTE: The Normality Probability Plot will show the calculated P-Value: if the P-Value is greater than 0.05, then the data are normally distributed. If the P-Value is less than 0.05, the data are non-normally distributed (Supplemental Figure 1Aiii).\nFor comparison of multiple groups, stack the columns to compare by clicking the Data tab, select Stack, and then Columns (Supplemental Figure 1Bi).",
    "In the Stack Columns window, select the data columns to be stacked, select the stacking done either in New worksheet or Column of current worksheet with the next column designated for denoting subscript (e.g., data group identity; Supplemental Figure 1Bii-1Biii).\nClick the Stat tab, select the ANOVA test, select the General Linear Model and then click the Fit General Linear Model (Supplemental Figure 1Ci).\nIn the General Linear Model window, select the columns to be compared in the Responses box, select the column with subscript in the Factors box and click OK, which leads to the statistical analysis results (Supplemental Figure 1Cii-1Ciii).\nFor comparison of two groups with normally distributed data, click the Stat tab, select the Basic Statistics, and select the 2-Sample t-test (Supplemental Figure 1Di).\nIn the 2-Sample t for the Mean window, select Each sample is in its own column, from a dropdown box, select the two groups to compare in the Sample 1 and Sample 2 boxes and then click OK, which leads to the statistical analysis results (Supplemental Figure 1Dii-1Diii).\nFor comparison of two groups with non-normally distributed data, go to the Stat tab, select Nonparametrics and click Mann-Whitney (Supplemental Figure 1Ei)\nIn the Mann-Whitney window, select the two groups to compare in the First Sample and Second Sample boxes and then click OK, which leads to the statistical analysis results (Supplemental Figure 1Eii-1Eiii).\nFor comparison of three or more groups of non-normally distributed data, go to the Stat tab, select Nonparametrics, and then click the Kruskal-Wallis test (Supplemental Figure 1Fi).\nIn the Kruskal-Wallis window, select the columns to be compared in the Response box, select the column with subscript in the Factor box and click OK, which leads to the statistical analysis results (Supplemental Figure 1Fii-1Fiii)."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}