{
  "id": 12055,
  "origin_website": "Jove",
  "title": "Utilizing the Modified T-Maze to Assess Functional Memory Outcomes After Cardiac Arrest",
  "procedures": [
    "All experimental procedures were conducted in accordance with the guidelines of the National Institutes of Health and approved by the Institutional Animal Care and Use Committee (LSU Health Sciences Center-Shreveport) for the usage of male Sprague Dawley rats (300-350 g, 9-10 weeks old). Rats were fasted overnight before the ACA surgery.\n1. T-maze apparatus design and setting\nNOTE: Base the T-maze design on the Deacon and Rawlins' 2006 model31.\nDesign 3D structure of the maze utilizing SketchUp32. To create a 3D structure of the T-maze, construct the start arm with an outside length of 200 mm, width of 165 mm, and height of 148 mm to fit within the printing dimensions of the 3D printer. Use a wall thickness of 5.5 mm and a floor thickness of 8 mm.\nPrint the maze using a 3D printer (see table of materials)32. If a 3D printer is not available in the laboratory, use other materials such as wood, medium-density fiberboard, or a plastic (i.e. polyvinyl chloride), which can be purchased from home improvement stores.\n\t\nDue to height restrictions in the print area, construct the walls of the maze in two separate 3D prints and join together upon maze assembly (i.e., a second wall height was added to the maze section to increase the height by 140 mm, for a total wall height of 280 mm). Each separate 3D print base contained a \"T\" shaped locking mechanism, where one section connected to the next.",
    "At the junction of the start arm with the goal arms, create a 165-mm wide section to join the width of the start arm with that of the goal arms. Construct the goal arms using a similar design method as the start arm; however, reduce the width of the arm to 100 mm per the design of Deacon and Rawlins.\nPlease see Figure 1 for detailed schematic/dimensions of the T-maze.\nInclude a central partition into the design at the junction of the start arm and goal arms. Extend this partition from the back wall of the T-maze and 200 mm into the start arm to divide the goal arms. This partition also extended the height of the maze (Figure 1).\n2. Asphyxial Cardiac Arrest (ACA)\nAutoclave surgical tools (121 °C for 15 min) prior to initiation of surgery. Disinfect the surgical table by 70% ethanol for 15 min. Shave the animal hair at the site of surgery. Apply a betadine solution to skin surfaces for surgical operation.\nAnesthetization\nAnesthetize rats with 4% isoflurane and 30:70 mixture of O2 and N2O (300 mL/min O2 and 700 mL/min N2O) via mask.\nGive rats endotracheal intubation for mechanical ventilation (After intubation, rats were connected to a ventilator).\nMaintain anesthesia by lowering isoflurane from 4% to 2% with a 30:70 mixture of O2 and N2O. Use the pinch-response method to determine depth of anesthesia.\nApply ointment on eyes to prevent dryness while under anesthesia. Regulae the body temperature by a rodent heating pad with an anal probe as a temperature reference.\nEndotracheal intubation\nPlace the rat in the induction chamber. Anesthetize the rats with 4% isoflurane and 30:70 mixture of O2 and N2O.",
    "Remove the rat from the induction chamber. Place anesthetized animal in the supine position with the rat's face towards the anesthesia mask.\nGently move the tongue towards either the left or right of the animal with the left thumb and index finger.\nGlide a 14-gauge flexible intravenous catheter (49 mm-long) over a 17-gauge blunt tip pipetting needle (93 mm-long with 10-degree angle at the needle's tip). Insert the 17-gauge blunt tip pipetting needle into the trachea.\nGently pull out the 17-gauge pipetting needle from the trachea. Connect the 14-guage catheter hub to the ventilator. Adjust ventilator stroke volume to 0.67 mL/100 g and respiratory rate of 60 breaths/min.\nMaintain head and body temperature at 37 °C during the entire procedure by a rodent heating pad with anal probe as a temperature reference.\nFemoral arterial and venous catheterization\nShave hair near the inguinal area (either side) and apply betadine to skin surfaces for surgical operation.\nPlaced the rat in the supine position. Make an incision (10 mm) in the inguinal area with surgical scissors.\nSeparate the connective tissue by blunt tip forceps until the inguinal ligament is exposed. Use a hemostat to grasp inguinal ligament. The femoral artery and vein are underneath the inguinal ligament.\nUse blunt tip forceps to separate the connective tissue until the femoral artery and vein are exposed.\nGently separate the femoral nerve which runs along the femoral artery via fine tip forceps. Carefully separate the femoral artery and vein as a unit via fine tip forceps.\nUse fine tip forceps to separate the femoral artery from the vein.\nPlace 2 pieces of 5-0 silk suture (one towards the leg and the other towards the body) under the vein.",
    "Tie a loose knot on the side near the body. Use a hemostat to hold and pull the suture as far as possible towards the opposite sides of the body.\nTie a loose knot on the side near the leg. Hold and pull the suture towards the leg via a hemostat to allow the vein to fill with blood.\nMake a small incision in the vein (approximately 0.1 mm) by micro-dissecting scissors (at a 45° angle). Soak up any blood with sterilized gauze.\nAttach a blunt tip needle syringe (filled with saline with 20 U/mL heparin) to a PE-50 catheter. Fill the PE-50 catheter with saline with 20 U/mL heparin. Cut the PE-50 catheter with dissection scissors at a 45° angle to create a point or sharp end. Use blunt tip forceps to hold the end of the PE-50 catheter. Gently insert the PE-50 catheter into the femoral vein.\nAfter the catheter is fully inserted, slowly administer 0.1 mL of heparin/saline to ensure that there is no leak. Tie firm suture knots (single-knot) to stabilize the PE-50 catheter. Keep the PE-50 catheter for continuous intravenous (IV) injection of various drugs.\nUse a 1 mL syringe connected with a 23 gauge Luer stub adapter to administer vecuronium bromide (0.67 mg/kg, administered every 10 min) via the femoral vein to immobilize the rat throughout the procedure.\nPlace 2 pieces of 5-0 silk suture (one towards the leg and the other towards the body) under the artery.\nTie a loose knot on the side near the leg. Use a hemostat to hold and pull the suture as far as possible towards the leg.\nTie a loose knot on the side near the body. Hold and pull the suture towards the body via a hemostat to allow the artery to fill with blood.",
    "Make a small incision in the artery (approximately 0.1 mm) by micro-dissecting scissors (at a 45° angle).\nAttach a blunt tip needle syringe (filled with saline with 20 U/mL heparin) to a PE-50 catheter. Fill the PE-50 catheter with saline with 20 U/mL heparin. Cut the PE-50 catheter with dissection scissors at a 45-degree angle to create a point or sharp end. Use blunt tip forceps to hold the end of the PE-50 catheter. Use blunt tip forceps to hold the end of the PE-50 catheter. Gently insert the PE-50 catheter into the femoral artery.\nAfter the catheter is fully inserted, slowly draw back the syringe to ensure that catheter is functional. Tie firm suture knots (single-knot) to stabilize the PE-50 catheter. Keep the PE-50 catheter for continuous recording of arterial pressure and blood gases.\nAsphyxial Cardiac Arrest (ACA) procedure\nAdjust physiological parameters (i.e. pO2, pCO2, blood pressure, and pH value) as needed by modulating stroke volume, O2 or N2O levels. Use normal physiological ranges of these parameters: pO2: 100 mmHg, pCO2: 35-40 mmHg, blood pressure: 100 mmHg, and pH: 7.4.\nUse a 1 mL syringe connected with a 23 gauge Luer stub adapter to administer vecuronium bromide (0.67 mg/kg, I.V.) via femoral vein and wait for 2 min. Make sure the blood pressure is at or around 100 mmHg before performing ACA.\nInduce apnea (6 min) by disconnecting the endotracheal tube (14-guage catheter hub) from the ventilator. Further block the endotracheal tube by a 1 mL syringe to ensure complete apnea.\n\t\tNOTE: The 6-min asphyxia time is defined as the period between ventilator disconnection and the beginning of resuscitation. Complete cardiac arrest is defined as a mean arterial pressure lower than 10 mmHg.",
    "During the last min of apnea, adjust respiratory rate of the ventilator to 80 breaths/min, and increase O2 to 2 L/min with 0% N2O. This action will blow out any remaining isoflurane or N2O remaining in the ventilator.\nmin following apnea, remove 1 mL syringe from the endotracheal tube. Re-connect the endotracheal tube to the ventilator.\nUse a 1 mL syringe connected with a 23 gauge Luer stub adapter to administer epinephrine (0.005 mg/kg, I.V.) via femoral vein and administer manual chest compressions by the thumb, index, and middle fingers on the animal's chest in a light circular motion on the x and z-axis (200/min) until return of spontaneous circulation (mean arterial pressure ≥ 50 mmHg)33,34,35.\nUse another 1 mL syringe connected with a 23 gauge Luer stub adapter to administer sodium bicarbonate (1 meq/kg, I.V.) via femoral vein immediately after return to spontaneous circulation (50 mmHg or higher)33,34,35 to alleviate respiratory acidosis.\nMeasure blood gases again 10 min after resuscitation to determine the acid-base status (pH after ACA should be around 7.35 to 7.40)\nUse a hemostat to clamp the femoral artery and vein. Slowly and gently remove arterial and venous catheters using blunt tip forceps. Ligate femoral artery/vein with a 5-0 silk suture to prevent bleeding. Close the skin overlying the surgical site using a 3-0 silk suture. Use the interrupted suturing technique to minimize the chances of the wound reopening.\nWait until the rat breathes itself (usually 30 min to 60 min after resuscitation), disconnect the rat from ventilator and gently remove the endotracheal tube.\nPlace the rat in the baby incubator (27 °C, 50% humidity) overnight. Place softened food (made by soaking them in the water) and water into the baby incubator overnight.",
    "Transfer the rat to the individual cage and return the rat to animal facility with regular chow and water. T-maze tests start 3 days after ACA.\n3. T-maze\nAnimal preparation\nThe day before surgery (sham or ACA), handle each rat for 5 min. Never elevate rats from their cage (480 mm x 250 mm x 200 mm, plastic transparent cage) when handling (Figure 2).\nAfter handling the rat, gently pick the rat up by its tail with one hand with the other hand supporting its' legs. Let them jump from the hand to the cage (100 mm height) 5 times. Separate each rat into individual cages, so they will not dominate for food and/or fight.\nThree days after sham or ACA surgery (Figure 2), transfer the rats with the cage into a quiet and dark room before the start of the first run. Only turn on a low power desk lamp and place it at the corner of the testing room to maintain minimum illumination. Allow the rat to adapt to darkness for 10 min.\nPerform all experiments in the afternoon to avoid any effects of diurnal variation on rats' performance. Do not advise the operator on which rat received sham or ACA surgery.\nSpontaneous alternation\nSpread a thin layer of bedding (~10 mm thick) to cover the entire floor of the maze. Then place the rat at the start arm (bottom of the \"T\"), which is the starting point of each run, and allow each rat 3 min to explore the right or left goal arm.",
    "Once the rat commits to a particular goal arm (all four paws of the rat have entered the goal arm), block the \"T\" junction between the start arm and the opposing goal arm (Figure 1) to prevent the rat from entering the opposing goal arm. Leave the rat in the maze for 30 seconds, then pick up the rat and place it back in its cage for a minimal time (~30 seconds). Then remove the \"T\" junction block (125 mm X 230 mm X 65 mm, made by a 3D printer) from the T-maze.\nPlace the rat at the start arm and repeat 3.2.2. Alternation is defined as: when the rat enters the opposite arm as compared to the previous run36. Have rats perform 4 runs per day as follows:\n\t\t1st run\n\t\t2nd run\n\t\t10-min break\n\t\t3rd run\n\t\t4th run\nChange the bedding during the 10-min break and between animals to eliminate scent bias. Clean the T-maze with 75% ethanol followed by distilled water at the end of each experimental day.\nRepeat steps 3.2.1. - 3.2.4. for two more days (12 runs in total) as in Figure 2.\nAlternation rate and side preference rate calculations\nCalculate the % Alternation and the % Side Preference, where\n\t\tL: the rats choose the left arm\n\t\tR: the rats choose the right arm\n\t\tCorrect choice: the 2nd run is different from the 1st in a given set (each set contains two runs)\n\t\tIncorrect choice: the rats choose the same arm similar to previous run\nimgsrc://cloudfront.jove.com/files/ftp_upload/56694/56694eq1.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/56694/56694eq2.jpg\nExample:\n\t\tDay 1: L L / L L\n\t\tDay 2: L L / L R\n\t\tDay 3: R L / L L\n\t\tAlternation: 2 (correct choices) /6 (total sets performed) * 100 = 33.33%\n\t\tSide preference: 10 (L, preferred side) /12 (total runs performed) * 100 = 83.33%",
    "Post-operative care:\nGive rats buprenorphine (0.01 mg/kg IP) every 12 h for 2 days after surgery. Observe rats for up to 1 h after cardiac arrest.\nAttach rats to the ventilator and heating pad until it has regained sufficient consciousness to maintain sternal recumbency. To maintain animals' body temperature after surgery, place the rat in a baby incubator (set at 27 °C, 50% humidity).\nProvide softened chow (made by soaking in water) to animals for the first 24 h after surgery. If the rats were not drinking water, administer bacteriostatic saline (100 mL/kg/day, I.P.) until the animal recovers and is drinking water freely.\nGive the rats topical antibiotic with pain relief (bacitracin and lidocaine ointment) at all wounds. Move rats back to the animal facility after they fully recover.\nEuthanasia method\nUse 5% isoflurane and 100% N2O to euthanize the animals at the end of experiment.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}