{
  "id": 7461,
  "origin_website": "Bio",
  "title": "Assessment of Corticospinal Excitability in Awake Rodents Using EMG-Controlled Intracortical Stimulation",
  "procedures": [
    "Making Part A: Cortical Stimulation Array (Considerations in Brackets)Start with obtaining the necessary components (see list of equipment).First, make the mount for the array: pick up the rigid straight piece of stainless steel tubing and cut about a 5 cm length (this part will be used to mount the array onto the stereotaxic frame during the implant).Take the female socket using tweezers and use a crimper tool to crimp the shorter end of the socket onto the piece of wire, ensuring that both components are firmly attached. Set the mount aside for now (Figure 4A).Pick up the male pin and observe its construction. There is one end with a smaller outer diameter (OD) which fits into the corresponding female socket. This side will be left untouched for the time being. Our attention will be focused on the other end (demarcated by the asterisk in Figure 4B). Notice that the center part of the male pin has an element with slightly larger OD relative to the rest of the pin.Cut out a first piece of 0.050” heat shrink tubing, long enough to cover the asterisked end but not extend beyond the edge of the pin. Use a heat shrink gun to fit the heat shrink on the asterisked end snugly, applying uniform heat to ensure good fit (at this point, the central portion of the male pin should be elevated only slightly relative to the OD of the heat shrink on the asterisked end) (Figure 4C).Cut out a second piece of 0.050” heat shrink tubing, long enough to cover to the asterisked end edge and the elevated central portion of the male pin, but again not extending beyond it. Fit uniformly using the heat gun.Create the array electrodes by unspooling some Pt-Ir wire and cutting four 3 cm pieces.",
    "Remove about 2 mm of insulation from one end on each piece of array wire.Cut two pieces of larger diameter 0.066” heat shrink tubing of approximately about 2 mm in length.Slide the two unheated 0.066” heat shrink pieces over the asterisked end. This should leave a small space to insert the array wires (Figure 4D). Using a helping hand, position each array wire in a square formation (viewing from the top down with the pin in the middle) (Figure 4E and 4F). Insert the four array wires so that they extend more than 3 mm beyond the tip of the asterisked end.Apply slight heat to the third piece of heat shrink tubing to reduce the space available, reposition the array wires into their final positions, and finish the shrink by applying full and uniform heat (ensure the relative length of each array wire is the same).Mix a small portion (1/4 of a pea sized portion is sufficient) of Parts A and B of the epoxy adhesive together on a disposable surface, and apply generously to cover all three portions of heat shrink and permanently fix the electrodes in their final position [(take care not to cover the actual tips of the electrodes where they will be inserted into the brain (Figure 4G); the other end of the epoxy should not go beyond the edge of the central portion of the male pin]. Wait 24 h for the epoxy to settle, then make final adjustments to the array electrodes so that the leads are parallel to one another.Cut the asterisked end of the array’s electrodes to the desired final length (Figure 4H) (this depends on the expected depth of the electrodes in the brain and targeted structures; ensure that all four electrodes in the array are uniform).",
    "Ensure that a bit of each tip has insulation removed to facilitate neurostimulation once the array is implanted in the brain.Coat the other end (opposite to the side going into the brain) of the array electrodes with a small bit of solder to facilitate attachment to the head connector during the surgery.Insert the male end of the array pin into the female socket holder, and store electrode side up, by sticking the mount in a small piece of sturdy foam. Use caution when manipulating the array, and store in a protected location where foot/hand traffic is minimal, to prevent accidental trauma with the sharp electrodes. A finished array is depicted in Figure 4I.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4267/bioprotoc-11-24-4267-g004.jpgFigure 4. Cortical Stimulation Array Assembly. Refer to protocol steps for figure panel annotations.Making Part B: Head Connector and EMG Electrodes (Considerations in Brackets)Start with obtaining the necessary components (see list of equipment) and clearing the workbench space if necessary.Select the spool of insulated stainless steel wire (Figure 5A), and use scissors to cut one short length of wire (approximately 5 cm) for the EMG reference electrode.Continue cutting the wire in pairs of the same length, corresponding to the desired muscles [more distal muscles will require longer wires to ensure comfort and prevent movement tension after implant, but generally, no longer than 10 cm for the forelimb extensor muscles. The size of the rat will also need to be taken into consideration, with larger rats requiring longer wires to accommodate their larger frame. If in doubt, err on the side of longer than necessary at this stage – the wires can be trimmed at their free (unsoldered) end later on].",
    "Using a scalpel blade on a flat block of Teflon®, and under a microscope at low magnification and sufficient lighting, gently remove about 2 mm of insulation (dashed arrow in Figure 5B) from each end of each stainless steel wire, to permit soldering (Figure 5B) (with practice, this will be possible without fraying of the threaded wire). The EMG reference wire should have about 2 cm of insulation removed from one end (Figure 5C). When inserted in the rat’s back, this will help ensure that a cleaner differential can be calculated.Using serrated scissors, cut four short (approximately 2 cm) lengths of thin gauge electrical wire, and remove approximately 2 mm of the insulation from both ends of each piece using a wire stripper. The components should be ready for assembly now (Figure 5D).Verify the plan for the implant, which will dictate which location to solder each EMG and cortical wire. A sample arrangement is provided in Figure 2, but feel free to adapt the pattern to your specific project.Place the Samtec® connector in a helping hand, male side down (with the exposed underbelly of the connector up) in preparation for soldering. Use the notch (dashed arrow in Figure 5D) to orient yourself to the respective pins on the Connector.Solder each wire to the appropriate pins on the underside of the Samtec® connector, ensuring that no shorts are introduced (Figure 5E, 5F). If necessary, test each connection and Samtec® pin using a multimeter. EMG wire pairs should be marked with sets of one, two or three pairs of suture knots tied along their lengths, each pair corresponding to two pins on the Samtec® connector, to ensure they can be routed to the correct muscles during the surgery.",
    "Use a fine thread or a spare piece of suture to tie the wires together near their base, and redirect them in one common exit direction prior to applying epoxy. The wires should be bent in a common direction and not exit the Samtec® connector perpendicularly, in order to minimize the height of the eventual implant (Figure 5G).Mix equal parts epoxy precursor in a weigh boat or other disposable surface (half a pea-sized amount of each component) and apply using a small spatula to the soldered underside of the connector to fix the connections permanently (Figure 5H) [NB: Take special care not to apply too much, such that the epoxy drips into the other (connecting) side of the implant. This will prevent a reliable and easy connection with the Samtec® female connector in the cable. However, ensure that the exposed pins on the soldering side of Samtec® connector are fully covered].Leave the epoxy to set for 24 h and reapply a second more generous coating of epoxy to finish the implant, at least 24 h (preferably 48 h) prior to the actual surgery (Figure 5I).Gently twist each pair of EMG wires together to facilitate implantation and reduce noise.The morning of the surgery, place the implants in a shallow bowl of 70% ethanol to disinfect them, and remove the thread prior to implantation. We recommend making fresh versions of both implants for each surgery.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4267/bioprotoc-11-24-4267-g005.jpgFigure 5. Head Connector and EMG Electrode Assembly. Refer to protocol steps for figure panel annotations.Implant Surgery (Considerations in Brackets)Pre-operative Care and Induction of AnesthesiaWeigh the rat and open a new log file or notebook page for recording peri-operational details.Prepare the surgical workspace. We use a water bed heater set at 38°C with a sterile disposable liner on top.",
    "We also have a Zeiss microscope on the same table, and a stereotaxic frame for rats within close reach.Deeply anaesthetize the rat with the agent of choice [Surgery can be completed under isoflurane or the appropriate dosage per kilogram of body weight of ketamine-xylazine (KX) anesthesia, but isoflurane inhalation is recommended because it provides a more reliable anesthesia and analgesia, and is easily adjustable during the surgery)]. Use the paw pinch reflex to assess the depth of anesthesia.After sedation, position the rat on its belly, with the forelimb selected for EMG implantation directly facing the experimenter [for illustration purposes we will select the right paw. If the right forelimb muscles are the target for excitability measurement, then perform a craniectomy and insert the array in the left caudal forelimb area (CFA); reverse the laterality if the left forelimb is the target].Apply eye gel to ensure lubrication, inject lidocaine/bupivacaine solution at the incision sites for local analgesia, and carprofen as a systemic analgesic. Hydrate the rat with appropriate amounts of Lactated Ringer solution (approx mmol/L Na – 130, K – 4, Ca – 1.4, Cl – 109, Lactate – 28, mOsmol/L – 272, pH 6.5) peri-operatively.Insertion of EMG ElectrodesShave the rat’s head and forelimb areas.Prepare a sterile field.Sanitize the forelimb area using chlorhexidine.Don a set of sterile gloves.Make a short (5 mm) incision using a new scalpel blade on the proximal dorsal forelimb surface.Undermine the skin in a small radius around the incision site using blunt scissors, to expose the extensor carpi radialis (ECR) muscle.Make a second incision to access the biceps (Bi) muscles.Make a third 0.5 cm incision on the shoulder ipsilateral to the target forelimb, over the trapezius (Trap) muscle. Make a final 0.5 cm incision on the scalp, just rostral to the ears.",
    "Next, use fine hemostatic forceps to carve a subcutaneous tunnel from the forelimb to the scalp incisions; retrieve and gently pull back the EMG wires, from the scalp incision to the forelimb exit site. Leaving the pair of EMG wires in place, repeat the process to pull the two remaining pairs to their respective destinations.To implant the EMG wires in the targeted muscles, use the tail end of a 6-0 polypropylene suture to tie a knot near the tip of the exposed EMG wire (Figure 6A).Then, using a needle holder, insert the suture needle deep into the targeted muscle belly, and pull it back out of the muscle about 2-3 mm from the entry point, in a direction perpendicular to the muscle fibers (Figure 6A, suture movement as in green arrow). Gently thread the suture until the tip of the EMG electrode penetrates into the muscle belly, while holding the tail end of the suture to prevent it from entering the muscle.While ensuring the electrode tip remains buried inside the muscle, tie back the tail of the suture with the main thread across the muscle (Figure 6B; green arrow indicates two areas to tie together), not too tight so as to avoid unnecessary pressure on the muscle and hinder blood flow. The end result is depicted in Figure 6C.Steps C2j-C2l are repeated for a second EMG wire, approximately 2 mm proximal or distal to the first, in order to perform differential recording.After both wires are securely implanted, anchor the pair of wires in a bundle to the muscle fascia a few mm away from their insertion point, through a separate polypropylene suture.Finally, flush the surgical area with saline and close the wound with a 5-0 nylon suture.Repeat the procedure as needed for other target muscles.",
    "Take note that polypropylene, or other braided, flexible, and non-absorbent suture materials, are best for internally securing the EMG wire, and a nylon monofilament suture is best for closing the skin on the surface.Afterwards, place the rat in a stereotaxic frame equipped with a mask for gas anesthesia and a micromanipulator for the stereotaxic insertion of electrodes into the cortex, once it is exposed.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4267/bioprotoc-11-24-4267-g006.jpgFigure 6. Insertion and Fixation of EMG Electrodes. Refer to protocol steps for figure panel annotations.Insertion of Cortical ArrayAt this point, the isoflurane can be routed through the mask secured in the stereotactic frame (carefully monitor for any whisker movements or paw withdrawal reflex and adjust anesthesia delivery as required).Start the craniectomy by extending the scalp incision made earlier for the EMG wire bundle entry point [the incision should only be long enough to comfortably insert a Barraquer wire speculum (retractor) with slight tension].Clear the surface of the skull by removing the periosteum covering the surface (it can also be dried using autoclaved cotton swabs).Once the skull surface is sufficiently clean and exposed, mark bregma and delineate the area for drilling [this craniectomy just needs to be large enough (approximately 2 × 2 mm) to comfortably insert the cortical array in the desired location (posterior and medial electrode placed approximately 0.2 mm anterior and 3.0 mm lateral to bregma to target CFA)] – see Ting et al. (2020) for further details, and Figure 7A for a schematic summarizing this, as well as the following four steps.",
    "Insert three self-tapping skull screws on the contralateral side to the planned craniectomy near the lateral ridges of the skull surface, and two on the ipsilateral side (leave the closest burr hole to the craniectomy open to permit manouevrability of the dremel®), to provide mechanical anchors for the dental cement to support the cortical implant and connectors. The size of the skull screws is such that they can be secured within the bone and leave the top of the screw approximately 1 mm above the surface of the skull, acting as an anchor for the acrylic. Be careful not to screw in too deep however.Insert the skull screws before starting the craniectomy, to prevent any debris from falling onto the dura. Using a 0.7 mm burr on a rotary tool (Dremel®), perform a craniectomy over the CFA.After removing the skull flap, attach the cortical array to the holder (ensure the electrodes are parallel to each other and to the holder, to ensure maximum accuracy).Insert the final skull screw in the burr hole closest to the craniectomy site.Using the stereotaxic apparatus, carefully descend the electrodes into the cortex (ensure that the tips of the electrodes insert cleanly through the dura – expect that there will be some resistance and dimpling before all the electrodes pass through) (see Figure 7B summarizing this step and the five following ones).Once all the electrode tips have pierced the dura, wait one or two minutes while the cortical surface rises back to its original position. Gently bring the electrode tips to their final position at 1.5 mm below the cortical surface.Mix and use a pea-sized portion of quick-setting silicone array (Kwik-Cast®) to cover the dural surface around the implant, using a mini-spatula to fill the gap in the craniectomy.",
    "Within five minutes, the silicone will solidify, covering any exposed dura.In order to secure the cortical array permanently, use dental cement. Stir the mixture to a slightly runny consistency, and use a spatula to connect the epoxy body of the cortical array to the closest anchoring skull screws (take care for drops of dental cement not to fall on the surrounding surfaces, and especially on the rat’s eyes, fur, etc.).After a few minutes, the dental cement will harden, and the electrode holder can be safely removed, leaving the cortical array in place. There will still be four wires extending upwards, however, which will be connected shortly.Soldering to ConnectorNext, use a stereotaxic holder to hold the Samtec® connector (we used a custom-made clamp mounted on a micromanipulator).Position the Samtec® connector about 1 cm above the surface of the skull, oriented rostro-caudally lengthwise.Then, prepare a soldering setup.Ensure the soldering connections match the pinout specified a priori, and that you record the position of each electrode in the cortical array relative to the pinout (for example, Samtec® pin 3 is connected to the rostral medial electrode, etc.).Using fine solder, solder each wire extending upwards from the cortical array to the designated wires on the Samtec® connector, first placing a piece of fine heat shrink on one wire, so the new connection can be promptly insulated with a heat gun after the solder has set (see Figure 7C for an illustration of these connections). Take care not to burn the fine wires by applying the iron for longer than is necessary. A very fine coating of flux may facilitate this connection; use a small gauge solder wire. Only a small drop is necessary per connection.Use a heat gun with a narrow air stream to insulate the electrical connection.",
    "Do not aim the stream of hot air toward the animal, or near its eyes, nose, mouth or whiskers in particular. Repeat for each cortical wire; ground wire should be soldered to a posterior skull screw.Once all the correct electrical connections have been made, lower the Samtec® connector closer to the skull surface (in practice, it fits well immediately adjacent to the A-M Systems® male pin that extends upwards from the cortical array; see Figure 7C for relative positioning of the connector and electrodes).Then, use fresh dental cement to fix the Samtec® connector permanently to the skull, using the skull screws as anchor points, while embedding all the wires so none are left exposed (take special care not to drip wet dental cement into the Samtec® connector, which can be very difficult to remove and renders a good electrical connection almost impossible after the surgery. A small piece of protective tape is useful here). See pink area in Figure 7C.Close the open wound by carefully applying dental cement into the surrounding area and sculpting the cement surface so that there are no sharp edges.Trim the skin on the perimeter of the implant to remove excess and aid recovery.Implant placement is completed!Post-Operative CareClean any residual blood from the surface of closed incisions on the limbs using saline and some gauze; also clean the perimeter of the implant on the head and ensure there is no residual blood or scab formation.Trim the nails on the rat to prevent self-injury from scratching. House the rat singly in a clean cage.Allow the rat to recover with institutional animal care best practices (give Lactated Ringer’s solution for hydration and atipamezole to counteract the effects of the ketamine-xylazine and speed up recovery). Remaining skin sutures can generally be removed seven to ten days after surgery.",
    "Carprofen, or another non-steroidal anti-inflammatory, should also be administered up to 48 hours after the surgery to relieve pain and inflammation.Allow at least three days (generally up to one week) of undisturbed recovery prior to testing the chronic implant. Monitor daily for signs of infection and treat accordingly. In case of infection, consult the veterinary staff at your institution, who can advise and carry out the appropriate treatment plan for recovery. A high degree of care to maintain aseptic conditions during the implant surgery will minimize the risk and occurrence of infection.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4267/bioprotoc-11-24-4267-g007.jpgFigure 7. Insertion of Cortical Array. Refer to protocol steps for figure panel annotations.Making the Connector Cable between Rat and Commutator (Considerations in Brackets)Start with obtaining the necessary components (see list of equipment) and clearing the workbench space if necessary (Figure 8A).Cut the Invivo1® spring shielding to a desired length, we have found that approximately 40 cm works well.Cut appropriate lengths of the Samtec® female connector wires and InVivo1 exposed wires, such that soldered together, their combined length is slightly longer than the length of the InVivo1® spring shielding.Create or revisit the desired mapping between Samtec® male pinout and InVivo1® pins (refer to their respective datasheets). A sample map is provided in Figure 2.Carefully feed all the wires from the Samtec® female connector into the metal spring shielding (Figure 8B) (be careful not to lose any wire in the spring structure).Expose approximately 3 mm from each wire tip to facilitate soldering.For each wire, slide a large enough piece of heat shrink down the wire before soldering.Using a helping hand, solder each wire to the correct matching one in the plan (as there are 14 pins in the Samtec® connectors and 12 pins in the Invivo1®, two pins will be left unsoldered in the Samtec® connector) (Figure 8C).",
    "Slide the heat shrink over the new electrical connection and secure using a heat gun.Repeat Steps D6 to D9 for each available wire.Verify each electrical connection between the two connecting ends of the cable using a voltmeter.Mix some epoxy parts A and B, and apply liberally to the loose wire assembly on approximately the final centimeter of the InVivo1® connector (Figure 8D) (this helps with wire management). Wait 24 h for the epoxy to set.Apply some silicone adhesive liberally over this epoxy, and as well as the loose wire assembly leading into the Samtec® end of the cable (Figure 8E) (a general guide is to apply until the edge of the wire shielding). Wait 24 h for this adhesive to set – the surface should not be sticky once that happens.Make a duplicate second cable; aside from the implant in the rat itself, this is the element of the system most prone to malfunction, and so it is prudent to have a backup to ensure scientific progress is not unduly impeded. A finished cable is depicted in Figure 8F.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4267/bioprotoc-11-24-4267-g008.jpgFigure 8. SAMTEC to InVivo1 Connector Cable Assembly. Refer to protocol steps for figure panel annotations."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}