{
  "id": 19059,
  "origin_website": "Jove",
  "title": "High Throughput Sequential ELISA for Validation of Biomarkers of Acute Graft-Versus-Host Disease",
  "procedures": [
    "1.  Experiment Day 0: Sample Preparation and ELISA Test Plate Coating with Capture Antibody for IL-2Rα, REG3α and HGF\nPlasma aliquot samples to be analyzed will be  pulled, thawed and spun at 12,000 rpm for 10 min to separate the clots at  the bottom and lipids on top from the plasma. 150 μl of undiluted plasma will be  plated from each sample onto a 96-well V-bottom plate (source plate) by manual  pipetting according to predefined maps. The aliquots will be wrapped in parafilm  and kept in a humid chamber at 4 °C during the entire process; no  longer than 72 hr.\nIL-2Rα and HGF capture antibodies will be  reconstituted and diluted per manufacturer specification and 50  μl will plated  into each well of respective 96-well high-binding half-well plates which are  then sealed and incubated overnight at 4 °C. Alternatively, many  plates can be dried at 37 °C and stored at 4 °C for later use,  depending on the stability of the protein.\nREG3α capture antibody will be diluted according  to manufacturer protocol using manufacturer coating buffer and 25  μl will be  plated in each well of a 384-well Nunc Maxi-Sorp plate which is then sealed  and incubated overnight at 4 °C.\n2. Experiment Day 1: IL-2Rα ELISA (Figure 1)\nThe IL-2Rα test plate is washed, blocked with  BLOTTO in TBS, and the standard is reconstituted and an 8-point standard curve  is prepared per manufacturer protocol.\nAfter washing the plate following the blocking  step, 50  μl of undiluted plasma is plated in duplicate from the source plate to  the ELISA test plate, and 50  μl of each standard is plated in duplicate.  The plate is sealed and incubated for 2 hr at room temperature on a plate  rotator set at 300 rpm.",
    "The plasma is reclaimed from the IL-2Rα ELISA  test plate and placed back in the undiluted plasma source plate.  The ELISA is completed per manufacturer  protocol (with volumes adjusted for half-well plates) and the optical density  of each well will be read using a plate reader set to 450-570 nm, and the data  saved and analyzed.\n3. Experiment Day 1: REG3α ELISA (Figure 1)\n10  μl of undiluted plasma will be transferred to  a separate v-bottom source plate.  90  μl  of manufacturer-provided dilution buffer is added to each well to create a 1:10  dilution source plate.\nThe REG3α ELISA is performed per manufacturer  protocol (with volumes adjusted for 384-well plates) and the optical density of  each well will be read using a plate reader set to 450-620 nm, and the data  will be saved and analyzed.\n4. Experiment Day 1: Elafin and TNFR1 Test Plate Coating with Capture Antibody\nElafin and TNFR1 capture antibodies will be reconstituted and diluted per manufacturer specification and 50  μl will plated into each well of respective 96-well high-binding half-well plates which are then sealed and incubated overnight at room temperature for Elafin, and at 4 °C for TNFR1.\n5. Experiment Day 1-2: HGF ELISA (Figure 1)\nAfter completing the IL-2Rα ELISA and assuring  the test does not need to be repeated, 60  μl of undiluted plasma will  transferred to a new source plate and then 60  μl of 1% BSA in 1 x PBS is added  to each well to make a 1:2 diluted plasma source plate.\nThe HGF test plate is washed, blocked with  BLOTTO in TBS, and the standard is reconstituted and an 8-point standard curve  is prepared per manufacturer protocol.",
    "After washing the plate following the blocking  step, 50  μl of 1:2 diluted plasma is plated in duplicate on the ELISA test  plate, and 50  μl of each standard is plated in duplicate. The plate is sealed  and incubated overnight at room temperature on a plate rotator set at 300 RPM.\nThe 1:2 diluted plasma is reclaimed from the HGF  ELISA test plate and placed back in the 1:2 diluted plasma source plate.  The ELISA is completed per manufacturer  protocol (with volumes adjusted for half-well plates) and the optical density  of each well will be read using a plate reader set to 450-570 nm, and the data  saved and analyzed.\n6. Experiment Day 2: Elafin ELISA\n10  μl of undiluted plasma will be transferred to  a new source plate and then 190  μl of 1% BSA in 1 x PBS will be added to each  well to make 200  μl of plasma dluted 1:20.\nThe Elafin ELISA as performed according to  manufacturer protocol (with volumes adjusted for half-well plates), and the  optical density of each well will be read using a plate reader set to 450-570  nm, and the data saved and analyzed.\n7. Experiment Day 2: TNFR1 ELISA\n25  μl of 1% BSA in PBS will be added to the 1:20  source plate (now containing 100  μl of 1:20 plasma) to obtain 125  μl of 1:25  diluted plasma.\nThe TNFR1 ELISA is completed per manufacturer  protocol (with volumes adjusted for half-well plates) and the optical density  of each well will be read using a plate reader set to 450-570 nm, and the data  saved and analyzed.\n8. Experiment Day 2: IL-8 ELISA",
    "60  μl of 1:2 diluted plasma will transferred to  a new source plate and then 180  μl of IL-8 diluent is added to each well to  make a 1:6 diluted plasma source plate.\nThe IL-8 ELISA is completed per manufacturer  protocol (with volumes adjusted for half-well plates) and the optical density  of each well will be read using a plate reader set to 450-570 nm, and the data  saved and analyzed.\nOnce all ELISAs have been completed, unused stock plasma will be replaced into the thawed aliquots and frozen for future use."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}