{
  "id": 14599,
  "origin_website": "Jove",
  "title": "Construction of Microdrive Arrays for Chronic Neural Recordings in Awake Behaving Mice",
  "procedures": [
    "1. Tetrode Fabrication\nStart by using insulated 12.5 μm (0.0005\") diameter core platinum-iridium wire from California Fine Wire. The length of the wire should be cut to the appropriate length for the target structure. For example, cut the wire to at least 30 cm long for targeting the dorsal subiculum or hippocampus.\nFold the wire over at the center so that there are two parallel wires which will be 15 cm in length. Drape the midpoint of this wire over a horizontal arm to form four parallel wires of 7.5 cm in length. Next attach the rubber-coated clip near the bottom of the draped wire, creating a bundle of four wires.\nPlace the rubber clip into the motorized Tetrode Spinner, making sure that the wire is taut, but not too taut or bearing weight as it will break during the spinning process.\nSwitch the Tetrode Spinner to \"Manual\" mode and push the joystick to \"Right\" to spin the wire in a clockwise direction. The spinner will rotate at approximately 2 Hz, creating a tight bundle of four wires to form the tetrode.\nApply 80 clockwise rotations then stop by pushing \"Up\" on the joystick. This will pause the motorized spinner. Next, apply 20 counter-clockwise (\"Left\") rotations in order to release tension on the tetrode. The final number of rotations per length of wire should be 8 rotations per micron.",
    "Use the heating gun on the lower setting 1, which reaches a maximum of 400 degrees, in order to fuse the wires together by melting the VG bond coat. Hold the heat gun ~2 cm from the wire and run the gun up and down the straight length of the wire for about 5 sec from several different angles. Make sure to constantly sweep the heat gun and not hold it any single location as this will melt the HML insulation and cause the wires to fuse together within the bundle.\nMake a cut at the top of the tetrode (near the horizontal arm) and then release the tetrode from the clip at the bottom. Cut the single loop so that there are four separate wires on one end of the tetrode, these wires will be electrically connected to gold pins or a circuit board at a later step.\nPlace the completed tetrode in a dust-free holding box for storage until the drive has been completed.\n2. Custom Microdrive Assembly\nFirst construct the base that will hold the microdrive(s). The base of the implanted microdrive is generally most stable if it is secured and positioned along the midline of the skull. This protocol describes steps to build a base with a single microdrive to hold four polyamide tube carriers. Additional microdrives and tubes can be easily added as needed.\nStart with an approximately 20 mm square piece of Plexiglas acrylic (5 mm thick) and sand the acrylic into a shape that will allow the mouse to move freely with the drive after it is implanted on the head.",
    "Next, assemble the drive unit. Use customized 3.3 x 6.3 mm brass guides that will carry the drive screw. First, solder two brass guides together perpendicularly. The vertical brass guide will hold the drive screw and electrodes, while the horizontal piece will be glued into the acrylic base.\nAfter soldering the brass pieces together, begin assembly of the drive itself by passing a fillister head brass screw through the top of the guide and into a Delrin plastic block. The square block is designed so that the thread hole is slightly off center (by 0.2 mm), resulting in one face of the block protruding very slightly from the guide. This is the side where the polyamide tubes carrying the electrodes will sit.\nWith the Delrin block inside the guide, and the screw all the way through, thread a hex brass nut until the nut is nearly touching the bottom of the guide. Do not tighten the nut fully; instead melt a small amount of solder onto the end in order to join the nut and the screw but being careful not to solder anything to the guide. Now, rotating the screw should move the Delrin block up (clockwise) and down (counterclockwise) vertically along the screw thread. Cut off thread that protrudes past the soldered nut.\nOnce the drive has been assembled, go back to the acrylic base and cut a 3 mm wide slot where the electrode drive will be. Pass the horizontal brass guide through the slot and then use cryanoacrylate glue to secure the piece to the base.",
    "Place the acrylic base in a vise to secure it in place. Place a electronic interface board (EIB) on top of the base and mark the locations of the two screw holes. EIBs are microchips that provide a signal connection between the electrode wires and a pre-amplifier headstage. Using a 1.5 mm tip drill bit, carefully drill holes at the marks for screws that will hold the EIB in place on top of the base. Place the EIB and thread two brass screws into the holes.\nUse micro dissecting scissors to cut four 7 mm long pieces of polyamide tubing. Line the four tubes next to each other on a piece of folded laboratory tape. Apply cyanoacrylate to the center to join them together but take caution not to get glue within the tubes themselves. Allow the joined tubes to dry fully.\nRotate the drive base 90 degrees so that the EIB chip is vertical and the drive is positioned horizontally with the protruding Delrin block facing upward. Looking through a dissecting microscope, carefully dab a small amount of cyanoacrylate on the Delrin face then place the four joined tubes on the glue. Allow the glue to set completely before attempting to move the drive.\nTest that the polyamide tubes are securely attached and that the entire assembly moves smoothly without touching the guide or meeting any resistance.\nNext, prepare the ground screw and connect the ground wire to the EIB. Make a ground screw by taking a brass screw (3/32\") and sanding down the threads until only 1-2 threads remain. This should be ~1 mm as this screw will sit within the skull and is not intended to penetrate brain tissue.",
    "Cut a 30 mm length of copper wire (the exact length will depend on where on the skull to place the animal ground). The copper wire should be 100 - 500 μM (0.004-0.02\") in diameter, this is roughly equivalent to 38 AWG thru 24 AWG wire. Apply solder flux to both ends of the copper wire. On one end, solder the ground screw to the wire. On the other end, solder an EIB gold pin. This ground wire can be set aside and connected to the EIB later during the implantation surgery.\nThe next step is to guide the electrodes through the polyamide tubes and connect them to the channel holes on the EIB chip. Turn the drive screw fully clockwise so that the tubes are at their top position.\nFor single electrodes, cut a 50 mm length of Stableohm 50 μM wire and guide it through one polyamide tube, allowing it to extend at least 2.0 mm past the tube end (for targeting subiculum or hippocampus). Apply a small drop of cyanoacrylate at the top of the tube, affixing the wire to the tube and preventing any wire movement. Next, connect the loose end of the wire to an EIB channel hole using a gold pin. Trim off any excess wire with fine scissors. Repeat for other microelectrodes.",
    "For connecting tetrodes, take one completed tetrode out of the storage box. Guide the fused end of the tetrode through one polyamide tube and allow it to extend at least 2.0 mm past the tube end (for subiculum or hippocampus). Apply a small drop of cyanoacrylate at the top of the tube, affixing the tetrode to the tube and preventing any movement. Take the four loose wires at the other end of the tetrode and connect each wire to an EIB channel hole using a gold pin. Trim off any excess wire. Repeat for the other tetrodes.\n3. VersaDrive Assembly\nBegin constructing a four tetrode VersaDrive; this consists of a base, enclosure, and cap pieces.\nCut one polyamide tubing to 10 mm and guide it through the smallest hole on a tetrode carrier. Allow the tube to extend past the carrier very slightly (0.5 mm). Use 5-min epoxy to glue the polyamide tube in place, being careful not to allow the epoxy to go into the tube itself. Repeat this for three other tubes and carriers.\nAfter the epoxy has fully set, guide each polyamide tube through one of the four holes on the VersaDrive base. Once all four tubes are through their holes, push an insect pin through the outer hole; this will hold the tetrode carrier in line and serve as a rail for the carrier to travel on. Repeat this for the three other carriers.",
    "Take a cap and line it up with the four insect pins so that the cap covers the base and the tetrode carriers reside within the cap. Thread a 1 mm x 5 mm machine screw through the appropriate hole in the cap and into the tetrode carrier. This will be the drive screw for moving the carrier up and down. Repeat this for the other three screws.\nTurn all screws clockwise until tetrode carriers are at their top position and the polyamide tubes are visible through the cap opening. Using fine micro dissecting scissors, cut the tubing just below (1 mm) the base so that all four polyamide tubes are of the same length.\nUsing a dissecting microscope, carefully thread one tetrode through a polyamide tube. It is important to keep the tetrode wire perfectly straight as it advances through the tube as any kinks or bends will make it very difficult to fully thread the tetrode through. Repeat for three other tetrodes.\nOnce all the tetrodes are in their tubes, carefully apply a small drop of cyanoacrylate to the top of each tube, securing the tetrodes within their respective tubes. Take caution not to get any cyanoacrylate between the carriers or on the loose tetrode wires that are protruding through the cap.\nCut the tetrodes so that they only extend past the tubes 2.0 mm (for subiculum or hippocampus). Then place the drive base (with the four insect pins inserted) into the VersaDrive jig. The other half of the jig will hold the VersaDrive cap that has all the receptacle holes for making the channel connections.\nTurn the drive screw completely counterclockwise so that the tetrodes are in their lowest position.",
    "Before connecting the tetrode wires to the gold receptacles, first connect the ground wires to the cap. The VersaDrive cap has two pin holes for ground connections at the center position of the two rows of holes. Cut a copper wire of at least 30 mm (depends where on the skull to place the ground) and guide it through one of these center holes. The copper wire should be 100 - 500 μM (0.004-0.02\") in diameter, this is roughly equivalent to 38 AWG thru 24 AWG wire. Push a gold receptacle through the hole to catch the copper wire in place and trim any excess wire. On the other end of the copper wire, apply flux and solder this wire end to a ground screw (see 2.11.). Repeat for the second ground wire.\nNext, guide all the loose tetrode wires (there should be sixteen in total) through their respective receptacle holes on the cap. It's best to start with one tetrode and thread the individual wires to the appropriate four holes that will end up directly above it. The individual tetrode wires should be handled with light pressure as they are fragile and can crimp easily if gripped too firmly. Install the cap by lining up the insect pins holes and press fitting to the base.",
    "With the tetrode wires protruding through the cap, press fit the gold receptacles to capture the tetrode wires in place and make the electrical connections. Approximately 50% of the wires will be clipped off (above the cap) once the gold receptacle is pushed down. Trim any excess wire that remains protruding from the top of the cap. In rare instances (less than 5%), pushing the down gold receptacle will crush the wire and break it below receptacle, resulting in a disconnected channel. This disconnection may not be realized until the impedance testing and electroplating steps (see 4.7).\nRepeat the press-fitting process for the three other tetrodes. Turn the drive screws clockwise to move them back to the top and ensure that the drive movement is smooth.\n4. Gold-plating of Electrode Tips\nRegardless of what type of microelectrodes being used, the tips of the electrodes should be gold-plated in order to reduce tip impedance. This will maximize the ability to reliably record and discriminate single-unit action potentials. Test the electrode impedance using the Neuralynx nanoZ device. The nanoZ is a computer-based device that measures impedance and allows for automated electroplating.\nFirst turn the microdrive screws down (counter-clockwise) to their lowest position. Then securely mount the microdrive on a clamp that will allow lowering of the electrode tips into the gold plating solution.\nFill one Delrin tower with SIFCO Gold solution and the other tower with distilled water. Lower the electrode tips into the gold solution.\nPlug the nanoZ USB cable into a Windows-based computer and then open the nanoZ program. This program will give impedance readings and perform gold-plating on each connected channel of the microdrive.",
    "Go to the Device drop-down and select the nanoZ, after which it will show \"Connection established\" at the bottom of the window. Next, select the appropriate adaptor for testing in the drop-down menu. Click on \"Test impedances\" and set the test frequency to 1004 Hz (40 cycles, 0 msec pause). Click on \"Test probe\", which will open the \"Probe Report\" window that shows all the available channels with their MΩ readings. Save these impedance values by clicking on the disk icon or by selecting \"File\", then \"Save report\".\nNext, click on \"DC Electroplate\" and assign the following values: Mode = match impedances, Plating current = -1.0 μA, Target = 350 kΩ at 1,004 Hz, 5 runs, 5 sec interval, 2 sec pause.\nClick \"Autoplate\". The program will first read the impedance of each channel, then apply the specified current to that channel, re-test the impedance and apply current as needed until the Target impedance (or a lower value) is reached. While the goal is to reduce electrode impedance, it is possible that channels will electroplate below values of 100 kΩ. In such cases, it is possible that neighboring wires on the tetrode have been shorted together. If this happens, reverse the current polarity (+ 1.0 μA) to remove excess gold particles, re-test the impedance of that channel, and then repeat the electroplating. Typical final impedance values on a bundle of four 12.5 μM wires range from 150 - 325 kΩ.\nIf there is any single channel that has not plated below 350 kΩ, repeat the electroplating process. The program will skip over channels that have already reached the Target and will only plate channels which have not.",
    "Once all channels have been plated to an acceptable impedance, close the nanoZ program and disconnect the device. Raise the electrodes out of the plating solution and lower the tips into the distilled water Delrin tower in order to rinse off excess gold particles.\nTurn the drive screws clockwise until the electrodes are raised to their top position. Now the microdrive and electrodes are ready for implantation.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}