{
  "id": 13230,
  "origin_website": "Jove",
  "title": "Microwaving and Fluorophore-Tyramide for Multiplex Immunostaining on Mouse Adrenals − Using Unconjugated Primary Antibodies from the Same Host Species",
  "procedures": [
    "1. Staining with the First Antibody\nDewax and rehydrate FFPE slides with 5 min allotted to each of the following steps: xylene or equivalent reagents 3x, 100% ethanol 2x, 95% ethanol 1x, 70% ethanol 1x, 50% ethanol 1x, and distilled water 2x.\n\tNOTE: Slides should remain moist starting from this rehydration step until mounting in the final step.\nFor optional antigen retrieval, place the slides in 275 mL of boiling sodium citrate solution (10 mM, pH = 6.0) for 8 min. To keep the solution boiling, place the slides flat on the bottom of a 14 x 9.5 x 9 cm3 (W x L x H) pipette tip box with a lid and microwave the solution on 70% power in a 700 W microwave oven for 8 min. Then remove the pipette tip box from the microwave oven, open the lid, and let the solution cool down at room temperature (RT) for at least 20 min.\nTransfer the slides into a Coplin jar containing PBST (phosphate-buffered saline with 0.1% polysorbate 20/80). Wash with PBST for 5 min 3x. If not immediately moving to the next step, store the slides at this step with PBST in a Coplin jar at RT for a few hours or at 4 °C for 1-2 days if not immediately moving to the next step.\nTo prepare the blocking solution use the normal serum of the secondary antibody's host species as the blocking reagent. Other commercial blocking reagents may also be used. If using normal serum employed for the study presented in this study, add 100 µL of normal donkey serum to 4.9 mL of PBST. The blocking solution can be stored at 4 °C for up to 3 days.",
    "For blocking, shake off the PBST from the slides and quickly cover them with sufficient blocking solution. Incubate the slides at RT in a humidified chamber for 30 min.\nPrepare the primary antibody solution (500 µL for two slides) using the blocking solution to dilute the primary antibody to the desired concentration. The solution should be stored on ice until use.\n\t\nFor 3βHSD, add 2 µL of 3βHSD into 498 µL of blocking solution.\nFor TH, add 0.5 µL of TH antibody into 499 µL of blocking solution.\nFor β-catenin, add 1 µL of β-catenin antibody into 499 µL of blocking solution.\nFor 20αHSD, add 1 µL of 20αHSD antibody into 499 µL of blocking solution.\nFor CYP2F2, add 2 µL of CYP2F2 antibody into 498 µL of blocking solution.\nIncubate with the primary antibody by shaking off the blocking solution from the slides, and quickly covering them with sufficient primary antibody solution. Incubate the slides in a humidified chamber overnight at 4 °C. During incubation the slides may be covered by a small piece of paraffin film to prevent drying out.\nThe next morning wash the slides with PBST for 5 min 3x.\nPrepare the secondary antibody solution (500 µL for two slides) using the blocking solution to dilute the biotinylated secondary antibody to the desired concentration (e.g., 1 µL of donkey anti-mouse antibody or donkey anti-rabbit antibody into 499 µL of blocking solution). The solution should be stored on ice until use.\nIncubate with the second antibody by shaking off PBST from the slides and quickly covering them with sufficient secondary antibody solution. Incubate the slides in a humidified chamber for 1 h at RT.",
    "NOTE: If endogenous biotin is a concern, use a peroxidase-conjugated secondary antibody instead of the biotinylated secondary antibody. Jump to step 1.14 if using a peroxidase-conjugated secondary antibody in step 1.10.\nWash the slides with PBST for 5 min 3x.\nPrepare the horseradish peroxidase-conjugated streptavidin (SA-HRP) solution (500 µL for two slides) by adding 0.5 µL of SA-HRP into 499 µL of PBS. The final concentration is 1 µg/mL.\nIncubate with the SA-HRP solution. Shake off PBST from the slides and quickly cover the slides with sufficient SA-HRP solution. Incubate the slides in a humidified chamber for 0.5 h at RT.\nWash the slides with PBST for 5 min 3x.\nPrepare the fluorophore-tyramide solution by diluting fluorophore-tyramide with its dilution buffer according to the manufacturer's instructions (e.g., 5 µL of fluorophore-tyramide into 496 µL of dilution buffer).\nPerform the signal development with fluorophore-tyramide by shaking off PBST from the slides and quickly covering the slides with sufficient fluorophore-tyramide solution. Incubate in a humidified chamber for 1 min at RT. The incubation time may be adjusted to obtain the desired fluorescence intensity. Stop the reaction by transferring the slides to a Coplin jar containing PBST. Wash slides with PBST for 3 min 2x.\nSignals may be quickly checked under a fluorescence microscope to confirm the result at this stage. If coverslips are not being used, apply a drop of glycerol:PBS (1:1) onto each section to keep the samples moist. Wash slides with PBST for 3 min 2x. Slides may be stored in PBST at 4 °C for a few days before moving to the next step.\n2. Strip the First Antibody",
    "Place the slides in 275 mL of boiling sodium citrate solution (10 mM, pH = 6.0) for at least 8 min. Keep the solution boiling by placing the slides flat on the bottom of a 14 x 9.5 x 9 cm3 (W x L x H) pipette tip box with a lid and microwaving the solution on 70% power in a 700 W microwave oven for 8 min. If a longer stripping time is preferred, it may be required to top off the buffer using a boiling sodium citrate solution to keep the slides immersed in buffer solution at all times. Remove the pipette tip box from the microwave oven, open the lid, and let the solution cool down at RT for at least 20 min.\nTransfer the slides into a Coplin jar containing PBST. Wash with PBST for 5 min 3x. If the next step if not performed immediately, store the slides in a Coplin jar with PBST at RT for a few hours or at 4 °C for 1-2 days.\n3. Stain with the Second Antibody\nStart from the blocking step and follow same procedures in step 1.5 through step 1.14. At the signal development steps (step 1.15 and step 1.16), use the fluorophore-tyramide in a different fluorescence spectrum.\n\tNOTE: Slides can be stripped using this method several times to allow multiplex staining. The last antibody does not require fluorophore-tyramide as the reporter. A fluorophore-conjugated secondary antibody might be used to show signals from the last primary antibody.\nIncubate slides with 2 µg/mL 4',6-diamidino-2-phenylindole (DAPI) or Hoechst solution for 1 min at RT if nuclear counter staining is needed. Then wash the slides with PBST for 3 min 2x.\n4. Imaging Using a Fluorescence Microscope to Detect Signals",
    "Mount a coverslip with a drop of mounting medium suitable for immunofluorescence.\nFor imaging, use a fluorescence microscope to detect signals of each fluorescence channel. Start with the nuclear staining (DAPI) channel and the 4x lens to locate the tissue on the slide.\nSwitch to the 10x lens for imaging. Adjust the exposure time (300 ms) and light source intensity (80% intensity). Adjust these settings if the signal is too bright or too dark. Take pictures of each channel without moving the stage. Refocusing may be needed for each channel. Merge the images from each channel using the microscope's software or ImageJ (imagej.nih.gov/ij/).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}