{
  "id": 8108,
  "origin_website": "Bio",
  "title": "Macromolecular Biosynthesis Assay for Evaluation of Influence of an Antimicrobial on the Synthesis of Macromolecules",
  "procedures": [
    "Note: The glass tubes for incubation must be pre-warmed and the reagents and tubes for precipitation must be pre-cooled; to assess the interference with biosynthesis of one macromolecule prepare 14 pre-warmed glass tube (untreated control, investigated antimicrobial and five control antimicrobials, in duplicates). Overnight bacterial culture (for S. aureus WSPPA approximately 1.5 x 108 CFU/ml) prepared in TSB is diluted 1:100 in 10 ml CDM and, for [3H] Leucine incorporation, in 10 ml CDM-Leu.Note: For S. aureus WSPPA the overnight and logarithmic-phase cultures are prepared in 15 ml TPP centrifuge tubes, without shaking.Incubation: 5 h, 37 °C.Note: The incubation time must be adjusted respectively to the strain in order to reach the logarithmic growth phase.The log-phase culture (0.9 ml for S. aureus WSPPA, which corresponds to approximately 2 x 107 CFU) is transferred in duplicates to pre-warmed glass tubes and all antimicrobials at concentration of 4x MIC are added; untreated controls are incubated with an adequate volume of a solvent used to prepare solution of investigated antimicrobial.Note: Untreated control must be prepared in exactly the same solvent as used for the antimicrobial of interest to control for the effect of solvent on bacterial biosynthesis. It is therefore recommended to dilute all antimicrobials to the concentrations of 4x MIC in the same solvent, which additionally does not interfere with bacterial viability (e.g. PBS). If due to its chemical properties any substance needs to be diluted in a harsh solvent then a concentrated stock solution is prepared in the harsh solvent followed by diluting in a mild solvent to the 4x MIC to reduce the concentration of the first solvent below a level affecting bacteria. The untreated controls are prepared in exactly the same way for incorporation of each of the precursors.",
    "The samples are mixed thoroughly and [3H]-labelled precursors are immediately transferred to separate tubes: [3H] N-acetylglucosamine up to a concentration of 0.1 μCi per ml (for peptidoglycan synthesis)[3H] Uridine up to 1 μCi per ml (for RNA synthesis)[3H] Thymidine up to 1 μCi per ml (for DNA synthesis)[3H] Leucine up to 3 μCi per ml (for protein synthesis)Incubation: 37 °C.At time points of interest 0.5 ml aliquots are transferred into 2 ml ultracentrifuge tubes containing 1 ml of ice-cold 10% TCA, mixed thoroughly and placed on ice for at least 1.5 h to facilitate the precipitation. Note: Time points of interest can be determined in the time-killing study according to Clinical and Laboratory Standards Institute guidelines (see Reference 1). For S. aureus WSPPA time point of 1 h was chosen.The precipitates are washed one time with 0.5 ml of 5% TCA/1.5 M NaCl followed by one-time washing with 0.5 ml of 5% TCA (16,100 x g, 10 min, 20 °C), supernatants are removed using vacuum pump.After the second wash samples are solubilised with 0.5 ml of 0.1% SDS/0.1 M NaOH by vortexing at room temperature.The solubilised precipitates are transferred into scintillation tubes and thoroughly mixed with 2 ml of scintillation cocktail.The incorporated radioactivity is measured in counts per minute using liquid scintillation analyser and the results are expressed as percentage of untreated control (Figure 1A - 1D).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130613/20130613081942_6755.jpgFigure 1. Inhibition of biosynthesis of macromolecules by EN4.",
    "Incorporation of [3H] N-acetylglucosamine (A), [3H] Uridine (B), [3H] Thymidine (C) and [3H] Leucine (D) by WSPPA treated for 1 h with EN4, vancomycin (VAN), actinomycin D (ActD), ciprofloxacin (CIP), chloramphenicol (CHL) or chlorhexidine (CHX) at 4x MIC, was expressed as percentage of untreated control (for peptidoglycan = 3444 ± 1212 cpm, RNA = 115538 ± 19533 cpm, DNA = 13862 ± 762 cpm, protein = 7065 ± 323 cpm); values shown are the means of at least two independent experiments prepared in duplicates ± SDs; dotted lines represent 100% incorporation. Significant reduction of biosynthesis as compared to results for the untreated control is indicated; *, P < 0.05; **, P < 0.01; ***, P < 0.001 by one-way ANOVA (Kruskal-Wallis test) with a Dunns post test. (Nowakowska et al., 2013)"
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}