{
  "id": 19026,
  "origin_website": "Jove",
  "title": "Identification of Sleeping Beauty Transposon Insertions in Solid Tumors using Linker-mediated PCR",
  "procedures": [
    "1. Breeding and Aging of Transgenic Animals\nSelect the strains of transgenic mice appropriate for your experiment. A typical experiment will use three transgenic lines; a conditional transposase mouse, a mouse harboring a concatamer of transposons, and a mouse expressing Cre Recombinase in the cells believed to be the cells of origin for the desired cancer. If the cancer being modeled has a known mutation in a large percentage of the patients it may be desirable to include this mutation at the start. Examples of these \"predisposing\" mutations include activated Kras, dominant negative Tp53 or a floxed Pten allele. By adding in a predisposing mutation the model may better represent the human cancer (see 1.3). Several Sleeping Beauty transposase and transposon mice are available from the National Cancer Institute Mouse Repository (http://mouse.ncifcrf.gov/[href=http://mouse.ncifcrf.gov/]).\nBreed conditional transposase mice with mice harboring the transposons to eventually obtain mice homozygous for both alleles if possible. Breed homozygous offspring to mice expressing Cre Recombinase to generate your triple transgenic experimental mice (Figure 2). Note: Obtaining homozygous mice are not always possible or ideal. For example, homozygous p53 dominant negative mice are much more difficult to breed than heterozygous mice. In addition, it is helpful to make sure that litters follow Mendelian genetics to confirm that the breeding scheme is successful.\nIf using a predisposed background, first breed mice with the transposase to mice with the predisposing allele. Simultaneously, breed mice expressing Cre Recombinase to mice carrying the transposons. Create homozygous mice for each allele if possible. Finally, breed the homozygous offspring from the previous two breeding schemes to generate quadruple transgenic experimental animals.",
    "In addition to the experimental animals, generate control cohorts of mice. The control group normally consists of littermates from the experimental breeding that only inherit two of the three alleles (Figure 2). In the case of a predisposed background, mice including three out of the four alleles will also be necessary.\nMonitor experimental and control mice daily for tumor development and/or moribundity. Follow your institutional animal care and use committee (IACUC) requirements for animal husbandry. Also, it is typical to determine an age in which you will sacrifice an animal if it has not yet become moribund. Eighteen months is a typical age at which mice are euthanized.\n2. Necropsy of Transgenic Animals\ntable:\n﻿0,1,2\nName of the reagent,Company,Catalogue number\nSure-Seal Induction Chamber,Brain Tree Scientific,EZ-177\nCryovial,Bioexpress,C-3355-2\n10% Buffered Formalin,Sigma Aldrich,HT501128-4L\nTable 1. Reagents required.\nWhen a mouse is moribund or has reached the end of the determined life span, euthanize animal using a CO2 chamber following your IACUC guidelines. Generally, place the animal in a clean gas chamber, open the gas tank and adjust the regulator to read no higher than 5 pounds per square inch. Fill slowly to minimize nasal and ocular irritation and aversion to CO2. Make sure that the animal's heart is no longer beating and does not respond when touched in the eye.\nSpray exterior of sacrificed mouse with 70% ethanol.",
    "Place mouse on a necropsy board and secure with dissecting pins. Use scissors and tweezers to open mouse and remove organs. Determining which organs should be collected is project dependent. However, it is recommended to always collect the spleen and liver as these organs often give important insight into why the mouse was moribund. Also collect the sternum for the potential analysis of bone marrow. In addition, it is always beneficial to collect any organ or tissue that appears abnormal.\nTissues and tumors that are collected should be divided into four sections. One section is fixed in 10% buffered formalin for 18 hr followed by 70% ethanol. This section can be used for H&E staining and/or IHC. The remaining three sections, which are generally 50 to 100 mg in size, are snap frozen in liquid nitrogen. These can be used for DNA, RNA and protein isolation.\nDispose of carcass and remaining tissues according to IACUC guidelines.\n3. Isolating Genomic DNA from Tumors\ntable:\n﻿0,1,2\nName of the reagent,Company,Catalogue number\nProtein Precipitation solution,Qiagen,158910\nCell lysis buffer,Qiagen,158906\nProteinase K,Qiagen,158920\nRNase A,Qiagen,158924\nTE Buffer,Promega,V6232\nTable 2. Reagents required.\nFinely mince the frozen tumor sample (50 to 100 mg) using a clean razor blade.\nPlace minced tissue in a 1.5 ml microcentrifuge tube and add 1 ml of cell lysis buffer containing 5 μl Proteinase K solution (20 mg/ml).\nVortex thoroughly.\nIncubate in a 55 °C shaker set at 250 rpm for at least 4 hr, preferably overnight.\nAdd 1 μl RNase A solution (10 mg/ml) and invert tube 25 times.\nIncubate at 37 °C for 30 min.\nCool to room temperature by placing on ice for 3 min.\nAdd 333 μl Protein Precipitation solution and vortex vigorously.",
    "Centrifuge at 14,000 rpm 10 min. Proteins should pellet. If pellet is very small, vortex again, incubate on ice for 5 min, and then re-centrifuge.\nPour off supernatant containing DNA into a clean 15 ml centrifuge tube.\nAdd equal volume of 100% isopropanol and mix by gently inverting 50 times.\nCentrifuge at 3,500 rpm for 3 min.\nDiscard supernatant.\nAdd 1 ml of 70% ethanol and invert tube several times to wash the pellet.\nTransfer the washed pellet along with the ethanol to a 1.5 ml microcentrifuge tube.\nCentrifuge at 14,000 rpm for 5 min at 4 °C.\nPour off ethanol and invert tube to air dry (approximately 5 to 30 min).\nResuspend DNA pellet in 50 to 500 μl of TE depending on size of DNA pellet.\nOptional incubation at 37 °C to resuspend DNA.\nStore at 4 °C, or -20 °C for long term storage.\n4. Linker Mediated-PCR Using Genomic DNA from Tumors\ntable:\n﻿0,1,2\nName of the reagent,Company,Catalogue number\nBfaI,New England Biolabs,R0568S\nNlaIII,New England Biolabs,R0125S\nMinElute 96 well plates,Qiagen,28051\nQIAvac 96 Vacuum manifold,Qiagen,19504\n\"Multi-MicroPlate Genie, 120V\",\"Scientific Industries, Inc.\",SI-4000\nT4 DNA ligase with 5x ligation Buffer,Invitrogen,15224-041\nBamHI,New England Biolabs,R0136S\n25 mM dNTPs,Bioexpress,C-5014-200\nPlatinum Taq,Invitrogen,10966-034\nFastStart Taq DNA Polymerase,Roche,12032929001\nAgarose,Promega,V3121\nTAE Buffer,Promega,V4271\nTE Buffer,Promega,V6232\nEthidium bromide,Promega,H5041\nTable 3. Reagents required.\nLinker Sequences\nBfaI linker + 5' GTAATACGACTCACTATAGGGCTCCGCTTAAGGGAC 3'\nBfaI linker- 5' Phos-TAGTCCCTTAAGCGGAG 3'NH2\nNlaIII linker+ 5'GTAATACGACTCACTATAGGGCTCCGCTTAAGGGACCATG 3'\nNlaIII linker- 5' Phos-GTCCCTTAAGCGGAGCC 3'\nPrimer Sequences\nPrimary PCR forward right side (NlaIII): Spl IRDR R1 1 GCTTGTGGAAGGCTACTCGAAATGTTTGACCC\nPrimary PCR forward left side (BfaI): Spl IRDR L1 1 CTGGAATTTTCCAAGCTGTTTAAAGGCACAGTCAAC\nPrimary PCR reverse for both right and left side: Spl Link1 1 GTAATACGACTCACTATAGGGC",
    "Secondary PCR forward right side: Example of an Illumina barcoded secondary primer 5' AATGATACGGCGACCACCGAGATCTACACTCTTTCCCTACACGACGCTCTTCCGATCTNNNNNNNNNNNNaGgtgtatgtaaacttccgacttcaa (The N's represent the 12 bp barcode, sequence in upper case are required for the Illumina platform, and the sequence in lower case will bind to the transposon.)\nSecondary PCR forward left side: Example of an Illumina barcoded secondary primer 5'AATGATACGGCGACCACCGAGATCTACACTCTTTCCCTACACGACGCTCTTCCGATCTNNNNNNNNNNNNaAgtgtatgtaaacttccgacttcaa (The N's represent the 12 bp barcode, sequence in upper case are required for the Illumina platform, and the sequence in lower case will bind to the transposon.)\nSecondary PCR reverse for both right and left side: linker nested reverse primer 5' CAAGCAGAAGACGGCATACGAGCTCTTCCGATCTAGGGCTCCGCTTAAGGGAC\nAnneal the + and - linkers for both BfaI linkers and NlaII linkers by mixing 50 μl of linker+ (100 μM) with 50 μl of linker- (100 μM) and add 2 μl NaCl (5 M) in a 1.5 ml microcentrifuge tube. Place in 95 ° C heat block for 5 min. Turn off heating block and let slowly cool to room temperature (this takes an hour or more). After cooling, annealed linkers may be stored in a -20 °C freezer until needed.\nPrepare two aliquots of the tumor DNA, each aliquot containing 1 μg of DNA. One aliquot will be digested with a restriction enzyme that will cut close to the \"right\" end of the transposon. The second aliquot will be digested with a restriction enzyme that cuts close to the \"left\" end of the transposon. This is done to maximize the chances of amplifying every transposon insertion site.",
    "Digest the tumor DNA in one aliquot using the \"right\" side enzyme NlaII, and digest the tumor DNA in the other aliquot using the \"left\" side enzyme BfaI: combine 1 μl of enzyme, 5 μl 10x NEB Buffer #4, DNA (1 μg) and ddH2O to a total volume of 50 μl. Digest DNA overnight at 37 ° C in water bath or incubator.\nHeat inactivate enzymes (BfaI = 80 °C for 20 min, NlaIII = 65 °C for 20 min).\nClean the digested samples by placing samples in MinElute 96 well plate, place plate in vacuum manifold and vacuum for about 15 min until wells look dry.\nRemove plate from vacuum manifold and blot bottom of 96 well plate with paper towel to remove all liquid\nAdd 30 μl ddH2O to each well and shake on an orbital shaker set on high for 2 min, or pipette up and down 20 to 40 times.\nTransfer entire volume in wells (30 μl) from MinElute 96 well plate into clean 96 well plates.\nPerform linker ligation reactions with digested DNA from step 4.8 and linkers from step 4.1. Mix 10 μl digested DNA, 4 μl 5x ligation buffer, 5.5 μl annealed linkers (950 μg/μl), 0.5 μl T4 ligase (5 U/μl).\nIncubate for 4 hr to overnight at 16 °C.\nHeat inactivate the T4 DNA ligase at 65 °C for 10 min.\nClean up ligation using MinElute 96 well plates and a vacuum manifold as described in steps 4.5 - 4.6.\nResuspend in 30 μl H2O and transfer to a clean 96 well plate.",
    "Perform a second DNA digestion in order to destroy remaining concatamer transposons. This is achieved by cutting the DNA a second time using an enzyme that cuts the plasmid vector DNA that was used to create the transgenic mice containing the transposon concatamer.\nDigest DNA using BamHI (both left and right side): Mix 25 μl of linker-ligated DNA from step 4.13, 5 μl 10x NEB buffer #3, 0.5 μl BamHI (20 U/μl), 0.5 μl BSA (10 mg/ml), and 19 μl ddH2O.\nDigest 3-6 hr or overnight at 37 °C.\nPerform primary PCR using a primer specific for the transposon and a primer specific for the linker. These will vary depending upon what transposon and linker you are using. The primers listed in the primer table above work for the T2/Onc and T2/Onc2 transposons.\nPrimary PCR: 5 μl 10x buffer, 2.0 μl MgCl2 (50 mM), 4 μl dNTPs (2.5 nM), 1 μl Primer 1 (20 μM), 1 μl Primer 2 (20 μM), 0.25 μl Platinum Taq (5 U/μl), 3 μl Digested DNA with linkers (amount can vary), up to 50 μl ddH2O.\nPCR Program: 94 °C for 5 min, 30 cycles of 94 °C for 30 sec, 60 °C for 30 sec, 72 °C for 90 sec. Final extension at 72 °C for 5 min.\nClean up PCR product using MinElute 96 well plates and a vacuum manifold as described above.\nResuspend in 30 μl H2O and transfer to a clean 96 well plate.\nMake a 1:75 dilution of the 1 ° PCR by diluting 2 μl of DNA from step 4.21 into 148 μl ddH2O",
    "Perform secondary PCR using nested versions of the primers that also have the required sequence for the Illumina GAIIx machine as well as a 12 base pair barcode that is unique for each tumor sample processed (see primer table above for examples of these primers).\nSecondary PCR: 10 μl 10x Buffer with MgCl2, 8 μl dNTPs (2.5 mM), 1 μl Illumina barcoded secondary primer (20 μM), 1 μl Illumina Nest 1 secondary primer (20 μM), 0.25 μl FastStart Taq (5 U/μl), 2 μl DNA from primary PCR diluted 1:75, up to 100 μl ddH2O.\nPCR Program: 94 °C for 2 min, 30 cycles of 94 °C for 30 sec, 53 °C for 45 sec, 72 °C for 90 sec. Final extension at 72 °C for 5 min.\nRun 45 μl of this PCR reaction on a 1% agarose gel containing ethidium bromide (0.5 μg/ml). There should be a \"smear\" of PCR products representing amplicons of the many different transposon insertions in the tumor (Figure 3).\nClean up remaining 50 μl of PCR product using MinElute 96 well plates and a vacuum manifold as described above. Wash one time by placing 50 μl ddH2O in the wells and vacuuming again.\nResuspend in 30 μl TE and transfer to a clean 96 well plate.\nDetermine the concentration of DNA in each sample. Combine equal amounts of DNA in a single 1.5 ml microfuge tube. This will be the library that is sequenced in a single lane of an Illumina HiSeq 2000 machine. It is possible to sequence several hundred tumors in a single lane of an Illumina run.\nSubmit the single tube containing equal amounts of DNA from all the tumors for sequencing. This can be done by your institution or commercially.\n5. Analysis of Transposon Insertions",
    "Software for analyzing transposon insertion data is available for free download via SourceForge (http://sourceforge.net/projects/tapdancebio/[href=http://sourceforge.net/projects/tapdancebio/]). The program, called TapDance, requires the sequence file from the Illumina platform and a barcode to library map text file.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}