{
  "id": 8593,
  "origin_website": "Jove",
  "title": "Electrophysiological Investigations of Retinogeniculate and Corticogeniculate Synapse Function",
  "procedures": [
    "All the experiments were approved by the Governmental Supervisory Panel on Animal Experiments of Rhineland-Palatinate.\n1. Solutions\nDissection solution\n\t\nTo reduce excitotoxicity, prepare a choline-based solution to be used during the dissection as presented here (in mM): 87 NaCl, 2.5 KCl, 37.5 choline chloride, 25 NaHCO3, 1.25 NaH2PO4, 0.5 CaCl2, 7 MgCl2, and25 glucose. Prepare the dissection solution less than 1 week before the experiment.\nRecording solution\n\t\nPrepare an artificial cerebral spinal fluid (ACSF) solution containing (in mM): 125 NaCl, 25 NaHCO3, 1.25 NaH2PO4, 2.5 KCl, 2 CaCl2, 1 MgCl2, and 25 glucose. Add 50 µM D-APV and 10 µM SR 95531 hydrobromide to block N-methyl-D-aspartate (NMDA) and GABAA receptors, respectively.\nIntracellular solution\n\t\nPrepare an intracellular solution containing (in mM): 35 Cs-gluconate, 100 CsCl, 10 HEPES, 10 EGTA, and 0.1 D-600 (methoxyverapamil hydrochloride). Adjust the pH to 7.3 with CsOH. Filter, aliquot, and store the stock solution at -20 °C until use.\n2. Dissection\nPrepare two slice chambers, of which one is filled with 100 mL of the dissection solution and the other with 100 mL of recording solution. Place the two beakers into a water bath (37 °C) and bubble the solutions with carbogen for at least 15 min before the dissection.\nFill a plastic beaker with 250 mL of near ice-cold (but not frozen) dissection solution. Bubble with carbogen at least 15 min before use.\nFill a plastic Petri dish (100 mm x 20 mm), in which the brain dissection will be performed, with the cold dissection solution. Place a piece of filter paper into the lid of the Petri dish.\nCool down the dissection chamber of the vibratome.",
    "Anesthetize a mouse with 2.5% isoflurane, e.g., in the mouse cage. As soon as the mouse does not respond to a tail pinch, decapitate the mouse near the cervical medulla and immerse the head into the ice-cold dissection solution in the base of the Petri dish.\nCut the skin of the head from caudal to nasal and keep it laterally with fingers to expose the skull. To take out the forebrain, first cut the skull along with the posterior-anterior midline, and then cut two more times through the coronal suture and lambdoid suture (Figure 1A).\nRemove the skull between the coronal suture and lambdoid suture such that the cerebrum is exposed. Cut the olfactory bulb and separate the forebrain from the midbrain with a fine blade (Figure 1B). Remove the brain from the skull with a thin spatula and place it onto the filter paper in the lid of the Petri dish.\n\tNOTE: Steps 2.6 and 2.7 should be performed as fast as possible to reduce cell death.\nTo preserve the integrity of the sensory and cortical inputs to the dLGN in the brain slice, separate the two hemispheres with a parasagittal cut with an angle of 3−5° (Figure 1C,D). Dry the mediolateral planes of the two hemispheres by placing them on the filter paper and then glue them onto the cutting stage with an angle of 10−25° from the horizontal plane (Figure 1E).\nPlace the stage in the center of the metal buffer tray and gently pour the rest of the ice-cold dissection solution into the buffer tray. Perform this step carefully since a strong pour might remove the pasted brain (Figure 1F).",
    "Place the buffer tray into the ice-filled tray, which helps to maintain the low temperature during dissection. Cut 250 µm slices with a razor blade at a speed of 0.1 mm/s and an amplitude of 1 mm.\nKeep slices in the holding chamber filled with oxygenated dissection solution at 34 °C for around 30 min and then allow the slices to recover in the recording solution at 34 °C for another 30 min.\nAfter recovery, remove the slice holding chamber from the water bath and keep slices at room temperature (RT) until used in experiments.\n3. Electrophysiology\nPull pipettes using borosilicate glass capillaries and a filament puller. Maintain the resistance of recording pipettes at 3−4 MΩ. Pull stimulating pipettes using the same protocol but break the tip slightly after pulling to increase the diameter. Fill recording pipettes with the intracellular solution and biocytin, while fill stimulating pipettes with the recording solution.\nPlace the slices into the recording chamber and continuously perfuse the slices with oxygenated recording solution at RT. Check all the slices and select the ones that display an intact optic tract.\nVisualize the slice and cells with an upright microscope equipped with infrared differential interference contrast (IR-DIC) video microscopy.\n\tNOTE: Relay neurons are differentiated from interneurons by their larger soma size and more primary dendrites (branches emerging from the soma). Interneurons display bipolar morphology with a smaller soma.\nPlace the stimulating pipette onto the slice before patching the cell with the recording pipette. To investigate retinogeniculate synapses, place the stimulating pipette directly onto the optic tract, where the axon fibers from retinal ganglion cells are bundled (Figure 2A). To analyze corticogeniculate synapses, place the stimulating electrode on the nucleus reticularis thalami, which is rostroventrally adjacent to the dLGN (Figure 2B).",
    "Once the recording pipette is immersed into the recording solution, apply a 5 mV voltage step to monitor the pipette resistance. Set the holding potential to 0 mV and cancel the offset potential so that the holding current is 0 pA.\nApproach the cell with the recording pipette while applying positive pressure. When the pipette is in direct contact to the cell membrane, release the positive pressure, and set the holding potential to -70 mV. Apply a slight negative pressure to allow the cell membrane to attach to the glass pipette such that a gigaohm seal forms (resistance >1 GΩ). Compensate the pipette capacitance and open the cell by application of negative pressure pulses.\nTo investigate the synaptic function, apply 0.1 ms current pulses (ca. 30 µA) via the stimulation pipette. If no synaptic responses are observed, the stimulating pipettes may have to be replaced. Be careful during placing the stimulating pipettes to a different position such that the recorded cell is not lost.\n\tNOTE: In the example recordings shown in Figure 2, synaptic short-term plasticity was investigated by stimulating the optic tract or corticogeniculate fibers twice with 30 ms inter-stimulus intervals. The paired-pulse ratio (PPR) was calculated by dividing the amplitude of the second excitatory postsynaptic current (EPSC) by that of the first EPSC (EPSC2/EPSC1). Each stimulation protocol was repeated 20 times. The EPSC amplitude was measured from average currents of the 20 sweeps. The time interval between each repetition was least 5 s to avoid short-term plasticity induced by the repetitions.\nMonitor the series resistance continuously by applying a 5-mV voltage step. Only use the cells with the series resistance smaller than 20 MΩ for analysis.\n4. Biocytin labeling\nMaintain the whole-cell configuration for at least 5 min to allow the diffusion of biocytin into the distal dendrites.",
    "After recording, gently remove the pipette from the cell so that the soma is not destroyed.\n\tNOTE: If more than one cell is recorded on one slice, their somas should be sufficiently away from their neighboring cells. Ensure that the dendrites from different cells do not interfere with each other during imaging.\nPrepare a 24-well cell culture plate. Fill each well with 300 µL of 4% paraformaldehyde (PFA). Take care to not contaminate anything with PFA that will be in contact with the slices to be recorded.\nTransfer the slices from the recording chamber to the PFA-containing plate with a rubber pipette and fix the slices overnight. Ensure that the pipette is always prevented from PFA contamination.\n\tCAUTION: Always wear gloves and use a chemical hood when manipulating PFA.\nAfter fixing slices overnight in PFA, replace PFA with phosphate-buffered saline (PBS). Store the slices in PBS at 4 °C for future processing (less than 2 weeks).\nWash the slices with fresh PBS 3 times (10 min each wash).\nBlock nonspecific binding sites by incubating the slices in the blocking solution (0.2% non-ionic surfactant and 5% bovine serum albumin in PBS) for 2 h at RT on an orbital shaker.\nDiscard the blocking solution. Incubate the slices with streptavidin-Alexa 568 diluted into the blocking solution (1:1,000) at 4 °C overnight on an orbital shaker.\nDiscard the antibody solution and wash slices 3 times with PBS for 10 min at RT on an orbital shaker. Wash the slices with tap water before mounting.\nPut the slices from one mouse on one glass slide. Ensure that the stained cells are present on the top surface of the slices. Absorb the water around the slices with tissues and then leave the slices to dry for approximately 15 min.",
    "Apply two drops of mounting medium on each slice. Mount a coverslip on the slide without producing air bubbles.\nStore the labeled slices at 4 °C after visualization with a confocal microscope.\n5. Cellular imaging and reconstruction\nScan slices with a confocal microscope and use the associated software for analysis.\nExcite the fluorescence at 561 nm.\nImage the slices with 0.7 numerical aperture (NA), oil-immersion objective.\nAdjust the targeted cell in the middle of the view and apply a 2.5-times magnification.\nRender the Z-stack datasets to scan the whole neuron with the following parameters: format = 2,550 x 2,550 pixels, scan frequency = 400 Hz, z number = 40.Voxel size was around 0.1211 x 0.1211 x 1.8463 µm3.\nSemi-automatically trace the neurons using a neuronal reconstruction software (e.g., NeuronStudio). An example of a 3D traced relay neuron is shown in Figure 3B.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}