{
  "id": 3558,
  "origin_website": "Cell",
  "title": "Protocol for CRISPR-Cas9-mediated genome editing to study spermatogenesis in Caenorhabditis elegans",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCloning of sgRNAs into pDD162\nTiming: 1 week\nThe pDD162 vector contains Cas9 gene sequence. Therefore, cloning sgRNAs into pDD162 makes it possible to express sgRNA and Cas9 in the same cell.\nPCR-amplify the pDD162 using high-fidelity DNA polymerase and primer pairs for insertion of target sequence.\nNote: Reducing the number of PCR cycles and increasing the annealing temperature will be beneficial for high fidelity PCR.\nWe digested the PCR product with DpnI at 37°C for 2 h to remove the circular template plasmid.\ntable:files/protocols_protocol_3127_7.csv\nThe digested products are transformed into DH5α competent cells.\nAdd 5 μL of digested products into 50 μL of DH5α competent cells for transformation.\nThe heat shock treatment follows the protocol from Thermo Fisher Scientific product manuals (catalog number: EC0112).\nSpread the transformed cells on LB plate containing 100 μg/mL ampicillin and incubate at 37°C for 12 h.\nPick 2–3 bacteria colonies into 5 mL of LB medium containing 100 μg/mL ampicillin separately and incubate at 37°C and 200 × g for 12 h.\nIsolate plasmids from the incubation bacteria culture using a plasmid mini-preparation kit.\nAnalysis of successful insertion of sgRNA into pDD162.\nThe clones containing target sequence are identified by Sanger sequencing.\nIsolation and purification of plasmids.\nNote: The purpose of this step is to remove endotoxin and increase the amount of plasmid DNA, which is beneficial for effective DNA transformation of worms.\nIncubate 15 mL LB medium containing 100 μg/mL ampicillin and 30 μL bacteria culture identified containing target sequence at 37°C for 12 h.\nThe incubated bacteria culture is collected into 3 centrifugal tubes. The plasmids are isolated by plasmid mini-preparation kit.",
    "The isolated plasmids are combined into 1 centrifugal tube and purified by quick PCR purification kit to remove endotoxin and increase the amount of plasmid DNA.\nThe concentrations of purified plasmids are determined and the plasmids are stored at −20°C for the following injection.\nCloning template DNA into plasmid backbone\nTiming: 2 weeks\nThe template DNA cloned from worm genomic DNA is inserted into plasmid backbone. After substitution with synonymous coding sequence in sgRNA target sequence in the plasmid, the DNA sequence required for knock-in is inserted into the template DNA at the determined site.\nPreparation of genomic DNA isolated from C. elegans worm for cloning template DNA.\nAdd 5 μL 20 mg/mL proteinase K into 95 μL worm lysis buffer.\nPick 5–10 worms into 20 μL lysis buffer containing proteinase K.\nStore at -80°C for 30 min then incubate at 65°C for 1 h.\nInactive of proteinase K at 95°C for 15 min.\nStore at −80°C for further PCR.\nThe template DNA and the plasmid backbone are amplified using high-fidelity DNA polymerase and primer pairs.\nNote: Reducing the number of PCR cycles and increasing the annealing temperature will be beneficial for high fidelity PCR. Reducing the concentration of plasmid backbone (1–5 ng) in PCR system for amplifying plasmid backbone is beneficial for efficiently avoiding the false positive in the following homologous recombination.\nLoad the PCR products on the agarose gel and extract by agarose gel DNA extraction kit.\nTest the extracted template and plasmid backbone DNA for their concentration and ligated by using homologous recombination kit for 30 min at 37°C.\ntable:files/protocols_protocol_3127_8.csv\nThe homologous recombined products are transformed to DH5α competent cells (as described in step 3). Analysis of successful insertion of template DNA into the plasmid backbone is determined by Sanger sequencing.",
    "The identified template plasmid is further amplified using high-fidelity DNA polymerase and primer pairs for substitution with synonymous coding sequence in sgRNA target sequence.\nThe PCR product in Step 12 is digested with DpnI and transformed into DH5α competent cells (as described in step 2-3). Analysis of successful substitution by Sanger sequencing.\nThe DNA sequence required for knock-in is inserted into the template DNA by homologous recombination and identified by Sanger sequencing (as described in steps 8–11).\nThe template plasmids are isolated and purified (as described in step 5).\nThe purified template plasmids are determined for their DNA concentration and stored at −20°C for the following microinjection.\nTransformation of worms by microinjection\nTiming: 1–2 days\nMicroinjection is an effective method for creating transgenic animals, for RNAi of selected genes, and for introducing various types of molecules directly into cells. For microinjection of C. elegans, the easiest approach is to inject DNA into the distal arm of the gonad.4[href=https://www.wicell.org#bib4],5[href=https://www.wicell.org#bib5] The distal germline of C. elegans contains a central core of cytoplasm that is shared by many germ cell nuclei. Therefore, DNA injected here can be delivered to many progeny. This approach usually leads to the formation of large extrachromosomal DNA arrays.4[href=https://www.wicell.org#bib4] Microinjection directly into oocyte nuclei can induce chromosomal integration of transgenes, but this technique is relatively difficult to do.6[href=https://www.wicell.org#bib6] Contrary to common perceptions, worm microinjection is not hard to learn and does not require the most expensive equipment. The microinjection method described below is geared towards generating transgenic worms, but it can be readily adapted for injecting a variety of molecules at different sites.7[href=https://www.wicell.org#bib7]\nChoose one type of selectable markers for identification of effective transformation.",
    "Note: There are different kinds of selectable markers, such as phenotype-associated genes or fluorescent protein genes, which are often used in genetic engineering to isolate worms with effective DNA transformation. Here we used popular marker plasmid pRF4 containing rol-6 (su1006) which confers a dominant “roller” phenotype,8[href=https://www.wicell.org#bib8] where worms corkscrew around in circles. This phenotype is easy to be identified with a simple dissecting microscope. Fluorescent markers require a dissecting microscope equipped with fluorescent optics.\nSingle healthy L4 worms ready for microinjection from the plate and culture them at 20°C for about 10 h.\nNote: Young adult worm is suitable for microinjection because of soft skin benefit of injection and appropriate stage of germline development in which worm just initiates the switch to oogenesis after producing about 300 sperm.\nPreparation of injection pads made of 50 × 22 mm coverslip covered with a drop of 2% hot agarose and air dry for 12 h.\nCritical: Pad can be used for several rounds of injection if the first coverslip is covered with several drops and added to the second coverslip.\nPreparation of needle-loading pipettes and microinjection needles.\nNeedle-loading pipettes are made of 10 μL stand standard glass capillary pipettes. Heat the pipette over flame then quickly pull it out and break to generate two needle-loading pipettes.\nBorosilicate glass capillaries (1.0 mm OD, 0.75 mm ID) with a fine internal glass filament are used to make microinjection needles by needle puller.\nNote: Microinjection needle made by needle puller contains a closed tip. It is necessary to break open the tip by gently tapping the needle across a glass slide. An appropriate size of the open-ended tip is important for successful microinjection.\nDNA transformation by microinjection.",
    "The DNA mixture containing Cas9-sgRNA plasmid, pRF4 marker plasmid and template plasmid (used for knock-in) is centrifuged for removing impurities.\nNote: The DNA concentration of each plasmid is ensured to be 50 ng/μL in the mixture.\nFill a needle-loading pipette.\nCritical: Fill a needle-loading pipette by capillary action with ≥ 1 μL of DNA injection mix.\nAdhesive fixation of worms.\nSelect the worm and place it on an agarose coverslip containing oil droplets.\nUse the viscosity of the agarose to fix the whole worm.\nGently flick the worm to display the gonads using the eyelash picker.\nWe picked the worm and placed it on an agarose coverslip containing oil droplets, using the viscosity of the agarose to fix the whole worm, and the eyelash picker was used to gently flick the worm to display the gonads.\nCritical: The worms used for microinjection are preferably younger adult hermaphrodites, a stage in which the gonads are clearly visible and the cuticle on the surface of the worm is thin and soft, which makes it easy to prick the needle.\nMicroinjection of worms.\nAdjust the position of the worm to ensure that the gonad forms an angle of 30°–50° with the tip of the needle.\nGently push the tip of the needle into the nematode’s gonad.\nStep on the air pump to squeeze out the plasmid droplets to observe the spread of the droplets in the gonad.\nQuickly remove the needle after injection.\nNote: In order to ensure the survival rate, each gonad is injected only once.\nResuscitation of worms.",
    "Dropped a drop of M9 buffer onto the worms, and then gently picked them out from the agarose slide with an eyelash picker and transferred to a new NGM plate. Then 3 μL of M9 buffer was added dropwise to remove oil from the worms and waited for the worms to crawl out of the droplet to restore their vitality. After 5–6 h, the microinjected worms were transferred to new NGM plate to lay eggs, and their progeny can be screened and genotyped.\nScreening and identification of edited worms\nTiming: 2 weeks\nEdited worms were identified by PCR.\nNote: The microinjected worms were cultured in an incubator at 20°C for 2 days to produce a sufficient number of offspring. Then, 8 or more hermaphrodite offspring of the roller phenotype were randomly picked and transferred to new individual plates and cultured for 3 days. The progeny hermaphroditic nematodes were picked out to prepare a PCR template, and a single nematode PCR was performed. According to the PCR results, 8 L4 hermaphroditic larvae were picked from the positive progeny and transferred to a new separate plate, and a round of PCR was performed after the offspring were produced to identify homozygotes (Figure 4[href=https://www.wicell.org#fig4]).\nThe positive PCR amplification products are sequenced to obtain the edited gene sequence.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3127-Fig4.jpg\nFigure 4. Screening method for GFP sequence knockin C. elegans genome\ntable:files/protocols_protocol_3127_9.csv\nTracking spermatogenesis by GFP::NKB-2 signaling in hermaphrodites.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3127-Fig5.jpg\nFigure 5. GFP::NKB-2 protein traces the process from spermatogenesis to sperm maturation\nScale bar: 20 μm.",
    "Note: In the L4 stage, the development of the gonads of hermaphrodite nematodes enters the spermatogenesis stage, and spermatocytes are marked by GFP::NKB-2. When the worms develop into the young adult stage, sperm differentiation has ended. Spermatocytes and spermatids labeled with GFP::NKB-2 distribute in or near spermatheca followed by the oocytes, which could be easily recognized under DIC and/or by GFP::NKB-2 under a confocal microscope (Figure 5[href=https://www.wicell.org#fig5]).\nDissection of worm gonads to release sperm\nTiming: 3 days\nPick the transgenic male worms in the L4 stage with the tagged sequence inserted in the sperm-specific expression gene (e.g., nkb-2), transfer them to a new NGM culture plate, and culture for 3 days. Add 3 μL of M9 or SM buffer dropwise on the coverslip, and pick worms into the droplet. Take two dissecting needles, clamp the worm body with the needle tip at one-third of the tail of the worm body and cut it open, and the sperm are squeezed out from the gonad under the pressure in the cavity. Cover the slide and let it stand at 20°C for 5 min before imaging.\nNote: Dissecting needles were used without scratching other parts of the nematode as much as possible to maintain the pressure in the nematode body cavity. After the dissection, remove the nematode corpse from the sperm.\nMicroscopic imaging of transgenic labeled sperm\nTiming: 0.5 days\nThe sperm were dissected out on a coverslip, which was then covered with a slide and left at 20°C for 5 min to be used for imaging. And the localization and distribution of tagged proteins were observed by fluorescence imaging.\nCritical: After closing the coverslip, make sure there is enough buffer in the slide chamber to keep the sperm in buffer during imaging."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Genetics",
    "Developmental Biology",
    "Crispr"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}