{
  "id": 9439,
  "origin_website": "Jove",
  "title": "An Isolated Semi-intact Preparation of the Mouse Vestibular Sensory Epithelium for Electrophysiology and High-resolution Two-photon Microscopy",
  "procedures": [
    "1. Animals\nMice were obtained from the Australian Rodent Centre (ARC; Perth, Australia) and held at the University of Sydney Bosch Animal Facility on a normal 12-hr light/dark cycle with environmental enrichment. All experiments described were approved by The University of Sydney Animal Ethics Committee.\nMale and female mice (C57/Bl6) were used for all experiments since this strain are commonly used as the background for genetic manipulation, and can be considered equivalent to wildtype 8-9.\n2. Tissue Preparation\nPrepare 300 ml of a glycerol-based artificial cerebrospinal fluid (ACSF) consisting of (in mM): 26 NaHCO3, 11 glucose, 250 glycerol, 2.5 KCl, 1.2 NaH2PO4, 1.2 MgCl2, and 2.5 CaCl2. Prior to the addition of CaCl2, gas the solution with carbogen (95% O2 and 5% CO2) to establish a pH of 7.4 and avoid calcium precipitation (cloudiness). Freeze the solution in a -80 °C freezer for 45 min so that an ice slurry is formed.\nDeeply anaesthetize mice with ketamine (100 mg/kg) (Parnell, Alexandria, Australia) via an intra-peritoneal injection.\nOnce hind-limb pinch reflexes are absent decapitate mice using sharp stainless steel scissors and make a sagittal skin incision using a razor blade (rounded #22) to expose the skull. At this point and throughout steps 2.3-2.8 the cranial vault, brain, and underlying vestibular apparatus should be kept as cool as possible by regular application of ice-cold ACSF over the tissue.\nUsing the pointed arm of standard pattern scissors (FST, North Vancouver, Canada) make a small incision in the skull at Lambda and cut along the sagittal suture. Ensure that the brain is not \"dragged\" by the shear blade during this step.\nCarefully peel the parietal bones away laterally and the occipital bone posteriorly using shallow bend pearson rongeurs (FST).",
    "A small stainless steel spatula is then used to gently lift the brain from the surface of the middle and posterior cranial fossae, and the exposed vestibulocochlea nerve (CNVIII) cut midway between the inner ear and the brainstem with a pair of fine iris scissors. Cutting this nerve minimizes undue tension on axons of the primary afferents and their connections with hair cells.\nFollowing transection of CN VIII the brain is removed in toto.\nThe vestibular labyrinth is now clearly visible in the middle cranial fossa, with the cochlea pointing anteromedially. Rongeur either side of the vestibular labyrinth before gently excising by gripping the anterior semicircular canal and pulling laterally.\nImmerse the excised labyrinths (Figure 1) in a dissecting dish containing the ice-cold, continuously gassed ACSF described in section 2.1. Under a stereomicroscope, hold the labyrinth to the base of the dish by gripping the cochlea. Use fine forceps to scratch away at the bone overlying the anterior semicircular canal ampulla. Once a small hole in the bone is achieved begin to flick the bone away from the ampulla. Caution should be taken not to push the forceps through the bone as this can cause damage to the underlying membranous labyrinth and sensory epithelium. Continue this procedure until both the anterior and adjacent horizontal semicircular membranous ducts and ampullae are exposed (Figure 2).\nimgsrc://cloudfront.jove.com/files/ftp_upload/50471/50471fig1.jpg\nFigure 1. The isolated mouse vestibular labyrinth. A. Left panel) Schematic representation of the isolated mouse vestibular labyrinth. Important points of reference for accessing the vestibular sensory epithelium, the cochlea, anterior, and horizontal semicircular canals are labeled. Asterisks indicate the semicircular canal ampulla containing the vestibular sensory epithelium. B. Right panel) Photomicrograph of the isolated vestibular labyrinth from a 1-month-old mouse.\nimgsrc://cloudfront.jove.com/files/ftp_upload/50471/50471fig2.jpg",
    "Figure 2. Exposure of the Membranous vestibular labyrinth. The bone overlying the anterior and horizontal semicircular canal ampullae have been scratched away to reveal the black/brown-speckled membranous ampullae and associated ampullary nerves (CNVIII). The schematic in the bottom panel represents the structures in the highlighted region of the photomicrograph and shows the relationship of the semicircular canal ducts to the ampullae and CNVIII.\nUsing fine forceps, gently lift the ampullae and associated utricle away from the bony labyrinth, ensuring that the central region of the ampullae (containing the sensory epithelium) is not damaged. In some cases the proximal part of the semicircular membranous duct may need to be cut with iris scissors to release the ampullae from the bone.\nTransfer the triad containing the two ampullae and utricle into a Petri dish filled with Leibovitz's L-15 culture medium (Sigma-Aldrich, St. Louis, MO). Use a fiber optic to \"backlight\" the tissue. This allows clear visualization of the crista containing the sensory epithelium within the ampullae.\nCarefully make an incision in the speckled \"roof\" of the utricle with the fine iris scissors. Continue this incision through the roof of the anterior and then the horizontal ampullae. Make the incision as close to the edge of the sensory epithelium as possible without contacting it (Figure 3A). Ensure that there are no pieces of membrane overlying the sensory epithelium (Figure 3B).\nTransfer the isolated semi intact preparation to a small glass-bottomed recording chamber filled with L-15 media. Weigh down the preparation using a grid of fine nylon fibers secured to a flattened U-shaped platinum wire (Figure 3B). Ideally, the fibers of the grid should not overlie the sensory epithelium, however in some cases where more stability is required, a single fiber transecting the sensory epithelium maybe preferred.\nimgsrc://cloudfront.jove.com/files/ftp_upload/50471/50471fig3.jpg",
    "Figure 3. The isolated semi-intact preparation of the vestibular sensory epithelium. A. Schematic representation of the semi-intact preparation and electrode configuration. The ampulla overlying the crista has been \"de-roofed\" to expose the surface of the sensory epithelium (green). B. Photomicrograph of the semi-intact 'triad' preparation showing the anterior (ac) and horizontal (hc) crista (utricle obscured behind ac). Note the nylon fiber used to secure the preparation to the base of the recording chamber. Scale bar: 100 μm. C. A recording electrode positioned on an individual vestibular hair cell. Scale bar: 15 μm.\n3. Electrophysiology\nPerfuse the semi-intact preparation with continuously oxygenated L-15 medium. The media contains a pH indicator (phenol red) and color of the medium should be monitored throughout the recordings. The pH with oxygen should be 7.3-7.4 and correspond to a red color.\nPrepare recording pipettes from 1.5 mm (1.19 mm ID) borosilicate glass using a two-step protocol (heat step 1: 72; and heat step 2: 50) on a micropipette puller (Narishige, Japan, model PP-830) to achieve a final impedance of 3-4 MΩ.\nFill the shank of the pipette with 3-4 mm of Potassium fluoride-based internal solution containing (in mM) 110 KF, 12 KCl, 27 KOH, 1 NaCl, 10 HEPES, 10 EGTA, 1.8 MgCl2, 3 D-glucose, and 2 Na-ATP; pH 7.4 with KOH.\nWrap the shank of the pipette 2-3 times and as far down to the tip as possible with a thin strip of parafilm to insulate the electrode and reduce pipette capacitance.\nPosition the pipette over the sensory epithelium under low power magnification (5X) on an upright microscope (Olympus BX51). Switch to high power (40X) and visualize individual vestibular hair cells with an attached CCD camera.",
    "Position pipette on the membrane of a visualized hair cell (Figure 3C) using a micromanipulator (Sutter Instruments, California, USA). Once a gigaohm seal is achieved, rupture the cell membrane with a small amount of negative pressure applied through a suction port on the pipette holder.\nMake whole-cell voltage clamp recordings using standard techniques 8-9.\n4. Two-photon Microscopy\nPrepare a 0.9% saline solution containing 5 mM Oregon Green 488 BAPTA-1 (OGB-1; hexapotassium salt; Invitrogen, Germany).\nWhile still submerged, place the \"de-roofed\" semi-intact triad preparation onto a small piece of filter paper (4X4 mm, 0.8 μm thick; Millipore, Germany) ensuring that the sensory epithelium is unobstructed from above.\nTransfer the filter paper and preparation onto the saline covered base platinum electrode (7 μl) of an electroporator consisting of the combination of a pulse generator and a wide-band amplifier, and cover with a further 5 μl of 5 mM solution of the synthetic calcium indicator dye Oregon Green 488 BAPTA-1 (Figure 4).\nimgsrc://cloudfront.jove.com/files/ftp_upload/50471/50471fig4.jpg\nFigure 4. Bulk electroporation. A. schematic showing cross-section of electroporation configuration. The semi-intact preparation (*) is placed on a piece of filter paper immersed in calcium dye (Oregon Green 488 BAPTA-1) and current applied between 2 platinum electrodes. Adapted from Briggman and Euler, 2011 10.\nBring the top platinum electrode parallel with the base electrode at a distance of approximately 2 mm, being careful not to disrupt the orientation of the preparation when contact with the Oregon Green 488 BAPTA-1 solution is made.\nPass a brief current pulse across the preparation (Parameters for the current; +13 V, 10 msec pulse width, 1 Hz frequency, 10 square-wave pulses) 10-11.",
    "On the bottom of a glass bottomed recording chamber filled with L-15 medium, place a small dab of silicon oil and position the semi-intact preparation onto it, again ensuring that the sensory epithelium is unobstructed from above. To ensure stability throughout imaging, replace the nylon grid over the preparation as described above (see point 2.13).\nUsing the two-photon microscope make optical recordings of spontaneous calcium activity in the sensory epithelium (Figure 7) using standard imaging protocols 10-11.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}