{
  "id": 18845,
  "origin_website": "Jove",
  "title": "Simulating Pancreatic Neuroplasticity: In Vitro Dual-neuron Plasticity Assay",
  "procedures": [
    "All animal experimental procedures in the protocol follow the animal care guidelines of Technische Universität München, Germany.\n1. Media/Extract Preparation\nTissue homogenization\n\tThe quality of tissue homogenization is critical to the subsequent detection of neuroplastic alterations in the cultured neurons. Here, a homogenizer is recommended which enables tissue dissociation without major increase in the tissue temperature.\n\t\nTransfer 5 mm x 5 mm x 5 mm cubes of pancreatic tissue directly from -80 °C to liquid nitrogen and place in a solid phase in the tissue homogenator. The ideal homogenator would dissociate the tissue fast enough, without allowing it to defreeze.\nImmediately after dissociation, resuspend the solid, powder-like homogenate in 300-500 µl of 0.1x phosphate-buffered saline (PBS). Here, do not use any lysis buffer (such as RIPA) since this may lyse the neurons.\nCentrifuge the homogenates for at least 15 min at the maximum speed of your bench centrifuge (e.g. 21,130 x g). Collect the clear supernatant which represents the tissue extract.\nCell line supernatants\n\t\nLet the cells of interest reach at least 70 - 80% confluence in normal growth medium.\nUsually, these media contain serum components and may exert uncontrollable effects upon neuronal growth. Therefore, after reaching the desired cell density, wash your cells at least 3x with cell-culture grade PBS and place them in serum-free medium (SFM) for up to 48 hr.\nNote: Here, consider that some cells (like pancreatic stellate cells) may need serum in their growth media in order to maintain their normal state and structure. In such cases, perform serial serum dilutions in the medium of the cell of interest in order to find the lowest possible serum content necessary for intact cell function.",
    "Measure the protein concentration of the tissue homogenate or cell supernatants via Bradford protein assay. While these values vary depending on the tissue and cell type, for pancreatic tissue extracts, one would expect a concentration range between 5-12 µg/µl, and for cell line supernatants between 3-8 µg/µl.\n2. Aliquot Extracts and Cell Supernatants\nDepending on the concentration to be used in the assay, the final concentration of the extract or supernatant in the neuronal medium should be 100 µg/ml 5,8.\nNote: For an assay with neurons growing in 500 µl medium in each well of a 24-well plate, one needs 50 µg of protein from each extract or supernatant per well. At a typical extract concentration of around 10 µg/µl, one would need 5 µl of extract/supernatant for each well. In every setting performed as a triplicate, this would correspond to 15 µl of extract/supernatant. For different tissue or cell types, perform serial dilutions of the final extract or supernatant concentration and compare the observed neurotrophic effects between different extract/supernatant concentrations.\n3. Isolation of Neurons\nOnce the extract/supernatant collection is finished, carry on with isolation of neurons.\nFor DRG neurons, collect the cervical to lumbar DRG of newborn rats between postnatal day (P) 2-12 after decapitation and stereomicroscopic dissection of DRG (Figure 1A). In order to have sufficient DRG neurons for a 24-well plate, collect all cervical to lumbar DRG of one newborn rat (equaling 52 DRG) per plate.\n\t\nCut away the peripheral (neural) and central projections (roots) of DRG by means of microscissors.\n\t\tLeaving the projections in place impedes trituration and increases the contamination risk of culture by fibroblasts.",
    "For MP neurons, cut away the mesentery from the small intestine and manually and carefully strip off the seromuscular layer of the small intestine (for a detailed protocol on MP isolation, refer to Schäfer et al.9, Figure 1B). For MP, collect the plexus from two rats per 24-well-plate.\nNote: Try to be as gentle as possible in order to avoid tears in the seromuscular layer since they impede its successful separation from the small intestine.\nCollect the DRG and seromuscular layer in ice-cold minimal essential medium (MEM) supplied with gentamicin (20mg in 500ml medium) and metronidazol (2.5 mg in 500 ml medium).\nFollowing collection of DRG, incubate them in Hank’s Balanced Salt Solution (HBSS) supplied with collagenase Type II for 20-30 min. For MP isolation, incubate in collagenase type between 1-3 hr, depending on the age of the animal (Figure 1C).\nFor MP, collect the net-like MP pieces under stereomicroscope and transfer to ice-cold MEM.\nThen triturate the DRG and MP through syringes with decreasing diameter.\nNote: Excessive trituration can destroy the neurons, but less the glia cells.\nOnce the medium containing the DRG or MP has become cloudy, centrifuge the suspension at 93.9 x g for 5 min, discard the medium and resuspend in Neurobasal medium (supplemented with 100 U/ml penicillin, 100 μg/ml streptomycin, 0.5mM L-glutamine and 2% B-27).\nCount the total number of cells (i.e. neurons AND glia) by means of a hemocytometer.",
    "Note: The number of needed cells is dependent on the measurement parameter. For the quantification of neurite density, one needs denser cultures and thus a greater number of cells than for the measurement of neurite outgrowth, perikaryonal size and branching pattern of individual neurons. For neurite density measurements, use e.g. 10,000 cells (neuron+glia)/well or 1,500 neurons/well. For morphometry on individual neurons, brief (1 minute-long) trypsination of cells and seeding of 2,500 cells/well or 400 neurons/well is recommended. The typical yield of cells obtained from one rat is around 300,000-500,000 cells.\nSeed the cells on 13 mm coverslips which have been coated the night before and top the wells with Neurobasal medium (supplemented with 100 U/ml penicillin, 100 μg/ml streptomycin, 0.5 mM L-glutamine and 2% B-27) (Figure 1D).\nNote: Use poly-D-lysine (40 mg/m2) OR ornithine- and laminin-coated (1 mg/ml each) coated cover slips. Cells attach to poly-D-lysine extremely fast, thus making it suitable for experiments in which many cells are needed (i.e. neurite density measurements). Attachment to laminin is in general somewhat weaker, but laminin is a strong promoter of neurite outgrowth. Therefore, for measurements on neuronal branching and neurite length, prefer ornithine/laminin-coating.\nAllow the cells attach to the wells overnight. On the next day, prepare the extract-supplemented media (at a final extract/supernatant concentration of 100 µg/ml).\nAspirate the seeding medium, and perform an optional, very gentle wash with PBS, and then slowly pipette the extract/supernatant-supplemented media (Figure 1E).\nLet the cells grow for 48 hr. Aspirate the media and fix in 4% paraformaldehyde for immunostaining (Figure 1F).\nPerform double immunofluorescence staining using neuron-specific (e.g. beta III-tubulin) and glia-specific (e.g. glial fibriallary acidic protein/GFAP) markers (Figure 1G).",
    "For morphometry, use an inverted light microscope equipped with a CCD camera in combination with automated software which allows measurement of neurite density (see Table).\nThe neurite density of neuronal cultures is measured on 4-5 representative photomicrographs at 200x magnification from 4 different regions of densest growth on each coverslip by overlaying a 50 µm x 50 µm grid and counting the fiber density per square measured in the intersecting fibers. Neurite outgrowth, mean number of branches per neuron, the mean branch length and perikaryonal size can be measured from randomly selected 30 solitary neurons from each coverslip by marking the neurites and perikarya (Figure 1H).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}