{
  "id": 10910,
  "origin_website": "Jove",
  "title": "Gene Transfection toward Spheroid Cells on Micropatterned Culture Plates for Genetically-modified Cell Transplantation",
  "procedures": [
    "All the animal studies were conducted with the approval of the Animal Care and Use Committee of the University of Tokyo, Tokyo, Japan.\n1. Cell Preparation\nFor primary hepatocytes, follow the protocol for hepatocyte isolation from rat by a modified two-step collagenase digestion process13,14.\n\t\nAnesthetize Sprague Dawley (SD) rats (male, 5 weeks old) under inhalation anesthesia with isoflurane. Place a rat in a chamber connected to an anesthesia machine to provide isoflurane for the chamber. Take out the rat after falling asleep, and set it on the operating table with ventilation using a mask. Control the isoflurane flow approximately at 0.4 – 0.7 L/min by checking the conditions of the rat. Perfuse the livers of Sprague Dawley (SD) rats (male, 5 weeks old) from the hepatic portal vein with a special solution composed of 8 g/L sodium chloride (NaCl), 400 mg/L potassium chloride (KCl), 78 mg/L sodium dihydrogen phosphate dihydrate (NaH2PO4·2H2O), 151 mg/L disodium hydrogen phosphate dodecahydrate (Na2HPO4·12H2O), 2.38 g/L 2-[4-(2-hydroxyethyl)-1-piperazinyl] ethanesulfonic acid (HEPES), 190 mg/L ethylene glycol tetraacetic acid (EGTA), 350 mg/L sodium hydrogen carbonate (NaHCO3), and 900 mg/L glucose.\nCirculate collagenase solution through the liver.  \n\t\tNOTE: The solution is composed of 500 mg/L collagenase, 9.8 g/L Hank’s buffered salt, 2.38 g/ml HEPES, 556 mg/ml calcium chloride hydrate (CaCl2·H2O), 350 mg/L NaHCO3, and 50 mg/L trypsin inhibitor, with the pH adjusted to 7.2.\nRemove the liver carefully, and mince it gently on a dish using a scalpel blade, add Dulbecco’s Modified Eagle’s Medium (DMEM) supplemented with 10% fetal bovine serum (FBS), and filter the cell suspension through a 100 μm nylon mesh. To remove additional debris, centrifuge the cell suspension at 20 × g for 1 min. At this step, hepatocytes are in the supernatant.",
    "Repeat the centrifugation step twice (a total of three centrifugations). Finally, centrifuge the hepatocytes at 50 × g for 3 min to recover them in the form of a pellet.\nRe-suspend the hepatocytes to a concentration of 4 × 105 cells/ml in a special culture medium composed of DMEM supplemented with 10% FBS, 1% Pen-Strep-Glut (PSQ), 1% dimethyl sulfoxide (DMSO), 0.1 µmol/L dexamethasone, 0.5 µg/ml insulin, 10 mmol/L nicotinamide, 0.2 mmol/L phosphorylated ascorbate (Asc-2P), and 10 ng/ml human epidermal growth factor (hEGF)15. This special medium is mandatory for preserving the hepatic function under in vitro conditions.\nFor obtaining rat MSCs, euthanize Sprague Dawley (SD) rats (male, 5 weeks old) by excessive administration of isoflurane. Resect the femurs and tibias, and collect the bone marrows by inserting a 22 G needle into the shaft of the bone to flush it out with 10 ml of DMEM supplemented with 10% FBS. Collect the cells by filtration through a 100 µm nylon mesh.\nSeed the cells onto 10 cm culture dishes using DMEM containing 10% FBS and 1% penicillin / streptomycin. For the spheroid experiments, use MSCs within 5 passages.\n2. Preparation of 3D Cell Spheroids\nCommercially obtain micropatterned culture plates, on which the cell adhesive areas are regularly arrayed at 100 µm diameter in a two-dimensional manner, surrounded by non-adhesive areas coated by the PEG matrix.  \n\tNOTE: For cell transplantation, an additional coating with the thermosensitive polymer PIPAAm is necessary to allow cell detachment by cooling the plates (see step 5.1). Temperature fluctuations can induce changes in the chemistry of this polymer8-10. At 37 °C, PIPAAm is slightly hydrophobic, allowing the cells to be cultured under normal conditions. A decrease in the temperature below 32 °C results in rapid hydration of the polymer, leading to the spontaneous detachment of the cells.",
    "Seed the hepatocytes or MSCs on 12-well micropatterned plates at a density of 4 × 105 cells/well andincubate them at 37 °C in a humidified atmosphere containing 5% CO2. The cells will accumulate on the micropatterned adhesion areas and gradually form round spheroids in 2 days.  \n\tNOTE: For preparing control cells in a monolayer culture, use normal 12-well plates and seed the cells at an identical density, following a similar procedure as described above.\n3. Preparation of Polyplex Nanomicelles\nSynthesize a block copolymer, PEG-PAsp(DET) (poly[N’-[N-(2-aminoethyl)-2-aminoethyl] aspartamide]) (PEG Mw = 12,000, polymerization degree (DP) of PAsp(DET) segment = 59), and a homopolymer that is composed of only the cationic segment [PAsp(DET)] (DP = 55), following the procedures previously described by the authors11,16,17.\nPrepare a mixed solution of the PEG-PAsp(DET) block copolymer and the PAsp(DET) homopolymer at an equal molar ratio of residual amino groups in 10 mM HEPES buffer (pH 7.3) by adjusting the polymer concentration to 33.3 µg/ml and 19.1 µg/ml, respectively.  \n\tNOTE: The polymer concentrations described above are representative values for preparing nanomicelles with a residual molar ratio of the total amino groups in the two polymers to the phosphate groups in the pDNA (N/P ratio) of 10. The N/P ratio can vary depending on the cell type and the purpose (for details, see Discussion). The combined use of the two polymers can achieve both effective PEG shielding and functioning of PAsp(DET) to enhance endosomal escape (for details, see Discussion)18.",
    "Prepare the pDNA encoding Gaussia luciferase, GL4 luciferase, or erythropoietin by cloning the segment expressing the respective genes into the pCAG-GS plasmid (http://www.cdb.riken.jp/pcs/protocol/vector/map/m36.html) to obtain expression under the CAG promoter/enhancer using a commercial kit according to manufacturer’s protocol. Amplify the pDNA in a competent Escherichia coli strain and purify it using an endotoxin-free plasmid DNA purification system. Determine the pDNA concentration at an absorbance of 260 nm to obtain a 150 µg/ml solution in 10 mM HEPES buffer (pH 7.3).\nTo prepare the polyplex nanomicelles, thoroughly mix the pDNA solution (150 µg/ml in 10 mM HEPES buffer) and the premixed solution of the two polymers at a ratio of 2:1 (by volume).\n4. Gene Transfection into Spheroids\nIncubate the cells (hepatocytes or MSCs) for 72 hrs after seeding onto the micropatterned plates to allow for the formation of mature spheroids. For gene transfection, add 100 µl of the polyplex nanomicelle solution (containing 10 µg of pDNA) to each well after replacing the culture medium with 1 ml of fresh medium. Continue the incubation with the nanomicelle solution for 24 hrs.\nFor a control using a lipid-based transfection reagent, mix pDNA solutions with the reagent at a weight ratio reagent / pDNA of 3. Adjust the final dose of pDNA to be equal for both the lipid-based reagent and nanomicelle methods.\n5. Recovery and Transplantation of Cell Spheroids\nReplace the culture medium with 200 µl of chilled PBS and place the plates on ice.  \n\tNOTE: Generally, the spheroids can detach in about 15 min and can be recovered in the form of a suspension for transplantation.\nGently aspirate the cells in the 200 µl suspension using a syringe with a 23 G or 27 G needle for in vivo injections.\n6. Evaluation of Transgene Expression",
    "For the in vitro evaluation of the expression of Gaussia luciferase secreted in the culture medium, collect 50 – 100 µl of the medium precisely 24 hrs after replacing with fresh medium. Estimate the luciferase expression using a commercial renilla luciferase assay system and a luminometer according to manufacturer’s protocol.  \n\tNOTE: The Gaussia luciferase remains stable in the culture medium for more than a week. Thus, to evaluate the real-time efficiency of the transgene expression, replace the medium with fresh one prior to collecting the sample medium. The timing of the medium change can be flexible.\nFor the in vivo evaluation of the transgene expression in host animals following cell transplantation, anesthetize BALB/c nude mice (female; 7 weeks old) under inhalation anesthesia with isoflurane.\n\t\nPlace a mouse in a chamber connected to an anesthesia machine to provide isoflurane for the chamber. Take out the mouse after falling asleep, and set it on the operating table with ventilation using a mask. Control the isoflurane flow approximately at 0.2 – 0.5 L/min by checking the conditions of the mouse.\nInject 200 µl of the cell suspension containing spheroids transfected with the GL4 luciferase-expressing pDNA (as described in 4.1) into the subcutaneous tissue of the abdominal region.\nImmediately after injecting D-luciferin (150 mg/kg; intravenous route), measure the luciferase expression using IVIS imaging system according to manufacturer’s protocol.\nFor evaluating the therapeutic effects of the cell transplantation, inject 200 µl of the cell suspension containing spheroids transfected with the erythropoietin-encoding pDNA into the subcutaneous tissue of the abdominal region.\n\t\nCollect blood samples by submandibular bleeding to obtain approximately 200 µl of blood19. Measure the hemoglobin and hematocrit using a blood sample analyzer.",
    "NOTE: The cell number for transplantation is regulated by the number seeded on the plates. Unfortunately, it is difficult to determine the exact cell number because the number inside spheroids cannot be measured.\nAfter experiments, place the mice on a heating pad connected with a temperature controller until awakening from anesthesia.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}