{
  "id": 18437,
  "origin_website": "Jove",
  "title": "Methods for Acute and Subacute Murine Hindlimb Ischemia",
  "procedures": [
    "All animal experiments were performed according to protocol approved by the Duke Institutional Animal Care and Use Committee. Male mice were used in this study, although either sex can be used as indicated for the scientific purpose of the study.\n1. Hair Removal\nPrior to induction of anesthesia, set up a pre-surgical preparation area consisting of a covered heating pad set at 37 °C and a nosecone port connected to continuous flow of isoflurane.\nPlace the mouse in the anesthesia induction chamber. Set the O2 flow meter to 1 L/min and isoflurane to 1 - 3%.\nNOTE: Anesthesia is typically induced in a 25 g mouse with 2% isoflurane.\nCheck the mouse's stimulus response by gently rocking the chamber and observing a lack of a righting reflex.\nFlush the chamber with O2 to clear the isoflurane prior to opening. Quickly move the mouse to the heating pad and connect it to isoflurane via the nosecone.\nAdjust the isoflurane to 1.5%. Check the stimulus response by pedal reflex (toe pinch).\nApply ophthalmic lubricant liberally to both eyes to avoid drying during surgery.\nShave the hair from both hind limbs using a small electric trimmer. Hold the skin taut while shaving to avoid lacerating the skin.\nApply pre-warmed hair removal cream and let sit for 1 min. Gently wipe away using a moistened gauze pad.\nFor surgical procedure at a later time, turn off the isoflurane and move the mouse to an empty paper towel-lined recovery cage to ensure the mouse does not aspirate the cage bedding. Monitor the animal until it is able to maintain sternal recumbency. Otherwise, move the mouse to the surgical table.",
    "NOTE: The hair removal process can irritate the skin and affect perfusion measurements. It is recommended to wait 1 - 2 days after removing the animal's hair before performing a pre-surgical perfusion scan or performing surgery.\n2. Pre-Surgical Preparation\nUse the following tools during this procedure; small straight surgical scissors, 2 fine-tipped angled forceps, small Graefe forceps, needle driver forceps, 3 retractors, small spring scissors, and fine-tipped cotton swabs.\nSterilize all tools using an autoclave prior to the initiation of surgery. Use a hot-bead sterilizer before and between each surgical procedure, for up to 5 animals. Sterilize additional surgical tool packets for surgeries of groups larger than 5.\nPrepare a sterile surgical field consisting of a covered heating pad and an isoflurane port. Perform all work under a 10 stereo dissection microscope.\nAnesthetize and prepare the mouse as described in steps 1.1 to 1.5.\nCheck that the mouse is fully sedated and place into a supine position on the surgical table. Secure both legs using surgical tape.\nIf using a temperature-controlled heating pad, attach the temperature probe and secure it to the base of the surgical platform using surgical tape to ensure that it will not be accidentally pulled out during the procedure.\nClean the incision site using 3 alternating povidone-iodine and alcohol wipes. Cover the animal with a sterile surgical drape and cut a hole to expose the incision site.\n3. Induction of Limb Ischemia\nUse a scalpel to make an initial incision along the center of the medial thigh, running from the knee towards the abdomen, and lengthen the incision to approximately 1 cm with fine scissors (Figure 1A).\nimgsrc://cloudfront.jove.com/files/ftp_upload/54166/54166fig1.jpg",
    "Figure 1. Surgical Site and Vascular Anatomical Landmarks for Mouse Hindlimb Ischemia Surgery. (A) External view of the hindlimb of a mouse in the supine position. The hatched line indicates the incision site to properly perform the hindlimb ischemia procedures. (B) View of the proximal mouse hindlimb vasculature. The proximal end of the femoral artery (FA) arises from beneath the inguinal ligament (IL). The distal end of the FA is located at its bifurcation into the popliteal artery (PA) and saphenous artery (SA). The major collateral arteries off of the FA are the lateral circumflex femoral artery (LCFA), the proximal caudal femoral artery (PCFA), and the superficial caudal epigastric artery (SCEA). The femoral vein (FV) runs adjacent to the FA, and venous branches can be seen parallel to the major arterial branches. Asterisks (*) denote the proximal and distal sites for placement of ameroid constrictors or ligatures, depending on whether subacute or acute ischemia will be induced. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/54166/54166fig1large.jpg]\nUsing forceps, open the incision and expose the membrane covering the inguinal fat tissue (IFT).\nUsing closed-forceps, pierce through the membrane into the separation between the IFT and the abdomen. Gently release pressure on the forceps to separate the IFT from the abdominal muscles, exposing the neurovascular bundle underneath. Observe the proximal and superficial caudal branches as important anatomical landmarks (Figure 1B).\nInsert a retractor and pull the abdominal tissue proximally to expose the proximal ameroid constrictor or ligation site, just proximal to the lateral circumflex femoral artery (Figure 1B). The lateral circumflex artery lies about 5 mm proximal to the proximal and superficial caudal arteries.",
    "Insert two more retractors into the distal part of the incision, one medial and one lateral, to pull the IFT distally away from the surgical site to widen the surgical field.\nUse two fine forceps to remove the outermost membrane covering the neurovascular bundle. Gently insert one half of the fine forceps tip between the vein and artery, sliding the forceps tip under the membrane that binds them together. Close the forceps and gently tear away the membrane.\nInsert the tip of a closed forceps between the vein and artery and create a gap between them by releasing pressure on the forceps. Repeat this technique to create a gap between the artery and nerve.\nFor subacute limb ischemia, place an ameroid constrictor on the proximal femoral artery (Figure 2).\n\t\nTo install the proximal ameroid constrictor, slide the tip of a forceps under the femoral artery to isolate it from the neurovascular bundle. Use a second set of angled- forceps to grip the edge of the constrictor and guide it under the femoral artery.\nLay the femoral artery into the slot in the constrictor. Repeat for the distal constrictor, positioning it immediately proximal to the bifurcation of the femoral artery into the popliteal artery and saphenous artery (Figure 2).\nimgsrc://cloudfront.jove.com/files/ftp_upload/54166/54166fig2.jpg",
    "Figure 2. Placement of Ameroid Constrictors and Ligatures. (A) Example of two ameroid constrictors placed on the femoral artery to induce subacute hindlimb ischemia. The proximal constrictor is placed just proximal to the lateral circumflex femoral artery (LCFA). The distal constrictor is placed just proximal to the bifurcation of the popliteal (PA) and saphenous arteries (SA). Constrictors are installed with the slot facing up to ensure the artery is properly set within the constrictor. (B) Example of ligatures of the femoral artery to induce acute hindlimb ischemia. Ligatures (yellow arrows) are placed such that they flank the position of the constrictors in panel (B), and the femoral artery is transected between each set of two ligatures (asterisks). Bar, 1 mm. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/54166/54166fig2large.jpg]\nFor acute limb ischemia, ligate and transect the proximal femoral artery.\n\t\nTo transect the femoral artery, thread 7 - O suture under the artery just proximal to the position of the proximal constrictor (see Step 3.7) and ligate. Tie a second ligature about 1 mm distal to the first.\nUse spring scissors to transect the artery between the two ligatures. For the distal arterial transection, repeat these steps, placing two ligatures about 1 mm apart, just proximal to the bifurcation of the femoral artery into the popliteal artery and saphenous artery but ensuring that they are distal to the superficial caudal epigastric artery (see Figure 1)\nClose the incision using interrupted 5 - O vicryl sutures.\n4. Perfusion Imaging\nMove the mouse to a 37 °C heating pad set beneath the laser doppler perfusion imager (LDPI) and connect via a nosecone to the isoflurane source. If no temperature monitor is available, allow 5 min for the mouse to warm up to 37 °C.",
    "Turn on the imager and launch the image capture software.\nClick the 'New Single Image' icon to open the 'Scanner Setup' window. Set the 'Scan Size' to 'Large' and the 'Scan Speed' to '4 ms/pixel'. Set the scan area by changing the x and y values under the 'Scan Area (units)' pane.\nClick the 'Video and Distance' tab to view the video feed, and arrange the mouse to fit into the scan area indicated by a red outline. Click 'Auto Distance' to calibrate the distance from the laser to the subject. Click 'Next' to open the 'Subject Details' window.\nEnter the subject information and any relevant comments. Click the 'Next' button to move on to the scanning window.\nClick the 'Start Measurement' button to open the 'Confirm or Override Scan Distance' dialog. Click 'OK' to confirm scan distance. Observe the scanning process begin and run for 4 - 8 min depending on the size of the scan area.\nAfter the scanning is complete, observe the 'Save As' window. Name the file and save it.\nShut off the isoflurane and move the mouse to an empty recovery cage and monitor until the animal is able to maintain sternal recumbency. Never place a mouse recovering from anesthesia into a cage with other mice.\nOpen the image analysis software. Click the 'Open' icon and browse to and open the image file for analysis. On the file window, observe the flux, photo, and color images of the mouse.\nTo mark the region of interest (ROI) on the flux image, click the 'Show ROIs' icon. Next click the 'Add Polygon' button and drag the cursor around the non-surgical limb to draw the ROI. Right-click to close the shape. Select 'Add Polygon' again and draw a matching ROI around the surgical limb.",
    "Click the 'Statistics' icon to open the 'Image ROIs Statistic Results (PU)' window. Observe the percent difference in flux in the 'Flux %' column.\nNOTE: The first ROI drawn will serve as the reference.\nNOTE: Prior to each subsequent perfusion scan follow the steps outlined in Section 1 to anesthetize the mouse and in steps 4.1 to 4.11 to image the animal.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}