{
  "id": 18236,
  "origin_website": "Jove",
  "title": "Semi-automated Analysis of Mouse Skeletal Muscle Morphology and Fiber-type Composition",
  "procedures": [
    "All procedures involving mice were approved by the University of Colorado-Anschutz Medical Campus Institutional Animal Care and Use Committee (91813(05)1D).\n1. Day 1: Primary (1°) Immunostaining with Bovine Serum Albumin (BSA) Blocking\nAir-dry frozen sections of mouse hindlimb muscle (e.g., tibialis anterior, soleus) mounted on charged slides for ~ 30 min11. Draw a border around the sections using a hydrophobic barrier PAP pen.\nPlace ~ 250 µL of 5% BSA/phosphate buffered saline (BSA/PBS) on each slide to block non-specific antibody binding. Incubate slides at room temperature for 1 h.\nWhile blocking, prepare 1:50 dilutions of the 1° antibody supernatant in 5% BSA/PBS (all are mouse monoclonal antibodies; see Table 16,12); prepare 250 µL of solution per slide. Keep 1° antibody stocks and dilutions on ice.\nimgsrc://cloudfront.jove.com/files/ftp_upload/56024/56024table1.jpg\nTable 1: Primary Antibodies used to Distinguish MyHCs.\nFollowing aspiration of the 5% BSA/PBS blocking solution, add 250 µL of 1° antibody dilution to the appropriate slides. Add 250 µL of 5% BSA/PBS to secondary (2°) antibody-only negative control slides.\nIncubate at 4 °C for 24 - 48 h in a humid environment.\n\tNOTE: A Petri dish covered in aluminum foil with dampened filter paper may serve as a suitable incubation chamber.\n2. Day 2: 2° Immunostaining with Fluorescent Antibodies\nAspirate 1° antibody solution or control 5% BSA/PBS solution. Wash all slides three times, 10 min with 5% BSA.\nWhile washing, prepare 1:200 dilutions of the purified, fluorophore-conjugated 2° antibodies in 5% BSA/PBS (see Table 2, all are goat anti-mouse). Prepare 250 µL of solution per slide. Keep 2° fluorophore-conjugated antibodies in the dark on ice.\nimgsrc://cloudfront.jove.com/files/ftp_upload/56024/56024table2.jpg\nTable 2: Fluorophore-conjugated Secondary Antibodies used to Visualize Primary Antibody Recognition of MyHCs.",
    "Following aspiration of the third application of 5% BSA/PBS blocking solution, add 250 µL of 2° antibody dilution to all slides. Incubate for 90 min at room temperature in a dark, humid environment.\nAspirate 2° antibody solution. Wash all slides three times, 10 min with 5% BSA/PBS.\nRinse with PBS. Dry for 10 min.\nMount the coverglass with a non-permanent, low-viscosity aqueous mounting medium.\nWhen dry, seal the slide edges with nail polish. Dry and store in a dark slidebox.\n3. Imaging Slides with Epifluorescence Microscopy\nClean the slides with a small, 70% ethanol-soaked lab-wipe.\nObtain digital images of immunostained muscle sections using an epifluorescence microscope equipped with a photographic apparatus (see the Table of Materials).\n\t\nSelect an area of approximately 1 mm2 (10X objective, 1.4 NA).\nView Alexa 488-conjugated 2° antibody fluorescence via a 505 nm long-pass filter. View the fluorescence generated by excitation of Alexa 594-conjugated 2° antibodies via a 595 nm long-pass filter. Digitize images with a PC computer equipped with a compatible imaging software. Include the scale bar from imaging software for later analysis.\n4. Analysis of Images with Fiji\nNote: Before proceeding with analysis, Fiji (available freely from the National Institutes of Health, Bethesda, MD) must be installed via https://imagej.net/Fiji/Downloads. Also, the macro used in this process is provided in the Supplemental File. Place the macro file in an easily accessible directory.\nLoad a brightfield image of a selected section in Fiji. Navigate to Plugins → Segmentation → Trainable Weka Segmentation.\nIn order to stipulate the cellular areas of the section, draw a line on a fiber, and click \"Add to class 1\". Then, draw a line on the space between fibers, and click \"Add to class 2\" to mark the extracellular domains. Repeat until there are 5-10 labels in each class.",
    "Click Train Classifier. On the resulting red and green overlay, add more labels manually (see step 4.2) to incorrectly segmented pieces of the image, if necessary. Repeat until fibers (red) are appropriately separated from the space between fibers (green).\nClick \"Get Probability\" and save the image in a newly labeled folder.\nRepeat the above procedure (steps 4.2 - 4.3) with the fluorescent image taken from the same field. Label immunostained fibers as \"class 1\" and all non-fluorescent regions as \"class 2\". Save the resulting probability map to the same folder where the processed brightfield image is stored.\nOpen one of the previously saved probability maps in Fiji. Draw a straight line on the scale bar provided by the imaging software. Go to Analyze → Set Scale. Change the parameters (i.e., known distance, unit of length) to their appropriate values as given by the scale bar, then check the \"Global\" box to standardize the scale for each image.\nNavigate to Plugins → Macros → Run → Tyagi et al. fiber quantification macro.ijm (see the Supplemental File). Immediately, a navigation pane will appear. Open the image's host folder; a dialog box will appear. For each dialog box, change the \"Background\" dropdown value to \"Light.\"\n\tNOTE: The folder will now be populated with images of the fiber outlines and spreadsheet software files of the results (CSA and Feret diameter are most pertinent to quantifying fiber morphology; measured parameters can be adjusted in Analyze Set Measurements). Fiber morphology data generated by the pore-analysis function of Fiji will be automatically transferred to spreadsheet software files for both fluorescent and bright field images.",
    "Calculate the fraction of fibers expressing a given MyHC in a field by dividing the number of fluorescent fibers in the field by the number of total fibers in the corresponding bright field image.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}