{
  "id": 13152,
  "origin_website": "Jove",
  "title": "Generation and Culture of Lingual Organoids Derived from Adult Mouse Taste Stem Cells",
  "procedures": [
    "All the animal procedures were performed in an AAALAC-accredited facility in compliance with the Guide for the Care and Use of Laboratory Animals, Animal Welfare Act, and Public Health Service Policy, and were approved by the Institutional Animal Care and Use Committee (IACUC) at the University of Colorado Anschutz Medical Campus. Lgr5EGFP-IRES-CreERT2 mice used in this protocol are from The Jackson Laboratory, Stock No. 008875.\nNOTE: The following steps should be completed before beginning to ensure smooth and timely progression of the protocol: set water bath to 37 °C, set centrifuge to 4 °C, make injection and dissociation enzyme solutions from the 10 mg/mL Dispase, Collagenase, and Elastase stock solutions (see Table of Materials), remove matrix gel from -20 °C freezer (~750 µL needed for a 48-well plate) and thaw by submerging the vial in ice for at least 3-4 h, pre-coat microcentrifuge tubes in undiluted FBS by rocking gently at room temperature for at least 30 min (two 2 mL tubes for tissue collection, two 1.5 mL tubes for dissociated cells, and one 1.5 mL tube for collection of single cells from cell sorter; remove excess FBS before use).\n1. Isolation of CVP epithelium\nNOTE: To obtain enough LGR5+ cells for a full 48-well plate, collect three Lgr5-EGFP CVPs in the same tube and process simultaneously. Importantly, harvest and process the CVP of at least one wild type littermate in parallel in a separate tube and utilize it as a gating control to set FACS parameters (see Representative Results).\nEuthanize the mice with CO2 asphyxiation according to IACUC regulations, followed by an approved secondary method such as bilateral thoracotomy, cervical dislocation, decapitation, or exsanguination.",
    "Use large sterile dissection scissors to cut the cheeks and break the jaw. Lift the tongue and cut the lingual frenulum to separate the tongue from the floor of the oral cavity. Cut out the tongue and collect it in sterile ice-cold Dulbecco's phosphate-buffered saline (dPBS) with Ca2+ and Mg2+.\nRemove and discard the anterior tongue by cutting just anterior of the intermolar eminence with a razor blade (Figure 1A, dashed line). Use a delicate task wipe to remove any hair and excess liquid from the posterior tongue.\nFill 1 mL syringe with 200-300 µL of injection enzyme solution (final concentration: 2 mg/mL type-I Collagenase and 5 mg/mL Dispase II in Ca2+/Mg2+-containing dPBS, diluted from 10 mg/mL stock solutions) and insert a 30 G x ½ needle just above the intermolar eminence (Figure 1B, black arrow) until just anterior to the CVP (Figure 1B, black box). Inject the enzyme solution underneath and at the lateral edges of the CVP between the epithelium and the underlying tissues (lamina propria, muscle). Withdraw the syringe slowly and continuously from the tongue as the injection is performed.\nIncubate the tongue in sterile Ca2+/Mg2+-free dPBS at room temperature for precisely 33 min.\nMake small cuts in the epithelium bilaterally and just anterior to the CVP using extra fine dissection scissors, and gently peel the epithelium by lifting it with fine forceps. Once the trench epithelium is free of the underlying connective tissue, place it in an empty 2 mL microcentrifuge tube pre-coated with FBS. Do the epithelial trimming before or after detaching the CVP epithelium (Figure 1C,D).\n2. Dissociation of CVP epithelium\nNOTE: Dissociation of the CVP epithelium and plating are represented graphically in Figure 2.",
    "Add the dissociation enzyme cocktail (final concentration: 2 mg/mL type-I Collagenase, 2 mg/mL Elastase, and 5 mg/mL Dispase II in Ca2+/Mg2+-containing dPBS, diluted from 10 mg/mL stock solutions) to tubes containing peeled CVP epithelia (200 µL per CVP). Incubate in a 37 °C water bath for 45 min. Vortex briefly every 15 min.\n\tNOTE: Prewarm 0.25% Trypsin-EDTA in 37 °C water bath during the last 15 min of enzyme cocktail incubation.\nFollowing incubation, vortex (three pulses) then triturate with a glass Pasteur pipette for 1 min. After tissue pieces settle, pipette the supernatant containing first collection of dissociated cells, into new FBS-coated 1.5 mL microcentrifuge tubes corresponding to the genotype. Process the remaining tissue pieces further as described in step 2.3. below.\n\t\nSpin the supernatant for 5 min at 370 x g and 4 °C to pellet cells.\nRemove the resulting supernatant and resuspend the cell pellet in Fluorescence-Activated Cell Sorting (FACS) Buffer (1 mM EDTA, 25 mM HEPES (pH 7.0) and 1% FBS in Ca2+/Mg2+-free PBS (50 µL per CVP)). Store on ice.\nWhile carrying out steps 2.2.1 and 2.2.2, dissociate the remaining tissue pieces from step 2.2 by adding pre-warmed 0.25% trypsin-EDTA (200 µL per CVP) to the original 2 mL microcentrifuge tubes and incubate in a 37 °C water bath for 30 min. Vortex briefly every 10 min.\nFollowing incubation, vortex the tube containing tissue pieces (three pulses) then triturate with a glass Pasteur pipette for 1 min. After tissue pieces settle, pipette the supernatant into the 1.5 mL microcentrifuge tubes containing cells from step 2.2.2. Discard the tubes containing the remaining tissue pieces.\n\t\nSpin the tubes with dissociated cells for 5 min at 370 x g and 4 °C to pellet cells.",
    "Remove the supernatant and resuspend cell pellets in FACS Buffer (100 µL per CVP). Store on ice.\nPass the cells through a 30 µm nylon mesh filter and add DAPI (λemission = 450 nm) to cell mixtures prior to FACS. Isolate Lgr5-GFP+ cells via FACS using the green fluorescent protein channel (λexcitation = 488 nm; λemission = 530 nm). Sort the cells using a 100 µm nozzle into a fresh FBS-coated 1.5 mL microcentrifuge tube containing 300 µL of Ca2+/Mg2+ free dPBS. Place the cells on ice until plating.\n3. Plating of Lgr5-EGFP cells\nDetermine the volume of LGR5+ cell suspension received from the flow cytometer.\nBased on the number of cells obtained from the sorter, calculate the number of cells per µL. Then, determine the volume needed to obtain the desired number of cells for plating (we use 200 cells per well of a 48-well plate) and transfer that total volume of suspended cells into a new microcentrifuge tube.\nSpin the tube for 5 min at 370 x g and 4 °C to pellet cells (pellet may not be visible). Remove the supernatant and place the tube on ice.\nGently resuspend the cell pellet in the appropriate amount of matrix gel (15 µL per well for 48-well plates); pipette up and down gently to thoroughly distribute cells in matrix gel. Place 15 µL of matrix gel/cell mixture in the center of each well. Keep the microcentrifuge tube on ice in a 50 mL conical tube during plating to prevent matrix gel from gelling. Continue to mix matrix gel/cell mixture throughout plating by pipetting up and down every three wells to ensure an even distribution of cells across wells.",
    "Place the plate in the incubator (37 °C, 5% CO2, ~95% humidity) for 10 min to allow matrix gel gelling. Then, add 300 µL of room temperature WENRAS + Y27632 media to each well and return the plate to the incubator.\n4. Organoid maintenance\nNOTE: Organoids are grown in conventional organoid media (WENR) comprising recombinant EGF and 50% conditioned media containing Wnt3a, Noggin, and R-spondin23. Drugs A8301 and SB202190 are added for the first 6 days of the culture period to optimize growth (WENRAS media) (Figure 5), then removed to promote differentiation (WENR media)20. Y27632 is added for the first 2 days of culture to promote survival. Media conditions relative to the culture timeline are presented in Figure 4.\nTwo days after plating, remove WENRAS + Y27632 media from each well using a 1 mL pipette, ensuring no cross-contamination. Add 300 µL of WENRAS media down the side of the well to not disrupt the matrix gel. Return the plate to the incubator.\nChange the media every 2 days, using the appropriate media for the culture stage (Figure 4). Maintain organoids until day 12, when the organoids are ready to harvest.\n5. RNA processing\nHarvesting organoids for RNA\n\t\nPlace 48-well plate on ice for 30 min to depolymerize the matrix gel.\nUsing a 1 mL pipette, pull up the organoid media; then, as the media is returned to the well, use the tip of the pipette to scratch and further break up the matrix gel. Transfer the contents to a 1.5 mL microcentrifuge tube, pooling contents of three wells in one tube. Centrifuge the tubes for 5 min at 300 x g at room temperature.",
    "Remove as much media supernatant as possible without removing any organoids; then, spin down tubes again for 5 min at 300 x g at room temperature.\nRemove the remaining media and resuspend the organoids in 350 µL lysis buffer + β-mercaptoethanol (βME) (10 µL βME per 1 mL lysis buffer). Place the samples on ice for immediate RNA extraction or store at -80 °C.\nQuantitative RT-PCR analysis\n\t\nMeasure RNA quantity via spectrophotometer. Reverse-transcribe RNA using a cDNA Synthesis Kit.\nMix cDNA equivalent to 5 ng RNA with 200 nM pre-validated forward and reverse primers (Table 1) and fluorescent PCR Master Mix. Run the qRT-PCR reaction for 40 cycles at: 95 °C for 15 s, then 60 °C for 60 s.\n6. Immunohistochemistry\nHarvesting and fixing the organoids\n\t\nPlace 48-well plate on ice for 30 min to loosen the matrix gel.\nRemove the organoid media and add 400 µL of ice-cold PBS to each well. Then, remove PBS and add 400 µL of ice-cold Cell Recovery Solution to each well. Rock gently at 4 °C for 30 min.\nCoat a 1 mL pipet tip with 1% BSA in PBS, and gently pipet contents of the well up and down to break up the matrix gel. Transfer the organoids to a 1.5 mL microcentrifuge tube placed on ice.\nRinse each well with 300 µL PBS + 1% BSA and transfer any remaining organoids to the corresponding tubes. Remove Cell Recovery Solution/PBS + BSA from each tube. Add 400 µL of ice-cold PBS, then repeat with another ice-cold PBS rinse.\nRemove PBS and fix organoids with 300 µL ice-cold 4% PFA (in 0.1 M PB) for 20 min, incubating at room temperature. Remove PFA and rinse organoids with 400 µL ice-cold PBS.",
    "Remove PBS; then, add 400 µL PBS + 1% BSA. Store at 4 °C.\nImmunofluorescence staining\n\t\nRinse organoids in 500 µL PBS + 1% BSA. Then, incubate organoids in blocking solution (5% normal goat or donkey serum, 1% bovine serum albumin, 0.3% Triton X 100 in 1x PBS pH 7.3) for 2 h, rocking gently at room temperature.\nAdd the primary antibody solution (primary antibodies diluted in blocking solution) and rock gently for 3 nights at 4 °C.\nWash organoids 4x for 1 h with 500 µL PBS + 0.2% Triton, rocking gently at room temperature. Add secondary antibody solution (secondary antibodies diluted in blocking solution) and rock organoids overnight, protected from light, at 4 °C.\nWash organoids 3x for 1 h with 500 µL PBS + 0.2% Triton, protected from light and rocking gently at room temperature. Incubate with DAPI diluted 1:10,000 in 0.1 M PB for 20 min, rocking and covered at room temperature.\nWash the organoids 3x for 20 min with 0.1 M PB, rocking gently and covered at room temperature.\nSlide mounting of organoids for inverted confocal microscopy.\n\t​NOTE: Step-by-step pictures of the slide mounting process are shown in Figure 7.\n\t\nCreate a ~1 mm thick 22 x 22 mm square perimeter of non-toxic modeling clay on a microscope slide.\nRemove 0.1 M PB from microcentrifuge tube, and gently resuspend organoids in 100 µL mounting medium of choice; then, transfer to center of the clay square.\nFill the clay square until the mounting medium is almost to the top. Then, place 22 x 22 mm square coverslip over clay and press down firmly on the sides of the coverslip to seal. Let it cure according to the manufacturer's instructions (here, room temperature for 1-2 days) and store at 4 °C.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}