{
  "id": 3641,
  "origin_website": "Cell",
  "title": "Isolation, culture, and functional analysis of hepatocytes from mice with fatty liver disease",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDay of isolation: preparation of buffers and setup of perfusion pump\nTiming: 1.5 h\nThis step includes the preparation of buffers and preparation of the perfusion pump. The perfusion system includes a water bath and a peristaltic pump with adjustable speed. The required volumes for hepatocyte isolation from one mouse are described in the table.\ntable:files/protocols_protocol_328_7.csv\nPrepare the perfusion buffer, digestion buffer, plating media, Percoll media, and maintenance media prior to the isolation. Place perfusion buffer and digestion buffer sufficient for one digestion reaction in two separate 50 mL tubes in a 42°C water bath for at least 30 min prior to the isolation. 40 mL perfusion buffer and 30 mL digestion buffer are sufficient for isolation of hepatocytes from one mouse.\nSet up the perfusion pump by mounting the peristaltic pump with a long 1/32” ID × 3/32” OD silicone tubing immersed in a water bath. The tubing will be connected to the pump with a 3/32” Polypropylene coupler (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/328-Fig2.jpg\nFigure 2. Overview of the setup of the peristaltic perfusion pump, tubes, syringes, and water bath\nThe perfusion pump system includes a water bath (A) and a peristaltic pump with adjustable speed (B). The inlet tubing is placed into a 50 mL tube in the 42°C water bath containing the perfusion buffer (A). The silicone tubing is connected to the peristaltic pump using a polypropylene coupler. A 25G 7/8 needle is attached to the outlet tubing used to cannulate the inferior vena cava (C).\nPlace the inlet tubing into a 50 mL tube with perfusion buffer in the 42°C water bath.\nSet the perfusion pump speed at 1–2 mL/min. Note that the settings will vary depending on the instrument used (Figure 2[href=https://www.wicell.org#fig2]B).",
    "Place the surgical table at an angle in a waterproof container in close proximity to the perfusion pump.\nAssemble the outlet catheter by attaching a 25G 7/8 needle to the outlet tubing (Figure 2[href=https://www.wicell.org#fig2]C).\nRinse the pump with 10 mL 70% EtOH and 10 mL water.\nRun the pump with perfusion buffer for 5 min to ensure an even flow rate.\nCritical: Prepare the digestion buffer 1 h prior to the isolation and place in a 42°C water bath. The water bath should not be above 42°C as that can inactivate the collagenase in the digestion buffer. The hepatocyte culture media can be made in advance and kept in 4°C for up to a month.\nCritical: The exit temperature (the fluid that will enter into the inferior vena cava) should be ∼ 37°C. The temperature of the solution gradually cools as it is passing through the tubing. By maintaining the buffers in the water bath at 42°C, the exit temperature will be ∼37°C after passing through the perfusion tubing. The length of tubing and the flow rate will affect this temperature loss, so it is advised to measure that the exit temperature is ∼37°C before starting the perfusion procedure.\nLiver perfusion and enzymatic dissociation of liver cells\nTiming: 0.5–1 h\nThis step will perfuse the liver followed by enzymatical digestion using collagenase IV to dissociate the liver cells into a single-cell suspension.\nEuthanize the mouse by CO2 asphyxiation and clean the abdominal area with 70% EtOH.\nMake an incision in the abdominal area to expose the liver, inferior vena cava, and portal vein.\nPlace the catheter into inferior vena cava (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/328-Fig3.jpg\nFigure 3. Step-by-step illustration of isolation of viable hepatocytes from diet-induced NASH mice\n(A) Placement of the catheter into inferior vena cava (step 11).",
    "(B) Liver perfusion resulting in a pale, enlarged liver (step 14).\n(C) Result after digestion using collagenase solution (step 17).\n(D) Addition of plating medium and dislodging of the cells from the liver (step 18).\n(E) Passing the cell suspension through a 70 μm strainer (step 19).\n(F) Schematic illustration of centrifugation steps to isolate hepatocytes. Cell pellets will be collected after 100 × g and 1,000 × g for 10 min using 25% and 90% Percoll gradients (steps 20–25).\n(G) Plated hepatocytes 24 h after isolation under a phase-contrast microscope. Scale bar denotes 100 μm.\nStart the perfusion pump with perfusion buffer at a rate of 2 mL/min. Ensure the correct flow rate by measuring the outlet volume as a fraction of time.\nAfter 2 min, cut the hepatic portal vein to clear the liver from blood.\nContinue the perfusion for an additional 10 min. This step will use 25 mL perfusion buffer in total. Successful perfusion will result in a pale, enlarged liver (Figure 3[href=https://www.wicell.org#fig3]B).\nWhen 2–5 mL is left of the perfusion buffer, add the digestion buffer to the 50 mL tube without stopping the pump.\nDigest for 10–20 min at 2 mL/min. This will use 20–30 mL digestion buffer in total.\nWhen visible tissue dissociation is seen, carefully remove the liver including the gall bladder and place in a 10 cm petri dish kept on ice (Figure 3[href=https://www.wicell.org#fig3]C).\nAdd 10 mL cold plating medium to the dish. Without puncturing the gall bladder, dissociate the liver cells by gently swirling the liver in cold plating media. Use a pipette with a 1,000 μL tip to generate a homogenous cell suspension (Figure 3[href=https://www.wicell.org#fig3]D).",
    "Transfer the cell suspension to a 70 μm strainer placed on a 50 mL tube on ice (Figure 3[href=https://www.wicell.org#fig3]E). Wash the plate with an additional 10 mL plating medium and transfer to the 50 mL tube.\nCritical: The exact time for optimal liver digestion will vary slightly between mice. Signs of underdigestion include inability to mechanically dissociate the liver into a single-cell suspension. Signs of overdigestion include complete digestion of the liver into a homogenous solution before transfer to the petri dish. Digestion is considered successful when the liver can readily be transferred to the petri dish, and the cell solution is homogenous without visible liver pieces after mechanical dissociation and can easily be passed through the 70 μm strainer.\nSingle-cell hepatocyte isolation using Percoll gradient centrifugation\nTiming: 4–6 h\nThis step will separate viable hepatocytes with different sizes of lipids from dead hepatocytes and other non-parenchymal cell types in the cell suspension using Percoll gradient centrifugation. The Percoll media is composed of colloidal silica and has been extensively used for the isolation of cells and organelles (Kreamer et al., 1986[href=https://www.wicell.org#bib5]; Pertoft, 2000[href=https://www.wicell.org#bib7]). The density of the Percoll solution is dependent on its concentration, the total g-force, and the centrifugation time, which will affect the gradient formation. Depending on the requirements, conditions such as centrifugal force, centrifugation time, and Percoll density gradient composition can be modified.\nCentrifuge the strained cells at 50 × g for 5 min at 20°C–24°C to separate hepatocytes from non-parenchymal cells. Hepatocytes will pellet at 50 × g.\nDiscard the supernatant.\nResuspend the pellet in 20 mL plating media and wash the cells twice at 50 × g for 5 min.\nResuspend the pellet in 40 mL plating media. Divide the solution into four tubes with 10 mL solution in each tube.",
    "Prepare two sets of Percoll/hepatocyte mix for a total of 4 tubes with either 25% or 90% Percoll by adding 10 mL of 20°C–24°C 90% Percoll media to two of the tubes and 25% Percoll media to the remaining tubes. The final volume of the Percoll/hepatocyte mix will be 20 mL.\nCentrifuge one set of tubes (25% and 90% Percoll/hepatocytes) at 100 × g and the other set of tubes (25% and 90% Percoll/hepatocytes) at 1,000 × g. Centrifuging cells at 1,000 × g is predicted to sediment cells with higher lipid content compared with 100 × g. This step will isolate viable non-lipid-filled and lipid-filled hepatocytes (Figure 3[href=https://www.wicell.org#fig3]F).\nResuspend the pellets in 20 mL plating media and spin at 50 × g for 4 min twice to remove the Percoll media.\nResuspend the final hepatocyte pellets in 1 mL media and measure cell number and viability using trypan blue and a manual or automatic hemocytometer.\nSeed cells into collagen coated plates. Plate 4 ×105 viable cells in 6-well plates or 2 × 105 cells in 12-well plates and place plates in a 37°C incubator with 5% CO2 for 3–4 h.\nAfter 3–4 h, wash once with PBS to remove dead cells, replace with maintenance medium (Figure 3[href=https://www.wicell.org#fig3]G). Experiments can start the same or next day.\nNote: Keep the Percoll medium at 20°C–24°C to maintain the pH between 8.5–9.5.\nNote: Depending on the degree of hepatic steatosis, differences in cell numbers from the different Percoll gradient fractions can vary between isolations. When isolating cells from NASH mice, the largest number of hepatocytes will be collected from the 25% Percoll density gradient, while the lowest number of hepatocytes will be obtained from the 90% Percoll density gradient.",
    "Optional: If complete removal of erythrocytes is desired, spin the hepatocyte pellet at 20 × g for 3 min after step 20 and remove the supernatant.\nOptional: If non-parenchymal cells are desired, collect the supernatant from step 21 and spin the supernatant solution at 650 × g to pellet non-parenchymal cells such as stellate cells, endothelial cells, and Kupffer cells.\nOptional: If the cells will be analyzed with single-cell RNA sequencing or RNA sequencing, continue directly from step 27 without plating the cells.\nPause Point: It is necessary to complete the whole procedure without pause to maintain cell viability.\nFunctional characterization of hepatocytes from NASH mice\nTiming: 2–4 h\nThis step will functionally characterize the hepatocytes using oil red O staining. Alternative analyses include drug testing, lipogenesis, and gene expression analyses. The protocol here uses hepatocytes plated in a 12-well plate.\ntable:files/protocols_protocol_328_8.csv\nPrepare the solution 10 min before use.\nPrepare 7 mL oil red O Solution by mixing oil red O with H2O at a 3:2 ratio. 7 mL is sufficient for one 12-well plate when using 500 μL per well.\nGently wash the cells twice with 1 mL PBS.\nAdd 0.5 mL per well of 3% Formalin diluted in PBS and incubate for 0.5–1 h at 20°C–24°C.\nDiscard the formalin and wash the cells twice with 1 mL ddH2O.\nAdd 0.5 mL 60% isopropanol and incubate for 5 min.\nDiscard the isopropanol and apply the oil red O Working Solution. Rotate the plate to ensure even distribution and incubate for 10–20 min at 20°C–24°C.\nDiscard the oil red O solution and wash the cells 2–5 times with ddH2O until clear.\nAdd 1 mL ddH2O and view red lipid droplets under a microscope using a 40× objective.",
    "Optional: For nuclei staining, add Hematoxylin after step 36 and incubate for 1 minute. After discarding Hematoxylin, wash the cells 2–5 times with ddH2O until clear. Nuclei should appear blue under the microscope.\nNote: Stained cells can be stored in 4°C for up to 1 week. Keep the cells immersed in water to avoid drying.\nCritical: Do not store the mixed oil red O solution for more than 2 h. Reusing the oil red O Working Solution is not recommended as it can result in poor staining quality."
  ],
  "subjectAreas": [
    "Metabolism",
    "Cell Isolation",
    "Single Cell",
    "Cell Culture",
    "Cell Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}