{
  "id": 5001,
  "origin_website": "Bio",
  "title": "Rust Removal Experiments",
  "procedures": [
    "Rust removal experiment(Optional) Machine cut the rusted iron samples (~1” x 1”).Clean the metal surface by washing it with acetone three times (50 ml total), rinse with excess high pure water, and air dry for 20 min. Insert the cleaned samples in an appropriate container (e.g., 50 ml centrifuge tube). Add the rust removal agent and then immediately submerge the sample in high pure water. The final volume should be recorded (V1). Put the tubes in shakers at 100-200 rpm. Collect 100 μl samples every 30 min for the desired time period (our test periods have ranged from 15 min to 2 h).Remaining rust removal experimentRemove the metal sample and rinse it with pure water several times. Immerse the washed samples in a known volume (V2) of 10% (wt/vol) oxalic acid solution. Shake at 100-200 rpm for 30 min. Collect 100 μl of sample.Iron (II) calibration curveAdd 40 μl of 1, 10-phenanthroline solution (0.3% wt/vol), 40 μl of hydroxylamine hydrochloride solution (1% wt/vol), and 40 μl of ammonium acetate (0.1 M) to each well of a 96 well plate. Add the iron (II) working solution: 0, 10, 20, 30, 40, 50, and 90 μl to wells containing the above mixture and adjust the final volume to 250 μl with high pure water [the iron(II) concentration will be 0, 1, 2, 3, 4, 5, and 9 mg/L, respectively]. Repeat twice more to produce triplicate curves. Mix thoroughly via pipetting up and down 3 times. Allow the solutions to stand for 20 min to fully develop color.Measure the absorbance at 510 nm. Plot the calibration diagram and fit the best linear curve (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160328/20160328184551_1895.jpgFigure 1. The developed colorimetric assay. Increasing concentration of Fe (II) from zero to 10 ppm (row A and B) increases the absorbance at 510 nm linearly.",
    "Row C includes treatment samples at different time points and remaining rust after treatment with oxalic acid.Ferric content in rust removal treatment and total rustDilute the collected samples to obtain iron ion in a range of 1 to 10 ppm or alternatively add serially diluted samples. We usually dilute our metal samples 100-400 times. Record the dilution factor (D1 for samples and D2 for total rust).Add 20 μl of diluted samples to the 96 well plate mixture of 1,10-phenanthroline solution (40 μl of 0.3% wt/vol), hydroxylamine hydrochloride solution (40 μl of 1% wt/vol), and ammonium acetate (40 μl of 0.1 M). Adjust the volume to 250 μl per well with high pure water.Mix thoroughly via pipetting up and down 3 times. Allow the solutions to stand for 20 min to fully develop color.Measure the absorbance at 510 nm. Use the calibration curve to calculate the concentration (C1 for samples and C2 for total rust). Consider the dilution of samples in the total well volume imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171024/20171024015450_4558.jpg times.CalculationRemoved rust (mg): imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171024/20171024020012_9380.pngRemaining rust (mg): imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171024/20171024020020_5568.pngRust removal (%):imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171024/20171024020201_2053.jpg"
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}