{
  "id": 1681,
  "origin_website": "Cell",
  "title": "Protocol to maintain single functional mouse hematopoietic stem cells in vitro without cell division",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nMouse bone marrow cell preparation\nTiming: approximately 2–3 h, depending on the number of animals/samples\nThis section describes the preparation of murine bone marrow cell suspension and magnetic bead depletion of progenitor cells (optional) by negative selection using the EasySep™ Mouse Hematopoietic Progenitor Cell Enrichment Kit (STEMCELL).\nHarvest the bone marrow cells from femora, tibiae and pelvic bones removed from the mice by crushing the bones in 10mL PBS 2%FCS using a mortar and pestle. For specific animals where maximal cells are required, BM can also be obtained from the spine and forearms\nTransfer the cell suspension into a 50 mL conical polypropylene centrifuge tube\nCentrifuge the cell suspension for 5 min at 300 x g at room temperature\nRemove the supernatant and resuspend the cells in 3mL PBS/FCS\nLyse the red blood cells by adding 5 mL Ammonium Chloride (NH4Cl, STEMCELL) incubating the cells on ice for 10 min, vortexing after the first 5 min\nFill the tube up to 50mL with PBS/FCS and centrifuge for 5 min at 300 x g at room temperature\nResuspend the cells in 500μL/mouse PBS/FCS and transfer into a polystyrene round-bottom tube\nAdd 1mL of PBS/FCS to the empty 50mL conical polypropylene centrifuge tube from step 6 and use these leftover cells for preparing control samples of non-depleted cells. This is important to assist the user in setting gates for sorting as well as for determining the absolute frequencies of subpopulations of interest, since these cannot be measured from the enriched sample. Filter the suspension using a 50-μm filter. Use 100μL of this suspension into each of the FACS control tubes (unstained, 7AAD only, FITC only, PE only, APC only, PE-Cy7 only, BV421 only)",
    "Optional: Perform lineage depletion by using EasySep mouse hematopoietic progenitor cell enrichment kit (STEMCELL). The lineage depletion step will reduce sorting time and reagent costs, especially when isolating HSCs from multiple mice. We typically use the Hematopoietic Enrichment Cocktail and EasySep technology from STEMCELL Technologies, however, other commercial suppliers of lineage depletion kits exist. Alternatively, the lineage depletion step could by replaced using directly conjugated antibodies which allow the exclusion of the differentiated population during the cell sorting (CD5, CD11b, CD19, CD45R/B220, Ly6G/C(Gr-1), TER119). This, however, will increase sorting time and reagent costs, compared to performing the lineage-depletion step prior to cell sorting.\nManufacturer protocol was followed with minor modifications to prioritize yield over purity in this pre-sort “debulking” step:\nAdd 10μL/mouse EasySep Mouse Hematopoietic Progenitor Cell (HSPC) Isolation cocktail and incubate for 15 min, on ice.\nAdd 15μL/mouse EasySep Streptavidin RapidSpheres and incubate for 15 min on ice\nAdd PBS/FCS to a total of 2.5mL\nInsert the tube into the EasySep Magnet and incubate for 3 min at room temperature\nTransfer the supernatant into a new tube and repeat the magnet incubation step one additional time\nCentrifuge the cell suspension for 5 min at 300 x g at room temperature\nResuspend the cells in 100μL/mouse PBS/FCS and transfer into a polypropylene tube to perform antibody staining\nAntibody staining\nTiming: 40–50 min\nThis section describes the incubation of bone marrow samples with fluorescence-tagged antibodies and the preparation of compensation controls.\nAdd the following antibodies to the FACS control tubes:\ntable:files/protocols_protocol_1141_3.csv\nAdd all antibodies at the concentration specified above to the sample tubes (making an antibody master mix is recommended if more than one sample)\nVortex the cells in each tube and incubate on ice in the dark for 30 min",
    "Wash the cells by adding 1mL of PBS/FCS to each tube and centrifuging for 5 min at 300 x g at room temperature\nResuspend the control tubes in 300μL PBS/FCS and add 1:1000 7AAD to the 7AAD-only control tube\nResuspend the sample tube in 500μL/mouse 1:1000 7AAD in PBS/FCS and filter the suspension using a 50-μm filter into a new polypropylene tube. Add 500μL 1:1000 7AAD in PBS/FCS to the original tube to make sure to rinse out the remaining cells and transfer them to the new tube through the 50-μm filter\nSorting of ESLAM Sca-1high LT-HSCs\nThis section describes the workflow to isolate single HSCs using fluorescent-activated cell sorting (FACS).\nUse the unstained control to set voltages of each channel on the flow sorter and use 7AAD-only control to set the viability gates. Use the single stain controls to set up the compensation for each detection channel\nOptional: Compensation beads can substitute for single stain controls, but it is important to remember that they will not account for background staining or autofluorescence and it is advisable to check the full panel in an initial setup phase.\nApply the compensation settings to the sample tubes\nLoad the sample tube on the flow sorter and set gates as shown in Figure 1[href=https://www.wicell.org#fig1]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1141-Fig1.jpg\nFigure 1. Representative gating strategy to purify ESLAM Sca-1high LT-HSCs",
    "On a SSC-A vs FSC-A plot, gate a region which excludes most of the dead cells and debris and very large cells. Gate on single cells using pulse width and FSC-A as shown. Exclude dead cells by gating 7AAD-negative cells. To set the SLAM population, gate CD48- CD150+ cells, being careful not to go too high into the CD48dim population. From the SLAM population, gate CD45+EPCR+cells with a relatively strict EPCR+ gate (initially described as EPCR++)(Kent et al., 2009[href=https://www.wicell.org#bib6]). To set the ESLAM Sca-1high population which has an increased proportion of LT-HSCs but reduced overall yield, gate Sca-1high cells (described in Wilson et al., 2015[href=https://www.wicell.org#bib12]).\nUse the single-cell deposition unit of the sorter to place 1 cell into each of the wells of U-bottom 96-well plates, each well having been preloaded with 50μL media (described above in “Before you begin” section)\nLoad 50μL media (described above) supplemented with a 2X cytokine concentration to bring the final medium to 1X cytokines\nPause point: The cell suspension can be stained for longer than 30 minutes on ice, but it is recommended not to exceed ∼1hour in order to avoid overstaining the samples and increasing background signal. For a quicker preparation of single stain controls, tubes can be incubated for a shorter time (∼15 minutes) at room temperature, but this is not advisable for primary samples where room temperature incubation may alter the function of cells.",
    "Optional: Given the long preparation time required to obtain cell suspension pre-sorting, bone marrow harvest can be performed the day before the sort and the cell suspension can be stored in 10%FCS/PBS at 4°C overnight. If considering this option, consider storing the sample in a larger liquid volume (∼5mL/mouse) and then spinning at 300 x g for 7 minutes followed by addition of crude DNase I to the pellet in the morning before undertaking lineage depletion and/or antibody staining described above."
  ],
  "subjectAreas": [
    "Immunology",
    "Stem Cells",
    "Microscopy",
    "Flow Cytometry",
    "Cell Culture",
    "Single Cell"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}