{
  "id": 2431,
  "origin_website": "Cell",
  "title": "Coupling live-cell imaging and in situ isolation of the same single cell to profile the transient states of predicted drug-tolerant cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCoating and seeding cells in FrameSlides PET for laser capture microdissection\nTiming: 2–3 h\nThis part of the protocol describes the coating and seeding of the IC-RP expressing cells on FrameSlides polyethylene terephthalate (PET) (Carl Zeiss, France) for video microscopy followed by laser capture microdissection of the phenotyped cells of interest. In this protocol we use only one FrameSlide per experiment, but the number of conditions can be increased. The SlideHolder can be loaded with up to three FrameSlides.\nFrameSlide preparation.\nAdd 1 mL of rat tail collagen coating solution (40 μg/mL) on the FrameSlide membrane. Aliquots must be stored at 4°C for up to 12 months.\nImmediately aspirate back 400 μL and let incubate with 600 μL on the FrameSlide.\nIncubate 2 h at 37°C, 5% CO2.\nQuick wash membrane twice (30 s) with 600 μL fresh 1× PBS.\nTake a 100 mm dish from section “FACS to obtain clonal cell lines[href=https://www.wicell.org#sec1.2]” step 18 and Figure 1[href=https://www.wicell.org#fig1].\nCount cells.\nResuspend cells to reach a density of 6000 cells in 700 μL (≃8500 cells/mL) of imaging medium.\nAdd 700 μL of cells suspension to the coated FrameSlides PET.\nLet the FrameSlide under the tissue culture hood for 30 min to allow a homogeneous cell seeding.\nPlace the FrameSlides PET on the SlideHolder and incubate for 14 h/overnight at 37°C, 5% CO2.\nCritical: Do not add more than 800 μL of medium on the FrameSlide, so as avoid distorting the membrane. The FrameSlide in step 6 could be placed on a clean bench for 30 min before going in the incubator, if an homogeneous cell seeding cannot be obtained under the tissue culture hood.\nLive-cell treatment and video microscopy\nTiming: 2 days",
    "This step focuses on the setup and optimization of live-cell time-lapse fluorescence acquisition. In this study, we use the DeltaVision Elite microscope system (GE Healthcare Life Science, Velizy-Villacoubray, France). This system is equipped with an environmental chamber coupled with a CO2 controller unit Bold Line from Okolab and heat controller/humidity monitor from World Precision instrument. The objective used is a 20× Super-Plan APO objective (NA=0.75). Other types of fluorescent microscopes equipped with environmental chambers can be used but the temperature, humidity, airflow, and CO2 levels cited below, would have to be optimized by doing a 24-h live-cell experiment confirming proper cell growth. After TRAIL treatment, the cells were imaged in transmitted light every 3 min for 50 min and using the following InsightSSI solid state illumination unit (Applied Precision) with excitation (Ex.) wavelengths and single bandpass emission (Em.) filters: for CFP (Ex. 438/24 nm - Em. 475/24 nm), YFP (Ex. 513/17 nm - Em. 548/22 nm). (The excitation power measured at the sample location should be 9 mW for CFP and 3.5 mW for YFP or less, while maintaining a signal to noise ratio above 1.5; see note step 18 below.).\nDay 1: Environmental chamber setup for live imaging.\nTurn on microscope and workstation.\nTurn on the Temperature Controller using the power switch on the back of the unit.\nPress the Temp button on the front of the controller to display the current temperature set point.\nUse the Up and Down buttons to change temperature to 37°C and press Display to save changes.\nTo adjust the air flow set point press the Config button until “Fan Air Flow Set Point” reach 30% and press Display to save changes.\nNote: Fan speed below 20% cannot maintain 37°C. A fan speed of 30%–50% is recommended during normal operation.",
    "Note: Check the temperature inside the environmental chamber, as the temperature setpoint and the actual reading the chamber may vary: modify the setpoint if necessary.\nAllow ample time (minimum 6 h) for the system to reach a stable temperature/CO2 environment.\nNote: Air inside the chamber will come to temperature quickly but system components (stage, objectives, etc.) will take much longer and may cause important focus drift for at least 3 h. To minimize drift within an experiment, allow system to equilibrate for 6 h minimum before imaging.\nVerify that humidifier is between ½ and ¾ full of deionized water.\nTurn on the premixed gas and set regulator between 5–10 PSI.\nSwitch the flowmeter to the “ON” position and slowly turn the knob to adjust flow rate between 40–50 (160–207 mL/min).\nBubbles will appear in the humidifier as gas flows into the water. If the humidifier is ≈ ¾ full, allow 10–15 min for CO2 saturation.\nDay 2: Just before imaging, mount the FrameSlides PET on the stage (Zeiss logo on the left). The SlideHolder must be inserted with the red pine on the left (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1916-Fig2.jpg\nFigure 2. FrameSlide handling for live-cell microscopy and for laser-capture microdissection\n(A) The picture shows how to insert the FrameSlide in the Delta Vision’s SlideHolder. The Zeiss Logo (red dot) must be placed on the left side directly in contact to the red notch.\n(B) The picture shows how to place the FrameSlide in the Zeiss PALM setup for laser microdissection. The FrameSlide must be inserted 90° clockwise in order to have the Zeiss Logo (red dot) on the top of the SlideHolder.\nPlace the cell cover over the samples and verify that the gasket on the cover surround the outer edge of the SlideHolder.",
    "Critical: Check imaging medium on the slide. Never let the slide dry up when at 37°C.\nNote: Although accessible transparent surfaces in the microscope light path should be clean, the FrameSlide PET membrane cannot be cleaned.\nClick on the Start SoftWoRx™ icon (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1916-Fig3.jpg\nFigure 3. SoftWoRx desktop display\nThe SoftwoRx software is presented in several adjustable windows.\n(A–E and I) The Resolve3D window (A,B,C,D and E) contains parameters for image acquisition, filter selection and table position control (I).\n(F) In (F), the image capture window shows the images as they are captured live.\n(G and H) The selection of the different fields is shown in (G) and the point list of their respective coordinates (x,y,z) in (H). Make sure that the turret lens is in the 20× position according to the lens parameters in (D).\nNote: The software packages provided with the live-cell microscope may differ but operating the acquisition and the experimental design will include the following steps.\nFrom the main menu, chose File and Acquire (Resolve3D) to initialize the system.\nRotate objective turret until 20× objective is in the active position. Update selection in the Lens drop down menu (Figure 3[href=https://www.wicell.org#fig3]D).\nNote: The DeltaVision system used here has a 1.59× auxiliary magnification (final magnification 31.8×).\nUse the Polychroic drop down menu and select Quad (Figure 3[href=https://www.wicell.org#fig3]B). The filters will be set in the Experiment setup window, in step 18d.\nSet the Image size to 512 × 512 (Figure 3[href=https://www.wicell.org#fig3]C).\nSet the Binning drop down menu to 2 × 2 (Figure 3[href=https://www.wicell.org#fig3]E).",
    "Note: Using the Edge/sCMOS_5.5, the pixel size ends up at 0.4 μM here. Since only an average pixel intensity of the whole cell is going to be measured here (no sub-cellular feature), the main goal in defining magnification, image size and binning parameters is to frame a sufficient number of cells for the next steps (5–10 cells per field).\nFocus on sample and find a region of interest.\nCheck Filter Monitor windows to ensure Ex and Em filters match for every channel (CFP, YFP and POL) (Figure 3[href=https://www.wicell.org#fig3]A).\nOpen the YFP channel and click on the Continuous Acquisition button to focus on the regions of interest with up to 20 well-separated cells. Stop Continuous Acquisition.\nDesigning the experiment.\nSelect the Experiment button in the Resolve3D window.\nUncheck the Use fast acquisition button (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1916-Fig4.jpg\nFigure 4. Experiment setup window\n(A) Uncheck the checkboxes “Use fast acquisition” and “Z Sectioning” in the sectioning panel. Ensure that the exposure in the channels is set between 25 and 80 ms depending on the fluorescence intensity.\n(B) Select 32% transmittance for both fluorescence channels and 5% transmittance for the POL channel.\n(C) Set the time-lapse parameters and activate the option “Maintain Focus with UltimateFocus” option.\nIn the sectioning tab uncheck the Z-sectioning button (Figure 4[href=https://www.wicell.org#fig4]A).\nIn the Channels tab (Figure 4[href=https://www.wicell.org#fig4]B), activate the appropriate number of channels (CFP, YFP and POL) and respective Ex and Em wavelengths for each channel. Select 32% transmittance and 80 ms exposure for both CFP and YFP channels and 10% transmittance and 5 ms exposure for the polarized channel.",
    "Note: Exposure and transmittance parameters should be determined to achieve a signal to noise ratio greater than 1.5 for both CFP and YFP. This ratio can simply be estimated by measuring the pixel intensity within a cell (signal) divided by the pixel intensity measured outside the cell (noise).\nSee troubleshooting problem 2[href=https://www.wicell.org#sec7.3].\nActivate the Time-lapse tab and set the Time-lapse (time between points) to 3 min and total time to up to 50 min (Figure 4[href=https://www.wicell.org#fig4]C).\nMark points of interest (Figure 5[href=https://www.wicell.org#fig5]B) with the Mark Point button in Resolve3D (Figure 5[href=https://www.wicell.org#fig5]C).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1916-Fig5.jpg\nFigure 5. Selection of the different fields of interest\n(A) By moving around the different areas of the well with the joystick, select a maximum of 3 fields that do not overlap and in which there are more than three cells.\n(B) It is recommended to place the fields more to the center of the wells.\n(C) Click “Mark Point”. You will see the coordinates of each point in the point list. Save the list. It is possible to replace a point by clicking on “Replace Point”.\nRepeat for approximatively 20 regions of interest (points), to be adjusted in order to monitor ≃100 cells in the whole experiment.\nSave the point list (Figure 5[href=https://www.wicell.org#fig5]C, red box).\nReplace the cell cover and let it stabilize on the z-axis during a minimum of 20 min.\nCritical: Do not go beyond the last 5 mm on the right of the FrameSlide PET because no microdissection is possible there and choose fields with more than three cells well separated.\nFrom the Resolve3D window, open the point list (Figure 3[href=https://www.wicell.org#fig3]H).",
    "Instead of adjusting the microscope with focus knob, visit each point using the camera and refine the focus position (z axis) using the dZ button in the resolve 3D window (Figure 3[href=https://www.wicell.org#fig3]I) and if desired the x/y position.\nClick the Replace Point (Figure 5[href=https://www.wicell.org#fig5]C, blue Box) button in the point list to save the update position.\nActivate the Point tab and list all the point you want to visit.\nSave the experiment.\nClick the Run button and start acquiring for up to 30 min.\nCritical: This step can be important before treatment, in order to skip the decrease in fluorescence ratio that can be observed at the beginning of the acquisition, when an autofluorescence bleaching is occurring in the CFP channel.\nStop the acquisition and proceed to the experiment.\nApplying recombinant human TRAIL treatment.\nPrepare 800 μL of imaging medium containing 25 ng/mL rhTRAIL.\nOpen the environmental chamber.\nAspirate 700 μL of the imaging media and quickly 800 μL of imaging media containing rhTRAIL (5s max to swap medium).\nClick the Run button and start acquiring for up to 50 min.\nSee troubleshooting problem 3[href=https://www.wicell.org#sec7.5].\nAt the end of the experiment, cool cells by gently plunging the FrameSlide PET into a 50 mL tube filled with PBS containing Ca2+/Mg2+, placed on ice.\nGet DV files (.dv) and the point list (text format) to move on the Zeiss Palm Microdissection system.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1916-Fig6.jpg\nFigure 6. Coordinates conversion from a DeltaVision to a Zeiss AxioObserver microscope\n(A) Manual rotation of the FrameSlide: the FrameSlide is rotated 90° clockwise from the DeltaVision to place it in the Zeiss slideholder.\n(B) Zeiss software rotation for display: Zeiss software operates a flip of the frame slide for display around the horizontal axis.",
    "(C) Linear regression to convert DeltaVision coordinates into Zeiss coordinates: The rotation and the flip result in an inversion of the x and y axes between the DeltaVision and the Zeiss. In addition, the origins of the reference frame are not the same in the two microscopes. Hence a linear regression is performed to find the mathematical relationships (linear here) that link xDV to yZeiss and yDV to xZeiss.\nCritical: Point list coordinates can be incompatible between DeltaVision and Zeiss systems. A conversion of the point lists must be performed to locate the field of interest. To perform the conversion, coordinates must be obtained from both microscopes using the same FrameSlide marked with 4 points. (The points can be simply drawn with a fine marker.) The FrameSlide is mounted on each microscope as described above (with a clockwise 90° rotation between the DeltaVision and the Zeiss (see step 1 on Figure 6[href=https://www.wicell.org#fig6]). The coordinates from both microscopes are recorded on a point list as described. The Zeiss microscope will flip the coordinates for display, according to a horizontal axe (see Figure 6[href=https://www.wicell.org#fig6], step 2). The point lists will be used to determine the coefficients of a linear regression for both x and y coordinates of each point, which can then be applied to convert a point list from the DV to the PALM Zeiss setup. With the manual rotation of the FrameSlide and the Zeiss display flip, yZeiss only depends on xDV, and xZeiss only depends on yDV (Figure 6[href=https://www.wicell.org#fig6], step3). A second round of this procedure can be repeated using cells instead of marker points in order to increase the accuracy of the conversion.",
    "The python code “DVtoZeiss.py” to compute the conversion between DV and Zeiss (Data S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1916-Mmc1.zip]) is accessible on https://github.com/jrxlab/live_cell_phenotyping_capture_proc[href=https://github.com/jrxlab/live_cell_phenotyping_capture_proc] (https://doi.org/10.5281/zenodo.6671339), with more information about the 3 steps in the Readme section.\nTo execute “DVtoZeiss.py” to obtain the coefficients of linear regression and perform a conversion of a point list (with a file with DV coordinates for the 20 fields (the function takes into account the path toward the file (path_to_dv_pts_file) and the name of the .pts file (name_dv_pts_file)) + a numpy array with the DV coordinates of the marker points (DV_init) + the numpy array of the corresponding coordinates in the Zeiss (Zeiss_init):\n>>> Import DvtoZeiss\n>>> DvtoZeiss.allConversion(Zeiss_init, DV_init, path_to_dv_pts_file, name_dv_pts_file, path_saved_zeiss_file, name_saved_zeiss_file)\nTo execute “DvtoZeiss.py” to simply perform the conversion of a point list, the function will use our marker point coordinates to compute the conversion DeltaVision to Zeiss:\n>>> Import DvtoZeiss\n>>> DvtoZeiss.allConversion(path_to_dv_pts_file, name_dv_pts_file, path_saved_zeiss_file, name_saved_zeiss_file)\nTo execute “DvtoZeiss.py” to simply perform the conversion of a point list (once you have obtained the coefficients of linear regression and created the conversion matrix A and the conversion vector B such that XZeiss=A.XDV+B):\n>>> Import DvtoZeiss\n>>> DvtoZeiss.allConversion(A,B, path_to_dv_pts_file, name_dv_pts_file, path_saved_zeiss_file, name_saved_zeiss_file)\nThe function will automatically save a .csv in the path_saved_zeiss_file folder under the name name_saved_zeiss_file, which contains the DeltaVision coordinates of each field and the converted coordinates for the Zeiss. The function also returns a pandas dataframe with the DeltaVision coordinates of each field and the converted coordinates for the Zeiss, the conversion matrix A and the conversion vector B.\nImage’s processing and cell phenotyping\nTiming: 30 min to 1 h",
    "In this section we detail the processing of images and their analysis for further capture microdissection of selected cells (predicted sensitive and predicted resistant). The main steps are to separate the images hyperstack into three different substacks (one for each channel CFP, YFP and POL). The polarized channel is only used to survey the morphology of cells during the time-lapse. The CFP and YFP channels are used to establish the CFP/YFP fluorescence intensity ratio overtime. (This CFP/YFP ratio increases in time as the IC-RP is cleaved by active caspase-8.) The ratio is tracked for each cell in the field on the entire time-lapse duration.\nNote: The following steps describe the analysis of single cell trajectories using ImageJ and publicly available plugins (https://imagej.nih.gov/ij/plugins/[href=https://imagej.nih.gov/ij/plugins/]) for most users. However, in-house plugins and other analyses routines can be used here to track single-cell ratio intensities overtime.\nThe following steps are illustrated in short tutorial (Methods videos S1[href=https://www.wicell.org#mmc4], S2[href=https://www.wicell.org#mmc5], and S3[href=https://www.wicell.org#mmc6]).\nOpen the raw image stack sequences in ImageJ software.\nIn the main menu, select Image – Stacks – Tools – Make Substack (Figure 7[href=https://www.wicell.org#fig7]A, Methods video S1[href=https://www.wicell.org#mmc4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1916-Fig7.jpg\nFigure 7. Image substack processing\nThe original stack consists of a sequence of CFP, YFP or polarized images.\n(A) Click on the “Image” menu, “Stacks”, “Tools”, then “Make Substacks”.\n(B) The substacks must be reordered into tree sub-stacks for each channel individually. The result of the process is shown in (B).\nIn the Substack Maker tool, specify the range and the increment corresponding to each channel to have three different substacks, one for CFP, YFP and polarized channels respectively (Figure 7[href=https://www.wicell.org#fig7]B).\nRepeat step 23 for each channel.\nSelect the CFP substack, draw a single ROI in a background region.",
    "Measure the pixel mean intensity (Analyze Menu and then Measure or ctrl+m) for stack 1 (CFP) (Figure 8[href=https://www.wicell.org#fig8]A, Methods video S2[href=https://www.wicell.org#mmc5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1916-Fig8.jpg\nFigure 8. Ratiometric image stack generation\n(A) To create the ratiometric image (CFP/YFP), select a region of interest in a background area. Click ctrl+M to measure the average intensity of the pixels and copy the same zone of interest to the second channel by clicking ctrl+E. Then measure the average intensity of the pixels of the background of the second channel. These parameters are important to create the ratiometric image by subtracting the background intensity.\n(B) Then open the Ratio Image plugin and enter the settings for the background.\n(C) The ratiometric image is then displayed.\nCopy the ROI to the YFP substack (Menu Edit/Selection/Restore selection or ctrl+shift+E).\nMeasure the pixel mean intensity (ctrl+m) for substack 2 (YFP).\nOpen the Ratio Plus plugin (https://imagej.nih.gov/ij/plugins/[href=https://imagej.nih.gov/ij/plugins/]) (Figure 8[href=https://www.wicell.org#fig8]B). In stack 1, select the CFP substack and the YFP substack in stack 2. Enter the background intensity value for CFP channel and 50% of the intensity value for the YFP channel obtained from steps 26 and 28. The output is a ratiometric stack in 32-bits format showing the CFP/YFP ratio for each object (cell) as a function of time (Figure 8[href=https://www.wicell.org#fig8]C).\nIn the Analyze menu, select “Set Measurement”, and check only the “Grey Mean Values” and “Display Labels” (Figure 9[href=https://www.wicell.org#fig9]A, Methods video S3[href=https://www.wicell.org#mmc6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1916-Fig9.jpg\nFigure 9. Manual tracking of all cells in a field of interest to get IC-RP trajectories\nThe principle of this section is to track manually the ratio intensities (on the ratiometric images) during the entire time lapse for all the cells in the field using ImageJ.\n(A) Click on “Set measurements” in the “Analyze” menu and select only the “Mean gray values” option.",
    "(B) In the “Analyze” menu, click on “Tools” and then on “ROI manager”. Then select a region of interest in the middle of each cell in the field. Then click on “More” and then on “Multi Measures”. Finally, activate the option “Measure all slices” and “One Row per Slice.”\nIn the Analyze menu, select Tools and ROI manager. Draw one ROI for each cell in the ratiometric stack. (The ROI should fit within the cell. The ROIs can be of different sizes.) The polarized substack is used to control the position of the ROI on each cell of interest. Select all the ROI. Check the “Show All” and “Labels boxes” and then click on “More” option and then “Multimeasures”. Click on “measure all slices” and “one row per slice” (Figure 9[href=https://www.wicell.org#fig9]B). Save the values of ratio intensities in a .csv spreadsheet for further analysis.\nNote: The position of the ROI within the cell, does not change significantly the measured trajectory.\nNote: The next steps can be performed using a Python procedure (“Plot_AllTraj_FrameSlide_Cell_Field_Label.py” (Data S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1916-Mmc1.zip]), available on https://github.com/jrxlab/live_cell_phenotyping_capture_proc[href=https://github.com/jrxlab/live_cell_phenotyping_capture_proc] (https://doi.org/10.5281/zenodo.6671339). This code creates a single label for each cell in the experiment, it ranks the cells depending on the mean time derivative values. This ranking allows to select cells of interest: the 7 Top High Responders and the 7 Bottom Low Responders that would be microdissected for downstream analysis and that can be identified on the images by their unique labels: field#.cell#.\n    Your browser does not support HTML5 video.\n  \nMethods video S1. How to split an image stack containing CFP and YFP channels timeseries using ImageJ, related to step 23\n    Your browser does not support HTML5 video.\n  \nMethods video S2. Method to obtain a ratiometric image stack (CFP/YFP timeseries) using imageJ, related to step 27\n    Your browser does not support HTML5 video.",
    "Methods video S3. Manual tracking of cells trajectories using imageJ, related to step 32\nIt takes as input a directory containing the .csv files where each file corresponds to a field in the frame slide. The file name must be field#.csv. The path to this directory is to indicate in DIR_PATH global variable.\nTo execute the code, run the Traj_Proc() function. It is the main function that calls all the other functions in the script.\n>>> def Traj_Proc () :\n      print(\"\\nRead Files ...\\n\")\n      experiment, time_vec, labels = Read_csv_files ()\n      print(\"\\nProcess Trajectories ...\\n\")\n      experiment = Process_trajectories (experiment)\n      print(\"Compute Mean Time Derivative ...\\n\")\n      mean_derivative = Compute_FRET_Derivative (experiment[\"process. Frame slide\"])\n      print(\"Sort Cells ...\\n\")\n      sorted_mean_deriv,sorted_labels = SortandSave_FRET_deriv (mean_derivative, labels)\n      print (\"Plot FRET Trajectories ...\\n\")\n      Plot_Top_Bottom_cells (experiment[\"process. Frame slide\"],time_vec, labels,sorted_labels)\n      print(\"Done\")\n      return experiment, time_vec,labels, mean_derivative\nIt returns a dictionary of the raw and the processed FRET trajectories, the time vector, the single-cell labels vector and the mean FRET time derivative vector.\nEach column corresponds to the time trajectory of one cell FRET ratio. For each trajectory, the minimal value of the FRET ratio is subtracted from the trajectory.\nFRET cleavage rate (dFRET) is approximated by the time derivative of the FRET ratio, computed using finite differences.\nCell trajectories are then ranked by decreasing dFRET. From the ∼100 cells tracked, top 7 cells (High Responders) and bottom 7 cells (Low Responders) are selected from the micro-dissection steps.\nNote: Only 8 cells will be laser captured per session in total, however it is recommended to select a total of 14 cells to anticipate possible loss of cells during the transition between microscope or during the following micro-dissection.",
    "Note: If using another cell line (different from the HeLa cells used here), the ratio of high and low responders per 100 cells may vary. In that case a live-cell experiment must be performed first to determine the dFRET threshold above which a cell is considered high responder and the dFRET threshold below which a cell is considered low responder (Meyer et al., 2020[href=https://www.wicell.org#bib5]).\nZeiss PALM setup\nTiming: 30 min\nTurn on the laser and then the microscope. Turn on the control box and finally turn on the computer.\nStart MTB2004Configuration.\nWith settings selected, click Write configuration.\nStart PALMRobo v4.2.\nStart LPM and write configuration.\nStart Robot Controller – Open PALM Robo Software and click on view default Bar config.\nApply a collar correction to adjust the working distance for a FrameSlide: check on objective lens 20×, between 0 and dot (0.17 mm).\nDefine “collector type”.\nClick on “Autoconfig” button on the camera display panel (Figure 10[href=https://www.wicell.org#fig10]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1916-Fig10.jpg\nFigure 10. Zeiss PALM setup and laser capture microdissection\nThe software used in this study is PALMRobo v4.2.\n(A) Click on “Autoconfiguration” in the “Camera” area.\n(B) The laser intensity parameters for microdissection are displayed. The micro-dissected single cells are catapulted into PCR tube caps, one cell per cap.\n(C) To avoid caps to get in contact with the cells or the support membrane, it is important to arrange the strip as shown.\n(D) For efficient cell catapulting, the caps are lowered in position.\n(E) An example of laser cut around a cell. The asterisk shows the laser-cut cell. Scale bar, 30μm.",
    "Check the laser capture setup and check RoboMover. Note the initial resting value of the Fine Adjust Z-Axis. Then adjust the Z value to determine the laser capture position: the cap must come as close to the FrameSlide’s membrane as possible without touching it. Note the Z value and return to its initial resting value.\nCritical: You may setup the Köhler illumination as shown in the Zeiss tutorial video (https://www.youtube.com/watch?v=4Wj7uFh_YLA[href=https://www.youtube.com/watch?v=4Wj7uFh_YLA]), as the focus will be crucial for the cut during the following laser capture step.\nLocate phenotyped cells and laser capture by microdissection\nTiming: 2 h\nChoose a fluorescent channel, for example FITC. (This will be used to visualize the cells of interest in the next steps.).\nChoose the Microbeam Laser.\nSet up the following parameters: cut energy to 49, LPC (Laser Pressure Catapulting) energy to 28, cut focus to 75 and LPC focus on -1 (Figure 10[href=https://www.wicell.org#fig10]B).\nNote: The parameters can be adjusted incrementally from the parameter set above, using a test FrameSlide prior to micro-dissection.\nReduce cutting speed to test the parameters of the laser.\nCritical: Check PBS every 10 min for evaporation.\nMake sure to capture 8 cells in one strip: draw a list of minimum 14 cells (7 high responders and 7 complete non-responders).\nGet the Zeiss point list set as “Dot” and save as text file to import in the Palm List.\nTake the FrameSlide PET out gently.\nTurn the FrameSlide 90 degrees clockwise Figure 2[href=https://www.wicell.org#fig2]B (Zeiss logo to the rear).\nNote: It is important to keep the change in slide orientation constant, to facilitate the conversion of the point list. The conversion of point list from the live-cell microscope will give the regions of interest to locate the selected cells for the laser-capture.\nAdd 800 μL fresh cold PBS.",
    "Locate cells of interest and hit “Freeze.”\nCircle the cell to add to the list, rename cell.\nGo the next field (region of interest containing the selected cells).\nWhen the list containing a mix of high responders vs. non-responders is done (to get ideally 4 of each class per 8-tubes strip):\nPipet 4.3 μL of cell lysis buffer in each tube from a PCR strip tubes. This buffer must be prepared extemporaneously.\nHighlight cell #1.\nRemove medium with p1000 Pipet.\nPlace the cap, lower the cap (cap handler set Z-Axis to the cutting position noted in step 44).\nAdjust the focus using the phase-contrast.\nCritical: Make sure cap strip is in position as shown in Figure 10[href=https://www.wicell.org#fig10]C, and that it is lowered to the slide as shown in Figure 10[href=https://www.wicell.org#fig10]D.\nTurn on FITC (or another available fluorescent channel) to visualize the cells during the cut.\nHit laser cut (Figure 10[href=https://www.wicell.org#fig10]E).\nPut cap in higher position (cap handler) and move the cap strip.\nMove to next cell.\nNote: Cells are captured into PCR tube caps containing 4.3 μL capture lysis buffer.\nWhen 8 cells (8 caps) are captured, the caps are placed on empty labeled tubes.\nSpin tubes immediately.\nPlace tubes on dry ice.\nNote: Tubes are kept on ice and frozen in dry ice directly after collection to minimize RNA degradation during sample collection and transport.\nPause point: The cell lysates that have been snap-frozen in dry ice on the last above, can be stored in a freezer at −80°C for up to 1 month.\nLaser-captured single-cell sequencing\nTiming: 2 h for step 58\nTiming: 3 h for steps 59 and 60",
    "This section focuses on the generation of retrotranscribed cDNA samples and sequencing libraries prior to RNAseq. Technically, any single-cell RNA sequencing strategy suited to isolated cells (in tubes) can be applied here. In the following paragraph, we described the original strategy that was used in Meyer M., Paquet A. et al. (Meyer et al., 2020[href=https://www.wicell.org#bib5]). The cell lysates were used to perform retrotranscription in 0.2 mL PCR tubes with an RT mix containing ERCC (External RNA Controls Consortium) spike-ins, primers that introduce a priming site (Rev), a unique molecular identifier (UMI) sequence, a cell barcode sequence (BC) and an Illumina Index Read (IIR). After amplification, the 3′biotinylated full-length cDNA were tagmented with the EZ-Tn5 transposase. The 3′terminal fragments were then isolated on streptavidin beads. The P5 and P7 sequences required for Illumina sequencing were added by traditional PCR (see schematic in Figure 11[href=https://www.wicell.org#fig11]). Primers sequences are provided in Tables 1[href=https://www.wicell.org#tbl1] and 2[href=https://www.wicell.org#tbl2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1916-Fig11.jpg\nFigure 11. Preparation of isolated single-cell library for RNA sequencing",
    "Laser captured single cells with predicted cell response were collected and lysed in domed caps of 0.2 mL PCR tubes and stored frozen. The lysed cells were spun into PCR tubes with an RT mix, ERCC spike-ins, and reverse transcribed with an RT primer that contained a priming site for amplification (Rev), a random sequence for RNA molecule identification (unique molecular identifier, UMI), a cell barcode (BC) and an Illumina Index Read (IIR). (The template switching oligonucleotide (TSO) adds a second PCR priming site during RT.) After PCR amplification the 3′ biotinylated (∗) full-length cDNA was fragmented by tagmentation with EZ-Tn5 transposase (end-joined with mosaic end adaptors, ME) and the 3′ terminal fragments were isolated on Streptavidin beads. Sequences required for Illumina sequencing (P5, P7) were introduced by PCR prior to sequencing. See methods section for details, primer sequences in Tables 1[href=https://www.wicell.org#tbl1] and 2[href=https://www.wicell.org#tbl2]. Figure from Meyer et al. ((Meyer et al., 2020[href=https://www.wicell.org#bib5]), Figure S2).\ntable:files/protocols_protocol_1916_6.csv\ntable:files/protocols_protocol_1916_7.csv\ncDNA preparation.\nPrepare 0.2 mL PCR tubes with the following pre-mix. Thaw the reagents on ice. Add 2.43 μL of a pre-mix containing 10,000 molecules Life Technology ERCC-spike-In Mix, 2.5 mM dNTPs and 3.7 μM single barcoded reverse transcription primer. Pre-mix containing stripes can be stored at −80°C until sample microdissection.\nAdd only one cell in each tube containing this pre-mix by microdissection and brief centrifugation. Single-cell in pre-mix containing stripes can be stored at −80°C or be send in dry ice until further RT reaction.\nAdd 8.27 μL 1.8× reverse transcription buffer (Invitrogen), 4.53 mM DTT, 1.8 M Betaïne, 10.8 mM MgCl2, 3.62 μM template switching oligonucleotide, 0.6 U/μL Promega RNAse IN Plus, 7.5 U/μL Invitrogen SuperScript II reverse transcriptase.",
    "Reverse transcribes each tube in thermocycler 10 min at 25°C, 90 min at 42°C, 15 min at 70°C and kept at 10°C until PCR amplification.\nAmplify samples by PCR with KAPA HiFi Hotstart ready Mix for 20 cycles with 0.8 μM forward PCR primer, 0.8 μM biotinylated reverse PCR primer.\nIncubate samples 3 min at 98°C followed by 20 cycles at 98°C for 20 s, 64°C for 15 s, 72°C for 6 min followed by a final extension for 5 min at 72°C.\nPool the samples and purified with 0.8× Beckman Coulter SPRIselect beads to remove primers and small DNA fragments.\nPlace on the magnet until the solution clears, remove the supernatant and wash with 200 μL of 85% EtOH (freshly prepared), quick spin 5 s, put back on the magnet and remove any remaining EtOH by pipetting, dry 2 min at RT, and take off the magnet.\nElute in 30 μL nuclease free water by pipetting up and down 15 times and leave 2 min at RT. Put the tube back on the magnet.\nWhen the solution clears, aspirate the supernatant, and save it for the next step at RT if used immediately. If not, the supernatant (cDNA) can be saved at 4°C for 72 h or at −20°C for up to 4 weeks.\nNote: Do not dry the pellet more than 2 min to avoid over drying. If that is the case, the resuspension can be difficult to achieve.\nLibrary preparation.",
    "Batch of barcoded pools of cDNAs (typically between 10–20 ng of cDNA) can be purified one more time to concentrate final amount: group all pools in the same tube to a final volume of 100 μL completed with nuclease-free water, purify a second time with SPRIselect beads (0.8×), as performed above in steps 57g to 57j, and elute in 12 μL nuclease free water.\nPerform a quality and quantity control with a BioAnalyzer High Sensitivity DNA kit (ref 5067-4626, Agilent) on 1 μL of purified pooled cDNA. The cDNAs should be distributed between 200 bp to 9000 bp with a most at around 1500 bp as shown in Figure 12[href=https://www.wicell.org#fig12]A.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1916-Fig12.jpg\nFigure 12. Representative BioAnalyzer cDNA profile\n(A) Electropherogram view of 1 μL of cDNA sample run on an Agilent BioAnalyzer High Sensitivity DNA Chip. A region comprised between 200 bp and 9000 bp is represented by blue lines on x-axis. This frame indicates cDNA accurate concentration in the corresponding bioanalyzer region table.\n(B) Electropherogram view of 1 μL of final library on an Agilent BioAnalyzer High Sensitivity DNA chip. The region comprised between 200 bp and 550 bp (blue lines on x-axis) is used for library quantification in the Bioanalyzer corresponding region table. Minor peaks below 200 bp may be observed and correspond to adapter dimer peaks. If peak below 200 bp is more prominent, add nuclease-free water to a final volume of 100 μL and repeat SPRI-Select purification a second time (step 59l) and then repeat Bioanalyzer quantification.\nSee troubleshooting problem 4[href=https://www.wicell.org#sec7.7].\nAt room temperature, pipet 9 μL (typically 10–20 ng of cDNA) and add 4 μL TAPS buffer (50 mM TAPS-NaOH, pH8.5, 25 mM MgCl2), 2 μL dimethylformamide and 5 μL of transposon.",
    "Incubate at 55°C for 7 min (as suggested by the manufacturer for cDNA longer than 2500 bp) and cool the samples to 10°C for 5 min.\nAdd 4 μL of 0.1% SDS and incubate 10 min at 65°C to detach the transposase.\nCool samples to 4°C.\nAlternatives: A commercial tagmentation kit (Illumina) can be used for library preparation.\nTagmentation can alternatively be done with reagents from the commercial Nextera®XT Sample Prep Kit (ref 15032350, Illumina).\nNote: Tagmentation is the initial step in library prep where unfragmented cDNA is cleaved and tagged for analysis.\nPipet 24 μL Dynabeads® MyOne™ Streptavidin C1 beads (Ref 65001, Invitrogen) in a 1.5 mL Eppendorf tube.\nPrepare Dynabeads® MyOne™ Streptavidin C1 beads according to the manufacturer’s instructions.\nResuspend beads in 10.5 μL nuclease free water to capture the biotinylated 3′terminal fragments in the following steps.\nAmplify 5′ terminal fragments in 25 μL with KAPA HiFi HotStart Ready Mix and 0.5 μM reverse library primer, 0.5 μM forward library primers and 0.125 μM extended forward primers.\nProceed to a gap filling step by incubating at 75°C for 3 min followed by 98°C for 30 s, 15 cycles of 98°C for 10 s, 55°C for 30 s, and 72°C for 30 s and 72°C for 2 min.\nFill the volume of Illumina library obtained to 100 μL, add 90 μL SPRIselect beads for size selection of fragments > 200 bp. Pipet mix 15 times with pipet at 180 μL, incubate 5 min at RT.\nPlace on the magnet. Remove the supernatant.\nWash beads with 200 μL 85% EtOH. Place on the magnet and remove the residual EtOH by pipetting.\nDry 2 min at RT.",
    "Elute the library by pipetting 15 times with 10 μL nuclease free water. Leave the solution 2 min at RT (off the magnet), then put back on the magnet until the solution clears, and pipet out the supernatant (Library).\nPerform a quality and quantity control with a BioAnalyzer High Sensitivity DNA kit (ref 5067-4626, Agilent) on 1 μL of purified libraries. The final library should be distributed between 200 bp to 550 bp with a most at around 350 bp as shown in Figure 12[href=https://www.wicell.org#fig12]B. See troubleshooting problem 5[href=https://www.wicell.org#sec7.9].\nSequencing: Libraries were sequenced with a NextSeq500/550 High Output V2 kit (75 cycles) that allows up to 91 cycles with an index1 read of 20 nucleotides (8 bp cell barcode and 12 bp Unique Molecular Identifier, UMI; Table 1[href=https://www.wicell.org#tbl1]) and a read1 of 71 nucleotides for cDNA sequencing with custom sequencing primers (Table 2[href=https://www.wicell.org#tbl2]).\nBioinformatics analysis\ncDNA alignment: after Fastq file production using Illumina bcl2fastq software, the first step is to align the read1 against human build reference using a splice-aware aligner. In the following example, cDNA reads mapping was performed using STAR (Dobin et al., 2013[href=https://www.wicell.org#bib2]) against human hg19 following Encode RNA-seq recommendations. We obtain a BAM file composed of SAM records describing how/where cDNA reads aligned to the reference genome.\nNote: Encode RNA-seq recommandations (https://www.encodeproject.org/documents/cede0cbe-d324-4ce7-ace4-f0c3eddf5972/@@download/attachment/ENCODE%20Best%20Practices%20for%20RNA_v2.pdf[href=https://www.encodeproject.org/documents/cede0cbe-d324-4ce7-ace4-f0c3eddf5972/@@download/attachment/ENCODE%20Best%20Practices%20for%20RNA_v2.pdf].).\nCell barcodes and UMI processing: TagBamWithReadSequenceExtended pipeline from Drop-seq toolkit (Macosko et al., 2015[href=https://www.wicell.org#bib4]) was then used to tag the SAM records with the cell barcode of the cell from which the cDNA originated (named “XC”) and the UMI (named “XM”) extracted from index1 reads (cell barcode: 1–8 nt, UMI: 9–20 nt).\nNote: Drop-seq toolkit (Macosko et al., 2015[href=https://www.wicell.org#bib4]) is accessible at https://github.com/broadinstitute/Drop-seq[href=https://github.com/broadinstitute/Drop-seq].\nNote: The BAM file of our example fate-seq are accessible at GEO accession number GSE138832 (https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE138832[href=https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE138832]).",
    "Digital Gene Expression count matrix production: TagReadWithGeneExon pipeline from Dropseq.jar toolkit is then used to tag SAM records of cDNAs falling inside gene locus with a gene name tag (GE in our example). Then DigitalExpression pipeline using edit distance of 1 is used for production of sc-RNAseq count table (counts of UMI).\nNote: The sc-RNAseq count table (Digital Gene Expression count matrix) of our example is also accessible at GEO accession number GSE138832 (link in step 61 and the second Note).\nSingle-cell data analysis\nFor the single-cell data analysis, the cell response phenotypes and the scRNAseq count table will be required.\nThe cell response phenotypes are the ones that were obtained previously from the live-cell experiments (high and low responders from step 35).\nThe count table is generated from the bioinformatics analysis above.\nStandard single cell data analysis workflows can be used, such as workflows based on R packages Seurat, scran or edgeR. As an example, the single-cell data analyses performed for the fate-seq of the HeLa cells described in this protocol treated with TRAIL, are available here: https://github.com/jrxlab/fate-seq_proc[href=https://github.com/jrxlab/fate-seq_proc], and the expected results are shown in Figure 13[href=https://www.wicell.org#fig13].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1916-Fig13.jpg\nFigure 13. Bioinformatics analyses producing a drug-efficacy gene set from fate-seq data\nThe cell response (Phenotype) obtained from live-cell imaging is used to define high and low responder cells in a differential analysis of the matched single-cell RNAseq data, to find marker genes of drug resistance. Here, we have represented the results of such an analysis based on the data from (Meyer et al., 2020[href=https://www.wicell.org#bib5]), where candidate differentially expressed genes are defined as genes with FDR < 0.1.\n(A) Heatmap of gene expression data for genes with FDR < 0.1, with High/Low Responder phenotype labels displayed in the color bar at the top.",
    "(B) MA-plot: x-axis represents the average gene expression level for each gene on log2 scale; y-axis represents the difference in gene expression levels between high versus low responders (cell phenotypes) on log2 scale. Red triangles represent the differentially expressed genes with FDR < 0.1.\n(C) Volcano-plot: x-axis represents the difference in gene expression levels between high versus low responders (cell phenotypes) on log2 scale; y-axis represents the FDR (- log10 FDR). Red triangles represent the differentially expressed genes with FDR < 0.1."
  ],
  "subjectAreas": [
    "Systems Biology",
    "Cell Isolation",
    "Microscopy",
    "Cell-Based Assays",
    "Single Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}