{
  "id": 16688,
  "origin_website": "Jove",
  "title": "Cell Fractionation of U937 Cells by Isopycnic Density Gradient Purification",
  "procedures": [
    "1. Prepare buffers and reagents\nPrepare fresh solutions of phosphatase and protease inhibitors.\n\t\nAdd 17.4 mg of phenylmethanesulfonyl fluoride (PMSF)to 1 mL of 100% ethanol to prepare a 100 mM stock.\n\t\t​NOTE: Wear protective equipment when handling PMSF as it is hazardous when ingested or inhaled and upon contact with skin or eyes. It is corrosive to eyes and skin.\nAccording to the manufacturer's instructions, prepare a commercially available protease inhibitor cocktail (100x).\nAdd 91.9 mg of sodium orthovanadate (SOV) to 1 mL of deionized water to prepare a 500 mM stock.\n\t\tNOTE: Wear protective equipment when handling SOV as it is hazardous if ingested, inhaled, or upon contact with eyes. Severe overexposure may result in death.\nPrepare lysis buffer A, cytoplasmic isolation (CI) buffer, cell solubilization (CS) buffer, nuclear lysis (NL) buffer, lysis buffer B, cell homogenization (CH) buffer, iodixanol diluent, and detergents.\n\t\nAdd 8.7 g of sodium chloride (NaCl) and 50 mL of 4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid (HEPES, 1 M, pH 7.4) to 950 mL of deionized water to prepare lysis buffer A (final concentrations of 150 mM NaCl and 50 mM HEPES).\nPrepare stock solutions of detergents as follows: add 0.1 g of sodium dodecyl sulfate (SDS) to 10 mL of lysis buffer A (final concentration of 1% SDS), add 0.1 g of sodium deoxycholate to 10 mL of lysis buffer A (final concentration of 1%), add 2.5 mg of digitonin to 10 mL of lysis buffer A (final concentration of 250 µg/mL), and add 1 mL of non-ionic, non-denaturing detergent (see the Table of Materials) to 9 mL of lysis buffer A (final concentration of 10% (v/v)).",
    "Prepare CI buffer by adding 10 µL of PMSF stock (100 mM), 10 µL of protease inhibitor (100x), 2 µL of SOV stock (500 mM), and 100 µL of stock digitonin (250 µg/mL) to 878 µL of lysis buffer A (final concentrations of 1 mM PMSF, 1x protease inhibitor, 1 mM SOV, and 25 µg/mL digitonin). Keep the solution on ice until addition to cell pellet.\nPrepare CS buffer by adding 10 µL of PMSF stock (100 mM), 10 µL of protease inhibitor (100x), 2 µL of SOV stock (500 mM), 100 µL of non-ionic, non-denaturing detergent stock (see the Table of Materials) (10%), and 118 µL of hexylene glycol stock (8.44 M) to 760 µL of lysis buffer A (final concentrations of 1 mM PMSF, 1x protease inhibitor, 1 mM SOV, 1% non-ionic, non-denaturing detergent, and 1 M hexylene glycol). Keep the solution on ice until addition to cell pellet.\nPrepare NL buffer by adding 10 µL of PMSF stock (100 mM), 10 µL of protease inhibitor (100x), 2 µL of SOV stock (500 mM), 50 µL of sodium deoxycholate stock (10%), 100 µL of SDS stock (1%), and 118 µL of hexylene glycol stock (8.44 M) to 710 µL of lysis buffer A (final concentrations of 1 mM PMSF, 1x protease inhibitor, 1 mM SOV, 0.5% sodium deoxycholate (v/v), 0.1% SDS (w/v), and 1 M hexylene glycol). Keep the solution on ice until addition to nuclear pellet.",
    "Add 20 mL of HEPES (1 M, pH 7.4), 0.74 g of potassium chloride (KCl), 0.19 g of magnesium chloride (MgCl2), 2 mL of ethylenediaminetetraacetic acid (0.5 M EDTA), 2 mL of ethylene glycol-bis(β-aminoethyl ether)-N,N,N',N'-tetraacetic acid (0.5 M EGTA), 38.3 g of mannitol, and 23.9 g of sucrose to 980 mL of deionized water to prepare lysis buffer B (final concentrations of 20 mM HEPES, 10 mM KCl, 2 mM MgCl2, 1 mM EDTA, 1 mM EGTA, 210 mM mannitol, and 70 mM sucrose).\nPrepare CH buffer by adding 10 µL of PMSF stock (100 mM) and 2 µL of SOV stock (500 mM) to 988 µL of lysis buffer B (final concentrations of 1 mM PMSF and 1 mM SOV; adjust the final volume to accommodate the number of cells being lysed). Keep the solution on ice until addition to cell pellet.\nPrepare iodixanol diluent by addition of 12 mL of HEPES (1 M, pH 7.4), 447 mg of KCl, 114 g of MgCl2, 1.2 mL of 0.5 M EDTA, 1.2 mL of 0.5 M EGTA, 21.3 g of mannitol, and 14.4 g of sucrose to 88 mL of deionized water (final concentrations of 120 mM HEPES, 60 mM KCl, 12 mM MgCl2, 6 mM EDTA, 6 mM EGTA, 1200 mM mannitol, and 420 mM sucrose).\nStore buffers at 4 °C and digitonin at -20 °C.\n2. Cytosolic protein isolation\nNOTE: The following steps will allow for the growth and expansion of U937 cells followed by extraction of cytosolic proteins. At the concentration used, digitonin will permeabilize the plasma membrane without disrupting it, allowing for the release of cytosolic proteins and retention of other cellular proteins.",
    "Culture the cells in RPMI 1640 with 10% fetal bovine serum at 37 °C and 5% CO2. Ensure that the cells are grown to a final total of 6 x 108 cells.\n\tNOTE: In this protocol, cells were counted using a standard hemocytometer and microscope.\nCentrifuge the cultured cells at 400 × g for 10 min. After discarding the supernatant, resuspend the cell pellet in room temperature phosphate-buffered saline (PBS) at a final concentration of 4 × 106 cells/mL, and pipette gently to break up clumps.\nCentrifuge the cell suspension at 400 × g for 10 min to pellet the cells. Discard the supernatant, and resuspend the cell pellet in ice-cold lysis buffer A (prepared in step 1.2.1) at a final concentration of 2 × 107 cells/mL.\nRemove 7.5 mL of the cells suspended in lysis buffer A (3 × 107 cells), and keep on ice for nuclear protein extraction (section 6). Centrifuge the cell suspension at 4 °C, 400 × g for 10 min to pellet the cells.\n\tNOTE: Perform all subsequent steps at 4 °C or on ice, and prechill all buffers.\nDiscard the supernatant, resuspend the cell pellet in CI buffer at a final concentration of 2 × 107 cells/mL, and pipette gently to break up clumps. Rotate the cell suspension end-over-end at 4 °C for 20 min.\nCentrifuge the cell suspension at 4 °C, 400 × g for 10 min, and transfer the supernatant to a clean centrifuge tube. Save the cell pellet, and store on ice. Centrifuge the collected supernatant at 4 °C, 18,000 × g for 20 min to pellet cellular debris.\n\tNOTE: This high-speed centrifugation step is critical for preventing contamination of the cytosolic fraction with organelle and membrane-bound proteins.",
    "Discard the pellet after transferring the supernatant to a clean centrifuge tube. Repeat both centrifugation steps in step 2.6 until no pellet is obtained following centrifugation.\nCollect the supernatant, which is the cytosolic fraction. For short-term storage (1 month), ensure that the supernatant is stored at 4 °C. For long-term storage (>1 month), combine the supernatant with 1x Laemmli buffer containing 1x reducing agent, heat at 95 °C for 7 min, and store at -20 or -80°C.\nResuspend the cell pellet (from step 2.6) in lysis buffer A at a final concentration of 4 × 106 cells/mL; pipette gently to break up clumps.\n3. Cell homogenization\nNOTE: The following steps will allow for the mechanical homogenization of digitonin-treated cells (from step 2.9), which is necessary for the isolation of the mitochondrial and membrane protein fractions.\nCentrifuge the cell suspension in lysis buffer A (prepared in step 2.9), save the pellet, and discard the supernatant to remove excess digitonin and cytosolic contaminants from the cell pellet.\n\tNOTE: Repeated washes in lysis buffer A may be performed to remove excess cytosolic contaminants.\nResuspend the cell pellet in ice-cold CH buffer (prepared in step 1.2.7) at a final concentration of 4 × 106 cells/mL. Incubate the cell suspension on ice for 30 min.\nIf using a bead-based method for mechanical lysis, place 30 g of prewashed stainless steel 3.2 mm beads into a 50 mL skirted tube, fill with 15 mL of lysis buffer B, and place on ice to chill. If using a Dounce homogenizer (with a tight-fitting B pestle), fill with an appropriate volume of lysis buffer B, insert the pestle, and place on ice to chill.",
    "Following incubation (step 3.2), discard lysis buffer B from the bead tubes (or Dounce homogenizer), and transfer 15 mL of the cell suspension to the bead tube (or an appropriate volume to the homogenizer).\nIf using the bead-based method, place the skirted bead tubes containing the cell suspension in the blender device, and configure to run for 5 min at speed 8. If using a Dounce homogenizer, keep it on ice, and perform 40 passes with the pestle using slow, even strokes (or utilize an alternative method of mechanical cell lysis as detailed in the discussion section).\n\tNOTE: If using a blender device different from the one used here, speed and time may need to be determined empirically.\nTransfer the homogenate to a clean centrifuge tube, and centrifuge it at 400 × g for 10 min at 4 °C. Transfer the supernatant to a clean centrifuge tube and save; discard the pellet.\n\t​NOTE: The protocol may be paused here and the homogenate stored at 4 °C for the short term (24 h).\n4. Debris removal and isolation of crude mitochondrial and membrane fractions\nNOTE: The following steps will allow for the removal of cellular debris by centrifuging the homogenate at increasing speeds. This is followed by differential centrifugation for the isolation of crude mitochondrial and membrane fractions.\nCentrifuge the homogenate (from step 3.6) at 500 × g for 10 min at 4 °C. Transfer the supernatant to a clean centrifuge tube, and discard any pellet.\nCentrifuge the supernatant (from step 4.1) at 1,000 × g for 10 min at 4 °C. Transfer the supernatant to a clean centrifuge tube, and discard any pellet.",
    "Centrifuge the supernatant (from step 4.2) at 2,000 × g for 10 min at 4 °C. Transfer the supernatant to a clean centrifuge tube, and discard any pellet.\nCentrifuge the supernatant (from step 4.3) at 4,000 × g for 20 min at 4 °C. Transfer the supernatant to a clean centrifuge tube, and save the pellet, which is the crude mitochondrial fraction.\nCentrifuge the supernatant (from step 4.4) at 18,000 × g for 1 h at 4 °C. Discard the supernatant, and save the pellet, which is the crude membrane fraction.\n\t​NOTE: The protocol may be paused here, and the pelleted samples stored at 4 °C for the short-term (24 h).\n5. Isopycnic density gradient purification\nNOTE: The following steps utilize isopycnic density gradient centrifugation to purify the crude mitochondrial and membrane fractions.\nPrepare a 50% (v/v) working solution of iodixanol by mixing 1 part diluent (prepared in step 1.1.3) to 5 parts iodixanol (60% stock solution (w/v)). Prepare 10%, 15%, 20%, 25%, 30%, and 35% iodixanol solutions (v/v) by mixing 50% working solution (v/v) with lysis buffer B in appropriate quantities.\nResuspend the crude mitochondrial and membrane pellets (from steps 4.4 and 4.5) each in 200 µL of lysis buffer B. Adjust to 45% iodixanol (v/v) by adding 1800 µL of working iodixanol solution (50% (v/v)) to 200 µL of the resuspended pellet.\nCreate an iodixanol discontinuous gradient as follows (adjust the volumes as appropriate for the capacity of the ultracentrifuge tube): Add 1 mL of 15% iodixanol (v/v) to the bottom of an 8 mL, open-top, thin-walled ultracentrifuge tube, place 1 mL of 20% iodixanol (v/v) below the first layer (by the underlaying technique), followed by underlaying 1 mL of 25%, 1 mL of 30%, and 1 mL of 35% iodixanol (v/v).",
    "NOTE: There should be 2 gradients created at this step, 1 for the mitochondrial fraction and 1 for the membrane fraction.\nIn 1 gradient, add the 2 mL of the crude mitochondrial pellet (suspended in 45% iodixanol (v/v)) using the underlay technique to the bottom of the tube below the 35% iodixanol (v/v). In the other gradient, add the 2 mL of the crude membrane pellet (suspended in 45% iodixanol (v/v)) using the underlay technique to the bottom of the tube below the 35% iodixanol (v/v).\nAdd 1 mL of 10% iodixanol (v/v) to the top of each gradient tube by overlaying it on top of the 15% layer. Balance the tubes within 0.1 g of each other by the addition of 10% iodixanol (v/v).\nSpin the density gradient tubes at 4 °C for 18 h at 100,000 × g. Be sure to set acceleration and deceleration to the minimum values for the ultracentrifuge being used.\n\tNOTE: In the mitochondrial gradient, there will be a visible band at the interface between 25% and 30% iodixanol (v/v). This is the pure mitochondrial fraction. In the membrane gradient, there will be a visible band in the 15% iodixanol (v/v) fraction. This is the pure membrane fraction. There may be additional bands in the 25% and 30% iodixanol (v/v) fractions in the membrane gradient. This is mitochondrial contamination.\nCollect fractions from the top of the tube in 1 mL aliquots, being careful to minimize the volume of the fraction containing the visible bands and changing the pipette tip after each layer is collected. Alternatively, puncture the side of the thin-walled tube with a needle, and collect the visible bands.\nStore the samples as described in step 2.8 until verification by protein assay and western blot.\n6. Nuclear protein isolation",
    "NOTE: Using ionic and non-ionic detergents as well as techniques such as sonication and centrifugation, the following steps will solubilize all cellular membranes and allow for the isolation of nuclear proteins.\nCentrifuge the 7.5 mL aliquot of cells suspended in lysis buffer A (from step 2.4), and discard the supernatant. Add 800 µL of ice-cold CS buffer (prepared in step 1.2.4), and resuspend the pellet by pipetting and vortexing. Incubate the samples on ice (or at 4 °C) for 30 min to disrupt the plasma and organelle membranes while protecting the nuclear proteins.\nCentrifuge the cell suspension at 7,000 × g for 10 min at 4 °C, and discard the supernatant. Add 800 µL of ice-cold NL buffer (prepared in step 1.2.5) to the nuclear pellet after inclusion of 1U/µL benzonase. Resuspend the pellet by gently pipetting. Incubate on an end-over-end rotator for 30 min at 4 °C to disrupt the nuclear membrane.\nSonicate for 5 s at 20% power with sample tubes cooled in an ice bath (3x, with 5 s pauses in between pulses), which along with benzonase (added in step 6.2), will shear the nucleic acids.\nCentrifuge the sonicate at 7,800 × g for 10 min at 4 °C. Collect and save the supernatant, which is the nuclear fraction. Be sure to not disturb the insoluble pellet while collecting the supernatant. For storage, samples can be prepared as described in step 2.8.\n7. Protein quantification and western blot analysis\nNOTE: The following steps will quantify total protein in each fraction and confirm the purity of the subcellular fractions.\nPerform a standard Bradford assay to quantify total protein in each fraction. Refer to Table 1 for expected protein yields.",
    "NOTE: Other protein assays such as bicinchoninic acid (BCA) assay or absorbance at 280 nm may be used to measure total protein in place of a Bradford assay.\nCombine fractions with 1x Laemmli buffer containing 1x reducing agent, and heat at 95 °C for 7 min. Load 10 µg of each fraction into a standard SDS-polyacrylamide gel electrophoresis (PAGE) gel, and run the gel at 20 mA for 1 h.\nTransfer the resolved proteins to a polyvinyldifluoride (PVDF) membrane by performing a standard immunoblot transfer at 100 V for 30 min. Block the PVDF membrane with 5% milk in 1x Tris-buffered saline (TBS) containing 0.1% of a non-ionic detergent (v/v) for 30 min at room temperature.\nAdd the appropriate primary antibodies to detect housekeeping proteins specific to each subcellular fraction, and incubate overnight at 4 °C. Wash the membrane with 5% milk in 1x TBS containing 0.1% of the non-ionic detergent (v/v) for 10 min at room temperature.\n\tNOTE: For this protocol, antibodies against glyceraldehyde-3-phosphate dehydrogenase (GAPDH, 1:10000), histone H3 (1:2000), voltage-dependent anion channel (VDAC, 1:1000), and Na,K+-ATPase were used for cytosolic, nuclear, mitochondrial, and membrane fractions, respectively.\nAdd the appropriate horseradish peroxidase (HRP)-conjugated secondary antibodies to the membrane (dilute according to the manufacturer's instructions), and incubate at room temperature for 1 h. Wash the membrane with 5% milk in 1x TBS containing 0.1% of the non-ionic detergent (v/v) for 10 min at room temperature. Develop the blot using standard chemiluminescence.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}