{
  "id": 13224,
  "origin_website": "Jove",
  "title": "Generation of Mosaic Mammary Organoids by Differential Trypsinization",
  "procedures": [
    "All methods described here have been approved by the Institutional Animal Care and Use Committee (IACUC) of the University of California, Santa Cruz.\n1. Day 1: Mammary gland digestion\nPrepare to harvest the MGs from mature female mice 10-14 weeks of age.\n\t\nPerform the harvesting on an open bench under aseptic conditions.\nSterilize all surgical supplies, cork boards, and pins by autoclaving and soaking in 70% alcohol for 20 min prior to surgery.\nAnesthetize animals with sodium pentobarbital (2X anesthetic dose of 0.06 mg/g body weight) delivered via intraperitoneal injection with a 0.5 mL insulin syringe.\nMonitor the level of anesthesia by pinching the animal's toes to check for a reflex response and commence the protocol only after the animal is fully anesthetized.\nPlace the animal on its back, pin its appendages to the corkboard, and wipe down its abdomen and chest with ethanol.\nTo harvest the #2, 3, 4, and 5 MGs from one mouse (i.e., 8 MGs, Figure 1A), identify the midline between the two hind legs and make a small incision (1 cm) on the abdominal skin with sharp scissors, then extend the cut up to the neck18.\nFollow by making small cuts laterally towards the legs and arms to allow for the release of the skin using a cotton swab. Pull the skin away and stretch it tight before pinning it down on one side (Figure 1B, step 1)18. Remove the MGs by cutting under them, and remove the lymph nodes from the #4 glands (Figure 1B, steps 2, 3)18. Repeat the procedure on the other side of the body.\nCollect the MG tissue in 50 mL of 4 °C Dulbecco's Modified Eagle's Media (DMEM)/Nutrient Mixture F12 (F12) supplemented with 5% fetal bovine serum (FBS) and 1X Antibiotic-Antimycotic (Anti-Anti)18.",
    "Chop the glands in a 35 mm dish or on a ceramic plate using a razor blade or tissue chopper. Rotate the plate every five manual chops or every round on the tissue chopper until the tissue pieces can fit through a 1 mL micropipette tip with ease (~0.1 mm/fragment, Figure 1C).\nDigest the MGs in Digestion Medium (see Table 1) for 14 h in a 6 well low adhesion dish at 37 °C, 5% CO2.\n2. Day 2: Isolation of mammary epithelial tissue fragments\nAfter 14 h of digestion, gently mix by pipetting the digested tissue 10X using a 1 mL micropipette to break down any remaining stroma or adipose tissue, ensuring that neither bubbles nor excess mechanical force are generated.\n\tNOTE: If there is incomplete digestion after 14 h, this could be due to the accumulation of sheared DNA. In this case, add 1 µL of 1 mg/mL deoxyribonuclease I (DNase I) per 2 mL of Digestion Medium. Incubate for another 30 min at 37 °C, 5% CO2.\nCollect tissue in a 15 mL tube and rinse the well used for digestion with 2-3 mL of tissue culture grade 1X Dulbecco's Phosphate Buffered Saline (DPBS) free of Ca2+ and Mg2+. Centrifuge at 600 x g for 10 min.\nEvacuate the supernatant containing the lipid layer and medium, and then resuspend the pellet in 5 mL of DPBS and switch to a new 15 mL tube. Centrifuge at 600 x g for 10 min.\nDuring centrifugation place a 70 µm nylon cell strainer in a 50 mL tube and prewet the strainer using 10 mL of 37 °C DMEM/F12.",
    "Resuspend tissue fragments from protocol step 2.4 using 5 mL of DPBS and pass the suspension through a prewet 70 µm nylon cell strainer to remove stromal cells and single cells (Figure 1D).\nCollect the tissue fragments on the cell strainer. Rinse 4X with 10 mL of 37 °C DMEM/F12 (Figure 1D).\n\tCAUTION: Incomplete rinsing will result in cultures contaminated with non-epithelial cells.\nRelease the tissue fragments by holding the strainer tab with gloved fingers, inverting the strainer over a 60 mm tissue culture dish and passing 1 mL aliquots of Maintenance Medium (see Table 1) through the bottom of the strainer 4X (Figure 1E).\nCheck the strainer for tissue fragment remnants, which will be visible by the naked eye, and rinse the strainer 1X more with 1 mL of Maintenance Medium if any fragments are still adhering to the strainer. The rinsed tissue fragments should now be free of stromal cells.\nQuickly examine the 60 mm dish containing the MG fragments from protocol step 2.9 under an inverted microscope (4X or 10X objective, Figure 1F). A typical preparation of eight MGs yields ~500 fragments. Look for single cells or fat droplets and whether there are contaminating cells.\n\tNOTE: If there are contaminating cells, repeat the filtration step by collecting the medium and fragments from the 60 mm dish using a 5 mL pipette and filtering the fragment again through a fresh 70 µm strainer, repeating protocol steps 2.6, 2.8-2.10.\nIncubate 24 h at 37 °C, 5% CO2, allowing the tissue fragment to adhere and generate bilayered fragments (Figure 2A).",
    "NOTE:If the fragments have not settled by 24 h, continue to incubate until adhered. If the fragments do not adhere well, the separation of the cell compartments will not work. If researchers are concerned about adhesion, the tissue culture plates can be treated to promote fragment attachment (e.g., poly-L-lysine).\n3. Day 3: Differential trypsinization of myoepithelial and luminal epithelial cells\nTo separate MyoECs from LECs, empty the media from the dish, rinse 1x with 1 mL of DPBS and add 1 mL of fresh trypsin-EDTA (0.05%), and carefully monitor the digestion under an inverted microscope (10X or 20X objective, Figure 2B,C,F). The detachment of the outer MyoEC layer will require 3-6 min, depending on trypsin-EDTA (0.05%) strength.\n\tNOTE: Please see Figure 2 for representative images showing this process. Under brightfield illumination, the MyoECs appear rounded and have a brighter appearance in comparison to the LECs, which remain adhered in the center and appear darker.\nCollect the MyoEC fraction in a 15 mL tube containing 2 mL 10% FBS/DPBS. Without disturbing the LECs, gently rinse the 60 mm dish with 2 mL of DPBS and then dispose of the DPBS (Figure 2H-I).\n\tNOTE: The usual recovery for MyoECs is within a range of (3.5 x 106-1.5 x 106) depending on the size of the MGs.\nTo remove the LEC fraction, add 1 mL of trypsin-EDTA (0.05%) to the dish again and incubate 7-15 min, monitoring carefully to prevent overdigestion. Quench the trypsin-EDTA (0.05%) on the dish with 2 mL of 10% FBS/DPBS. Collect the LEC fraction in a new 15 mL tube.\n\tNOTE: The usual recovery for LECs is within a range (2 x 106-4.2 x 106) depending on the size of the MGs. Routinely, the purity of both fractions as assayed by immunohistochemistry is ~90%19 (Figure 2E).",
    "Centrifuge each fraction for 5 min at 300 x g to remove the trypsin-EDTA (0.05%). Resuspend the pellet in 250 µL of Maintenance Medium and count each cell population using a hemocytometer or automated cell counter. Place the cells on ice while counting.\n\tNOTE: If genetic manipulation of the cell fractions is desired, primary cells can be grown on low adhesion dishes and infected with lentivirus20.\n4. Day 3: Combining and embedding cell fractions in an extracellular matrix\nNOTE: Once the MyoEC and LEC fractions have been collected and counted, they can be combined. The typical MyoEC/LEC ratio is 1:3 (Figure 3A)19. Different studies can be performed. For example, to perform mosaic studies, fractions can be generated from wild type (WT) and mutant (Mut) mice and combined (MyoEC/LEC: WT/WT; WT/Mut; Mut/WT; Mut/Mut)21, or fractions can be combined using different ratios of MyoECs/LECs19.\nBased on cell counts, calculate the number of wells (8 well chamber, see Table of Materials) that need to be prepared for 12,000 cells/well (e.g. 3,000 MyoECs:9,000 LECs).\nEstablish the base layer for 3D culture by adding 90 µL of 50% ECM (50% ECM/50% DMEM/F12, without phenol red - see the Table of Materials) to each well. Ensure there are no bubbles and the wells are coated evenly. To solidify the base layer, incubate the slides at 37 °C, 5% CO2 for 30 min.\n\tNOTE: The ECM needs to stay ice-cold until this step, otherwise it will polymerize prematurely and lead to uneven base coating and polymerization. Using a base ECM enhances organoid growth in a single plane, which aids image capture. This also obtains faster organoid growth and uses less ECM22.",
    "During polymerization, prepare the cell mixes. Pellet the MyoEC and LEC fractions at 300 x g for 5 min and resuspend each cell fraction in 10% ECM/90% Growth Medium so each well has 100 µL (see Table 1 for how to make Growth Medium).\n\tNOTE: For ease of preparation, replicate wells using the same cell mixes. These can be combined and prepared in one tube (e.g., four wells of the same cell mix can be prepared in 400 µL of 10% ECM/90% Growth Medium).\nAdd 100 µL of each cell mix in 10% ECM/90% Growth Medium to each well and allow organoids to settle for 20 min at 37 °C, 5% CO2.\nOnce the cells have settled, gently add 100 µL of Growth Medium by gently pipetting down the chamber wall of each well. Incubate the slides at 37 °C, 5% CO2 (see Figure 3A for the total composition of each well).\n\tNOTE: The Rho Kinase inhibitor, R-spondin, and Nrg1 are factors that have been identified as important for the long-term culture of organoids grown from both primary murine mammary cells and human breast cancer cells13,14. In addition, the stem cell factors B27 and N2 extend the time that organoids can be cultured.\nImage cells every 24 h to track their growth and gently renew the Growth Medium every 2-3 days using 100 µL/well (Figure 3B-E).\n\tNOTE: Use extreme care when renewing the medium. Tilt the chamber slides to collect the medium at one corner of the wells. Remove ≤100 µL of the medium and replenish with care to leave the ECM layer undisturbed.",
    "If researchers are interested in investigating lactation/alveologenesis, switch to Alveologenesis Medium (see Table 1) on day 5 and continue to renew the medium every 2-3 days until day 10 (Figure 3F) or beyond by passaging using recovery solution (see the Table of Materials)13.\n\tNOTE: At this point, organoids can be isolated from the ECM by incubating at 4 °C in 400 µL of 4 °C recovery solution (see Table of Materials for protocol and reagent info).\n5. Day 5 or 10: Fixing and immunostaining organoids\nRemove the medium carefully by gently pipetting off the media (a bulb pipette works best). Rinse each well using 200 µL of 1x Dulbecco's Phosphate Buffered Saline (DPBS, see recipes).\nFix the organoids using cold (4 °C) 4% (w/v) paraformaldehyde (PFA, see recipes) for 10 min at room temperature.\n\tCAUTION: PFA is hazardous. Wear personal protective equipment (lab coat, gloves, and safety glasses). This step should be performed inside a fume hood.\n\tNOTE: The ECM is dissolved by the PFA treatment. Incomplete ECM removal can lead to background staining when the organoids are analyzed by immunofluorescence.\nRemove the 4% PFA and add 200 µL of 0.2% (w/v) glycine/DPBS (see Table 1) to each well. Incubate the slides at room temperature for 30 min or 4 °C overnight on a rocking surface set to a slow setting.\n\tNOTE: The organoids can be stored for 1-3 days in DPBS at 4 °C prior to the next step.\nPermeabilize the organoids using DPBS + 0.25% Triton X-100 (PBST, see Table 1) for 10 min at room temperature.\nBlock the organoids using 5% donkey serum (DS) (or other serum matching the species of the secondary antibody) in DPBS for 1 h on a rocking surface.\n\tNOTE: This step can be performed overnight at 4 °C on a rocking surface.",
    "Prepare primary antibodies in 1% DS/DPBS. Use 125-200 µL for each well. Perform immunostaining by incubating the organoids in primary antibody overnight at 4 °C on a rocking surface.\n6. Day 11: Complete immunofluorescence\nWash each well 2X with 200 µL PBST for 5 min. Add secondary antibody in 1% DS/DPBS using 125-200 µL for each well. Incubate at room temperature on a rocking surface for 45 min.\nWash each well 2X using 200 µL PBST per well.\nStain the nuclei using Hoechst DNA dye in DPBS (1:2,000 in DPBS) for 5 min at room temperature.\nRemove all liquid left on the well by gently suctioning with a vacuum.\nCarefully remove the chambers and gasket, place one drop (~30 µL) of mounting media (see Table of Materials) on each well and coverslip, taking care to remove bubbles. Allow the slide to dry in a dark space for 1-2 days. Seal with clear nail polish. Image the organoids on a confocal microscope (Figure 3E-F).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}