{
  "id": 9487,
  "origin_website": "Jove",
  "title": "Peering into the Dynamics of Social Interactions: Measuring Play Fighting in Rats",
  "procedures": [
    "1. Equipment and Room Set Up\nThe play box apparatus is a clear, Plexiglas box measuring 50 cm X 50 cm X 50 cm with 1-2 cm of standard corncob bedding.\nAll filming is conducted in the dark via a handheld camcorder under the night-shot option.\nThe camcorder is placed at a 45° angle facing downwards towards the play box on a tripod. All four corners must be visible in the shot to obtain a full view of the apparatus.\n2. Methodology\nAnimals are weaned between postnatal days 21-23. Depending on the experimental design, animals can be housed together in groups of 2-4 in the required male and female combinations.\nPlay testing occurs during an animal's light cycle, although testing occurs in a dark room. The testing room must be dark prior to the entrance of the animals.\nGroups housed together are habituated for three, consecutive 30-min, sessions directly prior to testing following the same sequence as if being tested (see 2.5).\nFollowing habituation, pairs are individually isolated 24 hr prior to testing to maximize playful interactions (see 2.5).\nAnimals are transported into a dark testing room and are then individually placed in the play apparatus and tested as pairs for 10 min. Subjects are then removed and placed together in their home cage.\nFollowing each play session, bedding is discarded and the play apparatus is thoroughly cleaned using the antiseptic Virkon (or its equivalent). This is a superior agent for cleaning the rat odors from the previous pair, as it does not leave the strong and persistent smell of alcohol wipes or sprays. Cover-spray may also be used to mask any scents given off by the subjects. New bedding is then added.\nRepeat steps (2.4-2.6) for additional trials.\n3. Behavioral Analysis: Assessing the Content of Play",
    "First, the distinctive targets competed over by rats in both serious fighting and play fighting make this species particularly valuable as a research subject for studying play, as escalation from playful to serious fighting can be unambiguously detected by a shift in body targets35. Second, the number of attacks launched against the nape of a partner can be measured. Third, given that defense is contingent on attack, the relative defensiveness of the recipient of attacks can be measured as the proportion of attacks defended. Fourth, when defending against a nape attack, the recipient can use one of several tactics to protect or extricate their nape from their partner's snout15, 25, 26. These tactics fall into two main categories.\nIn evasion, the defender can walk, run, leap or dodge away (Figure 2a), and, by doing so, it not only moves its nape away from its attacker, but also ends up facing away from its attacker (Video of evasive defense).\nIn facing defense, the defender turns to face its attacker, thus not only withdrawing its nape away, but also juxtaposing its teeth between its nape and the attacker's snout. Facing defense falls into two main categories: rotation around the longitudinal axis of the body and rotation, horizontally, around a vertical axis (usually between the rump and mid-body, although this can differ between the sexes27). Further, rotation around the longitudinal axis of the body can take one of two forms.\nComplete rotation involves the rat turning from a standing position to fully supine (Figure 2B). Partial rotation involves the rat turning its forequarters, but leaving one or both of its hind paws in contact with the ground (Figure 2C, Video to show difference between full rotation and partial rotation).\nimgsrc://cloudfront.jove.com/files/ftp_upload/4288/4288fig2.jpg",
    "Figure 2.  Three types of defense in response to a playful nape attack are shown in 61 days old male rats (A-C). A. Evasion. Following the attacker's lunge at the nape (a, b), the defender swerves away from its attacker (c). B. Complete rotation. A nape contact from behind (a) leads the defender to rotate (b, c) until it is lying supine and blocking the attacker with its outstretched paws (d). C. Partial rotation. An attacker's lunge to its partner's nape from the side (a, b) is followed by a rotation of the head, neck and shoulders by the defender, so withdrawing its nape from its attacker's snout, while maintaining support on the ground with its hind feet (c). From Pellis et al. 26; reprinted with permission of S. Karger AG, Basel.\nHorizontal rotation around the vertical axis requires the defender to move its rump away from its attacker while moving its head toward its partner (Figure 3, Video of horizontal rotation).\nFollowing its immediate rotation around either its vertical axis or partially around its longitudinal axis, the defender can then rear and push against its partner, showing that the outcome, when using either of these two tactics, can be similar. Confounding tactics with outcomes can be even more striking when considering complete and partial rotations. When a defender executes a complete rotation, the movement is quick and fluid - if videotaped on a standard 30 fps recording, a rotation to fully supine takes 2-3 frames and the movement is continuous (Video).",
    "A partial rotation can also end in a fully supine position, but this typically involves the concerted actions of the attacker. In this case, the defender can partially rotate its forequarters and keep its body horizontal or even touching the ground, but the attacker can then press its body weight onto the defender. With persistent pressing and reaching for the nape by the attacker, the defender rotates more and more, until fully supine. Such a 'forced' supine occurs in a staccato manner, with incremental rotation of the body, and can take substantially more than 3 video frames (Video showing a partial rotation leading to the defender adopting a supine position).\nGiven that most studies are interested in the effects of particular manipulations on subjects, it is best to score the tactic attempted by the subject rather than the eventual outcome that may be forced by its partner's actions. This judgment can be made by examining the movements of the defender within the first 2-3 frames of the commencement of a defensive action (Video highlighting the first 2-3 frames, frame-by-frame).\nPlayful attacks can be measured when the snout of one rat either contacts or comes within 1-2 cm of its partner's nape (Video showing a playful attack compared to non-playful movements near partner rat).\nAs noted above, the defensive tactic of the recipient can be categorized in the first few frames following an attack. A new sequence begins with a new attack (Video showing extended playful sessions compared to separate playful attacks).",
    "During an extended playful wrestle, such as is shown in Figure 1, rats can counterattack once they have successfully defended themselves, but these types of attacks are more difficult to score, especially in regard to the partner's defensive reaction. Because counterattacks are highly correlated with the frequency of initiating attacks16, these more complex phases of the interactions need not be scored unless there is good reason for doing so23. The scoring of initiating attacks and the tactics employed to defend against such attacks suffice to capture the relative differences in playfulness and defensive behavior of rats in different experimental conditions26, 29.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4288/4288fig3.jpg\nFigure 3.  Facing defense involves a defender turning to face its attacker while pivoting on its hind legs in the horizontal plane around a vertical axis (a, b). From this position, the defender can block access to its nape (c) and launch a counterattack (d). From Pellis et al.25; adapted and reprinted with permission from APA.",
    "Since most playful interactions start with a playful attack, the absolute number of such attacks can be measured within the time period of a test trial. The optimal size of the trial for our studies has been 10 min following 24 hr of social isolation15, 16. Brief periods of social isolation increases the motivation to engage in social play while not having a similar effect on other social behavior such as social investigation9. Although any amount of isolation has this effect, the impact of isolation on play reaches an asymptote around 24 hr27. While trials of 5 min can detect such isolation-induced changes, they are too short to detect subtle differences such as those between the sexes due to a ceiling effect - in this example, the greater propensity for males to play mostly emerges after the first 5 min. Even so, by 15 min, the animals appear fatigued by the vigorous play and consequently, trials lasting 10 min are a good compromise between economy of protocol and the ability to detect experimental effects15, 16, 27. Whether tested in the light or dark phase of the rats' daily cycle, our experience is that the amount of play increases if the rats are tested under red light instead of white light15, 16. With the advent of camcorders with night shot capability, filming in the dark is possible, and this also increases the amount of play performed in test trials29.",
    "Given that defense is contingent on an attack occurring, defensiveness should be scored as a proportion of attacks leading to defense. Similarly, given that any given type of defense is contingent on a defense occurring, scoring types of defense should also be in terms of proportions (e.g., of the defenses that occurred, X% were complete rotations). Scoring defense as an absolute measure can be misleading. For example, a low frequency of complete rotations could arise because of low rates of attack or because the subjects in that particular experimental condition used the complete rotation infrequently even if they had been attacked just as frequently as the animals in the control condition.\nThus, when scoring play, there is a sequential analysis: how many attacks are launched by the subjects (number/unit time), how many attacks are defended against (i.e., probability of defense), and when defending, what is the likelihood of using the different tactics of defense (%tactics).\n4. Behavioral Analysis: Using the Content of Play to Assess Play Partner Relationships\nWith the onset of puberty, there is an overall decline in the amount of play fighting8, 40. This is because they decrease the frequency of their launching of nape attacks, but maintain the same, high probability of defense17. Among male rats, the pattern of play is modified by the development of dominance relationships that coalesce around puberty37. This is reflected in the types of defensive tactics used.\nIn males, with the onset of puberty, there is a relative decline in their use of the complete rotation tactic (Different Video of Full Rotation as shown in above parts) and an increase in their use of the partial rotation tactic (Different Video of Partial Rotation as show in above parts), with the other tactics remaining at about the same frequency at all ages16.",
    "However, in subordinate males, it is dependent on their partner as to which of these tactics they will use. When playing with another subordinate male or a female, a subordinate male rat is most likely to use the partial rotation tactic when attacked, but when playing with the dominant male in the colony, it is more likely to use the complete rotation tactic when attacked18, 19, 24, 36. Thus, with the onset of dominance relationships, the relative use of tactics is a good marker to monitor changes in an experimental subordinate rat's social relationships12.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}