{
  "id": 19045,
  "origin_website": "Jove",
  "title": "Preparation and Pathogen Inactivation of Double Dose Buffy Coat Platelet Products using the INTERCEPT Blood System",
  "procedures": [
    "1. Whole Blood Collection\nCollect whole blood from volunteer donors in 450 ml top/bottom collection sets according to local blood collection guidelines.\nThe whole blood is stored for a minimum of 2 hr on a cooling plate before centrifugation and separation.\n2. Buffy Coat Preparation\nCentrifuge the whole blood using a hard spin to separate the blood into three layers: red blood cells, buffy coat, and plasma. Centrifuge parameters used were 4,880 RCF for 11 min at 22±2 °C.\nUse an automated blood separator to express the plasma into the top satellite bag and the red blood cells (RBC) into the bottom satellite bag, leaving the buffy coat in the collection container. Target mean volume and hematocrit ranges for buffy coats are approximately 48 ml and 37%, respectively.\nThe buffy-coats are stored overnight on a platelet agitator at 22±2 °C.\n3. Buffy Coat Pooling\nSterile connect 7 buffy coats and 300 ml of SSP+ platelet additive solution (PAS) in a train configuration with parallel lines to reduce the train length; the PAS should be at the top of the train. Clamp the line between the PAS and the first buffy coat.\nOpen the sterile connections between the buffy coat units and allow the buffy coats to drain into the last container.\nOpen the weld and the clamp between the PAS and the first buffy coat. Allow one-third of the additive solution to rinse through each of the buffy coat containers sequentially. Repeat 2 more times each time using one-half of the remaining PAS.\nThe average buffy coat pool volume should be approximately 600 ml. If the target volume and hematocrit of the individual buffy coats are met, the plasma ratio will be 32 - 47% as required for the INTERCEPT pathogen inactivation treatment later in the process.",
    "Discard the empty SSP+ and buffy coat containers.\nFor optimal platelet recovery, keep the pool on the agitator for 1 hr prior to centrifugation.\nSterile connect a platelet storage container with integrated leukoreduction filter to the buffy coat pool.\nPerform a \"soft spin\" of the buffy coat pool to separate the red blood cells from the platelets in suspension (462 RCF for 9 min, 20 sec). Express the platelet suspension using an automated blood separator through the leukoreduction filter into the platelet storage container.\nThe previously described processing requirements ensure that the platelet suspension meets the INTERCEPT processing specifications of 300 ml - 420 ml volume, 2.5-7.0 x 1011 platelet dose, and ≤ 4 x 106/ml red cells.\n4. INTERCEPT Treatment\nPerform the INTERCEPT treatment before the end of Day 1 after collection (day 0 is the day of collection).\nUnwrap the INTERCEPT Processing Set with Dual Storage Containers from the clear plastic pouch.\nSterile connect the platelet suspension container to the tubing of the amotosalen container on the INTERCEPT processing set.\nLabel the INTERCEPT processing set storage containers with the appropriate blood product identification following local requirements.\nHang the platelets and break first the bottom cannula on the amotosalen container, allowing the amotosalen solution to flow into the illumination container. Break the top cannula on the amotosalen container allowing the platelets to flow through the amotosalen container into the illumination container.\nGently mix the platelet and amotosalen mixture and express the air from the illumination container into the amotosalen container.\nExpress a small amount of the platelet mixture into the tubing, filling about 4 cm of the tubing. This ensures platelets in both the tubing and illumination container undergo the pathogen inactivation treatment.",
    "Seal the tubing between the illumination container and amotosalen container. Leave no more than approximately 4 cm of tubing extending from the illumination container. Remove and discard the empty platelet and amotosalen containers and close the clamps on the sampling pouches.\nPlace the processing set into the illuminator with the illumination container in the large compartment on the left and the organizer in the smaller compartment on the right side.\nUse the hand-held barcode device to enter the donation ID, product code, and processing set lot number into the illuminator. Close the metal cover and when prompted on the illuminator graphical interface, close the drawer. Press \"Start\" to start the Illumination.\nAfter illumination, remove the processing set from the illuminator. The illuminator automatically prints the treatment report for the treated platelet unit(s).\nUnwrap the containers from the organizer and hang the platelets and processing set, break the cannula at the outlet of the illumination container, and allow the platelets to flow into the compound adsorption device (CAD) container.\nTaking care not to bend the CAD wafer, express the air from the CAD container into the illumination container using a plasma extractor.\nSeal the tubing near to the inlet port of the CAD container. Remove and discard the empty illumination container.\nPlace the CAD container with the attached storage containers on a platelet agitator for at least 6 hr, but no more than 16 hr. This will result in reduction of residual amotosalen to a concentration of ≤ 2 μM.\nAfter CAD treatment, remove the platelet units from the agitator. Hang the platelets. Break the cannula and allow platelets to flow into the storage containers.",
    "Express the air from the storage containers into the CAD container. Let the residual platelet concentrate flow back into the storage containers by gravity. Seal the tubing above the Y-fitting and remove the empty CAD container.\nRedistribute the volume between the storage containers as needed. Volume adjustments are made by weighing the storage containers. Seal the tubing to each storage container a few centimeters above the inlet of the storage container; this facilitates obtaining a sterile sample from the final product as described in 5.2.\n5. Product Sampling\nFor routine QC testing, the final storage containers can be sampled once by using the sampling pouch on the storage containers. To do so, ensure the platelet unit is well mixed, then open the clamp to the pouch and squeeze several times. Seal the tubing after the pouch has filled with platelets. Transfer the platelet sample into an appropriate laboratory tube and perform assays immediately.\nTo obtain samples at multiple time points over the course of storage, such as for a validation study, sterile connect a new sampling container to the tubing of the platelet storage container. Ensure that platelets are well mixed prior to transfer to the sampling container.\n6. In vitro Function Evaluation\nFor this validation study, in vitro evaluation was performed after CAD treatment (Day 1 or Day 2, depending on CAD duration) and again on Day 4 (or Day 5) and Day 7. In vitro measurements included volume, platelet count, pH, blood gas (pO2, pCO2), glucose, lactate, and swirling.\nVolume was determined by weight using 1.01 g/ml as the specific gravity of platelets in additive solution.\nHemoglobin contamination was evaluated visually using comparison to a color chart.\nSwirling was determined visually.\nSee \"Table of equipment\" for methodology of other assays.\n7. Representative Results",
    "The process of producing double dose buffy coat platelets begins with the production of individual buffy coats which meet target specifications for volume and hematocrit. As it is not practical to measure the hematocrit of the individual buffy coats during the final process validation, we began by undertaking a separate effort to optimize our buffy coats to ensure we could consistently meet target volume and hematocrit. As shown in Table 1, our optimized buffy coats compared favorably to the target values for both volume and hematocrit at 46 ± 2 ml and 37 ± 3%, respectively.\nAfter pooling, the volume and hematocrit of the buffy coat pool should be approximately 600 ml and 20%, respectively, prior to the soft spin centrifugation. As illustrated in Table 2, our buffy coat pools averaged 615 ± 5 ml; the hematocrit averaged 19 ± 1%.\nThe soft spin centrifugation results in a double dose platelet concentrate that will meet the input requirements for pathogen inactivation utilizing the INTERCEPT Blood System DS processing set. Key input parameters for INTERCEPT treatment include volume, platelet count, plasma ratio, and RBC content. In addition, we aim to recover ≥ 75% of the platelets in the platelet concentrate as compared to the buffy coat pool. Per local requirements, the white blood cell (WBC) contamination must be <1x106/unit. The platelet concentrates in our validation met the key parameters for INTERCEPT treatment as well as the targets for WBC contamination and platelet recovery as shown in Table 3.",
    "The INTERCEPT process for pathogen inactivation is performed on the double dose platelet concentrate using a single INTERCEPT processing set. The processing set contains two integral storage containers which allow the treated unit to be split into two individual therapeutic platelet doses at the completion of the pathogen inactivation process. European guidelines require that 75% of units tested contain ≥ 200x109 platelets per therapeutic dose1; local requirements in Sweden require that 75% of the units tested contain >240x109 platelets per dose. After INTERCEPT treatment, the average platelet content was 265 ± 22 x109 (n=24). Furthermore, 88% of units met or exceeded 240x109 platelets per therapeutic dose; this is well within both the European guidelines and Swedish regulations. See Figures 1 & 2 for an illustration of the double dose buffy coat preparation and INTERCEPT treatment processes respectively.\nFor this validation, we measured the in vitro characteristics of the platelet concentrates after INTERCEPT treatment (i.e. after the split into the individual storage containers); parameters were measured over 7 days of storage. Mean and standard deviation were collected for platelet dose, pH, pO2, pCO2, lactate production and glucose consumption.\nFigure 3 shows the mean starting platelet dose of the double dose platelet concentrate before INTERCEPT treatment and the mean platelet dose in each of the split products after INTERCEPT treatment over 7 days of storage. Platelet loss during storage was approximately 9%. This reduction is not different from the expected loss of platelets during storage of conventional platelets.2\nTable 4 summarizes the in vitro characteristics of the INTERCEPT platelets after treatment and splitting into single units.",
    "Per European requirements, the pH of platelets must remain above 6.4 through the end of shelf life. During processing, the pH of the platelet concentrates drops slightly based on the platelet concentration, volume, and the gas permeability of the platelet storage container. Figure 4 illustrates the pH of the split platelet products over 7 days of storage. During storage, the pH is stable and well maintained within the processing requirements.\nAs shown in Figures 5A and 5B, the platelet O2 consumption and the CO2 production indicate continued respiration by the INTERCEPT platelets in the PL2410 container during 7 days of storage. Figures 6A and 6B show the lactate and glucose levels over 7 days of storage. Platelet glucose consumption and lactate production are consistent with each other during the 7 days of storage. 5 units had glucose level less than 1.11 mmol/l (the lower limit for the glucose assay).\nThe buffy coat preparation and pooling validation produced platelet concentrates that met the input criteria for INTERCEPT treatment; specifically, volume, platelet count, plasma ratio, and red blood cell contamination. The final units met the validation criteria over 7 days of storage including platelet dose and pH.\ntable:\n﻿0,1,2\nParameter,Target Range,Results Mean ± SD\nVolume (ml),~ 48,46 ± 2\nHematocrit (%),~ 37,37 ± 3\nHold time before pooling,Overnight on agitator,Overnight on agitator\nTable 1. Characteristics of the Individual Buffy Coats (n=19).\ntable:\n﻿0,1,2\nParameter,Target Range,Results Mean ± SD\nVolume (ml),~ 600,615 ± 5\nHematocrit (%),~ 20,19 ± 1\nHold time before centrifugation,1 hr on agitator,1 hr on agitator\nTable 2. Characteristics of the Buffy Coat Pools (n=12).\ntable:\n﻿0,1,2\nParameter,Target,Results Mean ± SD\nVolume (ml),370 - 420,404 ± 8\nPlatelet count (x109/unit),250 - 700,577 ± 62\nMean Platelet recovery (%),≥ 75,75 ± 4\nPlasma ratio (%),32 - 47,38 ± 1",
    "RBC (x106/ml),≤ 4,1.2 ± 0.4\nWBC (x106/unit),≤ 1,0.11 ± 0.1\nHold time before INTERCEPT (hr),≤ end of day 1,≤ end of day 1\nTable 3. Characteristics of the Double-Dose Platelet Concentrates (n=12).\ntable:\n﻿0,1,2,3\n,Mean ± SD,Min,Max\nVolume (ml),199 ± 16,182,236\nPlatelet count (x109/unit),265 ± 22,225,292\npH (22 °C),6.9 ± 0.1,6.8,7.0\npO2 (kPa),21.4 ± 4.8,12.8,27.3\npCO2 (kPa),4.3 ± 0.4,3.3,4.9\nLactate (mmol/l),9.1 ± 1.7,6.8,12.4\nGlucose (mmol/l),5.3 ± 0.9,3.7,6.5\nTable 4. Characteristics of the INTERCEPT Treated Platelets Day 1/2 (Single Units, n=24).\nimgsrc://cloudfront.jove.com/files/ftp_upload/4414/4414fig1.jpg\nFigure 1. Production of a double dose platelet concentrate from a pool of 7 buffy coats.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4414/4414fig2.jpg\nFigure 2. Pathogen inactivation of a double dose platelet concentrate with the INTERCEPT Blood System.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4414/4414fig3.jpg\nFigure 3. Mean platelet dose before and for 7 days after INTERCEPT treatment (n=12 before INTERCEPT; n=24 after INTERCEPT).\nimgsrc://cloudfront.jove.com/files/ftp_upload/4414/4414fig4.jpg\nFigure 4. Mean platelet pH ±SD after INTERCEPT treatment (n=24).\nimgsrc://cloudfront.jove.com/files/ftp_upload/4414/4414fig5a.jpg\nFigure 5A. Mean pO2 ±SD after INTERCEPT treatment (n=24).\nimgsrc://cloudfront.jove.com/files/ftp_upload/4414/4414fig5b.jpg\nFigure 5B. Mean pO2 ±SD after INTERCEPT treatment (n=24).\nimgsrc://cloudfront.jove.com/files/ftp_upload/4414/4414fig6a.jpg\nFigure 6A. Mean lactate levels ±SD after INTERCEPT treatment (n=24).\nimgsrc://cloudfront.jove.com/files/ftp_upload/4414/4414fig6b.jpg\nFigure 6B. Mean glucose levels ±SD after INTERCEPT treatment (n=24)."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}