{
  "id": 3401,
  "origin_website": "Cell",
  "title": "Generation of embryo-like structures from mouse embryonic stem cells treated with a chemical inhibitor of SUMOylation and cultured in microdroplets",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nEstablishment and culture of adherent spheroids\nTiming: 18 days\nThis section describes the experimental steps required to generate spheroids composed of three distinct cell types by treating mouse ESCs with sequential rounds of SUMOylation inhibition (Figure 2[href=https://www.wicell.org#fig2]A). The treatment regimen gives rise to epiblast-like cells and primitive endoderm-like cells, similar to their E4.5-E5.5 in vivo counterparts, as well as a third ESC-like cell population. These cell types self-assemble into adherent spheroids in the culture dish and can be maintained in culture for up to four weeks. The hypoSUMOylation-instructed spheroid cells will be used to generate gastruloids and ELSs in the subsequent steps of the protocol.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2981-Fig2.jpg\nFigure 2. Generation of adherent spheroids from mESCs\n(A) Experimental timeline.\n(B) Representative images of cells at different time points. Scale bars, 100 μm.\nFor details about the characterization of the spheroid cell types and structure, please refer to Cossec et al. (2023).1[href=https://www.wicell.org#bib1]\nNote: Prepare gelatin coated 100 mm culture plates before each cell passage. Pre-warm culture medium in a 37°C water bath before use.\nTreat ES R1 cells with ML-7922[href=https://www.wicell.org#bib2] for the first hypoSUMOylation round (day 1):\nAspirate culture medium from a confluent ES R1 100 mm culture plate.\nWash cells with PBS.\nAdd 1 mL of Trypsin-EDTA and incubate cells at 37°C in a humidified incubator with 5% CO2 for 1–2 min.\nAdd 9 mL of Serum + Lif culture medium and pipet cell suspension until homogeneous.\nTransfer cells to a 15 mL Falcon tube.\nCount cells.\nSeed 2.5 million cells in 10 mL of Serum + Lif culture medium, supplemented with 2.5 μM of ML-792 (2.5 μL of a 10 mM stock solution) on a gelatin coated 100 mm culture plate.\nIncubate cells at 37°C in a humidified incubator with 5% CO2 for 24 h.",
    "Note: Protocol can be scaled down to a 6-well plate format (500,000 cells in 2 mL culture medium per well) or scaled up to a 150 mm culture plate format (7 million cells in 20 mL culture medium).\nAlternatives: All 2.5 μM ML-792 treatment steps can be replaced with 0.1 μM TAK-9813[href=https://www.wicell.org#bib3] treatments, by supplementing 10 mL of Serum + Lif culture medium with 4 μL of 0.25 mM TAK-981 intermediate dilution to treat the cells.\nTreat ES R1 cells with ML-792 (day 2):\nAspirate culture medium.\nAdd 10 mL of Serum + Lif culture medium, supplemented with 2.5 μM of ML-792 (2.5 μL of a 10 mM stock solution).\nIncubate cells at 37°C in a humidified incubator with 5% CO2 for 24 h.\nStop the first hypoSUMOylation round (day 3):\nAspirate culture medium.\nWash cells with PBS twice.\nAdd 10 mL of Serum + Lif culture medium.\nIncubate cells at 37°C in a humidified incubator with 5% CO2 for 24 h.\nNote: High cell mortality is observed after 48 h of treatment with a SUMOylation inhibitor (Figure 2[href=https://www.wicell.org#fig2]B).\nAllow cells to recover from hypoSUMOylation in Serum + Lif culture medium:\nThe next day (day 4), wash cells with PBS once.\nAdd 10 mL of Serum + Lif culture medium.\nIncubate cells at 37°C in a humidified incubator with 5% CO2 for 24 h.\nPassage cells (1:2 dilution on a gelatin coated plate) when they reach ∼80% confluence (usually at day 6) and replace culture medium on days without a passage.\nTreat ES R1 cells with ML-792 for the second hypoSUMOylation round (day 8):\nCount the cells.",
    "Seed 2.5 million cells in 10 mL of Serum + Lif culture medium, supplemented with 2.5 μM of ML-792 (2.5 μL of a 10 mM stock solution) on a gelatin coated 100 mm culture plate.\nIncubate cells at 37°C in a humidified incubator with 5% CO2 for 24 h.\nNote: The interval between the two rounds of hypoSUMOylation can be extended to more than 5 days with no effect on the efficacy of spheroid formation. We tested up to 15 days of recovery time between the two rounds with a successful outcome.\nTreat ES R1 cells with ML-792 (day 9):\nAspirate culture medium.\nAdd 10 mL of Serum + Lif culture medium, supplemented with 2.5 μM of ML-792 (2.5 μL of a 10 mM stock solution).\nIncubate cells at 37°C in a humidified incubator with 5% CO2 for 24 h.\nStop the second hypoSUMOylation round (day 10):\nAspirate culture medium.\nWash cells with PBS twice.\nAdd 10 mL of N2B27 + Lif culture medium.\nIncubate cells at 37°C in a humidified incubator with 5% CO2 for 24 h.\nAllow cells to recover from hypoSUMOylation in N2B27 + Lif culture medium:\nThe next day (day 11), wash cells with PBS once.\nAdd 10 mL of N2B27 + Lif culture medium.\nIncubate cells at 37°C in a humidified incubator with 5% CO2 for 24 h.\nPassage cells in N2B27 + Lif culture medium (day 12):\nAspirate culture medium.\nWash cells with PBS.\nAdd 1 mL of Trypsin-EDTA and incubate cells at 37°C in a humidified incubator with 5% CO2 for 30–60 s.\nAdd 9 mL of N2B27 + Lif culture medium and pipet cell suspension until homogeneous.\nTransfer cells to a 15 mL Falcon tube.\nCentrifuge cells at 1,000 g for 5 min at 18°C–25°C.",
    "Discard the supernatant and resuspend cells in 3 mL of N2B27 + Lif culture medium.\nTransfer 1 mL of resuspended cells to a gelatin coated 100 mm culture plate containing 9 mL of N2B27 + Lif culture medium.\nPassage cells every other day (1:3 dilution) and replace medium on days without a passage.\nNote: By day 16, three-dimensional adherent spheroids should be visible (Figure 2[href=https://www.wicell.org#fig2]B).\nMake stocks of adherent spheroid cells:\nCount spheroid cells dissociated as in Step 9 in N2B27 + Lif culture medium.\nCentrifuge cells at 1,000 g for 5 min at 18°C–25°C.\nDiscard supernatant and resuspend cell pellet in cryopreservation medium (ES Cell Qualified FBS with 10% of sterile DMSO) in order to have 3 million cells/mL.\nDistribute 1 mL of this spheroid cell stock mixture to labeled cryovials and transfer them to an appropriate freezing container.\nStore at −80°C then transfer to liquid nitrogen for longer term storage.\nThaw a vial of cryopreserved spheroid cells:\nCoat a 6-well plate with 2 mL of 0.1% Gelatin per well.\nPre-warm N2B27 + Lif culture medium in a 37°C water bath.\nTransfer a vial of spheroid cells from liquid nitrogen to a cell culture hood.\nWhile cell suspension is thawing, add 9 mL of N2B27 + Lif culture medium to a 15 mL Falcon tube.\nAdd 1 mL of N2B27 + Lif culture medium to the thawing cell suspension in the vial.\nGently pipet the cell suspension and transfer it to the Falcon tube.\nCentrifuge the resuspended cells at 1,000 g for 5 min at 18°C–25°C.\nAspirate the gelatin from one well of the 6-well plate and add 1 mL of N2B27 + Lif culture medium.\nAfter centrifugation, discard the supernatant and resuspend spheroid cell pellet in 1 mL of N2B27 + Lif culture medium.",
    "Gently administer spheroid cell suspension dropwise to the well.\nIncubate cells at 37°C in a humidified incubator with 5% CO2 for 24 h.\nThe next day, check that cells have adhered.\nPassage spheroid cells every other day on gelatin coated wells and replace culture medium on days without a passage.\nNote: Post-thawing, passage spheroid cells at least twice before proceeding to the next steps of the protocol. Spheroid cells can be maintained in culture for up to 4 weeks, during which time they can be used to generate gastruloids and ELSs.\nNote: As previously reported,1[href=https://www.wicell.org#bib1] ES R1 cells cultured in ground state condition (MEK inhibition and GSK3 inhibition with Lif)4[href=https://www.wicell.org#bib4] are unable to form spheroids.\nAlternatives: Two other ESC lines (CGR8 and E14) have been tested to generate spheroids under comparable conditions, yielding a similar efficiency.\nGeneration of gastruloids in non-adherent microwells\nTiming: 3 days\nThis section describes the experimental steps required to generate gastruloids from dissociated spheroid cells seeded in non-adherent AggreWell plates (Figure 3[href=https://www.wicell.org#fig3]A). The spheroid cells aggregate in the microwells and self-organize to mimic the gastrulation stage (∼E6.75) of the embryonic development, both at a transcriptomic and a morphological level. These gastruloids present a properly positioned primitive streak and establish proximal-distal and anteroposterior axes.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2981-Fig3.jpg\nFigure 3. Generation of gastruloids in non-adherent microwells\n(A) Experimental timeline.\n(B) Representative images of the gastruloids at different time points. Scale bars, 100 μm.\nFor details about the characterization of the gastruloid cell types and structure, please refer to Cossec et al. (2023).1[href=https://www.wicell.org#bib1]\nPrepare the AggreWell plate:\nAdd 1 mL of Anti-Adherence Rinsing Solution per well of an AggreWell 800 plate.\nCentrifuge the plate at 300 g for 5 min at 18°C–25°C.\nIncubate the plate at 18°C–25°C in a cell culture hood for 30 min.\nAspirate the Anti-Adherence Rinsing Solution.",
    "Wash each well with 2 mL of PBS twice.\nAdd 500 μL of N2B27 + Lif culture medium per well.\nStore plate at 37°C in a humidified incubator with 5% CO2 until use.\nNote: AggreWell plate can be prepared and stored at 37°C for up to 2 days before cell seeding.\nSeed spheroid cells in the AggreWell plate:\nCount dissociated spheroid cells in N2B27 + Lif culture medium.\nSeed 30,000 cells in 1 mL of N2B27 + Lif culture medium per well of the AggreWell plate (∼100 cells per microwell).\nNote: Cell number can be increased up to 40,000 cells per well (∼133 cells per microwell).\nOptional: Centrifuge AggreWell at 300 g for 2 min at 18°C–25°C after cell seeding.\nIncubate cells at 37°C in a humidified incubator with 5% CO2 for 3 days to obtain gastruloids (Figure 3[href=https://www.wicell.org#fig3]B).\nNote: Cells can be incubated for a 4th day if bigger gastruloids are required (i.e., for staining experiments) or if longer kinetics are needed (i.e., for treatment, compound testing...) (Figure 3[href=https://www.wicell.org#fig3]B).\nOptional: For the initial three days, refreshing the culture medium is unnecessary. However, if cells are incubated for a 4th day or if medium needs to be changed to apply a treatment, carefully aspirate 750 μL of cell culture medium from each well, taking care not to disturb the gastruloids. Gently add 750 μL of fresh N2B27 + Lif culture medium by pipetting slowly against the wall of the well.\nGeneration of gastruloids using microdroplets\nTiming: 4 days",
    "This section describes the experimental steps required to generate gastruloids from dissociated spheroid cells seeded in the microfluidic chip (Figure 4[href=https://www.wicell.org#fig4]A). The spheroid cells aggregate and self-organize to form elongated structures, with a mesodermal posterior pole and a neuroectodermal anterior pole. These gastruloids contain properly patterned cell types from all three embryonic germ layers.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2981-Fig4.jpg\nFigure 4. Generation of gastruloids and ELSs using microdroplets\n(A) Experimental timeline.\n(B) Representative images of the gastruloids in the chip at different time points.\n(C) Representative images of the ELSs embedded in 20% Matrigel in a 96-wells plate at different time points. Scale bars, 100 μm.\nFor details about the characterization of the gastruloid cell types and structure, please refer to Cossec et al. (2023).1[href=https://www.wicell.org#bib1]\nNote: Fabrication of the chip was described in the before you begin[href=https://www.wicell.org#before-you-begin] section.\nRender the chip fluorophilic:\nEquip the inlet and the three outlets of the chip with PFA resin tubing (Idex 1507L) with an inner diameter of 0.040″ and outer diameter of 1/16''.\nHold the chip vertically under a chemical hood and use a syringe to insert 4–6 mL of Novec 1720 (3M) in the inlet to fill the chip.\nHeat the chip at 110°C for 1 h to ensure that the Novec solvent has fully evaporated.\nCritical: Novec surface treatment should be done under a chemical hood.\nPrepare the chip, fluidic connectors and droplet generator:\nHold the chip vertically and use a syringe to insert ∼5 mL of fluorinated oil (FC-40, 3M) containing 0.5% RAN surfactant (RAN biotechnology) in the inlet to fill the chip and remove air bubbles.\nAlternatives: 0.5% RAN can be replaced by a 0.5% FluoSurf neat (Emulseo) solution.\nFill two 1 mL glass syringes (SGE), equipped with PTFE tubing (0.56 mm ID and 1.07 mm OD, Adtech), with a FC-40/0.5% RAN solution.",
    "Equip a low-pressure cross body (Idex, 1/4–28 flat-bottom ports) with Idex Flangeless Short Head Fitting Assemblies (1/4–28 flat-bottom connection for 1/16″ OD Tubing) and with PFA resin tubing (Idex 1507L) with an inner diameter of 0.040″ and outer diameter of 1/16″, connected with three silicone tubing segments (ID 1.0 mm, Thermo Fisher Scientific). This cross junction assembly constitutes the droplet generator (Figure 5[href=https://www.wicell.org#fig5]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2981-Fig5.jpg\nFigure 5. Schematic of the droplet generator\n(A) Cross junction assembly.\n(B) Connection of the droplet generator to the chip.\nNote: The cross junction can be reused by washing it first with a 70% ethanol solution, then with DI water, and leaving it to dry in an oven set at 70°C for ∼1 h.\nPrepare a spheroid cell suspension for microfluidic chip loading:\nCount dissociated spheroid cells in N2B27 + Lif culture medium.\nPrepare a spheroid cell suspension at 16,800 cells/mL in N2B27 + Lif culture medium (∼120 cells per 7 μL droplets) in a Falcon tube.\nNote: 1.5 mL of spheroid cell suspension is required to load each chip.\nNote: A range of 8,400 to 25,200 spheroid cells/mL can be used.\nNote: Spheroid cell suspension can be stored at 37°C in a humidified incubator with 5% CO2 for up to 1 h before chip loading.\nHomogenize cell suspension and prepare 1.5 mL aliquots in 2 mL Eppendorf tubes.\nAspirate an aliquot of cell suspension into a 1 mL plastic syringe (BD), equipped with PTFE tubing.\nPrepare the fluidic system for chip loading:\nInstall the two syringes filled with FC-40/0.5% RAN and the one filled with cells and culture medium in the syringe bay of a Nemeysis syringe pump (Cetoni).\nConnect the PTFE tubes to the cross junction through the silicone tubing connectors, as shown in Figure 5[href=https://www.wicell.org#fig5]A.",
    "Prime the droplet generator by flowing the cell suspension at 300 μL/min and the FC-40/0.5% RAN from the two glass syringes also at 300 μL/min, until all of the tubes are completely filled with liquid and all the air has been evacuated.\nLoad the chip:\nConnect the fourth PFA tube of the droplet generator to the chip inlet through the silicone tube connector (Figure 5[href=https://www.wicell.org#fig5]B).\nFill the device with FC-40/0.5% RAN by flowing from the two glass syringes in order to remove any remaining air bubbles in the traps and the chamber.\nTilt the chip at an angle of 30°–45° in order to use buoyancy to help the fluid flow.\nDroplet containing cells are generated by injecting 7 μL plugs of the cell suspension at 1,000 μL/min then stopping the aqueous flow, then injecting 6 μL of FC-40/0.5% RAN segments generated at 1,000 μL/min. This alternating operation is then repeated to obtain the desired number of drops. By choosing a sufficiently long outlet tube, the drops can be stored in the tubing before reaching the microfluidic chip.\nFlow the water-in-oil segments down the tubing and into the microfabricated device.\nOnce the drops are in the microfluidic device, tilt the chip to guide the droplets towards the individual traps.\nTrap one droplet in each trap.\nNote: Droplet guiding can be additionally facilitated by orienting the chip in the direction of targeted traps.\nAllow the droplets to move to the upper part of the traps by gravity.\nDisconnect the droplet generator from the chip.\nWash any remaining extra droplets by flowing pure FC-40 from the inlet at 300 μL/min.\nIncubate cells at 37°C in a humidified incubator with 5% CO2 for 4 days to obtain gastruloids (Figure 4[href=https://www.wicell.org#fig4]B).\nMatrigel embedding of microdroplet gastruloids to generate ELSs\nTiming: 3 days",
    "This section describes the experimental steps required to generate ELSs from the microfluidic-derived gastruloids (Figure 4[href=https://www.wicell.org#fig4]A). Once embedded in Matrigel, the gastruloids elongate much further, reaching lengths of over 1 mm, and adopt a head-and-trunk morphology. These ELSs contain properly patterned derivatives of the neuroectodermal (midbrain-hindbrain, spinal cord), mesodermal (somites, mesenchyme) and endodermal (gut) lineages.\nFor details about the characterization of the ELS cell types and structure, please refer to Cossec et al. (2023).1[href=https://www.wicell.org#bib1]\nPrepare Matrigel:\nThaw a bottle of Matrigel on ice in a 4°C fridge for 16–24 h.\nThe next day, prepare 1 mL aliquots of thawed Matrigel.\nPrepare N2B27 + Lif culture medium with 20% Matrigel by adding 1 mL of Matrigel to 4 mL of N2B27 + Lif culture medium.\nCritical: The Matrigel handling steps should be carried out on ice to prevent premature gelling.\nStore remaining Matrigel aliquots at −20°C for later use.\nRecover microdroplet-derived gastruloids:\nConnect a 10 mL syringe containing pure FC-40 to the inlet of the chip.\nFlip the chip vertically.\nAllow the droplets to move out of the traps.\nFlush ∼10 mL of FC-40 from the inlet to facilitate droplets removal from the chip.\nCollect droplet contents in a 15 mL Falcon tube.\nSeparate droplet contents from oil by aspirating with a 1,000 μL tip which has been beveled at its extremity.\nPlace droplet contents in a 2 mL Eppendorf tube.\nAdd 100 μL of a 10% PFO solution and mix content by inversion.\nCentrifuge at 900 g for 2 min at 18°C–25°C in order to break the emulsion.\nAlternatives: Remaining emulsion can be broken by filtration on PTFE membrane (Thermo Fisher Scientific #F2517-9).\nTransfer droplet contents to a 1.5 mL Eppendorf tube and allow the gastruloids to settle by gravity.",
    "Discard the supernatant and mix the gastruloids with 1 mL of 20% Matrigel in N2B27 + Lif culture medium.\nTransfer the gastruloids in Matrigel to the stock tube of 20% Matrigel in N2B27 + Lif culture medium.\nMix by inversion.\nSeed the gastruloids in Matrigel in a 96-well plate with flat bottom and treated for ultra-low adhesion, by dispersing 100 μL of the stock solution using a 1,000 μL beveled tip.\nMix stock tube by inversion after seeding each line of the 96-well plate.\nIncubate structures at 37°C in a humidified incubator with 5% CO2 for 3 days to obtain ELSs (Figure 4[href=https://www.wicell.org#fig4]C)."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Cell Biology",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}