{
  "id": 9961,
  "origin_website": "Jove",
  "title": "High-Throughput Method for Measuring Alcohol Sedation Time of Individual Drosophila melanogaster",
  "procedures": [
    "1. Construction of the testing apparatus\nCreate a cardboard template the size of a 24-well cell culture plate by tracing around the plate on cardboard and cutting out the designated area.\nCut a piece of small insect screen mesh the size of the cell culture plate using the cardboard template from step 1.1.\nPrepare a 24-well cell culture plate by placing a small line of hot glue around the perimeter of the top of the plate using a hot glue gun and affixing the screen mesh on top of the open wells.\nSecure a wooden craft stick to each of three sides of the same cell culture plate from step 1.3 using a hot glue gun. The modified cell culture plate should now resemble the plate diagram shown in Figure 1A and the experimental setup shown in Figure 2.\n\tNOTE: Prepare at least as many cell culture plates as will fit in the filming chambers (see below).\nimgsrc://cloudfront.jove.com/files/ftp_upload/61108/61108fig1.jpg",
    "Figure 1: Diagram of the testing apparatus and filming chamber. (A) Upper Diagrams. The top, side, and front views of the testing apparatus are shown, respectively. A screen mesh lays flat on top of a 24-well cell culture plate. The wooden craft sticks, represented by the arrowheads, are attached to three adjacent sides for stability and alignment aid, two on the side of the well plate with six wells and one on the side of the plate with four wells. All attachments are hot glued onto the apparatus. (B) Lower Diagrams. The top, side, and front views of the assay set-up are shown, respectively. A slit is cut in the right side of the box, from the opening for the lid to the back of the opening, with the bottom of the slit level to the inner surface. The hole on the top of the box, the surface parallel to the ground, is centered for maximum video exposure. The shaded box represents the video camera. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61108/61108fig1large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/61108/61108fig2.jpg\nFigure 2: Photograph of the assay system. The video camera is placed on top of the polystyrene chamber, with the lens inserted in the cut-out hole, illustrated in the diagrams of Figure 1B. Two sets of modified 24-well cell culture plates rest on top of an illumination pad that is inserted in a slit through the side of the chamber. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61108/61108fig2large.jpg]\n2. Construction of the filming chamber",
    "Create a filming chamber by cutting a hole the size of the video camera lens on the side of a polystyrene box. Cut an additional slit the width of the illumination pad in the opposite side of the polystyrene box. The filming chamber should resemble the filming chamber shown in Figure 1B and Figure 2.\nPrepare the filming chamber for use by inserting the illumination pad into the slit and positioning the camera in the lens hole above the illumination pad.\nPlace all materials and perform all subsequent testing in a controlled environment, preferably a behavioral chamber with approximately 30% humidity, 25 °C temperature, uniform airflow, and noise levels less than 65 dB.\n3. Preparation of the testing apparatus and flies\nPipette 1 mL of 100% ethanol through the screen mesh into each well.\nDry the screen mesh with a piece of cheesecloth.\nCut two pieces of cheesecloth the dimensions of the cell culture plate using the cardboard template created in step 1.1. Place them on top of the dry screen mesh of the modified cell culture plate containing ethanol from step 3.2.\nCreate a small piece of thin, flexible plastic cutting board by tracing around the cardboard template created in step 1.1 as a general guide and expanding the traced area by 1–2 cm on one of the short sides. Cut out the expanded traced area from the thin, flexible plastic cutting board. After cutting, ensure that the plastic still fits between the three wooden craft sticks on the testing apparatus, but hangs off one end by 1–2 cm.",
    "(Optional) If an aspirator needs to be created, assemble an aspirator like the one shown in Figure 3 by first cutting a P1000 pipette tip in half. Insert the piece with a larger diameter into one end of a ~30 cm piece of flexible tubing to serve as a mouthpiece.\nimgsrc://cloudfront.jove.com/files/ftp_upload/61108/61108fig3.jpg\nFigure 3: A fly aspirator in which flies are collected with an interchangeable mouthpiece attached to flexible tubing and a wide bore serological pipette with a cotton gauze stopper. The operator can aspirate a single fly into the pipette for transfer without anesthesia. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61108/61108fig3large.jpg]\n(Optional) To complete the aspirator assembly, cover the wide end of a 10 cm piece of serological pipette with gauze to prevent flies from getting into the tubing and insert the pipette, gauze first, into the open end of the tubing to serve as a fly chamber. The aspirator should resemble that shown in Figure 3.\nUsing an aspirator (Figure 3, steps 3.5 and 3.6), aspirate one fly per well into a separate 24-well cell culture plate. Use the flexible plastic to cover any wells containing previously aspirated flies. Record the well position and any relevant genotype or phenotype information of each fly.\nHold the flexible plastic flush with the top of the cell culture plate containing the flies to prevent their escape and invert the plate onto the top of the modified cell culture plate with the ethanol. The sheet of flexible plastic should be resting on top of the sheets of cheesecloth. Align the inverted cell culture plate containing flies using the craft sticks to ensure each well with ethanol aligns with each well containing a fly.\nThe experimental setup should resemble Figure 2.\n4. Testing the flies",
    "Ensure the illumination pad is lit at full brightness for maximum visual contrast. Start recording with the video camera.\nTo expose the flies to ethanol, carefully remove the plastic from between the well plate and testing apparatus, taking care not to dislodge the cheesecloth.\nTerminate the video recording once all flies have lost postural control. Once it is suspected that all flies have lost postural control, tap firmly in the center of the plate to ensure that all flies have complete loss of postural control. If there is movement, continue to record. Continue to tap periodically (every 1–2 min) until no movement occurs.\n(Optional) To quickly recover the flies, remove only the top plate from the testing apparatus, revealing sedated flies resting on the cheesecloth. Aspirate individual flies into chosen containers for recovery.\nReplace the ethanol in the modified cell culture plates with 1 mL of fresh 100% ethanol at least 1x every hour to control for evaporation and humidification of the ethanol and to maintain consistent ethanol exposure throughout the assay. Dry the screen mesh with cheesecloth.\nRepeat for as many samples as desired.\n\tNOTE: For highest throughput, aspirate the next round of flies into new cell culture plates during the video recording. The protocol can be paused here, as the video recording can be reviewed later.\n5. Determination of fly sedation time\nRecord sedation time for each individual fly by watching the video recording. Sedation time is defined as the moment a fly loses complete postural control and locomotor ability. It is recommended to watch the film in reverse and record the time that the fly begins to move to ensure accuracy."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}