{
  "id": 9379,
  "origin_website": "Jove",
  "title": "Semi-automated Biopanning of Bacterial Display Libraries for Peptide Affinity Reagent Discovery and Analysis of Resulting Isolates",
  "procedures": [
    "1. Biopanning Bacterial Display Libraries Using autoMCS\nNOTE: This autoMCS-based sorting protocol has been previously described 14, and a more thorough \"Expanded Protocol for New Users\" is available in the supplementary materials for this manuscript for further detail, including an explanation of potential modifications. If an autoMCS device is unavailable for sorting, see the supplemental protocol from Sarkes et al. 2015 since a manual sorting protocol is also described in that work 14. The autoMCS protocol provided here has been further adapted to include additional negative sorting steps for improved specificity 1,15. A schematic of this biopanning protocol is illustrated in Figure 1.\nNegative Sorting to Remove Binders Likely to Cross-React with Magnetic Beads\nInoculate 500 mL of Luria Broth Miller (LB) containing appropriate antibiotic with approximately 1 x 1011cells of a diverse bacterial display sorting library (see table of materials).\n\t\tNOTE: The bacterial display peptide library used here (see table of materials) contains approximately 109- 1011unique members 8,12 and is grown in LB containing 25 µg/mL chloramphenicol (LB Cm25). The remainder of this protocol will assume that this library is used.\nIncubate at 37 °C with shaking at 225 RPM until the culture reaches an OD600 of 0.5 - 0.55. Induce peptide expression with 0.04% w/v L-arabinose by diluting a 4% stock 1:100, shaking at 225 RPM for 45 min at 37°C.\nPlace induced culture on ice. Centrifuge approximately 2 x 1011 cells at 6000 x g for 20 min at 4°C. Remove supernatant and resuspend cells in 1.5 mL PBS by gently swirling.\n\t\tNOTE: An OD600 of 1.0 approximately equals 1 x 109 cells/mL for E. coli.\n\t\tNOTE: DO NOT VORTEX as this may lyse the cells; resuspend by hand or by briefly shaking at ≤ 225 RPM, 4°C.",
    "Transfer cells to microcentrifuge tube(s) and spin at 6,000 x g for 5 min at RT or 4°C. Remove supernatant. Resuspend the cell pellet in 1 mL phosphate buffered saline (PBS) containing 0.5% bovine serum albumin (BSA; PBS-B).\nWash 300 µL of streptavidin-coated beads (about 3 x 109 beads, see table of materials) in 1 mL PBS-B and centrifuge for 5 min at ≥5,000 x g (at RT). Place tube in a bench top magnetic particle separator. Carefully remove supernatant, avoiding the pellet.\nResuspend the beads in the cell plus PBS-B mixture prepared above. Incubate at 4°C on a rotating platform for 45 min. Place samples on ice.\nTurn on autoMCS instrument to initialize the system. Prime lines using manufacturer's run and wash buffers (see table of materials) by selecting \"Wash Now\" at the bottom of the screen in the \"Separation\" menu, then \"Rinse\" and \"Run\".\nPrime the system with PBS-B, using PBS-B as both Wash Buffer and Running Buffer in the next steps. Select the \"Separation\" menu from the upper navigation bar and select \"Wash Now\". Select \"Rinse\" and \"Run\" to prime the system with fresh PBS-B.\nTransfer cell and bead mixture from the incubation step to a 15 mL conical tube. Place this tube in the sample slot, and empty 15 mL conical tubes in the positive and negative selection slots, of a pre-chilled (4°C) rack (see table of materials). Place rack on instrument platform.\nAssign a separation program for each sample on the rack (up to 5 samples can be sorted in one run). Add a \"Rinse\" step in between each sample and after the last sample. Select \"Run\" to start the cell separation. Select \"OK\" to confirm that enough buffer is available.",
    "NOTE: The \"Posselds\" separation program works well for negative sorting and positive sorting round 1 and \"Posseld\" is preferred for sorting rounds 2 - 4, but both of these programs have been successfully used for all negative and positive sorting rounds 14,15 and other programs may prove better for a particular application (described further in discussion).\nWhen the program is complete, remove the rack and retain the appropriate fraction. Here, for a negative sort, retain negative fractions (containing cells without beads). Place on ice.\nUse the negative sort fraction in its entirety to inoculate 1L of LB Cm25 with 0.2% w/v D-glucose. Grow overnight at 37 °C, shaking at 225 RPM.\nBefore turning off the autoMCS instrument, change the run and wash buffers to the manufacturer's run and wash buffers (see table of materials). Select \"Wash Now\", then \"Rinse\" and \"Run\". When finished, be sure there is 70% ethanol in the decontamination line, then press the \"power icon\" at the top right corner of the screen and select \"Yes\".\nWhen the system shutdown is complete (the bottles will be purple), turn off the machine.\nThe next day, use the overnight culture to make freezer stocks with about 1 x 1011cells per vial in LB with 15% glycerol. Additionally, or alternatively, use this culture in the next step: additional negative sorting (section 1.2) or the first round of positive sorting (section 1.3).\nNegative Sorting to Remove Binders Likely to Cross-React with Other Targets of Interest\n\tNOTE: Section 1.2 can be skipped if no further negative sorting is needed or desired. In that case, proceed to section 1.3. Residual binding to any undesired targets can be assessed by FACS as in section 2: FACS Analysis of Sorting Rounds.",
    "For negative sorting against a specific protein target, such as a similar protein with potential to also bind to the discovered peptides 1,15, repeat growth and induction steps 1.1.1 - 1.1.3, beginning with a frozen stock of streptavidin-depleted library from step 1.1.15 or the overnight culture from step 1.1.12 (using OD600 to estimate and inoculate with 1 x 1011 cells).\nTransfer cells to microcentrifuge tube(s) and spin at 6,000 x g for 5 min at RT or 4°C. Remove supernatant. Resuspend cell pellet in 1 mL PBS containing 600 nM biotinylated cross-reactive protein target. Incubate at 4 °C for 45 min on a rotating platform.\n\t\tNOTE: 600 nM is a suggested starting concentration, which can be altered if a noted benefit is observed. Biotinylation of protein target can be achieved and quantified using the reagents suggested in the table of materials.\nMeanwhile, wash 100 µL of streptavidin-coated beads (about 1 x 109 beads) in 1 mL PBS-B and centrifuge for 5 min at ≥ 5,000 x g (at RT). Place tube in a bench top magnetic particle separator and carefully remove supernatant, avoiding the pellet.\nCentrifuge the target-bound cells at 6,000 x g for 5 min (RT or 4°C), remove supernatant, and resuspend the cell pellet in 1 mL PBS-B. Resuspend beads in entire volume of washed cells bound to  cross-reactive protein target. Incubate at 4°C on a rotating platform for 30 min.\nPlace sample on ice and complete steps 1.1.7 - 1.1.15 for a negative sort, making appropriate freezer stocks. Continue to section 1.3 for a positive sort if all desired negative sorting has been achieved, or repeat section 1.2 to negative sort against another potential cross-reactive protein.\nRound 1 Positive Sort",
    "NOTE: Round 1 positive sorting against a specific protein target is similar to a negative sort against a specific sorting target (see 1.2) except that the bead-containing, positive fraction is retained.\n\t\nInoculate 500 mL of LB Cm25 with approximately 1 x 1011cells of a diverse bacterial display sorting library that has been streptavidin-depleted and grown overnight (from step 1.1.12) or frozen (from step 1.1.15) and thawed on ice, or that has been further depleted of binders to other cross-reactive protein targets (from step 1.2.5), as desired.\nIncubate at 37 °C with shaking at 225 RPM until the culture reaches an OD600 of 0.5 - 0.55. Induce peptide expression with 0.04% w/v L-arabinose by diluting a 4% stock 1:100, shaking at 225 RPM for 45 min at 37°C.\nPlace induced culture on ice. Centrifuge approximately 2 x 1011 cells at 6,000 x g for 20 min at 4°C. Remove supernatant and resuspend cells in 1.5 mL PBS by gently swirling (by hand or by briefly shaking at ≤ 225 RPM, 4°C).\nTransfer cells to microcentrifuge tube(s) and spin at 6,000 x g for 5 min at RT or 4°C. Remove supernatant.\nResuspend cell pellet in 1 mL PBS containing 600 nM biotinylated protein target of interest. Incubate at 4 °C for 45 min on a rotating platform.\n\t\tNOTE: 600 nM is a suggested starting concentration, which can be altered if a noted benefit is observed. Biotinylation of protein target can be achieved and quantified using the reagents suggested in the table of materials.\nMeanwhile, wash 100 µL of streptavidin-coated beads (about 1 x 109 beads) in 1 mL PBS-B and centrifuge for 5 min at ≥ 5,000 x g (at RT). Place tube in a bench top magnetic particle separator, and carefully remove the supernatant, avoiding the pellet.",
    "When incubation with target is complete, centrifuge the target-bound cells at 6,000 x g for 5 min (RT or 4°C) to remove any unbound target protein. Remove supernatant and resuspend the cell pellet in 1 mL PBS-B. Resuspend beads in entire volume of washed cells bound to protein target. Incubate at 4°C on a rotating platform for 30 min. Place on ice.\nTurn on autoMCS instrument to initialize the system. Prime lines using manufacturer's run and wash buffers (see table of materials) by selecting \"Wash Now\" at the bottom of the screen in the Separation menu, then \"Rinse\" and \"Run\".\nPrime the system with PBS-B, using PBS-B as both Wash Buffer and Running Buffer in the next steps. Select the Separation menu from the upper navigation bar and select Wash Now. Select Rinse and Run to prime the system with fresh PBS-B.\nTransfer cell and bead mixture from incubation step above to a 15 mL conical tube, rinsing the tube with an additional 500 µl of PBS-B and pooling the wash with the sample. Place this tube in the sample slot, and empty 15 mL conical tubes in the positive and negative selection slots, of a pre-chilled (4°C) rack (see table of materials). Place rack on instrument platform.\nAssign a separation program for each sample on the rack (up to 5 samples can be sorted in one run). Add a \"Rinse\" step in between each sample and after the last sample. Select \"Run\" to start the cell separation. Select \"OK\" or \"CONTINUE\" to confirm that enough buffer is available.",
    "NOTE: The \"Posselds\" separation program works well for negative sorting and positive sorting round 1 and \"Posseld\" is preferred for sorting rounds 2 - 4, but both of these programs have been successfully used for all negative and positive sorting rounds 14,15 and other programs may prove better for a particular application (described further in discussion).\nWhen the program is complete, remove the rack and retain the appropriate fraction. Here, for a positive sort, retain positive fractions (containing cells and beads). Place on ice.\nBefore turning off the autoMCS instrument, change the run and wash buffers to the manufacturer's run and wash buffers (see table of materials). Select \"Wash Now\", then \"Rinse\" and \"Run\". When finished, be sure there is 70% ethanol in the decontamination line, then press the \"power icon\" at the top right corner of the screen and select \"Yes\".\nWhen the system shutdown is complete (the bottles will be purple), turn off the machine.\nUse the positive sort fraction in its entirety to inoculate 1L of LB Cm25 with 0.2% w/v D-glucose. Grow overnight at 37 °C, shaking at 225 RPM.\nThe next day, use the overnight culture to make freezer stocks in LB containing 15% glycerol, and/or continue to positive sorting round 2 in section 1.4.\nSubsequent Positive Sorting Rounds\n\tNOTE: Typically, four sorting rounds are recommended, although three sorting rounds are generally sufficient 14,15. When to stop sorting is assisted by the FACS Analysis of Sorting Rounds described in section 2. Concentrations of target and magnetic bead volume decrease with each subsequent positive sorting round.",
    "Using the overnight culture from the previous sorting round (or a frozen cell stock from that round), inoculate 5 mL LB Cm25 with 100 µl cells (1:50 dilution). Incubate at 37°C with shaking at 225 RPM until the culture reaches an OD600 of 0.5 - 0.55.\nInduce peptide expression with 0.04% w/v L-arabinose, shaking at 225 RPM for 45 min at 37°C. Place induced cells on ice.\n\t\tNOTE: This induced culture can also be used to assess binding affinity and specificity for the sorting round it originated from, as described in section 2 below.\nCentrifuge 1 x 108 cells at 6,000 x g for 5 min at RT or 4 °C. Remove supernatant and resuspend cell pellet in 50 µL PBS containing half the concentration of biotinylated protein target of interest used for the previous round of sorting (therefore 300 nM for round 2, 150 nM for round 3, and 75 nM for round 4 from our suggested starting point). Incubate for 45 min on ice (or at 4 °C a rotating platform).\nMeanwhile, wash streptavidin-coated beads (15 µL for round 2, 8 µL for round 3, and 4 µL for round 4) in 1 mL PBS-B and centrifuge for 5 min at ≥ 5,000 x g (at RT). Place tube in a bench top magnetic particle separator and carefully remove supernatant, avoiding the pellet. Resuspend beads in 50 µL PBS-B.\nAfter the 45 min incubation with target in step 1.4.3, centrifuge the cells at 6,000 x g for 5 min at RT or 4°C, remove the supernatant, and resuspend the cells in the 50 µL washed beads from 1.4.4. Keep sample on ice and complete steps 1.3.7 - 1.3.13 for a positive sort.",
    "Inoculate a 5 mL culture of LB Cm25 supplemented with 0.2% w/v D-glucose with the entire positive, bead-containing fraction from the sort.\nThe next day, use the overnight culture to make freezer stocks in LB containing 15% glycerol and/or continue to the next positive sorting round, returning to step 1.4.1.\n\t\tNOTE: Using the induced culture from 1.4.2 to assess binding affinity and specificity as described in section 2 below can help determine when to stop sorting. If two sorting rounds in a row show similar binding affinity, or a later round shows decreased binding affinity for the target of interest, this a desirable place to stop sorting. After the final round, return to step 1.4.1 but stop at 1.4.2.\n2. FACS Analysis of Sorting Rounds\nUsing the induced cells from step 1.4.2 for each sorting round, or identical cultures, add 5 µL induced cells to 25 µL of each of the following prepared solutions for binding assessment (see also table of materials): PBS alone; PBS with 150 nM YPet Mona (YPet 12,13; positive control for expression), if available; 900 nM protein target conjugated to a fluorescent dye, such as amine-reactive dye with emission/excitation at 493 nm⁄518 nm (Target-488); 900 nM cross-reactive protein target(s) used for negative sorting labeled with the same fluorescent dye (Cross-Reactive Protein-488); and 900 nM streptavidin-R-phycoerythrin (SAPE). Incubate on ice for 45 min.\n\tNOTE: If continuing directly from step 1.4.2, this step will always be done the day after the biopanning for that round was completed since the down-selected library was grown overnight then subcultured and induced the following day. Cultures grown and induced similarly from frozen sorting round stocks can also be used; in that case, all rounds can be tested and compared in a single experiment.",
    "Centrifuge cells at 6,000 x g for 5 min at RT or 4°C. Remove supernatant and store samples on ice.\n\tNOTE: Cell pellets can be stored on ice until all samples are ready for analysis.\nTurn on the FACS instrument, open the software, start-up the system, and calibrate instrument following manufacturer's instructions 43,44.\nWithin the FACS software, click on \"Administrator\" and click on desired folder or create a \"New Folder.\" Click on the \"New Experiment\" icon at the top left of the screen. Right click icon to \"rename\" experiment. Within that experiment, click on \"Global Worksheets\".\nClick on the \"Dot Plot\" icon, then click on the global worksheet spreadsheet to create this scatterplot. Click on the dot plot graph itself, then select the \"Inspector\" icon at the top left of the screen and adjust the axes to biexponential display by selecting the boxes next to \"Y Axis\" and \"X Axis\" in the open window. Close the biexponential display window by clicking the X.\nCreate a \"New Tube\" by clicking the icon at the top left of the screen and rename the specimen with appropriate information by right clicking the specimen icon under \"global worksheet\" and selecting \"rename\". Expand the specimen by clicking the (+) sign, then double click on the tube icon, right click on it, and again select \"rename\" to describe the sample.",
    "Use this dot plot graph with default SSC-A vs FSC-A to run a negative control sample in PBS alone by double clicking on that tube or selecting the arrow next to it. Just before running the sample, resuspend the cell pellet in 500 µL ice cold FACS running buffer and transfer sample to a FACS tube (see table of materials), mixing well by pipetting and flicking the tube. Place the resuspended cells on the sample injection tube (SIT) of the instrument. Press “Acquire Data” with “Events to Display” at 30,000 - 50,000 and “Events to Record” at 10,000, flow rate at low (to start; increase if needed), and “SIT flush” selected.\n\tNOTE: Appropriate speed (low, medium, or high) is the speed at which the number of events/s is approximately between 200 and 2000.  Use this range for all steps.\nWhile acquiring, adjust photomultiplier tube (PMT) voltage threshold if needed by selecting the \"Threshold\" tab. Click on and change the \"Value\". Adjust voltage for forward and side scatter (FSC and SSC) such that negative control cells in PBS alone fall slightly below the center.\n\tNOTE: Additional parameters (such as SSC) can be added in the \"Threshold\" tab using the \"add\" icon. Typically, PMT voltages of about 700 V to 1000V for both SSC and FSC work well for E. coli.\nIf the sample is reading properly, adjust the flow rate to display 200-2000 events/s and press \"Record Data\". When finished recording, remove tube from SIT and place on ice.  Choose the \"Polygon Gate\" icon and use the mouse to draw a gate around the majority of the cell population in the scatterplot. Right click on dot plot and select \"Show Population Hierarchy\".",
    "Use this \"P1\" gate as a parent by clicking on \"P1\" in the population hierarchy. Create a new dot plot following step 2.5. Right click each axis and change the Y-axis to FITC-A and the X-axis to FSC-A. Gate the negative control (PBS alone) using the \"polygon gate\" icon, with the gate as tight as possible around the top and left side of the population.\n\tNOTE: Double check the population hierarchy to ensure that the P1 gate is a parent of the P2 gate. If it is not, it will appear in line with the P1 gate and \"All Events\" will be the parent; delete the gate and re-create it following the step 2.10.\nSelect \"P2\" in the population hierarchy, right click, and select \"invert gate\". Right click on the dot plot with P2 gate and select \"Show Populations\". Select the populations \"P2\" and \"Not P2\" for display (less than 1% of the population should fall outside the gate).\nRight click the dot plot with P2 gate and select \"Create Statistics View\". Right click the statistics view window and select \"Edit Statistics View\". Click the \"Populations\" tab and add or remove populations, as desired, including the parent population, P1 (P2, and Not P2 should already be shown). Click on the \"Statistics\" tab and add \"FITC-A Median\" and any other statistics of interest. Close the window by pressing OK.\nCreate a similar dot plot graph for PE-A vs FSC-A and gate using PBS alone sample (previous plots can be duplicated and altered). Use this spreadsheet to run all samples (including negative control cells incubated with each fluorophore-labeled target) in this manner, recording about 10,000 events for each.",
    "NOTE: The cells that fall outside the gate after incubation with the Target-488 protein, the YPet positive control, etc. are binders to that protein, and the value from \"Not PX\" (where X is the number of the gated population for that graph) should be recorded as % bound. When using SAPE as a negative control, use the PE-A vs FSC-A plot. The median fluorescence intensity (MFI) of P1 should also be recorded as this gives information beyond % binding, to show the extent of binding in relative terms, and is more robust in the presence of outliers 45. Median fluorescence intensity can be normalized (nMFI) by dividing MFI of each peptide by the MFI of a scaffold only negative control (with no N-terminal peptide), or a clone containing a peptide sequence that does not bind the target of interest, after incubation with the same target conjugated to the same fluorophore 14. If these negative control cells are unavailable, uninduced cells incubated with the same target and labeled with the same fluorophore can also be used for normalization.\n3. Sequence Analysis of Potential Candidates and Assessment of Binding Affinity\nPeptide Sequence Determination\nSelect and sequence tens or hundreds of bacterial colonies from the final round(s) of biopanning (typically rounds 3 and/or 4 are sufficient 14).\nAnalyze the sequence data using the macro file that we have developed (see supporting information for code, \"Sub eCPX_Sequencing\") to specifically analyze the sequences generated from biopanning the 15mer bacterial display library listed in the table of materials. Use the spreadsheet software listed in the table of materials, or other preferred compatible software.\n\t\tNOTE: A number of tools are available online that can also aid in the DNA sequence analysis 47. If preferred, use a different established method for sequence analysis and skip to step 3.1.3.",
    "Download the set of sequence files (.seq files, text documents also work) and extract them into a new folder. If necessary, move or copy the folder to the computer's hard drive (as opposed to a network folder) for improved speed.\nOpen a new spreadsheet window. Make sure to enable macros and enable all features, if those messages pop up.\n\t\t\tNOTE: Steps 3-6 below should only need to be completed the first time the macro is used. For subsequent analysis, simply \"Run the Macro\" starting at step 7.\nCopy the entire contents of the macro found in the \"Sub eCPX_Sequencing\" File.\n\t\t\tNOTE: The current version is set up with flanking sequences for the 15-mer library listed in the table of materials and will translate the amino acids between them. Additional sequences can be inputted by copying 5' flanking sequences in column A and 3' flanking sequences in column B of the spreadsheet, up to 10 sequences for each, before running the macro.\nIn the blank spreadsheet file, select the \"View\" tab, then double click on \"Macros.\" Select the personal.xlb folder. If this is unavailable, record a macro first to make this appear.\nClick \"create\" or \"step into\", depending on what can be highlighted. Paste the entire macro into the module.\nClick the save icon or go to file, save. Exit the module. If a window pops up, press OK.\nRun the Macro: Go to the folder where the desired.seq files are located. Click on the bar next to the icon of the folder at the top to view the folder location. Copy it.\nGo to the new spreadsheet window. Select the view tab, then double click on macros. Select \"eCPX_Sequencing\" from the list and click \"run.\"",
    "In the box that pops up, paste the file location copied in step 7 and hit enter. The macro should start going through the sequences and organizing them into tables on various sheets.\nUse the \"Summary Table\" sheet to determine if it will be necessary to check trace files for errors and make corrections manually (if sequences contain \"X\" or could not be translated).\n\t\t\tNOTE: The \"Summary Table\" displays the translated peptide sequences, sorted by amino acid sequence (from A to Z), unless a sequencing error prevented translation. An \"X\" denotes an individual amino acid that could not be determined.\nOnce the sequences are translated, organized, and any sequencing errors corrected, check the sorted peptide sequence list on the \"Summary Table\" sheet for any repeating sequences.\nGrow overnight cultures for sequenced colonies of interest (including the repeats and/or peptides with noticeable trends at a minimum) in 5 mL LB Cm25 at 37°C, shaking at 225 RPM, and save freezer stocks the next day in LB containing 15% glycerol, as in step 1.4.7. Test the peptides with repeating sequences for binding affinity and specificity using the FACS methods described in section 3.3 and use the FASTA format of the sequence list (full list and repeats only) to align the sequences using preferred alignment and analysis programs, as in section 3.2.\nSequence Alignment Using Clustal Omega, Kalign, and Similar Programs\nCopy sequences in FASTA format from the FASTA spreadsheet of the macro, or otherwise create a list of FASTA files from the sequences to be aligned (such as those from step 3.1.3).",
    "NOTE: Column A contains the FASTA files in numerical order by \"Seq #\" while column B displays them sorted by \"AA sequence\" from the \"Summary Table\" sheet. The list of peptide sequences sorted by amino acid sequence will display unusable sequences at the top, such as empty vector (as \"# Empty\") and those sequences in which neither the 5' or 3' search criteria were found (as \"# Value\"). This feature allows for easy update or removal of those sequences from the analysis.\nOpen Clustal Omega48 or Kalign49 software by going to the website 50,51, or use other preferred software for sequence alignment. Copy and paste the FASTA sequence list and input it into the box below \"sequences in any supported format\". Change \"gap open penalty\" to 30 under \"more options\" in Kalign (this is not possible in Clustal Omega), but otherwise keep default settings before clicking \"submit\".\nAnalyze sequence alignment using Jalview 52,53 software directly within Clustal Omega and Kalign online software by selecting the \"result summary\" tab above the alignment and then clicking the \"Jalview\" icon.\n\t\tNOTE: If preferred, or for analysis of sequence alignments generated by alternative programs, download 54 the software separately and copy and paste the alignment into the analysis window, which is opened by clicking \"File\", \"Input Alignment\", and \"from Textbox\". This provides a means to easily determine if a consensus sequence is present in the input sequence alignment.\nComparing Binding Affinity and Specificity Using FACS",
    "Inoculate 5 mL LB Cm25 supplemented with 0.2% w/v D-glucose with each individual isolate of interest (from step 3.1.4 and/or colonies of interest from further sequence analysis in section 3.2, etc.) and an appropriate negative control (display scaffold only or a peptide that does not bind target, as described in the note for step 2.13). Grow overnight at 37 °C, shaking at 225 RPM.\nUse the overnight cultures to inoculate 3 mL LB Cm25 with 60 µl cells (1:50 dilution). Incubate at 37°C with shaking at 225 RPM until the culture reaches an OD600 of 0.5 - 0.55. Induce peptide expression with 0.04% w/v L-arabinose plus 2 mM EDTA (for facilitation of peptide display 42), shaking at 225 RPM for 45 min at 37°C.\nPlace induced cultures on ice. For each isolate, add 5 µL cells to 25 µL PBS alone or PBS containing: 150 nM YPet 12,13 (positive control for expression), if available; 250 nM Target-488; 250 nM Cross-Reactive Protein(s)-488; and 250 nM SAPE (see 2.1 for more detail). Incubate on ice for 45 min.\nCentrifuge cells at 6,000 x g for 5 min at RT or 4°C. Carefully remove supernatant by drawing liquid from the opposite side of the pellet. Store cell pellets on ice until all samples and are ready for analysis.\nResuspend each cell pellet in 500 µL ice cold FACS running buffer, mixing well by pipetting and flicking the tube, just before reading using a flow cytometer (see table of materials).",
    "NOTE: See step 2.13 notes for further explanation of gating and calculation of nMFI to compare binding affinity and specificity. Non-binders or non-specific binders can now be removed from further analysis, and the highest affinity binders should be re-assessed by sequence alignment following section 3.2 to look for further trends that may have been missed in the initial sequenced population. Sections 3.2 and 3.3 may be repeated as needed as new trends and consensus sequences are noted. This analysis can include more random sequences if trends are not seen."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}