{
  "id": 9378,
  "origin_website": "Jove",
  "title": "Detection of the Genome and Transcripts of a Persistent DNA Virus in Neuronal Tissues by Fluorescent In situ Hybridization Combined with Immunostaining",
  "procedures": [
    "This method was used in a study published previously 22. For general background and description of conventional manipulation on ISH, IF and FISH, we suggest the following available literature 23.\n1. Animal Infection\nAll procedures involving experimental animals conformed to ethical issues from the Association for Research in Vision and Ophthalmology (ARVO) Statement for the use of animals in research, and were approved by the local Ethical Committee of UPR-3296-CNRS, in accordance with European Community Council Directive 86/609/EEC. All animals received unlimited access to food and water.\nThe method of mouse infection with HSV-1 described below has been used in studies previously published24-26.\nPrepare the following solutions to prepare before starting:\n\tHSV-1 virus stock solution\n\tAnesthetizing solution - Ketamine-100 mg/kg and Xylazine-10 mg/kg\n\t \nTake up 1 µl of virus (106 pfu) into a 5 µl glass microsyringe connected to a microsyringe pump device delivering 0.1 µl/sec. Note: Resuspend the virus stock in a phenol red-free medium to see the limit between the red oil present in the capillary and the virus solution and to avoid air injection at the site of virus inoculation.\nLay the anesthetized mouse (Ketamine-100 mg/kg and Xylazine-10 mg/kg) on its back face up.\nPosition the anesthetized mouse head under a binocular stereo-microscope and insert the needle in the subepithelial layer of the left upper lip at the mucocutaneous border. Inject the virus solution in two steps (twice 0.5 µl) at a speed of 0.5 µl per 5 sec. Note: Respect a 10 sec pause between the two 0.5 µl injections, to enable the viral suspension to absorb at the site of injection.\nPlace the mouse in a 37 °C incubator until wakening.",
    "Leave the mouse in the animal facilities to recover for the required time. Note: In the mouse model, HSV-1 induces a primary infection, called acute infection, which lasts less than 10 days at the site of inoculation and within several neuronal tissues including TGs, superior cervical ganglia (SCG), and dorsal root ganglia (DRG) depending on the inoculation site. Signs of primary infection progressively disappear and latency is considered fully established about 28-30 days post-infection (dpi) onwards. Neuronal tissues can be harvested usually from 4 dpi for studies on acute infection, and from 28 dpi for latency studies.\n2. Mouse Perfusion-fix\nPrepare the following solutions before starting: 50ml of physiological saline buffer\n\t60 ml of 1x PBS\n\t150 ml of freshly prepared 4% paraformaldehyde in 1x PBS\n\t60 ml of 20% sucrose in 1x PBS.\n\t \nPrepare the perfusion tubing: connect the needle to a capillary, which is connected to a peristaltic pump.\nAnesthetize the mouse as described above (srep 1.2) and lay it on its back on a dissection tray, attached by the four legs with pins.\nUsing scissors cut the skin from the belly up to the throat*. Tear away the thin tissue layer covering the organs. Open the rib cage by cutting the ribs on one side of the sternum. Remove the skin by tearing off. Move away from each other the right and left parts of the rib cage to reveal the heart. Note: Pay attention not to incise the guts, lungs and big vessels (carotid arteries and jugular veins), which will make perfuse-fixation impossible.",
    "Insert the needle in the left ventricle*. Incise the right atrium with the scissors. Proceed with exsanguination by injecting 20 ml of physiological saline in the blood vessels through the heart. Let the blood flow in the tray. Note: During this procedure, pay attention not to puncture through the other side of the heart.\nPerfuse with 150 ml of 4% PFA in 1x PBS during 15 min* (Caution: PFA is toxic, manipulate under fume hood). Perfuse 60 ml of 20% sucrose in 1x PBS during 6 min. At that stage the mouse is ready for TG harvesting. Note: Set the pump to 10 ml/min. A good perfusion is noticeable when the mouse tail stiffens up, lift up then fall again.\n3. TG Harvesting\nPrepare the following solution before starting:\n\t20% sucrose in 1x PBS\n\t \nCut the head at the level of the neck. Cut the tip of the nose just behind the incisors in order to reveal the nose cavity. Incise the palate in two with scissors and move away each side of the palate. Note: The TGs appears just beneath the palate, as two white and oblong masses of 2-3 mm in length located on the right and left side and connected to the trigeminal nerve.\nCut the trigeminal nerve branches on each side of the TGs to release the TGs from the brainstem. Remove the TGs with surgical pliers and keep them in a 20% sucrose sterile solution for 24 hr. Note: Use two different recipients for the left and right TGs, to avoid confusion between the left TG (infected) and the right TG (not or weakly infected). Incubate the TGs in 20% sucrose in 1x PBS for 24 hr before embedding.\nEmbed TGs in a single block in cryosectioning embedding medium and freeze at -80 °C.",
    "Store blocks at -80 °C until sectioning.\n4. Cryosection Preparation\nCut the TGs lengthways as 10 µm sections on a -20 °C cryostat, and place them on slightly heated (30° C) Superfrost slides. Let the slices dry for 5-10 min then freeze and store at -80 °C until use. Note: Up to 4-5 sections can be placed on a single slide, if large number of sections is to be processed at the same time. We proceed as follow: serial sections are deposited onto 3 series of slides labeled A1, B1, and C1, then A2, B2, C2 and so on. Hence, each slide series (A, B, and C) can be processed for different staining (in situ hybridization, FISH, in situ PCR, LCM) and data obtained using the different techniques can be compared knowing that slides carrying the same number correspond to the same region of the TG.\n5. HSV-1 Probe Labeling\nThe protocol described hereafter for the detection of HSV-1 genome by DNA FISH has been successfully used with two types of probes. The first is a home-made Cy3-labeled fluorescent probe which is appropriate for the fine analysis of nuclear organization within individual cells, by high magnification fluorescent microscopy. The second is a commercially available biotinylated probe, which can be combined with peroxidase-based signal amplification to provide a bright signal. The latter is appropriate for identification and quantification of virus containing neurons at low magnification in whole section, and for the analysis of the HSV-1 genome patterns. End-users should evaluate which approach fits best the goal of their study. The commercially available probe is listed in the reagent section, and the preparation of the home-made probe is described below.\nPrepare the following solutions before starting:\n\tHSV-1 genome containing vectors (see step 1)\n\t70% ethanol, molecular biology grade.",
    "Prepare cosmids containing 30 kb portions of HSV-1 genomes (cosmids number 14, 28, and 56 described in reference20 using purification columns dedicated to large vectors. Note: Other type of libraries containing HSV-1 genomes, such as bacterial artificial chromosomes should work as well, as long as the probe covers a large portion of the HSV-1 genome to produce sufficient signal27-29. In our hands, probes made from the cosmid vector backbone did not produce any signal, and were used as negative control. Thus entire cosmid vectors containing HSV-1 sequence were used in our study. It is also possible to cut out the HSV-1 sequence and use it to prepare the probe.\nLabel 2 µg of each cosmid with Cy3-dCTP using a nick-translation kit according to the manufacturer guidelines. Note: Perform labeling with a reaction mix containing only Cy3-dCTP and no unlabeled dCTP.\nStop the reaction by adding 3 µl of 0.5 M EDTA in the mixture and heating at 70 °C for 10 min. Cool on ice.\nPurify the probe on a G50 gel exclusion minicolumn. Add 150 µg of salmon sperm DNA to the probe and precipitate the probe by ethanol precipitation. The DNA pellet should be pink due to Cy3 incorporation. Wash the pellet with 70% ethanol and remove as much ethanol as possible with a pipette. Do not let the pellet dry.",
    "Dissolve the pellet with 100 µl of deionized formamide (Caution: formamide is toxic. Manipulate under fume hood). The probe concentration cannot be reliably measured at this point. The probe quantities mentioned within the text refer to the quantity of the template DNA used to make the probe. The protocol being based on 2 µg of DNA template and 100 µl of formamide, it is considered to be 20 ng/µl. Store at -20 °C. The labeled probe can be prepared in large quantity and stored frozen for several months.\n6. DNA-FISH\nFigure 1 shows an overview of the main steps of the DNA-FISH protocol, and how to perform DNA-FISH as part of a multiple staining experiment to codetect RNA and protein, as described in Protocols 7-9.\nPrepare the following solutions before starting:\n\t0.5% Triton X-100 in 1x PBS\n\t2x SSC and 0.2x SSC buffer\n\t100 mM pH 6.0 citrate buffer (10x stock solution) and 10 mM pH 6.0 citrate buffer (working solution)\n\t2x hybridization buffer (see Protocol 4)\n\t \nOn day 1, place the slides on a slide holder at room temperature, and let the sections dry for 10 min. Circle the sections with a hydrophobic pen. Rehydrate the sections in 1x PBS for 10 min. Incubate the sections 20 min with 0.5% Triton X-100 in 1x PBS to permeabilize the tissue. Wash 3x 10 min with 2x SSC, and keep in 2x SSC until the unmasking buffer is heated (see below).",
    "For unmasking, prepare a glass slide tray (20 slides capacity) filled with 200 ml of 10 mM sodium citrate buffer (pH 6.0). Place the tray in a larger container filled with 500 ml of distilled water. This setting allows for a better control of heating pulses. Before placing the slides in the tray, preheat the buffer in the microwave oven until the buffer reaches boiling (around 8 min at 800 W).\nPlace the slides in the preheated citrate buffer-containing tray, and verify that they are completely covered with buffer. Heat for about 20 sec until the buffer reaches boiling. Caution, DO NOT let the buffer over boil, which might damage the tissue. Cool down at room temperature for 2 min. Repeat the heating cycle 6x (7 heating cycles total)*. Cool down 2 min and transfer the slides in 2x SSC for 5min.\nNote*: This is one of the most critical steps. The optimal number and duration of heating cycles should be determined empirically, and may vary upon the type of tissue or the type of probe used. The microwave, tray, container and volume of buffer in the tray and water in the container should be kept identical for reproducibility of unmasking. Excessive boiling could result in tissue loss and damaged cells. For each heating pulse, the appearance of boiling is carefully watched, and heating should be stop at first signs of boiling. Once set up, unmasking appears robust and reproducible. Figure 2A shows that HSV-1 genome can be detected by unmasking with different buffers, indicating that unmasking conditions can be further explored. Citrate-based unmasking was found to consistently provide good FISH signal, and tissue preservation, with sections from various laboratory and animal models.",
    "Incubate the slides in a methanol:acetic acid:PBS mix (3:1:4) for 15 min, then in a methanol:acetic acid mix (3:1) for 15 min (Caution: acetic acid is corrosive. Manipulate under fume hood and use adequate protection. Prepare this solution right before use).\nDehydrate the section through successive 10 min incubation in 70%, then 2x 10 min in 100% ethanol. Let dry at room temperature for 10 min. Keep dry until probing.\nPrepare the probing solution as follow: prepare in advance a 20 ml stock of 2x hybridization buffer containing 20% dextran sulfate (MW 500,000), 2x Denhardt's solution, 4x SSC*. Aliquot the solution as 500 µl in microtubes, and store at -20 °C. For 1 slide (coverslip of 22 mm x 50 mm), mix 90 ng of HSV-1 Cy3-labeled probe (30 ng of probe for each cosmid), and complete the volume to 40 µl with formamide. Add 40 µl of 2x hybridization buffer. Mix well by pipetting up and down several times.\nNote*: To prepare the 2x hybridization buffer, mix 4 g of MW 500,000 dextran sulfate in 10 ml of distilled water. It makes a viscous mix that dissolve upon 3-4 hours at 70 °C. Mix regularly to help dissolve. Add 4 ml of 20x SSC, 400 µl of 100x Denhardt's solution. Complete to 20 ml and mix well using a vortex.\nDrop 80 µl of probing solution onto the dried sections. Cover with a 22 mm x 50 mm glass coverslip, and verify that the probing solution spreads over the entire surface of the coverslip. Caution: there should be no bubbles. Presence of bubbles decreases hybridization efficiency. Seal the coverslip using rubber cement, and let it dry. Keep the slides in the dark at room temperature for at least 2 hr for optimal hybridization signal throughout the slide.",
    "Note: Rubber cement is convenient as it dries quickly, is waterproof, and protects the sample from drying during hybridization. It is also easy to peel off to remove the coverslip after hybridization. Nail polish is an alternate efficient, but less convenient option.\nProceed with denaturation by placing the slides on an 80 °C slide incubator for 5 min. Alternatively, place the slides on a metal tray and place the tray in an 80 °C water bath (the tray should float). Then quickly transfer the slides onto a metallic tray placed on ice. Leave for 5 min. Transfer the slides at 37 °C (slide heater or incubator) for overnight hybridization.\nNote: We do not recommend shorter hybridization, which results in weak or no signal.\nOn day 2, remove the rubber cement with forceps, while maintaining the slide onto the heater to keep the section at 37 °C. Remove the coverslip gently with the tip of a scalpel blade.\nWash 3x with 2x SSC at 37 °C for 5 min, and three times with 0.2x SSC at 37 °C for 5 min. Wash once with 2x SSC at room temperature for 5 min and proceed with DNA staining and mounting (see Protocol 10 below).\nNote: This method allows for the detection of cellular genomic targets, by using corresponding probes into the probing solution together with HSV-1 specific probes as published for centromeric and pericentromeric sequences22.\n7. Dual RNA-DNA FISH\nSee Figure 1, green boxes for an overview.",
    "For multiple staining procedures including an RNA-FISH step, it is generally advised to first perform RNA detection as such target is sensitive to degradation by RNAse and chemicals. Additionally, DNA-FISH procedure includes treatments that reduce the efficiency of other staining. For RNA-FISH, we chose an enzyme based detection approach (Tyramide Signal Amplification (TSA) using biotinylated probes and peroxidase (HRP) coupled streptavidin). TSA is based on a fluorescent tyramide substrate (see reagent table for details), which is covalently linked to the tissue by a peroxidase enzymatic reaction. The RNA-FISH signal is thus preserved during DNA-FISH.\nPrepare the following solutions before starting:\n\tVector for in vitro transcription of LAT locus (pSLAT-2)\n\t1x PBS containing 2 mM RVC\n\t0.5% Triton X-100 in 1x PBS containing 2 mM RVC\n\t3% H202 in distilled water.\n\t70%, 80%, 95% ethanol, molecular biology grade.\n\t4x RNA hybridization solution (see Protocol 4)\n\t \nAt least one day before the RNA-FISH experiment, prepare the RNA FISH probe. To detect the HSV-1 Latency Associated Transcript (LAT), prepare a biotinylated ribo-probe from the pSLAT-2 vector30, or another vector for in vitro transcription of the LAT locus, as previously described in reference26. Briefly: Linearize 10 µg of pSLAT-2 with HindIII and purify the digested vector with a DNA purification kit. Synthesize a single strand ribo-probe from 2 µg of digested pSLAT-2 with a T7 in vitro transcription kit in the presence of biotin-16-UTP*. Purify the probe with an RNA mini-column and quantitate at 260 nm using a spectrophotometer. Dilute the probe at 50 ng/µl in DNAse/RNAse free water and store at -80 °C, in small aliquots to avoid freezing-thawing cycles.\nNote*: The biotin-16-UTP:UTP ratio must be empirically determined. We found a 40:60 ratio to provide probes efficiently detecting LAT by RNA-FISH.",
    "On day 1, place the slides on a slide holder at room temperature, and let the sections dry for 10 min. Circle the sections with a hydrophobic pen. Rehydrate the sections in 1x PBS containing 2 mM Ribonucleoside Vanadyl Complex (RVC)* for 10 min. Incubate the sections for 20 min with 0.5% Triton X-100 in 1x PBS containing 2 mM RVC to permeabilize the tissue. Wash 3x 10 min with 1x PBS, 2 mM RVC. To quench any endogenous peroxidase activity, incubate the section in 3% H2O2 for 2x 10 min, and then wash once with 1x PBS, 2 mM RVC.\nNote*: Throughout the RNA-FISH procedure, ribonucleoside vanadyl complex (RVC) is added to buffers and solutions to prevent RNA degradation.\nIncubate 2x 10 min in 70% ethanol. At this stage, sections can be stored in 70% ethanol at -20 °C for several weeks. Dehydrate the sections by incubation in 80%, 95%, and 100% ethanol, 5 min each. Let the section dry for at least 10 min.\nNote: In some cases, ethanol treatment can be deleterious for detection of other targets. An alternate protocol using a prehybridization step in 50% formamide - 2x SSC can be used (see below in Protocol 9 for details on triple staining). However, ethanol treatment is the most versatile approach for RNA-FISH and provides the lowest background.",
    "Prepare the probing solution as follow: prepare in advance a 10 ml stock of a 4x RNA hybridization solution containing 8x SSC, 20x Denhardt's solution, 4 mM EDTA, 40% dextran*. Aliquot the solution as 500 µl in microtubes, and store at -20 °C. For 1 slide prepare 80 µl of solution (coverslip of 22 mm x 50 mm), by mixing 20 ng of biotinylated LAT riboprobe, 40 ng of yeast tRNA, 2 mM RVC, and complete to 20 µl with water. Add 20 µl of 4x RNA hybridization solution, and 40 µl of formamide (50% final concentration). For easier pipetting and mixing, it is recommended to prewarm the 4x RNA hybridization solution at 75 °C. Mix well by pipetting up and down several times.\nNote*: To prepare the 4x RNA hybridization solution, mix 4 g of dextran sulfate (MW 500,000) in 3 ml of distilled water and 4 ml of 20x SSC. It makes a viscous mix that dissolves upon 3-4 hr at 70 °C. Mix regularly to help to dissolve. Add 2 ml of 100x Denhardt's solution, and 80 µl of a 0.5 M EDTA solution. Complete to 10 ml with water and mix well using a vortex. Caution: use only RNAse/DNase free products.\nDenature the probe 10 min at 75 °C. Meanwhile, place the slides on a slide incubator set to 65 °C. Drop 80 µl of probe solution onto the sections and quickly place a coverslip onto the drop. Caution: there should be no bubble. Presence of bubbles decreases hybridization efficiency. Incubation has to take place in a humidified chamber since the coverslip is not sealed. Use either a slide incubator that can hold water (see material table), or prepare a humidified chamber within a sealed box and place it in a 65 °C hybridization oven.",
    "Incubate overnight at 65 °C. Note: LAT RNA-FISH is carried out at 65 °C to prevent nonspecific binding of the probe, which is observed at 37 °C. Many other RNA-FISH probes should result in good signal at 37 °C.\nOn day 2, before commencing washing, prepare the detection reagents according to the manufacturer instructions of the TSA detection kit. Detection is performed with a commercial TSA detection kit including a horseradish peroxidase (HRP) coupled streptavidin and a green or blue fluorescent substrate.\nKeep the slides on the slide heater at 65 °C. Carefully remove the coverslip and quickly add 1 ml of 50% formamide in 2x SSC, prewarmed at 65 °C. Caution, do not let the section dry. Wash twice 10 min at 65 °C in 50% formamide in 2x SSC and 2x 10 min in 2x SSC at 65 °C. Wash once more with 2x SSC and place the slide on a 37 °C slide heater.\nProceed with the detection step according to the TSA detection kit manufacturer instruction. The concentration of HRP-streptavidin, the concentration of fluorescent substrate and the time of reaction must be empirically determined*. For LAT RNA detection, we routinely used the following condition: HRP-streptavidin diluted at 1/500, fluorescent reagent at 1/100 for blue fluorescence and 1/500 for green fluorescence, and reaction time of 10 min. The signal can be quickly checked with an inverted fluorescent microscope without mounting, before proceeding with DNA-FISH.\nNote*: The amplification protocol will be design according to the main goals of the experiment. For example, to finely localize the target RNA, it is advised to use short reaction time. In contrast, to quickly identify and count positive cells at low magnification, reaction time can be increased to generate a bright signal.",
    "For DNA-FISH, follow the procedure indicated above, starting from the unmasking step (step 6.2).\n8. Immuno-DNA FISH\nSee Figure 1, purple boxes for an overview.\nSimilarly to RNA-DNA-FISH, it is advised to perform first the immunofluorescence, since DNA-FISH is likely to denature proteins and prevent their detection by antibodies. The quality of immunofluorescence signal is highly dependent on the antibody characteristics, and several antibodies should be tested whenever possible. Epitope unmasking is performed once before the immunofluorescence to improve both the protein detection and DNA-FISH. To preserve the immunofluorescence signal on the sample during the DNA-FISH procedure it is necessary to covalently link it to the tissue. We present here two approaches that provided good results in our hands, antibody post-fixation and tyramide based detection (see step 8.5). The choice should be driven by preliminary tests for each target/antibody pair.\nPrepare the following solutions before starting:\n\t1x PBS containing 3% normal goat serum (NGS).\n\t2% PFA in 1x PBS (dilution from the 4% stock solution)\n\t \nOn day 1, the first steps are identical to DNA-FISH, up to the unmasking step (steps 6.1-6.2 ).\nAfter unmasking, incubate the sections with 1x PBS containing 3% NGS for 1 hr.\nIncubate with the primary antibody diluted in 1x PBS containing 3% NGS for 24 hr. Lower incubation time can be used to shorten the protocol, although we found that an overnight incubation usually results in a stronger signal. Up to 48-72 hr of incubation might be required for low affinity primary antibodies such as IgM.\nOn day 2, wash 3x 10 min with 1x PBS.",
    "Protocol with antibody post-fixation: incubate 1 hr with the secondary antibody coupled with a green fluorescent dye, at 1/200 in 1x PBS containing 3% NGS. Wash three times 10 min with 1x PBS. Post-fixation is performed with 2% PFA in 1x PBS for 10 min*. Wash 3x 10 min with 1x PBS.\nProtocol with TSA detection: incubate 1 hr with the HRP-coupled secondary antibody at 1/250 in 1x PBS containing 3% NGS. Wash three times 10 min with 1x PBS. Proceed with tyramide detection according to the manufacturer instructions. As indicated above (step 7.9), reagent dilution and reaction time must be empirically determined. In most cases, our protocol has been based on a 1/500 dilution of the fluorescent substrate and a 10 min reaction time. Wash 3x 10 min with 1x PBS.\nNote *: Post-fixation is a critical step in immuno-FISH, and requires careful set-up. The stronger the post-fixation the better the IF signal, and the lower the DNA-FISH efficiency.\nProceed with DNA-FISH from the methanol-acetic acid step (step 6.3). Duration of immuno-DNA-FISH is typically 3 days, with the first antibody incubated overnight.\n9. Dual DNA-RNA FISH Coupled with Immunofluorescence\nSee Figure 1, orange boxes for an overview.\nRNA-FISH is performed first, followed by immunofluorescence, and lastly DNA-FISH. If immunofluorescence is detected by tyramide reaction, it is key to quench completely the HRP activity from the RNA-FISH step with H2O2, and to verify that quenching is efficient. This is done by using one slide as a \"no primary antibody\" control.\nBecause ethanol-based dehydration is deleterious for some solvent-sensitive proteins, this step of RNA-FISH can inhibit immunofluorescence. If so, RNA-FISH can be performed with an alternate protocol, as detailed below in stpe 9.3.\nPrepare the following solution before starting:\n\t50% formamide in 1x PBS containing 2 mM RVC",
    "On day 1, prepare the RNA-FISH probe and proceed as for dual RNA-FISH, up to the H2O2 quenching step (step 7.2).\nCase 1, the immunofluorescence staining works after ethanol dehydration: proceed with RNA-FISH as indicated above in steps 7.3-7.9. Then proceed to step 9.6 below.\nCase 2, the immunofluorescence staining is prevented by ethanol treatment: Place the slides in a humidified chamber on a slide heater set to 65 °C and incubate for 1.5 hr in a prehybridization solution containing 50% formamide, 1x PBS, and 2 mM RVC. Drain the prehybridization solution and drop 80 µl of hybridization solution as indicated in steps 7.4 and 7.5. Then proceed with RNA-FISH hybridization and detection as indicated above in steps 7.6-7.9 (day 2 and 3).\nOn day 2, after RNA-FISH is completed, proceed with immuno-DNA-FISH starting with the unmasking step (see step 6.2). Then, follow the immuno-DNA-FISH protocol as indicated above in steps 8.2-8.6.\n10. Slide Mounting and Imaging\nPrepare the following solution before starting:\n\tHoechst 33342 at 0.5 μg/ml in 1x PBS\n\t \nStain nuclei for 10 min with DAPI or Hoechst 33342* at 0.5 µg/ml in 1x PBS for 10 min. Wash 3x 10 min with 1x PBS.\nNote *:Caution. If one of the detection systems uses a fluorescent blue dye, do not use DAPI or Hoechst. Instead, use a fluorescent DNA dyes with an emission spectra within the far-red wavelength such as Topro3.\nDrain as much liquid as possible from the slide. Drop 80 µl of mounting medium containing an antifading agent on one end of the slide. Cover the sections with a high optical quality coverslip (n°1.5 glass). Let the coverslip go down slowly by maintaining it at one end with forceps, in order to let the mounting medium spread over the section without bubbles.",
    "Seal with nail polish and store at 4 °C in a dark slide box.\nDirect observation of DNA-FISH signal of latent HSV-1 genomes requires a 40X or higher magnification oil immersion objective, with high numerical aperture (for example 40X N.A 1.1, 60X-63X N.A 1.4, 100X N.A 1.3) and an excitation light source of at least equivalent to a 100 W mercury lamp. We advise using a high-efficiency transmission microscope such as those provided by manufacturers in the last 5 years (see table of equipment). Confocal microscopy provides tools to collect images with lower background due to auto-fluorescence of the tissue, such as thin sectioning or spectral imaging.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}