{
  "id": 2754,
  "origin_website": "Cell",
  "title": "Streamlined high-throughput cloning protocol to generate arrayed mutant libraries",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThe following step-by-step method describes the workflow for creating a 96-well arrayed gene library. We recommend that you start by running the method with the small subset of test mutagenesis primer pairs (8 total) indicated in your primer output file (see Figure 1[href=https://www.wicell.org#fig1]B). These primer pairs were selected to examine efficiency of low, mid, and high GC content primers under our standard PCR conditions. The test primers can be used to identify issues and optimize conditions for your specific vector sequence (see troubleshooting[href=https://www.wicell.org#troubleshooting] section) prior to performing reactions in higher throughput. The step-by-step method can be readily scaled down for the test primer run.\nSite directed mutagenesis PCR\nTiming: 4 h\nPrepare mutagenesis primer stocks.\nResuspend the primer pairs in the original well-plate to a final concentration of 100 μM with molecular biology grade nuclease-free water.\nNote: We use a multichannel pipette and pipette the solution up and down several times to resuspend.\nPerform two 10-fold serial dilutions to generate a 1 μM working secondary stock.\nIn a PCR 96 well plate add 10 μL of primer stock to 90 μL of molecular biology grade nuclease-free water.\nPipette up and down several times to mix.\nRepeat the process in a second PCR plate to generate the final 1 μM working primer stock.\nNote: Mutagenesis primer stocks should be kept on ice at all times and stored at −20°C when not in use. We recommend minimizing the freeze-thawing of working stocks (maximum of 5 times). Handling and freeze-thawing of primary stocks should be minimized.\nNote: We recommend using multichannel pipettes with sterile filter tips throughout the following step-by-step method details[href=https://www.wicell.org#step-by-step-method-details] section.",
    "Prepare PCR master mix on ice in a sterile 15 mL falcon tube. Amounts are provided per well and per 96 reactions. Add all reagents to a sterile tube and vortex briefly to mix.\nCritical: Add reagents in the order listed within the table.\ntable:files/protocols_protocol_2266_5.csv\nAssemble the PCR reactions at ∼21°C.\nTransfer the PCR master mix to a reagent reservoir for pipetting.\nAdd 45 μL of PCR master mix to each well of a 96-well PCR plate using a multichannel pipette.\nTransfer 5 μL of mutagenesis primer working stock to individual wells (1 primer pair per reaction).\nThoroughly mix the PCR master mix and primer stock by pipetting up and down several times (without introducing air bubbles) prior to transferring into the reaction plate.\nAdhere a PCR compatible sealing film to the assembled plate.\nNote: We recommend retaining the same well position for the primer working stock plate and the PCR plate to assist in identification. We have included an example .csv template (Data S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2266-Mmc1.xlsx]) for cataloguing the identity of each well position that can also be used throughout the procedure steps (transformation, glycerol stocks, plasmid purification).\nPlace the PCR plate in the thermocycler and run under the following conditions:\ntable:files/protocols_protocol_2266_6.csv\nNote: The standard annealing temperature (55°C) is optimized for compatibility with mutagenesis primers designed using our program (Primutant). The PCR cycling conditions are slightly modified from the recommended manufacturer protocols[href=https://international.neb.com/protocols/2012/09/06/protocol-for-phusion-hot-start-flex-dna-polymerase-m0535]. We have found that longer annealing and extension times improve template amplification.",
    "Alternatives: We have found Phusion Hot Start Flex polymerase yields positive results for the majority of cloning reactions we tested (see expected outcomes[href=https://www.wicell.org#expected-outcomes]). However, for failed reactions we have found partial success with other high-fidelity polymerases such as Q5 DNA Polymerase (see troubleshooting 1[href=https://www.wicell.org#sec6.1]). We recommend using a Hot Start polymerase to allow for assembly of reactions at ∼21°C. PCR reactions can be run in PCR tube strips if required.\nPerform a DpnI digest to degrade the parent plasmid template.\nPrepare a DpnI master mix:\ntable:files/protocols_protocol_2266_7.csv\nAdd 7 μL of DpnI master mix to each PCR reaction.\nIncubate the PCR+DpnI reaction plate at 37°C for 90 min.\nHeat inactivate the DpnI by incubating the PCR+DpnI reaction plate at 80°C for 20 min.\nConfirm successful PCR amplification.\nChoose eight reactions from the PCR+DpnI reaction plate (e.g., 1 per row) and run 40 μL on a 1% agarose gel. One band corresponding to the size of the full-length vector should be observed in the presence of commercial DNA stains (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2266-Fig2.jpg\nFigure 2. Verification of amplified products following site-directed mutagenesis PCR and DpnI digestion\nSamples of selected PCR+DpnI reactions using WT pET28a-0N4R tau vector template (6,493 bp) and mutagenesis primer pairs. A sample of WT pET28a-0N4R tau (WT vector) is run for reference. The intensity of the expected full-length PCR product can vary across the plate. Note: All presented reactions except for well G7 gave rise to clones with the desired mutation.",
    "Note: The expected yield of amplified PCR products in each reaction is low (<320 ng). Therefore, a sufficient volume of the PCR reaction must be loaded on the agarose gel to be observed by your DNA stain and detection system. If a PCR product band is faint/not observed, the PCR reaction may still yield successful clones at a reduced rate.\nStore the PCR+DpnI reaction plate at −20°C until ready to proceed to the Bacterial Transformation step.\nBacterial transformation\nTiming: 2 h\nAmplified products from individual mutagenesis PCR reactions are transformed into competent E. coli cells in a 96-well plate format.\nThaw a prepared 96 deep well plate containing E. coli competent cells on ice.\nAdd 5 μL of each PCR+DpnI reaction to individual wells containing competent cells.\nNote: We recommend retaining the same well positions for samples between the PCR+DpnI reaction plate and the competent cells plate to assist in identification.\nNote: The PCR+DpnI reaction plate should be retained at −20°C in the event that the transformation step needs to be repeated.\nIncubate the competent cell plate on ice for 30 min.\nHeat shock competent cells by partially submerging the plate in a water bath at 42°C for 20 s.\nNote: The length of the heat shock step will differ if using other strains of E. coli competent cells. Follow manufacturer protocols.\nImmediately return the plate on ice and incubate for 5 min.\nAdd 700 μL of LB to each well.\nCover the deep well plate with a sealing film and incubate in bacterial shaker at 37°C for 1 h, 250 rpm.\nPellet the cells at 3,000 × g for 5 min at ∼21°C.\nRemove 600 μL of the supernatant and gently resuspend cells by pipetting solution up and down several times.",
    "Plate 8 μL spots of each cell suspension onto prepared LB agar plates containing the appropriate antibiotic.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2266-Fig3.jpg\nFigure 3. Representative results of plated colonies following bacterial transformation\n(A) A schematic demonstrating organization system for plating transformations - deep well transformation plate with highlighted wells (left) and corresponding locations of positive transformants after plating on LB agar plates (right). Created with Biorender.com[href=http://Biorender.com]\n(B) A representative example of plated transformants following overnight incubation (16–18 h). Note: the plated “transformation spots” contain separated single colonies suitable for plasmid purification.\nNote: We recommend the following organization for placement of drops on each square LB agar plate: five drops of cell suspension per reaction, two rows of reaction per plate (Figure 3[href=https://www.wicell.org#fig3]). You will need 6 LB agar plates total to plate all transformants from a full 96-well plate.\nNote: We find that square LB agar plates are optimal for arraying transformant spots. However, standard round petri dishes can also be used (8 mutants per plate, 12 plates total).\nIncubate the LB agar plates containing transformants overnight (16–18 h) at 37°C. Representative results for a plate are shown in Figure 3[href=https://www.wicell.org#fig3]B. The objective is to have spots containing multiple, single isolated colonies. If there are too many or no transformants see troubleshooting 2[href=https://www.wicell.org#sec6.3].\nPlates containing transformants can be stored at 4°C until ready to proceed to plasmid purification step or for up to 2 weeks.\nPlasmid purification\nTiming: 2 days\nIndividual colonies from transformant plates are isolated for high-throughput plasmid production and purification.\nPlace 3 mL of LB and appropriate antibiotic into each well of two X 48-deep well plates.\nUse a sterile pipette tip to pick a single colony for each of the 16 different mutagenesis attempts per LB agar plate.\nTransfer each tip into one well of the 48-deep well plate.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2266-Fig4.jpg",
    "Figure 4. Reference well position system between 96 well plates and 48 well plates used for growth of bacterial cultures for plasmid purification\nA schematic of a 96 well plate containing PCR+DpnI reactions (left) and the corresponding wells arranged in two 48 well plates, both rotated 90 degrees (right). Created with Biorender.com[href=http://Biorender.com]\nNote: We recommend arranging the well positions of each colony so that they match the organization of the original PCR-DpnI reaction plate (Figure 4[href=https://www.wicell.org#fig4]). This will also allow for easier transfer of bacteria to the 96 well format used during plasmid purification steps.\nSeal the 48- deep well plate with a breathable sealing film.\nIncubate the bacterial cell cultures at 37°C for up to 16 h, 300 rpm.\nNote: The rpm conditions listed are for an incubator shaker with a 1-inch orbit diameter. Depending on your shaker parameters, the rpm may need to be adjusted to achieve aeration required for exponential bacterial growth. Changing the rpm could also lead to cross contamination if the liquid rises too high in the wells during shaking. Thus, the volume of the culture may need to be decreased at higher rpm settings.\nCreate a glycerol stock of each culture.\nThaw a glycerol master plate to room temperature (∼21°C).\nTransfer 50 μL of each culture to individual wells of the glycerol master plate.\nFreeze the glycerol master plate.\nPellet the remaining cells in the 48-deep well plates at 3,200 × g for 10 min at ∼21°C.\nLyse the bacterial cells and centrifuge debris.\nInvert the plate to remove the supernatant without disturbing the cell pellet.\nPause point: The plate containing cell pellets (no supernatant) can be covered and stored at −20°C.\nAdd 200 μL of resuspension buffer to each well. Pipette up and down after addition to resuspend the cells.",
    "Note: Solutions for purifying plasmid DNA are provided in the MagJET Plasmid DNA Kit which is optimized for use with the KingFisher Flex/Duo instruments.\nAdd 200 μL of lysis solution and mix gently by shaking the 96 well plate on a flat surface for 4–6 times until the solution becomes viscous and slightly clear.\nLet sit for 2 min at room temperature (∼21°C).\nCritical: Do not shake the plate vigorously (shears chromosomal DNA) or allow the incubation to proceed past 2 min (denatures supercoil plasmid DNA).\nAdd 200 μL neutralization solution and mix by shaking the 96 well plate on a flat surface for 4–6 times.\nAdd 50 μL of isopropanol per well and mix by shaking the 96 well plate on a flat surface for 4–6 times.\nOnce the entire plate is processed to step 27f, centrifuge at 3,200 × g for 10 min at room temperature (∼21°C).\nCritical: Since it is difficult to achieve this timing with a 96 well plate, we recommend proceeding with steps 27b–27f for only 24 wells (3 plate columns) at a time then repeating the steps, 24 wells at a time, until the entire plate is processed (4 rounds total). For steps 27b–27f, add solutions to wells as quickly as possible and mix immediately.\nWhile the plate is centrifuging, prepare deep well plates and elution strips for processing samples via KingFisher Duo/Flex instrument according to the MagJET Plasmid DNA kit User Guide[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0012733_MagJET_Plasmid_DNA_UG.pdf].\nAdd wash 1, wash 2, and elution buffers to wells as directed.\nResuspend the MagJET Magnetic beads by vortexing and add 25 μL per well to the “Sample” plate. Add 250 μL of isopropanol to each well of the Sample plate.",
    "Slowly transfer 500 μL of cleared lysate from each well into the Sample plate. Immediately seal the plate tightly and quickly shake up and down 4–6 times by hand.\nCritical: Avoid touching the pelleted debris during transfer of lysate to the Sample plate.\nFollow the MagJET Plasmid DNA kit User Guide[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0012733_MagJET_Plasmid_DNA_UG.pdf] for placing the required plates and elution strips into the KingFisher Flex/Duo instrument. Start the appropriate Plasmid DNA isolation program.\nOnce the program is completed, transfer the eluate containing plasmid DNA to a sterile PCR plate. Cover the PCR plate with a sealing film and store at −20°C until ready to proceed with sequence verification of clones.\nNote: We use a KingFisher Duo instrument for our magnetic bead-based purification of plasmid DNA. Other commercial instruments are capable of magnetic bead processing and may be substituted if they have a compatible plasmid DNA isolation kit. Plasmid purification may also be carried out manually using magnetic plate holders plus a thermomixer (see protocol in User Guide[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0012733_MagJET_Plasmid_DNA_UG.pdf]) but it will require more active work time to process the same number of samples.\nSequence verification of mutant clones\nTiming: 2 days\nPurified plasmid is prepared for Sanger sequencing and validated for desired mutation.\nQuantify DNA concentration of purified plasmids using a nanodrop or other low volume method. If plasmid yields are low, see troubleshooting 3[href=https://www.wicell.org#sectitle0125].\nNote: We have found that the plasmid concentrations for plasmids is fairly uniform across the plate when purified using the KingFisher Duo instrument. We typically spot check DNA concentrations for 10–12 samples chosen at random across the plate.\nSequence the plasmids with primers that will provide sequence coverage across the region being mutated.",
    "Note: There are commercial services for Sanger sequencing of DNA samples in high-throughput plate format. This is typically more economical than individual reaction rates and assists in sample organization.\nValidate sequencing in batch using Benchling web-based software.\nImport your plasmid sequence into Benchling using an appropriate file format (e.g., Genbank, FASTA).\nAnnotate the sequence using the annotations tab if needed. For example, you can indicate the coding sequence, reading frame of translated protein, and the sub-regions you are mutagenizing to assist in verifying mutations.\nUse the alignments tab to align your Sanger sequence files with the plasmid sequence. We prefer uploading the .ab1 file format so that we can easily visualize chromatogram quality within the alignment. Multiple sequence files can be uploaded at the same time and analyzed in batch format.\nCheck sequence alignments.\nUse the alignment window at the bottom of the page to easily find mismatches that potentially correspond to the mutagenized codon.\nZoom in on individual sequence regions to verify the correct mutation has been created. Verify that the quality of the sequencing chromatogram supports the base calling. See troubleshooting 4[href=https://www.wicell.org#sec6.7] and 5[href=https://www.wicell.org#sec6.9] if the correct mutation cannot be verified.\nNote: We use Benchling to align sequencing results because the alignment tools are free for academic users and it is user friendly with respect to creating and analyzing batch alignments. However, any alignment program can be used.\nNote: If the sequencing result does not confirm the desired mutation, more colonies can be picked from the transformant plate for plasmid purification and sequencing."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "High Throughput Screening",
    "Sequencing",
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}