{
  "id": 9849,
  "origin_website": "Jove",
  "title": "DiOLISTIC Labeling of Neurons from Rodent and Non-human Primate Brain Slices",
  "procedures": [
    "1. Preparing DiI/Tungsten Bead Bullets: DiI (1-1'-Dioctadecyl-3,3,3',3'- tetramethylindocarbocyanine perchlorate) bullets should be prepared in advance of cutting brain slices.  The procedure takes approximately 2-4 hours depending on how many bullets are prepared at once.\nIf starting from a new batch of tungsten beads, prepare aliquots of 300 mg each. Aliquots are prepared by suspending 6 grams of tungsten in 2 ml of methylene chloride. Then, pipette 100 μl of bead solution into microfuge tubes to produce aliquots of 300 mg tungsten beads.  Store aliquots at room temperature.  (Note: methylene chloride evaporates extremely quickly.  Alcohol can also be used minimize evaporation).\nWhen starting from aliquots of beads, resuspend each aliquot (300 mg tungsten beads) in 300 μl of methylene chloride and cover quickly to prevent evaporation. This quantity is enough for 3 batches of bullets.\nPrepare dye solution by weighing 13.5 mg of lipophilic dye DiI and adding 450 μl of methylene chloride (final concentration = 3mg/100μl).  \nCoat the beads with dye. Place a glass slide on a piece of wax-coated weigh paper and pipette 100 μl of beads onto the slide.  Add 100 μl of DiI solution, mix thoroughly using pipette tip, and air dry until beads turn light grey.\nUse a razor blade to scrape beads off the glass slide and dice the beads into a fine powder.  (Note: use a new blade if doing more than one color of bullets so as to not contaminate dyes).\nScrape beads onto the weigh paper and funnel beads into a 15 ml conical tube.  Add 3 ml of water and sonicate in water bath for 10-30 min at room temperature. (Note: dicing of the powder and sonication are applied to minimize the formation of clumps of coated beads that will disrupt the sparse labeling of individual neurons).",
    "2. Preparing polyvinylpyrrolidone (PVP) solution and tubing: To improve bead attachment to the bullet tubing (TEZFEL tubing), coat it with polyvinylpyrrolidone (PVP) solution.\nPrepare 10 ml of PVP solution in water at a concentration of 10 mg PVP/ml.  \nUse a 12 ml syringe with tubing adaptor (flexible tubing with slightly larger diameter) to pass the PVP solution through the bullet tubing and then expel it out the other end. Reuse solution to coat more bullet tubing if several batches are prepared simultaneously.  Discard PVP solution after use.\nTo add the beads to the bullet tubing, vortex the beads to produce a homogenous solution and use the syringe to pull the bead solution through the tubing so that beads are evenly distributed throughout the tubing.  ((Note:) try to minimize the number of air bubbles in the tubing).\nFeed the tubing through the prep station and allow the beads to settle. Use the syringe to gently remove the water so that only the beads remain.\n Spin the tubing in the prep station and dry with nitrogen gas until water droplets are no longer visible. This step will take approximately 10-20 min.\nCut bullets with tubing cutter into 13 mm lengths and place in scintillation vials containing Drierite or some kind of anhydrous calcium sulfate.  Wrap vials in foil to protect from light.\n3. DiI Staining: This labeling technique can be used to stain neurons in brain tissue from diverse species; in this particular case, from mouse (3-6 month old) and non-human primates (9-15 years old).",
    "It is preferable that slices are prepared from fixed brain tissue obtained by transcardiac perfusion of fixative solution because tissue preservation is expected to be best under this condition. However, fixation by perfusion is not always feasible (as was the case with the monkey tissue) and DiOLISTIC labeling can still be successfully applied under different procedures for tissue preparation. Here we describe three different procedures for tissue preparation:\nFix brain by transcardiac perfusion → remove brain → postfix for 10 min → cut slice → stain \nRemove brain → cut block of tissue → fix block  → wash in PBS → cut slice → stain\nRemove brain → cut slices → fix → wash → stain\nIn the present study, the monkey brains were obtained from subjects that were transcardially perfused with ice cold artificial cerebral spinal fluid (ACSF) prior to brain harvest and a block (4 mm thick) of tissue containing the caudate and putamen was fixed for 60 min at room temperature. For all procedures, fixative solution contains 4% paraformaldehyde and 4% sucrose in PBS (prepared fresh or used within 15 days). It is important to note that fixation times are critical for successful staining. Overfixation can affect staining by disrupting the integrity of the plasma membrane and causing dye to leak out of the cell (see more information under results).",
    "For procedure a and b, slices (200μm) are cut from fixed brain or tissue block and slices placed in 24-well plate with PBS.  For procedure c, fresh acute brain slices (200 μm) are cut with a vibratome in cold cutting solution containing (in mM) 110 Choline-Cl, 25 NaHCO3, 1.25 NaH2PO4, 2.5 KCl, 0.5 CaCl2 , 7 MgCl2, 25 glucose, 11.6 ascorbic acid, 3.1 pyruvic acid (osmolarity = 310 mOsmols) and immediately after slices are placed in 24-well plates and fixed for 30 min with fixative solution at room temperature.\nWash the slices with PBS, 3 times.\nBefore shooting slices, remove the PBS from the wells and, using a paintbrush, place the slice in the center of the well.  \nShoot DiI bullets through 3.0 μm filter paper using a Helios Gene Gun system at 120-180 psi helium gas pressure by placing the gun at a distance of 1.5 cm between the sample and the end of the barrel.(Important note: Only neurons within 50 mm of the slice surface will be labeled by this method so it is important to keep the same side of the slice facing up during the washes and for mounting. In this way, you will make sure that the labeled neurons will be within focal distance when imaging with a confocal microscope).\nWash slices with PBS 3 times and store them in PBS for several hours to allow the DiI to spread along the dendrites.      \nMount slices onto a glass slide with ProLong Gold Antifade and cover with an 18X18 mm No.1 coverslip.  (Note: for procedure c, it is best to mount slices on the same day as the integrity of the slices is not well maintained overnight).  \nSeal with clear nail polish after mounting media has dried.",
    "Alternatively, the slices can be stained with antibodies before mounting as described below.(Note: Slides can be used at least 6 months to a year if stored in the dark at 4°C.  DiI is light sensitive and long-term exposure to light will cause the stain to fade).\n4. Antibody Staining:  Immunostaining should be performed after step 3.4 and before mounting.\nPermeabilization:  Incubate slices in 0.01% Triton X-100 in PBS solution for 15 min at room temperature (300-500 μl per well).NOTE:  Do not use higher concentrations of detergent as this will dissolve DiI and significantly reduce the fluorescent staining. Try to minimize the time in detergent as extensive incubations will also reduce the DiI labeling. If extended incubations are necessary, keep slices in PBS rather than in blocking solution.\nBlocking:  Incubate slices in blocking solution containing 10% goat serum, 0.01% Triton X-100 in PBS for 30 min at room temperature.\n Primary antibody:  Add antibody at the desired dilution in blocking solution (e.g. rabbit anti-GFP antibody at 1:1000 dilution). Add 300-500 μl per well and incubate for 1-2 hrs. (Note:  if overnight incubations are necessary, remove detergent from blocking solution).\nWash slices with PBS for 5 - 15 min, 3 times.\nSecondary antibody:  Incubate with secondary antibody for 30 min at room temperature.   Prepare secondary antibody solution at desired dilution in blocking solution (e.g. Alexa-Fluor 488 conjugated antibody at 1:1000 dilution).\nWash slices with PBS for 5-15 min, 4 times.\nMount slices on slides with ProLong Gold Antifade and cover with an 18x18 mm No.1 coverslip.  Seal with nail polish after mounting media has dried.\n5. Representative Results:",
    "Checking for correct labeling: Section can be visualized under a fluorescent dissecting scope equipped with a mercury lamp and red fluorescent filter cube to confirm successful DiOLISTIC labeling. Figure 1 shows exemplary images of nicely labeled brain sections obtained at low magnification. Two important characteristics to look for are a sparse labeling pattern (Figure 1A) and the ability to identify individual cellular components (Figure 1B-C). \nTroubleshooting DiOLISTIC labeling: Figure 2 shows examples of sections in which the DiOLISTIC labeling worked incorrectly. In our experience, there are three main causes for inefficient labeling:\n    \nLabeling is too sparse or dense: Very few cells are labeled per section in one case or too many cells are labeled preventing the isolation and study of single cellular elements. Solution: adjust the concentration of coated beads in the final solution used for coating the TEFZEL bullet tubing (section 1.6).  Decrease or increase the volume of water (3 ml initial value) used to dissolve the beads in order to correct for too sparse or too dense labeling, respectively. In addition, low efficiency of labeling might be caused by less than optimal gas pressure when shooting the coated beads onto the sections. This possibility can be ruled out by making sure that the TEFZEL bullet tubing has released most of the coated beads and it appears clear after shooting. Otherwise, gas pressure for shooting should be increased.\nBad bullets: large clumps or clusters of dye-coated tungsten beads are formed during the bullet preparation. Sections will resemble examples in Figure 2A-B. Solution: make new bullets paying particular attention to section 1.5 and/or extend sonication time in section 1.6.",
    "Over-fixation: tissue is kept in paraformaldehyde solution for longer than the optimally required time for fixing (30 minutes for 200-300 μm sections, 1 hour for 4 mm sections). This compromises the integrity of the plasma membrane and produces labeled sections that look like those shown in Figure 2C-D in which labeling seems out of focus due to dispersion of dye out of the cells.  Solution: reduce fixation time.\nConfocal imaging: Image stacks are acquired using a confocal microscope (Zeiss LSM 510 META) with a 20x objective for the whole cell and 63x water immersion objective for dendrite segments. DiI was excited using a DPS 561 nm laser line and green fluorescence from the secondary antibody was excited using a 488 nm laser line. The optical sectioning of the labeled sample achieved when using confocal microscopy further allows for isolation of single labeled cells in the sample. Figure 3A shows a striatal medium spiny neuron from mouse brain and its complex dendrite branch pattern. High magnification images of dendrite branches of these neurons from rodent (Figure 3B) and non-human primate (Figure 3C) demonstrate the degree of staining in dendrites and dendritic spines using this technique in both species. Dendrites and their protrusions (spines) appear well defined, even when considering the long, thin spine heads so abundant in medium spiny neurons.When combining DiOLISTICS with immunostaining, confocal imaging is also helpful in unequivocally localizing the stain to the same focal plane and the same cell. Figure 4 shows an example of colocalization of DiI labeling and immunostaining for GFP in a single cell. The image is one stack (0.7 μm z-section) obtained from a striatal slice from a transgenic mouse expressing the fluorescent protein GFP under the D1 dopamine receptor promoter.",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/2081/2081fig1.jpgFigure 1. DiI labeling of neurons in brain slices from non-human primates.  (A) Low magnification image of a stained brain slice containing the caudate nucleus from a cynomolgus monkey that shows sparse labeling of neurons with DiI.  (B-C) Isolated medium spiny neurons can be easily identified using a fluorescent dissecting scope.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2081/2081fig2.jpgFigure 2. Troubleshooting DiOLISTIC labeling. (A-B) Stained slices from dorsal striatum of monkey (A) and mouse (B) showing large clumps of dye-coated beads and as a consequence, no individual cellular elements can be distinguished. (C-D) Images that exemplify the result of applying DiOLISTIC labeling to sections that were kept in fixative solution for prolonged periods of time or where tissue preservation failed in monkey (C) and mouse (D) tissue.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2081/2081fig3.jpgFigure 3. Confocal image of striatal medium spiny neuron stained with DiI. (A), Image stack of a whole cell allows for morphological analysis of the dendritic branches.  (B-C) Dendrite segments from mouse (B) and monkey (C) medium spiny neurons show clear labeling of dendrite and spines.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2081/2081fig4.jpgFigure 4. Combining DiOLISTIC labeling with immunostaining. (A) DiI labeled medium spiny neuron from striatum of BAC transgenic mouse expressing GFP under the D1 dopamine receptor promoter. (B) Immunostaining using anti-GFP antibody as described by methods adapted from Lee et al. (2006). Same field as A. (C) Composite image of red and green fluorescence identifies DiI-labeled neuron as a GFP-positive neuron."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}