{
  "id": 5728,
  "origin_website": "Bio",
  "title": "TUNEL Assay to Assess Extent of DNA Fragmentation and Programmed  Cell Death in Root Cells under Various Stress Conditions",
  "procedures": [
    "Note: The steps mentioned below have been described for carrying out in situ TUNEL assay in samples obtained from root tissue of 1-4 weeks old rice (Oryza sativa cv. IR64) seedlings. For root tissue from rice plants older than 4 weeks, or for those from other herbaceous plant species, the volume of the vessels and reagents can be adjusted accordingly. Germination of seeds, growth conditions and processing of samplesSeeds may be germinated in hydroponic system, or in vermiculite or on solid medium. For rice, the suggested growth conditions are 28 ± 2 °C and 16 h/8 h photoperiod (Tripathi et al., 2015). After growth for desired number of days (for example, 15 days), root tissue should be separated from the seedling by cutting using razor blades. FixationFix root samples from the plants in which DNA fragmentation and PCD have to be assessed by incubating roots in fixative buffer for 16 h at 4 °C. Ensure that the roots are completely immersed in the fixing solution. Fixation may be performed in 50 ml tubes with their caps closed properly.Note: Fixative buffer contains paraformaldehyde–a bronchial, eye and skin irritant. Please see Note regarding preparation and disposal of the fixative buffer in the Recipes section.Wash the fixed roots with absolute ethanol (by adding absolute ethanol and gentle shaking for 10-15 sec) twice at room temperature. After washing, incubate the root samples in 70% ethanol for 24 h at 4 °C. Decant the solution (see Note 1).Incubate the samples in 1x PBS (see Recipes) for 20 min at room temperature. Remove the solution and repeat this step thrice with fresh PBS to completely remove traces of ethanol.PermeabilizationTake out the root sample from the PBS solution and incubate the sample in 100 mM sodium citrate buffer (pH 6.",
    "0) (see Recipes) in a fresh tube for 15 min at room temperature.Subject root samples immersed in the sodium citrate buffer to microwave (350 W) for a duration of 30-60 sec depending on the thickness of the root tissue. For subjecting samples to microwave radiation, the root samples may be placed in 200 ml microwave-safe glass beakers. The volume of citrate buffer in these beakers should be sufficient enough to ensure complete immersion of the samples. For root samples obtained from 1-2 week-old rice seedlings, buffer volume of 100 ml is usually sufficient. Cool the samples rapidly by adding equal volume of distilled water. Remove the solution and incubate the samples in permeabilization solution (see Recipes) at 37 °C for 30 min in water bath with intermittent shaking.To digest the proteins, add DNase-free Proteinase K (see Recipes) to a final concentration of 20 µg/ml followed by incubation at 37 °C for 30 min in a water bath with intermittent shaking. Remove the solution and wash the root samples thrice with 1x PBS at room temperature.TUNEL reactionFor in situ TUNEL assay, cut root samples approximately 1 cm length from the root tip using sharp razor blades and glass plates. Collect the cut root tips in microcentrifuge tubes (2 ml), one tube for each of the samples. TUNEL reaction can now be performed in these tubes.Note: While cutting the root samples, avoid mechanical damage, for that reason the razor blades should be sharp.Prepare TUNEL reaction mix (see Recipes) and add 110 µl of the mix (see Note 2 below) to each of the microcentrifuge tubes. The reaction should be carried out at 37 °C for 1 h. The microcentrifuge tubes should be covered with aluminum foil so as to avoid exposure to light.",
    "Note: The step C2 should be carried out immediately after C1.Stop the reaction by adding 1 ml of 2x saline-sodium citrate (2x SSC) buffer (pH 7.0, see Recipes). Remove 2x SSC solution and stain root tips with propidium iodide by addition of 100 μl of 1 μg/ml of propidium iodide solution (final concentration, see Recipes) and incubation at 37 °C for 10 min. Remove the PI solution and wash thrice with 1x PBS.Note: The microcentrifuge tubes should be covered with aluminum foil so as to avoid exposure to light.Mount the root tips onto slides with an Antifade mounting reagent. For this piece of study, we have used ProLong® Gold Antifade reagent with DAPI (Thermo Fisher Scientific, USA). Visualize the slides under a confocal microscope using 405 nm- (for DAPI) and 488 nm- (for PI and fluorescein) -lasers, as applicable, and channel settings based on emission range of the respective dyes. Representative images have been shown in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170815/20170815004349_4112.jpgFigure 1. Micrographs showing salt stress-treated rice root tissue subjected to TUNEL assay to assess in situ DNA fragmentation. Root tissue from 15-day old rice seedlings was subjected to salinity stress (200 mM NaCl) for 60 h followed by TUNEL assay as per the protocol described above. F: Fluorescein (green), PI: Propidium Iodide (red), DAPI: 4’,6-diamidino-2-phenylindole (blue). Samples were mounted on slides in a mountant (ProLong® Gold Antifade with DAPI, Thermo Fisher Scientific) and the slides were examined under Nikon A1R (Nikon, Japan) confocal microscope using a 20x objective. NIS Elements AR software (Nikon, Japan) was used to acquire and process the images. DAPI and PI were used to stain DNA (both damaged and undamaged). Fluorescein fluorescence (green) is due to incorporation of fluorescein-12-dUTP during the TUNEL reaction and would correspond to the number of free DNA ends. Scale bars = 100 µm."
  ],
  "subjectAreas": [
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}