{
  "id": 12085,
  "origin_website": "Jove",
  "title": "Spatial and Temporal Control of Murine Melanoma Initiation from Mutant Melanocyte Stem Cells",
  "procedures": [
    "All animal procedures are performed in accordance with Cornell University Institutional Animal Care and Use Committee (IACUC).\n1. Preparation\nCollect tail clips from 12 day postnatal mice and digest in 400 µL of 0.05 N NaOH at 95 °C for 1 h. Vortex and add 32 µL of 1 M Tris-HCl, pH 7. Genotype mice according to PCR protocols provided through the Jackson Laboratory and identify mice with genotype of interest6.\n\t- Tyr-CreER – hemizygous (+/CreER)\n\t- LSL-BrafV600E – heterozygous (+/LSL-V600E)\n\t- Pten – homozygous flox (flox/flox)\n\t- LSL-tdTomato – hemizygous (+/LSL-tdTomato)\nNOTE: Primer sequences are provided in Table of Materials.\nUse a hair clipper (electric trimmer) to shave the dorsal skin 2 to 3 days before all experiments described below, and when mice are approximately 7 weeks of age. Take care not to damage the thin mouse skin using the electric trimmer as any injury may elicit a wound healing response which will activate hair follicle stem cells, including MCSCs.\nDetermine if the hair cycle is in telogen and whether the skin is wounded during the waiting period. If the skin shows any sign of injury, the mouse should not be used for these procedures.\nNOTE: Although the hair cycle may slightly differ between genetic backgrounds, at this age the hair cycle in the dorsal skin is usually in the telogen state11. The Tyr-CreER transgene will target MCSCs in telogen skin, and the subsequent genetic alterations will be permanently expressed in all lineages of the MCSC, including differentiated melanocytes and melanocytic tumors.\n2. Tamoxifen Treatment for Cre-Lox genetic Recombination\nPreparation of tamoxifen for intraperitoneal injection (IP) or topical administration for systemic or localized genetic recombination",
    "NOTE: In order for tamoxifen to induce recombination, it must first be metabolized by the liver to 4-hydroxytamoxifen (4-OHT), which can bind to and activate the CreER. Topical application of tamoxifen will not be metabolized in this way and 4-OHT must directly be used. Only one method of tamoxifen delivery is required for sufficient recombination.\n\t\nTamoxifen: Prepare tamoxifen at a concentration of 10 mg mL-1 dissolved in corn oil. To aid in the dissolution of the drug into solution, add up to 10% total volume of 100% molecular grade ethanol to the drug in powder form, vortex for 3 min and then add remaining volume of corn oil. Continue to vortex until crystalline material is no longer apparent in solution. Tamoxifen solution can be sterilized by passing through a 0.2 µm filter. Proceed to step 2.2.1 for treatment.\n4-OHT: Prepare a stock solution of hydroxytamoxifen up to 3 mg mL-1 in 100% ethanol. Then, a working solution can be applied as much as needed to cover the skin area of interest (generally a single application).\nNOTE: A stock solution of hydroxytamoxifen can be dissolved in 100% ethanol for a final concentration of 5 mM. Then, to prepare a working solution, 5 µL of 4OH-tamoxifen stock solution can be diluted into 15 µL of 100% ethanol. For 4 mm2 area, 1 to 3 µL of working solution can be topically applied.\nTreating mice with tamoxifen either systemically or topically \nFor systemic treatment, administer 2 mg of tamoxifen via IP injection once daily for 3 days using a 26 G needle.\nNOTE: Using this model, approximately 93% ± 4% of quiescent MCSCs are labeled with tdTomato6.",
    "For regional activation, perform one topical treatment with 4-OHT. Cover the skin area of interest with the working solution. The amount of working solution can be determined by the size of region of interest as described in step 2.1.2.\nAt 48 h following the last dose of tamoxifen, proceed to step 3 for chemical depilation induced tumor initiation or to step 4 for UV-B induced tumor initiation\n3. Chemical Depilation\nEquip a mouse treatment room containing an isoflurane system with the following required materials: hair removal cream, cottons swabs, paper cloth, and water.\nPlace the mouse into the induction chamber and anesthetize with 3.5 to 4.5% isoflurane and 1 L/min oxygen.\nOnce the respiratory rate has stabilized, confirm that the mouse is in the proper plane of anesthesia by performing a toe pinch and transfer the mouse to the main tube maintaining anesthesia with 1 to 1.5% isoflurane and 1 L/min oxygen. Apply eye ointment to keep the eyes from drying while under anesthesia.\nUse a cotton swab to apply a thin layer of hair removal cream to the shaved region of the mouse skin.\nOnce the cream has been evenly applied, use clean cotton swabs to begin removal. The total time that the cream is in contact with the skin should not exceed 1 min.\nGently wipe the skin with a damp paper cloth and ensure that any residual cream has been removed.",
    "NOTE: Hair removal cream can cause irritation to the skin if it is not completely removed. Some mice, such as those on a C57BL/6 background, can be prone to developing dermatitis12. Although rare, some animals will develop dermatitis within 24 h after hair removal cream application or mechanical depilation. Make sure to check the mice the day after treatment to look for any signs of regional skin irritation.\nDiscard the removed hair shafts and any materials used into a biohazard bin.\nPlace the mouse into an empty, clean mouse cage until the anesthesia has worn off.\nReturn the mice to their cages.\n4. UV-B Irradiation\nEquip a mouse treatment room containing an isoflurane system with the following required materials: UV-B light system, UV-B light meter, protective covering for the mouse, additional UV-B protective PPE for researcher, and a timer.\nMice should be irradiated at the UV-B dose of interest (i.e., 0-180 mJ/cm2). Use the UV-B light meter to determine the appropriate length of time to irradiate the mice.\nNOTE: mW/cm2 x time = dose\nAnesthetize the mouse with isoflurane. While in the induction chamber, use 3.5 to 4.5% isoflurane and 1 L/min oxygen.\nOnce the mouse is stabilized, confirm anesthesia effects with a toe pinch and transfer the mouse to the main anesthesia tube located in UV chamber. Apply eye ointment to prevent the eyes from drying while under anesthesia. Maintain anesthesia with 1 to 1.5% isoflurane and 1 L/min oxygen.\nCover the dorsal skin with UV-B protective material so that only the desired region will be exposed.\nNOTE: At this time, appropriate PPE should be utilized. The length of time needed to irradiate the mouse is dependent on the intensity of the light bulb used, but anesthesia may need to be monitored if the required time exceeds 30 s.",
    "Cover the UV chamber using UV-resistant lid or any other suitable materials.\nTurn on the UV-B lamp and irradiate the mouse for the time determined by researchers for the specific aim.\nTurn off the UV system and isoflurane, then place the mouse to an empty mouse cage until the anesthesia has worn off.\nReturn the mice to their cages.\n5. Tissue Processing\nSkin isolation\nObtain the following prior to starting: necropsy instruments, filter paper and paper towels.\nEuthanize the mice according to IACUC approved protocols, and confirm death prior to proceeding.\nUsing a hair clipper, shave any hair from the dorsal skin area. Lightly brush the area with a lint free tissue to clear the area.\nMake a small incision with sharp scissors just above the base of the tail.\nInsert large blunt scissors into the incision and separate the subdermal connective tissues.\nCarefully isolate the skin region of interest by cutting with sharp scissors along the edge of the tissue.\nPlace the skin tissue onto a clean paper towel and use dull forceps to stretch the skin so that it adheres to the towel and is taught. This step serves to provide additional support for the tissue so that it can be manipulated and processed while maintaining its shape.\nNOTE: Be careful to only handle the outside regions of the skin tissue, as the forceps may cause damage to the skin which can be seen histologically.\nTissue fixation",
    "Fold a piece of filter paper in half and label appropriately. Place the skin along with paper towel backing into the folded paper immediately adjacent to the crease, ensuring that the sample is smooth and not folded or crumpled. Seal the filter paper by stapling the open sides, and then trim so that the remaining paper can be used for future samples.\nNOTE: This step is performed so that the skin retains its shape during fixation.\nFully submerge the tissue sample in 10% neutral buffered formalin for 3 to 5 h at room temperature or overnight at 4 °C.\nFollowing fixation, remove the samples from formalin, wash in deionized water (2x, 5 min each) and proceed to make tissue blocks. Carefully remove any residual material from the skin tissue (i.e., residual paper).\nMaking frozen tissue blocks (Figure 1)\nTrim the edges of the skin sample so that they are not jagged and then make 3 sagittal cuts. The width of these strips should not be more than the height of the cryomold (5 mm). Next, make transverse cuts to have pieces of skin which are not longer than the width of the cryomold (20 mm) and can be embedded. Repeat with the remaining half of dorsal skin, or save the tissue for other uses (alternately, save half prior to fixation).\nNOTE: It’s important to keep skin pieces in proper orientation.",
    "Orient the cryomold (25 x 20 x 5 mm3) in a portrait orientation and place 4 to 5 pieces of skin on top of the OCT. Once all pieces are in place, use 2 pairs of fine forceps to bring the long edge of skin to the bottom of the cryomold. Skin should now be standing up in the OCT perpendicular to the base of the mold. Take care to minimize formation of air pockets within the OCT during this step (Figure 1).\nFill the mold with OCT to the second lip, and place on the flat surface of dry ice. Use forceps to adjust any skin pieces that may have shifted during transfer as the block begins to freeze. Once the bottom layer is solidified, manipulation of tissues will be impossible.\nCut 8-10 µm slides for analysis.\nMaking Formalin Fixed Paraffin Embedded (FFPE) tissue blocks\nPlace 2 pieces of fixed skin into a labeled cassette and dehydrate in increasing concentrations of ethanol (75% ethanol for 30 min, 85% for 30 min, 90% for 30 min, 95% for 30 min, 100% for 2x 30 min, Xylene or xylene substitute for 2x 30 min). Incubate with Paraffin at 58-60˚, first for 30 min, and then overnight.\nEmbed the tissue in a 24 x 24 mm2 stainless steel tissue mold with liquid paraffin and solidify at -5 °C. The tissue orientation should be similar to that of frozen tissue blocks so that longitudinal sections across multiple hair follicles can be visualized (Figure 1).\nOnce the paraffin has solidified, remove the mold and cut into 5-10 μm sections for analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}