{
  "id": 7924,
  "origin_website": "Bio",
  "title": "Measuring Myeloperoxidase Activity as a Marker of Inflammation in Gut Tissue Samples of Mice and Rat",
  "procedures": [
    "Tissue collection Euthanize the mouse by cervical dislocation. Alternatively, a different humane method of euthanasia such as carbon dioxide inhalation can be used.Carefully open the abdominal cavity without damaging the intestines by making a midline incision.Remove ±3 cm of the relevant part of the gastrointestinal tract of the abdominal cavity, place it in a Petri dish containing ice-cold DPBS solution, and flush with a gavage needle attached to a 5 mL syringe containing DPBS to remove the luminal content. Alternatively, fecal material can be removed by gently squeezing the intestines with a pair of tweezers.Clean the gut tissue by removing any remaining mesenteric fat and then cut open the intestines along the mesenteric border.Collect a representative tissue sample (0.5 cm × 0.5 cm; ± 20–30 mg), dry it on a paper towel, weigh it, place it in a cryovial, and subsequently freeze the specimen in liquid nitrogen. To remain unbiased, it is good practice to always collect samples in the same region of the gastrointestinal tract (i.e., always take the most distal or proximal part of the colon). Examples of tissue samples of correct size are shown in Figure 1.After collection of all mouse samples, store them at -80 °C until further experiments are performed.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4758/bioprotoc-13-13-4758-g001.jpgFigure 1. Gut tissue samples of an appropriate size for the myeloperoxidase (MPO) assay. The exact size depends on the animal species and inflammatory state of the tissue. From left to right, representative samples of distal colon (25 mg), proximal colon (27 mg), ileum (22 mg), and glandular stomach (22 mg) of a healthy C57BL/6J mouse are shown.Tissue homogenization Take the tissue samples from the freezer, transfer them to Precellys® tubes, and place these on ice.",
    "When labeling the Precellys® tubes, place the identifier on the side of the tube since the homogenization procedure can make identifiers written on the cap illegible.Use a pipette to add 0.02 mL/mg tissue of homogenization buffer (Recipe 2) to the samples.Place the tubes in the homogenizer and dissociate the tissue samples (6,000 rpm; 20 s shaking > 20 s break > 20 s shaking > 60 s break).Place the tubes on ice and wait for 30 min to allow for the foam, which is formed during the homogenization, to disappear.Centrifuge the samples (18,000× g for 15 min at 4 °C).Use a pipette to collect the supernatant in 1.5 mL Eppendorf tubes and place these on ice. The pellet can be discarded.Myeloperoxidase activity assay Start the UV/Vis spectrometer and specify the necessary settings:Measurements are kinetic.Absorbance is measured at a wavelength of 460 nm (bandwidth 2.0 nm).The change in absorbance is measured during the first 60 s after the start of the chemical reaction.Open the lid of the spectrophotometer and place a 3 mL cuvette in the cuvette holder of the device. Pay attention to the correct orientation of the cuvette, i.e., with the clear windows in line with the light source and detector.Use a pipette to add 2,900 μL of assay reagent (Recipe 3) to the cuvette.Use a pipette to add 100 μL of sample supernatant to the cuvette, mix the sample by repetitive pipetting (5–10 times using a pipette set at 2 mL), close the lid of the spectrophotometer, and then promptly start the spectrophotometric measurement.After the 60-second measurement, note the absolute absorption values at 0 and 60 s in Excel.Replace the cuvette by a clean one and repeat the procedure for the other samples. Ideally, the assay is performed in duplo or in triplo."
  ],
  "subjectAreas": [
    "Immunology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}