{
  "id": 9989,
  "origin_website": "Jove",
  "title": "Dissection and Isolation of Region-Specific Decellularized Lung Tissue",
  "procedures": [
    "All animal studies have been performed in accordance with the IACUC of University of Vermont (UVM). All human lungs were acquired from UVM Autopsy Services and related studies were performed as per the guidelines of IRB of UVM.\nNOTE: Decellularization of pig and human lungs has been previously described by our group7,8,9,10, 21. In brief, whole lung lobes are decellularized through sequential perfusion of the airways and vasculature with a series of 2 L detergent and enzyme solutions using a peristaltic pump: 0.1% Triton-X 100, 2% sodium deoxycholate, 1 M sodium chloride, 30 µg/mL DNase/1.3 mM MgSO4/2 mM CaCl2, 0.1% peracetic acid/4% ethanol, and a deionized water wash. Standard methods for confirming efficient decellularization include the determination of <50 ng/mg residual double-stranded DNA within decellularized lungs and the absence of DNA fragments by gel electrophoresis, and nuclear staining by hematoxylin and eosin (H&E) staining9,21.\n1. Setup\nGather all necessary equipment required for the dissection procedure, including a glass casserole dish, two pairs of surgical tweezers, one pair of forceps, and one pair of surgical scissors, and autoclave before use.\nObtain a section of the lung, place it in the glass casserole dish, and orient it so that the superior end of the airway can be seen clearly.\nIdentify the proximal end of the vasculature and keep it intact until later steps. The end of the vasculature should be clearly visible and entirely opaque white in color.\nUsing a pair of tweezers and surgical scissors, remove any pleura that may be lining the exterior of the lung and discard.\n2. Exposing the airway\nUsing a spreading technique with the surgical scissors, gently work to expose the additional airway.",
    "Locate the largest airway, which will typically have a diameter of approximately 2-4 cm. Another way to identify an airway is through the observation of cartilage rings, which can be detected visually or via palpation of the tissue.\nUsing a pair of forceps, palpate down the length of the airway in order to determine the location of the unseen airway to a depth of approximately 1 in.\n\t\tNOTE: Being lined with cartilage rings, the airway is characteristically harder than the other lung tissues. As such, finding and palpating the unseen airway should be relatively simple.\nHolding the surgical scissors parallel to the airway, insert the closed tips into the tissue directly surrounding the unseen airway.\nSlowly open the surgical scissors to gently pull apart the surrounding membrane. Subsequently, remove the surgical scissors and avoid cutting any tissue whatsoever.\nRepeat this process intermittently throughout the dissection procedure to continue exposing the airway.\nUsing the surgical scissors, cut the airway at the branching points and dissect along either branch independently.\n\tNOTE: A branching point is a location at which one airway splits into two separate airways.\nSever regions of the airway once confident that the intact ends will remain identifiable and easily located for further dissection.\nPlace severed regions of the airway into the corresponding tube. The size of the severed regions will vary depending on the sample but, in general, will range between 1-5 cm in length. The width varies based on the relative location along the airway tree, with the distal regions maintaining smaller widths than the more proximal regions.\n3. Exposing and excising regions of the vasculature\nApply gentle pressure to the vasculature and slowly pull away from the airway. Allow the vasculature to stretch slightly and use surgical scissors to further separate the vasculature from the airway.",
    "NOTE: Too much pressure will rip the vasculature. If the vasculature rips, simply place that section of vasculature in the corresponding labeled tube and identify its intact end.\nWhen a branching point in the vascular tree has been exposed, use surgical scissors and tweezers to expose more inferior regions of the vasculature.\n\t\nBegin by inserting the closed tips of the surgical scissors just below a branching point and between the two corresponding vasculature regions.\nSlowly open the scissors to spread apart the underlying tissues.\nIntermittently, use a pair of tweezers to remove the tissue that was spread apart using the surgical scissors, as well as any other tissue directly surrounding the vasculature.\nWhen the vasculature is covering regions of the airway or becoming cumbersome to any step in the dissection procedure, cut the vasculature at a branching point and further dissect along either branch independently.\nSever regions of the vasculature once confident that the intact ends will remain identifiable and easily located for further dissection.\n4. Identifying and excising alveolar tissue\nUsing a pair of forceps or tweezers, pinch and then gently tear away small regions of alveolar tissue.\n\t\nLocate a region of tissue that is not in the direct vicinity of the airway or the vasculature.\nUsing the tweezers, pinch a small region of the tissue that appears to be devoid of any vasculature or airway.\nTear the pinched region of the tissue from the lung.\nObserve the region of tissue removed and confirm whether or not it is alveolar tissue.\n\tNOTE: Alveolar tissue is present throughout the lung, so it can and should be removed throughout the dissection procedure. Any tissue that cannot easily be identified as primarily alveoli, vasculature, or airway should be categorized as bulk tissue and placed in the corresponding labeled tube.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}