{
  "id": 18818,
  "origin_website": "Jove",
  "title": "3D-Neuronavigation In Vivo Through a Patient's Brain During a Spontaneous Migraine Headache",
  "procedures": [
    "The study should be approved by the local Institutional Review Board, and by the Radioactive Drug Research Committee. The research subject gives written informed consent to participate in the study. The protocol is divided into three chronological steps:\nMRI session\nPET session during the ictal phase (headache) of migraine\nPET session during the interictal phase (no headache) of migraine\nThe patient is responsible for filling out a headache diary, and for confirming with the research group the occurrence of a migraine attack on the day of imaging session. Both, interictal and ictal, PET scans should be scheduled during separate mid-late follicular phases of the patient (5 to 10 days after the first day of menstrual bleeding), which in this case was tracked and calculated in advance by a gynecologist with expertise in the field (Y.R.S.).\n1. MRI Session\nPreparing for the Experiment\n\t\nPrior to preparing the subject for the scan, it is necessary to follow proper safety instructions due to the magnetic field of the MR scanner. All study personnel must be metal-free before entering the MR procedure room.\nProvide a copy of the Informed Consent Form, previously signed by the research volunteer during initial screening, to the MR technologist.\nPreparing the Subject for the Scan\n\t\nOn the day of the MRI, ask the research subject to fill out a MRI safety screening form. This form is required for any MRI taken at the University of Michigan – fMRI lab. The questionnaire reinforces that the subject is also metal-free and does not have a medical condition that requires careful and special consideration (e.g., metallic foreign fragments, implanted mechanical/electrical device).\nReassure that the participant understands the MR procedure, risks and benefits.\nDeliver the completed screening form to the MR technologist who will be assisting in the procedure.",
    "Acquire a T1-weighted anatomical MRI scan during an interictal phase for the patient on a 3 Tesla scanner.\n\t\nUse the following sequence parameters for the MRI acquisition:\n\t\t\nA. Axial spoiled-gradient recalled (SPGR) 3D acquisition\nB. Bandwith = 15.63\nC. Repetition time [TR] = 9.2 msec\nD. Echo time [TE] = 1.9 msec\nE. Inversion recovery preparation 500 msec\nF. Flip angle = 15°\nG. 25/26 FOV\nH. Number of Excitations [NEX] = 1\nI. 144 contiguous slices\nJ. 1.0 mm slice thickness\nK. 256 x 256 matrix\n2. Ictal PET Session\nPreparing for the Experiment\n\t\nPrior to confirming the scan at the University Hospital, contact the subject to verify in which phase of the menstrual cycle she will be on the day of the scan. It is recommended to perform a PET scan during mid-late follicular phase (5 to 10 days following menstrual bleeding onset).\nSubmit a request to the hospital to produce [11C]carfentanil, a short-life radiotracer with a selective affinity for µ-opioid receptors, using a cyclotron in the vicinity of the scan. The tracer must be produced 2 hr before the scan.\nOn the day of the potential ictal PET scan, contact the subject 2 hr before the appointment to confirm the presence of a spontaneous migraine attack. If a migraine attack is present, validate the migraine diagnosis following the International Classification of Headache Disorders. After diagnosis, assure that the participant is able to safely get to the hospital to undergo the scan. Provide transportation if the subject is not comfortable driving or if no designated driver is available.\nPreparing the Subject for the Scan",
    "When the participant arrives in the hospital, escort her to the PET suite for revalidation of diagnosis based on the International Classification of Headache Disorders. Prior to the scan, perform a urine drug test to confirm that the subject did not intake any substance that could interact with the tracer [11C]carfentanil, followed by an urine pregnancy test.\nReaffirm that the participant understands the PET procedure, risks, and benefits.\nDeliver a copy of the Informed Consent Form, previously signed by the research volunteer during the initial screening, to the Nuclear Medicine technologist.\nFollowing the guidance of the Nuclear Medicine technologist, help the subject settle into the scanner.\nHave the subject undergo 1 90 min PET scan using a Siemens HR+ scanner in 3D mode (reconstructed images have a full-width at half maximum (FWHM) resolution of ~5.5 mm-in-plane and 5.0 mm axially).\nFor each [11C]carfentanil dose (555 MBq ≤ 0.03 μg/kg), administer fifty percent as a bolus with the remainder continuously infused over the course of the scan to achieve steady-state tracer levels approximately 35 min after tracer administration.\nInterictal PET session.\nRepeat Steps 2.2 - 2.6 during non-headache phase.\n3. PET Data Reconstruction\nReconstruct PET images using interactive algorithms into a 128 x 128 pixel matrix in a 28.8 cm diameter field of view (FOV).\nAcquire 21 image frames and co-register to one another to correct for motion during the scan.\nObtain a 6 min transmission (68Ge source) scan prior to the PET scan for the purposes of attenuation correction.\nConvert the dynamic image data for each scan on a voxel-by-voxel basis into two sets of parametric images (10 - 40 min):\n\t\nUse a tracer transport measure (K1 ratio) for coregistration and normalization procedures; and\nUse a receptor-related measure, BPND, proportional to Bmax (receptor concentration) to divide by Kd (receptor affinity).",
    "Estimate these measures by using the reference region-based Logan graphical analysis with the occipital cortex as the reference region12.\n4. PET Data Analysis\nNOTE: Anatomically standardize images into template space using Statistical Parametric Mapping (SPM8) software following the sequence below.\nCo-register the MR scan and K1 scans.\nNormalize the MR scan to the Montreal Neurologic Institute (MNI) template brain using DARTEL.\nApply the resulting deformation matrix to the PET images.\nVerify co-registration and normalization accuracy by comparing the transformed MR and PET images to the MNI atlas template.\nRegion of Interest (ROI) analysis.\nExamine the activity of several bilateral regions that are engaged during the processing of pain, including:\nA. Anterior/medial/posterior cingulate\nB. Insula\nC. Hippocampus\nD. Amygdala\nE. Caudate head/body\nF. Nucleus accumbens\nG. Putamen\nH. Lateral/medial globus pallidus\nI. Thalamus nuclei (ventral anterior, ventral posterior lateral/medial, lateral posterior, midline, lateral/medial dorsal)\nJ. Periaqueductal gray matter (PAG)\nDefine MarsBaR (in standardized space for each of these regions, with the exception of the PAG. Generate the PAG ROI by placing a 3 mm sphere at coordinates: right: 4, -28, -6; and left: -2, -28, -6. This PAG location was previously shown to have diffusional and connectivity alterations in migraine patients as compared to healthy controls13,14.\n\tNOTE: Test-retest studies with [11C]carfentanil show reproducibility of BPND measures of well less than 10%, with most cortical regions being 3 - 5%15. The largest coefficients of variation (CoV = Std.Dev./Mean) are typically observed in the regions with the lowest binding, however, even in the cortical regions with lowest binding BPND CoV’s were ~0.5. Hence, percentage changes in ROI µOR BPND between scans are only considered as significant when above 10%.\n5. 3D-Neuronavigation\nPreparing for an 3D-IIN Experience",
    "Organize the data provided in NIfTI volumetric data format as a stack of images with density and activation levels defined as 16 bit.\nWear active LCD shutter glasses to enable the time sequential stereoscopic 3D effect. The shutter glasses operate through the blocking of one eye while the image for the other eye is shown on screen. The process then repeats for the other eye. This shuttering effect occurs at 110 Hz.\nUse a joystick for interactions with the simulation after being instructed on its use.\nOutfit the shutter glasses and joystick with reflective markers to enable precise 6DOF tracking of the objects in space via a Vicon motion capture system.\nDisplay Aubject Activation Data\n\t\nUse XML configuration files to define color mappings of density and activation levels, which are loaded when the application begins and shared with each computer in the cluster.\nAcquire 3-dimensional volumetric cells from the provided NIfTIdata set by way of Jugular’s internal loading functions and the “Niftilib” open source software library.\nShare resulting volumetric cells with each computer in the cluster to improve speed.\nInterpret Volumetric cells by an OpenGL shader (GLSL) that conducts ray marching and the displaying of voxels with varying colors and transparencies defined by previously shared color mapping XML configuration files.\nObtain the location through the Vicon system and use this to update drawn perspectives of the volumetric data on each screen.\nRecord interactions and use them to dynamically adjust and cut planes through the data in order to navigate in the virtual space.\n6. 3D-Immersive & Interactive Neuronavigation (3D-IIN)\nStore subject activation data in the NIfTI data format, a volumetric data type that is interpreted using the Niftilib library.",
    "Obtain interactions and the location through a Vicon tracking system, a joystick device, and gestural input. Use this information to ensure the displayed image represents the correct vantage point, allowing for real-time exploration of the data set, and enable dynamic control for up to 3 arbitrary cutting planes using familiar movements and control schemes (Figure 1)."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}