{
  "id": 7103,
  "origin_website": "Bio",
  "title": "A One-enzyme RT-qPCR Assay for SARS-CoV-2, and Procedures for Reagent Production",
  "procedures": [
    "Dye-based RT-qPCR reaction set up using only RTX DNA polymeraseSet up EvaGreen dye-containing RT-qPCR reactions for CDC SARS-CoV-2 N1, N2, and N3 assays as shown in Table 2. The three assays target three different regions within the nucleocapsid phosphoprotein (N) gene near the 3’-end of the ~30 kb viral genome. In particular, N1 primers (Table 1) amplify a 72 nt long region from position 28287 to 28358 of the genome (GenBank Accession No. MN985325.1). The N2 primers produce a 67 bp amplicon from the genomic position 29164 to 29230. Meanwhile, the N3 primers amplify a 72 nt long region from genomic position 28681 to 28752. RNA isolation should be performed before RT-qPCR.Table 2. EvaGreen RT-qPCR reaction mix using only RTX DNA polymeraseimgsrc:https://en-cdn.bio-protocol.org/attached/image/20210117/20210117203719_5576.jpgaFull length SARS-CoV-2 or MERS-CoV N synthetic RNAs were used in these studies. The RNA copies per reaction (100 to 100,000 copies) are indicated in the relevant figures. Patient saliva is reported to have median SARS-CoV-2 viral loads of 3.3 × 106 copies/ml (To et al., 2020).Assemble all reaction mixes on a cold-block and directly transfer to a real-time PCR machine programmed to cycle through the steps depicted in Table 3. Include Melt curve analysis steps after qPCR amplification in order to distinguish target amplicons from spurious products.Table 3. RTX polymerase-based EvaGreen RT-qPCR cycling conditions imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210117/20210117204025_4262.jpg aAssay time may be reduced by shortening the reverse transcription step (step 1) to 15 min and the following denaturation step (step 2) to 2 min.bSignal acquisition occurs in the FAM (fluorescein) channel during steps 4 and 7.c20 measurements/°C temperature changeRTX polymerase-based TaqMan RT-qPCR reaction set upIn order to perform TaqMan RT-qPCR we developed a one-pot two enzyme system comprising RTX and Taq DNA polymerases.",
    "Set up RTX-based TaqMan RT-qPCR reactions for CDC SARS-CoV-2 N1, N2, and N3 assays as shown in Table 4.Assemble all reaction mixes on a cold-block and directly transfer to a real-time PCR machine programmed to cycle through the steps depicted in Table 5.Table 4. RTX polymerase-based TaqMan RT-qPCR reaction mix imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210117/20210117204138_1391.jpg aAssay buffer: Duplicate TaqMan RT-qPCR reactions were performed either in 1x ThermoPol buffer or in 1x RTX buffer as indicated to determine optimum buffer conditions.bControl reactions lacking RTX polymerase were set up using the same recipe except RTX was replaced with water.Table 5. RTX polymerase-based TaqMan RT-qPCR cycling conditionsimgsrc:https://en-cdn.bio-protocol.org/attached/image/20210117/20210117204242_0971.jpgaAssay time may be reduced by shortening the reverse transcription step (step 1) to 15 min and the following denaturation step (step 2) to 2 min without compromising results.bSignal acquisition occurs in the FAM (fluorescein) channel during step 4.SARS-CoV-2 RT-qPCR using commercial TaqPathTM 1-Step RT-qPCR Master Mix, CGTo perform CDC N1, N2, and N3 SARS-CoV-2 TaqMan RT-qPCR assays using commercial assay master mix, set up reactions using TaqPathTM 1-Step RT-qPCR Master Mix, CG (Thermo Fisher Scientific, Waltham, MA, USA) as shown in Table 6.Assemble all reactions on a cold-block and then incubate at room temperature (25 °C) for 2 min prior to cycling on a real-time PCR machine using the steps indicated in Table 7.Table 6. CDC N1, N2, N3 TaqMan RT-qPCR set up using commercial RT-qPCR master mix imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210117/20210117204209_4242.jpg Table 7. TaqPathTM TaqMan RT-qPCR cycling conditions imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210117/20210117204347_4802.jpg aSignal acquisition occurs in the FAM (fluorescein) channel during step 4.Purification of RTXTransform a T7-based E. coli expression strain, such as BL21(DE3), with a RTX expression plasmid that contains a carboxyl terminal six histidine tag for purification.On the next day, pick an individual transformant colony and inoculate it into desired sterile media (10.Superior BrothTM) with appropriate antibiotics (e.g.",
    ", Carbenicillin or Ampicillin 100 µg/ml) and 1-2% glucose Grow this starter culture overnight in shaking incubator at 37 °C.On day three, inoculate 1 L sterile Superior BrothTM (Athena Enzyme SystemsTM) or other rich media with appropriate antibiotics (e.g., Carbenicillin or Ampicillin 100 µg/ml) in a 4 L Erlenmeyer flask with 250-350 μl of the overnight starter culture. Incubate at 37 °C, 220-250 rpm until the culture reaches OD600 of 0.4-0.7 (0.5-0.6 is ideal).When the desired OD600 is reached, place flask(s) in 4 °C cold room for 30-45 min and set shaking incubator to 18 °C. Following cold incubation, induce expression of RTX by adding 1 ml of 1 M IPTG to each 1 L of culture. Place flask(s) in the 18 °C shaking incubator for 16-18 h.Following overnight expression, harvest cells by centrifuging cultures at 4 °C, 5,000 x g for 20 min.On the ice, resuspend cell pellet in 30 ml cold Lysis Buffer. Transfer the resuspended cell pellet to a small 50 ml beaker with a clean stir bar and place securely in an ice bath. With moderate stirring, sonicate the sample using 40% amplitude and 1 s ON/4 s OFF for 4 min total sonication time.Centrifuge the resulting lysate at 4 °C, 35,000 x g for 30 min. Carefully transfer the supernatant to a clean ultracentrifugation tube, shake in thermomixer at 400 rpm, 85 °C for 10 min, and then place on ice for 10 min.Centrifuge the heat-treated lysate at 4 °C, 35,000 x g for 30 min. Carefully transfer the supernatant to a clean tube and filter the clarified lysate using a 0.2 μm filter.Prepare Ni-NTA agarose columns with a final column volume (CV) of 1 ml using 10 ml PierceTM disposable columns. Equilibrate column with 20 CV Equilibration Buffer.",
    "Apply the clarified lysate from 1 L of expressed culture to a previously equilibrated column and collect the flow-through.Wash column with 20 CV Equilibration Buffer and collect the flow-through. Wash column with 5 CV Wash Buffer and collect flow-through.Elute RTX from a column with 5 ml Elution Buffer and transfer to a dialysis cassette with appropriate molecular weight cut-off. Dialyze eluate into 2 L of Ni-NTA Dialysis Buffer for 3-4 hours at 4 °C. Then dialyze eluate into a second 2 L of Ni-NTA Dialysis Buffer overnight at 4 °C.Pass the dialyzed eluate over an equilibrated 5 ml heparin column (HiTrapTM Heparin HP) and elute along a sodium chloride linear gradient (100 mM to 2 M NaCl) generated from Heparin buffer A and Heparin buffer B mixed by an FPLC machine. The peak corresponding to RTX or its variants could be expected between 40-60% Buffer B.Collect fraction tubes containing RTX peaks from the fraction collector. Pool the fractions and dialyze into 2 L Heparin Dialysis Buffer for 3-4 h. Then transfer dialysis cassettes into 2 L Final Dialysis Buffer overnight where it is expected that the protein sample volume will decrease significantly. Following the final dialysis, recover the protein sample and determine protein concentration before storing at -20 °C. The RTX stock is typically kept concentrated (5-10 mg/ml) in the Final Dialysis Buffer. If a lower concentration is required (e.g., 0.2 mg/ml working solution), Final Dialysis Buffer was used to dilute the RTX stock to the desired final concentration. An example of RTX purification is shown in Figure 7.A similar protocol should work for Taq and other thermostable DNA polymerases, but may require different dialysis and storage buffers."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}