{
  "id": 8334,
  "origin_website": "Jove",
  "title": "A Fibrin-Enriched and tPA-Sensitive Photothrombotic Stroke Model",
  "procedures": [
    "This protocol is approved by the Institutional Animal Care and Use Committee (IACUC) at the University of Virginia and follows the National Institutes of Health Guideline for Care and Use of Laboratory Animals. Figure 1A outlines the sequence of surgical procedures of this protocol.\n1. Surgery setup\nPlace a warming pad with temperature setting at 37 °C on the small animal adaptor at least 15 minutes before the surgery. Prepare a nose-clip roll for adaptor which allows the animal head rotation. Prepare the anesthetics Ketamine (60 mg/kg)/ Xylazine (10 mg/kg).\nSterilize the surgical tools including scissors, forceps, micro-needle holders, hemostats, cotton swabs and sutures with autoclave (121 °C at 15 psi for 60 min). Prepare tissue glue and eye ointment. Prepare the 532 nm laser protection goggle for surgeons.\n\tNOTE: This protocol describes a major survival surgery procedure and should be conducted using aseptic techniques.\nSet up the illumination system with a 532 nm laser source. Prepare a dental drill.\nPrepare the Rose Bengal solution in saline (10 mg/mL). Place an aliquot bovine thrombin (0.1 U/µL) on ice-bucket.\nInject Ketoprofen (4.0 mg/kg) subcutaneously to the mouse as analgesia at 30 min before surgery or use the analgesic regimen recommended by the local institutional guidelines.\n2. Ligation of the ipsilateral common carotid artery\nAnesthetize 10-14 week-old male C57BL/6NCrl mice weighing 22 to 30 g by intramuscular injection of Ketamine (60 mg/kg) and Xylazine (10 mg/kg).\n\tNOTE: The entire surgical procedure, encompassing the ligation of the ipsilateral common carotid artery through the monitoring of cerebral blood flow, is expected to take ~120 min. The anesthetic regimen will be typically effective for this entire duration, but the anesthetic depth should be reassessed at least every 15 min. While learning these procedures, it may be necessary to re-dose the anesthesia.",
    "Perform a toe-pinch to ensure the animal is fully anesthetized. Remove the hair on the left neck for CCA ligation and the head for skull thinning with the hair removal cream.\nPlace the mouse on the small animal adaptor in the supine position. Sterilize the surgical area by wiping skin with three alternating swipes of povidone-iodine and 70% ethanol.\nSecure the mouse head using ear bars. Under a dissecting microscope, make a 0.5 cm left-cervical incision using a pair of micro-scissors and straight forceps at about 0.2 cm lateral to the midline.\nUse a pair of fine serrated forceps to pull apart the soft tissue and fascia to expose the left common carotid artery (LCCA). Carefully separate the left CCA from the vagal nerve using a pair of fine smooth forceps.\nPlace a permanent double-knot suture around the LCCA using 5-0 silk suture cut into 20 mm segments, and then close the wound using sterile wound clips.\n3. Skull thinning above the MCA branch and photoactivation\nFlip the mouse to prone position on the small animal adaptor. Rotate the nose-clip roll for 15°. Sterilize the surgical area by wiping skin with three alternating swipes of betadine and 70% ethanol.\nMake a 0.8 cm incision in the scalp using a pair of micro-scissors and straight forceps along the left eye and ear to expose the temporalis muscle, which is located between the eye and the ear (Figure 1B).",
    "Under the dissecting microscope, make a 0.5 cm incision along the edge of temporalis muscle on left parietal bone by a pair of fine serrated forceps. Make a second 0.3 cm vertical incision on temporalis muscle by a micro scissors. Retract the temporal muscle to expose the edge of parietal bone and squamosal bone. Make sure to visualize the landmark of coronal suture between the frontal and the parietal bones (Figure 1B,C).\nMoisture the skull by applying sterile saline to reveal the left MCA. Mark the proximal MCA branch on the squamosal bone with a marker pen. Gently draw a circle for about 1 mm in diameter surrounding the marked area with the pneumatic dental drill (burr speed setting at 50% of speed controller), and then thin the skull about 0.2 mm in depth without touching the underneath dura. Stop the drilling until a very thin layer of bone is left.\nMix the thrombin (T, 0.1 U/μL, 80 U/kg) and Rose bengal (RB, 10 mg/mL, 50 mg/kg) solution based on the mouse’s body weight. For example, for a mouse of 25 g body weight, mix 20 μL of thrombin (0.1 U/μL) and 125 μL of RB (10 mg/mL).\nSlowly inject T+RB solution (145 µL per 25 g body weight) into the retro-orbital sinus with an insulin syringe (#31G needle).",
    "NOTE: In pilot experiments, the mortality rate of increasing doses of thrombin mixed with the standard dose of RB dye (50 mg/kg) was examined for photoactivation. The mortality was 0% for 80 U/kg thrombin (n=13), 43% for 120 U/kg thrombin (n=7), and 100% for both 160 U/kg (n=5) and 200 U/kg thrombin (n=5). A dose of 80 U/kg thrombin was therefore chosen for this model. Laser speckle contract imaging was also used to exclude the possibility of rampant blood clotting near the orbital cavity after retro-orbital sinus injection of T+RB (Supplementary Figure 1), as well as, widespread fibrin deposition in the contralateral hemisphere that was not subjected to laser illumination (Supplementary Figure 2).\nApply eye ointment on both eyes to prevent dryness.\nApply the illuminator with a 532 nm laser light (with 0.5 mW energy) on the drilled site with 2-inch distance for 20 min. Visualize the illumination on the proximal branch of MCA through a laser protection goggle (Figure 1C,D).\n\tNOTE: The MCA with 532 nm illumination shows red fluorescence under the goggle. The distal MCA will disappear after 10 min illumination. Exclude the animal if the distal MCA flow is still present after 20 min illumination.\nStop the laser illumination after 20 min. Close the wound with sterile wound clips.\n4. Intravital imaging (optional)\nNOTE: To characterize the thrombus formation in-vivo, use intraviral imaging by a spin-disk confocal with photoactivation system23.\nMake a cranial window ~3 mm in diameter on the parietal bone of skull.\nPlace a coverglass on the cranial window and locate the distal MCA (~50 μm in diameter) under a 20x water-immersion objective.\nLabel the circulating platelet by tail vein injection of DyLight488-conjugated anti-GPIbβ antibody (0.1 mg/kg) at 5 min before imaging.",
    "Inject the mixture solution of thrombin (80 U/kg) and Rose bengal (50 mg/kg) by retro-orbital at 5 min before imaging.\nPhotoactivate the MCA using a 561 nm laser system with laser beam 10 μm in diameter and record the image until the thrombus formation.\n5. tPA administration\nPlace the anesthetized animal on a 37 °C warm pad. At the selected post-photoactivation time-point, wet a gauze with ~45 °C warm water and wrap it on the tail for 1 min.\nInject recombinant human tPA (10 mg/kg) through the tail vein with a 50% bolus and 50% over 30 min by infusion pump.\n\tNOTE: Although the clinical dose of recombinant human tPA for acute ischemic stroke treatment is 0.9 mg/kg, a higher dose (10 mg/kg) is commonly used in rodents to compensate for reduced cross-species tPA reactivity. We also followed the standard protocol of tPA-administration in preclinical stroke models, using 50% as a bolus and 50% infused through the tail vein over 30 min.24\n6. Monitor of cerebral blood flow (CBF)\nNOTE: To confirm CBF recovery after tPA treatment, use a two-dimensional laser speckle contrast imaging system15 and record immediately after photothrombosis (step 3.9) or at 24 h after tPA treatment.\nPlace anesthetized animal in the prone position and make a midline incision on the scalp with the skull exposed.\nMoisturize the skull with sterile saline and gently apply the ultrasound gel on the skull. Avoid any hair and bubble in the gel, which will interfere the CBF signal.\nMonitor CBF in both cerebral hemispheres under laser speckle contrast imager for 10 min.\nAfter recording the CBF image, close the scalp with tissue glue and return the animal to the cage.\nAnalyze CBF in the selected regions and calculate the CBF recovery percentage compared to contralateral region.",
    "Then, place the animal back to a warm cage for recovery. Monitor the mice for 5-10 min until they recover from anesthesia. Place wetted food in the cage and return it to the animal care facility.\n\tNOTE: Provide post-op analgesia as recommended by the local institutional guidelines.\n7. Infarct volume measurement by triphenyl tetrazolium chloride (TTC) staining\nTwenty-four hours after photothrombosis, deeply anesthetize the animal per the local institutional guidelines for nonsurvival surgery.\n\tNOTE: We administer tribromoethanol (avertin) 250 mg/kg via intraperitoneal (IP) injection.\nPerform transcardial perfusion with PBS, collect fresh brain and embed in 3% agar gel.\nSection the brain slice with 1 mm thickness by vibratome and incubate in 2% TTC solution for 10 min.\nQuantify the total infarct volume from 6 brain slices as the absolute volume by ImageJ software.\n\tNOTE: Brain edema was not used as an outcome measurement for two reasons. First, the TTC stain measures tissue viability (via the mitochondrial reduction activity) which is a more severe consequence than edema. Second, as infarction proceeds, both vasogenic and cytotoxic edema occur and cannot be easily distinguished by the standard brain edema measurement methods. However, we have used anti-immunoglobin (IgG) labeling to assess the integrity of blood-brain-barrier (BBB), and found comparable IgG-extravasation at 6 h after photoactivation in both RB and T+RB stroke models (Supplementary Figure 3).\n8. Thrombus formation measurement\nNOTE: To measure the thrombus formation, collect the brain at 1 h and 2 h after photothrombosis for thrombus measurement in MCA by immunochemistry (IHC) and for fibrin measurement in brain hemisphere by immunoblot, respectively.\nPerform the IHC for the characterization of clot composition. Fix the brain with 4% paraformaldehyde overnight and then dehydrate the brain with 30% sucrose for the OCT embedding.",
    "Section the brain with sagittal orientation in 20 μm thickness, and perform the IHC with specific antibodies against fibrinogen, platelet (glycoprotein IIb), red blood cell (TER119) and blood vessel (isolectin GS-IB4).\nPerform the measurement of fibrin in brain hemisphere by immunoblot with an antibody against fibrinogen.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}