{
  "id": 13220,
  "origin_website": "Jove",
  "title": "Capturing the Cardiac Injury Response of Targeted Cell Populations via Cleared Heart Three-Dimensional Imaging",
  "procedures": [
    "All experiments were conducted in accordance with the Guide for the Use and Care of Laboratory Animals and in compliance with the Institutional Animal Care and Use Committee in the School of Medicine and Public Health at the University of Wisconsin–Madison. All methods were performed on wild type C57BL/6J (B6) and transgenic mouse lines obtained from Jackson Laboratories.\n1. Coronary Artery Occlusion (Myocardial Infarction) Induced via Ligation of the Left Anterior Descending Artery (LAD) in 1-Day-Old Neonatal Mice6\nSeparate the 1-day-old neonatal pups from the mother by placing them into a clean cage along with some of the original nesting material.\nPlace half of the cage onto a heating pad set to medium heat. The pups should remain on the unheated side of the cage, only being placed onto the heated side after surgery.\nCreate a sterile surgical area under an operating microscope. Gather sterilized surgical equipment (Table 1).\nAnesthetize the pup via hypothermia: wrap the pup in gauze to avoid direct skin contact with ice and bury it in an ice bed for approximately 3–4 min. Check hypothermia of the mice periodically by performing a toe pinch. Neonates tolerate hypothermia well, however, prolonged exposure to hypothermia may result in frostbite and subsequent mortality.\nOnce anesthetized, place the mouse onto the surgical area in the supine position, securing the arms and legs with tape. Sterilize the surgical area of the mouse with an antiseptic solution.\nLocate the lower chest region and make a transverse incision in the skin with small dissecting scissors. To widen the surgical view of the ribs, separate the skin from the muscle by lifting the skin gently with a pair of dressing forceps and gently press against the intercostal muscles with the small scissors in the closed position.",
    "Locate the fourth intercostal space (Figure 1A) and make a small, superficial puncture using sharp forceps, being careful not to puncture any internal organs. Perform a blunt dissection by widening the area in between the intercostal muscles with dressing forceps. Proper anatomical positioning of the incision is essential for appropriate access to the heart.\nGently guide the heart out of the chest cavity by placing a finger and applying increasing pressure on the left side of the abdomen while holding the intercostal space open with dressing forceps (Figure 1B). Once the heart is outside of the chest, remove the dressing forceps, relieve pressure, and allow the heart to rest on the intercostal muscles.\nLocate the LAD as the area of the heart that has less pooled blood and is in the correct anatomical position (Figure 1C). The LAD can be only seen under the microscope if the heart is accessed within a few minutes of beginning surgery.\nPerform LAD ligation by suturing the LAD with a 6-0 suture (Figure 1D). Tie a square knot twice to induce myocardial infarction (Figure 1E). The depth of the suture into the myocardium may vary, however, proper anatomical positioning of the LAD ligation is crucial for reproducibility. When ligating the LAD, the suture should be pulled tightly but carefully so as not to sever the LAD. Blanching at the apex of the heart will be seen immediately (Figure 1E)\nAllow the heart to slip back into the chest cavity; this process can be gently facilitated with dressing forceps. Suture the ribs together with a surgeon's knot followed by a square knot, using blunt forceps to lift the upper set of ribs while passing a 6-0 suture through the upper and lower set of ribs.",
    "Remove the tape that was used to secure the hind legs of the pup.\nAdhere the skin together by placing a small amount of skin glue on the upper abdomen. Then, grab the skin of the lower abdomen with fine forceps and cover the exposed chest region. Limit the amount of excess glue that remains on the pups, as this can increase the likelihood of rejection and cannibalism by the mother.\nImmediately facilitate the recovery from anesthesia by placing the pup onto a heating pad set to medium heat. Periodically switch the placement of the neonates to evenly warm all parts of the body.\nAllow the neonate to remain directly on the heating pad for 10–15 min. Typically, movement is regained within 5 min of being placed onto heat.\nClean the residual blood and glue with an alcohol wipe.\nCover foreign scents on neonates by rubbing the entire body with bedding from the original cage. Place the pup into the cage on the heated side while other surgeries are being performed.\nOnce all surgeries are completed and pups are warm and mobile, transfer the litter along with the original nesting material to the mother's cage.\nMonitor the mice for 30–60 min after surgery and watch for the mother's acceptance of the pups by nesting and/or grooming.\nCheck on the mice the morning following surgery. If mother is distressed and has not nested the pups, consider a foster mother for the pups.\n2. Clearing the Mouse Heart with Passive CLARITY21,22,23\nAnesthetize the mouse with isoflurane. Perform a toe pinch to ensure the mouse is fully sedated.\nPlace the mouse onto a clean, surgical area in the supine position, securing the arms and legs with tape.\nMaintain isoflurane sedation on the mouse using a nose cone until the heart is extracted.",
    "Open the lower chest by holding the fur just below the xiphoid process with tissue forceps and make an incision spanning the width of the ribcage using the large dissecting scissors.\nCut alongside of the distal portions of the rib cage with surgical scissors.\nExpose the diaphragm muscle by grasping the xiphoid process with tissue forceps. Detach the diaphragm using curved forceps.\nWhile maintaining a grasp of the xiphoid process, pull the tissue cranially until the beating heart is accessible.\nGrasp the heart at the base with curved forceps and dissect the heart from the chest cavity by cutting the aorta and superior vena cava with iridectomy scissors.\nWhile the heart is still beating, place the heart into a Petri dish filled with PBS so that the heart pumps out the blood inside as it keeps beating. Myocardial infarction can be confirmed by checking that the placement of the suture is in the proper anatomical position for LAD ligation.\nGently squeeze the heart with forceps to allow the heart to expel the residual blood.\nTransfer the mouse heart into a disposable 2.5 mL glass shell vial with 2 mL of PBS. Wash away residual blood by incubating the heart on a shaker for 10 min at room temperature (RT) several times. Change the PBS solution each time until PBS remains clear.\nDiscard the PBS and fill the vial with 2 mL of cold 4% paraformaldehyde (PFA). Incubate for 4 hours at RT (Figure 2A).\nAfter incubation, discard the PFA and the vial with 2 mL of PBS. Wash the heart on a shaker for 10 min at RT. Repeat the washing step twice, draining and filling the vial with new PBS each time to fully wash away excess PFA.",
    "Discard PBS and fill the vial with 2 mL of 4% acrylamide and 0.5% VA-044 solution. Incubate overnight at 4 °C.\nThe next day, perform polymerization by transferring the vial to a heat block set at 37 °C for 3 hours.\nTransfer the heart into a new glass shell vial and repeat step 2.12 (PBS wash cycle).\nDiscard PBS and fill the vial with 2 mL of Clearing Solution (Table 2). Incubate at 37 °C until the heart is cleared. Change out the solution and refill with fresh Clearing Solution every 2–3 days. The clearing process could take up to several weeks (Figure 2B-C).\n\tNOTE: P1 hearts typically take around 3–5 days, whereas P21 hearts can take nearly a month before Clearing Solution incubation is complete.\nDiscard PBS and fill the vial with 2 mL of PBS and repeat step 2.12 (PBS wash cycle). Refill the vial with fresh PBS and incubate overnight at 37 °C.\nIf immunostaining will be performed, skip steps 2.21–2.22 and proceed to Section 3 for immunostaining. If relying solely on endogenous fluorescence, proceed with steps 2.21–2.22 and skip Section 3.\nDiscard PBS and change the solution to Refractive Index Matching Solution (RIMS) (Table 3). Incubate overnight at 37 °C.\nAfter incubation, the cleared tissue can be stored in RIMS solution at RT. Tissue may appear to be white and opaque in the center when first transferred into RIMS; tissue should become transparent after being incubated in RIMS at room temperature for several weeks (Figure 2D).\n3. Optional: Immunohistochemistry Staining of the Whole-Mount Mouse Heart\nRemove the cleared heart from the RIMS solution and place into a clean 2.5 mL glass vial with 2 mL of PBST (PBS with 0.1% Triton-X 100)",
    "Wash the heart in PBST 3 times on an orbital rotator with 30 min incubations at RT.\nBlock non-specific antibody binding by immersing the heart in 2 mL of 20% blocking buffer (diluted in PBST) and incubate with rotation for 3 hours at RT. Transfer to 4 °C to stain with rotation overnight.\n\tNOTE: Blocking buffer is made from normal serum matching the species in which the secondary antibody was raised.\nWash the heart in PBST 3 times with rotation for 5 min incubations at RT.\nImmerse the heart in primary antibody (diluted in 2% blocking buffer with PBST) and prevent light exposure by wrapping the glass vial in aluminum foil. Incubate with rotation overnight at RT.\n\tNOTE: From this point forward, aluminum foil should be continuously used to protect the secondary from ambient light exposure.\nIncubate for an additional 24 hours with rotation at 4 °C.\nFollowing primary staining, repeat step 3.2 (long PBST wash cycle) to remove the unbound primary antibody from the tissue. Extend the wash with an overnight incubation with rotation at RT.\nWorking in an area with limited lighting to prevent secondary antibody light exposure, immerse the heart in secondary antibody (diluted in 2% blocking buffer with PBST) and incubate with rotation for 3 hours at RT. Transfer to 4 °C to stain with rotation overnight.\nOn the next day, repeat step 3.2 (long PBST wash cycle) to remove unbound secondary antibody.\nReplace the solution with 2% blocking buffer (diluted in PBST). Remove residual unbound antibody by washing overnight with rotation at RT.\nThe next day, check that excess secondary antibody has been removed using confocal microscopy. Extend the wash as needed, replacing the 2% blocking buffer solution daily. Proceed once little to no non-specific secondary is present.",
    "Store the immunostained heart in PBS at 4 °C.\nDirectly before whole-mount microscopy, incubate the heart in RIMS solution overnight at 37 °C. Extend the incubation an additional 24 hours if the tissue is still not fully cleared.\nStore the fully cleared and immunostained heart in RIMS at RT.\n4. Visualizing Non-myocyte Populations in 3D with Single-Photon Confocal Microscopy Imaging of the Cleared Mouse Heart\nNOTE: If mouse hearts are harvested embryonically, continue with section 4.1. For mouse hearts harvested postnatally, continue with section 4.2.\nImaging the Cleared Embryonic Mouse Heart\n\t\nFill the microscope depression slide with the PBS solution.\nCarefully pick up the cleared heart with curved forceps and place the tissue onto the slide.\nMount the slide with a glass coverslip. The tissue can now be imaged under a confocal microscope.\nImaging the Cleared Postnatal Mouse Heart\n\t\nFill half of the chamber of the depression slide with PBS solution. In order to create a chamber large enough to fit an adult mouse heart, a 3D-printed polypropylene depression slide was custom-made (Figure 4).\nCarefully pick up the cleared heart with curved forceps and place the tissue into the chamber. Fill the remaining volume of the chamber with PBS.\nFill the chamber with PBS so the surface of the liquid forms a dome above the top of the chamber. Mount the cover slide. The tissue can now be imaged under an upright confocal microscope.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}