{
  "id": 6536,
  "origin_website": "Bio",
  "title": "Isolation and Long-term Cultivation of Mouse Alveolar Macrophages",
  "procedures": [
    "Harvest alveolar macrophages by bronchoalveolar lavage (BAL)For each mouse, prepare a 15-ml conical tube filled with 3 ml complete medium (see Recipes).Warm-up BAL buffer (see Recipes) to 37 °C in a water bath. Keep warm during the whole procedure. Euthanize the mouse by cervical dislocation without rupturing the jugular vein or the trachea to avoid exposing AM to CO2 or isoflurane, which could affect functional properties of AM.Using dissection tools, remove the skin, ribcage and muscles to expose both lungs and trachea. Avoid cutting or rupturing blood vessels.Note: Since methods for the surgical exposure of lungs and the trachea have been published previously in this journal, the reader is referred to those protocols for instructions (Han and Ziegler, 2013; Tibbitt and Coquet, 2016; Jhingran et al., 2016; Sun et al., 2017). Use a fine scissor to make a small incision in the upper part of the trachea just below the larynx. The part of the trachea facing downwards (away from the experimenter) should remain intact, do not cut through the whole trachea. Use the incision to insert a slightly blunted 18-G cannula and direct the cannula 5 mm deeper into the trachea towards the lungs. Take care not to damage lung tissue. Attach a 1 ml syringe filled with 1 ml warm BAL buffer onto the inserted cannula. Inject 1 ml buffer while fixating the cannula position with the other hand. Pull the plunger to collect BAL fluid in the syringe. About 800-900 μl can be recovered. Observe that the pressure should not be too high, otherwise the alveoli will burst and BAL fluid will be lost. Upon injection and collection, the lungs should visibly inflate and deflate. Filter collected BAL fluid through a 70 μm cell strainer into the 15-ml tube with 3 ml complete medium from Step A1.",
    "Repeat Steps A6-A10 for 9 more times each time with fresh warm BAL buffer. Pool cells into the same 15-ml tube.Collect cells by centrifugation at 300 x g, 5 min at 4 °C. Remove supernatant. The cell pellet should be white. A red/pink color indicates that blood was accidentally collected during the BAL.Add 1 ml hemolysis buffer for 2 min incubation at room temperature to lyse residual erythrocytes. Fill up tube with complete medium to stop lysis and collect cells by centrifugation as before. Remove supernatant. The color of the cell pellet should be white now.Resuspend cell pellet in 500 μl BAL buffer and take a sample for counting using a hemocytometer chamber after staining with Trypan Blue to exclude dead cells. Count only live (Trypan-Blue negative) cells. Calculate the total cell number per BAL. Typically, 5 x 105-7 x 105 live cells per adult wild-type mouse aged 6-8 weeks can be recovered when using pre-warmed BAL buffer, containing PBS with 2 mM EDTA and 0.5% serum. Proceed to cell staining and flow cytometry analysis or in vitro cultivation.Flow cytometric analysis of alveolar macrophagesBlock unspecific binding sites on cells with TruStain fcX and concomitantly stain with Zombie Violet in 200 μl cold PBS (without FBS) at 4 °C in the dark for 15 min (see Table 2).Wash cells with cold BAL buffer by centrifugation at 300 x g for 5 min at 4 °C. Stain cells in a volume of 100 μl per 1 million cells according to Table 2 for 30 min at 4 °C in the dark using BAL buffer.Table 2. FACS reagents used for staining BAL AMimgsrc:https://en-cdn.bio-protocol.org/attached/image/20190711/20190711202130_4149.jpgPrepare compensation beads for each antibody conjugate.Wash cells with BAL buffer, resuspend in 200 μl BAL buffer for recording.Record cells by flow cytometry after acquiring the compensation beads.",
    "AM are double-positive for SiglecF and CD11c (Figures 2A-2C), and > 98% viable (Figure 2D).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190711/20190711202207_7487.jpgFigure 2. FACS analysis of BAL AM. A. Simple gating strategy for exclusion of doublets, dead cells. AM are SiglecF- and CD11c-positive. B-C. BAL cells harvested with pre-warmed BAL buffer containing EDTA are phenotypically not different from BAL cells harvested using pre-cooled PBS. Each symbol denotes 1 mouse. Typically, > 95% of BAL cells are AM. D. Viability analysis of BAL singlet cells assessed by staining with Zombie Violet Fixable Dye.Cultivation of alveolar macrophagesCollect cells by centrifugation as before. Remove supernatant.Plate 3 x 105-4 x 105 cells per well of a non-treated 6-well plate in 3 ml pre-warmed AM culture medium (see Recipes).Note: Typically, 3 x 105-4 x 105 cells are plated in 1 well of a 6-well plate. If BAL cells of several mice are pooled, 1.1-1.2 million cells can be plated in a non-treated 94 mm Petri dish in 10 ml pre-warmed AM culture medium.  Add gentamicin to the AM culture (1:1,000).Note: Gentamicin is omitted after the first medium change.  Incubate at 37 °C, 5% CO2. Replace culture supernatant after 6-18 h with fresh AM culture medium and discard the supernatant. Note: Cells will adhere fully within a few hours after the first plating and we do not keep cells in suspension at the first medium exchange. However, for subsequent medium exchanges, the cells in the supernatant are collected as well since a typical AM culture consists of both adherent and suspended cells (see also Notes section). Change medium every 2 days until the cell culture reaches confluency.To change medium, transfer the medium and suspension cells into a 15 ml-tube. Add 2 ml warm AM culture medium to the well with adherent cells to prevent drying-out.",
    "Collect the suspension cells using centrifugation at 300 x g 5 min. Resuspend the pelleted cells in 1 ml warm AM culture medium and combine with adherent cells. Note: Freshly harvested primary AM will double every 7-10 days (Soucie et al., 2016). If the majority of AM appear stretched (spindle-like) and activated, increasing the amount of conditioned medium or adding recombinant GM-CSF might help; however, proliferative capacity will be limited and it might advisable to start a new culture (see Figure 3 for exemplary images of early AM culture).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190711/20190711202230_6992.jpgFigure 3. Representative images of AM culture within the first days after plating the cells. A. AM culture with predominantly round-shaped cells that are partly floating and partly adherent on Day 1 after plating. B. Same culture as (A) on Day 2. C. Same culture as (A) on Day 4. D. Example for an AM culture with a large fraction of elongated, dark cells on Day 4 after plating. Arrowheads indicate dividing cells, 100x magnification. To detach cells from a confluent well, collect suspension cells into a 15-ml tube. Add 750 μl detachment medium (see Recipes) to 1 well of a 6-well plate (or 3 ml to a 94 mm Petri dish) and incubate for 10-30 min at 37 °C. Note: AM are very adherent and prone to rupture when using too harsh detachment procedures. Thus, the use of non-treated plastic ware and proper detachment medium is important (see Recipes). Ruptured cells in the culture medium might affect both activation status and proliferative capacity of AM.  Detachment of cells can be supported by pipetting on the plastic bottom gently to avoid cellular damage (see Notes).Pool detached cells with cells in suspension and centrifuge cells at 300 x g for 5 min.",
    "Resuspend cell pellet in 1 ml warm AM cultured medium and take a sample for counting using a hemocytometer chamber after staining with Trypan Blue to exclude dead cells. Count only live (Trypan-Blue negative) cells.If the cell number has doubled, add 5 ml warm AM culture medium and split into 2 wells of a 6-well plate (or correspondingly to 2x 94 mm Petri dishes). In general, the cell number plated is maintained around the values indicated above in the note to Step C2.Note: Earlier, we could show that AM culture remains proliferative for at least 10 passages (Soucie et al., 2016). Since then, we have experience with AM cultures that remain proliferative even beyond 20 passages with no indication of a decline in proliferative capacity."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}