{
  "id": 3997,
  "origin_website": "Cell",
  "title": "Protocol for rapid ammonia detection via surface-enhanced Raman spectroscopy",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation of ammonia solutions\nTiming: 12 h\nSoak all glassware in Caro’s acid for 1 h. Then, rinse the glassware 10 times with Millipore water, followed by 5 times with ethanol and 3 times with acetone. Dry the glassware thoroughly in an oven at approximatley 80 ˚C for 12 h before use.\nIn a fume hood, create a 10,000 ppm (1.0 wt%) ammonia solution by taking 10 mL of a 28 wt% ammonium hydroxide (NH3 H 2O) solution and diluting with Millipore water to a total volume of 250 mL. Next, compensate with an additional 3.2 mL of water using a 5 mL pipette tip, for a total 10,000 ppm solution volume of 253.2 mL.\nCritical: Use a small graduated cylinder to measure 5 mL of the ammonia water stock solution, because the insufficient surface tension will cause severe leakage when using pipettes.\nDilute the obtained solution to 100 ppm. First, take 1 mL of the 10,000 ppm solution (using a pipette) and add it to ∼50 mL of MilliQ water in a 100 mL measuring flask. Then, fill the flask with water to 100 mL\nPrepare other less concentrated samples in glass vials (20 mL).\nFor 50 ppm, mix 10 mL of the 100 ppm sample and 10 mL of water in a glass vial.\nFor 20 ppm, mix 4 mL of the 100 ppm sample and 16 mL of water in a glass vial.\nFor 10 ppm, mix 2 mL of the 100 ppm sample and 18 mL of water in a glass vial.\nFor 5 ppm, mix 1 mL of the 100 ppm sample and 19 mL of water in a glass vial.",
    "For 3 ppm, mix 0.6 mL of the 100 ppm sample and 19.4 mL of water in a glass vial.\nFor 1 ppm, mix 0.2 mL of the 100 ppm sample and 19.8 mL of water in a glass vial.\nFor 0.5 ppm, mix 2 mL of the 5 ppm and 18 mL of water in a glass vial.\nFor 0.1 ppm, mix 2 mL of the 1 ppm and 18 mL of water in a glass vial.\nSeal all glass vials with built-in caps and parafilm.\nSurface-enhanced Raman detection with the confocal and wide-field setup\nTiming: [<15 min for preparation, <1 s per measurement]\nRaman spectra of the ammonia solutions near the metal surface have been measured using a commercial Raman microscopy system (InVia, Renishaw Corp., UK). The system is designed for epi geometry detection and through the control of the spectrometer input slit and beam profile on the sample, the system can be operated in both a confocal and quasi wide field geometry (see Figure 2[href=https://www.wicell.org#fig2] for concept of confocal and wide field approaches).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/714-Fig2.jpg\nFigure 2. Concept of the experimental set-up\n(A) Optical pathway with an immersed objective.\n(B) Conventional confocal mode.\n(C) Wide-field set-up for large volume probing.\nFigures are adopted from Ref. ( Liu et al., 2020[href=https://www.wicell.org#bib3]).\nThe following parameters have been used:\ntable:files/protocols_protocol_714_2.csv\ntable:files/protocols_protocol_714_3.csv\n∗Assuming the same diffraction efficiency, grating periodicity mainly influences spectral resolution, thus the use of 1200 gr/mm or even smaller is possible.\nIn each analysis, the substrates were immersed with an analyte ammonia solution that also served as the immersion liquid for the water objective.\nThe sample has been brought to focus based on an optical image of substrate surface and beam reflection image.",
    "Critical: The direct use of an analyte as an immersion material for the high numerical aperture objective simplifies experimental logistic and avoids any additional immersion materials.\nCritical: The SERS approach utilizes modest experimental parameters (low light flux, large spot size) and has virtually no geometrical restrictions that have limited other optical techniques such as surface-enhanced attenuated total reflection infrared spectroscopy. It also allows ammonia detection at relatively high speeds (detection in under <1s). These factors enable in situ and on-site detection of the local concentration of ammonia, something that is much harder to achieve with existing methods. These conditions are particularly important for operando electrochemical experiments, where sample volumes are small and rapid quantification is advantageous.\nDFT calculations of the vibrational spectrum of ammonia aqueous solution\nTiming: [< 48 h per calculation]\nCalculations based on Density Functional Theory were performed to support the interpretation of the Raman spectra of ammonia in water (Figure 3[href=https://www.wicell.org#fig3] ).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/714-Fig3.jpg\nFigure 3. Ammonia-related vibrational modes\nFigure was adopted with minor change from Ref. (Liu et al., 2020[href=https://www.wicell.org#bib3]).\nThe structure of the ammonia molecule, ammonium ion, ammonia-ammonia dimer, water-ammonia dimer, and ammonia-water complex were built using Avogadro, a molecule editor and visualizer (Hanwell et al., 2012[href=https://www.wicell.org#bib2] ) and optimized using M06-2X/aug-cc-pVTZ level of theory (Zhao and Truhlar, 2008[href=https://www.wicell.org#bib5]). Harmonic frequency calculations were performed in the same step to obtain Raman mode intensities. Optimization and frequency calculations were performed using Gaussian09 quantum chemistry program Revision C.01 ( Frisch et al., 2010[href=https://www.wicell.org#bib1]). We used tight convergence criteria and an ultrafine integration grid. For example, route section for the Gaussian09 calculation was defined as\n“# opt=(maxcycles=250,gdiis,tight) M062X/aug-cc-pVTZ integral=ultrafine freq=raman”.",
    "The harmonic frequencies and Raman intensities were then read from the output of the Gaussian09 program. The normal models were inspected and assigned using visualization software, in this case ‘Jmol, an open-source Java viewer for chemical structures in 3D’.\nThe anharmonic frequencies were calculated using structures optimized in the previous step. Anharmonic frequencies are calculated using numerical differentiation along corresponding vibrational modes as implemented in the Gaussian09 software. The route section for the Gaussian09 calculation was defined as\n“# M062X/aug-cc-pVTZ integral=ultrafine freq=anharmonic”.\nAnharmonic correction for each fundamental normal mode is read from the output of the Gaussian09 program.\nOptional: Two steps (i.e., optimization, Raman intensities and anharmonic frequency calculations) can be combined in one calculation using Gaussian16 version and route\n“# opt=(maxcycles=250,gdiis,tight) M062X/aug-cc-pVTZ integral=ultrafine freq=(anharmonic,raman)”.\nIn addition, the anharmonic correction can be evaluated only for a certain number of normal modes that are of interest to the user by using the following route section:\n“# M062X/6-31+G(d) integral=ultrafine freq=(anharmonic,raman,SelectAnharmonicModes)”.\nA list of the nodes was included after the molecule specification section following the blank line. For example, due to the computational cost of the calculations with the solvated ammonia model, we calculated the anharmonic correction for the stretching modes only using “mode=95–105”."
  ],
  "subjectAreas": [
    "Chemistry",
    "Surface Plasmon Resonance (Spr)",
    "Biophysics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}