{
  "id": 10795,
  "origin_website": "Jove",
  "title": "Development of a Multicellular Three-dimensional Organotypic Model of the Human Intestinal Mucosa Grown Under Microgravity",
  "procedures": [
    "Ethics statement: All blood specimens were collected from volunteers that participated in protocol number HP-00040025-1. The University of Maryland Institutional Review Board approved this protocol and authorized the collection of blood specimens from healthy volunteers for the studies included in this manuscript. The purpose of this study was explained to volunteers, and all volunteers gave informed, signed consent before the blood draw.\nNote: See Table 1 for medium supplement preparation. See Table 2 for the preparation of the 3-D culture media.\n1. Preparation of Culture Vessels\nUnscrew the cap of the fill port of the 50 ml-vessel and fill with 50 ml of sterile culture medium (e.g., RPMI). Perform all procedures under sterile conditions in a laminar hood.\nReplace the cap and wipe any spilled medium on any surface with 70% ethanol.\nAllow the vessel to incubate for at least 15 min to O/N at RT.\nUse the fill port to discard the culture medium and add 30 ml of 3-D culture medium.\nWipe any spilled medium on any surface with 70% ethanol.\n2. Preparation of the Cells\nHuman epithelial cell line (HCT-8)24,40.\n\t\nCulture cells in RPMI supplemented with 100 U/ml penicillin, 100 µg/ml streptomycin, 50 µg/ml gentamicin, 2 mM L-glutamine, 1 mM sodium pyruvate, 10 mM HEPES buffer and 10% heat-inactivated fetal bovine serum (FBS) (supplement 1). At 70% confluency, split cells at a ratio of 1:5.\nHuman colonic fibroblasts (CCD-18Co cells)24,41.\n\t\nCulture cells in Basal Eagle's medium enriched with supplement 1. At confluency, split cells at a ratio of 1:3.\nHuman Umbilical Vein Endothelial (HUVEC) cells24,42.\n\t\nCulture cells in Endothelial Basal Medium (EBM) medium enriched with 100 µg/ml heparin, 3 μg/ml Endothelial Cell Growth Supplement (ECGS), and supplement 1. At 70% confluency, split cells at a ratio of 1:2.\nLymphocytes/Monocytes",
    "Isolate Peripheral blood mononuclear cells (PBMC) from blood by density gradient centrifugation using standard techniques43.\n\t\t\nBriefly, using a 10 ml-pipette, carefully add 30 ml of diluted blood (1:1 blood: Phosphate Buffered Saline (PBS)) into a 50 ml-conical tube containing 10 ml of density centrifugation media. After the centrifugation step, lymphocytes and monocytes will reside in the \"white\" layer between the density centrifugation media and plasma layers.\nCollect the white layer using a transfer pipette. Avoid granulocyte contamination by limiting the collection of density centrifugation media. After washing43, use PBMC as is or cryopreserved in liquid N2.\n\t\t\tNote: It is important to highlight that PBMC largely consists of lymphocytes and monocytes, with a small proportion of dendritic cells and other cell types.\nGrow all cells under standard culture conditions at 37 °C in an atmosphere of 5% CO2.\n3. Preparation of Collagen-embedded Cells\nDetermine the number of inserts needed based on the numbers of experimental conditions to be set-up. Place the appropriate number of inserts into the wells of a 6-well plate.\nPrepare a suspension of HUVEC and fibroblasts:\n\t\nWash the flasks twice in PBS and detach the cells using trypsin, 0.25% (1x) with 0.05% trypsin-tetrasodium ethylenediaminetetraacetate (Trypsin-EDTA). Add enough trypsin solution to cover the entirety of the cell culture surface area. Detachment usually occurs within 5 to 15 min\nCollect detached cells in a 50 ml-tube containing 30 ml of Dulbecco's Modified Eagle's medium (DMEM) -30% FBS medium.\nCentrifuge the tube at 500 x g for 10 min.\nResuspend the cells in 30 ml of DMEM-30% FBS medium.",
    "Count the total number of viable cells by diluting 20 μl of the resuspended cells with 20 μl of Trypan blue dye. Load the hemocytometer with the cell mixture. Viable PBMCs will be white clear; nonviable PBMC will acquire the dye and become blue.\n\t\t\nResuspend each cell type in DMEM-30% FBS medium at a concentration of 5 - 8 x 107 cells ml- 1.\nPrepare cell-containing collagen gels\nNote: Each vessel will require the preparation of ~5 ml of cell-containing collagen gel.\n\t\nIn a 50 ml-conical tube prepare the collagen mixture by adding 1 x DMEM media, supplemented with 50 µg/ml gentamicin, 2 mM L-glutamine and 10% heat-inactivated FBS plus 3 mg/ml bovine collagen-I, 10 μg/ml laminin, 40 μg/ml collagen IV, 10 μg/ml fibronectin, 2 μg/ml heparin sulfate proteoglycan and 15 mM NaOH (to reach the physiological pH).\nClose the tube and mix by inverting several times until the mixture is fully homogenized. Avoid bubble formation.\n\t\tIMPORTANT: Keep the mixture on ice to prevent gelification.\n\t\t\nCritical step: If the mixture develops an acidic appearance (yellowish color), add a few drops of sterile 1 N NaOH to neutralize the mixture.\nAdd concentrated HUVEC and fibroblasts at a density of 1.0 - 1.2 and 1.5 - 2.0 x 106 cells/ml, respectively to the enriched-collagen mixture (described above). Close the tubes and mix by inverting several times until the mixture is fully homogenized. Avoid bubble formation. IMPORTANT: Keep the mixture on ice to prevent gelification.\nAdd 4 - 5 ml of the cell-containing collagen gel to each insert, previously loaded into a 6 well-plate, and allowed to gelify in the hood with little or no movement for 1 hr.\nAfter 1 hr, transfer the 6-well plate to a 37 °C, 5% CO2 incubator for 1 - 2 additional hours.",
    "Return the 6-well plate to the hood, and with the help of a sterile forceps and scalpel aseptically cut-off the membrane from the insert detaching the cell-containing gel from the membrane. Cut the detached gel into small squares (~5 x 5 mm).\nAdd the small cell-containing squares into a 50-ml HARV using the fill port.\nPrepare a suspension of HCT-8 epithelial cells:\n\t\nWash the flasks twice in PBS and detach the cells using trypsin, 0.25% (1x) with Trypsin-EDTA treatment. Add enough trypsin solution to cover the entirety of the cell culture surface area. Detachment usually occurs within 10 to 15 min.\nCollect detached cells in 30 ml of DMEM-30% FBS medium.\nCentrifuge DMEM-30% FBS medium containing tube at 500 x g for 10 min.\nResuspend the cells in 30 ml of DMEM-30% FBS medium.\nCount the total number of viable cells as described in 3.2.5.\nResuspend the HCT-8 epithelial cells in DMEM-30% FBS medium at a concentration of 107 cells ml- 1.\nAdd 1 ml of the concentrated HCT-8 epithelial cells into the 50-ml HARV using the fill port.\nBy using the fill port, add additional 3-D culture medium until the vessel is nearly full (~20 ml).\nReplace the cap and wipe the lip of the fill port with 70% ethanol.\nPlace a syringe in each syringe port of the RWV: place a 5 ml-syringe containing 3 - 4 ml of 3-D culture medium in one port and a 5 ml-empty syringe in the other port.\nRemove any visible bubbles by pulling into the empty syringe while approximately the same volume of medium is injected through the other syringe port.\nPlace the vessels in the bioreactor, turn on the power and set the speed to about 13 to 14 rotations per minute.",
    "Note: Critical step: Rotation rate may need to be adjusted a few times during an experiment to maintain the cells orbiting within the vessel, thereby avoiding contact with the vessel walls.\nCulture cells at 37 °C, 5% CO2 under microgravity, provided by the RWV bioreactor.\nChange culture medium every 3 - 4 days by replacing approximately 30 ml with fresh 3-D culture medium.\nAfter 4 days (±1 day), remove the vessels from the bioreactor and add lymphocytes/monocytes to the vessels (2 x 107/vessel).\nPlace the vessels back in the bioreactor at 37 °C, 5% CO2 for an additional 5 days (±1 day).\nAfter the additional 5 days (day 9 of the culture), add lymphocytes/monocytes to the vessels (2 x 107/vessel) and continue the cultures for up to 12 additional days.\nChange culture medium every 3 - 4 days by replacing approximately 30 ml with fresh 3-D culture medium.\n4. Harvesting 3-D Cultures for Histology\nWith the aid of a transfer pipette harvest each small gel fragment, now called \"construct,\" into a six-well plate containing 10 ml of 10% formalin buffer. Leave for 3 hr at RT or for 12 - 16 hr at 4 °C.\nPrepare the tissue processing and embedding cassettes by labeling and adding two pieces of biopsy foam pads into each cassette.\nImmerse the cassettes in 10% formalin buffer.\nWith the aid of forceps place the fixed-constructs between the two foam pads.\nImmerse the cassettes in 10% formalin buffer.\nProceed with standard procedures for embedding, sectioning, and staining44.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}