{
  "id": 15248,
  "origin_website": "Jove",
  "title": "The TreadWheel: Interval Training Protocol for Gently Induced Exercise in Drosophila melanogaster",
  "procedures": [
    "1. TreadWheel Setup and Operation\nNOTE: See Supplemental Figure 1 for schematics on TW exercise machine construction. The parts required are listed in the Table of Materials. The phrases \"TW\", \"TreadWheel\", \"exercise machine\", and \"machine\" are used interchangeably throughout the protocol.\nCalibrate motor using power switch such that a full rotational period is 15 s (4 rpm). Calibrate machine rotation speed before placing fly vials into secured clamps attached to rotating arms.\nAdjust speed using a standard stopwatch and an immobile object temporarily attached to the machine, such as a small paint brush taped to the motor cover with the brush just touching one of the rotating brackets. Time the number of rotations in one minute using the immobile object as a reference point and adjust speed to achieve a 15 s rotational period (4 rpm).\n2. Fly Collection and Maintenance\nNOTE: All flies are maintained in a 25 °C incubator with 50% humidity and a 12 h light/dark cycle between benchtop manipulations described below. Flies are fed a standard cornmeal-molasses lab diet unless otherwise noted.\nPrepare laying chambers for each genotype of interest using apple-juice agar plates, a drop of yeast paste per plate, and 6 oz. plastic bottles to collect eggs that will hatch into larvae.\nTo prepare apple-juice agar plates, fill 35 mm x 10 mm Petri dishes ¾-full with 3% agar dissolved into store-bought apple juice. Store solidified plates in a refrigerator until use.\nIn a 50 mL conical centrifuge tube, combine store-bought active dry yeast with distilled water at a ratio of 2 mL of water for each gram of yeast. Mix yeast with water to create a paste with the consistency of ketchup using a glass stirring rod. Adjust yeast and water proportions as needed to achieve the desired consistency.",
    "Store yeast paste in a refrigerator between uses. Keep the tube cap loose to allow de-gassing.\nUse a sharp needle or knife to punch small holes into the 6 oz. square-bottom bottles (polypropylene) as ventilation holes for the laying chambers.\nDab a small spot of yeast paste (~3 mm in diameter) onto each apple-juice agar plate.\nPlace adult flies of the desired genotype into the 6 oz. bottle and cap bottle with the apple-juice agar plate. Secure the plate to bottle with rubber bands. Invert, and place in an incubator to allow adults to lay eggs.\nChange apple-juice agar plates on a laying chamber twice a day (morning and evening). Leave used plates in the incubator for another 12–24 h to allow the first instar larvae to hatch.\nCollect first instar larvae using a thin paintbrush or collection pick (flexible thin needle attached to a handle). Place 50 first instar larvae of a specific genotype on a food vial of the desired experimental food type to develop and complete metamorphosis while housed in the incubator (Figure 2A).\nCollect adults for exercise treatment (Figure 2A).\nUpon pupation, collect pupae with a small, damp paintbrush and place in empty vials prior to eclosion to prevent adult flies from being exposed to the larval diet.\nTransfer adult flies to food vials of standard lab diet as they eclose. One to five days after eclosion, separate flies based on sex.\nDesignate half of the collected adults each to the experimental and control groups. Maintain flies in vials of standard lab diet at a concentration of 50 flies per vial.\nTransfer adults to fresh food vials every two days to prevent them from getting stuck during exercise. Add several grains of supplemental live yeast to the new food immediately before introducing the flies.",
    "NOTE: While it is possible to maintain flies without a live yeast supplement, we have found that the adult flies perform best with supplementation. Live yeast supplementation is a variable that could be modified to suit the researcher's experimental goals.\n3. Exercise Protocol\nOn the first day of exercise (Day 1), push vial plugs to leave 1 cm of space in control vials and 6 cm of space between the food and the plug in exercise vials (Figure 1C).\n\tNOTE: The control vials will have limited space for flies to move while on the exercise machine and thus flies will engage in much less movement than in exercise vials.\nPlace vials in the clamps, and then give the flies 10 min to acclimate on the machine (Figure 1B).\n\tNOTE: An alternative control is to maintain the unexercised flies on the benchtop adjacent to the exercise machine with 6 cm of space (in the vial) to move normally. Similar results of exercise relative to both the \"1 cm on TreadWheel\" and the \"6 cm on benchtop\" controls have been found11.\nTreat both control and exercise flies to rotation on the machine at constant room temperature for 5 consecutive days per week with alternating bouts of rotation and rest (Figure 1D).\n\tNOTE: A constant temperature is needed to avoid the confounding effects of the temperature on activity levels. For temperature manipulation studies, place the TW inside an incubator to modify temperature treatments during exercise training.\n\t\nRun the machine for four 15 min bouts of exercise on Day 1. Alternate these bouts with 5 min rest periods.",
    "Each of the following days, add 5 min of exercise to one of the preexisting exercise bouts. For example, on Day 2, make the first exercise bout 20 min long, but maintain the rest of the bouts at 15 min long.\nOn Day 3, exercise flies for 20 min during the first two bouts and 15 min for the following two bouts.\nOn Day 4, use 20 min exercise bouts for all except the final bout, which should only be 15 min long.\nOn Day 5, keep all exercise bouts 20 min long.\n\t\tNOTE: During rest periods, the vials containing the flies should remain securely clamped on the TW. The orientation of the vials during these periods is not relevant because the gravitational force experienced by all flies will be coming from the same direction.\nAfter completing the exercise treatment for a given day, return the food vial plugs to their normal positions and return flies to their incubators until the next day.\nAfter completion of the full exercise regime, anesthetize flies using standard fly CO2 anesthesia methods. Then transfer flies to new food vials or microcentrifuge tubes for assessment of phenotypic characteristics of interest.\n\tNOTE: Example phenotypes include climbing ability (food vial), triglyceride storage (microcentrifuge tube), or gene expression (microcentrifuge tube). The protocol can be paused here with samples stored appropriately depending on the assessments to be performed. Assays involving living flies will need to be conducted promptly in accordance with the specific goals of the phenotypic assay.\n4. Climbing Assessment\nAfter one day of rest following completion of the exercise protocol, test general fly climbing performance using a rapid iterative negative geotaxis (RING)-like negative geotaxis climbing assay22.",
    "Place groups of 10 flies in empty vials using CO2 anesthesia (or tapping directly from food vials if already sorted) and seal with paraffin film to prevent the flies from escaping. Give the flies at least 10 min to acclimate to the new vial. To prevent vials from tipping over, tape a ~5 cm diameter cardstock circle to the bottom of vial to provide extra surface area.\n\t\tNOTE: Vial plugs should not be used because they impede part of the vial used to determine height climbed.\nPlace vials 20 cm in front of a 1 cm x 1 cm grid in full view of a mounted, stationary camera with a built-in timer (a smart phone with a timer camera application works well).\nTap vials gently on the counter three times to knock all flies down to bottom of the vial. After tapping the vial down the third time, immediately start the 4 s camera timer to capture an image to determine the height climbed by each fly.\n\t\tNOTE: Tapping should be done at a consistent intensity and by the same researcher in each exercise-control contrast to minimize variation in the flies' responses due to tapping.\nRepeat step 4.1.3 twice, with at least 1 min rest between trials, to produce a total of three trials per vial.\nTo preserve the flies for other analyses, immediately after the climbing assay has been completed, flash freeze the flies by immersion in liquid nitrogen.\nUse a shallow, open-topped dewar flask filled to a depth of ~5 cm with liquid nitrogen.",
    "Transfer flies to small microcentrifuge tubes using CO2 anesthesia and then place tubes in the dewar flask filled with liquid nitrogen. Alternatively, if future analyses require avoidance of CO2, snap freeze the flies directly in their climbing vials by gently tapping flies to the bottom of their vial while the bottom is submerged in liquid nitrogen, and then transfer the frozen flies to microcentrifuge tubes using forceps.\n\t\tNOTE: Liquid nitrogen is cryogenic and should only be used with proper protective equipment and room ventilation.\nProcess images using the ImageJ23 multi-point selection tool.\nOpen up an image for processing within ImageJ.\nSet a 1 cm scale based on the background grid paper to calculate the distance climbed by each individual fly. Use the \"Line Tool\" from the tool bar to trace one side of a 1 cm2 square from the background grid paper. Click on the \"Analyze\" tab and select \"Set Scale\". Set the \"Known Distance\" as '1.00' and \"Unit of Length\" as 'cm', make sure \"Global\" is unchecked, and click on \"OK\".\nSelect the \"Multi-point Selection\" icon from the tool bar and zoom in on the bottom of the vial in the image. Set the first point as the very bottom of the vial by clicking on the lowest part of the vial.\nClick on the center of each fly in the vial to mark it as a data point. Take note that there are a total of 11 points per vial, one marking the bottom of the vial and one for each fly.\nClick on the \"Analyze\" tab and select \"Measure\" to generate a table of measured values. Save table in as a csv file.",
    "Open the csv file in a spreadsheet program and calculate the exact distance climbed by each fly by subtracting the y-values of points 2-11 from point 1 in the measured values table.\nRepeat steps 4.3.1 through 4.3.6 for each image.\n5. Triglyceride Storage Assay\nNOTE: The samples, standards, glycerol standard solution, and triglycerol working solution used throughout the assay should be kept on ice for the duration of the protocol and should be stored in the refrigerator when not in use.\nPrepare standards using the Glycerol Standard solution.\nMake the Blank (B) by adding 1,000 µL of homogenization buffer to a microcentrifuge tube labeled B.\nMake Standard 1 (S1), 2.5 mg/mL per well, by adding 1,000 µL of the glycerol standard solution to a microcentrifuge tube labeled S1.\nMake Standard 2 (S2), 1.25 mg/mL per well, by adding 500 µL of the glycerol standard solution to 500 µL of diH2O in a microcentrifuge tube labeled S2.\nMake Standard 3 (S3), 0.625 mg/mL per well, by adding 250 µL of the glycerol standard solution to 750 µL of diH2O in a microcentrifuge tube labeled S3.\nMake Standard 4 (S4), 0.3125 mg/mL per well, by adding 125 µL of the glycerol standard solution to 875 µL of diH20 in a microcentrifuge tube labeled S4.\nPrepare triglycerol working solution from the Serum Triglyceride Determination Kit.\nAdd 40 mL of diH2O to the free glycerol reagent from the kit and mix by inverting bottle.\nAdd 10 mL of diH2O to the triglyceride solution from kit and mix by inverting bottle.\nCombine glycerol reagent and triglyceride solution and mix by inverting to prepare the triglycerol working solution.",
    "NOTE: The triglycerol working solution is good for 60 days and can complete four 96-well plate assays per kit using the protocol below. The volumes used are proportionally scaled down from the official Serum Triglyceride Determination kit for use in the 96-well plate format.\nVerify Blank and Standards by carefully pipetting 5 µL of each standard into a 96-well flat bottomed, clear microplate in triplicate (or quadruplicate for the blank).\nAdd exactly 125 µL of Triglycerol Working Solution to each well containing a standard. Allow solutions to react for 30 min.\nPlace a 96-well plate in a spectrophotometer and read the absorbance at 540 nm. Use the absorbance measurements to create a standard curve and verify the accuracy of standards by evaluating the R2 value. If the R2 for the standards is less than 0.98, re-prepare the standards more carefully.\nBegin Day 1 of the assay for triglyceride storage14 using microcentrifuge tubes containing 10 frozen flies each.\n\tNOTE: A repeat or multi-channel pipette should never be used in this step because the amounts of each reagent used in the assay must be very accurate and consistent to get reproducible results. In our experience, repeat and multi-channel pipettes do not have this degree of accuracy and consistency. Each aliquot from a single channel pipette can be visually confirmed by the experimenter for quality control and any single channel pipette-specific biases will be experienced by all samples to the same degree.\n\t\nPrepare a 200 mL stock of Homogenization Buffer by combining 0.272 g of KH2PO4, 400 µL of 0.5 M EDTA, and 199.6 mL of diH2O in a glass bottle.\nAdd exactly 100 µL of homogenization buffer to each of the 40 microcentrifuge tubes containing 10 adults frozen after the climbing assay. Then, centrifuge samples for 30 s at 18,000 g.",
    "Grind flies using a motorized grinder and pestle (or another form of tissue homogenization) to prepare a milky solution. Make sure a fresh pestle is used for each sample. Then, centrifuge samples for 2 min at 18,000 g.\nPipette only the top 75 µL of supernatant fluid from each tube into new microcentrifuge tubes. Ensure that no fly bits from the pellet are transferred over. Place new tubes in the refrigerator overnight.\nBegin Day 2 of the triglyceride protocol by removing Day 1 samples from the refrigerator.\n\tNOTE: Step 5.5 can be performed the same day as 5.4 but we have found the signal for triglyceride concentration to be more robust after a night in the refrigerator. However, the time between Steps 5.4 and 5.5 should not exceed 36 h.\n\t\n(Optional) Vortex the first tube with supernatant fluid for 10 s and pipette 5 µL into a clean microcentrifuge tube. Add 95 µL of 0.15 M NaCl into the new microcentrifuge tube. Store these subsamples in the -20 °C freezer for a later assay of protein if desired.\n\t\tNOTE: These samples of supernatant with the added NaCl solution can be used to determine protein content using the researcher's preferred assay. We use the Bradford Method24. The protein content is one way to standardize the measure of triglyceride content, but the researcher should also be cautious in interpreting these ratios since exercise and diet can also affect protein storage.\nFor the original supernatant vials, vortex the first tube with supernatant fluid for 10 s, then pipette 5 µL into two separate wells of a 96-well microplate to produce technical replicates. Be sure to note which wells are used for each sample.Repeat this step for the 39 other tubes.",
    "Pipette exactly 5 µL of the blank into four wells of the microplate, and for the remaining wells, pipette exactly 5 µL of each standard in triplicate.\nAdd exactly 125 µL triglycerol working solution to each well, and allow solution to react for 30 min.\nPlace the 96-well plate in a spectrophotometer and read the absorbance at 540 nm.\nConvert absorbance values into concentration (mg/mL) using the standard curve calculated from the standards."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}