{
  "id": 8833,
  "origin_website": "Jove",
  "title": "Examining Monosynaptic Connections in Drosophila Using Tetrodotoxin Resistant Sodium Channels",
  "procedures": [
    "1. Prepare Flies and Identify GAL4 promoter Lines\nSelect a GAL4 promoter line and cross it with flies carrying both the UAS-NaChBac transgene and an optogenetic transgene for activation.\n\tNOTE: UAS-CsChrimson11 is selected due to its high conductance and the ease with which it activates NaChBac-mediated action potentials. Both UAS-NaChBac and UAS-CsChrimson are available from the Bloomington Stocks Repository.\nPrepare all-trans retinal as a stock solution in ethanol (35 mM) and store the solution in freezer at -20 °C.\nMix 28 µL of this stock into approximately 5 mL of rehydrated potato flake food and add this mixture to the top of a vial of conventional Drosophila medium.\nRaise adult flies expressing csChrimson on food containing 0.2 mM all-trans-retinal for 1–3 days11.\n2. Prepare TTX Stock\nCreate a stock solution of 1 mM TTX in distilled or deionized water. Store this solution in a lab refrigerator for several months. Check the institutions policies regarding the storage of TTX as many institutions classify TTX as a hazardous or controlled substance.\n3. Prepare Flies for Electrophysiology\nCollect 1–3 day old adult flies that are raised on the food with all-trans-retinal.\n\tNOTE: Refer to Murthy and Turner in 2013 for a detailed description of patch clamping Drosophila neurons12,13.\nPut the flies in a glass scintillation vial. Place the vial onto ice for 1 min to immobilize the flies.\nUse coarse forceps to insert a fly into a custom-made recording chamber. The chamber consists of a 3 ½\" circle laser cut from 1/16\" acrylic. Cut a ¾\" hole is into the center where a custom foil is attached with 2-part epoxy. The foil contains a triangular shaped hope that the fly is inserted into.\nApply wax or UV curable epoxy around the animal to firmly secure it within the recording chamber.",
    "Illuminate the preparation with a gooseneck optical fiber for visualization under a stereomicroscope. Set the gooseneck fibers for oblique illumination by adjusting them so that they illuminate the fly directly from the side.\nAdjust the light level to lowest possible setting that still allows clear visualization of the fly. This light intensity will vary across individual experiments.\n\tNOTE: This protocol can be adapted by using an in situ brain explant method14.\nRetrieve external recording saline. The saline contains in mM: 103 NaCl, 3 KCl, 5 N-tris(hydroxymethyl)methyl-2- aminoethane-sulfonic acid, 8 trehalose, 10 glucose, 26 NaHCO3, 1 NaH2PO4, 1.5 CaCl2, and 4 MgCl2 (adjusted to 270–275 mΩ). The saline is bubbled with 95% O2/5% CO2 (carbogen) and has a pH adjusted to 7.315.\nPlace 4-6 drops of extracellular recording saline over the fly preparation. At this point, increase the light level at the dissection microscope for better visibility.\nSharpen a tungsten wire using electrolysis. To make the wire, prepare a saturated solution of KNO3 and apply approximately 20 V of AC current while dipping the tip of the wire into the solution 20 times for 100 ms each until the tip is sharpened. Use the sharpened tungsten wire to remove the cuticle on the head of the fly and thus exposing the brain.\nFurther expose the brain by removing trachea and fat bodies that surround it. If accessing the antennal lobes, use a bent tungsten wire or similar tool to gently tuck antennae underneath the foil recording chamber to increase visibility. Use sharp forceps to gently tear away the glial sheathing covering the area of interest where recordings will be made.",
    "Transfer the recording chamber to the electrophysiology rig. Immediately start perfusion with external recording saline bubbled with carbogen to preserve the brain. The saline solution reservoir is placed above the microscope stage and is gravity-fed to the preparation. Use a vacuum line and a 2 L Erlenmeyer flask to collect the waste saline.\n4. Obtain Whole-cell Recording\nPull patch pipettes on a commercial pipette puller. Consult the manual for settings to achieve an appropriate pipette with a tip resistance near 7 mΩ.\nAdd 4 µL of internal recording solution into a patch pipette. The internal saline consists of 140 potassium aspartate, 10 HEPES, 4 MgATP, 0.5 Na3GTP, 1 EGTA, and 1 KCl in mM.\nSet up patch clamp amplifier for whole-cell recording. Zero the amplifier's offset and set the amplifier to deliver test pulses. Here, an AM systems Patch clamp amplifier 2,400 is used.\nApply positive pressure through the pipette and approach the cell. Use a micromanipulator to direct the pipette and contact the cell. Release positive pressure. Set the holding potential of the membrane to -60 mV. The pipette should form a gigaohm seal with the cell's membrane as evidenced by a low sub-picoamp holding current.\n\tNOTE: If using GFP guided cell targeting, try to minimize use of epifluorescent light to prevent ChR2 activation and potential synaptic depression. Also wait for a few minutes before applying step 5.\nSet the amplifier to deliver test pulses from -50 mV to -60 mV. This setting is standard on patch-clamp amplifiers. Test pulses will reveal a large capacitative transient representing the current necessary to charge the patch pipette. Remove capacitative transients by adjusting the capacity compensation knobs on the AM 2400 or similar amplifier.\nApply brief pulses of negative pressure to rupture the cell membrane and obtain whole-cell configuration.",
    "NOTE: A whole cell configuration is observed when there is a large increase in the capacitative transients showing the capacitance of the neuron. A small increase in the holding current (baseline) will likely also be observed. Set the amplifier to current clamp mode and adjust the cell's potential to -50 to -60 mV.\n5. Test Synaptic Connectivity\nConfigure the data acquisition (DAQ) system to trigger an LED driver to generate light pulses. Here, a National Instruments DAQ system is used with Matlab to deliver an analog signal to a LED driver. The LED intensity is adjusted via the analog signal to the driver. The LED is a 620-630 nm wavelength LED.\nPosition the high-powered red LED directly underneath the preparation. Adjust the light intensity so that 0.238 mW/mm2 reaches the fly.\nActivate presynaptic neurons while recording from the postsynaptic cell of interest. Achieve cell activation optogenetically, pharmacogentically, or via nerve stimulation. Here, csChrimson and brief pulses of red light are applied.\n\tNOTE: Synaptic connections can be monitored either in current clamp as EPSPs or voltage clamp as EPSCs. A synaptic connection should be visible before applying TTX in response to a 40 ms light pulse. If no connection is observed, it is unlikely that the neurons are synaptically connected either mono- or polysynaptically. The holding potential may be adjusted to emphasize excitatory or inhibitory connections accordingly.\nIf a connection is observed in normal saline, add TTX to the perfusion system to achieve a final concentration of 1 µM. Use a recirculating pump to capture and reuse the saline to conserve TTX. The peristaltic pump will draw the saline solution from the bath and return it to the saline reservoir.",
    "Adjust the pump's speed to provide a strong constant vacuum that does not allow that saline level in the bath to rise and fall.\n\tNOTE: The application of TTX should result in the cessation of spiking activity in the neuron that is being monitored in whole-cell. This confirms that enough TTX has been added to the saline.\nApply brief pulses of red light (40 ms for each pulse) again. At this point, any synaptic connection that remains is likely monosynaptic. Add pharmacological antagonists to the recirculating saline to test the chemical nature of the synaptic connections that remain in TTX.\n\tNote: When combining optogenetics and fluorescent targeting of neurons, it may be important not to persistently activate the presynaptic population of neurons while trying to obtain a recording. This can lead to synaptic depression and makes it difficult to see connections. Because csChrimson has a long excitation band that extends broadly into the range of green fluorescent protein, a red fluorophore can be used to visualize neurons and channel2rhodopsin (Ch2R) can be used to excite cell populations. Doing so requires specific genetics and a custom filter cube. To generate suitable flies, make flies that express the red fluorophore (RFP or mCherry) under the LexA or Q system binary expression systems. These will need to be crossed with flies expressing a Gal4 promoter and UAS-Ch2R and UAS-NaChBac effector genes. The optimal filter cube for epifluorescence will have a narrow excitation range to excite the red fluorophore, but not excite the Ch2R. Additionally, the filter set should include a long pass emission filter to collect as much emitted light. We used a custom filter set from Chroma that included part numbers et580/25x and t600lpxr (from the 49306 set), but with an et610lp barrier/emission filter.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}