{
  "id": 17322,
  "origin_website": "Jove",
  "title": "Measurement of Heart Contractility in Isolated Adult Human Primary Cardiomyocytes",
  "procedures": [
    "All methods were carried out in accordance with relevant guidelines and regulations. All human hearts used for the studies were non-transplantable and ethically obtained by informed legal consent (first person or next-of-kin) from cadaveric organ donors in the United States (US). The recovery protocols and in vitro experimentation were pre-approved by Institutional Review Boards (IRBs ) at transplant centers within the US Organ Procurement Transplant Network (OPTN). Furthermore, all transfers of the donor hearts are fully traceable and periodically reviewed by US federal authorities.\nNOTE: Apply all necessary safety procedures during the execution of this protocol, including wearing appropriate personal protective equipment (e.g., laboratory coats, safety glasses, gloves).\n1. Isolation of cardiomyocytes (1 day before measuring contractility)\nRe-perfuse donor hearts immediately on arrival at the laboratory with ice-cold proprietary cardioplegic solution6 and isolate enzymatically adult human primary myocytes from the ventricles11,12,13,14,15.\nThen, maintain the cardiomyocytes in suspension and store them with 10 mL of solution A (110 mM sucrose, 0.005 mM CaCl2, 3 mM MgCl2, 70 mM KOH, 60 mM lactobionic acid, 10 mM KH2PO4, 20 mM taurine, 20 mM L-histidine, 20 mM HEPES, 2 mM L-glutamic acid, 2 mM L-(-)-malic acid, pH 7.4 with KOH) in 20 mL Wheaton vials (Table of Materials) at a refrigerated temperature until they are experimentally interrogated.\n\t​NOTE: Store 200,000 cells per vial.\n2. Laminin coating preparation (1 day before measuring contractility)\nPlace a single glass coverslip (25 mm x 25 mm square, Table of Materials) in each well of an eight-well culture plate (Table of Materials).",
    "Then, coat the coverslips with laminin at a 5 µg/mL concentration. To do so, add 800 µL of the human recombinant Laminin 521 stock (Table of Materials, stored at −20 °C) to 7.2 mL of solution B (145 mM NaCl, 4 mM KCl, 2.5 mM CaCl2, 1 mM MgCl2, 11.1 mM glucose, and 10 mM HEPES, pH 7.4 with NaOH) and mix well.\nDrop 200 µL of the diluted laminin solution into the center of each coverslip. Then, cover the plate and stack it in a 4 °C fridge.\n\tNOTE: Prepare multiple eight-well culture plates to ensure there are enough laminin-coated coverslips.\n3. Preparation of Ca2+-tolerant cardiomyocytes (on the day of measuring contractility)\nRemove a vial of cells from the fridge, aspirate solution A from the vial and add a refrigerated 10 mL of solution B.\n\tNOTE: Ensure the cells are not suctioned and disperse solution B into the vial by placing the pipette on the inside of the top of the vial wall.\nCap the vial of cells and then gently swirl to ensure the cells are dispersed throughout solution B. Finally, allow the cells to settle for 1 h at room temperature (RT).\n4. Preparation of the recording system (on the day of measuring contractility)\nNOTE: The recording system includes a temperature control box, stimulator, computer-controlled pressure-driven perfusion, pressure-driven perfusion bottles, in-house acquisition software permitting the selection of regions of interest (ROIs) and display of contractility transients, inverted microscope, cell chamber, and camera (Figure 1).\nTurn on the suction vacuum system. Then, remove the microscope cover, turn it on, connect the camera (Table of Materials, Figure 1), and finally, confirm the fan is turned on to ensure the camera does not overheat.",
    "Then, turn on the microscope heating plate (Table of Materials) and temperature control box (Table of Materials, Figure 1), and set them to the proper operating temperature. Next, turn on the field stimulator (Table of Materials, Figure 1) and the pressure system. Finally, connect the solution's tubing (Table of Materials) to the recording chamber (Table of Materials, Figure 1).\n5. Preparation of test compounds (on the day of measuring contractility)\nDilute dimethyl sulfoxide (DMSO; Table of Materials) 1,000-fold in solution C (145 mM NaCl, 4 mM KCl, 1.8 mM CaCl2, 1 mM MgCl2, 11.1 mM glucose, and 10 mM HEPES, pH 7.4 with NaOH) to make a 0.1% DMSO vehicle solution.\nTo test a compound at 1-fold, 10-fold, 100-fold, and 1000-fold of its therapeutic exposure of 0.001 µM, dissolve the test compound in DMSO at a concentration of 1 mM.\nDilute this solution serially with DMSO to produce three further DMSO stocks (e.g., 0.001 mM, 0.01 mM, and 0.1 mM). Finally, dilute each test compound stock 1,000-fold in 100 mL of solution C to obtain final test concentrations (0.001 µM, 0.01 µM, 0.1 µM, and 1 µM).\nAdd the vehicle solution and solutions of final micromolar concentrations of the compound to 100 mL glass bottles (Table of Materials, Figure 1) and then connect the bottles to the pressure-driven perfusion system (Table of Materials, Figure 1).\nThen, prime the perfusion system with a computer-driven program (Table of Materials) using a pressure of 200-300 mbar to deliver a constant perfusion flow at a rate of 1.8 mL/min.\n\tNOTE: Do not conduct the experiment if the test compound is found to be associated with a solubility issue. Also, formulate the compound test solutions from stock solutions within 30 min prior to experimental application to the cells.",
    "6. Plating of cardiomyocytes (on the day of measuring contractility)\nTake an eight-well plate containing laminin-coated coverslips out of the 4 °C fridge and carefully place one coverslip in a very well-cleaned recording chamber (Figure 1). Then, return the eight-well plate to the 4 °C fridge until the next plating.\n\tNOTE: Use a lint-free wipe (Table of Materials) to wipe up the coated coverslip while keeping the coverslip coated in a thin layer of laminin. Also, ensure to dispose of used coverslips in a sharps container.\nThen, take an escalated vial of cells (step 3.2) and aspirate solution B from the vial to reach as small a volume as possible without losing cells (~200 µL). Next, dispense the 200 µL of cells into the recording microscope chamber mounted on the stage of an inverted microscope (Table of Materials).\nLet the cells settle on the coverslip for 5 min. While waiting for the cells to fully settle, open the field of view on the microscope and determine if the cell density is adequate (~70%) for the experimental run to begin.\n\t​NOTE: Ensure the suction does not aspirate all the cells away if more than 200 µL are dispensed.\n7. Recording of cardiomyocyte contractility\nAfter plating is completed, equilibrate the cells for 5 min by continuously perfusing them with solution C using the pressure-driven perfusion system (Table of Materials). Adjust the suction correctly, turn on both the temperature control box and heating plate, and set them to deliver ~35 °C.\nThen, stimulate the cells with supra-threshold voltage at a 1 Hz pacing frequency (bipolar pulse of 3 ms duration) on a field stimulator with a pair of platinum wires placed on opposite sides of the chamber connected to a field stimulator.",
    "Set the amplitude of the stimulating pulse at 1 V, and then increase it until the cardiomyocytes start generating contraction-relaxation cycles. Use a value of 1.5x threshold throughout the experiment.\n\tNOTE: Select healthy cells with rod-shaped morphology and clear striations. Then, adjust the field of view and focus on bringing as many contracting cells as possible into view (Figure 2A).\nNext, display the digitized images of the cells within the acquisition software of the optical contractility recording system. This software utilizes a high-resolution, high-frame rate camera with a rate of 150 FPS (Table of Materials, Figure 1) to record a video stream containing multiple myocytes in the same frame.\n\tNOTE: This provides sufficient temporal and spatial resolution to capture and measure the sarcomere dynamics of several healthy myocytes simultaneously. Modern high-core-count processors are leveraged to enable the parallel calculation of changes in sarcomere length from the video stream in real time (optical density data are collected from user-defined regions of interest [ROI] placed over the images of healthy cardiomyocytes and parallel to the axis of contraction, Figure 2B). The optical intensity data show bright and dark bands corresponding to the Z-lines of the cardiomyocytes (Figure 1, Figure 2C). Finally, these data are displayed to the user for monitoring purposes and saved to a disk for later analysis (Figure 2C).\n\t\nAvoid areas of the cells that are not in focus. Also, do not position the ROIs close to the edge of the cells, as the changes in the cells' contraction during the application of drugs can cause the ROIs to be unable to read the cells' contraction.",
    "When the selection of ROIs is completed and the contractions meet the necessary standards for use (e.g., sarcomere shortening >1%; rhythmic contraction upon application of a 1 Hz pacing frequency, absence of arrhythmic events), start the experiment to assess the effects of a compound. The stimulation protocol and the sequence of the compound's application of test concentrations are shown in Table 1. The acquisition software will manage, in an automated fashion, the acquisition and display of data and labeling of test concentrations and treatment time.\n\tNOTE: Apply test concentrations if the contraction remains at a stable amplitude throughout the entirety of the baseline vehicle period. Disqualify cells displaying either a run-up or run-down. Also, ensure perfusion is switched to the different test concentrations throughout the experiment.\nUpon completion of the experiment and data storage on the server, switch off the perfusion and heater, stop the stimulation, clean the microscope chamber with distilled water, then remove the glass coverslip, and dry the chamber thoroughly.\n\tNOTE: Clean the chamber thoroughly as this is critical to avoid exposing the next set of cells to any compound prematurely, thus invalidating any data collected.\nNext, perform a new plating of cardiomyocytes and perform an additional experiment to obtain enough data for completing the testing of the compound or testing a new compound.\n8. Turning off the optical contractility recording system\nWhen daily testing of the compound(s) is completed, first switch off all equipment that is not necessary to clean the system and copy the data for offline analysis.",
    "Next, remove the 100 mL glass bottles (Table of Materials) containing solutions of final test concentrations and replace them with glass bottles halfway filled with RBS 25 Concentrate solution (Table of Materials). Perfuse RBS solution through the microscope chamber for 5 min, then disconnect the perfusion tubing from the chamber, clean it with distilled water, and finally, dry it thoroughly.\n\tNOTE: Ensure the vacuum is working well to prevent any possible flooding.\nNext, connect the perfusion tubing to the drainage tubing. Using the software of the pressure-driven perfusion system (Table of Materials), run the RBS solution for 10 min while ensuring the pressure and flow rate are adequately set. Then, perfuse 1% DMSO for 5 min and then distilled water for 15-20 min to complete the cleaning of the perfusion system.\nTurn off the microscope light and put its cover. Then, unplug the camera wires from the box on the side of the microscope and turn off the fan. Ensure that all used bottles are sent for cleaning and autoclave. Finally, ensure all drainage buckets are 1/4 full or less.\n\tNOTE: Make sure there are enough laminin-coated coverslips for use the following day.\nFinally, copy the files in the acquisition folder of all the experiments done on each recording system and paste them into a secure backup server for additional offline analysis. Next, delete all the data files from the acquisition folder.\n9. Analysis of contractility data\nPerform offline analysis using the analysis software and a custom-made macro to average the data. The analysis software calculates and reports various metrics from the sarcomere dynamics data produced by the acquisition software. A detailed list of these parameters is provided in Figure 2D.",
    "NOTE: The application of low-level software techniques allows many runs of recordings to be analyzed in 5 s. The principal parameter to assess drug-induced changes in contractility is the contractility amplitude (sarcomere shortening % = change in sarcomere length). It is calculated as the sarcomere length at peak contraction/resting sarcomere length and averaged over the last 20 contractility transients for each test concentration.\nQuantify the test compound effects on the averaged contractility amplitude relative to each cardiomyocyte's specific baseline vehicle control condition.\nExpress the average results as mean ± SEM and produce a graph plotting the concentration effect of the test compound on the contractility amplitude. Next, fit the concentration-response curve to the Hill equation using analysis software (Table of Materials) to derive IC50 (concentration producing a 50% inhibition of contractility amplitude) and EC50 (concentration producing a 50% increase in contractility amplitude) values.\nIn addition to the contractility amplitude, you can also calculate other parameters:\n\t\nAftercontraction: Identify aftercontraction as a spontaneous secondary contraction transient of the cardiomyocyte that occurs before the next regular contraction and produces an abnormal and unsynchronized contraction.\nContraction failure: Identify contraction failure as the inability of the electrical stimulus to induce a contraction.\nShort-term variability (STV) and alternans: Visualize these two parameters in Poincaré plots of contraction amplitude variability.\n\t\t\nCalculate the STV (∑|CAn + 1 − CAn| (20 × √2)−1) with the last 20 transients of each control and test article concentration period. Identify alternans as repetitive alternating short and long contractility amplitude transients.\nTo calculate the incidence of pro-arrhythmia, normalize the STV values to the vehicle control value of each cell, plot aftercontraction, contraction failure, STV, and alternans, and express them as % of the incidence of cells exhibiting each of the signals.",
    "Complete the multiparametric mechanistic profiling with the calculation of time Ato peak, decay to 30% relaxation (Decay 30), decay to 90% relaxation (Decay 90), time to 90% relaxation (TR90) (Figure 2D), baseline sarcomere length, time to 50% peak, peak height, sarcomere length at peak contractility, maximum contraction velocity, and maximum relaxation velocity12. Like the contractility amplitude, express these parameters relative to each cardiomyocyte's specific baseline control condition and graph them in concentration-response plots."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}