{
  "id": 9308,
  "origin_website": "Jove",
  "title": "Simultaneous Long-term Recordings at Two Neuronal Processing Stages in Behaving Honeybees",
  "procedures": [
    "1. Electrode Building (Figure 1)\nProduction of an electrode adapter that fits the electrode interface board of commercial multi channel amplifier systems1,2,25.\n\t\nUse a small Plexiglas plate glued to an 18 Pin connector base.\nConnect the base with 3 short pieces of insulated wire to 3 separate soldering lugs screwed onto the Plexiglas plate (Figure 1 A1-A3).\nInsert a groove into the Plexiglas plate in which a glass capillary can easily move and be held in place by a screw (Figure 1 B1).\nExtend the glass capillary about 5 mm using a minutien pin.\nAttach the micro electrode wires along the minutien pin and the glass capillary to guarantee stabilization and support.\nMulti-channel micro wire production (adopted from Ryuichy Okada32,33)\n\t\nSpan 3 micro wires (polyurethane coated copper wire, 15 µm diameter) in a way that they are placed next to each other (Figure 1 B2).\nUse a 12 V soldering needle to spread a thin film of low melting dental wax (50 °C) partially along the wires to glue them together (electrode tip) (Figure 1 B3). Leave a few centimeters unglued (electrode end) as this section will be used later to connect the micro wires with the electrode adapter.\nConnect the multi channel micro wire to the electrode adapter\n\t\nRemove the glass capillary from the holder and attach it with the minutien pin to the electrode tip. Bring it into a position parallel to the micro-electrode (Figure1 B3).\nGlue the electrode tip to the minutien pin using low melting dental wax and cut the micro electrode at the tip, protruding 2-3 cm from the minutien pin and at the electrode end (small arrows Figure 1 B3).\nSlip the capillary slightly back into the electrode adapter. Use the screw to fix it (Figure 1 B4).",
    "Solder the loose ends of the three wires to the soldering lugs using a soldering gun with a temperature of around 360 °C to ensure melting of the insulation (Figure 1 B4). After soldering, ensure that there is adequate electrical contact (~300 kOhm).\nMount one of the electrodes (master) to the electrode interface board of the headstage and fix the other multi channel electrode (slave) on a separate adapter. Connect the channels of the slave to the master electrode (Figure 1 C1). Additionally, solder the reference as well as muscle electrodes to the master electrode base (Figure 1 C2).\n2. Bee Preparation (Figure 2)\nIn these described experiments, the honeybee (Apis mellifera), which is an invertebrate animal and therefore does not require specific ethical permits for usage, is used.\nCatch honeybee foragers (A. mellifera) at the hive entrance in the morning as shown by others34,35.\nChill the bees on crushed ice till immobilization (5 to 10 min) and fix one in a standard Plexiglas holder or metal tube in a way that the head is exposed (Figure 2 A). For minimizing head movements use low-melting dental wax (~50 °C) and fix the head carefully to the holder around the basis of the compound eyes and the neck.\nUse low melting wax to fixate the scapi of the antennae on the head capsule (Figure 2 B) without touching the flagellum. The flagellum of the antenna needs to be pointed forward. Ensure that the bee can freely move its proboscis.\nShave the head capsule to ensure an undisturbed view and access to the top of the head.\nFeed the bee with a 30% sucrose solution until saturation to ensure sufficient moistening of brain tissue and good viability of the animal (Figure 2 C).",
    "Make careful incisions vertically along the borders of the compound eyes and horizontally above the antennal bases as well as beneath the ocelli and remove the loosened piece of cuticle (Figure 2 D).\nCarefully set aside hypopharyngeal glands and remove the trachea to ensure a clear view and access to the brain prior to electrode insertion (Figures 2E, 2F).\n3. Electrode Insertion\nIn the example case illustrated in Figure  2, one electrode is positioned aiming at the l-ALT, the other one aiming on the m-ALT2. Using particular landmarks, other target regions are possible as well, for example the AL and MB output regions1.\nPosition the electrodes using micromanipulators at the region of interest (Figure 2G and 3A). To target the m-ALT place the electrode between the AL and medially from the vertical lobe of the MB. Ensure the insertion site being above the branching point of the mediolateral ALT PNs. Protrude the electrode into the brain with a depth of about 180 µm (Figure 2E). For l-ALT PN recording place the electrode below the lateral protocerebrum (the LH) in the middle of an imaginary line between the lateral side of vertical lobe and the middle of the AL. Insert the electrode with a depth of about 300 µm (Figure 2E)\nInsert the reference (silver wire, about 25 µm diameter) into the ipsilateral compound eye through a small cut in the cuticle. Insert another silver wire into the muscle projection region below the lateral ocelli. NOTE: If necessary the learning behavior of the bee can be monitored with high temporal precision by recording the muscle M17, which is involved in the proboscis extension response (PER) of the bee36 as described in25.",
    "To solidly anchor the electrodes within the brain and the head capsule, cover the entire space above the brain with two component silicon (Figure 2H), which will prevent the brain from drying out. NOTE: the recordings can last for hours up to days, and the bees can for example be recorded during a classical conditioning procedure (Figure 2H) or stimulated with a large panel of different odors.\n4. Data Acquisition and Preprocessing\nUse proper acquisition software that meets the following requirements: sampling rate of min 25 kHz; analogue1,25 or digital2 cross differentiation between the electrode channels; band pass filter from 300 Hz to 8,000 Hz to extract spike events.\nUse available spike sorting software to extract single unit activity, for example template matching techniques as included in the Spike2 software (Figure 3).\nFor further analysis use the time stamps of the extracted units to compute single unit averaged odor responses (Figure 4) or to calculate population vectors for Principal Component Analysis (PCA) (Figure 5) using commercially available software. To further analyze single unit and population response latency please compare recent publications1,2,25.\n5. Visualization of Relative Electrode Position (Figure 4)\nDip the electrodes tips into a solution of either 5% Alexa hydrazide 568 or 5% Alexa hydrazide 488 which is dissolved in 0.5 M potassium chloride solution prior to the recording experiments.\nRemove the electrodes and the covering silicon carefully after the experiments, rinse the brain with bee Ringer solution, remove glands and trachea and insert tiny crystals of tetramethylrhodamin dextran or insert a 5% solution solved in 1.0 M potassium acetate into the AL to label the ALTs anterogradely. Perform the following steps in darkness.",
    "Allow the dye to be taken up and transported by the projection neurons along their axonal tracts (30-45 min) (Figure 4A), before washing the brain with bee Ringer solution three times for another 30-45 min.\nChill the bee on ice until immobilization and carefully remove the brain from the head capsule. Fixate the brain by rinsing it in a 0.1 M PBS solution containing 4% formaldehyde and keep it overnight at 4 °C.\nWait at least 12 hr before washing the brain two times in 0.1 M PBS (10 min each).\nWash the brain 3x for 20 min in 0.2% Triton X-100 diluted in 0.1 M PBS before dehydrating it in an ascending alcohol series (30%, 50%, 70%, 90%, 95%, 3x 100% ethanol, 20 min each step).\nEmbed the dehydrated brain in Methylsalicylate on a microscope slide and seal it with a cover slide.\nUse a confocal laser scanning microscope and scan the brain as optical sections every 2-5 µm using a Harmonic Compound Plan Apochromat objective (10X 0.4 NA immersion). Excite the tissue using 568 nm wavelength for tetramethylrhodamin dextran and a wavelength of 488 nm for the electrode position.\nReconstruct the stained brain structures and electrode paths from the image stacks in 3D with reconstruction software (e.g. AMIRA or Fiji) (Figure 4)."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}