{
  "id": 19957,
  "origin_website": "Wiley",
  "title": "Assessing Protein Synthesis and Degradation Rates in Arabidopsis thaliana Using Amino Acid Analysis",
  "procedures": [
    "A schematic representation of the labeling system is presented in Figure 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-fig-0002]. Stable isotope labeling of A. thaliana rosette leaves is typically done using transparent Plexiglass labeling chambers that can contain up to eighteen 10-cm pots (Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-fig-0002]). To reduce biological noise, we recommend growing five plants per pot. The labeling chambers are placed inside a plant growth chamber with a controlled environment (Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-fig-0002]). 13CO2 gas is mixed with a N2/O2 gas mixture using a custom-made tee gas mixer (Fig. 2C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-fig-0002]). The 13CO2 flow (i.e., concentration) is adjusted and controlled using a mass flow controller. The labeled gas mixture is directed to each labeling chamber at a flow rate of 5 L/min, which is sufficient to completely replace the air in each labeling chamber in 15 min.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/f66b9e0c-1da4-4bc0-8100-69265b255403/cpz1114-fig-0002-m.jpg</p>\nFigure 2",
    "13CO2 labeling setup for a 13CO2 feeding experiment using A. thaliana growing in soil. (A) Outside the growth chamber, stationary gas mixer (1) is used to mix N2 and O2 gases. The gas mixture is humidified using a gas washing bottle (2) filled with water. A mass flow controller (4) is used to control the 13CO2 flow rate from a gas cylinder with a pressure regulator (3). A tee gas mixer (5) is used to mix 4.5 ml/min 13CO2 gas with 10 L/min N2/O2 gas mixture. Inside the growth chamber, glass tube rotameters (6) are used to distribute equal flow (5 L/min) of labeled gas mixture to each labeling chamber (7). Two labeling chambers are shown. Labeling chambers are made of Plexiglass (internal dimensions: 60 × 31 × 17.4 cm) and can contain up to eighteen 10-cm pots. Holes (red dots) in the labeling chambers function as gas inlet/outlet and are fitted with 6-mm PVC tubes. The inlet is located on the upper part of one Plexiglass panel, and the outlet on the lower part of the opposite panel. 13CO2 exiting the labeling chamber is directed to a gas washing bottle filled with soda lime (8). (B) Labeling chambers containing A. thaliana plants inside a growth chamber. (C) Tee gas mixer.\nIt has been reported that metabolite and transcript levels change when plants are transferred to different growth conditions (Moraes et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0018]). In order for plants to be adapted to the experimental conditions, they should be transferred to labeling chambers 3 days prior to the labeling experiment. The labeling chambers are not closed with a lid until the start of the experiment.\nMaterials\nN2, O2, and 12CO2 gas (e.g., Westfalen, cat. nos. A0034, A0018, A0710)\n13CO2 gas (e.g., Sigma-Aldrich, cat. no. 364592)\nArabidopsis thaliana plants in 10-cm-diameter pots",
    "Liquid nitrogen\nLabeling setup (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-fig-0002]):\n               \nPlant growth chamber (e.g., Percival Scientific, model E36L)\nStationary gas mixer (e.g., WMR 4008 Westphal, Brooks Instrument)\n500-ml gas washing bottles with filter discs (e.g., DURAN, DWK Life Sciences, cat. no. 257040101)\nCylinder pressure regulator for 13CO2 bottle (e.g., GCE druva, cat. no. FMD 502-14 BCF1,5 CGA180CL6)\nMass flow controller (e.g., Brooks Portable GC 40 with 0260 series power supply, Brooks Instrument)\nCustom tee gas mixer (Fig. 2C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-fig-0002]; e.g., Bronkhost High-Tech B.V.)\n1.1-11 L/min glass tube rotameters (e.g., SHo-RATE, Brooks Instrument, cat. no. 1350GBL3BACV1AAA)\nPlexiglass labeling chambers (internal dimensions, 60 × 31 × 17.4 cm) with holes for gas inlet/outlet (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-fig-0002])\n6-mm and ⅛-in. (inner diameter) PVC tubes\nY-shaped hose connectors (e.g., Carl Roth, cat. no. E772.1)\nCO2 gas analyzer (e.g., LICOR LI-850 CO2/H2O analyzer)\nLiquid nitrogen–safe scintillation vials (e.g., 20-ml Polyvials, Zinsser Analytic, cat. no. 3071400)\nMixer mill (e.g., Retsch, MM400)\n5- to 7-mm steel balls (e.g., Th. Geyer)\nSet up labeling system\n1. Three days prior to the labeling experiment, place labeling chambers in the growth chamber.\n2. Connect each component of the labeling system as illustrated (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-fig-0002]) using 6-mm PVC tubes except between the MFC (4) and tee gas mixer (5). For this connection, use a ⅛-in. PVC tube to increase the gas pressure (Fig. 2C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-fig-0002]).\nNumbers in parentheses refer to the apparatus diagram in Figure 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-fig-0002].\nAs an alternative to the tee gas mixer, a small-gauge syringe needle can be placed at the end of the ⅛-in. PVC tube exiting the MFC and used to puncture the N2/O2 gas tube.\n3. Inside the growth chamber, divide the tube exiting the tee gas mixer using a Y-shaped hose connector and connect each outlet to a glass tube rotameter (6).",
    "4. Connect the rotameters to the gas inlets of the labeling chambers (7)\n5. Connect the PVC tubes exiting the labeling chambers using a Y-shaped hose connector. Connect the resulting single PVC tube to a LICOR LI850 CO2 analyzer connected to a CO2 trap (8).\nThe CO2 trap is a gas washing bottle filled with soda lime pellets with indicator (Merck Millipore) to prevent release of 12/13CO2 into the atmosphere, which would otherwise affect the natural 13C abundance in other plants growing in the vicinity.\nSet up 13CO2 gas mixture\n6. Mix 79% N2 and 21% O2 at a flow rate of 10 L/min using a stationary gas mixer (1).\nIt is important that the gas mixture entering the labeling chambers be humidified using a gas washing bottle (2) containing water. Humidification is done with the N2/O2 gas mixture because humidifying the final gas mixture can lead to gas backflow.\n7. Set the 12CO2 flow rate at 4.5 ml/min using the MFC.\nIf you can measure 13CO2 concentration directly, it is not necessary to use this indirect method. You can then use the 13CO2 cylinder from the start.\n8. Adjust the rotameters to a flow rate of 5 L/min.\n9. Close the lids of the labeling chambers.\n10. Check the 12CO2 concentration in the gas mixture using a CO2 analyzer. If necessary, adjust the concentration using the MFC.\nIn our work space, the atmospheric CO2 concentration is ∼450 ppm, so the concentration in the gas mixture is set to this value.\n11. Replace the 12CO2 cylinder with the 13CO2 cylinder.\n12. Stop the gas flow, remove the CO2 analyzer from the system, and place the plants in the labeling chambers without lids.\nLabel rosette leaves",
    "13. Remove unlabeled control plants from the growth chamber 15 min before the start of the light period.\nFor this first harvest, we keep the lights off in the room where the growth chamber is located and use a green light.\n14. As soon as the control plants have been removed, place the lids on the labeling chambers and start the gas flow with the 13CO2 mix.\nThis will replace all the 12CO2 in the labeling chambers before the start of the light period.\n15. Immediately harvest rosette leaves from the unlabeled control plants and immediately freeze in liquid nitrogen. Transfer frozen material to pre-cooled scintillation vials in liquid nitrogen.\nThis is done in the dark using a green light.\n16. For each harvesting time point, slightly open the lids of the labeling chambers, quickly remove the pots, close the lids, and immediately harvest rosette leaves.\nThe opening and closing of the lids should be completed within 10 s.\nIf plants are left for long in air with 12CO2, and also in undefined light conditions, there may be a decrease in the enrichment of some free amino acids.\n17. After performing the 13CO2 pulse for 24 hr, stop the gas flow, replace the 13CO2 cylinder with the 12CO2 cylinder, and restart the gas flow.\n18. Harvest samples during the 12CO2 chase.\nOpening and closing of the chambers during the chase does not have to be done as quickly as during the pulse.\n19. Grind frozen leaves to a fine powder using a mixer mill with steel balls. Store ground frozen material at −80°C until use.\nIt is important to ensure that all liquid nitrogen is removed from the vials before grinding, and that the material is not allowed to thaw during this process.",
    "The protocol requires at least 30 mg frozen plant tissue powder per sample.",
    "GC-TOF-MS can identify and quantify a few hundred metabolites in a single plant extract, including sugars, sugar alcohols, phosphorylated intermediates, lipophilic compounds, and organic and amino acids (Lisec, Schauer, Kopka, Willmitzer, & Fernie, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0015]). The following sample preparation protocol is relatively simple, established for different plant species such as A. thaliana, cassava, maize, and tomato (Lisec et al., 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0015]; Obata et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0022]; Rosado-Souza et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0026]; Schauer et al., 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0029]), and adapted for a lower amount of starting material (Ishihara et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0013], 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0012]).\nMaterials\nFrozen, ground plant tissue (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-prot-0001])\n0.2 mg/ml ribitol (Sigma-Aldrich, CAS 488-81-3) in ultrapure water\n100% methanol (gradient grade for liquid chromatography; Merck, CAS 67-56-1)\n100% chloroform (gradient grade for liquid chromatography; Merck, CAS 67-66-3)\nUltrapure water (∼0.055 μS/cm; e.g., Milli-Q)\nArgon gas (optional)\n2-ml screw-cap tubes (e.g., Sarstedt, cat. no. 72.693)\nThermomixer (e.g., Eppendorf Thermomixer comfort)\n6-ml screw-cap glass vials (e.g., DURAN, cat. no. 231751159)\n2-ml Safe-Lock microcentrifuge tubes (e.g., Eppendorf, cat. no. EP0030123620)\nVacuum concentrator (e.g., SpeedVac, Thermo Fischer Scientific)\n1. Weigh 30 mg (±10%) frozen, ground plant material in 2-ml screw-cap tubes. Record the weight of each aliquot for data normalization.\nMake sure to not thaw the plant material while aliquoting. Also make sure that there is no liquid nitrogen inside the tube before closing it, as this could cause material to be violently extruded when the tube is opened.\n2. Mix 280 µl of 100% methanol and 12 µl of 0.2 mg/ml ribitol per sample and cool the mixture on ice.\nPrepare an adequate volume based on the number of samples.\n3. Add 292 µl cold methanol/ribitol to each sample and shake at 100 rpm for 15 min at 70°C using a Thermomixer.\n4. Centrifuge at 20,000 × g for 10 min at 4°C.",
    "5. Transfer the supernatant to a 6-ml glass vial. Keep the pellet at −20°C for protein and cell wall preparations.\n6. Add 150 µl of 100% chloroform to the supernatant and vortex.\n7. Add 300 µl ultrapure water and vortex for precisely 15 s.\n8. Centrifuge at 4000 × g for 15 min at 4°C\n9. Transfer 150 µl of the upper polar phase to a 2-ml Safe-Lock tube. As a backup, transfer 300 µl to another 2-ml Safe-Lock tube.\n10. Dry overnight in a vacuum concentrator without heat.\n11. Optional: Fill tubes with argon gas for long-term storage at −80°C.",
    "Protein solubilization is considered the most problematic step during sample preparation for proteomic studies. A protein extraction buffer including a combination of urea and thiourea was shown to solubilize proteins efficiently (Chan, Lo, & Hodgkiss, 2002[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0003]). Once the proteins are extracted, amino acids are released from peptides using classical acid hydrolysis with 6 M HCl at 110°C for 24 hr. Neutralization and cleaning of the samples for GC-TOF-MS analysis are carried out by liquid-phase extraction using dioctylamine/chloroform and chloroform.\nMaterials\nPellet containing protein and cell wall (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-prot-0002])\n100% methanol (gradient grade for liquid chromatography; Merck, CAS 67-56-1)\nProtein extraction buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-rec-0003])\nBovine serum albumin (BSA; Sigma-Aldrich, CAS 9048-46-8)\nBio-Rad Protein Assay Dye Reagent Concentrate (Bio-Rad, cat. no. 5000006)\nUltrapure water (∼0.055 μS/cm; e.g., Milli-Q)\n20% (w/v) trichloroacetic acid (TCA; Sigma-Aldrich, CAS 76-03-9) in ultrapure water, ice cold\n100% acetone (Sigma-Aldrich, CAS 67-64-1)\n6 M hydrochloric acid (HCl; Sigma-Aldrich, CAS 7647-01-0)\nDioctylamine (98% [v/v], Sigma-Aldrich, D201146)\n100% chloroform (for liquid chromatography; Merck, CAS 67-66-3)\nArgon gas\n1.5-ml screw-cap tubes (e.g., Sarstedt, cat. no. 72.692)\n96-well flat-bottom microtiter plate (e.g., Thermo Fisher Scientific, cat. no, 2205)\nOpen microtiter plate reader (e.g., BioTek 800TS)\nThermomixer (e.g., Eppendorf Thermomixer comfort)\npH indicator paper (e.g., Macherey-Nagel, cat. no. N361.1)\n2-ml Safe-Lock microcentrifuge tubes (e.g., Eppendorf, cat. no. 0030123611)\nVacuum concentrator (e.g., SpeedVac, Thermo Fischer Scientific)\nExtract and quantify protein\n1. Carefully wash the pellet containing protein and cell wall material three times with 500 µl of 100% methanol to remove potential amino acid contamination from leftover supernatant.\n2. Add 200 µl protein extraction buffer and vortex vigorously at room temperature.\n3. Centrifuge at 20,000 × g for 10 min at room temperature. Transfer supernatant to a 1.5-ml screw-cap tube. Keep the pellet at −20°C for cell wall preparation.",
    "4. Prepare BSA standards at 1, 0.5, 0.25, and 0 mg/ml in protein extraction buffer.\n5. Dilute 3 µl supernatant in 9 µl protein extraction buffer.\n6. Prepare 160 µl of Bio-Rad Protein Assay solution per sample by diluting 1:8 with ultrapure water.\nPrepare an adequate volume based on the number of samples.\n7. Mix 160 µl diluted assay solution with 3 µl of each standard and sample in a 96-well flat-bottom microtiter plate.\nStandards and samples are generally measured in duplicate.\n8. Measure absorbance at 595 nm (A595) using an open microtiter plate reader.\n9. Calculate protein concentration (µg/µl) using the standard curve generated with the BSA standards.\nPrecipitate protein\n10. Transfer 50 µg sample to a 1.5-ml screw-cap tube.\n11. Precipitate protein by adding 2 volumes of 20% (w/v) ice-cold TCA and centrifuging at 20,000 × g for 10 min at 4°C.\n12. Discard supernatant and wash pellet three times with 300 µl ice-cold 100% acetone.\n13. Air-dry pellet for 15 min.\nHydrolyze protein and neutralize amino acids\n14. Resuspend pellet in 300 µl of 6 M HCl and vortex.\n15. Hydrolyze proteins by heating at 110°C for 24 hr at atmospheric pressure using a Thermomixer.\n16. Neutralize hydrolysate by adding 1 ml of 20% (v/v) dioctylamine in chloroform, vortexing thoroughly, and centrifuging at 20,000 × g for 1 min at room temperature. Discard the organic phase.\n17. Repeat neutralization two more times and then check that the pH of the aqueous phase is neutral using pH indicator paper.\nIf the pH is not neutral, repeat until it becomes neutral.\n18. Remove excess dioctylamine by repeating step 16 four times using 1 ml of 100% chloroform.\n19. Transfer the upper polar phase to a 2-ml Safe-Lock tube without taking any chloroform.",
    "20. Dry samples overnight in a vacuum concentrator without heat.\n21. Fill tubes with argon gas and store at −80°C to avoid oxidation of metabolites.",
    "The A. thaliana cell wall is composed of polysaccharides, proteins, and lignin, with polysaccharides accounting for 80% (Zablackis, Huang, Muller, Darvill, & Albersheim, 1995[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0036]). The polysaccharides are cellulose, hemicellulose, and pectin. Cellulose and the hemicellulose backbone are linear β(1-4) linked d-glucose polymers synthesized from UDP-glucose. On the assumption that there is little or no turnover of these polymers, the 13C enrichment of glucose in the cell wall can be used to estimate how fast plants are growing (RGR). However, the pellet obtained in Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-prot-0003] contains starch as well as cell wall material. Starch is a polysaccharide composed of d-glucose joined by α1,4-glycoside linkages. In the growth and labeling conditions of our protocol, starch is labeled rapidly and to high enrichment by 13CO2. Starch must therefore be completely removed by repeated incubations with α-amylase and amyloglucosidase before cell wall samples can be used to prepare sugars. Hydrolysis of cell wall material (polysaccharides) is carried out by pre-hydrolysis with 72% (v/v) H2SO4 followed by hydrolysis with 1 M H2SO4 (Saeman, Moore, Mitchell, & Millett, 1954[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0028]). Neutralization and cleaning of samples for GC-TOF-MS analysis are carried out by liquid-phase extraction using dioctylamine/chloroform and chloroform.\nMaterials\nPellet containing cell wall material (see Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-prot-0003])\nUltrapure water (∼0.055 μS/cm; e.g., Milli-Q)\n0.1 M NaOH: freshly diluted from 1 M stock (Merck, CAS 1310-73-2) with ultrapure water\nNeutralization buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-rec-0002])\nStarch digestion buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-rec-0004])\nGlucose determination assay buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-rec-0001])\n2.5 U/ml hexokinase (from Saccharomyces cerevisiae, 1500 U/ml, Roche, 11426362001) in 100 mM HEPES-KOH with 3 mM MgCl2, pH 7.5\n72% (v/v) sulfuric acid: diluted from 98% stock (Sigma, CAS 7664-93-9) ultrapure water at a ratio of 2.57:1\nDioctylamine (98% [v/v], Sigma-Aldrich, D201146)\n100% chloroform (for liquid chromatography; Merck, CAS 67-66-3)\nThermomixer (e.g., Eppendorf Thermomixer comfort)",
    "pH indicator paper (e.g., Macherey-Nagel, cat. no. N361.1)\nOpen microtiter plate reader (e.g., BioTek 800TS)\n96-deep-well plate (e.g., Sigma-Aldrich, cat. no. P8116)\n96-well flat-bottom microtiter plate (e.g., Thermo Fisher Scientific, cat. no, 2205)\n2-ml Safe-Lock microcentrifuge tubes (e.g., Eppendorf, cat. no. 0030120094)\nVacuum concentrator (e.g., SpeedVac, Thermo Fischer Scientific)\nRemove starch\n1. Add 700 µl ultrapure water to the pellet containing cell wall material and vortex. Centrifuge at 20,000 × g for 10 min at room temperature and discard supernatant. Repeat at least three more times.\n2. Resuspend pellet in 400 µl of 0.1 M NaOH, shake vigorously, and heat at 100°C for 30 min using a Thermomixer.\nThis will loosen starch crystals so that the enzymes in the starch degradation buffer can access the starch granules for digestion.\n3. Neutralize by adding 80 µl neutralization buffer and vortex. Check that the pH is neutral using pH indicator paper.\nIf the pH is not neutral, the starch digestion did not work. Before adding 0.1 M NaOH to the samples, it is highly recommended to check that 400 µl of 0.1 M NaOH is neutralized by 80 µl of neutralization buffer.\n4. Add 100 µl starch digestion buffer and incubate for 16 hr at 37°C in a Thermomixer.\n5. Centrifuge at 20,000 × g for 10 min at room temperature. Transfer the supernatant (containing liberated starch) to a 96-deep-well plate. Keep the pellet (containing the desired cell wall material).\n6. Add 170 µl glucose determination assay buffer and 30 µl digested starch solution to a 96-well flat-bottom microtiter plate.\nSamples are generally measured in duplicate.\n7. Using an open microtiter plate reader, begin measuring absorbance at 340 nm (A340) continuously at 1-min intervals for 2 hr.",
    "8. When the optical density (OD) is stable (15-20 min), remove the plate from the reader, add 1 µl hexokinase to each well, vortex lightly, and return the plate to the plate reader.\nKeep the reader running during this step.\n9. When the OD is stable again (20-30 min), stop the plate reader and record the OD.\n10. Determine the amount of glucose released from starch using the equation: glucose (µmol) = NADPH (µmol) = ΔOD ÷ (2.85 × 6.22).\nBecause 1 mol glucose uses 1 mol NADP to make 1 mol NADPH, the amount of glucose can be estimated using NADPH formation and the extinction coefficient of NADPH (6.22 mM−1 cm−1).\n11. Repeat steps 1-10 with the pellet in step 5 two more times or until no starch remains.\nMore exhaustive incubations may be needed when analyzing plant material where starch synthesis is rapid but growth rates are slow.\n12. Add 700 µl ultrapure water to the pellet, vortex, and centrifuge at 20,000 × g for 10 min at room temperature. Discard the supernatant and air-dry the pellet for 2 hr.\nHydrolyze polysaccharides and neutralize sugars\n13. To disrupt the crystallinity of the cellulose, add 63 μl of 72% (v/v) H2SO4 to the pellet, vortex vigorously, and incubate at room temperature for 1 hr.\n14. Add 690 μl ultrapure water to dilute the H2SO4 to 1 M and incubate 3 hr at 100°C using a Thermomixer.\n15. Neutralize hydrolysate by adding 1 ml of 20% (v/v) dioctylamine in chloroform, vortexing thoroughly, and centrifuging at 20,000 × g for 1 min at room temperature. Discard the organic phase.\n16. Repeat neutralization two more times and then check that the pH of the aqueous phase is neutral using pH indicator paper.",
    "If the pH is not neutral, repeat until it becomes neutral.\n17. Remove excess dioctylamine by adding 1 ml of 100% chloroform, vortexing thoroughly, and centrifuging at 20,000 × for 2 min at room temperature. Transfer the upper polar phase to a 2-ml Safe-Lock tube and repeat two more times.\n18. Transfer 70-, 140-, and 280-µl aliquots of supernatant to 2-ml Safe-Lock tubes without taking any chloroform.\nA volume of 70 µl is generally enough to measure glucose and other cell wall sugars.\n19. Dry samples overnight in a vacuum concentrator without heat.\n20. Fill tubes with argon gas and store at −80°C to avoid oxidation of metabolites.",
    "Lisec et al. (2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0015]) published a detailed protocol on how to profile and quantify metabolites from A. thaliana using GC-TOF-MS. This protocol describes in great detail the processing of samples, including derivatization, and the settings for GC-TOF-MS. Heise et al. (2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0009]) provide a protocol describing how to process GC-TOF-MS data to estimate 13C enrichment (%) using CORRECTOR software.\nMaterials\nSamples containing soluble amino acids, amino acids from total protein, and sugars from cell wall (see Basic Protocols 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-prot-0002]-4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-prot-0004])\nGC-TOF-MS chromatogram file\nGC-TOF-MS chromatogram analysis software (e.g., TagFinder, Xcalibur)\nCORRECTOR software (https://www.mpimp-golm.mpg.de/54630/Bioinformatik-Tools[href=https://www.mpimp-golm.mpg.de/54630/Bioinformatik-Tools])\nIntel-compatible platform running Windows 10 /8.1/8 /7 /Vista /XP /2000 Windows Server 2019 /2016 /2012 /2008 /2003\n1. Process samples and perform GC-TOF-MS analysis as described (Lisec et al., 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0015]).\n2. Select peak areas of the fragment mass of amino acids and sugars from the GC-TOF-MS chromatograph .cdf file, based on Supplemental Data S1 (Lisec et al., 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0015]).\nWe recommend analyzing alanine and serine in the amino acid–containing samples and glucose in the sugar-containing samples (Ishihara et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0013]).\n3. Generate an input.txt file (see the exemplary file in Supplemental Data S2; also see Heise et al., 2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0009])\n4. Estimate 13C enrichment (%) of amino acids and glucose using CORRECTOR software as described in Heise et al. (2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0009]).",
    "The absolute rate of protein synthesis in a pulse, KS(pulse), is calculated from the labeling kinetics of amino acids in total protein after correcting for incomplete enrichment in soluble (free) amino acid pools. Many amino acid pools show very low enrichment in the light and decrease rapidly in the dark, and cannot be used to estimate KS(pulse) (Ishihara et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0013]). Instead, KS(pulse) is calculated using the labeling kinetics of alanine and serine, both of which are rapidly labeled to high enrichment in the day and whose enrichment stays high during the night (Ishihara et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0013]). The 13C enrichment in the amino acids from protein in a given time interval is corrected by the average enrichment in free amino acids over the time internal. Without 13C enrichment data from the light period, KS(pulse) will be overestimated due to the slight decrease in enrichment between the end of day (ED) and the end of night (EN) (Ishihara et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0013]). Therefore, we recommend that ED and EN values be obtained. In addition, KS can be estimated from the decay of the enrichment of serine and alanine in a protein during the chase period, KS(chase). The rate of protein degradation during pulse (KD(pulse)) and chase (KD(chase)) periods can be estimated as the difference between the rate of protein synthesis and the relative growth rate (KD = KS − RGR). Since KS, KD, RGR are estimated from descriptive statistics on replicate sample data, we describe here how to estimate rates using Gaussian error propagation with the widely used R language.\nMaterials\nSpreadsheet editor (e.g.; excel)\nR (https://www.r-project.org/[href=https://www.r-project.org/]), optional\nR studio (https://rstudio.com/[href=https://rstudio.com/]), optional\n13C enrichment (%) of soluble amino acids, amino acids from total protein, and glucose from cell wall material",
    "13C enrichment exemplary data (Supplemental Data S3): 13C enrichment (%) of alanine, serine, and glucose from three independent replicate experiments containing data from thirteen A. thaliana accessions at ZT0, ZT24, and ZT120 (Ishihara et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0012])\nEstimate protein synthesis rate\nThe rate of protein synthesis in a 13 CO2 pulse experiment, KS(pulse), is defined as the rate of incorporation of labeled amino acids into proteins normalized by a correction factor for incomplete enrichment in the free amino acid pool (Pocrnjic, Mathews, Rappaport, & Haschemeyer, 1983[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0024]). It is calculated over the time interval from t1 and t2 using Equation 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-disp-0001]:\n         \nformula:\n$$empty$$\nwhere SB(t) represents the average labeled amino acids in protein at time t, and SA(t2-t1) represents the average labeled free amino acids in the interval between t1 and t2. Results are expressed as mg protein/mg protein/day. Exemplary results can be found in Supplemental Data S3 and S4. In step form:\n1. Calculate the mean and standard error of the 13C enrichment (%) of free amino acids (SA) and of amino acids in total protein (SB) from samples harvested at time points t1 and t2 (Supplemental Data S3).\n2. Subtract the mean 13C enrichment of amino acids in proteins at time t1 from time t2 (formula:\n$$empty$$\n – formula:\n$$empty$$\n).\n3. Calculate the average 13C enrichment of free amino acids in the time interval between t1 and t2 (formula:\n$$empty$$\n).\nWhen t1 corresponds to ZT0, the 13C enrichment of free amino acids at t1 should not be used for the calculation, as this would lead to overestimation of KS.\n4. Divide the result from step 2 by the result from step 3.\n5. Divide the result by the time interval between t1 and t2 expressed as days (in our case, 1 day).",
    "The standard error of the mean is then used for Gaussian error propagation.\nEstimate relative structural biomass growth rate (RGRSTR)\nWe estimate RGRSTR based on the labeling kinetics of glucose in cell walls (see Ishihara et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0013], 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0012] for more details) during a 13CO2 pulse experiment RGRSTR(pulse). The first time point in a 13CO2 pulse experiment (t1 = 0) corresponds to unlabeled material with no glucose labeling (formula:\n$$empty$$\n = 0). In this case, RGRSTR(pulse) is linearly estimated as the total 13C enrichment (%) in glucose at the end of the pulse period. This is done by subtracting the mean 13C enrichment at t1 from that at t2 (formula:\n$$empty$$\n – formula:\n$$empty$$\n) and dividing by the time interval between t1 and t2 (in our case, 1 day). Exemplary results can be found in Supplemental Data S3 and S5.\nAlternatively, estimation of RGRSTR can be done during a 12CO2 chase, assuming that there is negligible dilution of glucose in cell wall polysaccharides during the analyzed period. RGRSTR(chase) can be estimated considering exponential growth using Equation 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-disp-0002]:\n         \nformula:\n$$empty$$\nwhere t1 and t2 are the start and end of the chase, respectively; t is the time interval from t1 to t2 (in our case, 4 days); and Glc(t) represents the average 13C enrichment of glucose in the cell wall material. Exemplary results can be found in Supplemental Data S3 and S8. The unit of RGRSTR (chase) is mg 13C glucose per mg total glucose in cell wall per day.\n6. Calculate the mean and standard error of the mean using measurements of glucose 13C enrichment in cell wall fractions collected at the start and end of the chase (t1 and t2).\nThe standard error is used for Gaussian error propagation across all calculation steps.",
    "7. Divide mean 13C enrichment at t2 by mean 13C enrichment at t1 and calculate the tth root of the result.\nA simple way to perform the latter step is to power the quotient to 1/t.\n8. Subtract the result from 1.\nEstimate protein degradation rate\nThe rate of protein degradation during a 13CO2 pulse experiment, KD(pulse), can be estimated as the difference between the rate of protein synthesis (KS(pulse)) and the relative growth rate (RGRSTR(pulse)) using Equation 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-disp-0003]:\n         \nformula:\n$$empty$$\nThe unit for KD(pulse) is mg protein/mg protein/day. Exemplary results can be found in Supplemental Data S3 and S6.\nThe rate of protein degradation during a 12CO2 chase experiment, KD(chase), can be estimated as the difference between the rate of decay in 13C enrichment of amino acids in proteins (KS(chase)) and the rate of amino acid enrichment dilution due to tissue growth (RGRSTR(chase)) using Equations 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-disp-0004] and 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-disp-0005]:\n         \nformula:\n$$empty$$\nformula:\n$$empty$$\nwhere SB(t) represents the average labeled amino acids in protein at time t. The unit for KS(chase) and KD(chase) is mg protein/mg protein/day. Exemplary results can be found in Supplemental Data S3, S7, and S9.\n9. Calculate the mean and standard error of the 13C enrichment (%) of amino acids in total protein from samples harvested at time points t1 and t2.\nThe standard error is used for Gaussian error propagation across all calculation steps.\n10. Calculate the natural logarithm of the mean 13C enrichments at t1 and t2 and subtract the latter from the former.\n11. Divide the result by the time interval (in our case, 4 days).\n12. Subtract RGRSTR(chase) from KS(chase).\nPrepare data and estimate RGRSTR, KS, and KD using R language",
    "As previously mentioned, Supplemental Data S3 from Ishihara et al. (2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0012]) is used to illustrate the analysis of a 13CO2 pulse/12CO2 chase experiment. Data analyses were done manually (for Supplemental Data S3) or using R language (https://www.r-project.org/[href=https://www.r-project.org/]; Supplemental Data S4-S9). Step-by-step instructions are available on the open-source GitHub repository (https://github.com/thiagomaf/Kd_Ks_RGRstr[href=https://github.com/thiagomaf/Kd_Ks_RGRstr]).\nCalculations for RGRSTR(pulse) in the pulse experiment involved comparison between ZT0 and ZT24. For the chase experiment, ZT24 and ZT120 were used.\nIn this example from Ishihara et al. (2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0012]), KS(pulse) was estimated using alanine and serine from a pulse experiment (ZT0 to ZT24; t2 – t1 = 1 day) and is expressed as mg protein/mg protein/day.\nIn this experiment, at ZT0 (t1 = 0), enrichment of labeled free amino acids is taken as zero (formula:\n$$empty$$\n = 0). The correction factor formula:\n$$empty$$\n was then defined as the enrichment of free labeled alanine or serine at ZT24. The latter assumes that labeling of free amino acids is roughly constant during the diel cycle, which might not always be true in plants and could lead to under- or overestimation of KS (for more details, see Ishihara et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-bib-0013]). Therefore, Equation 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.114#cpz1114-disp-0001] is simplified as:\n         formula:\n$$empty$$"
  ],
  "subjectAreas": [
    "Plant Biology"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}