{
  "id": 18889,
  "origin_website": "Jove",
  "title": "Transabdominal Ultrasound for Pregnancy Diagnosis in Reeves' Muntjac Deer",
  "procedures": [
    "1. Procedural Preparation\nAll animal procedures described have been reviewed and approved by the Institutional Animal Care and Use Committee at Colorado State University, an Association for Assessment and Accreditation of Laboratory Animal Care (AAALAC), Intl. accredited institution.\nPrior to examination, immobilize animals using appropriate sedation or anesthesia protocols to provide relaxation and allow for appropriate positioning. One handler restrains the deer while a second person administers the sedation to the animal.\nNote: The authors have found the following combination to provide effective sedation in this species: butorphanol (0.45 mg/kg), azaperone (0.035 mg/kg), and medetomidine (0.04 mg/kg), administered intramuscularly in the gluteal muscles.\nOnce the doe has reached a plane of sedation that allows for compliant handling, position her in either dorsal or lateral recumbency on an examination table or within a V-trough. Elevate the head, neck, and thorax slightly (approximately 20-30°) to reduce the risk of regurgitation and aspiration of rumenal contents and to facilitate proper ventilation during the procedure.\nNote: In most cervids or other ruminant species, abdominal ultrasound is performed in standing animals; however, the small size and behavioral considerations of this species requires heavy sedation for examination and sternal positioning is therefore more difficult and may preclude effective imaging technique. Positioning the animal midway between sternal and lateral recumbency may be ideal for reducing the risk of regurgitation and hypoventilation and should be considered if possible. In any recumbent position, it is critical to carefully monitor the animals' respirations and immediately stop the examination and place the animal in sternal recumbency if regurgitation or hypoventilation is noted.\nIf necessary, clip hair from the area of the abdomen to be examined in order to achieve adequate contact between the footprint of the transducer and the skin.",
    "Note: In early gestation, evidence of pregnancy can be detected in the caudal abdomen near the mammary glands. This region of the muntjac is typically hairless, and therefore shaving may not be indicated at this time. As the fetus grows and the uterus distends to occupy a more cranial position in the abdomen, clipping of the hair will be necessary prior to imaging. Care should be taken to avoid causing any mechanical trauma to the skin, including lacerations from razor blades or thermal injury from electrical clippers.\nPosition the ultrasound unit in a location that allows the technician to easily visualize the monitor while conducting the examination with his or her dominant hand. Input animal identification information (name, identification number, etc.) into the system to automatically label saved images and video loops.\n2. Transabdominal Reproductive Ultrasound Examination\nApply a generous amount of acoustic coupling gel to the caudal abdomen.\nPlace a 5-10 MHz curved linear transducer on the skin of the caudal abdomen, immediately cranial to the pubis, and move it slowly in a cranial direction to evaluate the structures within the pelvic cavity. Scan the left and right quadrants of the caudal abdomen to assess both horns of the muntjac's bicornuate uterus.",
    "Note: Comprehensive abdominal ultrasound involves assessment of all abdominal viscera, including the liver, kidneys, spleen, gastrointestinal tract, urinary bladder, and reproductive tract. For the purposes of this protocol, only examination of pregnancy will be discussed in detail; however, the normal appearance of other caudal abdominal organs should be recognized as these structures are likely to be encountered during the course of the study. Organs most commonly seen in this location include segments of the gastrointestinal tract, the urinary bladder, and the reproductive tract. The large and small intestines are identified by the characteristically layered appearance of the intestinal wall. The lumen may or may not be pronounced depending on the type and amount of contents, which may include fluid, gas, mucous, or food particles. The urinary bladder may be difficult to identify unless distended with urine, and the layers of the bladder wall are significantly less distinct than those of the intestines. Apart from the uterus, the ovaries may also be found on ultrasound of the reproductive tract of the female muntjac. The ovaries will appear as ovoid structures near the caudal pole of the kidneys, and their appearance may change over the course of the estrous cycle. The presence of multiple mature, fluid-filled follicles within the cortex is suggestive of estrus.\nNote: By rotating and/or \"fanning\" the scanhead of the transducer, structures can be evaluated in transverse or sagittal planes.\n\t\nIf needed to differentiate a gravid uterus from the urinary bladder, empty the bladder manually by applying gentle pressure to the caudal abdomen or by placing a urinary catheter and repeating the scan.",
    "Note: Manual expression of the bladder should only be attempted when the animal is in a sternal or upright position, which facilitates a more natural orientation of the abdominal viscera and reduces the risk of trauma to other structures. The uterus may also be differentiated from the urinary bladder by assessing the thickness of the organ's wall. The typical thickness of a moderately distended bladder is approximately 1.4 mm24, while the authors have found that the more muscular wall of the gravid uterus in the muntjac generally measures between 7-8 mm.\nNote: Early pregnancy is difficult to diagnose definitively due to a lack of identifiable fetal structures, and in fact the first indication of pregnancy may simply be a small fluid pocket in the caudal abdomen. If seen at this time, the developing embryo will appear as a hyperechoic, ovoid to amorphous structure within the uterus (Figure 1).\nMake adjustments to the depth, frequency, and gain as necessary to improve contrast and image detail.",
    "Note: higher frequencies are associated with shorter wavelengths, which are necessary for improved image resolution. Most transducers are capable of operating within a range of frequencies (for example, 6-10 MHz)24. Frequency can be adjusted using the scanner controls on the ultrasound unit, and increasing frequency will result in a clearer image. Increasing frequency concurrently decreases the depth of sound wave penetration; therefore, reducing the frequency may be necessary to visualize deeper structures, but resolution may become compromised24. For this reason it is important to select the highest frequency possible to reach the desired tissue depth. Adjustments to the gain controls will alter the amplification of sound waves returning to the transducer from the tissues and affect the degree of contrast in the image24. The gain should be set to a point where optimal contrast between hyperechoic and hypoechoic tissues is achieved, and these settings may need to be adjusted depending on the structures that are being imaged.\n3. Obtaining Fetal Measurements",
    "Note: Gestational age in many domestic animal species can be estimated using established reference ranges for fetal measurements obtained from ultrasound examination. The most commonly used measurements include straight crown-rump length (SCRL), chest depth (CD), and head length (HL)17. While sufficient data has not yet been collected to develop reliable gestational age guidelines in Reeves' muntjac deer, measurements may be collected in order to begin establishing these references. Fetal heart rate (FHR) has been shown in other species of cervid and ruminant to increase linearly as gestation progresses to a certain point (typically around day 60 of gestation), at which time the heart rate begins to decrease17. FHR may be used to estimate gestational age in conjunction with other ultrasound observations, however it is more commonly used as a measure of fetal viability17,24. FHR has been calculated in Reeves' muntjac as early as 35 days post-observed mating.\nTo measure SCRL, locate the uterus on the monitor and make fine adjustments to the position of the transducer until a sagittal view of the entire fetus is obtained (Figures 2 and 3). Freeze the image and measure the distance between the most dorsal aspect of the skull and the base of the sacrum (Figures 2 and 3).\nTo measure CD, obtain a sagittal view of the fetus (the same image may be used to measure SCRL) and measure the distance between the dorsal and ventral aspects of the thorax (Figures 2 and 3).\nTo measure HL, using the same sagittal view of the fetus as described for the SCRL and CD measurements, measure the distance from the occipital crest to the base of nose (Figures 2 and 3).",
    "To calculate fetal heart rate, identify the heart within the thoracic cavity of the fetus by visualizing its rhythmical contractions. Calculate the heart rate by counting the number of contractions (heart beats) that occur within a 1 min period of time.\nNote: If the ultrasound unit being used has Doppler capabilities, this feature may be employed to further assist in distinguishing the heart from other nonspecific fetal movements.\nVerify that all saved images and video loops include all necessary identifying information, including animal name or number, date, measurements, and appropriate structure labels.\n4. Procedural Conclusions and Recovery\nRemove all residual ultrasound contact gel from the animal's abdomen using a soft cloth or paper towels. Clean the gel from the transducer prior to storage.\nIf using the sedation protocol described in step 1.1, administer atipamezole subcutaneously at a dose of 0.25 mg/kg to reverse the effects of medetomidine. If using a different sedation protocol in which an antagonist is available, administer this agent to the animal according to published dosages at the conclusion of the procedure to speed recovery.\nPlace the muntjac on a soft bedded surface in sternal recumbency, with the head slightly elevated to reduce the risk of regurgitation and aspiration of rumenal contents. Monitor the animal closely until fully recovered and able to ambulate around the enclosure without assistance.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}