{
  "id": 17095,
  "origin_website": "Jove",
  "title": "Multimodality Diagnosis of Mesenteric Ischemia",
  "procedures": [
    "A clinical investigation of ICG imaging was performed under approval by the Ethics Committee of Kochi Medical School with informed consent from every patient. A total of 25 patients were included, who underwent reconstructive surgery using free jejunal graft following resection of cancer of the pharynx or cervical esophagus between 2011 and 2016. Regarding the US, the video records obtained in clinical practice between 2000 and 2018 have been reviewed. Ethical approval was waived on this, according to the institutional ethical review committee.\n1. Transesophageal echocardiography (TEE)\nNOTE: TEE, which necessitates the insertion of an esophageal probe, is suitable for making a diagnosis or monitoring in the OR or ICU where CT assessment is not available. TEE provides morphologic and kinetic information as well as the perfusion status of the intestine27,28. Although it requires expertise in visualizing the SMA, it is not so hard for experienced heart and thoracic aorta examiners. The SMA can be visualized with the TEE probe (see Table of Materials) advanced into the stomach and the transducer directed posteriorly (Figure 1A).\nVisualize the descending aorta on the short axis (scanning plane 0°), then advance the probe into the stomach with the image of the aorta kept in view by rotating the probe counterclockwise with a slight anteflexion of the probe tip to keep the transducer in contact with the esophageal wall.\nIf the image of the aorta moves downward, bend the probe tip further (Figure 1B).\nUse color Doppler mode to facilitate the identification of visceral branches by flow signal, and ensure that the orifice of the celiac artery appears at the 12 o'clock position of the abdominal aorta (Figure 1C). It divides into two or three arteries within a few centimeters of the orifice.",
    "Advance the probe one inch further so that the SMA appears at the 12-2 o'clock position.\n\tNOTE: A leftward bending of the probe tip is helpful to rotate the image and depict the SMA at 12 o'clock position.\nEnsure that the distal portion of the SMA is located between the pancreas (splenic vein) and abdominal aorta, where the left renal vein crosses behind the SMA.\nRotate the scanning plane to 90° to visualize the long-axis view of the aorta and visceral branches. The distal portion of the SMA can be assessed more easily (Figure 1D).\n\tNOTE: Figure 1C,D show the TEE findings in a cardiovascular surgical case without mesenteric ischemia.\n2. Abdominal US\nNOTE: This modality is suitable for suspecting or excluding mesenteric ischemia among several patients with abdominal pain, together with physical examination. It is used for assessing the morphology and kinetics of the intestine and the blood flow in the SMA. Figure 2A shows the place of the probe (see Table of Materials) for each purpose.\nUse a convex or sector probe with a frequency range of 2 to 5 MHz to facilitate visualization and above assessment of the intestine via the abdominal wall with adequate resolution and sensitivity.\n\tNOTE: Use a transducer with a frequency range between 2.5 and 5 MHz for visualizing the bowels in the abdomen with the gain setting maximal without generating background noise.\nPlace the probe on the abdominal wall around the navel to visualize the intestine (Figure 2B). Find any acoustic window (yellow arrow) between the intestinal gas (blue dotted line).\nCheck the size and peristaltic movement of the intestine, mucosal edema, or the presence of ascites around it. The latter indicates that intestinal necrosis takes place.",
    "For assessing the SMA flow, the probe was placed vertically above the navel level. Find the SMA, which arises from the abdominal aorta and directs caudally within a few centimeters (Figure 2C).\n\t​NOTE: The US findings in Figure 2B,C was recorded in healthy individuals.\n3. ICG imaging\nNOTE: This modality is suitable for assessing the perfusion of the tissues in the surgical field.\nPrepare the ICG imaging system following the manufacturer's instructions (see Table of Materials).\nInject a total of 2.5 mg ICG (see Table of Materials) dissolved in 10 mL of distilled water (0.25 mg/mL) into the central venous line, followed by flushing with 10 mL of saline (Figure 3A).\nVisualize the perfused ICG into the mesenteric artery and then the intestinal tissue on display (Figure 3B). It usually appears approximately 10 to 20 s after injection.\n\t​NOTE: The ICG imaging findings in Figure 3B were recorded in a reconstruction case with a free jejunal graft enrolled in the above study.\n4. Near-infrared spectroscopy (NIRS)\nNOTE: To solve the problem in plastic and reconstructive surgery (as mentioned in the Introduction section), this study proposed the use of the NIRS system, which has been used in cardiovascular surgery29; however, validation to confirm that rSO2 reflects the ischemic status of the jejunum was needed. When the jejunal flap was harvested, an NIRS sensor was placed on the jejunum, and changes in rSO2 were monitored when the artery and vein were clamped, and perfusion was resumed after reconstruction. In addition, rSO2 changes were observed for 3 days postoperatively with the NIRS sensor placed on the skin of the neck. The recommended procedures for assessing the rSO2 of the intestine directly in the surgical field are described here.\nPrepare the NIRS system following the manufacturer's instructions (see Table of Materials) (Figure 4A).",
    "Use an appropriate sensor for measuring the rSO2 of the tissue according to the depth of the target region to be assessed (Figure 4B). Place the sensor directly on it with light contact so as not to press excessively.\n\tNOTE: This study used a sensor with a distance between the emitter and receiver of 2 cm.\nCheck the rSO2 value indicated on display, updated every 5 s (Figure 4B).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}