{
  "id": 19006,
  "origin_website": "Jove",
  "title": "Non-invasive Optical Measurement of Cerebral Metabolism and Hemodynamics in Infants",
  "procedures": [
    "1. Preparation for Bedside Measures\nThe FDNIRS and the DCS systems are compact and easy to move on a small cart to the infant's bedside in the hospital (Figure 1).\nAfter moving the cart with the devices to the bedside, turn on the systems and connect the optical probe to the FDNIRS and DCS devices. Ensure that two experimenters are present for every measurement: one to manage the instruments and computer, and one to hold the probe.\nChoose the appropriate probe according to the infant's postmenstrual age (PMA). The optical probe with FDNIRS source-detector separations of 1, 1.5, 2 and 2.5 cm is used for infants <37 wks PMA and the probe with FDNIRS separations 1.5, 2, 2.5 and 3 cm is used for older infants (Figure 2-A). The choice of shorter source-detector separations is dictated by preterm infants' small size and larger head curvature. When using a larger probe with a preterm infant, the relatively smaller size of the baby's head and its significant curvature together impede effective contact between the infant's head and all sources and detectors. For this reason, the probe with FDNIRS source-detector separations of 1, 1.5, 2 and 2.5 cm is fitting for use with preterm infants. Our research has verified that the chosen source-detector separations are sufficient to measure optical properties of the cerebral cortex of both preterm and term 14. DCS source and detector fibers are arranged in a row parallel to the FDNIRS fibers with source-detector distances of 1.5 (one detector) and 2 cm (three detectors) in both premature and term infants probes.\nSanitize the optical probes with a Sani-cloth disinfecting wipe and insert the probe and fibers into a single-use polypropylene plastic sleeve.\n2. FDNIRS Gain Settings and Calibration",
    "Open the FDNIRS Graphical User Interface (GUI) and select the program settings file corresponding to the probe and calibration block being used.\nTo adjust detector gains, gently place the probe on an area of the subject's head without hair (preferably the left side of the forehead) and maintain it in the same position without applying any pressure. Turn on sources and detectors and adjust PMT voltage until the amplitude of any of the source lasers reaches 20,000 counts. 32,000 counts is the maximum digitization of the analog to digital acquisition card, and gains need to be set below that threshold to avoid saturation during data acquisition. The gains should be set in the frontal area because this region generally has the lowest absorption of laser light and is therefore most prone to saturation.\nTurn off the sources and detectors and return the probe to the calibration block. The lasers need to be turned off when moving the probe for eye safety; the detectors need to be turned off because PMTs are very sensitive and exposure to any bright light increases background noise and may permanently damage them.",
    "With the probe back on the calibration block, use the neutral density (ND) filter if any source-detector pair saturates. Different ND filters may be selected due to optimizing gains in infants with different skin tones Hold the probe still for 16 sec while running the calibration procedure. Since we do not physically move one source to different distances from a single detector to achieve a multi-distance scheme, but instead use four combinations of two independent sources and two independent detectors, we need to calibrate for the different power of the two sources and the different gains of the two detectors. By measuring a calibration block of known optical properties, we estimate the amplitude and phase correction factors needed to recover the absorption and scattering coefficients of the calibration block.\nAfter calibration, acquire 16 more sec of data on the block and visually assess the adequacy of the calibration with an in-house MATLAB GUI. The measured μa and μs' should match the actual coefficients of the calibration block at all wavelengths. Recalibrate if the fit is poor.\nIf detector gains need to be changed, or source and detector fibers need to be disconnected during measurements, repeat the calibration procedure of the FDNIRS device.\nAt the end of the measurement session, acquire another 16 sec of data on the calibration block to verify whether the calibration was maintained during measurements on the subject. If the calibration has not been maintained, take a second calibration at the end of the measurement and apply to the acquired data.\n3. DCS Settings\nOpen the in-house DCS data acquisition GUI and load the settings file corresponding to the optical probe being used.",
    "Before starting measurements, verify that the laser power of the DCS source is appropriate for skin exposure by measuring the laser power of the DCS source with a power meter and checking the spot size with an IR viewing card (the laser emits at 785 nm, which is not visible). The DCS laser power is ~60 mW and coupled to a relatively small diameter fiber (400-600 μm). To meet ANSI standards for skin exposure, the light at the probe must be attenuated and diffused across a large area. This is achieved by covering the tip of the fiber with a 3 mm diameter white Teflon sheet (Figure 2-A). The Teflon is highly scattering and widely diffuses the laser beam. At the bedside, ensure that the laser power at the probe is less than 25 mW and the spot size is larger than 3 mm in diameter. As for the FDNIRS, always turn off sources and detectors when moving the optical probe.\nDCS detection is photon-counting and there is no APD gain adjustment as is required for the FDNIRS device. A flag in the acquisition software indicates if too much light is detected, in which case light coupling to either source or detector fibers needs to be reduced by turning the fiber connectors. Adequate light detection is on the range of 200,000-4,000,000 detected photons (corresponding to -26~0 dB on the computer display). Avoid excessive room light to reduce background noise.\nThe DCS does not require calibration to measure CBFi. Blood flow is proportional to the time it takes to lose correlation. A solid block does not suffice to check signal quality because there are no moving scattering particles to cause decay. An experimenter's arm instead shows decay -- the faster the blood flow, the steeper the decay.\n4. Data Acquisition",
    "While FDNIRS and DCS measurements can be done quickly in sequence, first measure all locations with one device and then repeat the same progression with the other device, using independent acquisition software corresponding to each.\nMeasure seven locations covering frontal, temporal and parietal areas, according to a 10-20 system (Fp1, FpZ, FP2, C3, C4, P3, P4), in sequence (Figure 2-B). Part the hair along the source-detector line and place the probe on that area of the head.\nTurn on FDNIRS lasers and detectors and check the signal quality: amplitude counts should be between 2,000 and 20,000 and phase shifts SNR <2 degrees. If outside of these ranges, reposition the probe, ensuring hair is parted and all sources and detectors are in contact with the skin.\nAcquire data for 16 sec. Repeat measurements up to three times in each location (Figure 2-C), parting the hair and repositioning the probe in a slightly different spot for each acquisition. This is done to minimize effect of local inhomogeneities such as hair and superficial large vessels and to provide values representative of a region, rather than a single spot.\nTurn on the DCS laser and detectors and acquire data for 10 sec. Reposition the probe and repeat the acquisitions (as with the FDNIRS measures).\nTurn off all lasers when moving the probe between locations. Data collection in all seven locations is not always possible. Discontinue measurements if the subject manifests any sign of distress or motion. Retry the acquisition if possible. EEG electrodes or respiratory equipment may also preclude measurements in some locations.\n5. Measure of Systemic Parameters",
    "For the calculation of CMRO2i, two systemic parameters, arterial oxygenation (SaO2) and hemoglobin in the blood (HGB), must be acquired. HGB is also needed to calculate CBV. While conventional pulse oximetry provides measures of SaO2, HGB is conventionally measured with a blood test. A new pulse oximeter, developed by Masimo Corporation, is able to measure HGB non-invasively by using multiple wavelengths. The device is FDA-approved for infants >3 kg, and allows for a quick bedside measure of both SaO2 and HGB.\nRecord SaO2 and HGB using a Masimo pulse oximeter (Pronto spot check pulse co-oximeter). For these measurements, attach an adhesive single-use sensor to the big toe of the baby's foot. HGB will be displayed on the monitor within a few seconds.\nWhen it is not possible to use the Masimo pulse co-oximeter, measure SaO2 with other FDA-approved pulse oximeters. HGB can be either recovered from patients' clinical charts or estimated using normative values.\n6. Data Analysis\nOpen an in-house post-processing data analysis GUI using MATLAB. This software not only estimates all hemodynamic parameters, but also uses the redundancy of data to automatically assess measurement quality and constrain results.",
    "Automatic objective criteria for quality control consist of discarding data for FDNIRS if: R2 < 0.98 for the model fit of the experimental data, p-value > 0.02 for the Pearson product moment correlation coefficient between the eight measured absorption coefficients and the hemoglobin fit (Figure 3-A), p-value > 0.02 for the linear fit of the reduced scattering coefficients versus wavelength (Figure 3-B) 15. If more than 33 percent of the data merits discarding, the whole set is discarded. For the DCS, data is discarded if: the tail of the fitting curve differs from 1 by more than 0.02, the cumulative variation among the 3 first points of the curve is more than 0.1, or the average value of the 3 first points is more than 1.6 (Figure 4). If more than 50 percent of curves are discarded, or the fit values have a coefficient of variation > 15 percent, the whole set is discarded15.\nCalculate absolute HbO and HbR concentrations by fitting the absorption coefficients at all wavelengths, using literature values for Hb extinction coefficients 16 and a 75 percent concentration of water in tissue 17. Derive total hemoglobin concentration (HbT = HbO + HbR) and SO2 (HbO / HbT) from HbO and HbR concentrations.\nEstimate cerebral blood volume using the equation described in Ijichi et al 18. CBV= (HbT × MWHb) / (HGB × Dbt), where MWHb = 64,500 [g/Mol] is the molecular weight of Hb, and Dbt = 1.05 g/ml is the brain tissue density.\nCalculate CBFi by fitting the measured temporal autocorrelation functions to the diffusion correlation equation. The detailed theoretical framework to calculate CBFi is in Boas et al. and Boas and Yodh 10,11. In the equations, use individual absorption coefficients measured from FDNIRS and an average of the scattering coefficients across the whole population.",
    "Calculate the index of cerebral oxygen consumption by using the FDNIRS measure of SO2 and the DCS measure of CBFi with the following equation: CMRO2i = (HGB × CBFi × (SaO2 - SO2)) / (4 × MWHb × β)15, where the factor 4 reflects the four O2 molecules bound to each hemoglobin and β is the percent contribution of the venous compartment to the hemoglobin oxygenation measurement 19."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}