{
  "id": 6921,
  "origin_website": "Bio",
  "title": "Expression and Purification of Functionally Active Serotonin 5-HT<sub>2A</sub> Receptor in Insect Cells Using Low-titer Viral Stock",
  "procedures": [
    "This protocol is based on our prior work with rat (Mahesh et al., 2018) and human (Mozumder et al., 2020) 5-HT2ARs. The rat receptor (matching Uniprot ID P14842), sub-cloned from an earlier plasmid (Bhattacharyya et al., 2006), was over-expressed with an N-terminal histidine tag. The human receptor (matching Uniprot ID P28223) was sub-cloned from a codon-optimized sequence, having a stabilizing mutation M1823.41 W and expressed with FLAG and histidine tags in the N- and C-terminal ends, respectively. The procedure to express and purify functionally active 5-HT2AR consists of the following steps: (A) Bacmid preparation, (B) Preparation of high-titer viral stock, (C) Expression of 5-HT2AR in Sf9 cell culture, (D) Purification of 5-HT2AR, and, (E) Radioligand binding assay.Bacmid preparationAdd 2 µl of plasmid (50 ng/µl), containing the 5-HT2AR cloned into a pFastBac1 or pFastHT vector (containing a FLAG or histidine tag at the 5′ or 3′ end of the receptor) to 100 µl of E. coli DH10Bac cells on ice.Mix gently, incubate for 30 min on ice and transfer to chilled electroporation cuvettes. Transform by electroporation using program “Ec2” if using cuvettes of 2 mm electrode gap.Immediately add 1 ml of ice-cold 2YT medium, without antibiotics, and transfer to culture tubes for incubation at 37 °C, shaking at 225 rpm for 4 h.Prepare 10-fold serial dilutions of the cells (e.g., 1, 10-1 , 10-2 , 10-3 ) and plate 100 µl of each dilutions on LB agar plates for blue-white colony selection (Recipe 1) and incubate plates for 48 h.Pick white colonies from any plate with sufficiently isolated colonies, separately, into 15 ml of LB medium containing 50 µg/ml kanamycin, 10 µg/ml tetracycline, 7 µg/ml gentamicin and incubate overnight at 37 °C, 180 rpm.",
    "Centrifuge at 6,000 x g for 5 min at 4 °C to harvest cells and purify bacmids from the pellet using the “Purelink HiPure Plasmid MiniprepKit” according to manufacturer’s protocol.Store the bacmids at -20 °C.Recommended Step: Verify the integrity of recombinant 5-HT2AR sequence by running PCR using manufacturer specified pUC/M13 forward and reverse primers and following manufacturer’s protocol. These primers are specific for the bacmid sequence and would bind to upstream and downstream sites flanking mini-attTn7 site sandwiching the 5-HT2AR gene.Preparation of high-titer viral stockIncubate healthy Sf9 cells from suspension culture (see Note 2) in 6-well plate (8 x 105 cells per well) at 27 °C. Wait for ~1 h to allow cells to adhere to the surface of the well. Wash cells twice with antibiotics free 2 ml of Grace’s insect cell medium to remove residual non-adherent cells and adjust the plated cells to antibiotics free conditions.Mix 1.5 µg freshly prepared bacmid and 8 µl of Cellfectin II reagent, separately, into 100 µl of antibiotics-free Grace’s insect cell medium. Mix both the solutions and incubate for 30 min at room temperature. Then add 800 µl of antibiotics-free Grace’s insect cell medium into the 200 µl transfection mixture and add the mixture drop-wise evenly into each well. Incubate for 4 h at 27 °C. For untransfected (control) cells, prepare and add the Cellfectin II reagent without any bacmid to the well.Wash cells in each well with 2 ml of regular Sf9 cell culture media (Recipe 2) and incubate for 5-6 days till the completion of infection.Compare the transfected cells with untransfected ones (see Note 2) and at the end of infection, harvest viral stock by mild centrifugation at 500 x g at 4 °C. Collect the supernatant (i.e., the culture medium) and discard the pellet.",
    "The supernatant is the P0 baculoviral stock.Dilute the P0 stock at a multiplicity of infection (MOI) of ~0.01-0.1 into a small volume of ~10 ml Sf9 cell culture in shake flask and incubate at 27 °C, 130 rpm for 48 h. Harvest the supernatant containing the culture medium by centrifugation at 500 x g at 4 °C and store this as P1 stock. (see Notes 4 and 5 for details on selecting the MOI and the time of harvest)Repeat above step by diluting P1 stock into larger volumes (~250 ml) of Sf9 culture, at MOI ~0.01–0.1 and harvest the supernatant containing the culture medium by centrifugation and store this as P2 stock. The P2 stock is to be used for protein production.Immediately filter all harvested baculovirual stocks using a 0.2 µm low protein binding syringe filter.Measure the baculoviral titer for P1 and P2 stocks using the Baculoviral Titer kit by following manufacturer’s protocol using flow cytometry (Figure 1). Briefly,Seed approximately 200 µl of Sf9 cells (2 x 106 cells/ml) from a healthy batch of suspension culture (see Note 2) into each well of a 24-well plate.Serially dilute the baculoviral stock whose titer is to be measured in 10-fold dilution steps using culture medium as the diluent (e.g., 1:5, 1:50, 1:500 and so on). Subsequently, add 200 µl of the diluted baculovirus into each well of the 24-well plate containing 200 µl of plated cells, leading to an additional 2-fold dilution (and net dilution of 1:10, 1:100, 1:1,000 and so on).Incubate cells as suspension culture for 18 h at 27 °C, 170 rpm. Harvest cells by mild centrifugation for 3 min to maintain cells suitable for cytometry. Wash cells twice with ice-cold PBS buffer (Recipe 3) and stain with anti-gp64-PE conjugated antibody for 20 min at 4 °C in the dark.",
    "Wash cells twice with ice-cold PBS buffer and resuspend in PBS buffer containing 1% BSA.Analyze cell count by flow cytometer and obtain viral titer as per manufacturer’s protocol for “Baculoviral Titer kit” (Figures 1A-1D).Store working stocks (e.g., part of the P2 stock) at 4 °C for up to 6 months and the rest, including all P0 and P1 stocks, at -80 °C. For freezing, aliquot baculoviral stocks to minimize free-thaw cycles, add 3% BSA and store at -80 °C. Store all aliquots (at 4 °C and -80 °C) in light protection tubes or wrap tubes by Aluminum foil to protect from sunlight.Expression of 5-HT2AR in Sf9 cell cultureIncubate 20-50 ml of healthy Sf9 cells at a density of 2-3 x 106 cells/ml in shake flasks at 27 °C, 130 rpm and scale up to the desired volume maintaining cell viability in rapid growth phase (see Note 2).Infect cells at MOI of 0.1 and incubate at 27 °C for 30 h at 130 rpm. Add 1% (v/v) Production Boost Additive (PBA) to the cell culture and incubate for 66 h. Alternately in absence of PBA, infect cells at MOI of 5 and incubate for 48 h (see Note 2 for factors affecting the protein expression).Harvest cells by centrifugation at 3,000 x g, for 10 min at 4 °C.Wash the pellet with ice cold PBS buffer and store at -80 °C after flash freezing in liquid nitrogen.For the expression of low- or high-glycosylated forms of the receptor, harvest the culture after 48 h or 120 h, respectively, after the time of addition of PBA. Run a Western blot analysis of the cell lysate (Figure 1E) and select the most appropriate harvest time for optimal extent of glycosylation (see Note 6).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200730/20200730081239_2199.jpgFigure 1. Estimation of baculoviral titer using flow cytometry.",
    "Representative dot plot analysis of flow cytometry data for (A) uninfected Sf9 cells (red dots) and, (B) Sf9 cells infected with P2 baculovirus (green), and stained by anti-gp64 PE-conjugated antibody. Histogram plots of cell count as a function of PE signal, indicate distinct populations for (C) uninfected Sf9 cells, gated (black oval) in (A), as well as (D) PE-positive infected Sf9 cells, gated (black oval) in (B), providing an estimate of baculoviral infection due to expression of gp64 in Sf9 cells. The signal in P2 quadrant increases (or decreases) proportionally with higher (or lower) viral loads in serially diluted baculoviral stocks as noted in Step B8b. (E) Western blot analysis of the variation of glycosylated and non-glycosylated 5-HT2AR in absence of PBA (Lane 1, from left) and presence of PBA (Lanes 2-8), with post-infection harvest times shown above respective lanes. The negative control corresponds to cells that were not transfected by bacmid. 5-HT2Agly+ and 5-HT2Agly- indicate the 5-HT2AR with and without glycosylation, respectively.Purification of 5-HT2ARResuspend cell pellet from approximately 1 L culture in 30 ml of ice-cold hypotonic buffer (Recipe 4), followed by mild sonication on ice (pulse on for 10 s, off for 30 s, 10% power, for 3 cycles). In this and all subsequent steps of purification, cell pellets are resuspended by pipetting.Ultracentrifuge the cell suspension at 150,000 x g, 4 °C for 30 min. Discard the supernatant and repeat the washing step with hypotonic buffer two more times.Wash the residual pellet with 30 ml of ice-cold hypertonic buffer (Recipe 5), ultracentrifuge at 150,000 x g, 4 °C for 30 min and discard the supernatant.Wash the pellet with ice-cold PBS (Recipe 3) to remove residual media and store the pellet at -80 °C until further use.",
    "Resuspend the membrane pellet in 4 ml of resuspension buffer (Recipe 6) and incubate for 1 h at room temperature.Add α-iodoacetamide to a final concentration of 2 mg/ml and incubate further for 30 min at 4 °C (see Note 7).Solubilize the ~4 ml solution after α-iodoacetamide treatment in 4 ml of solubilization buffer (Recipe 7) to achieve a 1:1 dilution and incubate for 2 h at 4 °C by gentle tumbling.Ultracentrifuge the solubilized membranes at 150,000 x g, 4 °C for 30 min, collect the supernatant and discard the pellet.Add concentrated solutions of buffered NaCl and imidazole to the solubilized protein in supernatant to match the equilibration buffer (Recipe 8).Add the solubilized protein solution to (approximately) 2 ml of pre-equilibrated Ni-NTA resin and incubate overnight at 4 °C by gentle tumbling.Collect the resin by centrifugation at 500 x g at 4 °C for 10 min. Wash the resin four times with 3 column volumes (CVs) of wash buffer I (Recipe 9), followed by four washes of 2 CV wash buffer II (Recipe 10).Elute the protein by five washes of 1 CV elution buffer (Recipe 11) and collect the supernatant separately for each wash, since the 1st wash contains the maximum protein with decreasing concentrations in subsequent washes, and enables easier detection during electrophoresis (Figure 2A). Pool the purified fractions and exchange into an appropriate imidazole free buffer (e.g., Elution buffer without imidazole) and concentrate by ultrafiltration.Radioligand binding assayResuspend membrane pellet from approximately 50 ml of Sf9 cell culture in approximately 5 ml of radioligand binding buffer (Recipe 12). Adjust volumes of membrane pellet or resuspension buffer in order to have approximately 50 µg total protein (see Note 8) in 500 µl reaction volume for each reaction to be performed in triplicates. Estimate membrane protein concentration using BCA assay.",
    "For competition binding assay (Figure 2B):Incubate the resuspended membrane pellet in triplicates with 3 nM [3H]-ketanserin (hot ligand) and increasing concentrations of serotonin (cold ligand), ranging from 1 pM to 100µM (corresponding approximately to 10-3 to 105 times the dissociation constant, Kd), for 1 h at room temperature in the dark.For saturation binding assay (Figure 2C):Incubate the resuspended membrane pellet in triplicates with increasing concentrations of [3H]-ketanserin (hot ligand), ranging from 0.25 nM to 10 nM (corresponding approximately to 0.25 to 10 times the dissociation constant, Kd), for 1 h at room temperature in the dark.For determination of non-specific binding, incubate the reaction with 10 µM serotonin (cold ligand).At the end of reaction, harvest each reaction using a 12-well cell harvester by filtering through 25 mm GF/B filters pre-soaked in 0.3% polyethylenimine.Wash each filter thrice with 2 ml of ice cold 50 mM Tris buffer (pH 7.4) and dry overnight in air.Add 5 ml scintillation fluid into each vial containing dried filters followed by measurement in scintillation counter (Figures 2B and 2C).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200730/20200730081317_3364.jpgFigure 2. Results of purification and radioligand binding assay for 5-HT2AR. (A) 10% SDS PAGE analysis of various fractions of purification steps, after staining with Coomassie. Lanes 1-4 indicate, Molecular weight marker (Ln 1), crude cell lysate (Ln 2), flow through after loading the solubilised protein on to the resin (Ln 3), eluted protein after dialysis in imidazole free buffer and concentration (Ln 4). The glycosylated and non-glycosylated 5-HT2AR are shown in red and green rectangles, respectively. (B) Competition binding assay plot of 5-HT2AR using 3 nM [3H]-ketanserin in presence of increasing concentrations of serotonin, reveal a Ki of 39 nM for membrane bound receptors (logKi = -7.41 ± 0.29). (C) Saturation binding assay plot of [3H]-ketanserin specific binding to 5-HT2AR reveals a dissociation constant (Kd) of 1.",
    "47 ± 0.39 nM with maximum number of binding sites (Bmax ) of 567 ± 57 fmol/mg of protein. For (B) and (C), curves shown are from representative experiments performed in triplicates and values for Kd, logKi and Bmax represent the mean (± SEM) obtained from triplicate sets of measurements"
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Biophysics",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}