{
  "id": 11236,
  "origin_website": "Jove",
  "title": "Therapeutic Gene Delivery and Transfection in Human Pancreatic Cancer Cells using Epidermal Growth Factor Receptor-targeted Gelatin Nanoparticles",
  "procedures": [
    "1. Preparation of Plasmid DNA Encapsulated EGFR-Targeted Gelatin Nanoparticles\nSynthesis of thiolated gelatin\n \nThiolated gelatin were synthesized as previous method 2-5 , by covalent conjugation with 2-iminothiolane on primary amino groups of type B gelatin. 1 gram of gelatin was dissolved in 100 ml deionized water and incubated with 20 mg 2-iminothiolane hydrochloride at room temperature for 15 hours.\nUnreacted reagent was removed by dialysis against 5 mM HCl solution, followed by 1 mM HCl solution for 3 hours each. Purified thiolated gelatin was freeze dried and stored at 4°C for further use.\nPreparation of DNA-containing nanoparticles\n \n200 mg thiolated gelatin was dissolved in water and pH of solution was adjusted to 7 by addition of 0.2 M NaOH solution. 1mg DNA was added and gently mixed with gelatin solution.\nChilled ethanol was added slowly into the mixture while stirring solution at high speed. Nanoparticles were formed when solvent composition changed to 75% hydro-alcoholic solution.\nNanoparticles were further crosslinked by slow addition of 0.1 ml 8% (v/v) glyoxal solution. Unreacted reagents were quenched with 0.5 ml 0.2 M glycine solution.\nNanoparticles were ultra-centrifuged at 16,000 rpm for 30 minutes. Pellets were washed with deionized water twice and purified nanoparticles were freeze-dried and stored at 4°C.\nSurface modification of nanoparticles\n \nNanoparticles were suspended in 0.1 M phosphate buffer (pH 7.4) with concentration of 10 mg/ml and incubated with 2 times weight of methoxy-PEG-succinimidyl carboxy methyl ester (mPEG-SCM, MW 2,000 Da) or maleimide-PEG-succinimidyl carboxy methylester (MAL-PEG-SCM, MW 2,000 Da) for 2 hours at room temperature with slow stirring.\nPEGylated nanoparticles were collected with ultra-centrifugation at 16,000 rpm for 30 minutes. Pellets were washed with deionized water twice and purified nanoparticles were freeze-dried and stored at 4°C.",
    "MAL-PEG-SCM modified nanoparticles were suspended in 0.1M phosphate buffer (pH 6.5) with concentration of 10mg/ml and incubated with 10% weight of EGFR specific peptide (Y-H-W-Y-G-Y-T-P-Q-N-V-I-G-G-G-G-C) for 6 hours at room temperature with slow stirring.\nPeptide modified nanoparticles were collected with ultra-centrifugation at 16,000 rpm for 30 minutes. Pellets were washed with deionized water twice and purified nanoparticles were freeze-dried and stored at 4°C.\n2. Characterization of EGFR-Targeted Nanoparticles\nParticle size and zeta potential measurement\n Nanoparticles were suspended in water with concentration of 1mg/ml. Suspension was analyzed using Zetasizer Nano (Malvern Inc). Particle size analysis was carried out at a scattering angle of 90 degrees at 25°C. Zeta potential was measured at default parameters of dielectric constant, refractive index and viscosity of water at 25°C.\nScanning Electron Microscopy\n Lyophilized nanoparticles were mounted on aluminum sample mount and sputter-coated with palladium to enhance conductivity and minimize buildup of charges. Samples were observed for surface morphology under a Hitachi 4800 field emission scanning electron microscope at 3 kV.\nElectron spectroscope for chemical analysis (ESCA)\n Freeze-dried formulation of control, PEGylated and peptide modified nanoparticles were analyzed by ESCA. It was performed at the National ESCA and Surface Analysis Center for Biomedical Problems (NESAC/BIO), University of Washington (Seattle, WA).\n \nSamples were placed in ultrahigh vacuum and exposed to low-energy x-ray beam, which induced an emission of secondary photoelectrons from the surface.\nBy plotting number of detected electrons as a function of binding energy, observed spectrum peaks were assigned to each chemical components.\nHigh-resolution analysis of C1s spectra was performed to determine exact chemical composition from hydrocarbon (C-C or C-H at 285mV), ether (C-O) at 286.4mV), and carbonyl (C=O at 288.1 mV), and relative composition of each functionality was determined by area under curve.\nStability of encapsulated plasmid",
    "The stability of the encapsulated plasmid DNA was confirmed by running the extracted DNA on pre-cast gels. The nanoparticles were digested with 0.2 mg/ml protease containing PBS (30 min at 37°C) and 0.2 U/ml DNAse (10min at room temperature) separately, simultaneously or sequentially. Samples were then loaded onto 1.2% agarose gel (GP) (E-Gel, Invitrogen, CA) at a concentration of 100ng/well in a 18μL volume per well. Naked plasmid was loaded as control and gel was run at 75 V for 30 minutes. Kodak Digital X-ray Specimen (DXS) System was used to visualize bands with UV transluminescence.\nDetermination of plasmid loading\n Plasmid encapsulated nanoparticles were suspended at 1mg/ml and digested with 0.2mg/ml protease at 37°C for 30 minutes. Solution was centrifuged at 13,000 rpm for 10 minutes and supernatant was collected and tested for plasmid concentration with Picogreen assay (Invitrogen). Encapsulation ratio was calculated by dividing the encapsulated plasmid concentration with the initial loading 0.5% (w/w).\n3. In Vitro Transfection Studies in Panc-1 Pancreatic Cancer Cells\nCell culture conditions\n Panc-1 and Capan-1 pancreatic adenocarcinoma cell lines, SKOV3 ovarian adenocarcinoma cell line and NIH-3T3 murine fibroblast cell line were obtained from ATCC. Panc-1 and NIH-3T3 were grown with DMEM supplied with L-glutamine, Pen-strep and 10% fetal bovine serum at 37°C and 5% CO2, while Capan-1 required DMEM supplied 20% fetal bovine serum. SKOV3 was grown in RPMI-1640 supplied with 10% fetal bovine serum.\nWestern blot analysis for EGFR expression\n \nCell lysates were collected from 2 million cells and analyzed for total protein concentration using BCA assay (Pierce). NIH-3T3 was used as negative control and SKOV3 was used as positive control for EGFR expression.\n10 μg of total protein extract was run on pre-cast sodium dodecyl sulfate-polyacrylamide gel electrophoresis (SDS-PAGE) system at 135V for 90 minutes.",
    "Subsequently, gel was transferred onto PVDF membrane by iBlot Dry Blotting System (Invitrogen).\nMembrane was blocked with 5% non-fat milk in Tween-containing Tris buffer saline (TBS-t) for 1 hour at room temperature.\nMembrane was cut and incubated with 1:1,000 dilution of primary rabbit beta-actin antibodies and 1:1,000 dilution of primary rabbit EGFR antibodies separately overnight at 4°C.\nMembrane was then washed twice with TBS-t and incubated with 1:2,000 dilutions of secondary anti-rabbit horse-radish peroxidase-conjugated IgG in TBS-t for 1 hour at room temperature.\nAfter rinsing excess antibodies with TBS-t and water, 4 ml ECL substrate (Pierce, Rockford, IL, USA) was added and incubated with membranes for 5 minutes.\nChemiluminescent bands were then visualized using Kodak Digital X-ray Specimen (DXS) System.\nCell viability studies with different formulations\n \nPanc-1 cells were grown in 96-well plates at 10,000 cells per well in 200μL of supplemented DMEM overnight.\nGrowth medium was replaced with serum free media containing different concentrations of nanoparticles with 0, 0.5, 1, 2, 4, 6 mg/ml. 1mg/ml PEI, a known cytotoxic cationic polymer, was used as positive control.\nCells were treated with 200μL nanoparticles for 6 hours and then replaced with 20μL MTS reagent and 100μL complete culture media.\nAfter post incubation for 3 hours at 37°C in 5% CO2, the absorbance of formazan product was measured at 490nm with Biotek SynergyHT plate reader (Winooski, VT).\nThe percent viability of cells was expressed as the ratio of absorbance of polymer treated cells relative to negative control (0mg/ml) multiplied by 100 and plotted as function of polymer concentrations.\nCell trafficking studies\n \nRhodamine B isothiocyanate (RBITC) was used to conjugate on thiolated gelatin by reaction with amine group. After dialysis and lyophilization, RBITC labeled thiolated gelatin was used for nanoparticles preparation.",
    "Before desolvation, 25μL PicoGreen was mixed with 1mg plasmid for 1 minute and labeled plasmids were added to gelatin solution. Different formulations were made following the previous method.\nPanc-1 cells were grown in 6-well plates containing glass cover-slips with 200,000 cells per well. After overnight growth, 2ml of labeled nanoparticles were treated into each well with concentration of 1mg/ml in serum free medium.\nAfter different time points, from 15 minutes to 6 hours, medium was replaced with culture medium containing 1μg/ml of Hoest 33342 (Invitrogen) for 15 minutes incubation at room temperature. 2ml of 4% paraformaldehyde solution was replaced into each well to fix cells. Cells were then washed with PBS twice.\nCoversilps were mounted on to glass slides. Laser scanning confocal fluorescence microscopy was used to take images of fixed cells.\nQualitative determination of transfection efficiency by fluorescence microscopy with pEGFP-N1 encapsulated nanoparticles\n \npEGFP-N1 plasmids were encapsulated into nanoparticles and suspended in serum free media with concentration equivalent to 10μg plasmids per ml for further treatments.\nPanc-1 cells were grown overnight in 6-well plates containing glass cover-slips with 200,000 cells per well. 2ml of pEGFP-N1 plasmids encapsulated nanoparticles were treated into each well. 20μg of plasmids were mixed with 20μl Lipofectin, cationic lipid transfection reagent, and it was used as positive control, while untreated cells were used as negative control.\nCells were incubated with different formulations for 6 hours.\nMedium was replaced with culture medium and cells were post-transfected for 24, 48, 72 and 96 hours.\nAfter post-transfection, medium was replaced with culture medium containing 1μg/ml of Hoest 33342 (Invitrogen) and incubated with cells for 15 minutes at room temperature.",
    "Coverslips were mounted onto glass slides and expression of GFP in the cells was observed by fluorescence microscope. Differential interference contrast (DIC) and fluorescence images acquired using Olympus BX61 microscope and digital images were processed with Image J software.\nQuantitative determination of transfection efficiency by ELISA with pEGFP-N1 encapsulated nanoparticles\n \npEGFP-N1 plasmids were encapsulated into nanoparticles and suspended in serum free media with concentration equivalent to 10μg plasmids per ml for further treatments.\nPanc-1 cells were grown overnight in 6-well plates with 200,000 cells per well. 2ml of pEGFP-N1 plasmids encapsulated nanoparticles were treated into each well. 20μg of plasmids were mixed with 20μl Lipofectin, cationic lipid transfection reagent, which was used as positive control and untreated cells were used as negative control.\nCells were incubated with different formulations for 6 hours.\nMedium was replaced with culture medium and cells were post-incubated for 24, 48, 72 and 96 hours.\nAfter post-transfection, cell lysates were collected from each well and analyzed for total protein concentration using BCA assay (Pierce).\nwell plate was coated with 100μl of 1:1000 dilutions of monoclonal anti-GFP antibodies in each well. After 2 hours incubation, plate was washed with PBS-0.5%(w/v) Tween-80 for 4 times.\n300μl TBS blocking buffers were added into each well and incubated for 2 hours. Then plate was then washed with PBS-0.5% (w/v) Tween-80 for 4 times.\n30μg of proteins of each group were added into the plate and incubated overnight at 4°. Then plate was then washed with PBS-0.5% (w/v) Tween-80 for 4 times.\n100μl of 1:2400 dilutions of secondary anti-GFP antibodies relative to alkaline phosphatase were added to each well and incubated for 1 hour. Then plate was then washed with PBS-0.5% (w/v) Tween-80 for 4 times.",
    "100μl alkaline phosphatase substrates were added to each well and incubated for 30 minutes to 1 hour. Plate was measured with BioTek Synergy HT plate reader for absorbance at 405nm.\nExpressed GFP concentration was reported as nanograms per milligrams of total protein.\nQualitative determination of transfection efficiency by RT-PCR with wt-p53 plasmid encapsulated nanoparticles\n \nWt-p53 plasmids were encapsulated into nanoparticles and suspended in serum free media with concentration equivalent to 10μg plasmid per ml for further treatments.\nPanc-1 cells were grown overnight in 6-well plates with 200,000 cells per well. 2ml of wt-p53 plasmids encapsulated nanoparticles were treated into each well. 20μg of plasmids were mixed with 20μl Lipofectin, cationic lipid transfection reagent, which was used as positive control and untreated cells were used as negative control.\nCells were incubated with different formulations for 6 hours.\nMedium was replaced with culture medium and cells were post-incubated for 48 hours.\nmRNA were extracted from each well by using High Pure RNA isolation kit (Roche, Indianapolis, IN) and measured with Nanodrop 2000 (Thermo Scientific, Wilminton, DE).\nRT-PCR was done by using QIAGEN One-step RT-PCR kit (QIAGEN, Valencia, CA). Primers for p53, Bax, Bcl-2, Beta-actin, DR5, Apaf-1, PUMA, Survivin were synthesized by Eurofins MWG Operon (Huntsville, AL).\nPCR products were evaluated with gel electrophoresis and the pixels of cDNA bands were analyzed with ImageJ software.\nQuantitative determination of therapeutic efficiency with wt-p53 palsmid encapsulated nanoparticles\n \nWt-p53 plasmid was encapsulated into nanoparticles and suspended in serum free media with concentration equivalent to 10μg plasmids per ml for further treatment.",
    "Panc-1 cells were grown overnight in 6-well plates with 200,000 cells per well. 2ml of wt-p53 plasmids encapsulated nanoparticles were treated into each well. 20μg of plasmids were mixed with 20μl Lipofectin, cationic lipid transfection reagent, which was used as positive control and untreated cells were used as negative control.\nCells were incubated with different formulations for 6 hours.\nMedium was replaced with culture medium and cells were post-incubated for 24, 48, 72 and 96 hours.\nChromatin Condensation/Membrane Permeability/Dead Cell Apoptosis Kit (Invitrogen, Carlsbad, CA) was used to label apoptotic cells, necrotic cells and live cells with different dyes.\niCys Research Imaging Cytometer from CompuCyte (Westwood, MA) was used to analyze and compare apoptosis levels after treatment. Based on the fluorescence microscopic images, the intensities of all colors was recorded and plotted versus counts and the percentages for different populations were calculated.\nCompared to the negative control, which means there was no treatment for the cells, the apoptotic cells fold changes were calculated out and listed in the graph.\n3.8.8 Apo-ONE Homogeneous Caspase-3/7 Assay kit (Promega, Madison, WI) was used to examine the pro-apoptotic activity after transfection of wt-p53 plasmid. 1mg/ml PEI was used as a negative control to eliminate all the apoptotic activity. After post-transfection, cells were treated with rhodamine 110, bis-(N-CBZL-aspartyl-L-glutamyl-L-valyl-L-aspartic acid amide; Z-DEVD-R110), which is a substrate of caspase 3/7, for up to 18 hours.\nPlate was measured with BioTek Synergy HT plate reader for fluorescence at 490/520 nm. Based on the intensity of green fluorescence, pro-apoptotic activity could be evaluated.\n4. Representative Results\n1. Synthesis and Chatacterization of EGFR Targeted Nanoparticles",
    "EGFR targeting peptide-modified nanoparticles were synthesized as the scheme showed in figure 1. The nanoparticles prepared by desolvation were characterized for particle size and zeta potential. The average size and surface charge of the particles prepared from thiolated gelatins with different degrees of thiolation are listed in Table 1. The mean particle diameters of different nanoparticles were between 150-250 nm. Thiolated nanoparticles have smaller size compared to gelatin nanoparticles, might due to the disulfide bridge formation inside particles. With different surface modifications, sizes of nanoparticles have increased. The zeta potentials of different formulations were around -20 mV. With SEM analysis, the sizes, surface morphology and spherical shape of nanoparticles were observed and corresponding to Zetasizer result. DNA loading efficiencies in gelatin nanoparticles and thiolated gelatin nanoparticles were higher than 95% (Table 1).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3612/3612fig1.jpg\nFigure 1. Chemical Reaction Scheme, illustrating surface modification of thiolated gelatin nanoparticles with epidermal growth factor receptor (EGFR) binding peptide through a poly(ethylene glycol) (PEG) spacer. Please click here[href=http://www.jove.com/files/ftp_upload/3612/3612fig1_lg.jpg] to see a larger version of this figure.\nCharacterization of Nanoparticles\ntable:\n﻿0,1,2,3\nFormulation,Nanoparticle Diameter (nm),Zeta Potential (mV),Plasmid DNA Loading Efficiency (%)\nGel NP,151.4 ± 23.5,-17.1 ± 5.23,95.6 ± 2.2\nSH-Gel NP,132.6 ± 17.9,-24.6 ± 5.16,97.0 ± 3.8\nSH-Gel-PEG,179.0 ± 30.9,-22.3 ± 9.50,95.8 ± 6.5\nSH-Gel PEG Peptide,230.8 ± 41.5,-18.1 ± 4.02,94.8 ± 5.1\nTable 1. Particle size, surface charge, and plasmid DNA encapsulation efficiencies of control and EGFR-targeted gelatin and thiolated gelatin nanoparticles.",
    "High-resolution C1S scans of electron spectroscopy for chemical analysis (ESCA) was used to analyze surface component of thiolated gelatin (SH-Gel NP), PEG-modified thiolated gelatin (SH-Gel PEG) and EGFR targeting peptide-modified thiolated gelatin nanoparticles (SH-Gel PEG Peptide). The results in Table 2 showed peak intensities of the C-H (hydrocarbon), C-O (ether), and C=O (carbonyl) groups at 285.0, 286.3, and 288.1 eV, respectively. The ether C-O signal has increased after PEG modification and decreased after peptide conjugation. While nitrogen composition has decreased after PEG modification and increased after peptide modification, which confirmed the presence of EGFR-targeting peptide on the nanoparticles. ESCA analysis has further confirmed PEG and peptide surface modification.\nElectron Spectroscopy for Chemical Analysis of Nanoparticles Surface composition\ntable:\n﻿0,1,2,3\nFormulation,C 1s (%),O 1s (%),N 1s (%)\nSH-Gel NP,59.3±0.8,22.9±0.5,12.9±0.1\nSH-Gel-PEG,58.2±0.6,28.0±1.2,9.5±0.7\nSH-Gel PEG Peptide,56.7±0.8,25.9±0.7,12.3±0.6\nFormulation,C-C (%),\"C-O, N (%)\",C=O (%)\nSH-Gel NP,51.5,26.6,21.9\nSH-Gel-PEG,17.1,63.1,19.8\nSH-Gel PEG Peptide,33.1,42.8,24.1\nTable 2. C1S high-resolution scans of electron spectroscopy for chemical analysis (ESCA)\nIn order to examine the stability of encapsulated plasmid, nanoparticles were treated with protease or DNAse separately, simuntaneously or sequentially. After electrophoresis, the results in Figure 2 have shown that plasmid DNA encapsulated in all the nanoparticles are protected by nanoparticles and stable, comparable to naked plasmid DNA. These studied have shown that all these nanoparticles could encapsulate and preserve the plasmid structure after encapsulation.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3612/3612fig2.jpg\nFigure 2. Stability of plasmid DNA encapsulated in thiolated gelatin, PEG-modified thiolated gelatin, and EGFR peptide-modified thiolated gelatin nanoparticles by agarose gel electrophoresis. The nanoparticles were treated with 0.2 mg/ml of protease to prove plasmid DNA encapsulation within the nanoparticle matrix\n2. Baseline EGFR Expression in Pancreatic Cancer Cells",
    "Two human pancreatic adenocarcinoma cell lines (Panc-1 and Capan-1) were analyzed by western blot for EGFR expression. Human ovarian adenocarcinoma (SKOV3) and murine fibroblast ((NIH-3T3) cells were chosen as positive and negative controls, respectively. Beta-actin was analyzed as protein loading control. Panc-1 cells have shown higher EGFR expression compared to Capan-1 and this cell line was then used for the following in vitro studies\n3. Cytotoxicity of Control and Surface-Modified Thiolated Gelatin Nanoparticles\nIn order to evaluate the cellular interaction of nanoparticles, cytotoxicity assays were carried out after treatment with nanoparticles. Based on the results in Figure 3, both the control and the surface-modified nanoparticles were relatively safe and biocompatible in Panc-1 cells even at high concentrations, with comparison to PEI. The following studies were carried out with 1mg/ml nanoparticles.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3612/3612fig3.jpg\nFigure 3. Percent cell viability as a function of nanoparticle formulation concentrations in Panc-1 cells as evaluated by tetrazolium dye (MTS) assay\n4. Receptor Mediated Cell Uptake in Panc-1 Cells\nTo confirm surface accessibility of EGFR-targeting peptide and receptor-mediated endocytotic uptake of nanoparticles, a system was designed by labeling each component with different fluorescence for visualization of nanoparticles uptake and trafficking in cells. With this labeling system, plasmid DNA, nanoparticles and cell nucleus could be identified. Laser scanning confocal fluorescence microscopy was used to take images at different time points, from 15 minutes to 6 hours. By comparing the images of different formulations, peptide conjugated gelatin nanoparticles showed the fast uptake and plasmid release within 30 minutes. This result further proved that EGFR peptide-conjugated nanoparticles underwent facilitated endocytosis with quick interaction between the EGFR specific peptide and EGFR receptors on cell surface, which was much faster, compared to other nanoparticles, which underwent non-specific endocytosis.\nCell Trafficking Study\nimgsrc://cloudfront.jove.com/files/ftp_upload/3612/3612fig4.jpg",
    "Figure 4. Confocal fluorescence microscopy analysis of DNA-encapsulated nanoparticle uptake and trafficking in Panc-1 cells. (red=rhodamine-labeled nanoparticles, green=PicoGreen-labeled plasmid DNA, and blue=DAPI-labeled nucleus). The laser power was 7 times less in last four figures of lower panel.\n5. Qualitative and Quantitative In Vitro Transfection with Enhanced Green Fluorescent Protein\nELISA in Figure 5 and fluorescence microscopic analysis in Figure 6 were used to measure qualitative and quantitative GFP tranfection efficiency in Panc-1 cells upon administration of unmodified, PEG-modified and EGFR peptide-modified thiolated gelatin nanoparticles. Plasmids delivered by EGFR-targeted nanoparticles resulted in the highest level of GFP expression after 48 hours relative to other controls, including Lipofectin-complexed DNA.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3612/3612fig5.jpg\nFigure 5. GFP expression analyzed by ELISA plotted as a function of time post-administration of plasmid DNA in control and EGFR-targeted nanoparticles.\nFluoresence Microscopic Analysis for GFP transfection\nimgsrc://cloudfront.jove.com/files/ftp_upload/3612/3612fig6.jpg\nFigure 6. Qualitative analysis of green fluorescent protein expression in Panc-1 cells by epifluoresence microscopy after 24, 48, 72 and 96 hours post-transfection with EGFP-N1. Lipofectin-DNA complex was used as a positive control.\n6. In Vitro Tranfection with Wild-Type p53 Plasmid in Panc-1 Cells\nWild-type p53 plasmids pORF-hp53, with EF-1α / HTLV hybrid promoter were extracted from E. coli and encapsulated into nanoparticles to study the apoptotic therapeutic effect. Panc-1 cells were treated with particles for 6 hours and post-transfected for additional 24, 48, 72, and 96 hours.",
    "Since p53 could induce apoptosis in cells and in order to accomplish this function, many downstream transcription factors would be involved and directly regulated by expression of wt-p53. Among them, Bax, caspase-3, caspase-9, DR5, PUMA and Apaf-1 would be up-regulated by expression of p53 and while Bcl-2, survivin would be down-regulated. In order to examine the levels of these transcription factors, mRNA was extracted from Panc-1 cells after 48 hours post-transfection and used for RT-PCR. The products were evaluated with gel electrophoresis and bands were analyzed with ImageJ. Based on the results showed in Figure 7, survivin decreased significantly with the treatment of EGFR targeted thiolated gelatin nanoparticles compared to other treatments, no obvious change was seen in Bcl-2, Bax and expression of caspase-3, caspase-9, DR5, PUMA and Apaf-1increased with targeted nanoparticles treatment.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3612/3612fig7.jpg\nFigure 7. The mRNA levels of downstream factors of wt-p53 expression were compared by RT-PCR after 48 hours post-transfection.\nAfter wt- p53 transfection, Chromatin Condensation/ Membrane Permeability/ Dead Cell Apoptosis kit was used to differentiate apoptotic cells, necrotic cells and live cells with different dyes. iCys Research Imaging Cytometer from CompuCyte (Westwood, MA) was used to analyze and compare apoptosis levels after treatment. Compared to the negative control, apoptotic cells fold changes were calculated out and listed in Figure 8. EGFR targeted thiolated gelatin nanopaticles have showed the highest apoptotic cell population after post-transfection. Analysis of caspase 3/7 activity also showed that EGFR-targeted nanoparticles had rapid internalization and highest level of apoptotic activity in Panc-1 cells.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3612/3612fig8.jpg\nFigure 8. Cytometric analysis of pro-apoptotic activity in control wt-p53 transfected Panc-1 cells using iCys° Imaging Cytometer"
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}