{
  "id": 3962,
  "origin_website": "Cell",
  "title": "Protocol for whole-brain immunostaining of the turquoise killifish after tissue clearing",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation of the killifish brain\nTiming: 1 day\nThis step describes how to dissect and pre-fix the killifish brain before tissue clearing.\nSacrifice fish\nTransfer fish to a 1.5 g/L tricaine solution.\nWait until the fish gills no longer move, and touch the caudal fin to confirm that they do not respond.\nTransfer whole fish into 30 mL of 4% paraformaldehyde (PFA) in 1×PBS (pH7.4) and incubate at 4°C from 6 to 24 h.\nNote: It is possible to perform brain dissection on freshly sacrificed fish, but it becomes much easier after fixation because the brain tissue hardens.\nBrain dissection under a stereomicroscope (Figure 1[href=https://www.wicell.org#fig1])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/682-Fig1.jpg\nFigure 1. Dissection of the turquoise killifish brain\n(A) Step-by-step images of brain dissection a. Cut the head between the gills and the pectoral fin. b. Isolate the fish head and remove the lower jaw. c. Flip the head upside-down. d. Clear the palate muscle from the upper jaw with fine forceps. e. Hold the spine to fix the head with fine tweezers and remove the eyes and gill covers. f. Remove the eyes and gill cover. g. Remove the head skin and muscle. h. Cut the skull to reveal the brain. i. Remove the upper skull to expose the brain. Red dashed lines indicate cutting lines.\n(B) Isolated brains from young (6-week-old, after sexual maturation, female) and old (16-week-old, around median lifespan, female) fish. The scale bar indicates 1 mm.\nCut below the gills with scissors.\nRemove the lower jaw and soft palate muscles.\nHold the spine tightly with forceps and cut out the eyes along the frontal skull.\nRemove skin and muscle above the skull.\nCut from the infraorbital ring to the subopercle.\nCarefully remove the frontal skull with fine forceps.",
    "Remove the brain from the lower skull.\nPut the isolated brain into 500 μL of the second fixation solution in the Binaree Tissue Clearing Starter’s kit and incubate without agitation for at least 6 h at 4°C.\nNote: The brain will float at first but will sink to the bottom of the tube as fixation occurs.\nCritical: The brain is an extremely soft tissue, and the brains of young fish are much softer than those of older fish. Even after the brain is fixed with PFA, it can still tear easily during dissection, particularly at soft structures such as the pineal and pituitary glands and the telencephalon. Cut out the frontal skull and remove the brain with special care.\nClearing the whole brain\nTiming: 7 days or more, depending on the amount of tissue clearing (Figure 2[href=https://www.wicell.org#fig2])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/682-Fig2.jpg\nFigure 2. Brain tissue clearing\nImages from the brain of an older fish are shown. (A) After treatment with tissue clearing solution A, (B) after the first wash, (C) after treatment with tissue clearing solution B, (D) after the second wash, and (E) in the mounting and storage solution. All brain images were taken under same magnification.\nThis step involves clearing the brain tissue before immunostaining for better visualization of immuno-stained or fluorescently tagged proteins. If you started with transgenic fish expressing a fluorescent protein, you can stop at optional step 5 and proceed directly to the imaging step.\nTissue clearing step A\nRemove the fixation solution carefully with a pipet.\nAdd 200 μL of tissue clearing solution A (provided in the kit) to the fixed brain and gently invert the sample a few times, and discard the solution.",
    "Add 500 μL of tissue clearing solution A and incubate the tube at 42°C for 3 days without shaking. Invert the tube gently a few times a day.\nRemove tissue clearing solution A with a pipet, taking special care not to touch the brain.\nAdd 500 μL of washing solution (provided in the kit) and briefly wash out the tissue clearing solution A and discard the solution.\nAdd 1 mL of washing solution and incubate the tube at 42°C for 8 h.\nRepeat the washing step (step f) twice.\nInvert the tube gently a few times per wash.\nTissue clearing step B\nRemove the washing solution carefully with a pipet.\nAdd 200 μL of tissue clearing solution B (provided in the kit) and gently invert the sample a few times to mix.\nAdd 500 μL of tissue clearing solution B and incubate at 35°C for 2 days without shaking. Invert the tube gently a few times a day.\nRemove tissue clearing solution B with a pipet, taking special care not to touch the brain.\nAdd 500 μL of washing solution and briefly wash out the tissue clearing solution B.\nAdd 1 mL of washing solution and incubate the tube at 35°C for 8 h.\nRepeat the washing step (step f) twice.\nInvert the tube gently a few times per wash.\nOptional: If you are using transgenic fish carrying a fluorescent protein, you can stop at this stage and store the brain. The cleared tissue can also be stored up to a week at 4°C without further immunostaining. Mounting and storage buffer (provided in the kit) should be washed out when you want to proceed immunostaining again with the cleared tissue.",
    "Add DAPI solution (1 μL per 1 mL solution) for nuclear staining into the washing solution at the final wash step and incubate the tube at 35°C for 8 h.\nRemove the washing solution carefully with a pipet.\nAdd 200 μL of mounting and storage solution, and gently agitate a few times.\nAdd 500 μL of mounting and storage solution.\nIncubate the tube at 35°C for 12 h.\nStore the tube at 4°C in the dark for long-term storage up to 1 month before imaging.\nOptional: If the brain tissue is not as clear as shown in Figure 2[href=https://www.wicell.org#fig2]D, repeat step 4 until the tissue is completely cleared.\nImmunostaining of the cleared brain\nTiming: 3 to 6 days\nThis step is for staining candidate proteins with appropriate antibodies to elucidate their location in the killifish brain. The antibodies for immunostaining should be tested for specificity, especially when using antibodies generated from orthologous proteins.\nCritical: To stain for two different proteins, it is critical to select compatible antibodies and determine the optimal staining order.\nNote: If the primary antibodies are all fluorescently tagged with different emission wave-lengths, the immunostaining can be performed at the same time, following the steps described below for primary antibody incubation.\nNote: If only one antibody is fluorescently tagged, confirm that the antibodies were generated in different hosts or different isotypes (eg, IgG and IgM), and determine the order of immunostaining. We would recommend staining with the unlabeled antibody first, followed by the appropriate secondary antibody, and then staining with the fluorescently tagged antibody.\nNote: If the two antibodies were generated in the same host species but they are labeled with different fluorescent tags (eg, anti-ProteinX-Alexa647 and anti-ProteinY-Alexa488 and both antibodies are generated in mice), both antibodies can be added to the same immunostaining solution.",
    "Note: If the two antibodies were generated in the same host species but they are not fluorescently tagged, the two antibodies cannot be used together due to cross-recognition by the secondary antibody. In this case, it would be necessary to fluorescently conjugate the antibodies prior to immunostaining or identify an antibody generated in a different host species.\nIncubation with CLOCK antibody\nRemove washing solution carefully with a pipet.\nGently wash the brain with 100 μL of staining solution (provided in the kit).\nAdd 100 μL of staining solution containing antibody.\nThe amount of antibody to use varies. Usually 1:100 is a good starting dilution for whole brain immunostaining, but we highly recommend testing at least a few antibody concentrations.\nNote: If you are comparing brains from animals at two different ages, it is always better to increase the volume of the immunostaining solution and put young and old brains together in the same tube so they are stained under equivalent conditions. Young and old brains can be identified later by the size.\nIncubate the brain with the anti-CLOCK antibody (1:200) at 4°C in the dark for 2 days without agitation.\nRemove the antibody solution and add 1 mL of washing solution.\nIncubate the tube at 35°C for 12 h without shaking and gently invert the tube from time to time during the incubation. Repeat this three times.\nOptional: Follow this step and skip step 8 if the primary antibody is fluorescent-tagged.\nRemove the washing solution carefully.\nAdd 200 μL of mounting and storage buffer.\nAdd 500 μL of mounting and storage buffer and incubate the sample at 35°C for 12 h without shaking. Gently invert the tube from time to time during the incubation.\nStore the tube at 4°C in the dark until imaging.",
    "Incubation of an Alexa Fluor 488-conjugated secondary antibody to the CLOCK antibody\nRemove the washing solution carefully with a pipet.\nGently wash the brain with 100 μL of staining solution.\nAdd 100 μL of staining solution containing a goat anti-rabbit IgG antibody conjugated with Alexa Fluor 488 (1:100).\nNote: The optimal concentration of the secondary antibody also varies, same as with the primary antibody. A 1:100 dilution is a good starting point for titrating the antibody.\nIncubate the brain with the secondary antibody at 4°C in the dark for 2 days.\nRemove the antibody solution and add 1 mL of washing solution.\nIncubate the tube at 35°C for 12 h without shaking and gently invert the tube from time to time during the incubation. Repeat this three times.\nIncubation with BMAL1 antibody conjugated with Alexa Fluor®647\nRepeat Steps 7a through 7f (BMAL1 antibody dilution, 1:200).\nRemove the washing solution carefully with a pipet.\nAdd 200 μL of mounting and storage buffer.\nAdd 500 μL of mounting and storage buffer, and incubate the sample at 35°C for 12 h without shaking. Gently invert the tube from time to time during the incubation.\nCheck the fluorescence briefly using a fluorescence microscope (e.g., Epifluorescence microscope or stereomicroscope with fluorescence equipment).\nStore the tube at 4°C in the dark until imaging.\nNote: When you store brain tissue in the mounting and storage solution, the tissue will shrink a bit, but this does not affect the overall structure.\nImaging of the stained brain\nTiming: 1 day per brain\nThis step introduces the protocol we have used to image the turquoise killifish brain in our group, but these steps may vary depending on the microscope and imaging software used.\nPreparation of agar blocks with stained brains (Figure 3[href=https://www.wicell.org#fig3])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/682-Fig3.jpg",
    "Figure 3. Embedding of cleared and stained brains for imaging\n(A) Place the brain in 2% agarose solution when its temperature is around 60°C. Suck the brain into a capillary placed at the posterior of the brain.\n(B) The agarose-embedded brain. Dashed-yellow box shows enlarged image of an embedded brain in the capillary.\n(C) The embedded brain status within the sample chamber of the lightsheet microscope. The red arrow indicates the brain direction. P, posterior, and A, anterior brain.\nCompletely melt 2% low melting temperature agarose in PBS.\nCool down the 2% agarose solution to around 60°C.\nSelect a proper-size capillary for the prepared brain.\nPour 3 mL of agarose into a Petri dish.\nPlace the brain onto the Petri dish in the agarose after brief washing with PBS.\nTransfer the brain into the agarose on the Petri dish and gently rotate the dish to cover the brain with the agarose.\nFill a capillary halfway with agarose, taking care to avoid bubbles.\nPlace the capillary at the posterior brain and suck the brain into the capillary using a plunger.\nMake sure the brain is placed 0.5–1 cm from the tip of the capillary and that there are no air bubbles.\nWait until the agarose solidifies.",
    "Note: The killifish brain mostly fits into a capillary with a 2 mm diameter. If the brains of older animals do not fit into a 2 mm capillary, place the stained brain in a custom capillary with a larger inner diameter (3 mm) or a thin agarose block with a size of 3 mm (w) × 4 mm (l) × 3 mm (h), and affix the agarose block onto the end of a 2 mm capillary using super glue. Another option is to use a 1 mL disposable syringe. This size syringe also fits to the Lightsheet Z.1 microscope.\nCollection of raw image files with ZEN 2014 SP1 and Lightsheet Z.1 Tile Scan.\nPlace the sample chamber onto the microscope and fill the chamber with PBS or mounting and storage buffer.\nNote: The Lightsheet microscope in this protocol is water based so we filled the sample chamber with PBS.\nPlace a capillary tube onto the sample holder and place the brain embedded in agarose in front of the objective lens by pushing the plunger.\nRotate the embedded brain so that the dorsal or ventral part of the brain is facing the objective lens.\nChoose a filter set with the proper excitation and emission.\nCheck the fluorescence intensity and focus.\nExecute a tile imaging experiment covering the whole brain.\nDefine the Z-depth, capturing the region from the cerebellum to the pituitary.\nDefine the corner at the top left.\nDefine the corner at the bottom right.\nSave this corner-defined file as file_name.mlv in ZEN 2014 SP1.\nRead file_name.mlv from Lightssheet Z.1 Tile Scan to create a pseudo tile array (usually with a 10% overlap between tiles) and save this file_name2.mlv.\nIf the brain is too thick, flip the brain vertically and repeat steps from 11c to 11f.",
    "Critical: If you want to examine differences in protein expression between two brains, you must use the same parameters for imaging, including the gain, exposure time, and laser intensity. A few test trials should be done to check the general fluorescence intensity. It is always better to adjust the parameters on a sample with strong fluorescence intensity because when you set the parameters based on a sample with weak fluorescence intensity, the sample with strong fluorescence intensity may be saturated when you image it under the same settings, which prevents further analysis.\nImage processing\nTiming: 2 h to 7 days\nWhole brain comparison\nUsing the Imaris File Converter, convert file_name.czi files generated using the same imaging conditions into Imaris files (file_name.ims).\nRead files in Imaris Sticher, which automatically arrays tiled raw images.\nAdjust the edges of raw images and run stitching.\nCheck the merged image and the individual images using the slide sections.\nAdjust the minimum and maximum intensity, gamma, and opacity in each channel.\nApply the same image display parameters to the other brains, and export images.\nSection comparison\nCrop the regions of interest from whole brain images or from single tile images.\nRead the files in Zen (file_name.czi) or Imaris (file_name.ims) and adjust the image display.\nApply the same parameters for image display and export images."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Cell Biology",
    "Model Organisms",
    "Microscopy"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}