{
  "id": 11935,
  "origin_website": "Jove",
  "title": "Preparation of Human Tissues Embedded in Optimal Cutting Temperature Compound for Mass Spectrometry Analysis",
  "procedures": [
    "De-identified human lung tissues were obtained from the Virginia Commonwealth University (VCU) Tissue and Data Acquisition and Analysis Core under an internal review board (IRB) approved protocol (#HM2471). The use of mice for research and harvesting of mice tissues was approved by the VCU institutional animal care and use committee (IACUC).\n1. Preparation of materials\nNOTE: These steps should be performed a day prior to the tissue washing.\nPre-label and weigh 1.5 mL polypropylene centrifuge tubes with concise but clear identifier codes for each sample that will be processed the next day. Use a chemically resistant permanent marker (see Table of Materials) that will not fade under the repeated tube handling.\nOpen an electronic spreadsheet and label consecutive columns with the following column headers: tube identifier (ID), tube alone, tube w/tissue, and total tissue. Enter the tube identifiers that will be processed into the column labeled tube ID.\nPre-calibrate and zero an analytical scale. Place a clean 10 mL Erlenmeyer flask in the center of the balance plate (the flask will act as a tube holder). Close the weighing chamber door and tare the scale with the flask.\nWeigh 1.5 mL centrifuge tubes. Carefully place the tube in the flask and close the weighing chamber door. Allow the weight to stabilize and record the weight in the column labeled tube alone.\n\tNOTE: Avoid moving the 10 mL Erlenmeyer flask when weighing tubes. If the flask is moved, re-center the flask and re-tare the balance. Place the closed tubes in a rack and store until needed.\nPre-label 13 x 100 mm screw-top glass tubes and caps with the identifier codes and fill them with 2 mL of LC-MS grade methanol. Place them in a tube rack, cap the tubes, and store them in a refrigerator (4 °C) until use.",
    "NOTE: Use a bottle top solvent dispenser (see Table of Materials). If one is not available, use glass pipettes to avoid the use of plastics when dispensing organic solvents.\nPre-label 13 x 100 mm glass test-tubes. Cover and store the test tubes at room temperature.\nPre-label autoinjector vials with identifier codes. Cover and store the autoinjector vials at room temperature until use.\nPrepare tissue-drying wicks.\n\t\nBegin by cleaning surgical scissors by immersing them in LC-MS grade methanol for 5 min, and then wipe them with a clean laboratory grade tissue.\nUsing powder free gloves, twirl the end of a laboratory grade tissue (see Table of Materials) until a finely tapered 30-40 mm wick is formed.\nUsing methanol-cleaned scissors, cut the wick on the thick end. Place wicks in a clean carboard box. Make double the number of wicks than will be needed to process all the samples.\nPrepare shortened 1 mL pipette tips. Using methanol-cleaned surgical scissors, cut 4-5 mm off the tip of a 1 mL pipette tip, and place the tip back in the tip holder. Prepare twice as many tips as samples to be processed.\n\t​NOTE: These will be used in the retrieval of washed tissues from tubes. Do not touch the end of the tip.\nPre-chill molecular biology grade phosphate buffered saline (PBS) to 4 °C (0.5 L is sufficient). This will be used to retrieve specimens. For each sample that will be processed, pre-chill (4 °C) 60 mL of ultra-pure deionized water.\nPrepare mass spectrometry internal standards. Dissolve the following lipids in ethanol:methanol:water (7:2:1; v/v/v) at a concentration of 25 nmol/mL: d17:1-sphingosine, (2S,3R,4E)-2-aminoheptadec-4-ene-1,3-diol; d17:1-sphingosine-1-phosphate, heptadecasphing-4-enine-1-phosphate; C12-Ceramide (d18:1/C12:0), N-(dodecanoyl)-sphing-4-enine; C12-sphingomyelin (d18:1/C12:0), N-(dodecanoyl)-sphing-4-enine-1-phosphocholine; C12-glucosylceramide (d18:1/C12:0), N-(dodecanoyl)-1-β-glucosyl-sphing-4-eine; C12-lactosylceramide (d18:1/C12:0), N-(dodecanoyl)-1-ß-lactosyl-sphing-4-ene.\n2. Tissue washing",
    "NOTE: Completing all steps in section 1 one day prior allows a skilled researcher to process up to 40 samples per day, and novices ~10-15 samples per day. Begin early in the morning and do not stop until all steps in sections 2.1-3.8 are completed.\nOn the day that the tissues will be processed, prepare the biosafety cabinet work area by equipping it with a vortexer, a fully charged serological pipettor, and an ice tray. For all steps in this section, wear appropriate PPE, including a lab coat, a double layer of gloves, and protective eyewear. CAUTION: Human tissues and fluids should be considered and treated as biohazardous materials.\nPre-chill (4 °C) a swinging bucket centrifuge, any adapters needed for holding 15 mL conical centrifuge tubes, and centrifuge biocontainment lids. Pre-chill (4 °C) a fixed angle centrifuge capable of holding 1.5 mL centrifuge tubes.\nIf tissues are not aliquoted into 15 mL polypropylene centrifuge tubes, use a methanol cleaned spatula (clean for each new tissue sample) to transfer them to pre-labeled 15 mL polypropylene tubes. Label the 15 mL caps also.\n\t\nPlace a tube rack capable of holding 15 mL centrifuge tubes in an ice tray and fill the tray with ice. Thaw tissues that will be processed that day by placing them in the rack on ice.\n\t\tNOTE: A minimum of 3-4 mg of tissue should be requested from the biorepository for processing as it has been previously shown that tissue washing and weighing protocols are accurate and reliable at these weights11.\nMove the ice tray with the samples into the biosafety cabinet.\nPerform three sOCTrP cycles11 as discussed below (i.e., perform steps 2.5.1-2.5.5 three times).\n\t\nAdd 10 mL of ice-cold ultra-pure deionized water to each tube and cap them tightly. Allow the tubes to incubate for 10 min.",
    "Vigorously vortex each tube for 10-20 s or until all the tissue deposited on the walls of the tube, or a tissue pellet, is completely resuspended.\n\t\tNOTE: In sOCTrP cycles 2-3, it is critical that the pellet be resuspended so that any OCT in the pellet is diluted into the wash solution.\nTransfer the tubes to the pre-chilled (4 °C) swinging bucket centrifuge. Centrifuge samples at 4,000-5,000 x g for 10 min at 4 °C.\n\t\tNOTE: Avoid the generation of and exposure to biohazardous aerosols generated during centrifugation by sealing the centrifuge carriers with a biocontainment lid (see Table of Materials).\nRetrieve samples from the centrifuge and transfer to the ice tray. Place the tray in a biosafety cabinet and uncap the tubes. Save the caps.\nCarefully aspirate the wash solution. Avoid aspirating the tissue material in the pellet by leaving ~0.5 mL of the supernatant in the tube. Cap the tubes and avoid cross-contamination by matching labeled caps with tubes.\n\t\t​NOTE: The wash solution (the supernatant) in step 2.5.5 is a biohazardous material; handle and dispose of it following biosafety guidelines appropriate for specimens of human origin.\n3. Tissue weighing (for data normalization)\nAfter the last sOCTrP wash cycle, carefully aspirate most of the wash solution but avoid disturbing the pellet. Leave ~0.5 mL of the wash solution in the tube.\nUsing the shortened pipette tips (prepared in step 1.9), take-up 500 µL of ice-cold PBS and add it to the tube.\n\t\nUsing the same tip, gently resuspend the pellet and retrieve all tissue. Avoid turbulent pipetting to decrease tissue loss by its adherence to the tube and pipette tip walls.\nAdd the resuspended tissue to its corresponding pre-labeled and pre-weighed 1.5 mL centrifuge tube and place the tube on ice. Repeat for all tissues in the data set.",
    "Place the 1.5 mL tubes into a pre-chilled centrifuge and pellet the tissues at 7,000 x g for 5-7 min and 4 °C.\n\t\nRetrieve tubes and carefully aspirate as much of the PBS as possible without disturbing the pellet. Place the tube back on ice.\nCentrifuge tubes for an additional 3 min at 7,000 x g to ensure tissues are well pelleted. Transfer the tubes to ice.\n\tNOTE: The additional centrifugation step is important to prevent tissue loss when removing all wash solution and wicking. If processing more than five samples, repeat the 3 min, 7,000 x g centrifugation step after every fifth sample is processed to ensure tissues remain pelleted.\nUsing the wicks prepared in step 1.8, gently remove any remaining wash solution. Use a clean wick for each sample. It is acceptable to gently dab the tissue with the wick, which will help remove most of the wash solution but avoid losing any tissue by adherence to the wick. Close the tube and place it on ice.\nWeigh each tube in the recently calibrated, tared, and zeroed analytical balance.\n\t\nPlace each tube in the glass Erlenmeyer flask and close the chamber door. When the weight has stabilized, record it in the electronic spreadsheet column labeled tube w/tissue.\nAfter weighing, place the tube back on ice.\nAdd 300 µL of ice-cold PBS. Using a shortened pipette tip (step 1.9), carefully retrieve all tissue and deposit in a pre-labeled screw-top glass tube (prepared in step 1.5) containing 2 mL of ice-cold LC-MS grade methanol (add the tissue to the methanol, not to the side of the tube).",
    "Calculate the amount of tissue that was washed by subtracting the tube alone from the tube w/tissue value. Record this number in the total tissue column. The total tissue value will be used to normalize mass spectrometry data in step 6.12.\nStore the samples at -80 °C until ready to perform steps 4.1-4.15.\n\t​NOTE: This is a good stopping point, and the samples can be stored safely for a couple of weeks at -80 °C. For other tissue normalization methods, such as protein concentration or lipid phosphate content, refer to Rohrbach et al.11.\n4. Lipid extraction\nNOTE: It is important to begin these steps in the morning, particularly when many samples will be processed. Before starting, pre-heat a water bath or incubator to 48 °C.\nRetrieve the samples prepared in step 3.8 and the MS lipid standards (prepared in step 1.11) from the freezer. Allow them to equilibrate to room temperature for 20 min.\nVortex and immerse the internal standard solution in an ultrasonic water bath (see Table of Materials) for 2-3 min or until the MS lipid standards are fully dissolved prior to dispensing into samples. This will avoid errors in data normalization.\nUsing a repeating pipette, add 250 pmol (10 µL from the 25 nmol/mL solution prepared in step 1.11) of internal mass spectrometry standards to each tube. Re-cap the tubes lightly.\nTo facilitate homogenization, adjust the methanol volume to 2 mL. Only use LC-MS/MS grade methanol.\nWorking one tube at a time, use a homogenizer to triturate the tissue until no clumps are visible (typically 5-20 s). Move the homogenizer tip in a circular motion and gently press against the tube wall to assist trituration. Re-cap the tube.",
    "NOTE: Ensuring all tissues are finely triturated will maximize lipid extraction. Do not add chloroform to samples prior to homogenization as the disposable homogenizer tips are made of plastic that will dissolve in solutions containing chloroform.\nImmerse the tube at a 45° angle in an ultrasonic water bath for 5-10 s.\n\t\nIf no tissue clumps form upon immersing in the ultrasonic bath, cap it, and move on to the next tube.\nIf tissue clumps form when the tube is immersed in the ultrasonic bath, re-homogenize, and target the clumps.\nRepeat this process (homogenization/immersion in an ultrasonic bath) iteratively until all large tissue clumps are broken-up.\nIn a fume-hood, add LC-MS grade chloroform and methanol to each tube (use a bottle top dispenser) to achieve a ratio of 2:1:0.1 methanol:chloroform:water. Using clean caps, seal the tubes tightly and leave on the benchtop until the end of the day.\n\t\nFor tissues weighing 50 mg or less, use a total extraction volume of 4 mL, and adjust using this ratio (50 mg:4 mL extraction solution) for larger specimens.\nBefore leaving that evening, place the tightly capped tubes in a 48 °C water bath or incubator and incubate them overnight.\n\tNOTE: It is critical that the tubes be tightly capped so that the solvent ratios do not change due to evaporation.\nThe next morning, retrieve the samples from the 48 °C water bath and pellet any solvent-insoluble debris by centrifugation at 4,000-5,000 x g at 4 °C for 20 min.\nWorking in a fume-hood, carefully decant the supernatant into the pre-labeled 13 x 100 mm borosilicate glass test-tubes. Tilt the 13 x 100 mm tube at a 30-45° angle to facilitate decanting.",
    "NOTE: If processing more than 12 samples, do not allow the centrifuged tubes to sit for extended periods of time as the pellets will soften and insoluble debris will be transferred when performing step 4.10. To avoid this, only take 12 tubes out of the centrifuge at a time and continue centrifuging the other tubes until you are ready to decant them.\nTransfer the tubes to a vacuum concentrator capable of holding 13 x 100 mm tubes. Evaporate all solvent with an initial 1 h heating step (40 °C) and run under the maximum vacuum.\nRemove tubes from the vacuum concentrator and add 500 µL of LC-MS grade methanol (use a bottle top dispenser) to each tube.\nResuspend the dried lipid extracts by vortexing for 5-10 s, followed by immersing tubes at a 45° angle in an ultrasonic water bath for 2 min while rotating the tube. Re-vortex for 5 s and immerse in ultrasonic water bath for an additional minute.\n\tNOTE: This is a critical step to ensure the maximal recovery of extracted lipids. Do not move ahead until all the dried material on the wall of the tube has been resuspended.\nPlace the 13 x 100 mm tubes in a pre-chilled (4 °C) centrifuge and remove any insoluble debris by centrifugation at 4,000-5,000 x g at 4 °C for 20-30 min.\nCarefully decant the clarified supernatant into a pre-labeled autoinjector vial. Tilting the autoinjector vial at a 30-45° angle will facilitate decanting. Ensure that the entire contents of the 13 x 100 mm tube are decanted into the autoloader vial.\nCap the tubes tightly and store tubes at -80 °C until analysis by LC-ESI-MS/MS.\n5. LC-ESI-MS/MS analysis",
    "NOTE: The following procedure uses a binary pump system coupled to an autoinjector, degasser, and LC-MS/MS system operating in a triple-quadrupole mode. The column temperature was maintained using a column oven. See Table of Materials for details on the equipment used.\nPrepare mobile phase A1 (CH3OH:H2O:HCOOH, 58:41:1, v:v:v, with 5 mM ammonium formate) and mobile phase B1 (CH3OH:HCOOH, 99:1, v:v, with 5 mM ammonium formate). Use only LC-MS grade solvents, water, and reagents.\nFor each set of samples, prepare four Blank autoloader vials containing 500 µL of LC-MS grade methanol.\nFor each set of samples prepare two Internal Standard (label as IS) autoloader vials by diluting 10 µL (250 pmol total each standard) of the internal standard solution prepared in step 1.11 in 500 µL of LC-MS grade methanol.\nSet the column oven temperature to 60 °C, and the ion source temperature to 500 °C.\nFor the MS/MS analysis, utilize the triple-quadrupole mode of the spectrometer. Set the first quadrupole (Q1) to pass precursor ions, while setting the third quadrupole (Q3) to pass molecularly distinctive product ions (or a scan across multiple m/z in Q1 or Q3) using N2 to collisionally induce dissociations in quadrupole 2 (Q2), which is offset from Q1 by 30-120 eV.\nSet the multiple reaction monitoring pairs (MRM) detection window at 120 s with a target scan time of 1.0 s. Refer to Table 1 for a listing of MRM pairs, ionization energies, and collision energies.\nUse the following parameters to resolve sphingolipids in the LC step: using a flow rate of 0.7 mL/min, equilibrate a 2.1 (i.d) x 50 mm C18 reverse phase column for 0.5 min with a solvent mixture of 95% mobile phase A1 and 5% mobile phase B1.",
    "After sample injection, maintain the mobile phase A1/B1 ratio at 95/5 for 2.25 min, followed by a linear gradient to 100% B1 over 1.5 min, which is then held at 100% B1 for 5.5 min, followed by a 0.5 min gradient return to 95/5 A1/B1.\nAfter the run, re-equilibrate the column with a mixture of 95/5 A1/B1 for 0.5 min.\nUse the following settings for the sample autoloader: rinsing volume, 500 µL; needle stroke, 52 mm (this should be adjusted depending on vial size and volume in each vial); rinsing speed, 35 µL/s; sampling speed, 5.0 µL/s; rinse dip time, 2 s; rinse mode, before and after aspiration; rinse time,2 s.\nPlace samples prepared in step 4.15 onto an autoloader tray in the following order: Blank; IS; Blank; Samples prepared in step 4.15; Blank, IS, Blank.\nAnalyze 5-10 µL of each sample by LC-ESI-MS/MS. Analyze the same volume for all samples in the data set.\n6. Data processing, integration, and normalization\nNOTE: Although the following steps outline a procedure for specific software (see Table of Materials), similar procedures on equivalent LC-MS instruments and software can be used to integrate MRM pairs for the analyzed lipid classes and corresponding internal standards.\nOpen the quantitation software. In the Quantitate tab double click on the Quantitation Wizard. In the pop-up window, in the left-most workspace, navigate to the correct data set and left click on it. The available samples will be shown in the middle workspace.\nHighlight the samples to be analyzed and then click on the right-handed arrow to add samples to the Selected Samples workspace. Click on Next to navigate to the settings and query screen where the default settings are typically used.",
    "Hit Next to navigate to the integration method selection screen. Select an appropriate integration method containing MRM transition pairs for lipids to be analyzed. Refer to the Table 1 for MRM transition pairs. Hit Finish.\n\tNOTE: Retention times will vary depending on instrumentation and individual settings and must therefore be verified for each individual setup.\nIn the navigation bar, click on the Peak Review pane so that MRM pairs can be inspected. To facilitate review, right-click on the Peak Review pane, change the Automatic Zooming to 100% of largest peak, and a Zoom Window of 1.00 - 2.00 minutes.\nRight-click on the Quantitation Display window and select Analyte and the desired sphingolipid to be examined. Verify that there are no peaks in the Blank samples and that the correct peak has been integrated in the IS samples.\nBegin integrating unknown samples. Working one sphingolipid class at a time, inspect the retention time for the MRM pair of the internal standard (i.e., C12:0 ceramide) and ensure that the software has integrated the correct peak.\nContinue onto the analytes in the same lipid class (i.e., C14:0 ceramide, C16:0-ceramide, etc.), beginning with the shortest chain-length lipid in the class. Verify for each chain-length lipid that the software routine has integrated the correct MRM pair peak.\nWhen all the analytes have been integrated, create an electronic spreadsheet for each sphingolipid species analyzed (e.g., ceramides, sphingomyelins, etc.). Label column headers to match the order of the analytes and chain-lengths in the LC-MS/MS quantitation software. Also include a column header for sample ID and sample normalization weights determined in step 3.9.\n\tNOTE: As previously described11, other common normalization measures include total lipid phosphate content or protein amount.\nExport or copy the peak areas for all analytes and internal standards to the electronic spreadsheet.",
    "Normalize data by dividing the integrated peak area of each chain-length species for a given sphingolipid class by the peak area of its corresponding internal standard. For instance, C14:0 ceramide, C16:0 ceramide, C18:1 ceramide, etc., should each be divided by the C12:0 ceramide internal standard peak area.\nConvert peak area to moles of lipid recovered by multiplying the normalized peak area (calculated in step 6.10) with the amount of internal standard, in picomoles, that was added to the sample in step 4.3. In this protocol, this amount is 250 pmol.\nTo obtain the relative amount of lipid in each sample, divide the picomoles of each lipid chain-length by the tissue weight determined in step 3.9. This will give units of picomoles of lipid per mg of tissue.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}