{
  "id": 1788,
  "origin_website": "Cell",
  "title": "Induction of input-specific spine shrinkage on dendrites of rodent hippocampal CA1 neurons using two-photon glutamate uncaging",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSelection of pyramidal neurons\nTiming: 5–15 min\nThe aim of this step is to select healthy CA1 pyramidal neurons with robust EGFP expression and characteristic depth from the slice surface for uniform imaging and uncaging quality.\nInitial screening for EGFP-transfected CA1 neurons using epifluorescence.\nTransfer tissue culture inserts and SCM from six-well plates into 35 mm petri dishes.\nPlace uncovered 35 mm petri dish under the low magnification objective (10×) and screen for EGFP transfected CA1 neurons.\nMark the bottom of the petri dishes to indicate slices that have CA1 neurons with intact long apical dendrites.\nReturn petri dish to the cell culture incubator.\nStart the perfusion system.\nDirectly prior to imaging, dissolve 10 mg of MNI-caged glutamate (Tocris, 1490) by adding aCSF (1 mL) directly to the vial and rock or shake for 2–5 min until powder is completely dissolved. As MNI-glutamate can be uncaged by white fluorescent light, protect as much as possible from light exposure. We find that the stock solution can be frozen once at −20°C without noticeable decrease in efficacy.\nLoad the recirculating perfusion system and imaging chamber with aCSF containing 2.5 mM MNI-caged glutamate and 1 μM TTX. We use 6 mL total volume for our perfusion system. To decrease evaporation, we bubble the carbogen through water prior to bubbling the aCSF bath. In addition, we exchange the bath solution at minimum every 2.5 h.\nTurn on the heating system and set the temperature at 30°C.\nNote: MNI-caged glutamate is light sensitive. Avoid exposure to bright light in the solution preparation room or the imaging room.",
    "When the temperature is stable, take one petri dish from the cell culture incubator. Using a scalpel blade, cut the culture membrane around the hippocampal slice in the form of a rectangle (Figures 3[href=https://www.wicell.org#fig3]A and 3B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1239-Fig3.jpg\nFigure 3. Transfer the hippocampal slices from culture inserts to imaging chamber\n(A) Image of the culture inserted with hippocampal slices. Yellow box indicates the cutting area of the membrane of culture insert.\n(B) Image showing after the membrane is cut on all four sides around one slice using a scalpel blade.\n(C) Lift one corner and grab the membrane with an attached hippocampal slice with the tweezer.\n(D) Put the gold wire on the membrane around the slice to hold in the imaging chamber.\nNote: Be sure to leave extra membrane around the slice to use for stabilizing the slice at the bottom of the imaging chamber (step 5).\nUsing fine tweezers, grab one corner of the membrane containing the hippocampal slice (Figure 3[href=https://www.wicell.org#fig3]C) and place it into the imaging chamber with recirculating aCSF.\nUsing a bent gold wire (Alfa Aesar, 10966) anchor to weigh down membrane and prevent slice movement in the imaging chamber (Figure 3[href=https://www.wicell.org#fig3]D).\nMaintain the temperature of the aCSF within 29°C–31°C.\nLocate EGFP-expressing CA1 pyramidal neurons under low magnification objective lens (10×) and then move to high magnification objective (e.g., Olympus, 60× IR, NA 1.0, WD 2.0 mm).\nUsing two-photon imaging with the 930 nm laser, select healthy EGFP-expressing CA1 pyramidal neurons using the criteria listed below.\nCA1 pyramidal neuron morphology with straight, extended apical dendrite (Figure 4[href=https://www.wicell.org#fig4]A)\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1239-Fig4.jpg\nFigure 4. Selection of EGFP-transfected hippocampal CA1 neurons\n(A) Image of CA1 pyramidal neuron matching the criteria for selection for experiments.",
    "(B) Images of cells that do not match the criteria for selection for experiments. Left: CA1 neuron with apical dendrite cut off during dissection. Open arrow heads mark blebs showing unhealthy basal dendrites. Right: Unhealthy neuron (a) and non-neuronal cell (b) fused.\n(C) Images of dendrites that matched criteria (upper) and do not match criteria (bottom) for selection for experiments. Open arrowhead marks the bleb. Filled arrowhead and arrow mark the filopodium and fuzzy membrane, respectively.\nIntact apical and basal dendrites with clear secondary and tertiary dendrites (Figure 4[href=https://www.wicell.org#fig4]A), as some cells will have dendrites cut off during slice preparation (Figure 4[href=https://www.wicell.org#fig4]B)\nDendritic diameter is smoothly tapered (Figure 4[href=https://www.wicell.org#fig4]C) without blebbing (Figure 4[href=https://www.wicell.org#fig4]B and 4C)\nSelection of dendritic regions of interest (ROIs) for imaging\nTiming: 10–15 min\nThis step describes the guidelines to select dendritic segments and target spines\nSelect secondary or tertiary basal dendrites located 40–80 μm from the soma and 15–45 μm below the slice surface. Others have successfully implemented this protocol at apical dendrites (Albarran et al., 2021[href=https://www.wicell.org#bib12]).\nTo prevent photobleaching and phototoxicity during screening dendrites, use low intensity laser power (∼ 1 mW at the sample) and higher-speed imaging mode (e.g., 256 × 256 pixels, 0.14 μm/pixel, 500 msec/frame).\nCritical: Criteria to select target dendritic segments (Figure 4[href=https://www.wicell.org#fig4]C).\nDendritic segments do not include blebbing and have similar fluorescence intensity and diameter in ROIs.\nDendritic segments include multiple well-isolated spines (> 2 μm) without filopodia and fuzzy membrane.\nThe target dendritic segments include multiple spines which have clearly separated spine heads from the dendrites.",
    "Select dendrites that have typical spine density and contain a well-isolated spine (> 2 μm from neighboring spines) to use for input-specific stimulation. The target spine should be average or modestly larger than average compared to the other spines in the ROI (Figures 5[href=https://www.wicell.org#fig5]A and 5B). Avoid selecting stubby-type spines (Figure 5[href=https://www.wicell.org#fig5]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1239-Fig5.jpg\nFigure 5. Selection of target spine for stimulation\n(A) Histogram of relative spine size of target spines (dark grey, n=108) and neighboring spines (light grey, n=400) from selected dendritic segments (n=93). Data included is both new data and published data from Oh et al. (2013)[href=https://www.wicell.org#bib3].\n(B) The diagram shows how to select a target spine (yellow cross). Select a target spine matched with the criteria, ideally located in the center area of ROI. Spines in categories a and b are suitable target spines, categories c-e should be avoided. a: Spine is well-isolated from neighboring spines (> 2 μm) and average size with neck. b: Spines which are also well-isolated from neighboring spines with average size. c: Well-isolated spines but size is bigger than average. d: Spines are too close to each other (< 2 μm) and are smaller than average. e: Spine with ‘stubby’ morphology.\nNote: A typical dendritic ROI includes one target spine and 3–6 neighboring spines that match criteria for inclusion.\nTime-lapse imaging and induction of spine shrinkage\nTiming: [1–2 h]\nPlace the slice in the recirculating aCSF at least 15 min before imaging and uncaging to equilibrate the slice into the aCSF.\nChoose a low frequency uncaging (LFU) protocol. We have provided two LFU protocols, both in 0 mM Mg2+ aCSF, one with 0.3 mM Ca2+ and the other with 2 mM Ca2+.\nGlutamate uncaging protocol for 0.3 mM Ca2+and 0 mM Mg2+ aCSF",
    "Two-photon uncaging laser set to 720 nm and 6–8 mW at the sample\n90 pulses of 1 ms pulse duration at 0.1 Hz\nGlutamate uncaging protocol for 2 mM Ca2+and 0 mM Mg2+ aCSF\nTwo-photon uncaging laser set to 720 nm and 6–8 mW at the sample\n90 pulses of 0.2 ms pulse duration at 0.1 Hz\nFor imaging, set the laser to 930 nm and 1–1.2 mW at the sample. Take the baseline z-stack of the ROI with 1 μm z-steps at −5 min and 0 min before uncaging. Typically, 5–8 z-steps are sufficient to cover the dendritic segment.\nCritical: If spine fluorescence intensity from −5 min and 0 min baseline images changes by more than 20%, select a different ROI and target spine.\nDeliver glutamate uncaging laser pulses to a target spine by parking the laser beam at a point ∼ 0.5 μm from the spine head in the direction away from the dendrite.\nCritical: Refocus and adjust laser beam parking spots between pulses.\nTake a z-stack of the ROI with 1 μm z-steps every 5 min after uncaging until 40 min.\nNote: Inter-imaging interval and duration of maximum imaging time can be varied depending on experiment purpose. When the imaging interval is decreased, it is recommended to use lower imaging laser power to minimize photobleaching.\nCritical: Because the health of hippocampal slices deteriorates over time after being placed in the imaging chamber, it is typical to change to a new slice after 2–2.5 h and to refresh the recirculating aCSF with TTX and MNI-caged glutamate after 2–3 h. We recommend recording a single target spine per cell and one cell per slice to reduce slice health issues.\nQuantification of spine size\nTiming: [1–2 h]",
    "Draw a box to select a region of interest (ROI) surrounding the stimulated and unstimulated spines on the imaged dendritic segment. Measure integrated fluorescence intensity from the brightest slice in the z stack for each spine at each time point (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1239-Fig6.jpg\nFigure 6. Image analysis\nThe approach for selecting spine and background ROIs for quantification of fluorescence intensities in spines. Red solid box (stimulated target spine) and black solid box (neighboring spines) surround the spine heads in a single Z stack image which is the brightest. Adjacent background is marked by dashed red and black boxes. (a) and (b) are excluded from analysis because (a) spines are too close from next spines (< 2 μm) and (b) spine is not clearly separated from dendrite.\nNote: Choose only spines that are well-separated from the dendrite to avoid contamination from the dendritic signal.\nSelect a background ROI box spanning the same distance from the dendrite as the spine head ROI to ensure an equivalent background signal. Measure the mean fluorescence intensity from these ROIs. Multiply this number by the number of pixels in the spine head ROI and subtract this result from the integrated spine fluorescence to generate background-subtracted spine fluorescence intensity, as described (Woods et al., 2011[href=https://www.wicell.org#bib11]).\nNormalize the background-subtracted spine fluorescence intensity signal over time by dividing the signal at each time point after stimulation with the average background-subtracted spine fluorescence intensity signal from the time points before stimulation. This is the measure that we report as “Estimated Spine Volume” in our papers.\nNote: Spine brightness measurements give an accurate estimate of relative spine volume when compared with electron microscopy (Holtmaat et al., 2005[href=https://www.wicell.org#bib1]).",
    "Relative spine size (Figure 5[href=https://www.wicell.org#fig5]A) was calculated using the background-subtracted, integrated fluorescence intensity (average of the −5 and 0 time points) of an individual spine and dividing that by the average background-subtracted, integrated fluorescence intensity (average of the −5 and 0 time points) of all measurable neighboring spines on the same dendritic ROI."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience",
    "Microscopy"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}