{
  "id": 10997,
  "origin_website": "Jove",
  "title": "Glutamine Flux Imaging Using Genetically Encoded Sensors",
  "procedures": [
    "1. Sample Preparation\nNote: In many cases perfusion experiments wash away a significant portion of cells, which can become a frustrating issue. Although not necessary for all cell lines, coating cover glass surfaces with poly-L-Lysine (add 1.0 ml/25 cm2 of 0.01% solution to the surface, incubate >5 min, wash twice with cell culture grade water, and dry in the biosafety cabinet) enhances cell adhesion. Also, be aware of the biosafety level (BSL) of the cell line used, and follow the standard operating procedure approved by the local environmental health and safety office. In this experiment, cos7 cells were used due to low endogenous glutamine transport activity (see Figure 4).\nSeed cos7 cells at ~70-80% confluency in Dulbecco’s Modified Eagle Medium (DMEM) + 10% cosmic calf serum and 100 U/ml penicillin/streptomycin, either on sterile 25 mm glass coverslips placed in the 6-well culture dish or 8-well glass-bottom slides. Incubate at 37 °C, 5% CO2, 100% humidity for 24 hr.\nExchange the growth medium to DMEM +10% cosmic calf serum (no antibiotics), according to the manufacturer’s protocol. Grow O/N at 37 °C, 5% CO2 at 100% humidity.\nAdd 0.4 mg each of plasmid DNA encoding the glutamine sensor (pcDNA3.1, carrying FLIPQTV3.0 sensor under CMV promoter 10) and the mCherry-tagged ASCT2 10 to 50 ml serum-free media (OPTI-MEM) and mix gently.\nAdd 1 ml of transfection reagent to 50 ml serum-free media. Incubate at RT for 5 min.\nMix the two solutions containing DNA (step 1.3) and transfection reagent (step 1.4) and incubate for 20 min.\nGently add the transfection reagent on top of the cells and mix gently by rocking the chamber. Incubate for 24 hr at 37 °C, 5% CO2, 100% humidity.\nAfter 24 hr, exchange the medium to DMEM + 10% Cosmic Calf Serum (CCS) + 100 unit of penicillin/streptomycin.",
    "Cells are imaged 48-72 hr post-transfection.\n2. Perfusion Experiment\nNote: For cos7 cells used in this experiment, perfusion media and chamber were kept at RT and ambient CO2 concentration. However, if the cells being used require higher temperature and CO2 concentration control for survival, heated microscope stage and/or an environmental chamber should be used.\nPrepare perfusion buffer A-F (See List of Materials). Attach stopcocks to 50 ml syringes, close the stopcocks then fill them with the perfusion solutions. Open the stopcock for a brief period to fill the head space in the stopcock with the buffer.\nSwitch on the 8-channel, gravity-feed perfusion system with a perfusion pencil, and then select “Manual Mode” under Select Function option. Place a waste container under the perfusion pencil.\nManually activate the ports by pressing the corresponding numbers and fill the tubings using 10 ml syringe containing water, and then close the port. Once the ports are filled with water, set the syringes containing buffers A-F on the port 1-6 of perfusion system, and then open the stopcocks. Open the ports again to replace the water in the tubing with the buffers. The flow rate should be around 0.8 ml/min.\nPress cancel once on the perfusion controller to go back to the “Select Function” menu. Toggle to “Edit Program” option, then type in the perfusion protocol indicated in Table 1. Save the perfusion program.\nTake the cells out of the incubator. Wash twice with the perfusion buffer, and then set the cells on the stage. Connect the perfusion system to the chamber. If an open chamber is used, set up another pump that removes the perfusion solution from the chamber.\nOpen Slidebook software. Start a new slide.",
    "Note: The following procedure is specific to Slidebook software, but other software such as MetaFluor and Nis-Element can also be used for the type of imaging described here. Theoretically experiments can be performed using any software that allows time-course imaging, and the image sequences can be analyzed post-experimentally using software such as ImageJ (http://rsbweb.nih.gov/ij/) or Fiji (http://fiji.sc/Fiji). However, software that allows real-time monitoring of acceptor/donor ratio is highly useful.\nMount the slide onto the fluorescent microscope stage. Find the cells co-expressing the sensor and ASCT-mCherry using appropriate filter sets (see List of Materials) under “FOCUS” function. Adjust gain by clicking “Camera” tab and sliding the slide bar under “gain”. Also, adjust the neutral density filter setting from neutral density filter drop-down menu. Note: If the filter cube does not include an eye filter, do not use the eye pieces since short-wavelength excitation light is harmful to eyes. Use the computer screen to find the cells instead.",
    "Acquire images of cells with donor (mTFP1)exdonor(mTFP1)em , donor(mTFP1)exacceptor(venus)em and acceptor(mTFP1)exacceptor(venus)em m channels (filters are specified in the List of Materials). Click “Image Capture”, and then in the acquisition window, specify the filters that are going to be used. Click “TEST” button to adjust the exposure time by typing the desired exposure time in the box next to the filter settings. Note: All three channels need to be exposed for the same length. When adjusting the imaging parameters, take the expected FRET efficiency change and fold increase into account: for example, if the FRET efficiency is expected to go up 2-fold during the experiment, imaging parameters should be adjusted so that the intensity of DonorexAcceptorem at the resting state should be <50% of the maximal value that can be recorded by the instrument, so that channel does not become saturated during the experiment. Signal from the labeled cells should be at least three-times higher than that in the background region.\nDraw a region of interest using regions tool in the software. Alternatively, a software function to select pixels above certain intensity can be used, and then converted into regions. To do this, click Mask – Segment, then move the sliding bar to highlight the desired areas.\nSelect “time lapse” in the capture type box, then specify the interval (10 sec in this experiment) and time points for the experiment.",
    "Draw a region in an area without any fluorescent cells. This area is used for background subtraction. Right click the region drawn, and then set it as a background. Note: Ideally, cells that are not expressing the sensors should be used as the background region to account for both the autofluorescence and the background florescence detected by the camera. If no such cells are available in the field of view, at least a region without the cells should be used to account for the background fluorescence.\nSelect the desired program under “Select Function - Run programs” option. Toggle to the saved program (see step 2.3), and then hit ENTER on the perfusion controller. Now the program is loaded, and hitting any key will start the perfusion.\nEnsure perfusion and the imaging experiment start at the same time by clicking “Start” button in the capture window at the same time as pressing a key on the perfusion controller.\n\tNote: It is recommended to record the timepoint where the solutions were exchanged (this can be done using “NOTES” function, found within the acquisition tab).\nPerform the same perfusion protocol using cells expressing a sensor that is expected to be either saturated or unbound under the experimental condition.\n\tNote: Here, FLIPQTV3.0_1.5μ, which is saturated under the experimental condition, is used as a control, Figure 6. Such control experiments are necessary to confirm that the FRET efficiency change is due to the actual change in the substrate and not due to the change in other parameters such as cellular pH.\n3. Post-experiment Analysis",
    "Examine if sample drift has occurred during the experiment. Draw Regions Of Interest (ROI)s on the image taken at timepoint 0, then move the sliding bar at the top of the imaging window and check if the cells fall out of the ROIs in images taken later in the experiment.\nIf yes, then use the tracking function to correct for the drift by first, creating masks around the cells by selecting Mask – Segment, then slide the line that specifies the cutoff to highlight the regions containing cells. Track the regions by clicking Mask – Particle tracking – Basic particle tracking.\nRe-draw the ROIs and background region when necessary.\nExport the mean intensity of the ROIs over the course of experiment. Click Statistics – Export – Ratio/timelapse data.\nWhen FRET efficiency and quantification of substrate concentration is not necessary, plot the time course of the intensity ratio (DonorexAcceptorem, / DonorexDonorem) as a proxy of the dynamics of the substrate. To determine the cytosolic concentration, calculate the maximal and minimal ratio change (i.e., at the saturating and absence of the substrate, respectively), Δrmax - Δrmin, by non-linear regression of Δratio (Δr) with the following equation:\nΔr = [S]/(Kd+[S]) x (Δrmax - Δrmin) + Δrmin\n\twhere [S] is the substrate concentration in the cytosol. Using the Δrmax - Δrmin values obtained, saturation (S) of the sensor at a given Δr is calculated as\n\tS = (Δr - Δrmin) / (Δrmax - Δrmin)\n\tS can further be converted into the substrate concentration [S] using the following equation:\n\tS = [S]/(Kd+[S])\n\tNote: the intensity of AcceptorexAcceptorem channel should be also plotted to examine whether the experimental condition influenced the fluorescence of the acceptor directly.",
    "When a baseline drift due to photo-bleaching is observed, perform a baseline correction. To do this, plot the intensities of donor and acceptor over time (Figure 5A). Then identify the timepoints used for the baseline, according to the delay in the perfusion system and the transport activity of the particular cell (Figure 5B).\nCalculate a polynominal fitting that best describes the baseline. Then, normalize the raw intensity from each timepoint to the baseline (Figure 5C). Calculate the intensity ratio (DonorexAcceptorem, / DonorexDonorem) from the normalized donor and acceptor intensities.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}