{
  "id": 19574,
  "origin_website": "Jove",
  "title": "Intracerebral Transplantation and In Vivo Bioluminescence Tracking of Human Neural Progenitor Cells in the Mouse Brain",
  "procedures": [
    "NOTE: All experiments involving mice were conducted in accordance with governmental, institutional, and ARRIVE guidelines and were approved by the Cantonal Veterinary Office of Zurich. Adult male and female non-obese diabetic SCID gamma (NSG) mice (10-14 weeks, 25-35 g) were used. Mice were housed in regular Type II/III cages in groups of at least two animals per cage in a humidity- and temperature-controlled room with a constant 12/12 h light/dark cycle. .).\n1. Cell culture and viral transduction\nDifferentiate neural progenitor cells (NPCs) from iPSCs using small molecule inhibitors as previously described14.\nCulture NPCs15 from passage 2 onwards in Neural Stem cell Maintenance Medium (NSMM; Table 1) supplemented with small molecules (Table 1) in 6-well plates (2 mL of medium per well) coated with poly-ornithine/laminin521 (pLO/L521). Change the medium daily.\n\tNOTE: To passage NPCs, add 1 mL of cell dissociation reagent per well (see the Table of Materials) and incubate at 37 °C for 1 min until most cells detach.\n\t\nFor coating, incubate 150 µL of pLO in 1 mL of 0.1 M phosphate-buffered saline (PBS) per well for 2h at room temperature (RT). After three washes with PBS, incubate 10 µg of L521 in 1 mL of PBS per well for 2 h at RT.\nFor viral transduction, plate 50,000 cells per well in a 24-well plate coated with pLO/L521 and add prepackaged viral vectors (pLL-EF1a-rFLuc-T2A-GFP-mPGK-Puro, LL410PA-1) to each well.\n\tNOTE: Total infectious units (IFU) provided are >2 × 106 IFU and are enough to infect 100,000 cells at a multiplicity of infection (MOI) of 20. Cell counting has been performed with an automated cell counter. The transduction efficiency strongly depends on the used cell line. Work with lentivirus requires compliance with the local guidelines for biosafety level 2 (BSL-2) products.",
    "Incubate the cells at 37 °C for 72 h, while continuing daily medium changes.\nConfirm successful transduction by checking the cells for GFP expression in a fluorescence microscope. Set the microscope magnification to 10x or 20x and use the appropriate excitation (460-480 nm) and emission range (490-520 nm) to detect transduced GFP-expressing cells.\nQuantify the ratio of GFP-transduced to total cells to estimate general transduction efficacy.\n\tNOTE: Transduction rates of 65-95% were achieved with this protocol. A transduction efficacy of >50% is recommended as a go/no-go criterion before transplantation. If 50% transduction efficacy cannot be achieved, perform puromycin selection or sort the cells using flow cytometry to increase the yield of transduced cells.\nOptional: Freezing of cells\n\t\nSpin the cells down (300 × g, 5 min) and discard the supernatant. Resuspend the pellet in 1 mL of freezing medium (see the Table of Materials) and transfer the suspension into vials to obtain 106 cells/vial. Transfer the cells to freezing boxes for 24 h at -80 °C and then to -150 °C for long-term storage.\n2. Cell preparation for transplantation\nCollect a vial of cells from -150 °C storage and transfer it to the laboratory. Count the cells using an automated cell counter.\n\tNOTE: The vial contains 1.5-2 × 106 cells.\nQuickly transfer the vial to a 37 °C water bath until no ice crystals remain (2-3 min).\n\tNOTE: It is important to thaw rapidly to minimize any damage to cell membranes. Do not immerse the vial completely in the water bath as it can increase the risk of contamination.\nTransfer the vial to the biosafety cabinet and pipette the whole content (~1 mL) into a sterile 15 mL conical tube.",
    "NOTE: Work with lentivirally transduced cells requires BSL-2. However, washing and passaging cells remove viral particles from the medium. Information about when a transfer from BSL-2 to BSL-1 is permitted should be obtained from the local authorities.\nAdd 9 mL of sterile 1x PBS and centrifuge for 5 min at 300 × g, RT.\nRemove the supernatant by aspiration using a pipette (1-10 mL); gently tilt the suspension towards the pipette tip and start aspirating. Be careful not to disturb the pellet.\nWash the cells by resuspending in 10 mL of sterile 1x PBS.\n\tNOTE: Gently tab the tube to resuspend cells in the residual volume. Slowly triturate the cell suspension using a 1 mL pipette until it does not contain clumps or aggregates.\nCount the cells before the final spin using an automated cell counter.\nCentrifuge for 5 min at 300 × g, RT.\nRemove the supernatant (step 2.5) and resuspend the cell pellet in the required volume of sterile PBS to a concentration of 8 × 104 cells/µL. Place the cells on ice and use them for transplantation within the next 5h.\n\t​NOTE: A volume of 1.6 × 105 cells/2 µL of PBS was used in this protocol.\n3. Transplantation procedure\nPreparation for surgery\n\t\nClean and sterilize the surgery equipment.\nPrepare the stereotaxic device and the microinjection pump system.\n\t\tNOTE: It is critical to test the Hamilton syringe and the 30 G, 2 inches needle before starting. Insert the needle into a tube containing sterile 0.9% NaCl and slowly draw the solution in and out.\nSet up the anesthesia machine. Test the machine before involving any animals. Clean the induction chamber with 70% ethanol.\nPreparation of animals\n\t\nKeep the mice for at least 7 days prior to the experiments in standard conditions to acclimate them.",
    "NOTE: The following animals were used for this protocol: female NOD/SCID/IL2rγnull (30-35 g, also known as NSG) and female C57BL/6J (20-25 g, also known as B6). The procedure can also be performed with male mice.\nMeasure the mouse body weight and adjust the dose of the pain killer to be injected. Administer carprofen (5 mg/kg body weight) intraperitoneally to reduce pain and/or prevent an inflammatory response.\nAnesthetize the animals using isoflurane (3% in the induction phase and 1.5-2% in the maintenance phase during surgery) vaporized in oxygen.\n\t\tNOTE: Gaseous anesthesia is preferred due to a quick wake-up after the surgical procedure and because the levels of anesthetic gas can be easily adjusted.\nUse nociceptive reflexes to ensure the animal is deeply anesthetized (e.g., toe pinches). When deep anesthesia is reached, transport the animal from the induction chamber to the stereotaxic frame. Maintain anesthesia using a face mask.\n\t\tNOTE: The breath rate needs to be monitored visually throughout the procedure (40-60 breaths per minute). Use a warming pad to avoid hypothermia during the procedure.\nApply ophthalmic lubricant to prevent the eyes from drying out.\nShave the mouse scalp with an electric razor and disinfect the skin with 5% betadine solution using cotton swabs.\nSecure the mouse head and insert the ear bars into the external meatus.\n\t\tNOTE: Be careful not to damage the eardrums. Apply lidocaine ointment to both ear canals before inserting the ear bars. To check if the animal's head is in a stable position, carefully push down on the head to see if there is movement. If movement is noted, either the ear bar, nosepiece placement, or both are incorrect and need to be readjusted.\nCraniotomy\n\t\nUse a surgical blade to make a cut along the midline big enough to reveal the lambda and bregma landmarks.",
    "NOTE: Skin retractors can be applied to keep the skull exposed.\nRetract the periosteum and fascia with a scalpel and use sterile cotton swabs to dry the skull surface.\nAdjust the ear and mouth bars to standardize the head position.\n\t\tNOTE: The vertical coordinates for bregma and lambda need to be identical for anteroposterior positioning.\nPlace the needle at the bregma and calculate the coordinates of the desired injection points (the coordinates of interest chosen for this protocol: anterior-posterior (AP): + 0.5 mm, medial-lateral (ML): + 1.5 mm). Move the needle to that point and mark it with ink.\n\t\tNOTE: The coordinates were chosen based on the Franklin and Paxinos Mouse Brain Atlas 16. Distances are mm from the bregma.\nApply sterile 0.9% NaCl to the skull and drill a hole with a diameter of 2-3 mm through the skull with a surgical, dental drill.\nMove the needle to the surface of the dura and calculate the depth coordinates.\nTransplantation procedure\n\t\nResuspend the cells in the tube (step 2.9) and draw 2 µL of cell suspension into a syringe (5 µL or 10 µL).\n\t\tNOTE: Make sure that no air bubbles are present in the cell suspension. The syringe needs to be kept in a horizontal position until mounted into the stereotactic device to avoid cell sedimentation.\nPlace the syringe above the target site (calculated coordinates: AP: + 0.5 mm, ML: + 1.5 mm) and slowly move the needle to the surface of the dura.\n\t\tNOTE: If unsure about the correct coordinates, perform injections with a dye and histological evaluation of the injection site before transplanting cells (for more details, see 17).",
    "Guide the needle at a rate of 0.02 mm/s into the brain up to the proper depth (the coordinate chosen for this protocol is dorsal-ventral (DV) - 0.8 mm). Overshoot the depth by 0.1 mm and withdraw the needle over the same distance to create a pocket for the injected cells.\nApply tissue adhesive around the needle using forceps to prevent leakage of cells.\nInject 2 µL of the prepared cell suspension at a constant rate of 3-5 nL/s.\n\t\tNOTE: The injection procedure will last between 7 and 12 min.\nFollowing injection, leave the needle in place for at least 5 min before slowly withdrawing it. Apply tissue adhesive to seal the hole in the skull and wait for another 2 min.\nSutures and post-care\nApply sterile 0.9% NaCl solution to the exposed skull to avoid dehydration.\nClose up the wound with a 5/0 silk suture thread.\nHydrate the animal with 0.5 mL of ringer lactate solution subcutaneously injected in the lower back.\nInterrupt anesthesia delivery and carefully remove the mouse from the stereotaxic apparatus and place it back in a cage kept on a heating pad.\nMonitor the animals during the acute phase postinjury. Check the suture, the animal weight, and overall health at least twice a day.\n4. In vivo imaging\nPreparation of luciferin\n\t\nThaw D-luciferin potassium salt at RT and prepare a fresh stock solution of D-luciferin at 30 mg/mL in PBS.\nSterilize the stock solution through a 0.22 µm syringe filter.\n\t\tNOTE: Immediate use of the working solution is recommended. If necessary, dissolved luciferin can be stored at -20 °C. However, prolonged storage may result in the degradation of signal. Luciferin is a light-sensitive reagent; keep it out of direct light whenever possible. Alternative substrates may also be considered, e.g., cycluc, to improve the resolution limit18.",
    "Imaging\n\t\nInitial setup\n\t\tNOTE: Bioluminescence imaging was performed using an in vivo imaging system (see the Table of Materials) consisting of a dark chamber and a cooled charge-coupled device (CCD) camera.\n\t\t\nDouble-click the Living Image software icon and select a user ID from the drop-down list.\nClick Initialize in the control panel that appears. Once the initialization process is completed, the temperature box in the control panel will turn green.\nIn the control panel, check the Luminescent and Photograph boxes and select Auto exposure (~60 s). Select a field of view (D/12.5cm was chosen for this protocol). Enter the subject height (1.5 cm) and select the use subject height focus option. Manually set the following parameters: large binning, f/2, blocked excitation filter, and open emission filter.\nDetermine the injection amount of D-luciferin at 300 mg/kg body weight.NOTE: The standard recommended dose is 150 mg/kg of D-luciferin. This procedure was adjusted according to a protocol reporting higher sensitivity using 300 mg/kg18.\nInject the luciferin intraperitoneally (i.p.).\n\t\t​NOTE: If the animal needs to be sedated before injection, be aware that it may extend the peak luciferase expression time.\nWait for 5 min, then anesthetize animals with a continuous supply of isoflurane (4.5% in the induction phase and 1.5-2% in the maintenance phase during imaging procedure).\nApply ophthalmic lubricant to the eyes, then shave the sedated animals on the head region using a conventional hair shaver. Place the animals in the imaging chamber and start imaging 15 min after the luciferin injection by clicking Acquire in the control panel.\n5. Perfusion\nAnesthetize the animals by an i.p. injection of sodium pentobarbital (150 mg/kg body weight). Wait until the mouse no longer responds to painful stimuli, such as toe pinches.",
    "Lay the mouse on its back and use tweezers and scissors to open the chest cavity.\nUse standard scissors to open the diaphragm.\nExpose the heart and insert a needle (from the tubing with ringer/4% paraformaldehyde solution (PFA)) into the apex of the left ventricle.\n\tNOTE: Be careful to keep the tip of the needle in the lumen of the ventricle.\nCut the right ventricle using scissors.\nPerfuse with ringer solution (can be kept at RT) for 3-4 min (flow rate: 17 mL/min). Continue until the heart is clean.\nSwitch the stopcock to allow for the flow of PFA (store at 4 °C; keep on ice during the procedure) and perfuse for another 5 min (~100 mL).\nStop the pump and remove the needle from the left ventricle.\n\t​NOTE: The perfusion with PFA preserves tissue integrity uniformly. It also facilitates the preservation of GFP signal in the transplants that otherwise may be lost due to diffusion.\n6. Processing\nTissue collection\n\t\nRemove the head using standard scissors and make a midline incision in the skin.\nTurn the skin over the eyes to expose the skull.\nStart from the caudal part at the point of the parietal bone and make a small incision using spring scissors. Advance the scissors rostrally along the midsagittal suture up to a point between the eyes. Start again from the caudal part and make two cuts parallel and ~4 mm apart in the sagittal plane.\n\t\tNOTE: Be careful not to damage the brain by pressing the scissors against the interior surface of the skull.\nUse forceps to carefully tilt one side of the parietal bone and break it off. Do the same with the other side.",
    "NOTE: Use a microspatula to free the bone from the meninges; otherwise, they may damage the brain while breaking off the skull. If parts of the frontal bone remain, make a small cut to tilt and break off the bone plate.\nTo release the brain, carefully slide the microspatula under the brain (olfactory bulbs) and tilt it gently upward.\nAfter collecting, keep the brain in 4% PFA solution for 4-6 h at 4 °C. Transfer it to sterile 1x PBS afterward.\nImmunohistochemistry\n\t\nTransfer the brain to a 30% sucrose solution for at least 48 h at 4 °C to prevent the formation of crystals during freezing.\nUse a sliding microtome to cut coronal sections with a thickness of 40 µm. Collect and store the sections as free-floating sections (in a 24-well-plate) in a cryoprotectant solution (Table 1) at -20 °C until further processing.\nRinse the sections with 450 µL of 1x PBS for each well (3 times, 5 min each, RT).\nBlock non-specific sites with 450 µL of blocking solution for each well (Table 1) for 1 h at RT.\nIncubate each well with 450 µL of primary antibodies at 4 °C overnight. Dilute the antibodies 1:200 in 3% donkey serum; 0.1% Triton-X-100 in PBS. To identify donor material in the host environment, use an antibody to human-specific nuclei (Anti-Human Nuclei Antibody, clone 235-1).\nWash the sections with 450 µL of 1x PBS for each well (3 times, 5 min each, RT).\nIncubate each well with 450 µL of corresponding fluorescent secondary antibodies for 2-3 h (RT). Dilute the antibodies in 3% donkey serum; 0.1% Triton-X-100 in 1x PBS.\nWash the sections with 450 µL of 1x PBS for each well (3 times, 5 min each, RT).\nStain the nuclei with 450 µL of 0.1 µg/mL 4',6-diamidino-2-phenylindole (DAPI)."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}