{
  "id": 17321,
  "origin_website": "Jove",
  "title": "Lung Rapid Recovery Procurement Combined with Abdominal Normothermic Regional Perfusion in Controlled Donation after Circulatory Death",
  "procedures": [
    "These interventions are undertaken at the bedside in the intensive care unit (ICU). This protocol follows the guidelines of the University Hospital Marqués de Valdecilla ethics committee and is in accordance with the Spanish legal framework regarding donation procedures. Informed consent was obtained from next of kin for video recording of the procedures for research. cDCD is considered in patients with catastrophic brain damage or a terminal heart or a neurodegenerative disease for whom the decision to withdraw life-sustaining therapy (WSLT) has been made. Exclusion criteria and lung evaluation are the same as with brain death donors (Table 1).\n1. Premortem interventions in the donor\nHeparinization: administer intravenously a bolus of 300-500 UI/kg of heparin to the donor.\nCannulation\n\tNOTE: Cannulation is performed by the cardiovascular surgeon and is a sterile procedure.\n\t\nPrepare a sterile instrumentation table, with all the equipment necessary (ECMO kit and surgical tools), as well as the electrocautery and suction system.\nPrepare a surgical field on the selected groin with disinfectant solution and sterile drapes.\nMake an 8-10 cm longitudinal incision with a no. 23 blade, controlling bleeding with electrocautery and Liga clips. Separate the wound edges with a retractor and proceed with dissection to expose the femoral artery and vein. Embrace both vessels with vessel loops for bleeding control.\nSelect the appropriate cannula diameters according to the vessel sizes and large enough to provide a sufficient flow for organ perfusion and to prevent low-flow problems (usually 21 French).\nCannulate the femoral vein, introducing first a metal wire as a guide, followed by progressive dilators to finally introduce the cannula. If bleeding is observed, perform a peri cannula 4-0 polypropylene purse string suture for control.\nProceed in the same way with the femoral artery, using in this case a double lumen cannula.",
    "Cut off a 10 cm piece of the ECMO input line. Insert a straight connector with a Luer lock with a three-way stopcock assembled at one end of the piece and connect the other end of the piece to the arterial cannula (Figure 1).\nPurge the ECMO lines. Employ an irrigation pear with saline to fill the lines while connecting with cannulas. Connect the output ECMO line to the venous cannula and the input ECMO line to the straight connector with the three-way stopcock previously assembled to the arterial cannula. The three-way stopcock can be used for purging the system (Figure 2).\nKeep the ECMO lines clamped. Fix both cannulas to the groin with size 1 silk sutures to avoid displacement during transfer.\nPlace a monitored pressure line in the femoral artery cannula and in donor's left radial artery.\nAortic occlusion balloon placement\n\t\nTake, as a reference, the distance between the xiphoid process of the donor and the distal end of the arterial cannula and determine the length of the catheter to be inserted to reach the thoracic descending aorta. Set a reference mark in the balloon with a silk suture or a marker.\nIntroduce a metal wire guide through the free lumen of the femoral artery cannula. Continue with the catheter in the same way, guided by the metal wire, and introduce it until the referenced mark.\nConfirm the correct position of the occlusion balloon with portable chest radiography or fluoroscopy (check radiopaque marks of the catheter above the diaphragm).\nCheck the correct function of the occlusion balloon by filling it with a 50 cc cone syringe with saline just for 4-5 s, confirming that arterial pressure from the femoral cannula disappears while the pressure from the left radial artery is maintained (Figure 3).",
    "When the femoral pulse disappears, record the filling volume as the minimum volume to be used to block the thoracic aorta during ARNP. If flow is detected in the femoral cannula, check again for correct positioning or filling.\n2. Withdrawal of life-sustaining therapy (WLST) and declaration of death\nTransfer the donor connected to the ECMO system to the operation room. Prepare and drape the donor in a sterile fashion.\nHave the lung and abdominal preservation solutions and lines set and ready. Keep the surgical team scrubbed and sterile and ready in the adjacent operating room.\nUse a chronometer to register warm ischemic times.\n\tNOTE: Functional warm ischemic time (FWIT), defined as the time from systolic blood pressure <60 mmHg to ANRP is started for abdominal grafts and the administration of lung preservation solution through the pulmonary artery for lungs (5 min no-touch period is included). Upper limits of 30 min for the liver and pancreas and 60 min for the kidneys and lungs are considered.\nAllow relatives to be with their loved one during WLST until the declaration of death.\nInitiate WLST. Extubating is optional according to the relative's wishes. After the declaration of death, lead the relatives out from the surgical area.\nAfter the 5 min non-touch period, fill the aortic occlusion balloon with the previously determined minimum volume that ensures descending thoracic aortic block.\nIf pressure from the left radial artery disappears, initiate ANRP. The pressure from the femoral cannula will turn into a continuous non-pulsatile flow provided by the ECMO.\nIf flow in the radial line increases parallel to femoral pressure, stop ANRP and check the correct position and filling or clamp the thoracic aorta after another 5 min non-touch period before restoring ANRP. ANRP is not started until aortic occlusion is fully confirmed.",
    "​NOTE: WLST can be performed in the operation room or in the ICU following the preference of relatives and loved ones. If it is performed in the ICU, after the 5 min no-touch period, the balloon is filled and function checked, ARNP is initiated, and the donor is transferred to the operation room where the surgical team is ready to start. If occlusion balloon malfunction is detected, ARNP is stopped until the thoracic aorta is clamped in the operation room.\n3. Lung recovery and procurement technique\nNOTE: Lung recovery and procurement techniques are performed by the thoracic surgeon and the transplant coordinator (Figure 4).\nPerform a medium sternotomy: proceed with a median vertical skin incision from the suprasternal notch to the tip of the xiphoid process. Extend the incision to the pectoral fascia and sternal periosteum using electrocautery.\nDivide the interclavicular ligament and create a plane by finger dissection behind the sternum, both at the level of the suprasternal notch and the xiphoid process. Divide the sternum with an electric saw. Place a sternal retractor and open carefully, releasing the pericardium from the posterior surface of the sternum. Control any bleeding point with electrocautery.\nAt the same time, reintubate and ventilate the donor with 100% oxygen and a positive end-expiratory pressure of 5 cm H2O.\nIf bronchoscopy was not performed during the donor's ICU stay as a critical patient management maneuver, it can be performed at this point by the second surgeon of the thoracic team. For the bronchoscopy, introduce a flexible bronchoscope through the endotracheal tube and evaluate the anatomy, mucosal appearance, and clear secretions.\nOpen both the pleural cavities by longitudinal incisions in the mediastinal pleura.",
    "If there are doubts or problems about an adequate block of the supra-aortic vessels with the occlusion balloon, retract the left lung medially to expose and clamp the thoracic aorta as low as possible under direct vision.\nExamine the lungs performing visual and palpatory assessment. Inspect for bullae, contusion, atelectasis, pneumonia, and occult tumors. Deliver 1 L of 4 °C saline in both pleural cavities.\nReduce the inspired fraction of oxygen to 50%. Open the pericardium with an inverted T incision. Retract laterally the edges of the pericardium with 2-0 silk sutures fixed to the skin with mosquito forceps to expose the heart structures.\nPlace a 4-0 polypropylene purse string suture on the main pulmonary artery below the bifurcation. Perform an arteriotomy with a no. 11 blade and dilate with curved mosquito forceps.\nCannulate the pulmonary artery (PA) with a right-angled straight cannula clamped at the end. Connect the pulmonary artery cannula to the irrigation system line, assembling a straight connector with a Luer lock and a three-way stopcock. Connect the irrigation system to the lung preservation solution. Purge the lines.\nStart flushing 50-60 mL/kg of cold preservation solution in an antegrade fashion. Start flushing 500 µg of prostaglandin diluted in 100 mL of saline at the same time through the three-way stopcock.\nOpen the left atrial appendage or left atrium directly to allow free drainage. If areas of atelectasis are found, recruit them with short inspiratory holds at 25-30 cm H2O pressure.\nOnce preservation is finished, remove the PA cannula. Announce to the rest of the team the intention to clamp the cava vein and start heart excision.",
    "Administer 1-1.2 L of saline solution to the donor before clamping the cava veins to avoid a decrease in pump flow due to the loss of blood venous return from the thorax.\nPlace a cross-clamp in the inferior cava vein, making sure there is enough stump for the liver. Ligate and divide the inferior cava vein with no. 3 silk strand.\nTie and divide the superior cava vein caudal to azygous with no. 3 silk strand. Secure the distal stump with a clamp.\nLeave the clamps remaining in the surgical field, being careful not to remove them by accident, as otherwise ANRP will be compromised. Excise the rest of the heart in a standard fashion.\nAfter heart excision, remove the lungs following the same procedure as with brain death donors, as described below.\n\t\nDivide the inferior pulmonary ligaments, open the posterior pericardium, and expose the esophagus. Free the posterior mediastinal attachments of the lung with blunt dissection, ensuring cautious hemostasis.\nDissect the pulmonary arteries away from the aorta. Isolate the trachea above the carina and pass a TA stapler around.\nInflate the lungs to 50%-60% of tidal volume before withdrawing the endotracheal tube and divide the trachea. Remove any remaining attachment and extract the lung block from the donor.\nCarefully check the thoracic cavity to detect any bleeding point, especially ligation of the azygos vein and cauterization of the vessels or capillaries from the posterior mediastinum, paratracheal structures, and surrounding tissues. Continuous blood loss may decrease the pump flow.\nTake the lung block to the back table and proceed with bench surgery. Separate the left and right lungs.\nWith a Foley catheter with an inflated bulb at the tip, perform sequentially, through each pulmonary vein, a retrograde flush with 0.2-0.25 L of cold preservation solution.",
    "Pack each lung into a first sterile bag containing cold preservation solution only, surrounded by two other plastic bags, and store in a portable fridge containing ice-cold saline at 4 °C.\nWhen an ex vivo lung perfusion system is indicated, follow the steps below for device connections to the pulmonary artery and trachea during lung procurement.\n\t\nPreserve the main trunk of the pulmonary artery and not only its bifurcation during procurement.\nIf it is not possible, take a 3-4 cm piece of the aorta to posteriorly suture it to the pulmonary artery bifurcation to replace the pulmonary artery trunk.\nDivide the trachea four to five rings above the carina to have enough length for intubation.\nKeep and store the lungs in block.\n4. Abdominal normothermic regional perfusion\nInitiate ANRP after filling the aortic occlusion balloon and checking for correct function.\nSet the following monitoring target points: pump flow = 2-2.5 L/min, continuous pressure of 60-65 mmHg in the femoral artery cannula, temperature = 37 °C, pH = 7.35-7.45, hematocrit >25%.\nObtain blood samples from the femoral artery cannula with a 10 mL syringe after starting ANRP and every 30 min for hepatic and renal biochemistry analysis, serum lactate levels, blood arterial gas, and hematocrit values. Maintain ARNP for at least for 90-120 min.\nDiscard the liver if alanine transaminase (ALT) or aspartate transaminase (AST) values are more than four times the upper normal limit during ANRP.\n5. Liver and renal recovery\nNOTE: Liver and renal recovery are performed by the hepatic surgeon and kidney surgeon, respectively.",
    "Perform medium laparotomy: proceed with a median vertical skin incision along the linea alba, from the xiphoid process (join to the previous sternotomy) to the pubis, curving the incision around the umbilicus. Use electrocautery to dissect the subcutaneous fat and superficial fascial layers down to the rectus sheath.\nDissect through the anterior and posterior components of the rectus sheath and open the peritoneum to access the peritoneal cavity. Widen the incision by sticking the fingers into the hole created, taking care not to injure the underlying structures. Place retractors to have adequate exposure of the abdomen.\nAssess the macroscopic quality of the abdominal organs by performing visual and palpatory assessments. A liver biopsy can be taken if any concern is raised, as with brain death donors.\nIf the chemistry values are correct and the macroscopic appearance is normal, validate the organs.\nStop the ECMO device. Flush preservation solution for the abdominal organs via the femoral arterial cannula and use the femoral venous cannula for exsanguination.\nProcure abdominal organs suitable for transplantation in a standard fashion as in DBD27,28.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}