{
  "id": 18767,
  "origin_website": "Jove",
  "title": "Tissue-simulating Phantoms for Assessing Potential Near-infrared Fluorescence Imaging Applications in Breast Cancer Surgery",
  "procedures": [
    "1. Create Silicone Molds for Tumor-simulating Inclusions\nCollect solid items of the desired shape and size that can serve as models for tumor-simulating inclusions, e.g., beads or marbles.\nThoroughly clean the tumor models. To ensure an easy removal from the silicone mold, the tumor models can be sprayed with anti-stick spray or covered with a thin layer of petroleum jelly or beeswax.\nPlace each model in a separate thin walled square (plastic) box with a smooth surface. If necessary, fixate the model to the bottom of the box to keep it in position. Use a box that is slightly bigger than the tumor model itself to avoid wasting excessive amounts of silicone.\nPour the required amount of silicone component A in a mixing bowl and add silicone component B in a 10:1 ratio by weight. Mix both components thoroughly. Optionally, a vacuum pump can be used to remove air bubbles from the silicone mixture.\nGently pour the silicone mixture in the plastic box to prevent trapping air bubbles. The silicone mixture should be processed within 45 min to obtain optimal results.\nLet the silicone mixture solidify for at least 6 hr before cutting the mold and removing the tumor model. Optionally, the silicone mold can be cut in a zigzag pattern to allow it to fit back together cleanly. Maximum strength of the silicone is obtained after 3 days.\n2. Create Tris-buffered Saline Solution\nCreate a Tris-buffered saline (TBS) solution by adding 6.1 g (50 mM) Tris and 8.8 g (150 mM) NaCl to 800 ml deionized water.",
    "Add 1.0 g (15 mmol) of NaN3 to block oxygenation of hemoglobin (step 3.3 and 4.4) and to inhibit bacterial growth. CAUTION: NaN3 is a severe poison. It may be fatal in contact with skin or if swallowed. The toxicity of this compound is comparable to that of soluble alkali cyanides and the lethal dose for an adult human is about 0.7 g. Always follow the safety instructions as provided by the manufacturer.\nAdjust the pH to 7.4 and bring the volume to 1,000 ml with deionized water.\n3. Create Fluorescent Inclusions\nAdd 2 g agarose to 50 ml TBS from step 2. The higher melting point of agarose compared to gelatin (step 4.2) will prevent the inclusions from dissolving and leaking fluorescent dye when placed in melted gelatin. Optionally, the amount of added agarose can be altered to 1 or 3 g to obtain softer or palpable tumor inclusions, respectively.\nHeat the agarose slurry using a microwave until the boiling point is reached. Stir thoroughly until the agarose is completely dissolved.\nAdd 1.1 g (17 µmol) hemoglobin and 5 ml intralipid 20% dissolved in 50 ml of TBS to the agarose mixture under constant stirring to resemble the optical characteristics of the surrounding breast phantom tissue (step 4).\nAdd 20.0 mg (25.8 µmol) of the fluorescent dye indocyanine green to 83.8 ml deionized water. Make sure the dye is completely dissolved.\nPipet 5.0 ml from this solution and add it to the agarose mixture to obtain a final concentration of 14 µM. Optionally, other fluorescent dyes than ICG can be used if desired with their own optimum concentration.\nGently fill the silicone molds created in step 1 with the hot agarose mixture using a syringe (Figure 1A). Repeat this process until all molds are filled.",
    "Let the fluorescent inclusions solidify at RT for approximately one hr. Protect the inclusions from light by covering the entire mold with aluminum foil.\nAfter solidification, gently open the mold and press out the inclusion (Figure 1B). Optionally, use the tip of the syringe to apply small drops of melted agarose mixture on the surface of the inclusion. By repeating this process several times on the same location, small tumor spurs can be created to simulate infiltrative tumors.\nProtect the agarose inclusions from light and dehydration by wrapping them in aluminum foil and store them in a humidified storage container at 4 °C.\n\tNOTE: The use of lower or higher fluorescent dye concentrations than the known concentration optimum will both result in diminished fluorescent signal intensity. The seemingly counterintuitive reduction in signal intensity with increasing dye concentrations above the optimum fluorescent dye concentration is due to a phenomenon known as quenching. When assessing the maximal depth penetration of a fluorescent dye in phantoms, using the optimal concentration is mandatory.\n4. Create Breast Phantoms\nObtain a cup-shaped mold to create breast phantoms of the desired size and volume, e.g., a glass or plastic bowl. The mold should have a smooth surface to prevent the gelatin form adhering to the mold. A mold volume of 500 ml will create breast phantoms of sufficient size.\nTo create a breast phantom with a volume of 500 ml, add 50 g of gelatin 250 bloom to 500 ml TBS (step 2). Heat the gelatin slurry to 50 °C under constant stirring.\nOnce the gelatin is completely dissolved, let the gelatin mixture gradually cool down and maintain it at a constant temperature of 35 °C using a hot water bath.",
    "Under constant stirring, add 5.5 g (85 mmol) bovine hemoglobin and 25 ml intralipid 20% to simulate absorption and scattering of photons in tissue, respectively.\nPrechill the cup-shaped mold at 4 °C for at least 1 hr. Next, pour the gelatin mixture in the mold to a level that corresponds to the predefined depth of the agarose tumor-simulating inclusion (Figure 1C). Let the gelatin mixture solidify at 4 °C for 30 min to one hr.\nAfter solidification, position a tumor-simulating fluorescent agarose inclusion on the surface of the phantom and temporarily fixate the inclusion with a small needle. Up to a maximum of three tumor-simulating fluorescent inclusions can be incorporated in a single breast phantom. Sufficient space (at least 5 cm) should be kept between individual tumor-simulating inclusions (Figure 1D).\nPour the remainder of the warm gelatin mixture in the remaining mold volume, allowing for adherence of both layers without creating refraction artifacts. Mark the location of the fluorescent tumor-simulating inclusions on the mold. Let the phantom solidify O/N at 4 °C.\nOnce solidified, remove the needles used for temporary fixation of the inclusions and gently remove the breast phantom from its mold (Figure 1E). Protect the breast phantom from light and dehydration by wrapping it in aluminum foil and store it in a humidified storage container at 4 °C.\nimgsrc://cloudfront.jove.com/files/ftp_upload/51776/51776fig1highres.jpg",
    "Figure 1. Sequential steps of creating breast phantoms containing fluorescent tumor-simulating inclusions. After creating silicone molds of the desired shape and size, the molds are filled with melted agarose mixture using a syringe (A). Tumor-simulating inclusions of differing size and shape were produced in the current study (B). Next, a thin layer of melted gelatin mixture is poured in a customized coated wooden breast mold (C). After solidification, the tumor-simulating inclusions are positioned, temporarily fixated, and covered with another layer of melted gelatin mixture (D). After solidification, the breast phantom is gently removed from its mold (E). The phantom can then be applied for simulating various NIRF imaging applications (F). Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/51776/51776fig1highres.jpg]\n5. Set the NIRF Camera System\nA NIRF camera system for intraoperative application is required for simulating targeted NIRF imaging in breast cancer surgery. Several NIRF imaging systems for real-time intraoperative NIRF imaging are currently available for investigational use. Although some differences between these devices exist, they all contain an excitation light source (for excitation of the fluorescent tumor inclusions) and a highly sensitive imaging device for detection of emitted photons.\nMake sure to use an excitation light source of a sufficient wavelength. For tumor-simulating inclusions containing ICG, use an excitation light source (e.g., laser) that emits photons between 750 and 800 nm. If an alternative fluorescent dye is used, the excitation wavelength should be adjusted conform the manufacturer’s instructions.\nIn case the NIRF camera system contains an emission filter to filter out unwanted background signals, make sure that the correct filter is used. For tumor-simulating inclusions containing ICG, use an emission filter between 800 and 850 nm. Alternative fluorescent dyes may require different emission filters, depending on the manufacturers’ instructions.",
    "NOTE: Make sure that there is zero overlap between the excitation and the emission wavelengths to prevent oversaturated images. In addition, the image acquisition time might have to be adjusted to obtain optimal fluorescent images. In the case of deep seated fluorescent inclusions or weak fluorescent signals, image acquisition time can be increased for up to several sec to min. In the case of superficial inclusions or strong fluorescent signals, acquisition time can be decreased to several msec to allow for video-rate fluorescence imaging in real-time.\n6. Simulation of NIRF Imaging Applications in Breast Cancer Surgery\nTake the tissue-simulating breast phantom from its container and place it on a flat nonfluorescent surface. Next, position the NIRF imaging device above the breast phantom, leaving a sufficient working distance for excision of the tumor-simulating inclusions.\nLocalize the tumor-simulating fluorescent inclusion using NIRF imaging and/or palpation of the phantom breast. In case no fluorescent signal can be detected, the inclusion is either positioned too deep in the phantom for detection or the image acquisition time should be increased.\nOnce the inclusion is localized, incise the phantom breast and remove the tumor-simulating inclusion under real-time NIRF-guidance using conventional surgical instruments. Alternatively, the inclusion can be excised guided solely by visual inspection and palpation of the breast phantom to simulate the standard-of-care.\nDirectly after removal of the tumor-simulating inclusion, image the surgical cavity for any remaining fluorescent activity indicating inadequate excision.\nIn case of any remaining fluorescent activity, excise the inclusion remnant under direct NIRF guidance until no fluorescent signal is left.\nImage the excised phantom fragments to simulate NIRF-guided macroscopic margin status assessment. Hereto, slice the phantom tissue in 3 - 5 mm plaques and image the plaques accordingly. Fluorescence signal reaching into the surgical margins indicates the existence of positive surgical margins.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}