{
  "id": 5670,
  "origin_website": "Bio",
  "title": "<em>In vitro</em> AMPylation Assays Using Purified, Recombinant Proteins",
  "procedures": [
    "Note: 33P-ATP is radioactive. Please counsel with your radio safety officer regarding your institute’s radio waste disposal and radio protection routine and ensure to obtained all required protective equipment–that should include but may not be limited to a lab coat, double-gloves and safety goggles–before starting the experiment. Continuously monitor work surfaces using a Geiger-counter and decontaminate if required following your institute’s decontamination protocol. In vitro AMPylation reactionMix 5 μg of recombinant AMPylase enzyme in 10 μl protein storage buffer (see Recipes) with 20 μl reaction buffer (see Recipes) supplemented with 0.5 μl/sample 33P-ATP. Notes:  The amount of AMPylase to use in an in vitro reaction depends on the relative activity of the individual enzymes; very potent enzymes (i.e., VopS, IbpA) will in vitro modify a molar excess of target protein (i.e., Rac1, Cdc42); thus, 1 μg/reaction is sufficient. In contrast, wild-type versions of metazoan AMPylases in general perform poorly in vitro; thus, 5-10 μg/reaction is preferred. Wear proper protective equipment and monitor work surfaces during this step with a Geiger-counter.Incubate reaction for 60 min at 20 °C.Notes:  This step pre-loads or primes the enzyme, which will maximize target AMPylation.Throughout the protocol, suggested 20 °C incubation steps can also be performed at room temperature (approximately 20 °C).Centrifuge sample for 30 sec at 7,000 x g.Add 2 μg of target protein in 10 μl protein storage buffer to the primed enzyme (final reaction volume: 40 μl).Incubate reaction for 60 min at appropriate temperature (VopS, IbpA: 20 °C; FIC-1: 30 °C; HYPE: 37 °C).Note: Reactions can be performed at 20 °C; however, incubation at higher temperatures (37 °C) enhances target AMPylation.Quench the reaction by adding 8 μl of 6x SDS-PAGE loading buffer (see Recipes). Properly close 1.",
    "5 ml tubes and put on tube locks to prevent lids from opening inadvertently during step A9. Boil samples for 10 min at 95 °C.Note: Tube locks are essential, as they will minimize the chance for tubes to pop open while boiling (see next step); should accidental opening of a tube have occurred, identify likely [33P]-contamination using a Geiger-counter and decontaminate according to your radiation safety office’s guidelines. Proceed with gel electrophoresis or store samples at -80 °C.Sample analysis by gel electrophoresis and autoradiographyEquilibrate samples on ice for 10 min.In the meantime, choose appropriate gel: if available, a TRIS-glycine gradient gel (i.e., 4-16%) should be used; alternatively, select the polyacrylamide percentage according to your target protein’s mass: i.e., 12% for HSP70 (approximately 70 kDa), 15% for Histones (approximately 15 kDa) (acrylamide: Bis-acrylamide = 30:0.8); prepare gel running buffer according to gel manufacturer’s instructions.Centrifuge samples for 30 sec at 7,000 x g.Load gel: add molecular weight marker and individual samples to each well of the SDS-PAGE gel.Note: The use of gel loading tips is recommended to minimize cross-well spilling. Alternatively, use a 10 μl Hamilton syringe for loading. Load only ~50% of your total sample; store remaining half in case you need to re-run the gel.Run the gel at 60-100 V during the stacking stage, then adjust to120 V (constant voltage) for ~2 h. Note: The running time depends on the gel system used. Note: Steps B6-B17 are referred to as fluorography, a method developed by Bonner and Laskey (Bonner and Laskey, 1974) to be able to detect 3H in autoradiograms of SDS-PAGE gels. The method also improves sensitivity for other soft emitters, less so for higher energy isotopes such as 33P. An added advantage is that the procedure confers mechanical stability to low-percentage gels, owing to the precipitation of PPO.",
    "Gels with acrylamide percentages lower than 5% should not be subjected to fluorography, as the mechanical properties of these gels can yield an irregular final product. Commercially available solutions for impregnation of gels with fluorophores are available, often at higher cost than home-made DMSO-PPO solutions. Wear gloves at all times, since the DMSO-PPO solution can penetrate the skin and cause local precipitation of PPO in tissues. Carefully transfer the gel into a metal or glass tray (a baking dish will serve the purpose).Add 500 ml of DMSO for a large gel of 100 ml volume, smaller gels can be handled with less.Notes:  Add ~5 times the volume of the gel of DMSO to cover the gel completely. Incubate at room temperature for 60 min with agitation.Discard DMSONote: This DMSO must be considered as potentially radioactive; dispose accordingly.Add a fresh volume (see step B7) of DMSO and incubate for 60 min at room temperature.Discard DMSO.Note: This DMSO must be considered as potentially radioactive; dispose accordingly.Cover the gel in DMSO-PPO solution (22.2 g of PPO and 80 ml of DMSO; scale volume according to need) (see Recipes). Incubate for 2 h at room temperature with agitation.Remove DMSO-PPO as completely as possible.Note: The DMSO-PPO solution can be recycled and reused for up to 3 gels/experiments. Replenish PPO in the DMSO-PPO solution after each cycle with an amount of PPO approximately equal to that now precipitated in the gel. Cover the gel in the glass tray with 2 cm of ddH2O and incubate for 60 min at room temperature (Figure 1A and Video 1). Notes: Adding ddH2O to the dehydrated, PPO-soaked gel will result in immediate precipitation of PPO and will rapidly turn the transparent gel into a milky-white gel. Use a paper towel to remove any precipitated PPO from the tray.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170717/20170717230042_6604.jpgFigure 1.",
    "PPO treatment and final autoradiography plot. A. Typical appearance of SDS-PAGE gel after successful dehydration and PPO loading (see Video 1 for more details); B. Representative autoradiography plot depicting auto-AMPylation of the conferring enzyme (FIC-1(E274G), a constitutive-active FIC-1 version), as well as target modification (HSP40).    <p>imgsrc:https://bio-protocol.org/javascript:;</p>   Video 1. PPO precipitation in dehydrated SDS-PAGE gel. Dehydrated and PPO-loaded SDS-PAGE gel is kept in a glass tray and distilled water is added. Upon contact with water, PPO precipitates within the gel. Excess PPO still present in the glass tray precipitates, too. To achieve best results, incubate SDS-PAGE gel for 60 min at room temperature (step B14) before proceeding with washing (step B15).                                                      Discard ddH2O.Add fresh ddH2O.Incubate gel in ddH2O for 10 min. Discard ddH2O.Repeat previous step 5 times.Pre-soak filter paper (Whatman 3MM) with ddH2O.Transfer gel face-up onto soaked filter paper.Transfer filter-gel stack to gel drying unit.Cover the filter-gel stack with Saran wrap.Note: Adding a single layer of Saran wrap or similar prevents the gel from sticking the gel dryer’s rubber cover and facilitates the removal of the gel once dried onto the filter.Dry gel for 90 min at 65 °C. It is essential that a strong vacuum be maintained to avoid cracking of the gel. If necessary, use a lyophilizer-style set-up with a cold trap.Transfer gel into autoradiography cassette.Note: At this stage, it is sometimes worthwhile to use a Geiger-counter to get a feeling for the signal intensity attained; if audible with a sensitive Geiger-counter, an overnight exposure of the film will usually yield an interpretable signal. In a dark room, expose to film. Expose autoradiogram for 10 min to 10 days, depending on the expected signal intensity.Note: This is a rather arbitrary factor and often must be evaluated empirically; 33P has a half-life time of ~30 days.",
    "If the film is exposed for longer than 12 h, store the autoradiography cassette at -80 °C to enhance sensitivity of detection.Develop film according to manufacturer’s instructions (Figure 1B)."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}