{
  "id": 6516,
  "origin_website": "Bio",
  "title": "An Efficient Approach for RNA Extraction from Boar Sperm and Seminal Plasma",
  "procedures": [
    "Boar semen collectionFollow the institutional guidelines to maintain boars and semen collection procedures. Use mature and trained boars for semen collection. Maintain a hygienic environment in semen collection area.Use gloved hand technique to collect boar semen (Kasimanickam et al., 2019b). After mounting on a dummy, clean sheath and prepuce with a mild disinfectant solution. Following a couple of copulatory thrusts, grasp the corkscrew penis with a gloved hand to collect ejaculate.Note: Use polyvinyl gloves not the latex gloves since the latex gloves are spermicidal in nature. Discard the pre-sperm fraction. Collect the sperm-rich fraction into a pre-warmed container through a j-cloth filter (Thermo Fisher Scientific, Bothell, WA, USA). Maintain clean environment to prevent contamination.Note: Pre-warm the container, filter cloths, transfer pipets, microscopic slides and coverslips at 37 °C using a benchtop incubator. Assess the sperm motility immediately after the semen collection. Place a drop of semen on a pre-warmed (37 °C) microscopic slide and observe under a phase contrast microscope at 100x magnification. Use the semen having ≥ 80% motility for the subsequent procedures (RNA isolation from sperm and seminal plasma).Filter the sperm-rich fraction through a double layered Miracloth (Millipore Sigma, Burlington, MA, USA) into a pre-warmed conical flask to determine the volume, concentration, motility and presence of immature sperm cells (Table 1).Determine the semen volume using a graduated measuring cylinder.Evaluate the sperm concentration using a calibrated and standardized spectrophotometer for boar semen. Pipet the diluted semen sample in 2.9% sodium citrate in a square cuvette and measure the optical density at the excitation wavelength of 550 nm. Note the sperm concentration corresponding to the OD. Table 1. Semen volume, concentration, motility and purity in ten mature Landrace boarsimgsrc:https://en-cdn.bio-protocol.org/attached/image/20190701/20190701070803_7458.",
    "jpg18 to 18 months Landrace2Sperm-rich fraction3Evaluated by spectrophotometer (Spectronic 20D+ spectrophotometer) 4Evaluated using phase-contrast microscope5Evaluated using phase-contrast microscopeSeparation of sperm and seminal plasmaCentrifuge undiluted semen at 1,000 x g for 20 min at 4 °C. Use pre-cold 50 ml Falcon tubes for 40 ml semen.Note: Extended or non-extended semen should be stored at 15 °C to maintain viability to use for insemination. Transfer the seminal plasma (supernatant) into a new tube. Centrifuge the seminal plasma at 16,000 x g, 4 °C to ensure removal of sperm. Use microcentrifuge tubes to use the centrifugal force of 16,000 x g at 4 °C.Note: Any other types of centrifuges that can reach higher centrifugal force and the temperature of 4 °C can also be used to separate seminal plasma from the semen. Aliquot the seminal plasma (250 μl aliquots) and store at -80 °C.Note: The number of 250 μl aliquots that will be stored can be determined based on your experimental plan.  Wash the sperm pellet twice using Beltsville Thawing Solution (BTS; IMV Technologies, Maple Grove, MN, USA) and centrifuging at 1,000 x g for 20 min at 4 °C.Note: While re-suspending the sperm pellet, dissolve the pellet in a small volume (1 ml) of BTS first, and dilute further (20 ml) with BTS for effective washings. Re-suspend the final sperm pellet in BTS (20 ml; resuspend in 1 ml first, add 19 ml and mix the suspension thoroughly) at 4 °C, aliquot in micro centrifuge tubes (approximately 500 x 106 sperm). Centrifuge at 16,000 x g, 4 °C and discard the supernatant. Flash-freeze the sperm pellet in liquid nitrogen and then store at -80 °C.Note: Based on the initial concentration, the sperm can be resuspended and aliquoted.",
    "For example, when the sample of 40 ml semen contains 40 billion sperm, the final sperm pellet after washing can be resuspended in 20 ml. Therefore, an aliquot of 250 μl will contain 500 x 106 sperm. Modify your starting volume of semen based on the experimental design and the need. Sperm RNA purificationIsolate total RNA containing small RNAs including miRNAs from sperm using RNeasy plus Universal Mini Kit (Qiagen Inc., Valencia, CA, USA).Add 900 μl QIAzol lysis reagent to the sperm pellet (approximately 500 x 106 sperm). homogenize completely using a disposable homogenizer (Thermo Fisher Scientific, San Francisco, CA, USA), and hold at room temperature for 5 min to promote dissociation of nucleoprotein complexes.Add 100 μl genomic DNA (gDNA) eliminator solution and shake the mixture vigorously to eliminate gDNA. Add 180 μl of chloroform. Agitate vigorously for about 1 min and incubate for 2-3 min at room temperature.Centrifuge the mixture at 12,000 x g for 15 min at 4 °C. Harvest the upper aqueous phase (~600 μl) into a new Eppendorf tube, add 1.5 volume of 100% ethanol, and mix the mixture thoroughly by pipetting up and down.Layer the sample (about 700 μl) on an RNeasy mini spin column (included in the RNeasy plus Universal Mini Kit), and centrifuge at ≥ 8,000 x g for 30 s at room temperature.Discard the flow-through and repeat the centrifugation with the rest of the sample. Discard the flow-through again.Wash the bound RNA by centrifugation (≥ 8,000 x g, 30 s, at room temperature) using buffers RWT and RPE consequently.Add 700 μl buffer RWT to the RNeasy spin column. Close the lid gently, and centrifuge for 30 s at ≥ 8,000 x g to wash the membrane. Discard the flow-through.",
    "Note: Dilute the RWT buffer by adding 2 volumes of ethanol (96-100%) before use.  Add 500 μl RPE buffer to the RNeasy spin column. Close the lid gently, and centrifuge for 30 s at ≥ 8,000 x g to wash the membrane. Discard the flow-through.Note: Dilute the RPE buffer by adding 4 volumes of ethanol (96-100%) before use. Repeat the RPE wash by centrifuging for 2 min.Place the RNeasy spin column in a new 2 ml collection tube. Close the lid gently, and centrifuge at full speed for 1 min. Perform this step to eliminate any possible carryover of RPE buffer. Elute the RNA using 60 μl RNase-free water by centrifuging for 1 min at ≥ 8,000 x g.Measure the concentration of RNA using a Thermo Scientific NanoDrop 1000 Spectrophotometer (Table 2). Evaluate the purity of RNA by determining the ratio of absorbance at 260 and 280 nm and store the samples at -80 °C until use. Refer to the flow chart for the main steps (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190701/20190701071207_3693.jpgFigure 1. Flow chart for isolating the total RNA including small RNAs from sperm cellsTable 2. RNA yield from 500 x 106 sperm in ten mature Landrace boarsimgsrc:https://en-cdn.bio-protocol.org/attached/image/20190701/20190701071319_0848.jpgSeminal plasma RNA isolationPurify total RNA from boar seminal plasma using miRNeasy serum/plasma kit (Qiagen, Valencia, CA, USA).Thaw frozen seminal plasma samples at room temperature until it became completely liquid (~15 min). Add 750 μl of QIAzol reagent (five volumes of seminal plasma) to 150 μl of seminal plasma. Mix by pipetting up and down or by vortexing briefly. Incubate for 5 min at room temperature (15-25 °C).Note: The lysate can be stored at -80 °C for several months. Add 3.5 μl miRNeasy serum/plasma spike-in-controls (lyophilized C. elegans miR-39 miRNA mimic; 1.6 x 108 copies/μl) and mix thoroughly.",
    "Add 150 μl chloroform (same volume of starting material). Shake the mixture vigorously for 30 s and incubate for 2-3 min at room temperature (15-25 °C).Centrifuge at 12,000 x g for 20 min at 4 °C. Harvest the upper aqueous phase, avoiding the interphase, into a new Eppendorf tube. Mix with ~1.5 volumes of 100% ethanol by pipetting up and down.Transfer approximately half of the mix (about 750 μl) into an RNeasy MinElute spin column in a 2 ml collection tube. Centrifuge at 12,000 x g for 30 s at room temperature (15-25 °C).Discard the flow-through and repeat this step with the rest of the sample using the same column.Wash the RNA bound to the membrane sequentially with the buffer RWT and the buffer RPE.Add 700 μl RWT buffer to the RNeasy MinElute spin column. Close the lid gently and centrifuge for 30 s at 8,000 x g at room temperature to wash the column. Discard the flow-through.Pipet 500 μl RPE buffer onto the RNeasy MinElute spin column. Close the lid gently and centrifuge for 30 s at 8,000 x g at room temperature to wash the column. Discard the flow-through.Add 500 μl of 80% ethanol onto the RNeasy MinElute spin column. Close the lid gently and centrifuge for 2 min at 8,000 x g at room temperature (15-25 °C) to wash the spin column membrane. Discard the collection tube with the flow-through.Dry the RNeasy MinElute column by centrifugation at 12,000 x g for 5 min and discard the flow-through and collection tube.Elute RNAs by placing the membrane in 24 μl RNase-free water and centrifuging at 12,000 x g for 2 min.Determine the RNA concentration (Table 3) using a spectrophotometer (Thermo Scientific NanoDrop 1000).",
    "Refer to the flow chart for the main steps for isolating RNA from the seminal plasma (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190701/20190701071420_2087.jpgFigure 2. Flow chart for isolating RNA from the seminal plasmaTable 3. RNA yield from 150 µl of seminal plasma in ten Landrace boarsimgsrc:https://en-cdn.bio-protocol.org/attached/image/20190701/20190701071512_6811.jpg"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}