{
  "id": 19470,
  "origin_website": "Jove",
  "title": "Modeling Neonatal Intraventricular Hemorrhage Through Intraventricular Injection of Hemoglobin",
  "procedures": [
    "NOTE: All animal protocols were approved by the institutions' Animal Care and Use Committee. See the Table of Materials for details about all materials, reagents, equipment, and software used in this protocol.\n1. Preparation of hemoglobin and CSF solutions\nPrepare a sterile artificial CSF (aCSF) solution by adding 500 µL of the aCSF solution to a 1.5 mL microtube and store on ice.\nPrepare a sterile 150 mg/mL hemoglobin solution by adding 75 mg of hemoglobin to 500 µL of aCSF in a 1.5 mL microtube and store on ice.\n2. Preparation of the animal for injection\nTurn the heating pad to the medium setting to maintain the body temperature of the rat.\nAnesthetize postnatal day 4 (P4) rats in an induction chamber filled with 3% isoflurane.\n\tNOTE: Confirm sufficient anesthesia using the toe/tail-pinch response every 15 min. Monitor anesthesia with visual observation of tissue color, body temperature, and respiratory rate.\nAdminister pain relief with a 5 mg/kg subcutaneous carprofen injection to the anesthetized rat.\nPlace the anesthetized rat prone in the stereotactic apparatus with the nose positioned in the anesthesia adaptor with a constant flow of 1.5% isoflurane.\nTighten non-rupture ear bars on the external auditory meatus to secure the head.\n\tNOTE: Apply vet ointment to keep the eyes moisturized if the eyes are open at the age of injection.\nClean the head, alternating with sterile cotton-tipped applicators soaked in betadine and 70% ethanol.\n\t\nTouch the betadine-soaked applicator to the center of the scalp and spread the betadine in circles, moving outward.\nRepeat step 2.6.1.1 with the ethanol-soaked applicator.\nRepeat step 2.6.1.1 and step 2.6.1.2 3x.\nApply a sterile surgical drape to protect the surgical field. \nUsing a sterile scalpel, make a 0.3 cm incision vertically down the center of the head to expose the bregma of the skull.",
    "NOTE: If injecting from the lambda, expose the lambda of the skull instead of the bregma.\nUse a sterile cotton-tipped applicator to dry the area.\n3. Setting up the stereotactic injector\nDraw the hemoglobin solution prepared in step 1.2 into a 0.3 mL sterile syringe with a 30G needle and place the syringe into the stereotactic injector system.\n\t​NOTE: If generating control conditions, draw aCSF solution prepared in step 1.1 into a 0.3 mL sterile syringe and proceed with the protocol.\nTurn on the stereotactic injector interface and click on the Configuration button to input the injection volume and rate settings.\n\t\nClick on Volume and set the volume at 20,000 nL (20 µL).\nClick on Infusion rate and set the rate at 8,000 nL/min (8 µL/min).\nExit Configuration by clicking on the Reset Pos button.\nFlush the needle tip by clicking on the Infuse button until a small bead of hemoglobin solution emerges at the needle tip.\nGently wick the hemoglobin solution from the needle tip with a sterile cotton-tipped applicator.\n4. Animal injection\nSet the bregma as zero on the stereotactic injector system by adjusting the mediolateral and anteroposterior positions of the syringe before lowering the tip of the flushed syringe needle to gently touch the skull at the bregma.\n\tNOTE: If injecting from the lambda, set lambda as zero.\nIdentify the coordinates of choice.\n\t\nIf injecting from the bregma, in P4 rats described here, use 1.5 mm lateral, 0.4 mm anterior, and 2.0 mm deep from bregma.\nIf injecting from the lambda, use the following coordinates for P4 rats: 1.1 mm lateral, 4.6 mm anterior, and 3.3 mm deep from lambda.\nRaise the syringe needle 1 cm above the skull to clear the scalp. When the syringe is raised, proceed to set the mediolateral and anteroposterior coordinates.",
    "Lower the syringe needle to gently touch the skull. Check that the needle is touching the skull.\nSet the dorsoventral coordinate over a 30 s period.\n\tNOTE: While setting the dorsoventral coordinate, the needle will puncture the skull. Care must be taken to assure that the syringe passes through the skull without deforming the skull. Skull deformation is avoided by slowly withdrawing the needle along the dorsoventral coordinate if deformation occurs, then placing the needle back along the same trajectory. This allows the needle to pass through the hole in the skull with less force and no deformation.\nOn the stereotactic injector interface, click on the Run button to begin injection.\nAfter the injection is finished, leave the syringe needle in place for 2 min to minimize backflow of the solution.\nWithdraw the syringe slowly along the dorsoventral coordinate over 2 min until the needle tip is 2 cm above the scalp.\nRotate the stereotactic injector arm away from the operative field.\n5. Postoperative care\nClose the scalp with a 6-0 monofilament suture. Make one simple interrupted suture at the center of the 0.3 cm incision.\nRemove the pup from anesthesia and place it onto a secure area on the heating pad.\nReturn the rodent to the home cage to recover from the anesthesia under the care of its dam.\n\tNOTE: Timely return to the care of the dam reduces early postoperative mortality.\nMonitor the animals for anesthesia by loss of the righting reflex hourly post surgery for 3 h.\nMonitor the animals daily for 7 days for normal activity, food intake, and weight gain. Monitor the incision site for wound healing, closure, and reappearance of fur at the site of surgery.",
    "NOTE: In the rare case that neurological changes such as seizures, central depression, or decreased appetite are observed during monitoring, euthanize the animal using intravascular perfusion or cervical dislocation under anesthesia.\nTo prevent infection once the suture is closed and the wound is healing, apply topical triple-antibiotic at the incision site.\n6. MRI acquisition and quantification\nPerform MRI on a 4.7T or 9.4T small-animal scanner.\nTurn the heating pad to the medium setting to maintain the body temperature of the rat.\nInduce anesthesia in a chamber using 3% isoflurane.\n\tNOTE: Confirm sufficient anesthesia using the toe/tail-pinch response every 15 min. Monitor anesthesia with visual observation of tissue color, body temperature, and respiratory rate.\nPlace the anesthetized rat prone in the MRI with the nose positioned in the anesthesia adaptor with a constant flow of 1.5% isoflurane.\nPerform T2-weighted imaging by selecting a T2-weighted fast spin echo sequence.\n\t\nIf using a 4.7T MRI scanner, enter the following parameters into the MRI software: repetition time = 3,000 ms, echo time = 27.50 ms, number of averages = 3, field of view = 18.0 mm x 18.0 mm, matrix = 128 x 128, number of axial slices = 24, thickness = 0.50 mm.\nIf using a 9.4T MRI scanner, enter the following parameters into the MRI software: repetition time = 5,000 ms, echo time = 66.00 ms, echo spacing = 16.50 ms, number of averages = 2, repetitions = 1, rare factor = 8, field of view = 16.0 mm x 16.0 mm, matrix = 256 x 256, number of axial slices = 32, thickness = 0.50 mm.\nClick on the Continue button to start the sequence.\n7. Image processing and analysis",
    "Use native T2-weighted data to analyze brain volume. Use segmentation software to manually delineate the lateral ventricles6. Click on Paintbrush Mode and select square brush style. Adjust the brush size to 1. Click Layout inspector and select axial view. Click zoom to fit. Place the cursor on the image; trace and fill the lateral ventricle space.\nClick on Segmentation in the toolbar | Volume and Statistics to view the segmented volumes.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}