{
  "id": 13176,
  "origin_website": "Jove",
  "title": "In vitro Neuromuscular Junction Induced from Human Induced Pluripotent Stem Cells",
  "procedures": [
    "1. Preparation of extracellular matrix (ECM)-coated plates\nDilute ECM (see Table of Materials) with ice cold 1x PBS to a final concentration of 2%.\n\t\nAdd 1 mL of ECM to 49 mL of 1x PBS in a 50 mL plastic tube. Mix well by pipetting up and down several times.\nPlace 1 coverslip into each well of a 6-well plate. Add 1.5 mL of 2% ECM into each well.\nIncubate the well plate with 2% ECM for 2 h at 37 °C.\nAspirate ECM from the well plate and store the plate at 4 °C before use.\n2. Differentiation of iPSCs toward NMJ\nSeed 4 x 105 of iPSCs per well on the 6-well plate prepared in section 1. Make sure to seed the cells on the coverslip pre-deposited in the well.\n\tNOTE: In this study, the 201B7MYOD iPS cell line, a gift from Dr. Sakurai’s Lab, was used15.\n\t\nRemove the medium from the iPSCs on the 6 cm culture dish and wash the iPSCs once with 1x PBS.\nAdd 1 mL of cell detachment solution to the dish and incubate for 10 min at 37 °C.\nAdd 3 mL of primate embryonic stem (ES) cell medium to the dish and pipette 3 times gently.\nCollect the supernatant, which contains detached iPSCs, into a 50 mL plastic tube and centrifuge at 160 x g at 4 °C for 5 min.\nCarefully aspirate the supernatant, resuspend the iPSCs in 3 mL primate ES cell medium with 10 µM Y27632, and count the cell number using a hemocytometer.\nDilute the iPSCs with primate ES cell medium and 10 µM Y27632 to a concentration of 2 x 105 cells/mL. Add 2 mL of iPSCs on the coverslip pre-deposited in the well that described in section 1.\nInduction of the iPSCs to NMJ",
    "On day 1, 24 h after seeding the iPSCs to the 6-well plate, remove the culture medium and replace it with 2 mL of fresh primate ES cell medium containing 1 µg/mL doxycycline to each well.\nChange the medium with 2 mL of myogenic differentiation medium (MDM) (Table 1) containing 1 µg/mL doxycycline (final concentration) to each well. Refresh the medium every day from day 2 to day 10.\nFrom day 11, switch the medium to 2 mL of NMJ medium (Table 1) to each well. Refresh the medium every 3‒4 days thereafter until day 30.\nObserve the differentiated NMJ by phase inverted microscopy on day 30. The NMJ can be used for the following analysis.\n3. Immunofluorescence (IF) staining\nOn day 30, aspirate the culture medium from the 6-well plate. Fix the NMJ culture by adding 2 mL of 4% paraformaldehyde to each well for 30 min at room temperature.\nWash the samples 3 times by adding 2 mL of 1x PBS to each well (3 min for each wash).\nPermeabilize the samples with 0.1% Triton/PBS for 10 min.\nRepeat step 3.2.\nBlock the samples with 0.5% BSA for 1 h at room temperature.\nRepeat step 3.2.\nIncubate the samples with the primary antibodies at 4 °C overnight. The dilution of antibodies is as follows: Islet 1 (1 µg/mL), myosin heavy chain (MYH) (1/300), neurofilaments (NF) (1 µg/mL), S-100 (1/300), synaptic vesicle protein 2 (SV2) (1 µg/mL), Tuj1 (1/1000).\nRepeat step 3.2.\nIncubate the samples with the secondary antibodies at room temperature for 1 h. The concentration of the secondary antibodies used is as follows: anti-mouse IgG 488 conjugated (0.1 µg/mL), anti-rabbit IgG 488 conjugated (0.1 µg/mL).\nRepeat step 3.2.\nIncubate the samples with aBTX-647 (0.5 µg/mL) for AChR staining and with DAPI (1 µg/mL) for nucleus staining.",
    "Repeat step 3.2.\nPick up the coverslip with a pair of forceps from the 6-well plate and mount it in 50% glycerol/PBS solution on a microscope slide.\n4. Scanning electron microscopy (SEM)\nFix the NMJ culture with 4% paraformaldehyde and 1% glutaraldehyde prepared in 0.1 M potassium phosphate buffer at room temperature for 1 h.\nWash the samples 3 times by immersing them in 0.1 M potassium phosphate buffer at room temperature (10 min for each wash).\nDehydrate the samples with ascending concentrations of ethanol (50%, 70%, 90%, 95% and 100% twice). Immerse the samples in each concentration of ethanol for 10 min.\nDry the samples by a critical point dryer (-30 °C, 0.1 Torr).\nCoat the samples with Pt (platinum) ion coater (30 mA for 3 min; thickness of Pt is about 20 nm).\nObserve the samples by SEM at 5 kV.\n5. Transmission electron microscopy (TEM)\nUse a cell scraper to harvest the tissue from the NMJ culture plate. Shape the tissue into a small pellet (3 mm3) with a razor blade and glue by gelation to form a gel-wrapped piece. Fix the gel-wrapped piece with 2% paraformaldehyde and 2% glutaraldehyde prepared in 0.1 M potassium phosphate buffer at 4 °C overnight.\nWash the samples 3 times by immersing them in 0.1 M potassium phosphate buffer (15 min for each wash) at room temperature.\nPostfix the samples with 1% osmium tetroxide prepared in double distilled H2O for 1 h at room temperature.\n\tCAUTION: This step must be done in a chemical hood.\nRepeat step 5.2.\nDehydrate the samples with ascending concentrations of ethanol (50%, 70%, 90%, 95% and 100% twice). Immerse the samples in each concentration of ethanol for 10 min.",
    "Aspirate the 100% ethanol. Infiltrate the samples with ascending volume ratios of epoxy resin to 100% ethanol mixtures (1:3, 1:1 and 3:1). Agitate each mixture gently at 10 rpm for 1 h at room temperature.\nReplace the epoxy-ethanol mixture with pure epoxy resin and agitate gently at 10 rpm for 4 h at room temperature.\nAfter 4 h, refresh the epoxy resin with fresh epoxy resin and agitate gently at 10 rpm overnight at room temperature.\nEmbed the samples in embedding capsules with fresh epoxy resin and cure the samples in an oven at 65 °C overnight.\nUltramicrotomy\n\t\nCoarsely trim the sample blocks under a dissecting microscope for the correct orientation.\nFinely trim the coarsely trimmed blocks with a glass knife on an ultramicrotome to obtain smooth surfaces.\nPrepare 70 nm ultrathin sections from the well-trimmed blocks with a diamond knife. Retrieve the ultrathin sections with 200 mesh carbon-formvar-coated copper grids.\nStain the ultrathin sections containing grids with saturated uranyl acetate prepared in double distilled H2O for 30 min and wash the grids 3 times with double distilled H2O (10 min for each wash).\nFurther, contrast the ultrathin sections with Reynold’s lead citrate19 (2.5%) for 5 min and wash with boiled H2O pre-cooled to room temperature 3 times (10 min for each wash). Put several sodium hydroxide pellets around the staining area to prevent CO2 precipitation on the sections.\nObserve the ultrathin sections by TEM at 70 kV.\n6. Muscle contraction and curare treatment\nTo trigger the myotube contraction, add 25 mM CaCl2 in the culture medium in step 2.3. The movement of myotubes can be observed in 1‒2 min.\nPlace the 6-well plate on the stage of an inverted microscope. Record a movie of myotube contraction by live cell microscopy.",
    "To stop the myotube contraction, add curare to the culture medium (300 ng/mL). Then record the movie as step 6.2.\nOpen the movie file with motion vector analysis software then click the Motion Analysis button to analyze the movie.\n\tNOTE: The myotubes contraction is shown as time-motion graphic. The movies are color-coded to show the movement speed of myotubes. The color-coded sparkly signals indicate the movements of myotubes where the red color shows the fastest movement speed and blue color shows the slowest movement speed."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}