{
  "id": 18666,
  "origin_website": "Jove",
  "title": "A Semi-High-Throughput Adaptation of the NADH-Coupled ATPase Assay for Screening Small Molecule Inhibitors",
  "procedures": [
    "1. Preparing stock solutions and reagents\nPrepare dithiothreitol (DTT) stock solution by dissolving crystalline DTT in distilled water to a final concentration of 1000 mM. Adjust the pH to 7.0 with 1 M NaOH solution. Aliquot and store at -20 °C.\nPrepare ATP stock solution by dissolving crystalline ATP in distilled water to a final concentration of 100 mM. Adjust the pH to 7.0 with 1 M NaOH solution. Aliquot and store at -20 °C.\nPrepare 10x NADH buffer containing 70 mM 3-(N-morpholino)propanesulfonic acid (MOPS), 10 mM MgCl2, 0.9 mM ethylene glycol-bis(β-aminoethyl ether)-N,N,N′,N′-tetraacetic acid (EGTA), and 3 mM NaN3. Adjust the pH to 7.0 with 1 M NaOH solution. Store at 4 °C.\nPrepare 1x myosin buffer containing 10 mM MOPS and 0.1 mM EGTA. Adjust the pH to 7.0 with 1 M NaOH solution. Store at 4 °C. Add bovine serum albumin (BSA) and DTT to a final concentration of 0.1% (w/v%) and 1 mM, respectively, before use.\nPrepare 1x actin buffer containing 4 mM MOPS, 0.1 mM EGTA, 2 mM MgCl2, and 3 mM NaN3. Adjust the pH to 7.0 with 1 M NaOH solution. Store at 4 °C. Add BSA and DTT to a final concentration of 0.1% (w/v%) and 1 mM, respectively, before use.\nPrepare NADH stock solution by dissolving crystalline NADH in 10x NADH buffer to a final concentration of 5.5 mM. Aliquot and store at -20 °C.\nPrepare PEP stock solution by dissolving crystalline PEP in 10x NADH buffer to a final concentration of 50 mM. Aliquot and store at -20 °C.",
    "Prepare LDH stock solution by dissolving lyophilized LDH powder in a mixture of glycerol and 10x NADH buffer (50%:50%) to a final concentration of 2000 U/mL. Centrifuge the solution to remove any undissolved protein present (7,197 x g, 20 °C, 10 min). Transfer the supernatant into a clean centrifuge tube carefully. Aliquot and store at -20 °C.\nPrepare PK stock solution by dissolving lyophilized PK powder in a mixture of glycerol and 10x NADH buffer (50%:50%) to a final concentration of 10000 U/mL. Centrifuge the solution to remove any undissolved protein present (7,197 x g, 20 °C, 10 min). Transfer the supernatant into a clean centrifuge tube carefully. Aliquot and store at -20 °C.\nReconstitute the lyophilized cardiac and skeletal muscle myosin II samples by adding 100 µL distilled water to obtain 10 mg/mL stock solutions corresponding to ~37.9 µM and ~40.8 µM myosin concentrations (monomeric), respectively. For further details, see manufacturer's instructions.\nPrepare F-actin from rabbit muscle acetone powder as described by Pardee and Spudich25.\n2. Measuring ATPase activities and inhibitory effects of small molecule inhibitors\nPrepare compound plate.\n\t\nDissolve compounds of interest in high-quality dimethylsulfoxide (DMSO).\nCreate fifteen-step serial 1:2 dilutions starting from 10 mM compound concentration in DMSO.\nTransfer the samples to a 384-well polypropylene plate in triplicates (12.5 µL each) using a multichannel pipette. Use two rows on the compound plate for one compound (instead of three columns) to minimize the number of wells potentially affected by edge effects. Use the last three wells in the second row for each compound as negative control (DMSO only). Do not use the first and the last row on the plate for compound dilutions.\nTransfer pure DMSO into the wells of the first row (reserved for NADH calibration).\nUse the last row for positive control.",
    "NOTE: Para-aminoblebbistatin at 4 mM concentration in DMSO was used here.\nPrepare 4500 µL of 20 µM diluted actin solution for each assay plate (384-well black-wall polystyrene microplate) by diluting actin stock solution in actin buffer. Mix the solution thoroughly by pipetting up and down 30x using a 5 mL pipette to reduce viscosity and heterogeneity by breaking actin filaments. Centrifuge the solution to remove any precipitated protein present (7,197 x g, 20 °C, 10 min). Carefully transfer the supernatant into a clean centrifuge tube.\nPrepare master mix containing LDH and PK enzymes (\"enzyme mix\"). For each assay plate, combine 171.4 µL of LDH solution, 171.4 µL of PK solution and 3189.3 µL or 3252.9 µL of myosin buffer for assays involving cardiac or skeletal muscle myosin II's, respectively, in a 15 mL conical centrifuge tube. Do not add any myosin at this point to avoid aggregation and precipitation.\nPrepare master mix containing all substrates (\"substrate mix\"). For each plate, combine 162.1 µL of ATP, 162.1 µL of PEP and 324.1 µL of NADH solution in a 15 mL conical centrifuge tube. Do not add actin at this point to avoid aggregation and precipitation.\nCreate seven-step serial 1:2 dilutions of NADH for calibration starting from 250 µM.\n\t\nMix 12.3 µL of NADH stock solution with 257.7 µL of myosin buffer in a 1.5 mL microcentrifuge tube.\nAliquot 135 µL of myosin buffer into seven 1.5 mL microcentrifuge tubes.\nTransfer 135 µL of solution from the first tube into the second and mix by pipetting. Repeat until reaching the 7th tube.\nUse the last tube as no-NADH control (buffer only).\nUsing an 8-channel pipette, transfer 20 µL of the NADH calibration solutions into the first row of the assay plate in triplicates.",
    "Add 68 µL of cardiac or 4.2 µL of skeletal muscle myosin II to the enzyme mix. Vortex briefly.\nExcept the first row, dispense 8.4 µL of  the prepared myosin-enzyme mix into each well of the assay plate using an automated dispenser.\nTransfer 100 nL of solutions from the compound plate to the assay plate containing enzyme mix using an automated liquid handling system equipped with a 100 nL pin tool head.\nShake the assay plate for 1 min at room temperature at 1200 rpm using a microplate shaker.\nAdd 4,052 µL of the centrifuged actin solution to the substrate mix. Vortex briefly.\nDispense 11.6 µL of actin-substrate mix into each well of the assay plate (except first row) to start the enzymatic reaction using an automated dispenser.\nShake the assay plate for 1 min at room temperature at 1200 rpm using a microplate shaker.\nCentrifuge the assay plate at 101 x g for 30 s.\nMake sure that the inner temperature of the plate reader has been stabilized at 25 ˚C. Load the plate and shake for another 30 s. This shaking step is necessary to make the shape of the liquid surface similar in each well and allows time for the plate to reach measurement temperature.\nRecord NADH fluorescence for 30 min scanning the plate in 45 s intervals. Use a 380 nm, 10 nm bandwidth excitation filter and a 470 nm, 24 nm bandwidth emission filter in conjunction with a 425 nm cut-off dichroic mirror. Run the measurement in high-concentration mode. Optimize the number of flashes, detector gain, plate dimensions and measurement height before running the assays.",
    "NOTE: Final assay conditions are 300 nM cardiac/20 nM skeletal muscle myosin II, 10 µM actin, 40 U/mL LDH, 200 U/mL PK, 220 µM NADH, 1 mM PEP, 1 mM ATP in a buffer containing 10 mM MOPS (pH = 7.0), 2 mM MgCl2, 0.15 mM EGTA, 0.1 mg/mL BSA, 0.5% (v/v) DMSO and 1 mM DTT. The total volume is 20 µL/well. The highest final compound concentration is 50 µM. 20 µM para-aminoblebbistatin in 0.5% DMSO serves as the positive control and 0.5% DMSO alone is the negative control. All measurements are carried out in triplicates.\n3. Analyzing data\nPlot the observed fluorescence intensity against time for each well.\nPerform simple linear regression to determine the slope and intercept of the fluorescence responses for each well. The slope is proportional to the ATP (NADH) consumption rate, while the intercept is proportional to the NADH concentration at the beginning of the measurement (t = 0 s).\nConstruct a calibration curve for NADH by plotting the intercepts obtained for the first row of the plate against the concentration of NADH. Make sure that the intercepts depend linearly on the NADH concentration.\n\tNOTE: The intercepts estimate the real fluorescence intensities at t = 0 s with much more confidence than the average of the raw fluorescence intensity reads at t ≈ 0 s.\nPerform simple linear regression to obtain the slope and intercept of the NADH calibration line.\n\tNOTE: The intercept describes the fluorescence background signal (no NADH present), while the slope corresponds to the extrapolated/theoretical fluorescence intensity of a 1 M NADH solution in that particular experiment.\nDivide the slope of the fluorescence response obtained for the rest of the wells by the slope of the NADH calibration line to convert fluorescence changes to ATP consumption rates.",
    "Plot the ATP consumption rates against the concentration of the inhibitor.\nTo determine inhibitory constants, use appropriate statistical software to fit the dose-response data to the following quadratic equation corresponding to a simple one-to-one binding equilibrium model:\nimgsrc://cloudfront.jove.com/files/ftp_upload/60017/60017eq01.jpg\n\twhere Y is the ATP consumption rate, Ymin is the ATP consumption rate int the absence of inhibitor, Ymax is the theoretical ATP consumption rate at 100% inhibition, KI is the inhibitory constant, [E]t and [I]t are the total concentration of the enzyme (myosin) and inhibitor, respectively.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}