{
  "id": 8718,
  "origin_website": "Jove",
  "title": "Isolation of Adult Spinal Cord Nuclei for Massively Parallel Single-nucleus RNA Sequencing",
  "procedures": [
    "All animal work was performed in accordance with a protocol approved by the National Institute of Neurological Disorders and Stroke Animal Care and Use Committee. Balanced samples of male and female ICR/CD-1 wild-type mice, between 8 and 12 weeks old, were used for all experiments. Mice should be handled in accordance with local Institutional Animal Care and Use Committee guidelines.\n1. Preparation of Materials and Buffers\nPrepare all buffers the day of use and pre-chill on ice (see Table 1).\n\t\nIf using detergent-mechanical lysis, prepare the detergent lysis buffer (> 500 μL per sample), low sucrose buffer (> 6 mL per sample), sucrose density buffer (> 12.5 mL per sample), and the resuspension solution (> 1 mL).\nIf using hypotonic-mechanical lysis, prepare the hypotonic lysis buffer (> 5 mL per sample), HEB medium (> 5 mL per sample), low sucrose buffer (> 3 mL per sample), sucrose density buffer (>12.5 mL per sample), and the resuspension solution (> 1 mL).\nAdd 25 μL of dithiothreitol (DTT) to 25 mL of the low sucrose buffer and another 25 μL of DTT to 25 mL of the sucrose density gradient buffer just before starting the protocol.\nCover the dissecting surface with aluminum-foil to minimize contamination of the sample with fibers from paper towels or bench protectors, which can clog microfluidic channels used for capturing single nuclei.\nSpray dissecting tools and bench space with an RNase decontamination solution. Additionally, spray the inside of the Dounce homogenizer tube (if using detergent-mechanical cell lysis) and Oak Ridge tube with an RNase decontamination solution. Rinse out the Dounce and Oak Ridge tube with ultrapure, RNase-free water.\nPre-chill all collection tubes (50 mL conical, Oak Ridge) and Dounce homogenizer tubes on ice.\nFire polish a series of Pasteur pipettes (if using hypotonic-mechanical cell lysis).",
    "2. Preparation of the Spinal Cord\nIf using fresh tissue, euthanize the mouse by CO2 inhalation. Following euthanasia, spray the coat of the mouse with 70% ethanol to minimize hair contamination in the sample.\nDecapitate the mouse with sharp, RNase-free surgical scissors. Next, gently lifting the abdominal skin with forceps and make an incision along the length of the body to expose the inner organs.\nEviscerate the mouse by pulling the inner organs from the body cavity using forceps. Do not use paper towels to clean the area or to remove organs as this may introduce contaminants. Using scissors, cut the vertebral column between the L2 and L3 spinal vertebrae.\n\tNOTE: With practice, this step can be achieved in less than 30 seconds.\n\t\nTo eject the spinal cord, fit a 3 mL syringe containing ice-cold PBS with a 25 G ¼ inch needle. Place the tip of the needle into the sacral end of the vertebral column. Use two fingers to pinch the vertebrae to create a tight seal around the tip of the needle and press down on the plunger to eject the spinal cord rostrally. Place the spinal cord in a petri dish with ice-cold PBS.\nAt this point, freeze the tissue and store at -80 °C or use immediately for either detergent-mechanical (Step 3) or hypotonic-mechanical (Step 4) lysis.\nIf using frozen tissue, maintain the tissue on dry ice, proceed to detergent-mechanical (Step 3) or hypotonic-mechanical (Step 4) lysis.\n3. Detergent-Mechanical Cell Lysis\nPlace the lumbar spinal cord in a pre-chilled Dounce homogenizer and add 500 μL pre-chilled detergent lysis buffer.\n\tNOTE: A mouse lumbar spinal cord is 325.5 mg ± 63.9 mg standard error of the mean (SEM, N = 4). 50 mg–1.5 g of tissue can be successfully used.",
    "Dounce with 5 strokes of pestle A (‘loose’ pestle), then 5-10 strokes of pestle B (‘tight’ pestle). Avoid lifting the homogenizer out of the lysis solution in between strokes and avoid introducing bubbles.\nPlace a 40 μm strainer over a pre-chilled 50 mL conical tube and prewet with 1 mL of low sucrose buffer.\nAdd 1 mL of low sucrose buffer to the Dounce homogenizer containing the crude nuclei in the lysis buffer and mix gently by pipetting 2–3 times.\nPass the crude nuclei prep over the 40 μm strainer into the pre-chilled 50 mL conical tube.\nPass an additional 1 mL low sucrose buffer over the 40 μm strainer, bringing the final volume to 3 mL of the low sucrose buffer and 500 μL of the lysis buffer.\nRepeat steps 3.1–3.6 if combining multiple cords, pooling in the same conical tube.\nCentrifuge the sample at 3,200 x g for 10 min at 4 °C. Once the centrifugation is complete, decant the supernatant. Proceed to Step 5.\n4. Hypotonic-mechanical Cell Lysis\nPlace the lumbar spinal cord in 5 mL of the hypotonic lysis buffer in a tissue culture dish. Use the blunt end of spring scissors to bisect the spinal cord, then use spring scissors to cut the cord into 3–4 mm pieces, but do not mince.\n\tNote: 50 mg–1.5 g of tissue can be successfully used.\nIncubate on the ice for 15 min, swirling 2–3 times.\nAdd 5 mL of HEB medium to dilute the hypotonic lysis buffer.\nTriturate the tissue 10 times with a 5 mL serological pipette, or until all of the pieces of the tissue move smoothly through the opening of the pipette.\nTriturate with a series of three fire-polished Pasteur pipettes with progressively narrower diameters (~900–600 μm).",
    "For each pipette, triturate 5-15 times, allow tissue to settle, remove 1–2 mL of supernatant containing dissociated nuclei and pass over a 40 μm strainer into a pre-chilled 50 mL conical tube.\nAfter trituration with the smallest-sized Pasteur pipette, ensure that the homogenate flows smoothly through the pipette tip. Pass the remaining solution over the 40 μm strainer into the 50 mL conical tube.\n\t\tNOTE: The total number of triturations can be adjusted as desired. The meninges of the mouse spinal cord will remain, but it is important to triturate any visible chunks of spinal cord. Pass the remaining homogenate over the 40 μm strainer. Avoid introducing bubbles during trituration.\nCentrifuge the filtered sample at 1,000 x g for 10 min at 4 °C. Once the centrifugation is complete, decant and discard the supernatant. Proceed to Step 5.\n5. Homogenization and Sucrose Density Gradient\nAfter either Step 3 or 4, resuspend the pellet using 3 mL of low sucrose buffer. Gently swirl to remove the pellet from the wall to facilitate the resuspension. Let the sample sit on ice for 2 min and transfer the suspension to an Oak Ridge tube.\nUsing the homogenizer at setting 1, homogenize the nuclei in low sucrose buffer for 15–30 s, keeping the sample on ice.\n\tNOTE: Use 15 s if using one lumbar spinal cord or 30 s if using pooled samples or a whole spinal cord.\nUsing a serological pipette, layer 12.5 mL of density sucrose buffer underneath the low sucrose buffer homogenate, taking care not to create a bubble that disrupts the density layers.\nCentrifuge the tubes at 3,200 x g for 20 min at 4 °C.\nOnce the centrifugation is complete, immediately decant the supernatant in a flicking motion.",
    "NOTE: A residual volume (less than 400 μL) of sucrose buffer can be discarded if desired to produce a lower volume and cleaner final sample, but this residual volume does contain nuclei and can be preserved to maximize nuclei yield.\nUsing 100 μL - 1 mL of resuspension solution, resuspend the nuclei remaining on the wall. Avoid the myelin ‘frown’ that remains with the detergent-based preparation.\nFilter the nuclei through a 30–35 μm pore-size strainer and collect in a pre-chilled tube.\nDetermine the nuclei yield using a hemocytometer to count nuclei under a 10X objective.\n\tNOTE: Trypan blue can be added to visualize nuclei, which should appear blue. Note the amount of cellular debris.\nProceed to either Step 6 or 7.\n6. Massively Parallel snRNA-Sequencing: Academic Platform7\nPerform the massively parallel snRNA sequencing (e.g., Drop-Seq) method as previously described7 with the following modifications:4\nAdjust nuclei to a final concentration of 225 nuclei per μL.\nPrepare barcoded beads at a concentration of 250 beads per μL.\nPrepare the lysis buffer with 0.7% sarkosyl.\nAdjust the flow rates to 35 μL per min for beads, 35 μL per min for nuclei, and 200 μL per min for oil.\n7. Massively parallel snRNA-sequencing: Commercial Platform26\nPerform massively parallel snRNA-sequencing using the commercial platform (e.g., Chromium Single Cell Gene Expression Solution) products according to the manufacturer’s instructions26 with the following modification:\n\t\nFollowing reverse-transcription, add an additional PCR cycle to the calculated number of cycles for cDNA amplification based on the targeted cell recovery to compensate for decreased cDNA from nuclei compared to cells.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}