{
  "id": 19720,
  "origin_website": "Wiley",
  "title": "Isolation, Culture, and Transfection of Melanocytes",
  "procedures": [
    "This protocol describes the primary culture of melanocytes from human skin as well as the maintenance of growing cultures. This technique can be used on skin from around the whole body as well as from donors of different ages. However, skin from much older people may result in a lower yield than that from younger donors. Dispase, a neutral protease isolated from Bacillus polymyxa, is used to cleave the basement membrane between the epidermis and dermis as it is more specific than trypsin and its use results in a greater yield of primary cells. For a more detailed explanation regarding the theoretical basis of this protocol, see Commentary.\nNOTE: This protocol involves working with human tissue and therefore all local biosafety procedures should be followed. Local ethical approval may be required, and relevant guidelines for using human tissue should be adhered to.\nMaterials\nIodine solution (see recipe)\n70% ethanol\nDulbecco's phosphate-buffered saline without calcium or magnesium (CMF-DPBS; e.g., Thermo Fisher, cat. no. 14190094; see Current Protocols, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.774#cpz1774-bib-0005])\n10 µg/ml gentamicin (Sigma, cat. no. G1272) in CMF-DPBS\nSkin sample (surplus postoperative skin or obtained by punch biopsy; >5 mm diameter, best results are obtained with >1 cm2 of skin)\n10 mg/ml dispase II (Sigma, cat no. D4693) in Hank's balanced salt solution (Sigma, cat no. H6648)\n500 µg/ml trypsin/EDTA solution (see recipe)\nRPMI growth medium (see recipe)\nMitogen stocks:\n               \n40 µM TPA (see recipe)\n40 nM CT (see recipe)\n5 µM EDN1 (see recipe)\n5 µg/ml SCF (see recipe)\n125 µg/ml trypsin/EDTA solution (see recipe)\nDimethylsulfoxide (DMSO; Sigma, cat. no. D2650)\nPhenylthiourea stock (PTU; see recipe)\nBiological safety cabinet\n6-well plates (e.g., Thermo Scientific, cat. no. 140675)\nAutomated pipettor with serological pipettes\nSterile fine forceps, blunt\n37°C water bath\n2.5-ml Combitips (Eppendorf, cat. no. 0030089650) and dispenser\nCell culture centrifuge, 4°C",
    "Hemocytometer and cover glass\nCell culture microscope\nP200 and P1000 pipettors with tips\nTissue culture flasks and dishes\n10% CO2 incubator, 37°C\nUngassed incubator, 37°C\n30-ml universal tubes (i.e., skirted tube with a conical bottom) (e.g., Elkay Laboratory Products, cat. no. 500-1000-302)\n2-ml cryotubes\nLiquid nitrogen storage\nPreparation\n1. In a 6-well plate, add to 3 wells, respectively, 5 ml iodine solution, 5 ml 70% ethanol, and 5 ml CMF-DPBS. Add 5 ml 10 µg/ml gentamicin to each of two wells.\n2. Briefly submerge the skin sample in iodine solution, 70% ethanol, then the CMF-DPBS for a few seconds each, and then submerge in each of the two 10 µg/ml gentamicin solutions, each for 10 min.\nIf skin sample is too large, before submerging, cut into smaller pieces (∼1 cm wide) with a surgical scalpel and also remove subcutaneous fat by scraping with the scalpel.\nFor small or thin samples, the iodine and ethanol steps may be too stringent; an alternative is to soak for 10 min in RPMI growth medium containing ten times the normal concentrations of penicillin and streptomycin (i.e., add 1 part penicillin/streptomycin solution (stock solution contains 10,000 U/ml of penicillin and 10,000 µg/ml streptomycin) to 9 parts RPMI medium).\n3. Add 5 ml 10 mg/ml dispase II in Hank's solution to one well of a new 6-well plate, and submerge skin epidermis-side-down overnight at 4°C.\nSeparation of epidermis and dermis\n4. Using suitable forceps (blunt, not to damage the tissue), gently peel away the epidermis from the dermis and place the epidermis in 5 ml 500 µg/ml trypsin/EDTA solution.",
    "Use one pair of forceps to hold the dermis and one to peel the epidermis. Do not mix up the forceps, as this may increase fibroblast contamination from the dermis. Epidermis is more brown and less shiny than dermis. If large sheets of epidermis come off, cut gently into smaller pieces. If parts of the epidermis stay firmly attached, do not attempt to pull, as this will increase the risk of fibroblast contamination. Discard such parts.\nCulturing melanocytes\n5. Incubate epidermis in 500 µg/ml trypsin/EDTA solution in a 37°C water bath for ∼10-15 min.\n6. Disperse the epidermis into a cell suspension by pipetting up and down using a 2.5-ml Combitip attached to a dispenser.\n7. Add 5 ml RPMI growth medium and centrifuge 15 min at 450 × g, 4°C.\n8. Remove supernatant and resuspend the pellet in 5 ml fresh medium.\n9. Count cells using a hemocytometer.\n10. Plate cells at 1.5 × 105 cells/ml (plate 5 ml total volume for a 25-cm2 flask or in general ∼1 ml/5 cm2, depending on the number of cells available), adding 5 µl/ml 40 µM TPA, 5 µl/ml 40 nM CT, 2 µl/ml 5 µM EDN1, and 2 µl/ml 5 µg/ml SCF.\nFinal concentrations are 200 nM TPA, 200 pM CT, 10 nM EDN1, and 10 ng/ml SCF.\n11. Place the culture in a humidified, 37°C, 10% CO2 incubator.\nPropagating melanocyte cultures\n12. Change RPMI growth medium every 3-4 days, adding the same concentrations of mitogens as in step 10.",
    "Keratinocytes are alive initially but fail to grow in this medium. If cells become sparse in the early stages of melanocyte growth, the volume of medium can be reduced, e.g., by half. This is thought to concentrate autocrine growth factors released by the cells. When enough melanocytes are present, the volume of medium can be increased to normal.\n13. When cells are confluent, for subculture, remove medium and wash cells in 0.5 vol CMF-DPBS, where 1 vol is the normal culture volume for the flask or plate. Tilt the container gently around to rinse away serum.\n14. Add 0.5 vol 125 µg/ml trypsin/EDTA solution. Tilt again briefly then remove most of it to leave 0.1 vol. Place in a 37°C ungassed incubator.\n15. When cells are detached, resuspend into fresh medium to give the normal culture volume, with two rinses to remove all cells.\nFor example, if cells were grown in a 25-cm2 (5-ml) flask, resuspend in 2.5 ml RPMI growth medium and transfer to a universal tube, then rinse with 2 ml medium and add this to the universal tube. With the 0.5 ml trypsin-EDTA, this adds up to the 5 ml.\n16. Count cells in triplicate using a hemocytometer. Keep the cell suspension on ice to prevent loss, as melanocytes can quickly start to reattach at room temperature.\n17. Dilute, mix, and replate cells at the required density in fresh medium with mitogens at the same concentration as in step 10.\n3–6 × 104 cells/ml can be used according to growth rate etc.\nFreezing and thawing melanocytes\n18. Freeze cells using cultures approaching confluence as follows: \n         \nTrypsinize as in step 14, and count cells using a hemocytometer.\nCentrifuge cells 7 min at 200 × g, 4°C.\nLabel cryotubes before proceeding to minimize the time cells are in DMSO.",
    "Resuspend cells in previously mixed 7.5% (v/v) DMSO in RPMI growth medium at a total density of 0.5–1 × 106 cells/ml.\nDispense 1-ml aliquots into 2-ml cryotubes and freeze at –80°C in an insulated container before moving into liquid nitrogen for long-term storage.\nFor heavily pigmented cells, add 100-300 µM PTU for a whole passage before freezing, to depigment them.\nKeep cells at least overnight at –80°C before placing in liquid nitrogen but do not keep at –80°C for more than a few days. PTU acts to inhibit melanin synthesis by inhibiting tyrosinase. This can greatly improve viability, as DMSO causes release of toxic melanin intermediates into the cytosol.\n19. Thaw cells quickly as follows:\n         \nPlace the cryotube in a 37°C water bath.\nResuspend by pipetting and transfer cells to a 30-ml universal tube.\nAdd 1 ml RPMI growth medium dropwise with swirling over ∼30 s, then add another 1 ml dropwise over 15 s, and finally 18 ml dropwise over 30 s.\nCentrifuge cells 5 min at 200 × g, 4°C.\nResuspend cells in fresh medium at the desired density (usually 3 × 104 cells/ml in 5 ml total volume per 25 cm2 culture flask, or in general ∼1 ml/5 cm2) with the same concentration of mitogens as in step 10.\nFor well-pigmented cells, also add 100-300 µM PTU for a few days after thawing cells.",
    "This protocol describes the subculture and preparation of mouse keratinocyte feeder cells. The first technique describes the subculture of XB2 mouse keratinocytes, which can be difficult to subculture as they tend to attach very firmly. The XB2 keratinocytes can be grown and subcultured with a view to treating them with mitomycin C to render them mitotically inactive for use as feeder cells. For a more detailed explanation regarding the theoretical basis of this protocol, see Commentary.\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.774#cpz1774-prot-0001])\nXB2 mouse keratinocytes (available from the Functional Genomics Cell Bank at St. George's, University of London; see Internet Resources) growing in culture\n500 µM EDTA solution in CMF-DPBS (Sigma, cat. no. E8008)\n250 µg/ml trypsin/EDTA solution (see recipe)\nDulbecco's Modified Eagle Medium (DMEM) growth medium (see recipe)\nMitomycin C stock (see recipe)\nMaintenance and subculture of XB2 mouse keratinocytes\n1. Thaw XB2 keratinocytes as described in step 19 of Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.774#cpz1774-prot-0001] except use DMEM rather than RPMI growth medium.\n2. Change DMEM growth medium every 3-4 days.\n3. Once ready to subculture, remove medium and wash the cells twice with 500 µM EDTA solution in CMF-DPBS. Use 0.5 vol per wash, where 1 vol is the normal culture volume for the flask or plate, e.g., use 2.5 ml in a 5-ml (25-cm2) flask. Tilt the container gently around to rinse away serum, which inhibits trypsin.\nXB2 cells should be around 80% confluent (i.e., cover 80% of the area of the culture vessel) and still growing. They become very hard to detach at saturation density.\n4. Wash the cells once with 0.5 vol of 250 µg/ml trypsin/EDTA solution and tilt around again. Remove most of this to leave 0.1 vol of solution.",
    "5. Incubate at 37°C (in an ungassed incubator rather than with CO2) until the cells have completely detached.\n6. Resuspend the cells by pipetting in two rinses of fresh DMEM growth medium into a suitable container (e.g., 30-ml universal tube), to make 1 vol of cell suspension, and count using a hemocytometer.\nFor example, if cells were grown in a 25-cm2 flask, resuspend in 2 ml DMEM growth medium and then 2.5 ml DMEM growth medium. The 0.5 ml of trypsin solution makes the total up to the 5 ml volume.\n7. Dilute the required amount of suspension with fresh DMEM growth medium and replate the cells at 3 × 104/ml (plate 5 ml total volume per 25-cm2 flask or in general ∼1 ml/5 cm2 depending on the number of cells available and your requirements, e.g., if preparing feeder cells, plate 35 ml total volume per 175-cm2 flask).\nPreparation of feeder cells\nIn order to prepare feeder cells, the XB2 cells should be ready to subculture, but still growing. They should not be confluent, as this may lead to ineffective treatment with mitomycin C and lead to some of the cells still retaining the capacity to divide. Plate the required volume of cultures (e.g., if you require a large stock of feeder cells, plate cells into 175-cm2 flasks as previously described). It is recommended to make large amounts of vials to allow batch testing. There is no specific limit on passage number for the XB2, but the growing cells should form patches of continuous epithelial pavement. If they start to show a disrupted layer with spindly-looking cells, they should be discarded in favor of a lower passage level.",
    "8. Remove medium and add 0.5 vol fresh DMEM growth medium containing 8 µg/ml mitomycin C. Swirl to mix this with residual old medium.\n9. Incubate for 3-3.5 hr in a 37°C, 10% CO2 incubator.\n10. Remove medium containing mitomycin C, wash once in 0.5 vol DMEM growth medium and subsequently incubate in DMEM growth medium (no mitomycin C) for 10 min in a 37°C, 10% CO2 incubator.\nThis elutes any remaining mitomycin C present.\n11. Subculture as previously described (steps 3-7 of this protocol) and either replate 2 ml per 35-mm dish at 3 × 104/ml for use immediately or freeze 1 ml aliquots of 1 × 106 cells/ml and store in liquid nitrogen for future use. For freezing cells, resuspend as detailed above in steps 3-7 of this protocol, then follow step 18 of Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.774#cpz1774-prot-0001], except use DMEM rather than RPMI growth medium and use 250 µg/ml trypsin/EDTA instead of 125 µg/ml.\nIt is advisable to check each batch to ensure that the mitomycin C treatment has worked by plating 106 treated XB2 cells at 3-5 × 104cells/ml in 5 ml per 25-cm2 flask and checking for at least 2 weeks to make sure no proliferating cell colonies appear.",
    "This protocol describes the primary culture of melanocytes from mouse skin and their subsequent subculture (Sviderskaya et al., 1997[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.774#cpz1774-bib-0024]). There is a requirement for feeder cells, and so Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.774#cpz1774-prot-0002] should be followed prior to this Protocol. To generate immortal melanocyte lines efficiently, it is recommended to cross the required genotype of mouse with Cdkn2a (Ink4a-Arf) null mice, as Cdkn2a null melanocytes do not senesce at all (Sviderskaya et al., 2002[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.774#cpz1774-bib-0025]).\nThis technique can be carried out on either embryonic or newborn skin (of mice up to 3 days old). Older skin is very hard to split because of the hair and contains few melanocytes anyway. It is also hard to split embryonic skin (which is fragile), and this increases the risk of contamination with fibroblasts. Thus, it is preferable to use newborn skin. However, it may be necessary to work with embryonic skin, for example if a mutation you wish to study is lethal to postnatal mice.\nIn contrast to human melanocytes (which require 4 mitogens; TPA, CT, EDN1, and SCF), successful culture of murine melanocytes only requires TPA and CT. For a more detailed explanation regarding the theoretical basis of this protocol, see Commentary.\nNOTE: This protocol involves working with animals and therefore local ethical approval may be required and relevant guidelines for working with animals should be adhered to.\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.774#cpz1774-prot-0001])\nKeratinocyte feeder cells (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.774#cpz1774-prot-0002])\nMouse pups (up to 3 days old) or pregnant mouse\n5 mg/ml trypsin (see recipe)\n250 µg/ml trypsin/EDTA solution (see recipe)\n1 mg/ml soybean trypsin inhibitor (see recipe)\n35-mm culture dishes (e.g., Thermo Scientific, cat. no. 153066)\nReagents and equipment for dissection of pregnant mouse to obtain embryos or to sacrifice the mouse pups (Limaye et al., 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.774#cpz1774-bib-0016])",
    "10-cm culture dishes (e.g., Thermo Scientific, cat. no. 150350)\nTwo pairs of fine forceps (for each skin to be processed)\nLaminar flow hood\nDissecting microscope in culture hood (need sterile atmosphere)\n60-mm (5-ml) culture dishes (e.g., Thermo Scientific, cat. no. 150288)\nTwo curved scalpels (for each skin to be processed)\nSkin preparation\n1. Plate out keratinocyte feeder cells on a 35-mm dish at 5 × 104/ml in RPMI growth medium (2 ml total volume per 35-mm dish), preferably 1 day before carrying out the remainder of this protocol.\nIf you have more than one skin sample, plate out a dish for every skin sample you have.\n2. Sacrifice the mouse pups (or the pregnant mouse in the case of embryos) by a legal method (depending on the country). If using embryos, dissect the pregnant mouse to obtain the embryos (Limaye et al., 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.774#cpz1774-bib-0016]).\nNewborn skin is sterilized by immersing the pup in 70% ethanol for 5-10 s (no more).\nDo not sterilize embryo skin in ethanol; it may kill the cells, and embryos are already sterile, so they can be kept sterile during removal from the uterus. Every step from here on should be performed under sterile conditions.\n3. Wash off the ethanol (or wash the embryos) in CMF-DPBS.\n4. Dissect off the trunk skin in one piece and keep wet in CMF-DPBS.\n5. Transfer to a 10-cm culture dish with enough CMF-DPBS to cover the skin and remove any remaining pieces of muscle using two pairs of fine forceps and a dissecting microscope in a sterile environment.\nIf you have more than one skin sample, use different forceps and dish for every skin to avoid any cross-contamination. Make sure you use the same forceps for the same skin throughout this protocol.\nSplitting the epidermis from the dermis",
    "6. Transfer the skin(s) to individual 30-ml universal tubes containing 5 ml 5 mg/ml trypsin.\nThe 5 ml volume is a guideline. With a particularly large skin sample, make sure there is enough trypsin to cover it.\n7. Incubate at 37°C for ∼1 hr for newborn skin.\nFor embryonic skin, trypsinize on ice for 15 min to 3 hr—it needs to be trypsinized until it will split, and the time for this can be quite variable, so it is best to keep checking to avoid leaving the skin in trypsin for too long.\n8. After the allotted time, transfer the skin to a 10-cm dish containing enough CMF-DPBS to cover the skin.\n9. Using a dissecting microscope and two pairs of fine forceps split off the epidermis from the dermis. If it does not come off easily, do not force but place the skin back into 5 mg/ml trypsin and continue incubation. Remove any pieces of dermis still attached to the epidermis.\nThe epidermis is thin and silvery/white and the dermis is a more whitish layer. Do not force, as this can lead to contamination with fibroblasts.\nCulturing melanocytes\n10. Wash the epidermis in fresh CMF-DPBS and transfer the 10-cm dish to a laminar flow hood.\nAll steps from here on are performed in a flow hood.\n11. Add 100 µl 250 µg/ml trypsin/EDTA solution to the middle of a 60-mm dish.\n12. Prepare 5 ml RPMI growth medium with 5 µg/ml soybean trypsin inhibitor (add from 1 mg/ml stock).\n13. Transfer the epidermis from the CMF-DPBS onto the drop of trypsin/EDTA solution.\nTry to remove as much of the CMF-DPBS from the epidermis as possible before placing onto the drop.\n14. Using two curved scalpels, chop the epidermis finely.",
    "If you have more than one skin sample, use new scalpel blades and a new dish for every sample. Make sure that you remove all pieces of epidermis from the scalpel blades before discarding, to ensure that the majority of the epidermis goes into culture.\n15. Using a serological pipette and the RPMI growth medium with soybean trypsin inhibitor prepared in step 12, suspend and rinse the chopped pieces of epidermis into a 30-ml universal tube.\n16. Mix vigorously three to five times using a 2.5-ml Combitip.\n17. Add 5 µl/ml 40 µM TPA and 5 µl/ml 40 nM CT and mix thoroughly.\nFinal concentrations are 200 nM TPA and 200 pM CT.\n18. Remove the medium from the mitomycin C-treated XB2 keratinocytes (from step 1), plate the full 5 ml epidermal suspension onto these cells, and place in 10% CO2 incubator at 37°C.\nTake care when transferring the cultures to the incubator, as the dish will be very full.\n19. Reduce the amount of medium to 2 ml after 1-2 days (or when changing medium). Initially change medium twice a week (using RPMI growth medium with 200 nM TPA and 200 pM CT).\nSubculture of mouse melanocytes\nThe cells should be subcultured at least every 2 weeks (if sparse), and before reaching confluence, onto fresh mitomycin C-treated XB2 keratinocytes until immortal cells take over the culture. At this stage some lines may not require constant culture with CT; this can be determined empirically by the user, i.e., keep at least two separate cultures and remove the CT from one to compare proliferation and differentiation. The XB2 cells are thawed and plated as in Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.774#cpz1774-prot-0003], step 1, on the required number of dishes or flasks.",
    "20. Remove medium from the melanocyte culture and wash cells in 0.5 vol CMF-DPBS, where 1 vol is the normal culture volume for the flask or plate. Tilt the container gently around to rinse away serum.\n21. Add 0.5 vol 250 µg/ml trypsin/EDTA solution. Tilt again briefly and then remove most of it to leave 0.1 vol. Place in a 37°C ungassed incubator.\n22. When cells are detached, resuspend into fresh medium to give the normal culture volume, with two rinses to remove all cells.\nFor example, if cells were in a 35-mm culture dish, resuspend in 0.8 ml RPMI growth medium, transfer to a sterile tube, then rinse with 1 ml growth medium and add to the tube. With the 0.2 ml trypsin-EDTA, this adds up to the 2 ml.\n23. Count cells in triplicate using a hemocytometer. Keep the cell suspension on ice to prevent loss, as melanocytes can quickly start to reattach at room temperature.\n24. Dilute, mix, and replate cells either at 3-5 × 104 cells/ml (5 ml total volume for 25-cm2 flasks or in general ∼1 ml/5 cm2, depending on the amount of cells available), or (for sparse cultures) at a ratio of 1:1, in fresh medium with mitogens (200 nM TPA and 200 pM CT), onto the mitomycin C-treated XB2 cells.\n25. For freezing and thawing mouse melanocytes, use the method in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.774#cpz1774-prot-0001], steps 18-19, except use 250 µg/ml trypsin/EDTA solution instead of 125 µg/ml. When initially thawing established mouse cell lines, plate 5 ml total volume in a 25-cm2 flask at 3-10 × 104 cells/ml (depending on viability), adding 200 nM TPA but no CT.",
    "Mouse melanocytes (unless null for Cdkn2a) will senesce (stop growing) after only a few weeks. If the senescent cultures are patiently kept, with medium changes, for a few more weeks, immortal cells will often eventually emerge as growing colonies and can be propagated to make a permanent cell line.",
    "This protocol describes how to transfect human melanocytes and melanoma cells in 96-well plates. It uses “reverse transfection,” where the nucleic acid is added to wells before the cells, which gives efficient transfection in these cell types. This protocol is based on a high-throughput system designed to screen the activity of tens to hundreds of different siRNAs. However, the volumes used could be scaled up or down depending on the nature of the experiments. Cell and nuclear staining are used to determine the effects of the transfected siRNA on the cells. A sophisticated plate reader, such as the Thermo Scientific Cellomics ArrayScan VTI HCS Reader, is recommended for capturing the outputs in this high-throughput scenario.\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.774#cpz1774-prot-0001])\nsiRNAs:\n               \nNegative control siRNA—Silencer Select negative control (siRNA #2; Invitrogen, cat. no. 4390846)\nPositive control siRNA—CDC2 siRNA gene solution (Qiagen, cat. no. 1027416 gene ID 983)\nTransfection positive control siRNA—AllStars Hs Cell Death Control siRNA (Qiagen, cat. no. 1027298)\nTest siRNAs—Silencer Select validated or predesigned (inventoried) siRNA (Ambion)\nRNase-free distilled H2O\nRPMI serum-free medium (see recipe)\nLipofectamine 2000 (Invitrogen, cat. no. 11668027)\nHuman melanocyte or melanoma cell suspension (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.774#cpz1774-prot-0001])\nRNase/DNase-free tubes (e.g., Invitrogen, cat. no. AM12400)\nRNase-free filter tips for P20, P200, and P1000 pipettors\n96-well black optical-bottom tissue culture plates (e.g., Greiner Bio-One, cat. no. 655090)\nMultichannel pipettors and reservoirs\nPreparation and storage of siRNA\n1. Resuspend lyophilized siRNAs to 5 µM (5 pmol/µl) in RNase-free water.\nUse RNase-free tips and tubes. Work in an RNase-free environment when handling siRNA stocks.\n2. Prior to storage, aliquot all siRNAs to avoid freeze-thaw cycles and store at −20°C (short-term) and −70°C (long-term).\n3. Create an siRNA master plate.",
    "This will ease the transfer of siRNAs to the experimental plates. Reactions should be performed in triplicate. Create a map of the plate (electronic and hardcopy). See Figure 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.774#cpz1774-fig-0001] for an example of a plate map. Ensure that the plate is well labeled to reduce errors.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/5841d0fa-99c1-4d46-9358-d9621d53e955/cpz1774-fig-0001-m.jpg</p>\nFigure 1\nAn example of a plate map showing six test siRNAs (siRNA a to f) and two control siRNAs. Each siRNA is transfected in triplicate.\nMedium preparation\n4. Prepare complete medium (RPMI growth medium with appropriate mitogens).\nFor human melanocytes: add mitogens as in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.774#cpz1774-prot-0001] (final concentrations 200 nM TPA, 200 pM CT, 10 nM EDN1, and 10 ng/ml SCF).\nFor human melanoma cells: add no mitogens unless specified for the cell line.\nTransfection\n5. Grow cells to ∼80% confluency (i.e., 80% of the culture dish covered and not at saturation density). Trypsinize as for subculture (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.774#cpz1774-prot-0001]) and leave at room temperature.\n6. Mix Lipofectamine 2000 with serum-free medium. Prepare a 100 × master mix in an RNase-DNase-free centrifuge tube containing 30 µl Lipofectamine 2000 in 470 µl serum-free medium for each 96-well plate (0.3 µl Lipofectamine 2000 in 4.7 µl serum-free medium per well). Incubate at room temperature for 5 min.\nEnsure that the master mix is thoroughly mixed. Use a 1000 µl pipette tip and a pipettor (∼10 times).\n7. Add 8.5 µl serum-free medium to each well of a 96-well black optical bottom plate using a multichannel pipettor.\nAdd 40 ml serum-free medium to a solution reservoir. From this, use a multichannel pipettor to add the solution to the experimental plates.\n8. Add 1.5 µl of the required siRNA to each well. Mix using pipettor.",
    "9. Add 5 µl Lipofectamine 2000/serum-free medium to all wells. Mix using pipettor. Incubate for 15 min at room temperature from the last well.\nUse a fresh pipette tip for each column to avoid cross-contamination of siRNAs.\n10. During the 15 min incubation, dilute the cell suspension in complete medium (2.22 × 104/ml in 15 ml complete medium (see step 4) per plate to give 3000 cells/well in 135 µl).\nHigher densities such as 6.66 × 104/ml may be better for normal melanocytes.\nHuman melanoma cells are less sensitive than normal melanocytes, and therefore less cell death caused by transfection is observed with these cells.\n11. After 15 min, add 135 µl cell suspension/well.\n12. Incubate plates at 37°C, 10% CO2 for the required period (typically around 3-7 days, depending on the research question and assay). For immunostaining, fix and permeabilize cells as required, depending on the assay to be used.\nFor example, three fixation methods for cytochemistry or immunostaining of melanocytes and melanoma cells are given by Soo et al. (2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.774#cpz1774-bib-0022])."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}