{
  "id": 10499,
  "origin_website": "Jove",
  "title": "Meso-Scale Particle Image Velocimetry Studies of Neurovascular Flows In Vitro",
  "procedures": [
    "1. ABS-based Sacrificial Mold Fabrication\nDesign an inverse model of the desired tissue phantom using CAD software.\nPrint the model using a 3-D printer with ABS as the building material.\n2. PDMS-based Vascular Phantom Fabrication\nMixing\nMix the PDMS prepolymer base and curing agent in a 10:1 ratio (by weight); a 66 g mixture provides sufficient material for the fabrication of phantoms with volumes up to 50 cm3.\nPlace the mixture in a vacuum desiccator for 60 min to degas and minimize the bubble entrapment. Use cyclic pressurization/depressurization to facilitate bubble rupture.\nCasting\nMount the printed ABS mold on a glass slide using molding putty to seal the interface.\nCarefully pour the PDMS mixture into the mold while trying to minimize bubble entrapment. Lingering bubbles can be manually ruptured using a needle.\nCure the cast phantom at room temperature (25 °C) for at least 24 h.\n\t\tNOTE: At higher temperatures, this process can be accelerated22.\nDemolding\nDissolve the ABS by submerging the phantom in acetone and sonicating for at least 15 min, using powers up to 70 W.\n\t\tCAUTION: Acetone has a high vapor pressure at room temperature and a low flash point. Consequently, always work under a fume hood and away from potential ignition sources. Wear proper personal protective equipment (e.g., goggles or face shield, lab coat, acetone-resistant gloves).\nThoroughly rinse the phantom with isopropyl alcohol and, then, DI water to remove solvent residues.\n\t\tNOTE: PDMS swells upon exposure to acetone; however, the swelling subsides once the phantom is rinsed and dried sufficiently23.\nConfirmation of phantom fidelity using optical microscopy\nUsing an optical microscope with an attached camera and image capture software, capture an image of a critical feature within the phantom under a magnification that maximizes the feature within the field of view.",
    "Capture an image of an appropriate calibration reticle at the same magnification.\nLoad both images into ImageJ by dragging them onto the Toolbar.\nClick on the calibration reticle image to make it active and, then, select the Line tool. Using the mouse, draw a line along a feature of a known distance and select Analyze > Set Scale from the ImageJ menu.\n\t\tNOTE: In the Set Scale window, the field labeled Distance in pixels should be prepopulated with the length of the drawn line in units of pixels.\nEnter the length of the feature in the field labeled Known Distance, and its unit in the field labeled Unit of Length. Check the box labeled Global to apply this calibration factor to all open images.\nMake the image of the phantom critical feature active and use the Line tool to draw a line along a feature of interest.From the ImageJ menu, select Analyze > Measure (or press Ctrl + M) to measure the length of the line.\nCompare the expected value against the value in the column marked Length in the Results window to confirm phantom fidelity.\n3. Mock Blood Solution Formulation\nMix DI water and glycerol in a 60:40 ratio (by volume).\n\tNOTE: A 100 mL volume is sufficient for the in vitro circulatory system described herein.\nAdd 1 mL of 2.5% w/v fluorescent polystyrene bead solution (i.e., tracer particles) to the mock blood solution.\nHomogenize the mixture on a magnetic stir plate at 400 rpm for 10 min.\n4. In Vitro Circulatory System Set-up\nPump set-up\nUse a wire stripper tool to cut off the DC-end plug from the AC-to-DC adapter power source.\nStrip the coating off the power and ground wires and connect them to the input terminal of the pulse width modulation (PWM) voltage regulator.",
    "Connect the power and ground wires from the pump's DC motor to the output terminal of the PWM voltage regulator.\n\t\tNOTE: The PWM's seven-segment display outputs the duty cycle (0% - 100%) used to achieve a variable voltage to the DC motor.\nPump calibration\nPrepare 200 mL of mock blood solution (see section 3).\nPlace tubing from the pump inlet to the beaker holding the mock blood solution.\nPlace tubing from the pump outlet to an empty beaker.\nSelect a desired duty cycle set point (0% - 100%). Press the On button and start a timer.\nStop the timer once the pump has transferred the entire volume of mock blood solution. Use this time to calculate the volumetric flow rate.\nRepeat steps 4.2.1 - 4.2.5 for at least five different duty cycle set points to establish a least-squares regression curve.\n\t\tNOTE: A minimum of three replicate points per duty cycle set point is recommended. This relationship can be used to correlate the desired flow rate to the required PWM duty cycle.\n5. Video Collection\nImage calibration\nDetermine the calibration ratio for the video imaging (see section 2).\nApparatus set-up\nPlace the PDMS phantom on the stage of the fluorescence microscope.\nConnect the phantom to the gear pump and introduce the mock blood solution.\n\t\tNOTE: Optionally, prefill the model with ethanol to facilitate full wetting; then, flush and fill it with the mock blood solution. This may be particularly beneficial for models with smaller vessels and/or blind features.\nSet the pump motor controller for the desired flow rate based on the pump calibration curve.\nRun the pump for 1 - 5 min prior to the experiment to ensure steady-state conditions.",
    "Turn on the external lamp to illuminate the field of view. Select an appropriate filter based on the excitation wavelength of the fluorescent beads.\nAdjust the imaging focal plane to the vessel midplane.\n\t\tNOTE: This can be achieved by using a focal length that maximizes the imaged vessel cross-section (e.g., when using phantoms with circular vessel cross sections); and/or indexing off of a phantom feature designed to facilitate the identification of the vessel mid-plane.\nVideo recording\nSelect the video recording parameters to optimize the signal-to-noise ratio (SNR). Key parameters include exposure time, frame rate, and gain.\n\t\tNOTE: In this protocol, we use a frame rate of 2,000 fps and a gain of 1.0. However, these parameters may vary based on the application (see the discussion section for further details).\nCollect the video and save it in AVI format.\nPhantom clean-up\nIf bead-sticking is observed after an experiment, sonicate the phantom in an aqueous detergent solution using powers up to 70 W.\n6. Image Processing and Data Analysis\nImage preprocessing\nDrag the saved AVI file onto the ImageJ window to import it. Select the box marked Convert to Grayscale.\nFrom the ImageJ menu, select Analyze > Generate Histogram (or press Ctrl + H) to generate a histogram of image pixel intensities. Take note of the mean and standard deviation for the unprocessed image.\n\t\tNOTE: At high frame rates, it is not unusual for the distribution to be skewed heavily toward zero (i.e., no signal).\nFrom the ImageJ menu, select Image > Adjust > Brightness and Contrast (or press Shift + Ctrl + H) to apply a brightness/contrast filter.",
    "On the Brightness and Contrast menu, press the Set button to define the image limits. Set the minimum value to be the mean value plus one standard deviation, and the maximum value to be the maximum intensity of the image (both based on statistics obtained in step 6.1.2).\n\t\tNOTE: This typically eliminates all but the top 10% of the pixel intensities. The number of standard deviations may be varied depending on the desired distribution of the pixel intensities. A custom macro script for performing the intensity capping operation is provided in the Supplemental Materials.\nFrom the ImageJ menu, select Process > Noise > Despeckle to reduce the number of saturated pixels.\n\t\tNOTE: This operation is necessitated by the increased potential for pixel saturation that arises during the optimization of the brightness and contrast, which can produce spurious vectors during subsequent cross-correlation.\nFrom the ImageJ menu, select Process > Filters > Gaussian Blur with a radius of 1.5 to reduce artifacts arising from the occasional removal of illuminated pixels in a 3 x 3 neighborhood by the prior despeckling operation.\nClick on the Polygon tool and, then, click on the image to outline the region of interest (ROI).\nFrom the ImageJ menu, select Edit > Clear Outside to remove sensor noise in locations where no signal is expected (e.g., areas beyond the vessel wall boundary), which can decrease the overall SNR.\nPIV calculation\n\tNOTE: This portion of the protocol employs a third-party PIV plug-in for ImageJ, which relies upon Gaussian peak-fitting to enable an estimation of displacement with subpixel accuracy.\n\t\nFrom the ImageJ menu, select Plugins > Macros > Run… and navigate to the saved macro Supplemental Code 2.ijjm to cross-correlate successive image pairs.",
    "NOTE: The macro proceeds as follows. 1) A cross-correlation of the intensity field within consecutive images is first performed to determine the local displacement of advected tracer particles (i.e., the first image pair consists of the first and second images, the second image pair consists of the second and third images, etc.). 2) A two-step multipass evaluation is then performed with initial and final interrogation window sizes of 256 x 256 pixels and 128 x 128 pixels, respectively. Finally, 3) the macro performs a temporal average to further reduce the appearance of spurious vectors.\nNormalized median test (NMT)\nFrom the ImageJ menu, select Plugins > Macros > Run… and navigate to the saved macro Supplemental Code 3.ijjm to validate the velocity fields via the normalized median test.\n\t\tNOTE: The macro proceeds as follows. 1) Each vector in an instantaneous vector field is first compared to its eight nearest neighbors to compute the median value. 2) The array of residual errors is then calculated as the difference between each neighboring vector and the calculated median. 3) The difference between the vector under investigation and the median neighboring vector value is then normalized by the median of the residuals. 4) This is then compared to a threshold value (typically, 0.2 pixels), which can be varied based on a priori knowledge of noise during the image acquisition. Finally, 5) a temporal average of all validated instantaneous vector fields is performed to produce a composite field, as this has been shown to increase the vector field quality24.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}