{
  "id": 9931,
  "origin_website": "Jove",
  "title": "Identification of Fatty Acids in Bacillus cereus",
  "procedures": [
    "1. Bacterial Cultures\nPrepare a lawn of the bacteria (Bacillus cereus strain ATCC 14579) by spreading 100 µl of an overnight culture of the strain incubated at 30 °C in LB (Luria-Bertani medium), over the surface of a plate of LB agar medium. Incubate the plate overnight at 30 °C.\n2. ECL: Equivalent Chain Length\nCalculate ECL as follows:  imgsrc://cloudfront.jove.com/files/ftp_upload/54960/54960eq1.jpg with:\n\ti, the solute of interest;\n\tn, the carbon number of the straight chain saturated fatty acid methyl ester eluting before solute I;\n\tn+1, the carbon number of the straight chain saturated fatty acid methyl ester eluting after solute I;\n\tRti, Rtn, Rt(n+1) the retention times of the FAME peaks described above.\n\t​NOTE: Obtain the retention times of straight chain saturated fatty acids methyl esters by injection of a mixture of standards (BAME).\n3. FAME Preparation and Analysis\nIn order to obtain lipid fatty acids, harvest bacterial cells by scraping colonies from the agar plate and transfer 40 mg (fresh weight, equivalent to 109 viable cells) of bacteria into a 10 ml glass tube with screw caps and PTFE seals.\nPerform transesterification via the ester link method14,15 detailed below.\n\t\nAdd 5 ml of 0.2 M KOH in methanol to the fresh bacterial cells and incubate at 37 °C for 1 hr. This reaction consists of alkaline methanolysis, breaking the ester link in the lipid and producing fatty acid methyl esters.\nAdd 1 ml of 1 M acetic acid to lower the pH to 7.0. Check the pH with pH test strips.\nAdd 3 ml of hexane to extract FAMEs.\nTransfer supernatant (organic phase) into clean tubes and concentrate by evaporation at room temperature under a continuous flow of nitrogen to obtain approximately 200 µl of extract. Transfer the sample into a GC vial with insert.",
    "Inject extracts into a gas chromatography-mass spectrometry (GC-MS) system.\n4. GC/MS Conditions\nInject FAME samples into a GC-MS instrument equipped with a capillary column ZB-WAX (length, 30 m; diameter, 0.25 mm; film thickness, 0.25 µm).\nSet the injection port (in splitless mode) temperature to 250 °C. Use helium as a carrier gas, with a linear velocity of 37 cm/sec. Hold the oven temperature at 50 °C for 1 min, increase to 190 °C at a rate of 20 °C/min, and increase further to a final temperature of 230 °C at a rate of 2 °C/min.\nFor the MS, record the mass spectra by electron ionization (EI) at 70 eV, and set the acquisition of the total ion current between 50 and 400 atomic mass units (amu) (2 scans/sec).\nWhen required, inject DMOX and picolinyl derivatives under the same condition except the temperature program oven as follows:\n\tDMOX: 50 °C (1 min), 20 °C/min until 210 °C and 2 °C/min until 240 °C (5 min);\n\tPicolinyl: 6 °C (1 min), 20 °C/min until 220 °C and 2 °C/min until 250 °C (20 min).\n5. Picolinyl Ester Preparation from FAME16\nEvaporate the FAME extract from Section 3 with a flow of nitrogen (at least 10 mg dry material) and dissolve in 1 ml of dry dichloromethane.\nPrepare a 1.0 M solution of potassium tert-butoxide in tetrahydrofuran.\nAdd the FAME extract and 0.2 ml 3-pyridinemethanol to 0.1 ml of solution made in step 5.2.\nHeat the solution at 40 °C for 30 min in a closed vial.\nAfter cooling to room temperature, add purified deionized water (2 ml, see Materials Table) and hexane (4 ml). Mix with a vortex, allow phase to separate, and collect the organic phase.",
    "Dry it by adding anhydrous sodium sulfate until the organic phase is perfectly clear. Transfer it into a clean tube. Then evaporate to 200 µl. Transfer the sample into a GC vial with insert.\n6. DMOX Preparation from FAME17\nEvaporate the FAME extract from Section 3 with a flow of nitrogen (at least 10 mg dry material).\nTo the FAME dry extract, add 250 mg of 2-amino-2-methyl-1-propanol. Flush the vessel with nitrogen, add a stopper, and place it in a heating block overnight at 190 °C.\nAfter cooling to room temperature, add 3 ml dichloromethane to the tube, and 5 ml purified deionized water (See Materials Table).\nShake for phase separation and then remove the aqueous phase.\nWash the organic phase with 5 ml water. Shake for phase separation and then remove the aqueous phase.\nDry by adding anhydrous sodium sulfate until the organic phase is perfectly clear and transfer it into a clean tube. Evaporate under a stream of nitrogen until reaching a volume of 200 µl. Transfer the sample into a GC vial with insert.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}