{
  "id": 8774,
  "origin_website": "Jove",
  "title": "Ex Vivo Calcium Imaging for Visualizing Brain Responses to Endocrine Signaling in Drosophila",
  "procedures": [
    "1. Preparation of Larval Brain Explants\nMake an imaging chamber.\n\tNOTE: Stable recording requires that the brain explants be tethered. Here, a low-cost, hand-made imaging chamber is used in the Ca2+ imaging system.\n\t\nUsing forceps, scratch the bottom center of a plastic culture dish (35 mm x 10 mm) to create a dent for the ventral ganglion of the larval brain making mounting easier (step 1.3, Figure 1).\nWith a toothpick, place a small drop of superglue on either side of the dent and attach a tungsten rod (0.125 mm diameter, 6 to 7 mm length) to the glue.\nUsing a small piece of putty-like reusable adhesive, make a circular wall (10 mm in diameter and 3 mm high) surrounding the dent (Figure 1).\n\t\tNOTE: The space inside the wall will be later filled with phosphate buffered saline (PBS; 0.14 M NaCl, 0.0027 M KCl, 0.01 M PO43-, pH 7.4 ± 0.05 at 25 °C).\nAnimal preparation\n\tNOTE: For calcium imaging, a calcium indicator, GCaMP6s, is expressed in the cell type of interest, which is commonly achieved using combinations of tissue-specific GAL4 and UAS-GCaMP6s. To ensure that the signal is mediated through the candidate receptor, GCaMP6s is also expressed in a mutant defective in the receptor.\n\t\nWhen experimental comparisons for different genotypes such as wild type and mutants are required, age match test larvae to avoid GCaMP6 expression level variations and physiological differences due to developmental stages.\nKeep parental flies (30 flies for each sex) in a culture vial containing standard fly food for 8 h to allow egg-laying on the surface of the food. Culture larvae in mass under a 12-h light-dark cycle at 25 °C and 60-70 % relative humidity.\nDissection of the larval brain",
    "At 90-120 h after egg laying (AEL), collect larvae and wash them at least 3 times with distilled water to remove adherent food debris.\nPlace a larva on a square 1.5-inch watch glass filled with ice cold PBS.\n\t\tNOTE: The next two steps are carried out in this watch glass under the dissecting microscope.\nUse forceps to gently grab the middle part of the larva. Use another forceps to grab the mouth hooks and pull the mouth hooks gently to separate the anterior part of the larva containing the brain from the rest of the body.\n\t\tNOTE: Alternatively, surgical scissors can be used.\nHold the anterior tip by forceps and turn the larva inside out. Remove extraneous tissue attached to the brain, such as imaginal disks, fat bodies, and ring gland. Gently separate the brain from the mouthparts.\nApply 200 µL of PBS to the inside of the ring made of the putty-like reusable adhesive in the imaging chamber. Gently suck the dissected brain with PBS into a Pasteur pipette, and then transfer it into the imaging chamber.\nSetting the brain into the imaging chamber\n\t\nUse forceps to grab muscle fibers extending from the ventral ganglia. Insert the brain gently into the dent underneath the tungsten wire.\nUsing another forceps, pull the tungsten wire slightly up to place the brain at the correct position for imaging (Figure 1).\n2. Acquisition of Ca2+ Fluorescence Images",
    "NOTE: Brain explants immersed in PBS are imaged using a fluorescence microscope equipped with a 20X water-immersion objective lens (N.A. = 0.5). PBS does not activate cells in the brain. If Z-axis images are needed, the objective lens is mounted with a piezoelectric-activated lens mover. A spinning disc confocal head is used to enhance the time resolution. For low-light imaging, an electron multiplying charge-coupled device camera is mounted on the microscope. The imaging of GCaMP6s fluorescence (excitation/emission: 488/509 nm) requires a 488-nm laser for excitation with a dichroic beam splitter and an emission filter (e.g., 528 ± 38 nm band bandpass filter).\nPlace the imaging chamber containing the brain explant under the microscope.\nLower the objective lens until it touches the PBS. Under bright-field illumination, position the brain and bring it into focus. Switch to fluorescent light and adjust the focus on the GCaMP6s-labeled cells.\n\tNOTE: The basal green fluorescence of the GCaMP6s should be visible.\nStart acquisition at 250 ms/frame at a resolution of 512 × 512 pixels in water-cooled mode using the appropriate acquisition software (e.g., µManager). Adjust the exposure time to obtain fluorescence values within the dynamic range of the CCD camera, but not lower than 1000 (arbitrary units), with 16-bit images (dynamic range 0-65,535).",
    "NOTE: A low exposure time should be used to minimize photo-bleaching of the GCaMP6s. Exposure time should be optimized in each experiment as it depends on the expression levels of GCaMP6 and the sensitivity of the detection system. It was 100 ms in our experiment using dilp2>GCaMP6s. When z-sections are required for a given imaging depth, several z-section images can be acquired depending on the exposure time and frame intervals. If the camera has enough spatial resolution, the binning size (number of registers on the chip that will be binned into one digital pixel) should be increased to reduce the exposure time.\nOnce imaging parameters are determined, take images for 1 min before peptide administration to detect baseline signal intensities (F0).\nApply the test peptide; for this, dissolve 100 µL of peptide solution in PBS and pipette it directly into the larval bath to yield an optimal concentration.\n\tNOTE: The peptide solution should be injected slowly (e.g., flow rate 20 µL/s) into the bath solution using a pipette. Unrelated synthetic peptide dissolved in PBS is used as a negative control.\nRecord the GCaMP6s emission for a few minutes.\n3. Data Analysis\nNote: Imaging data are analyzed offline with the ImageJ. During the time-lapse imaging, pipetting causes the larval brain to move. Therefore, positional aberrations of the serial images should be corrected before analysis. The correction can be performed using an ImageJ plug-in, TurboReg as follows.\nOpen the analysis software and use the first frame (before peptide application) as a reference image.\nSelect Plugins | Registration | TurboReg.\nChoose the serial image file as the Source and the reference image as the Target.\nCheck Rigid Body (parallel displacement and rotation of images) and Accurate (\"Fast\" is coarse but fast analysis instead) for the processing method and quality, respectively.",
    "Click Batch to start the image processing.\nSelect multiple regions of interest (ROIs) by using Analyze | Tools | ROI Manager in ImageJ.\nMeasure the pixel intensity by clicking More | Multi Measure | OK in the ROI Manager window.\nCalculate ΔF/F0 = (F - F0)/F0, where F is the ROI intensity at the time of the stimulus, and F0 is the intensity at a time window immediately before a particular experimental event (e.g., 30 frames preceding the stimulus onset).\nRepeat the experiment using multiple brain samples, conducting statistical processing to obtain the mean and standard error of the mean (SEM) at each time point.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}