{
  "id": 1100,
  "origin_website": "Nature",
  "title": "Western blot analysis of proteins expressed in yeast",
  "procedures": [
    "Sample collection\n1. Collect 5x107 cells from the exponentially growing yeast culture\n  \n2. Centrifuge the cells at 2300xg for 2 min. Discard the supernatant\n  \n3. Wash in 1ml of distilled H2O and pass into an eppendorf\n  \n4. Centrifuge at 2300xg for 2 min. Remove the supernatant with the vacuum.\n  *Freeze the cells at -20°C if the protocol will be continued the next day.\nProtein extraction with NaOH\n5. Add 100μL of distilled H2O to resuspend the cell pellet. Then add 100μL of 0.2M NaOH \\(this treatment disrupts the cell wall) and vortex\n  \n6. Incubate the sample at room temperature for 5-10 min\n  \n7. Centrifuge at 13400xg for 1 min. Remove the supernatant with a vacuum pump\n  \n8. Add 50μL of the 2X SDS-PAGE sample solvent and vortex until to resuspend\n   \n9. Place the samples on the thermoblock at 95°C for 5 min\n  \n10. Centrifuge at 800xg for 10 min at 4°C\n  \n11. Carefully collect the supernatant \\(protein extract) – Do not touch the pellet- and pass it into a new eppendorf. Keep these eppendorfs on ice or at -20°C if the protocol will be continued the next day \n  Sample normalization\n12. Normalization of the samples is performed based on a Bradford assay\n        Each eppendorf should contain:\n0.5μL of the protein sample to be quantified\n800μL distilled H2O\n200μL Protein Assay Dye Reagent\n13. Leave the samples for 5 min at room temperature\n  \n14. Measure absorbance at A595. \n  \n15. Equivalent amount of each protein sample is loaded into PAGE- gel based on this measurement\n  \nElectrophoresis\n16. Prepare the SDS-PAGE polyacrylamide gels and place them in the electrophoresis system \n  \n17. Run the electrophoresis at 100V for 2 h approximately depending on the migration you need \n  \nMembrane Transfer\n18. Take a tray and pour Transfer Buffer",
    "19. Place the plastic holder required to make the membrane sandwich\n  \n20. For a wet-BioRad transfer system, place a nitrocellulose membrane in contact with the acrylamide gel between 2 filter papers on top and bottom making sure all have been bathed in transfer buffer. To avoid bubbles being trapped, you may press down with a glass rod. Close the sandwich\n  \n21. Place the sandwich on the correct direction in the sandwich support. Place the whole apparatus into the transfer system. Ensure to place some ice blocks to avoid over-heating. Fill the container with transfer buffer\n  \n22. Set the voltage at 100V and run for 45 min\n  \nProtein Detection\n23. Wash the membrane with TBS-T buffer \\(and place it with agitation)\n  \n24. Incubate with the blocking agent for 1h\n  \n25. Discard the blocking agent and pour the primary antibody mixture onto the membrane. Incubate the membrane with the primary antibody overnight\n  \n26. Prepare the secondary antibody mixture with the corresponding dilution required\n  \n27. Discard the primary antibody mixture. Wash the membranes 3 x 15 min with TBS-T\n  \n28. Discard TBS-T and add the secondary antibody. Incubate the membranes with the secondary antibody for 1h\n  \n29. Discard the secondary antibody and again, wash the membranes 3 x 15 min with TBS-T\n  \n30. Blots are developed using the Supersignal West Femto Maximum Sensitivity Substrate \\(Thermo Scientific). Bands are observed in a ImageQuant™ LAS 4000mini biomolecular imager \\(GE Healthcare).\n  \nPRIMARY ANTIBODY  SECONDARY ANTIBODY\nMonoclonal anti-HA peroxidase 3F10 antibody \n\\(Roche Diagnostics, 12013819001)\nDiluted 1:5000 Not required\nMonoclonal anti-c-myc 9E10 antibody \n\\(Roche Diagnostics, 1667149) \nDiluted 1:5000 Goat Anti-mouse IgG \\(H+L) \nHorseradish Peroxidase conjugate  \n\\(170-6516, Pierce Antibody, Thermo Scientific) Diluted 1:20000\nMonoclonal anti-GFP \n\\(Roche Diagnostics, 11814460001) \nDiluted 1:5000 Goat Anti-mouse IgG \\(H+L) \nHorseradish Peroxidase conjugate  \n\\(170-6516, Pierce Antibody, Thermo Scientific) Diluted 1:20000\nMonoclonal anti-FLAG M2 \n\\(Sigma-Aldrich, F3165)",
    "Diluted 1:10000 Goat Anti-mouse IgG \\(H+L) \nHorseradish Peroxidase conjugate  \n\\(170-6516, Pierce Antibody, Thermo Scientific) Diluted 1:20000\nMonoclonal anti Cdc2 p34 \\(PSTAIRE) \n\\(Santa Cruz Biotechnology Inc. SC-53) \nDiluted 1:2000 Goat Anti-rabbit IgG \\(H+L) \nHorseradish Peroxidase conjugate  \n\\(31460, Pierce Antibody, Thermo Scientific) \nDiluted 1:20000"
  ],
  "subjectAreas": [
    "Biochemistry",
    "Cell Biology",
    "Computational Biology And Bioinformatics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}