{
  "id": 10231,
  "origin_website": "Jove",
  "title": "Cultivating a Three-dimensional Reconstructed Human Epidermis at a Large Scale",
  "procedures": [
    "Review and adhere to national and international ethical considerations and conditions related to the use of human tissues or cells before planning and executing any research activity involving this protocol.\nNOTE: All steps of this protocol must be carried out in aseptic conditions. Biosafety Level 2 practices are the minimum requirement for the cultivation of RhEs. All necessary safety precautions must be taken when handling the chemicals/reagents described in this protocol.\n1. Preparation of cell culture media\nNOTE: There are three different types of serum-free culture media used for the cultivation of RhEs (Table 1): (i) the basal medium with low calcium level (60 µM Ca2+) used for the 2D culture of NHEKs; (ii) the submerged medium with high calcium level (1.5 mM Ca2+) used for the seeding of NHEKs into the cell culture insert system; and (iii) the air-liquid interface (ALI) medium with high calcium level (1.5 mM Ca2+), ascorbic acid, and keratinocyte growth factor (KGF).\ntable:\n﻿0,1,2\nMedium,Medium information,Required quantity\nBasal medium,Keratinocyte growth medium,36 mL/24 wells\nBasal medium,+ 1 % [v/v] HKGS,36 mL/24 wells\nBasal medium,+ 1 % [v/v] 100x antibiotic-antimycotic,36 mL/24 wells\nSubmerged medium,Keratinocyte growth medium,36 mL/24 wells\nSubmerged medium,+ 1 % [v/v] HKGS,36 mL/24 wells\nSubmerged medium,+ 1 % [v/v] 100x antibiotic-antimycotic,36 mL/24 wells\nSubmerged medium,+ 1.5 mM Ca2+,36 mL/24 wells\nAir-liquid interface medium,Keratinocyte growth medium,216 mL/24 wells\nAir-liquid interface medium,+ 1 % [v/v] HKGS,216 mL/24 wells\nAir-liquid interface medium,+ 1 % [v/v] 100x antibiotic-antimycotic,216 mL/24 wells\nAir-liquid interface medium,+ 1.5 mM Ca2+,216 mL/24 wells\nAir-liquid interface medium,+ 50 µg/mL ascorbic acid,216 mL/24 wells\nAir-liquid interface medium,+ 10 ng/mL keratinocyte growth factor,216 mL/24 wells\nTable 1. Summary table of the different culture media used to cultivate RhEs. List of different culture media with supplements.\nPrepare the basal medium.",
    "Supplement the bottle of 500 mL of keratinocyte growth medium (Table of Materials) with 5 mL of human keratinocyte growth supplements (HKGS) in order to reach final concentrations of 0.2% [v/v] bovine pituitary extract (BPE), 0.2 ng/mL human recombinant epidermal growth factor (EGF), 0.18 µg/mL hydrocortisone, 5 µg/mL bovine transferrin, and 0.01 µg/mL of recombinant human insulin-like growth factor-I (IGF-I).\nAdd 5 mL of 100x antibiotic-antimycotic solution containing 10,000 units/mL of penicillin, 10,000 µg/mL of streptomycin, and 25 µg/mL of amphotericin B.\nPrepare the submerged medium.\n\t\nSupplement the bottle of 500 mL of keratinocyte growth medium (Table of Materials) with 5 mL of HKGS in order to reach final concentrations of 0.2% [v/v] BPE, 0.2 ng/mL human recombinant EGF, 0.18 µg/mL hydrocortisone, 5 µg/mL bovine transferrin, and 0.01 µg/mL of human recombinant IGF-I.\nAdd 5 mL of 100x antibiotic-antimycotic solution.\nAdd 5 mL of a 0.144 M CaCl2 (calcium chloride) stock solution to reach a final concentration of 1.5 mM Ca2+.\n\t\tNOTE: The calcium concentration is already increased during the submerged phase to stimulate the differentiation of the keratinocytes and initiate the stratification process49.\nPrepare the air-liquid interface (ALI) medium.\n\t\nSupplement one bottle of 500 mL of keratinocyte growth medium (Table of Materials) with 5 mL of HKGS in order to reach final concentrations of 0.2% [v/v] BPE, 0.2 ng/mL human recombinant EGF, 0.18 µg/mL hydrocortisone, 5 µg/mL bovine transferrin, and 0.01 µg/mL of human recombinant IGF-I.\nAdd 5 mL of 100x antibiotic-antimycotic solution.\nAdd 5 mL of a 0.144 M CaCl2 stock solution to reach a final concentration of 1.5 mM Ca2+.\nAdd 1 mL of a 25 mg/mL ascorbic acid stock solution to reach a final concentration of 50 µg/mL ascorbic acid.",
    "Add 50 µL of a 100 µg/mL KGF in 1% [w/v] bovine serum albumin in phosphate-buffered saline (PBS) stock solution to reach a final concentration of 10 ng/mL KGF.\n\t\t​NOTE: Since ascorbic acid is sensitive to oxidation, it is recommended to use a stable ascorbic acid-derivative, such as magnesium l-ascorbyl-2-phosphate59 or L-ascorbic acid 2-phosphate sesquimagnesium60. If ascorbic acid is used, it is recommended to freshly supplement the ALI medium with ascorbic acid before each refresh.\n2. Culture of NHEKs\nNOTE: Since primary human keratinocytes remain proliferative upon their fourth or fifth passage61, NHEKs in their third passage are used for the cultivation of RhEs. Primary keratinocytes should be handled very carefully due to their high sensitivity. Careful and slow pipetting of cell suspensions at any time is very important, to not disturb the condition of the cells.\nThaw a vial with 1 x 106 cryopreserved NHEKs in a water bath at 37 °C, by submerging part of the vial in the water. Incubate the vial for 1-2 minutes in the water bath, until only a small sliver of ice is visible.\n\tCAUTION: Do not submerge the whole vial in the water bath to avoid contaminations. Do not thaw the cells longer than 2 minutes; this can reduce the cell viability. Wipe the vial with a 70% ethanol solution before transferring the tube into the laminar hood.\nResuspend the cells very carefully, by pipetting up and down 2-3 times. Transfer the cell suspension into two T75 flasks containing a total of 15 mL of pre-warmed thawing medium, resulting in a seeding density of 6.7 x 104 cells/cm2.\n\tNOTE: For the first two passages and the thawing of cryopreserved NHEKs, cell culture medium is used according to the supplier's recommendations.",
    "Place the flasks into the cell culture incubator (37 °C, 5% CO2, and 95% relative humidity (RH)).\nAfter approximately 24 hours, replace the thawing medium by the basal medium to remove dimethyl sulfoxide (DMSO) from the keratinocyte freezing solution.\nRefresh the basal medium every two days.\nAfter 4-6 days of cultivation, the cells should be around 80% confluent and ready for seeding in inserts for the cultivation of RhEs.\n\t​NOTE: Keratinocytes should be grown to maximum 80% confluence to preserve their proliferative capacity62. The number of cells to be thawed must take into consideration several parameters, such as the cell passage number, the cell viability upon thawing, the seeding efficiency as well as the doubling time.\n3. Seeding of NHEKs\nNOTE: This protocol is designed for use within a 24-well carrier plate format. If other plate formats are required (e.g., 12-well or 6-well format), optimizations in the seeding density and medium volume should be considered. Figure 1 summarizes a proposed timeline for RhE cultivation and shows the cultivation conditions.\nimgsrc://cloudfront.jove.com/files/ftp_upload/61802/61802fig1v4.jpg\nFigure 1: Schematic timeline of the reconstitution protocol. Presentation of the RhE model preparation, cultivation process, and application (exposure to chemical substance). The scheme includes the appropriate cell culture media types for each step. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61802/61802fig1v4large.jpg]\nPre-fill 24-well plates with 1.5 mL of submerged medium, ideally using a dispenser pipette.\nRemove the basal medium from the T75 flasks used for the culture of the NHEKs.\nRinse the cells by adding 5 mL of pre-warmed PBS to each T75 flask.\nRemove PBS from the flasks.\n\tNOTE: This step is crucial, since the medium contains proteins and calcium that will inhibit the trypsin activity.",
    "Add 2-3 mL of pre-warmed 0.05% [v/v] trypsin/ethylene diamine tetra acetic acid (EDTA) to each T75 flask. Make sure that the trypsin solution is equally distributed on the cell culture area of the flask.\n\tCAUTION: The 2 mL volume is based on the 80% confluence mentioned above. Use 3 mL for flasks with a higher confluency.\nPlace the flasks for 4 minutes in the cell culture incubator (37 °C, 5% CO2, and 95% RH). Check whether the cells detach using the microscope at a 10x magnification. Rap the flask against the palm of the hand to help the cells release from the surface of the flask. Detached cells can be observed as rounded cells floating in the trypsin solution.\n\tCAUTION: Do not incubate the cells in trypsin for longer than 6 minutes. Over-trypsinization can damage the cells and decrease their adherence63.\nOnce all the cells are detached, add an equal volume (i.e., 2-3 mL) of pre-warmed trypsin inhibitor to each T75 flask.\nTransfer the cell suspension from the flasks to a centrifuge tube.\nRinse the flasks with 5 mL of pre-warmed PBS and transfer it to the centrifuge tube containing the cell suspension.\n\tNOTE: Make sure that most of the cells are collected by checking the number of residual cells in the flasks under the microscope. The surface of the flask should be 95% empty. If this is not the case it is possible to repeat the trypsinization step (3.3-3.9). Note however that re-trypsinization should be avoided.\nCentrifuge the harvested cells at 400 x g for 5 min.\nCarefully discard most of the supernatant, leaving approximately 100-200 µL in the tube.\n\tCAUTION: Do not aspirate the pellet during this procedure.",
    "Gently resuspend the pellet of cells in a low volume of submerged medium, pipette up and down 5-10 times to ensure a uniform cell suspension. Start with a low volume (i.e., 500 µL) to avoid the formation of cell aggregates and add up to 1 mL of submerged medium in total per initial T75 flask.\n\tNOTE: Gently flick the tube with fingers to carefully dissolve a part of the cell pellet in the supernatant.\nCount the cells in the suspension using the trypan blue exclusion method.\n\t\nDilute 0.4% [v/v] trypan blue stain and the cell suspension in a 1:1 ratio, by adding 10 µL of 0.4% [v/v] trypan blue stain to 10 µL of cell suspension. Add 10 µL of the solution to a counting slide. Measure the cell count immediately after mixing the cell suspension with trypan blue, since trypan blue starts to decrease cell viability after exposure longer than 1 min65.\n\t\t​CAUTION: Trypan blue was shown to be a potential mutagen, carcinogen, and teratogen64. Handle the dye with care and dispose of the waste safely according to local laboratory regulations.\n\t\tNOTE: An alternative approach to the use of trypan blue is the non-hazardous dye Erythrosin B66.\nDilute the cell suspension with additional submerged medium to reach a concentration of 3.525 x 105 cells/mL in submerged medium by adding the volume V2 as shown in equation 1:\nimgsrc://cloudfront.jove.com/files/ftp_upload/61802/61802eq01.jpg\n\tC1 = counted cell concentration in the cell suspension obtained in 3.12 (cells/mL)\n\tV1 = volume used to resuspend the pellet of cells in 3.12 (mL)\n\tC2 = targeted cell concentration in the suspension (i.e., 3.525 x 105 cells/mL)\n\tV2 = volume to be added to reach the targeted cell concentration (mL)",
    "NOTE: The surface area of the recommended culture insert is 0.47 cm2; therefore, the corresponding seeding density is 3.75 x 105 cells/cm2.\nPerform a second cell count (C3) of the diluted solution obtained in step 3.14. Use equation 2 to calculate the cell suspension volume (V4) to be seeded into the culture insert:\nimgsrc://cloudfront.jove.com/files/ftp_upload/61802/61902eq02.jpg\n\tC3 = targeted cell concentration in the suspension (i.e., 3.525 x 105 cells/mL)\n\tV3 = targeted volume of the cell suspension to be seeded in the culture insert (i.e., 0.5 mL)\n\tC4 = counted cell concentration in the diluted suspension obtained in 3.14 (cells/mL)\n\tV4 = actual volume of the cell suspension to be seeded in the culture insert (mL)\nHang the 24 cell culture inserts in the highest position of the recommended carrier plate and transfer the carrier plate to the 24-well plate pre-filled with submerged medium (cf. 3.1).\n\tCAUTION: When transferring the carrier plate to the multi-well plate, ensure that no air bubbles are trapped between the insert membrane and the submerged medium from the basal compartment, as this will affect the feeding of the cells and ultimately compromise the RhE viability and morphology.\nAdd the determined volume V4 (from equation 2) of the cell suspension to each insert.\n\tNOTE: It is recommended to use the reverse pipetting technique to accurately dispense the cell suspension to the culture inserts.\n\tCAUTION: Make sure not to damage the membrane when dispensing the cell suspension into the culture insert. A precaution is to dispense the cell suspension along the wall of the insert system without touching the surface of the membrane.\nAfter seeding, incubate the 24-well plates for 10-15 min at room temperature, to overcome an edge effect (i.e., non-uniform temperature distribution between all wells67). Do not move the plates during this time.",
    "Transfer the plates to the cell culture incubator (37 °C, 5% CO2, and 95% RH). The cells are maintained in submerged conditions for three days.\n\t​NOTE: To avoid tissue variability, do not stack the plates in the incubator after seeding to make sure that each insert receives the same amount of heat. After three days (i.e., during ALI cultivation), stacking of plates is possible.\n4. Cultivation at Air-Liquid Interface\nAfter a three-day incubation in the cell culture incubator (37 °C, 5% CO2, and 95% RH), expose the cells that have adhered to the membrane surface to the ALI by removing the submerged medium from the apical compartment preferably using an aspiration system and a glass Pasteur pipette.\n\tNOTE: Alternatively, the submerged medium from the apical compartment can be removed with a manual micropipette.\nFill new 24-well plates with 1.5 mL of fresh pre-warmed ALI medium and transfer the carrier plates with the culture inserts to the new multi-well plates.\nTransfer the multi-well plates back to the cell culture incubator (37 °C, 5% CO2, and 95% RH).\nRefresh the ALI medium every 2-3 days for 14 days.\nPerform the refresh in two steps: 1) prepare a new plate containing 1.5 mL/well of fresh pre-warmed ALI medium and 2) transfer the carrier plate to the new plate.\n\tCAUTION: During the entire reconstitution procedure it is best not to remove the lid covering the carrier plate to keep the RhEs protected from potential contamination.",
    "NOTE: The ALI step is crucial for the development of a stratified epidermal model as it allows terminal differentiation of the keratinocytes68. After going to ALI, a visual control of the inserts is required, to check whether there are 'leaky tissues': medium droplets on the tissue surface coming from the basolateral compartment. If the leakage happens at ALI day 3, gently remove the medium from the culture insert without touching the surface of the tissue. If the leakage persists, it is recommended to discard leaking tissues as it is an indication that there is no correct barrier formation in the RhE model.\nAt the end of the reconstitution process, the tissues can be exposed to various stressors to induce for example oxidative stress or inflammation. In parallel, they can be treated with chemical compounds or cosmetic ingredients. NOTE: During the exposure/treatment, tissues are usually maintained in submerged medium starting from ALI D14. When tissues are expected to be exposed/treated for a long period of time (i.e., 48-72 hours), it is recommended (i) to start the exposure/treatment earlier in the ALI cultivation process, such as D7-D9, to avoid the thinning of the viable layers and the thickening of the SC, and (ii) to incubate the tissues in ALI medium, to keep stimulating cell proliferation. \nFor RhE harvesting, collect the tissues and cell culture medium at the timepoint of interest for histological analysis, viability assays, protein/RNA extraction, and enzyme-linked immunosorbent assays (ELISAs)."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}