{
  "id": 5247,
  "origin_website": "Bio",
  "title": "Analysis of Phagosomal Antigen Degradation by Flow Organellocytometry",
  "procedures": [
    "Preparation of antigen-coupled particles Note: Estimate the number of cells, which will be used for this assay, in advance to prepare a sufficient amount of particles coupled to OVA the day before the experiment. The stock suspension of 3 μm microspheres contains 1.68 x 109 particles/ml.   Example: Estimate the amount of cells you will harvest based on the amount of dishes in culture (for example 20 x 106 cells in total from four 145 mm dishes of BMDC). Multiply this number by 10 (the amount of beads provided per cell) and divide by the concentration of beads (1.68 x 109 particles/ml).                    imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161110/20161110175929_6611.jpg   Vortex suspension of amine-modified polystyrene microspheres thoroughly and distribute into 2 ml tubes (max. 200 μl/tube).   Add 1.6 ml PBS to each tube, vortex and spin for 3 min at 16,000 x g at 4 °C.   Discard supernatant, resuspend the pellet in 1.8 ml PBS and vortex. Spin again.    Discard supernatant and resuspend the pellet in 8% glutaraldehyde/PBS (vol/vol). Use five times the volume of beads, which was used initially (e.g., 200 μl in 1 ml).    Vortex and combine all suspensions in a 15 ml centrifuge tube. Protect the tube from light and incubate for 4 h on a test-tube rotator at 20 rpm at room temperature.   Transfer suspension back into 2 ml tubes and spin them for 3 min at 16,000 x g at 4 °C.   Discard supernatant, resuspend and vortex pellet in 1.8 ml PBS. Spin again.    Discard supernatant and resuspend the pellet in 0.5 mg/ml OVA/PBS (Use five times the volume of beads that was used initially [e.g., 200 μl in 1 ml]).   Vortex and combine all suspensions in a 15 ml centrifuge tube. Incubate overnight on a test-tube rotator at 20 rpm at 4 °C.",
    "Transfer suspension back into 2 ml tubes and spin them for 3 min at 16,000 x g at 4 °C.   Discard supernatant, resuspend and vortex pellet in 1.8 ml 0.5 M glycine/PBS.   Incubate for 30 min on a test-tube rotator at 20 rpm at 4 °C.   Spin tubes for 3 min at 16,000 x g at 4 °C.   Discard supernatant, resuspend and vortex pellet in 1.8 ml PBS.   Repeat the spin followed by two more washes with 1.8 ml PBS (a total of three washes).   Resuspend each pellet in the initial volume (200 μl), pool and vortex the dispersion. Store the suspension of OVA-coupled microspheres at 4 °C. Note: Coupled microspheres should be prepared freshly the day before the flow organellocytometry experiment and can be used within a week when stored at 4 °C. Never freeze particles and always vortex dispersion carefully to avoid aggregation of coupled microspheres.       Phagocytosis of antigen-coupled particles Note: Estimate around 5 x 106 cells for each experimental condition.   Pick up cell clusters and single cells by resuspending them with a pipet. Spin cells for 4 min at 400 x g at 4 °C.   Resuspend cells in ice-cold PBS and spin them again for 4 min at 400 x g at 4 °C.   Resuspend cells in ice-cold internalization medium, transfer them to a conical 15 ml centrifuge tube and count the cells.   Adjust the cell suspension in ice-cold internalization medium to a cell density of 20 x 106/ml and keep them on ice.    Vortex suspension of OVA-coupled microspheres and add them to the cells at a particle-to-cell ratio of 10:1. Mix carefully.   Incubate samples for 30 min in a water bath adjusted to 16 °C. If necessary, add ice to the water bath during the incubation period.",
    "Place samples on ice and add 10 ml ice-cold PBS to the tubes. Pipet up and down, close the tubes and shake them thoroughly for 10 sec. Spin tubes for 4 min at 100 x g at 4 °C to remove floating particles.   Discard supernatant and repeat the last step twice to have a total of three washes.   Resuspend each cell pellet in pre-warmed BMDC culture medium and divide cell suspension in 15 ml centrifuge tubes to allow phagosomal antigen degradation to occur for different time points. Use 1-2 ml medium for each experimental condition.    Add 10 ml ice-cold PBS to one tube, which represents the time point of 0 min. Keep this tube on ice.   Keep the other tubes open and incubate them at 37 °C and 5% CO2 for different chase periods (for example: 60 and 120 min).   Stop each chase period by adding 10 ml of ice-cold PBS and keep these tubes on ice.      Manual lysis and labeling of samples Note: After phagocytic uptake of particles, cells undergo a labeling step that distinguishes surface-bound particles from internalized ones. Subsequently, cells are lysed manually to release cytosol and cell organelles followed by a labeling step to detect levels of phagosomal OVA as well as the acquisition of lysosomal markers (for example, LAMP-1) to phagosomes during phagosome maturation.   Spin all tubes for 4 min at 400 x g at 4 °C.   Discard supernatant and resuspend each pellet in PBS + 1% (wt/vol) BSA. Transfer samples to a U-bottom 96-well plate.    Spin the plate for 4 min at 400 x g at 4 °C and flick the supernatant.    Resuspend each sample in 0.2 ml PBS + 1% (wt/vol) BSA + 1:100 diluted CD16/CD32 antibody (Fc block). Incubate on ice for 10 min.",
    "Spin the plate for 4 min at 400 x g at 4 °C and flick the supernatant.   Resuspend each sample in 0.2 ml PBS + 1% (wt/vol) BSA + 1:500 diluted OVA antibody. Incubate on ice for 15 min.   Spin the plate for 4 min at 400 x g at 4 °C and flick the supernatant.   Resuspend each sample in 0.2 ml PBS and spin the plate for 4 min at 400 x g at 4 °C. Flick the supernatant and repeat the wash.   Resuspend each sample in 0.2 ml PBS + 1% (wt/vol) BSA + 1:1,000 diluted anti-rabbit Alexa Fluor 568. Incubate on ice for 15 min.   Spin the plate for 4 min at 400 x g at 4 °C and flick the supernatant.   Resuspend each sample in 0.2 ml PBS and spin the plate for 4 min at 400 x g at 4 °C. Flick the supernatant and repeat the wash.   Transfer samples into conical 1.5 ml centrifuge tubes and spin them for 4 min at 400 x g at 4 °C.   Aspirate the supernatant carefully and resuspend each cell pellet in 0.5 ml homogenization buffer.   For mechanical lysis of the cells, pass the suspension 15 times thoroughly through a 22 G needle fitted to a 2 ml syringe. Use the whole volume of the syringe for mechanical breaking of cells. Control homogenization success by trypan blue staining (Figure 1): Add 1 μl sample to 9 μl 0.4% (wt/vol) trypan blue solution, mix and add to a cell culture counting chamber. Count the amount of unstained, intact cells as well as stained, lysed cells using a light microscope. Calculate the percentage of lysed cells and do not exceed 80% of lysed cells. Additionally, avoid breaking of cell nuclei.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161110/20161110180707_6311.jpg Figure 1.",
    "Mechanical lysis of BMDC after uptake of OVA-coupled beads to release phagosomes for subsequent flow organellocytometry. BMDC were allowed to internalize OVA-coupled beads for 30 min followed by a chase period to allow phagosome maturation to occur. To break cells mechanically in order to release intact phagosomes without breaking cell nuclei, we pass the cell suspension 15 times through a 22 G needle. The image shows the cell suspension labeled with trypan blue before (upper panel) and after cell lysis (lower panel). Accumulation of trypan blue in cells with broken cell membrane but intact nuclei (arrows) allows one to monitor success of mechanical cell lysis. The release of phagosomes in the obtained post-nuclear supernatant (PNS) is visualized by bright field microscopy. Scar bar = 20 μm.    Spin the tubes for 4 min at 150 x g at 4 °C to separate the post-nuclear supernatant (PNS) from cell nuclei and remaining intact cells.   Transfer the PNS of the different samples into a V-bottom 96-well plate and keep on ice.   Spin the plate for 3 min at 1,500 x g at 4 °C and remove supernatant with a multi-channel pipet.   Add 50 μl PBS + 1% (wt/vol) BSA + 1:500 diluted OVA antibody + 1:100 diluted LAMP-1 antibody.   Mix samples with a multi-channel pipet, seal the plate and incubate overnight on ice.    Add 0.15 ml PBS + 0.1% (wt/vol) BSA to each well, spin the plate for 3 min at 1,500 x g at 4 °C and remove supernatant with a multi-channel pipet.   Add 0.2 ml PBS + 0.1% (wt/vol) BSA and mix samples with a multi-channel pipet.   Spin the plate again and repeat the wash with PBS + 0.1% (wt/vol) BSA once more.",
    "After the supernatant is removed with a multi-channel pipet, add 50 μl PBS + 1% (wt/vol) BSA + 1:1,000 diluted anti-rabbit DyLight 633 + 1:1,000 diluted streptavidin Alexa Fluor 488. Incubate on ice for 45 min.   Add 0.15 ml PBS + 0.1% (wt/vol) BSA to each well, spin the plate for 3 min at 1,500 x g at 4 °C and remove supernatant with a multi-channel pipet.   Add 0.2 ml PBS + 0.1% (wt/vol) BSA and mix samples with a multi-channel pipet.   Spin the plate again and repeat the wash with PBS + 0.1% (wt/vol) BSA once more. Resuspend each sample in 0.2 ml PBS and keep the plate on ice until the measurement by flow cytometry. Measure the samples in a non-fixed state on the same day."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}