{
  "id": 7651,
  "origin_website": "Bio",
  "title": "Binding Affinity Quantifications of the Bacteriophage Mu DNA Modification Protein Mom Using Microscale Thermophoresis (MST)",
  "procedures": [
    "Partial purification of His-tagged Mom for MST assays Cell extract preparation Note: Perform all steps at 4°C or on ice. Aliquot samples at each step for SDS PAGE analysis (Figure 1). Resuspend 2 g of cell pellet (Escherichia coli C41 expressing Mom, Figure 1, lanes 1–2) in 12 mL of lysis buffer (see Recipe 1). Add PMSF to a final concentration of 1 mM.Pre-cool the Diagenode Bioruptor. Distribute 2 mL of the cell suspension into six 15 mL TPX tubes and sonicate using at a high power setting for 20 cycles (30 s on, 45 s off).Centrifuge the sonicated extract for 2 h at 4°C at 100,000 × g in the ultracentrifuge. The supernatant and pellet obtained after the spin are referred to as S100 supernatant and S100 pellet, respectively (Figure 1, lanes 3–4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4472/bioprotoc-12-14-4472-g001.jpgFigure 1. Partial purification of his-tagged wild-type (WT) and mutant Mom proteins for microscale thermophoresis (MST). His-tagged WT Mom (Upper panel), R101A Mom (middle panel), and Y149A Mom (lower panel) were overexpressed in E. coli C41 pNC1 cells and partially purified as follows. Crude cell extracts of uninduced (lane 1) and IPTG-induced (lane 2) cultures were subjected to ultracentrifugation at 100,000 × g, and the supernatant (lane 3) and pellet fractions (lane 4) analyzed. Nucleic acids were removed from the S100 supernatant using PEI precipitation (lanes 5–6), and cellular proteins were fractionated using 0–35% and 35–65% ammonium sulfate cuts (lanes 7–8). His-tagged Mom protein in various stages of purification is indicated using red arrowheads, and purified non-his-tagged Mom protein was loaded in lane 9. Buffer exchange was carried out to remove ammonium sulfate from the Mom-containing ammonium sulfate fraction (35–65%, lane 10), and the dialyzed fraction was loaded on PC column.",
    "Flowthrough fraction (lane 11) was collected, and the column washed to remove weakly bound protein (lanes 12–13). Elution was carried out with a high salt buffer (lanes 14–16). For protein quantitation using densitometry, PC elutions were dialyzed and concentrated; 1 μL, 2 μL, 4 μL, 8 μL, and 10 μL (lanes 17–21) of the concentrated protein were loaded alongside known amounts (100, 200, 400, and 800 ng) of BSA standard (lanes 22–25) and Genetix 3 color prestained protein marker (Lane 26). Samples were analyzed on 15% SDS PAGE gels.Removal of nucleic acids Add polyethyleneimine (PEI) pH 7.4 dropwise to the S100 supernatant from the above step to a final concentration of 1% while continuously stirring on a magnetic stirrer.Centrifuge the resulting suspension at 20,000 × g for 10 min in Kubota centrifuge to precipitate PEI-nucleic acid complexes (Figure 1, lane 6).Decant the supernatant (referred to as the PEI supernatant, Figure 1, lane 5) into a fresh tube.Fractionation of cellular proteins Ammonium sulfate precipitation is a technique used for fractionation of cellular proteins. It is based on an effect termed salting-out, wherein at higher salt concentrations, protein solubility usually decreases, leading to precipitation (Green and Hughes, 1995). Because precipitation is due to reduced solubility and not denaturation, pelleted protein can be readily resolubilized using standard buffers. After removal of ammonium sulfate using dialysis, the protein is well suited for further chromatographic fractionation or purification procedures.Fractionate the PEI supernatant from the above step using two ammonium sulfate saturation cuts, 0–35% and 35–65% (Wingfield, 2001), as follows.For 0–35% saturation, weigh the required amount of ammonium sulfate crystals and slowly, grain by grain, add it to the PEI supernatant while stirring it constantly on a magnetic stirrer, allowing the salt to dissolve completely.",
    "After the appearance of a precipitate, incubate the suspension on ice for 10 min and centrifuge for 20,000 × g for 15 min at 4°C.Collect the supernatant and subject it to 35–65% ammonium sulfate saturation as above. The pellets obtained after the ammonium sulfate precipitation (Figure 1, lanes 7–8) can be stored on ice overnight at 4°C.Phosphocellulose activation/equilibration Add 1 g of cellulose phosphate P1 swells to 3–4 mL resin. Wash approximately 25 g of phosphocellulose powder with 25 volumes of MilliQ water.For all the washing steps, gently stir the resin by swirling it in a 1 L beaker and allowing it to stand for 10 min, followed by decanting the liquid. Wash volumes are calculated with respect to the dry weight of phosphocellulose processed, such that volume here is 25 × 25 = 625 mL.Wash the resin with 10 volumes each of 95% and 50% distilled ethanol.Subsequently, wash the resin with 25 volumes of 0.5 N NaOH.Thereafter, wash the resin with 75–100 volumes of Milli Q water, until the pH of the decanted liquid is less than 10.Add 25 volumes of 0.5 N HCl to resin and stir well. Allow the resin to settle for exactly the same time as in step 4.Next, wash the resin with 75 volumes of MilliQ water.Phosphocellulose chromatography Resuspend the 35–65% ammonium sulfate pellet, which is enriched in Mom protein, in phosphocellulose binding buffer (see Recipe 2), and dialyze against 1 L phosphocellulose binding buffer, with two changes of the dialysis buffer over 3 h.Centrifuge the dialyzed suspension at 20,000 × g for 10 min at 4°C.Apply the supernatant (Figure 1, lane 10) onto a 50 mL pre-equilibrated phosphocellulose column using a peristaltic pump at a flow rate of 2.5–5.0 mL/min.",
    "Collect the flow-through (Figure 1, lane 11) and load it back on the column. Repeat this step two more times to ensure complete binding of Mom to resin.Wash the resin with 3 column volumes each of wash buffers 1 and 2 (see Recipes 3 and 4) (Figure 1, lanes 12–13).Elute Mom with 0.5 column volumes of high salt elution buffer (see Recipe 5) (Figure 1, lanes 14–16).Dialyze the eluted protein against storage buffer (see Recipe 6) and concentrate using Amicon Ultra-15 with a 10 kDa MWCO membrane.Aliquot the concentrated protein, snap freeze in liquid nitrogen, and store at -80°C.Protein quantitation Purified proteins were quantitated using SDS-PAGE densitometry. SDS PAGE-based protein quantitation, unlike spectrophotometric methods like the Bradford assay, carries the advantage of quantitating a specific protein of interest in a complex mixture of proteins and hence is more reliable for estimating protein concentrations for MST. A 2 mg/mL stock of BSA standard prepared in water was further diluted to 10 ng/μL, 20 ng/μL, 40 ng/μL, and 80 ng/μL; 10 μL of each of the dilutions was loaded in the gel (Figure 1, lanes 22–25) alongside a series of two-fold increasing volumes (1 μL, 2 μL, 4 μL, 8 μL,10 μL) of test sample (Figure 1, lanes 17–21). Concentration of the protein of interest within the test sample was estimated by comparing densities of the specific band of interest with those of the BSA standards.MST Protocol Labeling the protein with fluorescent dye The instructions for this step are based on using the Red-Tris-NTA dye and consumables from NanoTemper Technologies. The Monolith NT His-tag Labeling Kit facilitates site-specific, purification-free labeling of small amounts of His-tagged proteins with the NT647 fluorescent dye.",
    "The kit can be used for the labeling of any protein or peptide carrying a polyhistidine tag (at least six histidines), and labeling can be completed within 30 min. The dye binds efficiently (subnanomolar affinity) to His-tags, and near-complete binding of the dye to His-tagged proteins obviates further purification steps or excess dye removal. Moreover, the specificity for His-tags allows for the method to work well with impure or partially purified protein preparations. An alternate approach to using the Tris-NTA dye is to tag the protein of interest with a fluorescent tag, e.g., GFP, in which case no further labeling should be required. Note that the dye (or tag) must be compatible with the filters installed in the Monolith instrument and that the dye or tag should not block any potential ligand-binding sites.Some buffer components–e.g., imidazole, poly-His-tagged ligands, histidine, ATP, reducing agents like TCEP, DTT, and 2-Mercaptoethanol–might interfere with the labeling reaction, and their concentrations should not exceed the limits specified by Nanotemper (Table 1).Add 8.0 mL of water to the vials containing 5× PBS-T to obtain 1× PBS-T (see Recipe 8)Suspend 250 pmol RED-Tris-NTA dye in 50 μL of PBS-T to obtain a 5 μM dye solution.Prepare a 100 nM dye solution by mixing 2 μL of dye (5 μM) and 98 μl 1× PBS-T.Adjust the protein concentration to 200 nM in a volume of 100 μL.Note: Protein concentration should be estimated using band densitometry on a Coomassie blue-stained SDS gel, and is particularly important when quantifying protein of interest in cell extracts or partially purified protein preparations. Mix 100 μL of protein (200 nM) with 100 μL of dye (100 nM).Incubate for 30 min at room temperature.Centrifuge the sample for 10 min at 4°C and 15, 000 × g.",
    "Note: This step is crucial in reducing the noise in the MST data. Noise in the MST data can result from precipitation or aggregation of proteins. Aggregation can occur owing to intrinsic instability of proteins or due to the absence of interacting partners, stabilizing agents, or optimal buffer conditions (unlike in a native cellular environment). The protein is labeled and ready for the binding assay.Table 1. Compatibility of Tris-NTA dye with commonly used buffer components (as recommended by Nanotemper Technologies).  table:",
    "﻿0,1\nCompound,Maximum allowed concentration\nHistidine,1 mM\nImidazole,1 mM\nEDTA,0.5 mM\nTCEP*,0.5 mM\nDTT,5 mM\nβ-mercapto-ethanol**,1 mM\nGSH,10 mM\n\"GTP, GDP\",1 mM\n\"AMP, ADP, ATP\",5 mM\nGlycerol,10 %\n\"Zn2+, Co2+, Cu2+\",preloaded protein only***\nPolyhistidine-tagged ligand,",
    "* NanoTemper Technologies recommends avoiding the use of TCEP with red dyes in general.**We found that 7 mM β-mercapto-ethanol was compatible with our microscale thermophoresis (MST) assays*** Zn2+, Co2+, and Cu2+ ions compete for the binding with RED-tris-NTA. Because of that, only low nanomolar concentrations of listed ions are tolerated.Binding assay Prepare serial dilutions of ligand in PCR tubes or platesPrepare 25 μL of the ligand at 2× concentration (e.g., for a final concentration of 5 mM, prepare the ligand at a concentration of 10 mM).Note: The highest ligand concentration in the binding reaction should be at least 20× the Kd to cover enough data points in the saturation as well as in the baseline of the binding curve. For instance, the measured binding affinities of Mom for Fe2+/3+ and acetyl coenzyme A were in the 10–100 μm range, and to have a satisfactory binding curve, the ligands were prepared at concentrations of 1 mM and 10 mM, respectively, in MST buffer. In cases where the binding affinity is completely unknown, a few ligand concentration ranges can be empirically tested based on assumed Kd values. Refer to the NanoTemper Technologies Concentration Finder tool for the ligand concentration range estimation. Add 10 μL of PBS-T into the PCR tubes 2–16.Transfer 20 μL of the ligand into PCR-tube 1.Transfer 10 μL of the ligand from PCR-tube 1 to PCR-tube 2 with a pipette and mix by pipetting up and down multiple times. Transfer 10 μL to PCR-tube 3 and mix. Repeat the procedure for PCR-tube 4–16. Discard the extra 10 μL from PCR-tube 16.Add 10 μL of labeled protein to each well (1–16) and mix by pipetting. The final target protein concentration is 50 nM. This concentration should be used for the calculation of the Kd value.",
    "Incubate the samples at room temperature for 5 min.Note: Inclusion of 2-Mercaptoethanol at a final concentration of 7 mM in the binding buffer reduced noise in the data. Also, the use of premium coated capillaries instead of standard capillaries solved the problem of protein sticking to the capillary glass surface. Spinning the samples at 15,000 × g for 10 min after the labeling also reduced data noise. Load the capillaries and start sample measurement at 25°C using 40% LED power and medium MST power. For each measurement, repeat experiments three times and carry out data analysis using NanoTemper MO analysis software.Notes:  Recommended settings are 40% LED and a medium MST power. At the final dye concentration of 25 nM, the expected fluorescence intensity at LED 40% is around 300 counts on a Monolith NT.115. The concentration of the labeled protein should be lower than your expected Kd. The labeled protein can be diluted to 10 nM. With an LED power of 100%, fluorescence intensities of 200–250 counts are typically achieved. Nanotemper Technologies does not recommend working with fluorescent intensities < 200 counts for MST measurements."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}