{
  "id": 19458,
  "origin_website": "Jove",
  "title": "Imaging the Aging Cochlea with Light-Sheet Fluorescence Microscopy",
  "procedures": [
    "All the procedures and the use of live animals have been reviewed and approved (Protocol ID #2010-38573A) by the University of Minnesota Institutional Care and Use Committee (IACUC) and investigators who use these animals have been thoroughly trained and tested by the Research Animal Resources (RAR) Veterinarians before they have access to the animal facilities. Both male and female mice were used in this study.\n1. Cochlea removal for fixation and tissue processing for imaging\nEuthanize a mouse using CO2 inhalation. Decapitate the mouse with scissors and make a dorsal-ventral incision through the brain to hemisect the skull. Remove the brain, identify the round bulla in the baso-ventral part of the skull, open the bulla with rongeurs, and visualize and remove the cochlea.\nFixation: Perform this procedure under a fume hood and using a dissection microscope at 5x magnification. Wear gloves and protective clothing. Puncture the oval window and remove the stapes with a sharp pick. Insert a pick into the round window to puncture the membrane.\nCover the opened round window with the cut tip of an infusion set attached to a 1 mL syringe filled with 2 mL of formalin. Slowly infuse formalin through the perilymphatic spaces of the cochlea over a 2 min period, noting that formalin is exiting the cochlea via the opened oval window. Trim excess tissue off the cochlea and immerse in a bottle containing 10% formalin, and place on a rotator overnight.\nDecalcification: Rinse the cochlea in PBS 3x for 5 min each and immerse in a bottle containing 10% solution of disodium ethylenediaminetetraacetic acid (EDTA) with rotation for 4 days, changing the solution daily.",
    "Dehydration: Perfuse the cochlea with PBS 3x and immerse for 15 min between changes. Dehydrate the cochlea with ascending concentrations of ethanol 10%, 50%, 70%, 95%, 95%, 100%, 100%; for 30 min in each concentration.\n\t​NOTE: It is important to remove all the EDTA before dehydration as EDTA precipitates in ethanol. Also, cochleae can be left in any concentration of ethanol greater than 70% overnight.\nStaining: Stain the whole cochlea by immersion in a solution of Rhodamine B isothiocynate (5 µg/mL in 100% ethanol) overnight with rotation. Remove excess dye from the cochlea with two changes of 100% ethanol, 5 min each change.\nClearing: Transfer the stained cochlea into two changes of Spalteholz12 solution (5:3 methyl salicylate:benzyl benzoate), 30 min each change and leave overnight in the clearing solution with rotation. Cochleae can be left in Spalteholz solution indefinitely.\n2. Imaging of cochleae\nAttach the cochleae to a specimen rod at the oval and round window membrane end so that the clearing solution remains within the cochlea and bubbles are not formed (Figure 2). Care must be taken not to let bubbles form within the cochlea as they are difficult to remove and if left in the tissue, they will cause imaging artifacts.\nUse a UV activating glue to attach the wet cochlea to the dry specimen rod (Figure 2). Attach the cochlea at the oval and round window ends. Cure the UV glue for 10 s by moving around the cochlea with the UV light.\n\tNOTE: A loose attachment of the cochlea to the specimen rod will result in imaging defects. This rod is specifically manufactured for this protocol (see Santi et al.8 for details) and is specific to our light-sheet microscope.",
    "Suspend the cochlea into the imaging chamber filled with Spalteholz solution for imaging. The specimen chamber is an optically clear quartz fluorometer cell (Video 1).\nAttach the specimen rod to a rotating holder that is also attached to XZ translation stage. Most stacks are obtained by translating the specimen in the XZ planes, but rotational stacks can also be obtained.\nTSLIM optical sectioning: Use a blue or green laser for excitation depending upon the type of fluorochrome staining. Position the light sheet in the middle of the tissue for focusing and determine the magnification that will be used to illuminate the full width of the cochlea. Then, use a custom-designed program to move the specimen through the light-sheet across the specimen in the X-axis (stitching the image) and in Z-steps to make a stack of 2D images throughout the cochlea.\nFor the first image, the beam waist of the light-sheet is positioned at the edge of the specimen and the program scans the full width of the specimen collecting columns of data (see image stitching; Santi et al.8) that are the width of the confocal parameter (Figure 3) to produce a composite 2D image of maximum resolution across the width of the specimen. The program automates image stitching for each Z-step until the specimen is completely imaged.\nImage processing: Transfer the image stack to another computer and load it into a 3D rendering program for 3D reconstruction and quantification.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}