{
  "id": 5093,
  "origin_website": "Bio",
  "title": "Isolation of Flavonoids from <em>Piper delineatum</em> Leaves by Chromatographic Techniques",
  "procedures": [
    "Note: The whole procedure described below takes around 6 months to complete. Finely grind the air-dried leaves of Piper delineatum (252.2 g) into small pieces using a rotary cutter mill, and extract with ethanol (4 L) in a Soxhlet apparatus (Figure 1) for 24 h at around 80 °C.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160719/20160719193411_4414.jpgFigure 1. Plant material and extraction procedure. A. Piper spp. leaves. B. Soxhlet apparatus used for the extraction of the plant material.Evaporate the solvent under reduced pressure in a rotary evaporator (at ≤ 50 °C, around 1.30 h) provided 57.3 g (22.7%) of crude extract.Re-suspend the crude extract in 750 ml of water and slowly pour into a separating funnel (2 L) placed onto a metallic stand (Figure 2). Add 750 ml of CH2Cl2 to the separating funnel, and hand-shake gently several times. Then, allow the solvent to settle into immiscible phases and recover both phases, the organic phase (bottom layer), and the aqueous phase (top layer) into separate Erlenmeyer flasks. Place the aqueous phase inside the separating funnel and add 750 ml of CH2Cl2 and repeat the operation twice. Combine the organic phases obtained in the three extractions, and add magnesium sulfate anhydrous (10 g) to remove the residual water. Swirl the solution. If the drying agent is clumped together, add more until it looks free-flowing. Filter, through a filter funnel, the total organic phase and collect the filtrate into a 1 L evaporating flask (pear-shaped).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160717/20160717184613_1214.jpgFigure 2. Liquid-liquid partition of the crude extract using a separating funnelAfterwards, the organic phase is taken to dryness by removal of the CH2Cl2 under vacuum in a rotary evaporator (at ≤ 40 °C) (Figure 3), yielding 30 g (11.9%) of organic fraction (dark green solid).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160719/20160719193201_0876.jpgFigure 3. Rotary evaporator to remove solventPack a column chromatography (CC) (50 x 9 cm) by placing 1.",
    "5 cm layer of fine sand and then silica gel (particle size 63-200 mm, 430 g) to a depth of 20 cm, next cover with another 1.5 cm layer of sand to protect the adsorbent surface. Allow an appropriate volume of hexanes (4 x 1 L) to pass through the CC to encourage bubbles to rise and the silica gel to settle so that it packs tightly into the column.Dissolve the organic fraction in 40 ml CH2Cl2, mix with silica gel until it forms a slurry, and remove the solvent under the rotary evaporator until a dry powder is obtained. Spread the dried powder extract, slowly and uniformly, on the upper top of the packed column (Figure 4), and carry out the elution by gradient, using mixtures of hexanes/EtOAc of increasing polarity as eluent (10:0 to 0:10, starting with 100% hexanes, followed by hexanes/EtOAc mixtures 8:2, 6:4, 4:6, 2:8, 1:9 and finishing with 100% ethyl acetate, 1 L each solvent mixture). Collect the resulting fractions (15 fractions, 400 ml each) in round-bottomed flasks (1 L). Subsequently, remove the mobile phase from each fraction in a rotary evaporator (at ≤ 4 °C), and dissolve the residue in 20 ml CH2Cl2 and transfer to round-bottomed tubes (40 ml).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160717/20160717184951_1474.jpgFigure 4. Column chromatography (CC)Combine these 15 fractions into 10 subfractions (A-J) based on their similarities TLC profiles (Figure 5).To run the TLC plates, add the solvent mixtures of hexanes/ethyl acetate of increasing polarity, starting from 8:2 (8 ml hexanes plus 2 ml ethyl acetate) and finishing with 6:4, into the TLC chamber to a depth of just under 0.5 cm.Apply an aliquot of each fraction, using a microcapillary, to the baseline (marked about 0.",
    "7 cm from one end of the plate) of the TLC (around 7 x 5 cm for TLC) and place into the TLC chamber.Develop the TLC, leaving the solvent to rise up the TLC plate by capillary action, until the solvent reaches almost the top (0.5 cm of the plate). Then, visualize the developed TLC under a UV lamp using 254 nm wavelengths, and stained with oleum system and heat the plates to 80-100 °C in a hotplate until spots appear.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160719/20160719193446_2763.jpgFigure 5. Collected fractions from CC and analysis by TLC. A. Collected fractions in round-bottom tubes from the column chromatography showed in Figure 4. B. Visualization of thin layer chromatography (TLC) developed plates of the collected fractions that are further combined into 10 subfractions based on their TLC profiles.1H NMR analysis reveals that fractions C (hexanes/EtOAc, 8:2), H (hexanes/EtOAc, 3:7) and J (EtOAc) are rich in flavonoids. The solvent used for the NMR experiments is deuterated acetone, (CD3)2CO. Note: To prepare the NMR sample: dissolve the sample in 0.6 ml of (CD3)2CO, filter through Pasteur pipette, equipped with a filter paper, and discharge into the NMR tube.Chromatograph fraction C (2.2 g) on a column chromatography (60 x 4.5 cm) packed with Sephadex LH-20 (hexanes/CHCl3/MeOH, 2:1:1 as eluent). Dissolve fraction C in the minimum volume of eluent (hexanes/CHCl3/MeOH, 2:1:1), and load to the top of the column. Develop the column using 1 L of eluent, and collect fractions of 30 ml in round-bottom tubes (40 ml), and combine by TLC profile into five fractions (C1-C5). Notes:  Before loading the sample for column chromatography on Sephadex, pass 1.5 L of a mixture of mobile phase (hexanes/CHCl3/MeOH, 2:1:1) through the column to stabilize the Sephadex LH-20.Before loading the sample on Sephadex column chromatography, filter the sample through filter paper. Chromatograph fraction C3 (328.",
    "8 mg) by CPTLC, a preparative centrifugally accelerated radial thin-layer chromatograph (Figure 6).Apply the sample dissolved in a small volume of CH2Cl2 (3 ml), near the center of a spinning disk coated with a thin layer of sorbent (coating rotor, 4 mm thickness). The mobile phase is supplied by a Teflon funnel holder about 55 cm above bench level, and the solvent flows down onto the circular plate through a capillary tube in the funnel. Elution by mixtures of hexanes/diethyl ether (8:2, 7:3, 6:4 and 1:1, 100 ml each solvent mixture) forms circular bands of the separated components which are spun off from the edge of the rotor together with solvent.  Collect 48 fractions into round-bottom tubes (8 ml). Combine fractions based on their similarities in TLC profiles, into eleven fractions (C3A-C3K).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171018/20171018011414_8529.jpgFigure 6. Centrifugal preparative thin layer chromatography (CPTLC, Chromatotron)Dissolve subfractions C3E (16.4 mg) and C3H (17.7 mg) in Cl2CH2 (2 ml), and further purify by PTLC (plate 20 x 20 cm, 2.5 mm SiO2 thickness) (Figure 7, steps A-E). Load the sample as a band, as narrow as possible, at the baseline of the plate (marked about 2 cm from one end of the plate), with a Pasteur pipette (step A). Dry the plate, place in the chamber with the selected eluent (hexanes/EtOAc, 8:2 for subfraction C3E, and hexanes/CH2Cl2, 8:2 for subfraction C3H, 100 ml of eluent) and develop it (step B). Remove the plate (step C) from the chamber and visualize under UV light marking with a pencil around the band corresponding to the compound. Use a microspatula to scrape the marked band, containing the product, off the plate onto a lengthwise folder piece of clean white paper (step D).",
    "Note: It is very important to deposit a thin line of sample slowly and uniformly, without touching the pipet too much against the silica as this will scrape it. If the desired band is not separated enough, repeat runs with another elution. Place the scraping into a glass vacuum filter (packed with around 2 cm silica gel) and flush with EtOAc (4 x 5 ml) into a round-bottomed flask (step E). Remove the solvent under reduced pressure in a rotary evaporator. Afterwards, dissolve the sample in (CD3)2CO (0.5 ml) and with a Pasteur pipette transfer to a NMR tube to perform the NMR experiments. In this way, the following compounds can be isolated and purified: 2'-hydroxy-3,4',6'-thoxychalchone (compound I, 9.4 mg, Rf 0.42) (Boumendjel et al., 2008) from subfraction C3E, and compounds 2',4'-dihydroxy-3,6'-dimethoxychalcone (compound II, 3.6 mg, Rf 0.38) (Aponte et al., 2010) and 2', 4'-dihydroxy-6'-methoxychalcone (compound III, 8.3 mg, Rf 0.36) from subfraction C3H.Chromatograph fraction H (5.4 g) on Sephadex LH-20 (CHCl3/MeOH, 1:1, 500 ml) to afford fractions H1-H9, and collect them in round-bottom flasks (10 ml each), following the procedure described in step 7.Chromatograph fraction H6 (304.8 mg) by CPTLC (CH2Cl2/acetone of increasing polarity, 10:0 to 1:1, starting from 100% CH2Cl2 and finishing with a mixture of CH2Cl2/acetone 50%, 200 ml) to afford nine fractions (H6A-H6I), and collect in round-bottom flasks (10 ml each), using the same procedure as described in step 8.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160719/20160719193505_3551.jpgFigure 7. Steps by step guide of preparative thin layer chromatography (PTLC) procedure. A. Load the sample as a band at the plate. B. Place the PTLC in the chamber and develop the plate. C. Remove the plate and visualize it under UV light marking the band corresponding to the compound. D. Scrape the marked band. E.",
    "Place the scraping into a glass vacuum filter and flush with a solvent.Further purify subfraction H6F (18.2 mg) by PTLC (hexanes/EtOAc, 3:2), following the same procedure described in step 9, and compounds 2',4'-dihydroxy-3,3',6'-trimethoxychalcone (compound IV, 4.7 mg, Rf 0.36) and 2',3'-dihydroxy-4',6'-dimethoxychalchone (compound V, 9.3 mg, Rf 0.40) (Chantrapromma et al., 2000) can be obtained.Chromatograph fraction H7 (593.0 mg) by CPTLC (CH2Cl2/acetone, 10:0 to 1:1) to give fractions H7A-H7G, following the same procedure as described in step 8. Subsequently, further purify subfraction H7F (23.1 mg) by PTLC (eluent: hexanes/isopropanol, 4:1) to yield compounds 2',3',5-trihydroxy-4',6',3-trimethoxychalcone (compound VI, 15.3 mg, Rf 0.47) and 2',4',4-trihydroxy-3,6'-dimethoxychalcone (compound VII, 3.8 mg, Rf 0.42) (Vogel et al., 2010,), following the same procedure described in step 9.Chromatograph fraction I (3.9 g) on Sephadex LH-20 (CHCl3/MeOH, 1:1) to afford fractions I1-I5. Further chromatograph fraction I3 (628.8 mg) by CPTLC (CH2Cl2/acetone, 10:0 to 7:3) to afford fractions I3A-I3L, following the same procedure described in step 8.Further purify subfractions I3F (16.4 mg) and I3H (21.2 mg) by PTLC (CH2Cl2/acetone, 9:1 and hexanes/isopropanol, 8:2, respectively) to afford compounds (-)-(2S)-8-hydroxy-5,7,3'-trimethoxyflavanone (compound VIII, 11.4 mg, Rf 0.44) and (-)-(2S)-7, 5'-dihydroxy-5,3'-dimethoxyflavanone (compound IX, 10.4 mg, Rf 0.39), respectively, following the same procedure described in step 9.In summary, the EtOH extract of leaves of P. delineatum was partitioned into a CH2Cl2/H2O solution. The CH2Cl2 fraction was subjected to multiple chromatographic steps to yield 9 flavonoids, whose structures were deduced by NMR and MS analysis (Figure 8).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160719/20160719193347_0118.jpgFigure 8. Flowchart for chromatographic steps to obtain flavonoids from leaves of Piper delineatum"
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}