{
  "id": 1939,
  "origin_website": "Cell",
  "title": "Isolation of endogenous cytosolic DNA from cultured cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCollection of cytosolic fraction\nTiming: 45–60 min\nThe following steps describe collection of cells and cytosolic cellular fraction.\nHarvest the cultured cells.\nWash the cells once with 5 mL ice cold PBS per plate.\nTrypsinize the cells as per typical cell splitting protocol. For MC38 cells:\nAdd 0.5 mL 0.125% Trypsin/EDTA to each cell culture plate.\nIncubate the plates at 37°C for 5–10 min.\nCollect the cells from the plate using 1 mL ice cold PBS and transfer to a 1.5 mL microcentrifuge tube. Keep samples on ice moving forward.\nSpin down the cells at 500×g for 10 min at 4°C. Discard supernatant.\nCritical: Steps 2–4 comprise the subcellular fractionation of the cells for collection of the cytosol. Proper sample incubation time and spin conditions are critical for this step to prevent contamination from other cell compartments.\nGently resuspend the cell pellet in 550 μL ice cold Cytosolic Extraction Buffer (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nIncubate on ice for 10 min.\nSpin the samples at 2000×g for 10 min at 4°C.\nTransfer all supernatant containing the cytosolic fraction to a fresh 1.5 mL microcentrifuge tube.",
    "Note: To confirm proper cytosolic fractionation of your specific cell line, use the supernatant and pellet (which can be lysed via resuspension in 1X RIPA buffer) from step 5 to perform western blots for cell compartment markers that should be absent from a pure cytosolic fraction (Figure 1[href=https://www.wicell.org#fig1]). All buffers should contain 1:100 protease inhibitor cocktail when using fractions for western blotting. COX-IV confirms the absence of mitochondria (and therefore unreleased mitochondrial DNA) in the cytosolic fraction. Lack of nuclear markers, such as Lamin B1, in the cytosolic fraction indicate a lack of nuclear contamination. Note that the use of a histone as a nuclear marker may lead to a false indication of nuclear contamination as histones may be present on cyDNA (MacKenzie et al., 2017[href=https://www.wicell.org#bib6]). Markers of other cell components, such as EGFR for the cell membrane, can also be evaluated if desired. See troubleshooting 2[href=https://www.wicell.org#sec7.3] and 3[href=https://www.wicell.org#sec7.5].\nRemoval of cytosolic protein\nTiming: 2 h to 1 day\nThe following steps describe in detail treatment of the cytosolic fraction with Proteinase K and phenol-chloroform extraction for Proteinase K removal (Härtlova et al., 2015[href=https://www.wicell.org#bib5]).\nTake a small aliquot of the cytosolic fraction. Use a protein quantification method (such as the Pierce BCA Protein Assay) to determine the protein concentration. Normalize input of the fraction into step 7 using this value. For an 80% confluent 10 cm plate of MC38 cells in step 1, approximately 1 mg of protein is observed in the cytosolic fraction. See troubleshooting 4[href=https://www.wicell.org#sec7.7].\nNote: Once the average amount of protein is determined from several replicates of the cytosolic fraction from step 5, step 6 may be omitted in subsequent experiments that are set up with identical conditions and the pre-titrated amount of Proteinase K can be used for consistency.",
    "Add Proteinase K to cytosolic fraction isolated in step 5 at a ratio of 0.55 mg:1 mg of total protein in 550 μL of sample. See troubleshooting 1[href=https://www.wicell.org#sec7.1].\nIncubate the samples at 55°C for 1 h.\nPerform phenol-chloroform isoamyl alcohol extraction.\nNote: Use of commercial columns for nucleic acid purification should be avoided to prevent loss of small cyDNA fragments.\nAdd 500 μL of phenol-chloroform isoamyl alcohol.\nNote: A final 1:1 ratio of sample to phenol-chloroform isoamyl alcohol is ideal after step 9a. Transfer of all supernatant in step 5 ensures the correct ratio with the amount of phenol-chloroform isoamyl alcohol indicated above.\nShake the samples vigorously for 30 s.\nSpin the samples at 18300×g for 15 min at 4°C.\nAdd 500 μL of 100% isopropanol to a fresh 1.5 mL microcentrifuge tube.\nTransfer 400 μL of the top (aqueous) layer of the samples from step 9c to tubes prepared in step 9d. See troubleshooting 1[href=https://www.wicell.org#sec7.1].\nAdd 1.0 μL of Glyco-Blue. This will aid in precipitating the DNA (Green and Sambrook, 2016[href=https://www.wicell.org#bib4]).\nNote: Low concentrations of glycogen will be present in the final product due to this step. While this concentration is unlikely to affect downstream analyses, Glyco-Blue may also be added to later negative controls. Omission of this step would likely decrease the efficacy of the extraction process and lead to lower final DNA yield.\nShake the samples vigorously for 30 s.\nOptional: After step 9g, samples can be incubated at least 16 h at −20°C to increase final yield by up to 40%.\nSpin the samples at 18300×g for 10 min at 4°C.\nRemove the supernatant.\nAdd 500 μL of 70% ethanol. Gently flick the tube to dislodge the pellet.\nSpin the samples at 18300×g for 10 min at 4°C.\nRemove the supernatant.",
    "Allow the pellet to dry at 24°C.\nCritical: The pellet in step 9m should be allowed to dry completely as carryover of remaining ethanol may influence the efficiency of the rest of the protocol or downstream cyDNA analysis.\nResuspend the pellet in 200 μL of 10 mM Tris-HCl buffer (pH 8.0).\nRemoval of cytosolic RNA\nTiming: 2 h to 1 day\nThe following steps describe treatment with RNase A to remove RNA contaminants followed by a phenol-chloroform extraction for RNase A removal (Härtlova et al., 2015[href=https://www.wicell.org#bib5]).\nAdd RNase A to samples at a final concentration of 500 μg/mL.\nIncubate samples for 1 h at 37°C.\nNote: An excess dose and long treatment time with RNase A in steps 11–12 ensures full removal of contaminating cytosolic RNA from the final isolation that could greatly bias downstream analyses. This contaminating RNA may show up in downstream DNA characterization methods, and act as a false positive during subsequent stimulations by activating cytosolic RNA sensors that give similar readouts to their DNA sensing counterparts, such as STING.\nAdd 300 μL of 10 mM Tris-HCl (pH 8.0) for easy extraction and to reach the correct ratio of sample to phenol-chloroform isoamyl alcohol (see step 9a note) in step 14.\nPerform phenol-chloroform isoamyl alcohol extraction as described in step 9.\nResuspend the pellet in 50 μL 10 mM Tris-HCl (pH 8.0)."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Behavior"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Ecology & Environmental Biology"
  ]
}