{
  "id": 7403,
  "origin_website": "Bio",
  "title": "Measuring Real-time DNA/RNA Nuclease Activity through Fluorescence",
  "procedures": [
    "Plate PreparationPrepare the plate on ice and protect the samples from light. For every reaction, prepare the mix and run triplicates for the best accuracy. Use of multi-channel pipettes accelerates the set up of the reaction plate but can also lead to air bubbles in wells. Centrifuge the plate to remove them.Always mark up the plate to aid with pipetting substrate and reaction mixtures and to blank off any empty wells. If using tape to label the rows and columns, peel this off before loading into the plate reader. Take time to plan out experiments and calculate volumes well ahead of time.Reaction mix per well:10 µl oligonucleotides 500 nM10 µl reaction buffer25 µl ddH2O (or 23 µl if SA)2 µl of streptavidin (for biotinylated oligos)50 µl PG5 µl enzymeNote: For RNA reactions, a similar procedure could be followed by substituting PG with RNA dye. Perform the annealing of complementary oligonucleotides in a thermocycler or heat block and use the molar ratio 1:1.Mix equal volumes of the equimolar oligonucleotides (100 µM each) in a PCR tube.Incubate for 5 min at 95°C.Switch off the heat block leaving the samples in to cool down slowly or use the thermocycler (go down 1°C every 30 s).Keep the annealed duplexes at -20°C for long-term storage.Dilute the annealed oligos to 500 nM.Use 10 µl (50 nM) per reaction/well.For example, to anneal the oligonucleotide duplexes containing the gap, anneal three oligonucleotides using 2.5 µl each, and add 2.5 µl of annealing buffer. The concentration of the end product is 25 µM.Notes:  Use the reaction buffer appropriate for the enzyme. The wide range of activity buffers, like 10× CutSmart (New England Biolabs, B7204S) or 10× Tango (ThermoScientific, BY5), can facilitate the data analysis (no need for extra controls) and work well with many enzymes.",
    "Run a trial experiment to test the effectiveness of different reaction buffers to get the best results. Use nuclease-free water. Remember to add 2 µl of streptavidin for BIOTEG or biotinylated oligonucleotides. Incubate for 15 min on ice on a see-saw shaker to enhance binding.Add PicoGreen reagent (PG) to every well protecting the plate from light. Try to work quickly and cover the rows/columns already supplemented with PG with lid/aluminium foil.Add the denoted enzymes (or storage buffer as a negative control) to each well.Work at the bench at room temperature from now on to avoid the risk of enzyme precipitation. Prepare the desired amount of enzyme units/concentration in 5 µl. Take a full box of filter tips and use in the corresponding position in the tip box and plate to avoid pipetting mistakes. This way, if the position on the plate is lost, the tip box could orient the processing. Add 5 µl to each well, trying not to make any bubbles that could affect the fluorescence reads. The reaction starts now, so work quickly to be able to catch the first minutes of the reaction in the pre-heated plate reader. Remember to protect the plate from light.Notes:  Avoid using multi-channel pipettes as they tend to add bubbles to wells and are less consistent in adding the correct amount of enzyme. Centrifuge the plate briefly to remove air bubbles. For quick acting enzymes, this may not be advisable as the enzymatic reaction may have already started during that time. Attempt to titrate out the enzyme. If too much enzyme is present in the solution, the reaction is very fast, causing loss in data read in the early phase of the reaction. Design of experimentPlate with test experiment with T7 and ExoIII exonucleases. The samples were prepared in duplicate.",
    "The calibration control curve is also included, as illustrated in Figure 4.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4206/bioprotoc-11-21-4206-g004.jpgFigure 4. Scheme of the plate for test experiment. A. Row A1-6 contains the negative control oligomer for both tested exonucleases. The correct binding between biotin-modified-oligonucleotides and streptavidin added to the mix protects both 3′ and 5′ ends from digestion. All4block signifies that all four ends on the oligos were blocked by biotin-streptavidin binding. B. Row B1-6 contains oligonucleotides with 3bp gap in proximity, 12bp to 3′ end (which is the substrate for ExoIII acting in the 3′ to 5′ direction). T7 could only digest short 12bp fragments leading to the last nucleotide blocked by Biotin-Streptavidin. C. Row C1-6 contains oligonucleotides with 3bp gap in proximity, 12bp to 5′ end (which is the substrate for T7 exonuclease acting in the 5′ to 3′ direction). ExoIII could only digest short 12bp fragments leading to the last nucleotide blocked by Biotin-Streptavidin. D. Row D1-6 contains oligonucleotides with 15bp overhang on 5′. E. Row E1-6 contains oligonucleotides with 15bp overhang on 3′. In Columns 1 and 2, storage buffer from ExoIII (or T7) was added to the samples. Columns 3 and 4: ExoIII 5U per well. Columns 5 and 6: T7 5U per well. A7 and A8: 80mer_3block (oligos that 80mers with both 3′ ends blocked). B7 and B8: 40mer_3block (oligos that 40mers with both 3′ ends blocked). C7 and C8: ssDNA, 80bp single strain DNA, as a control of totally digested duplex oligomer, minimum value of fluorescence for the experiment."
  ],
  "subjectAreas": [
    "Biochemistry",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}