{
  "id": 14979,
  "origin_website": "Jove",
  "title": "Screening Sperm for the Rapid Isolation of Germline Edits in Zebrafish",
  "procedures": [
    "This study was carried out in line with the guidelines in the Guide for the Care and Use of Laboratory Animals of the National Institutes of Health. The protocol was approved by the University of Texas at Austin Animal Care and Use Committee (AUP-2021-00254).\n1. Designing the sgRNA for CRISPR mutagenesis\nObtain the exon sequence containing the targeted loci.\nDesign a synthetic guide RNA (sgRNA) with a protospacer adjacent motif (PAM) site that is specific to the Cas endonuclease.\n\t\nIf co-injecting a donor construct, design the sgRNA to have a predicted cut site as close to the desired edits as possible.\n\t\tNOTE: APE is a free software with a tool to find Cas9 sgRNA sites11. Alternatively, tools such as CHOPCHOP can be used, which offers an online interface for designing sgRNAs that considers the different PAM sites of Cas9 and other Cas endonucleases12.\nDesign forward and reverse primers to amplify the region surrounding the designed CRISPR/Cas cut site. The PCR product should be approximately 200-400 base pairs (bp) in length to be able to resolve small indels on a gel later in the protocol.\n\tNOTE: CHOPCHOP11 automatically designs primers for every sgRNA it outputs.\nOptional: Design a DNA donor construct with the desired edit(s).\n\t\nObtain the genomic sequence of the exon containing the loci of the desired mutation.\n\t\tNOTE: Intronic sequences can vary between individuals, so it is best to avoid the inclusion of intronic sequences in the donor construct as this could interfere with the homology-dependent repair pathway.\nIf a specific amino acid change is desired, alter the specific codon accordingly.\n\t\tNOTE: When making these changes, be aware of the codon frequency. If possible, choose a codon with high usage.",
    "To prevent CRISPR/Cas digestion of the donor construct, make additional synonymous mutations that (i) disrupt the PAM and/or (ii) disrupt the sgRNA sequence, with higher preference being placed on making non-synonymous changes closer to the PAM site.\nUse a restriction site finder (APE11 also has this feature) to find unique restriction sites (those that only occur once) in the predicted PCR product of the wild-type sequence.\n\t\t\nRepeat this process for the predicted PCR product that reflects the successful integration of the donor construct.\nCompare the list of restriction sites between the wild-type and donor-integrated sequences to find a restriction site that is present only in the edited sequence.\nIf no unique restriction site is found, continue making synonymous changes within the donor construct until this is achieved.\n\t\t\tNOTE: If possible, continue making synonymous mutations that would disrupt the sgRNA binding to the donor construct.\nTrim the donor sequence to a manageable size (50-100 bp) with at least 20 bp of homology surrounding the predicted CRISPR/Cas cut site and edits, if possible.\nObtain the designed sgRNA and/or DNA donor oligonucleotides, as well as any primers required for genotyping.\n\tNOTE: To prevent the digestion of the DNA donor oligonucleotides by nucleases, it is recommended to modify the first three phosphate bonds on the 5' and 3' ends of the DNA oligonucleotides with phosphorothioate.\nInject 1 nL of the injection mix into one-cell stage embryos. Typically, a standard injection mix contains the following:\n\t1 µL of 25 µM locus-specific sgRNA\n\t1 µL of 25 µM Cas9 endonuclease\n\t​Optional: 1 µL of 3 µM DNA donor construct\n\t\nBring the total volume to 5 µL with 0.1 M RNase-free KCl.\nAllow the F0-injected individuals to develop into sexually mature adults. The remaining protocol focuses on screening the F0-injected males for germline edits.",
    "2. Setting up the breeding tanks\nPrime F0 males for mating by setting up breeding tanks with dividers between the F0 males and females.\n\t\nTo minimize the number of breeding tanks required, set up three males across from two females in each tank.\n\t\t\nSet up as many F0 males as can effectively be screened and housed as individuals after sperm collection. The genotype of the females is not important since their gametes will not be collected during this procedure.\nSet up one breeding tank of wild-type males across from females. Wild-type sperm will serve as a control for the interpretation of the results later in the procedure.\nIncubate the prepared breeding tanks overnight.\n3. Preparing the materials for the sperm collection procedure\nPrepare enough anesthetizing solution (0.016% tricaine-HCl in fish water) to fill a small glass bowl.\nDispense 40 µL of 50 mM NaOH into 0.2 mL PCR tubes. Prepare one tube for each sperm sample that will be collected. Store on ice.\nPrepare individual 0.8 L tanks for each fish that will be sampled during the procedure. These tanks will house the sampled fish until the genotyping is complete.\n\tNOTE: This is the primary factor that limits the number of fish that can be effectively screened in this protocol. Ensure adequate space for housing the sampled individuals until the genotyping is complete.\nMoisten a 1-inch x 1-inch sponge (cut with a shallow, oval-shaped divot to hold a male zebrafish ventral side up during the procedure) in fish water and squeeze out excess liquid.\n\t\nPosition the sponge in the field of view of a stereomicroscope at low magnification (Figure 1A).\nPosition oblique overhead lighting for optimal viewing.\n4. Anesthetizing the male fish and collecting the sperm\nPrepare a clean capillary tube.",
    "Gently shake the tube container to release a single capillary tube.\nPlace the capillary tube into the provided bulb, and set it aside.\nTransfer a male fish into the prepared anesthetizing solution (0.016% tricaine-HCl in fish water).\n\t\nGently stir the solution with a slotted spoon to speed up the process of anesthesia.\nOnce the operculum (gill) movement slows down (approximately 1-2 min), proceed with the sperm collection.\nUse the slotted spoon to transfer the fish onto a clean stack of paper towels.\n\t\nUse the slotted spoon to gently roll the fish to remove excess water.\nGently blot the fish with clean, folded tissue paper to remove any remaining water.\nUse the slotted spoon to transfer the fish to the prepared sponge (Figure 1B).\n\t\nPosition the fish ventral side up with its head nearest the dominant hand of the person performing the procedure.\nGently blot the area around the anal fins with clean, folded tissue paper.\nCollect the sperm.\n\t\nUsing the end of the capillary tube, gently move the pelvic fins laterally away from the midline to expose the cloaca (Figure 1C).\nPosition the end of the capillary tube near the cloaca.\nUsing the forceps, gently squeeze the sides of the fish beginning just below the gills and ending at the cloaca (Figure 1C').\nCollect sperm into the capillary tube by capillary action. Approximately 1 µL is sufficient for this procedure (Figure 1D).\n\t\tNOTE: Some labs report using p10 pipet tips instead of capillary tubes for sperm collection.\nIf sperm is not released with gentle pressure, return the fish to the system water.\n\t\t\nMonitor for recovery from the anesthesia.\nDo not squeeze the fish hard to expel sperm, as this can injure the fish.\nRest the fish for 2 weeks before attempting to collect sperm again.",
    "After collection, place the fish into a clean isolation tank with system water for individual housing.\n\t\t\nMonitor the fish for recovery from the anesthesia.\nRest the fish for 2 weeks before attempting to collect sperm again.\nPlace the capillary tube with the collected sperm into the prepared PCR tube (with 40 µL of 50 mM NaOH).\nSqueeze the rubber bulb to expel the collected sample.\nDispose of the used capillary tube into an approved glass waste container.\nIncubate the samples on ice until all the males have been squeezed.\nRepeat steps 4.1-4.5 for each individual male.\nLabel the isolation tanks and sperm samples such that the final sperm genotyping results can be traced back to the corresponding individual with putative mutations.\nMonitor all the individuals, and make sure they are upright and exploring their tanks before putting the tanks back on the system.\nPut the females used for priming back into their respective tanks on the system.\nIf any fish does not recover from the anesthesia after 10 min, follow the euthanasia procedure approved by the institution associated with the lab.\n\t\nExample: Rapid chill the individual in an ice bath with fish water that is 2-4 °C.\nDispose of the euthanized fish in an appropriate animal carcass waste container according to the procedure approved by the institution associated with the lab.\n5. Extracting DNA from the sperm samples\nBriefly spin down all the sperm samples in a minicentrifuge, and place PCR tubes into a thermal cycler.\nClose the lid of the thermal cycler.\nRun the following settings in the thermal cycler:\n\t\nHeat the samples for 40 min at 95 °C.\nCool the samples to 25 °C.\nRemove the samples from the thermal cycler.",
    "With a clean pipette tip for each sample, neutralize the pH by adding 10 µL of 1 M Tris-HCl (buffered to pH 8).\nMix well by pipetting up and down.\nBriefly spin down the samples in a minicentrifuge.\nGenomic DNA samples can be stored for several days at 4 °C or placed at −20 °C for up to 6 months.\n6. PCR amplification (and/or restriction digest) of the desired locus\nAmplify the desired locus using a standard PCR protocol.\n\t\nPreheat the thermal cycler to the initial denaturation temperature in the PCR reaction below.\nPrepare a 25 µL reaction mixture for each sperm sample in PCR tubes:\n\t\t12.5 µL of 2x Taq Polymerase Master Mix\n\t\t1.5 µL of 10 µM forward primer\n\t\t1.5 µL of 10 µM reverse primer\n\t\t4.5 µL of nuclease-free water\n\t\t5 µL of neutralized sperm DNA sample\nMix well by pipetting up and down.\nBriefly spin down the samples in a minicentrifuge.\nPlace the samples in the pre-heated thermal cycler with the following settings:\n\t\tInitial denaturation: 95 °C for 3 min\n\t\t35 cycles of denaturation (95 °C for 30 s), annealing (55 °C for 30 s), and extension (72 °C for 30 s)\n\t\tFinal extension: 72 °C for 5 min\n\t\tNOTE: It may be necessary to adjust the extension temperature and/or time depending on the specific Taq polymerase and the expected length of the PCR amplification product.\nRemove the PCR samples from the thermal cycler.\nOptional: Perform the donor-specific restriction digest on a small volume of the PCR product, leaving at least 5-10 µL of undigested PCR product for gel electrophoresis.\n\t\nPrepare a 30 µL reaction in 0.2 mL PCR tubes:\n\t\t10 µL of unpurified PCR product\n\t\t15 µL of nuclease-free water\n\t\t3 µL of 10x restriction enzyme buffer",
    "2 µL of restriction enzyme (BstNI is used in the representative results for analyzing the dnah10 knock-in allele)\n\t\t​NOTE: Many restriction enzymes are still active in a typical PCR reaction buffer; however, the addition of restriction digest buffer can help improve the results. Refer to specific manufacturer instructions for troubleshooting if any problems occur.\nMix well by pipetting up and down.\nBriefly spin down the samples in a minicentrifuge.\nPlace the samples in a thermal cycler with the following settings:\n\t\t\nCut the PCR amplicon at 60 °C for 1 h.\n\t\t\tNOTE: The cut temperature and incubation time may need to be adjusted for the specific restriction enzyme being used.\nInactivate the restriction enzyme with the required temperature and incubation time, if indicated by the manufacturer.\n\t\t\t​NOTE: The BstNI enzyme does not require heat inactivation.\n7. Performing gel electrophoresis to separate PCR amplicons of varying sizes\nPrepare 500 mL of 0.5x TBE running buffer: add 50 mL of 10x TBE buffer concentrate to 450 mL of deionized water.\nPrepare 100 mL of 4% agarose gel in 0.5x TBE running buffer: add 4 g of agarose with 10 µL of 10,000x gel stain to 100 mL of 0.5x TBE running buffer. Microwave until the agarose powder is fully dissolved.\n\t\nPour the gel solution into an appropriately sized gel casting frame, and insert the comb on one side of the gel.\n\t\tNOTE: A larger gel size (recommended: 15 cm x 15 cm) is advantageous for this procedure, as it provides the amplicons with more space to resolve on the gel.",
    "If a restriction digest product is to be analyzed, it is best to run it on the same gel as the PCR product so that the results can be compared. Adjust the comb well size as necessary to fit all the samples on the gel.\nLeave the gel at room temperature until solidified. Carefully remove the comb. Carefully remove the gel from the casting frame.\nSet up the gel electrophoresis rig.\n\t\nPosition the gel in the electrophoresis rig such that the wells are nearest the negative electrode. Pour 0.5x TBE running buffer into the electrophoresis rig until the wells are fully submerged.\nLoad the gel.\n\t\nLoad 5 µL of DNA ladder into the first well (choose a DNA ladder that contains DNA fragments that are similar in size to the PCR amplicon).\nUsing a new pipette tip for each sample (including the wild-type control sample), load 5-10 µL of the PCR product into the remaining wells.\nOptional: If a restriction digest product is to be analyzed, load these samples onto the gel as well.\n\t\tNOTE: It is best to load equal amounts of DNA between the PCR and the restriction digest product. For example, in the 30 µL restriction digest reaction mixture, 10 µL of PCR product was added. Therefore, the DNA concentration of the 15 µL of digest product was comparable to the 5 µL of unpurified PCR product.\nRun the gel.\n\t\nConnect the electrodes to the gel electrophoresis rig, and apply 150 V for at least 1 h to ensure adequate separation of the amplicons.\nImage the gel to view the DNA bands.\n\t\t​NOTE: Strongly mutagenized CRISPR-targeted loci will run as multiple band sizes representing a combination of insertion/deletion alleles with the wild-type amplicons.",
    "If the gel bands are not resolved after 1 h, apply 150 V to the gel for 15 min intervals until the bands are sufficiently separated on the gel.\nOptional: If screening for the insertion of a precise edit such as an SNP, epitope tag, or fluorescent tag, screen the sperm DNA with PCR methods that are specific to the desired edit. For example, when identifying a donor-specific restriction site, an additional band will be present in the restriction digest product compared to the PCR product of the sperm sample.\n8. Isolating germline stable alleles\nAfter 2 weeks of rest from the sperm squeezing procedure, outcross the F0 individuals whose sperm genomic DNA contained the desired edits.\n\tNOTE: Sperm generation from individual spermatogonia clones may be cyclical in zebrafish; thus, the desired allele might not be producing sperm at the time of the outcross. For this reason, additional crossing may have to be performed more than once to isolate the allele implicated by the initial screening.\nOnce the F1 outcrossed fish are sexually mature, proceed with standard genotyping methods (for example, fin-clip DNA) using the same PCR and gel electrophoresis protocol performed during the screening of the sperm genomic DNA.\n\t\nSanger sequence the PCR products to identify the F1 individuals with the same desired edit.\nOptional: If the desired edit introduces or disrupts a restriction site, screen with an appropriate restriction digest protocol.\nIn-cross F1 heterozygotes with the same desired edit.\nScreen the F2 progeny for the expected phenotype and/or genomic edits.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}