{
  "id": 17765,
  "origin_website": "Jove",
  "title": "Phosphoproteomic Strategy for Profiling Osmotic Stress Signaling in Arabidopsis",
  "procedures": [
    "1. Sample preparation\nHarvest the control and stress treated seedlings (1 g) in an aluminum foil and flash freeze the samples in liquid nitrogen.\n\tNOTE: Higher protein concentration is usually observed from two-week-old seedlings than that from mature plants. One gram of seedlings generates approximately 10 mg of protein lysate, which is enough for the MS analysis. All centrifugation steps take place at 16,000 x g in step 1.\nGrind frozen seedlings into a fine powder using a mortar and pestle filled with liquid nitrogen.\nAdd 1 mL of lysis buffer ((6 M guanidine-HCl in 100 mM Tris-HCl, pH 8.5) with 10 mM Tris (2-carboxyethyl)phosphine hydrochloride (TCEP), 40 mM 2-chloroacetamide (CAA), protease inhibitor and phosphatase inhibitor cocktails) to the mortar and mix with the aid of pestle.\nTransfer the plant lysate to a 1.5 mL tube and heat at 95 °C for 5 min.\nPlace the tube on ice for 10 min. Sonicate the tube on ice for 10 s, pause for 10 s, and repeat thrice.\nCentrifuge the tube for 20 min and aliquot 150 µL of plant lysate into a 1.5 mL tube.\nAdd 600 µL of 100% methanol into the tube. Vortex and spin down the tube.\nAdd 150 µL of 100% chloroform into the tube. Vortex and spin down the tube.\nAdd 450 µL of ddH2O into the tube. Vortex and centrifuge the tube for 3 min.\nDiscard the upper aqueous layer. Add 600 µL of 100% methanol into the tube. Centrifuge the tube for 3 min and then discard the solution.\nWash protein pellets with 600 µL of 100% methanol. Discard the solution and air dry the protein pellet.",
    "Resuspend protein pellets into 600 µL of digestion buffer (12 mM sodium deoxycholate (SDC)/12 mM sodium lauroyl sarcosinate (SLS) in 100 mM Tris-HCl, pH 8.5). Sonicate the tube until the suspension is homogenized.\nMeasure the protein concentration using a BCA kit and adjust the concentration to 4 µg/µL with the digestion buffer. Transfer 100 µL of the lysate (400 µg proteins) into a new tube.\nAdd 292 µL of 50 mM triethylammonium bicarbonate (TEAB) and 8 µL of Lys-C (2.5 Unit/mL) to the tube. Incubate the tube at 37 °C for 3 h.\nAdd 100 µL of 50 mM TEAB with 8 µg trypsin to the tube. Incubate the tube at 37 °C for 12 h.\nAdd 25 µL of 10% trifluoroacetic acid (TFA) to the tube. Vortex and centrifuge the tube for 20 min at 4 °C.\nTransfer the supernatant into a conditioned desalting column for desalting. Dry the eluate using a vacuum centrifuge concentrator.\n\tNOTE: Activate the resin with 1 mL of methanol followed by 1 mL of 0.1% TFA in 80% acetonitrile (ACN). Wash out the organic solvent with at least 3 mL of 0.1% TFA in 5% ACN. Load acidified peptide samples prepared in step 1.16 into the column and then wash the column with at least 3 mL of 0.1% TFA in 5% ACN. More washes may be needed for samples with high salt concentrations. Elute the phosphopeptides with 1 mL of 0.1% TFA in 80% ACN.\n2. Tandem Mass Tag (TMT) labeling\nResuspend the dried peptides into 100 µL of 200 mM 4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid (HEPES), pH 8.5.\nDissolve the TMT reagent of each channel (0.8 mg) in 40 µL of anhydrous ACN. Vortex the TMT reagent tube for 5 min and spin it down.",
    "Transfer 40 µL of TMT to the sample tube and incubate for 1 h at room temperature.\n\tNOTE: In this experiment, the channel 126 to 128 were labeled with three biological replicates of plants without mannitol treatment, and the channel 129 to 131 were labeled with three biological replicates of plants with mannitol treatment.\nAdd 8 µL of 5% hydroxylamine and incubate for 15 min.\nMix 6 samples in a 5 mL tube and add 14 µL of 10% TFA.\nAdd 3,876 µL of 0.1% TFA to the tube. Vortex and spin down.\nTransfer the solution to a conditioned desalting column for desalting. Dry the eluate using an evaporator.\n3. Preparation of IMAC stage tip\nUse a 16 G blunt-ended needle to penetrate a polypropylene frit disk.\n\tNOTE: Hold the cutter perpendicular to the surface of the disk and roll the cutter a couple of times to make sure that the disk is completely excised. Place the disk in a Petri dish for storage. Place the needle into a 200 µL pipette tip and push the frit into the tip using a plunger.\nPress the frit gently into the tip using a plunger to cap the end of tip.\n\t\nPlace the frit disk in tips with the same pressure, which provides better reproducibility. The reproducibility of stage tips production is important for constant back pressure, which affects the timing of the centrifuge steps and reproducibility between technical replicates.\nIf the stage tips show high back pressure during conditioning step, discard the tips to avoid potential tip clogging when while loading samples. It could be that the disk might have been pressed too hard into position.\nInvert Ni-NTA spin column and place on a 1.5 mL tube.",
    "Use a plunger to press the frit of Ni-NTA beads gently and push the beads into the tube.\n\tNOTE: Ensure to push the frit gently to avoid the potential bead loss or adsorption on the spin column.\n4. Preparation of Hp-RP stage tip\nPrepare Hp-RP stage tip as described for IMAC stage tip using a C8 disk.\n\tNOTE: Do not apply large force to the disk because it may result in a densely packed frit and increase the back pressure of the stage tip. All centrifugation steps take place at 1,000 x g for 5 min in step 4.\nSuspend 1 mg of C18 beads in 100 µL 100% methanol and pass the beads solution through the tip.\nAdd 20 µL of buffer 8 (80% ACN/20% 200 mM NH4HCO2, pH 10.0) to the stage tip and pass buffer 8 through the tip by centrifugation.\nAdd 20 µL of Buffer A (200 mM NH4HCO2) to the stage tip and pass buffer A through the tip by centrifugation.\n\tNOTE: Balance the centrifuge during use and ensure that the Hp-RP stage tip is not completely dried.\n5. Preparation of spin adaptor\nUse sharp end tweezers to puncture a hole at the center of the lid of a 1.5 mL tube.\nInsert the IMAC stage tip or Hp-RP stage tip into the hole of the spin adaptor.\n\tNOTE: Ensure that the stage tip is not close to the bottom of spin adaptor.\n6. Phosphopeptide enrichment using IMAC stage tip\nSuspend the 10 mg Ni-NTA beads with 400 µL of loading buffer (6% acetic acid (AA), pH 3.0) and load all of the beads solution into per tip. Pass the solution through the tip by centrifugation.\n\tNOTE: All centrifugation steps take place at 200 x g for 3 min in step 6 besides step 6.8.",
    "Load 100 µL of 50 mM ethylenediaminetetraacetic acid (EDTA) to strip the nickel ions from IMAC stage tip and pass the solution through the tip by centrifugation.\nLoad 100 µL of loading buffer to the stage tip and pass the solution through the tip by centrifugation.\nLoad 100 µL of 50 mM FeCl3 in 6% AA to the stage tip and pass the solution through the tip by centrifugation. Fe3+ ions will chelate to IMAC stage tip.\nLoad 100 µL of loading buffer to condition the stage tip and pass the solution through the tip by centrifugation.\nLoad 100 µL of loading buffer with sample peptides prepared in step 2.7 to the stage tip and pass the solution through the tip by centrifugation.\n\tNOTE: Take a new tube as a spin adaptor to collect the flow-through of sample and store the flow-through in the freezer for future analysis.\nLoad 100 µL of washing buffer (4.5% AA and 25% ACN) to the stage tip and pass the solution through the tip by centrifugation.\nPerform the second wash with loading buffer. Load 100 µL of loading buffer to the stage tip and pass the solution through the tip using 1000 × g centrifuge for 3 min.\n\tNOTE: Ensure the washing buffer is replaced by loading buffer in the stage tip to eliminate the loss of phosphopeptides during elution step. Equilibrate the IMAC stage tip prior to phosphopeptide elution to ensure the concentration of ACN is below 5%.\nTrim the IMAC stage tip at the front with a scissors and place the trimmed IMAC stage tip inside the Hp-RP tip. Ensure that the two layers of stage tips do not touch the lid of the centrifuge.\n7. Phosphopeptide fractionation using Hp-RP C18 stage tip",
    "Add 100 µL of elution buffer (200 mM ammonium phosphate (NH4H2PO4)) to the trimmed IMAC stage tip and pass the solution through the two layers of stage tips by centrifugation.\n\tNOTE: If the solution does not pass through the stage tip, increase the speed of spin down. All centrifugation steps take place at 1,000 x g for 5 min in step 7. All the Hp-RP buffers are listed in Table 1.\nDiscard the IMAC stage tip using a tweezers and add 20 µL of Buffer A to the Hp-RP stage tip and pass the buffer through the tip by centrifugation.\n\tNOTE: Ensure all the elution buffer pass through the IMAC stage tip before discarding it.\nAdd 20 µL of Buffer 1 to elute fraction 1 and collect the eluate in a new tube by centrifugation. Repeat the process with Buffers 2, 3, 4, 5, 6, 7, and 8 to collect each fraction in a new tube. Dry the final eluate of each fraction using a vacuum concentrator.\n\tNOTE: Prepare fresh fractionation buffers. Take 8 new tubes as the spin adaptor of each fraction. Collect the eluate of each fraction in a different spin adaptor. Phosphopeptides are not stable under basic conditions, so dry the eluates by a concentrator or acidified by 10% TFA immediately.\n8. LC-MS/MS analysis and data analysis\nAdd 5 µL of 0.1% formic acid (FA) and analyze the sample by a mass spectrometer.\nRun a 90 min gradient with 6-30% buffer B (80% ACN and 0.1% FA) for each fraction.\nFragment the top 10 labeled peptides using high collision energy dissociation (HCD). Complete a database search to identify phosphorylation sites.\nLoad the raw files into the MaxQuant software, name the experiments, and set fractions and PTM.\n\tNOTE: The tutorial of MaxQuant software can be found at https://www.maxquant.org/.",
    "Select reporter ion MS2 in the type of LC-MS/MS run and 6plex TMT as isobaric labels. Enable filter by PIF function and set the min PIF as 0.75.\nSelect Acetyl (Protein N-term), Oxidation (M), and Phospho (STY) to the panel of variable modifications. Select Carbamidomethyl (C) as fixed modifications.\nSet digestion mode as specific, select Trypsin/P as digestion enzyme, and two missed cleavage.\nSet PSM false discovery rate (FDR) and protein FDR as 0.01. Set the minimum score for modified peptides as 40.\nAdd Arabidopsis thaliana database to the panel of fasta files and run database searching.\nLoad the txt file of Phospho (STY) sites to the Perseus software as the search is done.\n\tNOTE: The detailed tutorials of Perseus software can be found at https://www.maxquant.org/perseus/.\nFilter out the reverse phosphorylation sites. Filter out the unlocalized phosphorylation sites using localization probability 75% as the cut-off.\nUse the intensities of phosphorylation sites for statistical analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}