{
  "id": 19112,
  "origin_website": "Jove",
  "title": "Improving IV Insulin Administration in a Community Hospital",
  "procedures": [
    "1. PART I: Existing Paper Protocol\n1.1 Baseline study of existing paper protocol\nThe initial paper intravenous (IV) insulin protocols developed at WMC called for tight glucose control of 80 to110 mg/dL in ICU patients and more liberal glucose control of 95 to120 mg/dL in non-ICU patients. Both protocols utilized basal IV insulin infusions as well as insulin boluses.9 To determine the ability of these paper protocols to produce blood glucose concentrations within goal ranges, 13 patients were followed who were managed on the non-ICU protocol for a total of 1221 hours with 637 blood glucose (BG) determinations. The results on this baseline analysis did not yield an appropriate number of blood glucose concentrations within the target range (Figure 1), warranting a revision to the existing protocol.\n1.2 First Revision of paper protocol\nDue to the unacceptable number of errors committed by staff, the facility-wide IV insulin paper protocols were revised as follows: \nThe new protocol was more patient-specific, modeled after the protocol published by Trence and colleagues, utilizing four algorithms reflecting the patient's level of insulin sensitivity.10 \nThe target blood glucose concentration goal range was widened to 80 to 180 mg/dL in accordance with the new protocol.\nOnly IV insulin infusion adjustments were included and insulin bolus administration was removed, potentially eliminating 44% of errors.    \n13 more non-ICU protocol patients were followed for a total of 896 hours with 649 blood glucose determinations. \n    The results from the first revision of the paper protocol did not yield an appropriate number of blood glucose concentrations within the target range (Figure 4), warranting another revision. \n1.3 Second Revision of paper protocol \nAs a result of the analysis of the first revision, further changes were made to the paper protocol: \nAny ambiguous language was \"cleared up\".",
    "An extensive educational program was undertaken with the protocol end users (i.e. the nursing staff).  \n     \nAfter these two efforts, the second revised IV insulin paper protocol was re-evaluated using data from more non-ICU protocol 16 patients (18 separate implementations, 783 hours total on the protocol and 594 blood glucose determinations).\n1.4 Baseline study of existing paper protocol\nUltimately, use of the original paper protocol was associated with a 16.5% prevalence of blood glucose readings of ≤ 94 mg/dL and 4.2% prevalence of readings of less than 70 mg/dL (Figure 1). Of concern was the finding that 85% (22/26) of hypoglycemic events (i.e. BG < 70 mg/dL) were not due to the actual protocol, but resulted from error in utilizing the paper protocol (Figure 2). \n1.5 Limitations and Benefits of paper protocols \nLimitations: higher rates of hypoglycemia and hyperglycemia leading to increases in morbidity and mortality, association with more errors in protocol implementation, and more labor intensive garnering of patient data.\nBenefits: no direct capital or ongoing maintenance costs, no required IT support.\n2. PART 2: Computerized Glucose Management System\nDue to the unsatisfactory results obtained from the paper protocol revisions, a decision was made to implement a computerized glucose management system (CGMS) [EndoTool (Hospira, Inc. Lake Forest, IL)] designed to customize IV insulin dosing to an individual patient's needs. \n2.1 Implementing a computerized glucose monitoring system\nThere were several key steps taken prior to implementing the CGMS:\nPreparation of a return on investment (ROI) document, including an analysis of the current glycemic control situation, projected results with using a CGMS, and general estimated cost savings from a potential decrease in length of stay (LOS) of hyperglycemic patients.",
    "Compilation of data regarding medication errors due to use of the current 2nd revised IV insulin administration paper protocol, coupled with current and projected rates of hypoglycemia. \nPresentation of CGMS and ROI data to all committees and staff whose approval was required, including Sugarbabies (the hospital committee responsible for overseeing diabetes treatment, insulin therapy, hypo- and hyperglycemia management), Finance, Quality Management, Professional Practice Council, Quality and Safety Coordinating Council, and the Administration Council. \nDevelopment of order sets based on CGMS templates for hyperglycemia and diabetic ketoacidosis (DKA). \nDetermination of blood glucose target ranges.    \nDetermination of CGMS parameters, including specific insulin types for transitioning patients off the CGMS. \nDevelopment of an overall education plan for end users. \nAfter buy-in and approval, contracts were signed in March 2009 and implementation of the CGMS was scheduled. \nIn May 2009, there was a preliminary project assessment with Information Technology (IT) and the CGMS vendor representatives, after which the project was initiated by all involved parties.\nAll nursing staff and physician end users were educated on CGMS usage, including information about the positive effects of achieving effective glycemic control: the software vendor provided a clinical nurse team to review the software with the nurses, providing a classroom training as well as hands on experience with a computer simulation for viewing the software screens and entry specifics.    \nPharmacy and Endocrinology developed and uploaded preprinted orders onto the hospital intranet. \nOrder sets were built into the pharmacy information system to ensure consistency when entering IV admixtures into the medication administration records.",
    "In September 2009, after extensive training of virtually all nurses, CGMS went live in the ICU and PCU (Progressive Care Unit). During the transition phase to the CGMS, the vendor nurse team was available onsite for 3 days to assist with starting the first group of patients on EndoTool.  \nA phased roll-out to the rest of the institution was begun in October 2009.\n2.2 Limitations and Benefits of CGMS protocol\nLimitations: higher initial implementation costs, significant IT support requirements, and ongoing maintenance software fees and support requirements.\nBenefits:  longer maintenance of patient blood sugar in goal range, faster entrance of patient blood sugar levels into goal range, less hypoglycemia and hyperglycemia, fewer errors in protocol implementation, easier patient data extraction, prebuilt SQ transition orders based upon specific level of patient insulin resistance, and built in clinical alerts.\n    \n \nProtocol\n3. Using EndoTool for Computerized Glucose Monitoring\nAfter opening the program, find the patient of interest by clicking on the \"Search for New Patient\" link. Then, in the \"Search for New Patient\" pop-up window, login by entering the User ID and password.    \nAfter clicking OK, enter the Account Number into the Account Number window of the \"Search for New Patient\" screen. Then after clicking \"Search\", the new patient information will be appear, allowing the patient to be selected.    \nAfter clicking OK to add the patient, the demographic screen is displayed. Enter the patient's clinical information on this screen, such as the patient's diabetic status, weight and creatinine level, and whether the patient has received any oral or IV steroids in the past 24 hours.",
    "Once the clinical data has been entered, click save and continue to bring up the initial patient record screen and then enter the patient's initial glucose reading. A box will then pop up asking for verification of the glucose that was entered. Enter the glucose level again and click OK.\nNow check that all the patient information is correct in the green \"Confirmation\" pop up screen and click OK.    \nNext a yellow \"Calculations\" screen that tells how much of an insulin bolus to give (if necessary), at what rate to run the infusion, and when to check the next glucose will appear.    \nWhen subsequent glucose readings are entered, EndoTool asks for confirmation that the recommended insulin dose was indeed administered and if any \"extra\" calories were given that could have affected the patient's glucose reading. Adjust the insulin dosage and calorie information in the green \"Confirmation\" screen as necessary.    \nAfter clicking OK, a yellow \"Calculations\" screen with insulin bolus (if necessary), insulin infusion rate, and next check time information will appear. After making note of these recommendations, click FINISHED. \n4. EndoTool Verifications, Warnings, Record Keeping, and Off Unit Use\nWhen checking glucose early, EndoTool will ask for verification of the request to ensure that the patient has not been selected in error. If the correct patient has been selected, click OK.\nIf unexpected glucose values are entered or in some cases, if expected information is missing, a \"Clinical Advisory\" window will pop up. After noting the warning information, click  CONTINUE to make any necessary changes to the patient information.\nClick on the \"Glucose Record\" tab to find a record of each patient's glucoses, insulin bolus amounts, insulin infusion rates, intervals between checks, and the name of the Nurse who entered these data.",
    "When a patient needs to go off the unit to an area where EndoTool isn't available, click on the \"Print patient reports/orders\" link in the box at the top of the column on the left hand side of the home screen. Select the \"I.V. Insulin Drip orders (for TEMPORARY use without EndoTool)\" box and click OK to display print the recommendations for adjusting the IV insulin infusion until the patient returns and can be placed back on EndoTool. Then click on the printer icon in the left, upper corner to print.    \nFinally, when the patient is ready to transition off of EndoTool and over to subcutaneous insulin, EndoTool will provide transition dose recommendations for the first 24 hours. These transition orders are also accessed from the \"Print patient reports/orders \" link.  Select \"Fixed insulin order options\" and then select the appropriate transition order. \n5. Results\nAs previously stated, implementation of the paper protocol resulted in errors in blood glucose level readings (Figure 1) and in increases in hypoglycemic events (Figure 2). Further investigation uncovered the multiple causes of these errors (Figure 3). Omitting the insulin bolus and not changing the rate of the insulin infusion when instructed to do so in the protocol accounted for 55% of all errors. Other error types included incorrect change in the IV insulin rate, either too high or too low, and incorrect insulin bolus dose administered, either too high or too low.",
    "At WMC, a non for profit care center based in Casper, WY, there are 207 beds. Note that all the patient data collected for each revision during the data capture period was for patients on the non-icu protocol. The patients were comparable because they were all patients on the current protocols at the time data was captured. There were different numbers of glucose measurements per day and in total for each patient because each patient's glycemic control is individualized, and the number of readings per day and the number of days on the protocol is be a reflection of each individual patient's clinical condition. There were more patients in the CGMS group and the data capture period was larger for that group, because the ability to capture data with CGMS is significantly less labor intensive compared to manual chart data capture for the paper protocol groups. \n5.2 First Revision of paper protocol \nOne-third of all blood glucose readings were above 180 mg/dL, while only 2.5% were below 80 mg/dL and 0.3% were below 60 mg/dL (Figure 4). Furthermore, analysis of the blood glucose readings per patient on the day of treatment showed that the majority of readings on day 1 were not within the goal range, and that from day 2 onward, the majority of readings were within the goal range of 80 to 180 mg/dL.",
    "The frequency of staff deviating from the revised protocol was also examined.  Any clinical justification for deviating from the revised protocol was also sought. There were a total of 317 protocol deviations and only 21 (7%) were clinically justifiable. This meant that protocol deviation without clinical justification occurred at a rate of one per every three hours on the protocol. The types of deviations included inappropriate titrating when BG concentrations were already within goal range, using the incorrect algorithm, drawing the sample for blood glucose determination at the wrong time, and choosing the wrong IV insulin infusion rate from the protocol (Figure 5).\n5.3 Second Revision of paper protocol \nEven after the second revision to the paper protocol, the rates of hypoglycemia (<60 mg/dL) and hyperglycemia (>180 mg/dL) continued to be very high at 4.7% and 26.3%, respectively (Figure 6).  It was also found that on day 2 and beyond the majority of blood glucose readings were within the goal range of 80 to 180 mg/dL. \nOf concern, again, the deviations from protocol without clinical justification were still very high at 83.5% (203/243). This meant that deviations from protocol without clinical justification occurred at a rate of one per every four hours on the protocol. Upon further analysis, the causes of the deviations from protocol without clinical justification were identified. The causes for the errors were basically unchanged from those of the previous analysis (Figure 5) and included inappropriate titrating when BG concentrations were within goal range, using the incorrect algorithm, drawing the sample for blood glucose determinations at the wrong time, and choosing the wrong IV insulin infusion rate from the protocol (Figure 7).",
    "After reviewing these data, the rates of hypo- and hyperglycemia were judged unacceptable. The 2nd revision of the paper protocol had resulted in a decreased prevalence of hyperglycemia with the prevalence above 180 mg/dL decreasing from 32.8% to 26.3%.  However, an increased rate of hypoglycemia also resulted with the prevalence of BG less than 60 mg/dL increasing from 0.3% to 4.7%.  \nUnfortunately, by revising the protocol in an attempt to explicitly clear up ambiguous areas, the complexity of the protocol had increased. This led to difficulty with nursing staff correctly utilizing the protocol. Frequently, multiple nurses would form a group to decide what should be done next. Often, the wrong decision was still made. \n5.4 CGMS Implementation\nA substantial increase in the time spent within the target blood glucose concentration range, as well as a decrease in the prevalence of severe hypoglycemia (BG < 40 mg/dL), clinical hypoglycemia (BG < 70 mg/dL), and hyperglycemia (BG > 180 mg/dL) was witnessed in the first five months of CGMS use (Figure 8). Examining the actual blood glucose concentrations achieved through use of the various dosing protocols provided some interesting results. \nUse of the initial paper protocol including 2 revisions produced substantially higher hypoglycemia rates (below 70 mg/dL or 60 mg/dL) compared with the CGMS protocol.  In addition, the CGMS protocol maintained blood glucose concentrations within the target range for a much longer proportion of treatment time compared with the paper protocols (Table 1).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3705/3705fig1.jpg",
    "Figure 1.  Initial Paper IV Insulin Protocols: BG Concentration Ranges. Data are presented in a bar graph of the blood glucose concentrations ranges for patients managed under the original IV Insulin Paper Protocol and administered either basal IV insulin infusions and/or insulin boluses. Under the original protocol, a tight glucose control, of 80-110 mg/dL in ICU patients and of 95-120 mg/dL in non-ICU patients was utilized. To determine the ability of the paper protocols to produce blood glucose concentrations within goal ranges, 13 patients were followed who were managed on the non-ICU protocol for a total of 1221 hours with 637 BG determinations. Use of the original paper protocol was associated with a 16.5% prevalence of blood glucose readings of ≤ 94 mg/dL and 4.2% prevalence of readings of less than 70 mg/dL.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3705/3705fig2.jpg\nFigure 2.  Initial IV Insulin Paper Protocols: Causes of Hypoglycemia. Close evaluation of the initial protocol revealed that 85% (22/26) of hypoglycemic events (i.e. BG < 70 mg/dL and) were not due to the actual protocol (represented by the blue bars), but resulted from error in utilizing the paper protocol (red bars). \nimgsrc://cloudfront.jove.com/files/ftp_upload/3705/3705fig3.jpg\nFigure 3.  Initial IV Insulin Paper Protocols: Types of Errors. Further investigation into the kinds of errors being committed during management of the Paper Protocol indicated that failure to administer the insulin bolus and not changing the rate of the insulin infusion when instructed to do so in the protocol accounted for the majority (55%) of all errors. Other types of error included incorrect changes in the IV insulin rate, either too high or too low, incorrect insulin bolus dose administered, either too high or too low, and utilizing the wrong protocol all together.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3705/3705fig4.jpg",
    "Figure 4.  Revised IV Insulin Paper Protocol (1st revision):  BG Concentration Ranges. Under the first revision of the protocol, the target blood glucose concentration goal range was widened to 80 to 180 mg/dL and only IV insulin infusion adjustments were included (insulin bolus administration was removed). To determine how effective these revisions were in improving glycemic control, 13 more patients were followed for a total of 896 hours with 649 blood glucose determinations. One-third of all blood glucose readings were still above 180 mg/dL, while only 2.5% were below 80 mg/dL and 0.3% were below 60 mg/dL.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3705/3705fig5.jpg\nFigure 5.  Revised IV Insulin Paper Protocol (1st revision): Deviations Without Clinical Justification. The frequency and clinical justification of staff deviating from the first revision of the protocol for any reason was examined. There were a total of 317 protocol deviations, only 21 of which (7%) were clinically justifiable, resulting in one unwarranted deviation per every three hours on the revised protocol. The types of deviations included inappropriate titrating when BG concentrations were already within goal range, using the incorrect algorithm, drawing the sample for blood glucose determination at the wrong time, and choosing the wrong IV insulin infusion rate from the protocol.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3705/3705fig6.jpg\nFigure 6.  Revised IV Insulin Paper Protocol (2nd revision):  BG Concentration Ranges. Data from 16 patients (18 separate implementations, 783 hours total on the protocol and 594 blood glucose determinations) was measured to evaluate improvements in glycemic control under the second revision of the paper protocol. It was determined that the rates of hypoglycemia (<60 mg/dL) and hyperglycemia (>180 mg/dL) remained unacceptable, at 4.7% and 26.3%, respectively.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3705/3705fig7.jpg",
    "Figure 7.  Revised IV Insulin Paper Protocol (2nd revision): Deviations Without Clinical Justification. Under the second revision, the deviations from protocol without clinical justification remained high at 83.5% (203/243), resulting in unwarranted deviations at a rate of one per every four hours on the protocol. Further analysis revealed that the causes of the deviations were determined to be identical to those under the previous version of the protocol, and included in addition, inappropriate titrating when BG concentrations were within goal range, using the incorrect algorithm, drawing the sample for blood glucose determinations at the wrong time, and choosing the wrong IV insulin infusion rate from the protocol.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3705/3705fig8.jpg\nFigure 8.  CGMS: BG Concentration Ranges. Patient BG ranges were monitored during the first 5 months of use of the CGMS protocol. Time spent within the target blood glucose concentration range was substantially increased, and the prevalence of severe hypoglycemia (BG < 40 mg/dL), clinical hypoglycemia (BG < 70 mg/dL), and hyperglycemia (BG > 180 mg/dL) was decreased.  \ntable:\n﻿0,1,2\nBlood Glucose Readings (%),Blood Glucose Readings (%),Blood Glucose Readings (%)\n,Hypoglycemiabelow 70 mg/dL,In target range\nOriginal paper protocol,4.2,32.2\nPaper protocol revision #1*,1.4,64.7\nPaper protocol revision #2*,6.9,63.6\nCGMS,0.8,86.1\nTable 1.  Blood Glucose Readings: Paper vs. CGMS. (* The original data capture was for hypoglycemia rates below 60 mg/dL, however, for consistency the data was reanalyzed using a hypoglycemia cutoff of below 70 mg/dL).\ntable:\n﻿0,1\nDate/Time,Steps Taken\nEarly 2008,Vendor presentation on CGMS\nEarly 2008 + 3 months,\"ROI prepared (analysis of paper protocol system, projected results with CGMS, general estimated cost savings with CGMS, paper protocol medication errors) and presented to Sugarbabies*, Finance, Quality Management, Professional Practice Council, Quality and Safety Coordinating Council, and Administration Council.\"\nMarch 2009,\"Buy-in, approval, contract signing, and scheduling of CGMS implementation\"",
    "March-May 2009,\"Development of CGMS order sets (for hyperglycemia, DKA, and BG target range determination), of CGMS parameters (including specific insulin types for transitioning patients off CGMS), and of an overall education plan for end users\"\nMay 2009,Preliminary project assessment with IT and CGMS vendors\nMay-Sep 2009,Facility-wide training of nursing and medical staffs; Development of preprinted orders by Pharmacology and Endocrinology; Entrance of order sets into pharmacy information system\nSep 2009,CGMS implemented in ICU and PCU\nOct 2009,Phased roll out to rest of institution\nTable 2.  CGMS Protocol Implementation Timeline. CGMS: Computer Glucose Monitoring System; ROI: return on investment; DKA: diabetic ketoacidosis; BG: blood glucose; IT: information technology; ICU: intensive care unit; PCU: progressive care unit. *Sugarbabies: WMC hospital committee responsible for overseeing diabetes treatment, insulin therapy, hypo- and hyperglycemia management."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}