{
  "id": 18044,
  "origin_website": "Jove",
  "title": "Complete and Partial Aortic Occlusion for the Treatment of Hemorrhagic Shock in Swine",
  "procedures": [
    "In conducting research using animals, the investigators adhered to the Animal Welfare Act Regulations and other Federal statutes relating to animals and experiments involving animals and the principles set forth in the current version of the Guide for Care and Use of Laboratory Animals of the National Research Council. This study protocol was approved by the University of Michigan Institutional Animal Care and Use Committee (IACUC). The experiments were conducted in compliance with all regulations and guidelines regarding animal welfare in research.\n1. Animal Selection and Acclimation\nUse female Yorkshire-Landrace crossbred swine (n = 2/group, age range: 5 - 6 months, weight range: 40 - 60 kg) for the experiment.\nAfter their arrival at the facility, house the animals individually in cages but ensure that there is ample interaction between the animals in neighboring cages.\nHouse the animals for at least 5 d so that they are completely acclimated before performing the experiment. During this period, feed the animals with a standard diet and observe them to ascertain they are in a good state of health.\nKeep the animals from eating and drinking after midnight before the surgery to prevent the risk of aspiration during the intubation.\n2. Anesthesia and Intubation\nSedate the animal with 5 mg/kg tiletamine/zolazepam given intramuscularly (IM) into the gluteus muscle while the animal is in the housing area. Concurrently, give 0.05 mg/kg atropine IM as an anticholinergic agent to minimize secretions during the intubation.\nTransport the animal from the housing area to the operating room and place it in the supine position on an operating table.\nUse inhaled isoflurane (2% - 5%) to induce anesthesia. Use 21% oxygen (0.4 L/min) mixed with air (4 L/min) as the carrier gases to deliver the inhaled anesthetic gas.",
    "While the desired depth of anesthesia is being achieved, place a 20 G peripheral intravenous (IV) catheter in the ear vein for the IV administration of fluids, drugs, or anesthesia, as needed.\nAs the animal acquires the desired depth of anesthesia, gently wash off any waste and debris from the operative sites, including the left and right inguinal regions, left and right sides of the neck, and the abdomen. Use an electric hair clipper to remove all hair from the operative sites. Assess the depth of anesthesia by pinching the hind limb of the animal and observing its (lack of) response.\nSecure the animal to the operating table by using surgical cotton ropes around each extremity, prior to the intubation.\nUse a short piece of surgical cotton rope to lift the mandible along with the tongue to open the oral orifice. Use another piece of cotton rope to pull the maxilla downwards. In case the jaw relaxation is insufficient or the vocal folds are collapsed, increase the level of isoflurane briefly and repeat this step.\nUse the non-dominant hand to hold the handle of a conventional laryngoscope fitted with a 12 in lighted Miller blade. Pass the tip of the Miller blade through the oropharynx. Practice caution to preserve the teeth and oral mucosa while maneuvering the blade in the oral cavity. Slowly advance the blade tip until the epiglottis can be clearly visualized and advance past the laryngeal inlet. Using the wrist, lift the blade, elevating the epiglottis, such that a clear view of the larynx is obtained.",
    "Place a 6.5 Fr or 7 Fr endotracheal tube (ETT) with a stylet between the vocal folds into the trachea. In case of laryngospasm due to mucosal irritation, apply 2% lidocaine on the vocal folds and the median glosso-epiglottic field and reassess.\nRemove the stylet before fully advancing the tube down the trachea while keeping a firm grip on the tube. Inflate the balloon cuff with 10 - 15 cm3 of air to prevent any air leak around the cuff and aspiration of gastric contents.\nConnect the ETT to the mechanical ventilator through a breathing filter (heat and moisture exchanger). Secure the ETT by tying the cotton tape around the snout (maxilla).\nIn the event of a failed intubation, let the animal oxygenate and ventilate briefly before any additional attempts.\nEnsure the appropriate mechanical ventilator settings: a mixture of 21% oxygen and air; a tidal volume of 7 - 10 mL/kg body weight; a respiratory rate of 10 - 15 breaths/min to maintain an end-tidal pCO2 of 40 mmHg ± 2 mmHg.\nPlace a pulse oximeter on either the ear, tongue, or tail to measure the blood oxygenation and heart rate. Advance a rectal probe through the anal orifice for continuous temperature monitoring.\n\tNote: The temperature of the animal is to be maintained between 38 °C to 40 °C using a heated temperature-regulated operating table, heat mat, or heating blanket.\nUse isoflurane (1% - 3%) for the maintenance of anesthesia throughout the procedure. During this time, assess the depth of anesthesia by testing for pain reflexes using a hind limb pinch. In addition, monitor the respiratory rate on the ventilator to see if it matches the programmed ventilator rate.\n\tNote: Over-breathing indicates an inadequate depth of anesthesia.\n3. Surgical Site Sterilization (Preparation and Draping)",
    "Prepare the incision sites, as well as an extensive area surrounding them for the experimental procedures. The incision sites for the experiment include bilateral inguinal regions, the bilateral neck, and the lower abdomen. Disinfect the operative sites by scrubbing them with a copious amount of povidone-iodine for 5 min.\nUse dry, sterile gauze to remove the povidone-iodine soap from the skin.\nPlace sterile surgical towels around the operative sites to preserve the sterile surgical fields. Use towel forceps to secure the towels in place. Cover the animal with a sterile drape to prevent any contamination of the surgical sites.\n4. Cannulation\nFemoral artery and vein cannulation\n\tNote: A cannulation of the right femoral artery, left femoral artery, and left femoral vein is performed. The right femoral artery is cannulated using a 14 Fr insertion sheath for the aortic balloon occlusion catheter insertion. The left femoral artery is cannulated using a 5 Fr catheter for distal MAP monitoring. An 8 Fr catheter is placed in the left femoral vein for the fluid administration and blood withdrawal. The open Seldinger technique is employed to gain vascular access for all cannulations15.\n\t\nBefore making the incision, assess the depth of anesthesia by pinching the hind limb of the animal.\nUsing a scalpel fitted with a number 10 sterile surgical blade, make a vertical 8-cm incision in the right groin 4 cm above and 4 cm below the right inguinal crease.\nDissect through the subcutaneous tissue and muscle and use two Weitlaner retractors for gaining proper exposure. Use an Army-Navy retractor for additional retraction if needed.\nUse Mixter Right Angle Forceps and electrocautery to dissect through connective tissues until the neurovascular bundle is clearly exposed.\nCautiously dissect the artery. Preserve the nerve, which is the lateral-most structure.",
    "Carefully dissect the vein, which is located most medially, away from the artery.\nGain proximal and distal control of the artery using 2-0 silk ties.\nUse a 20 G angled introducer needle to puncture the artery. Ensure an appropriate position in the vessel lumen by observing the pulsatile blood flow through the other end of the needle.\nAdvance a round-tipped 0.35 in guidewire through the lumen of the angled needle.\nWithdraw the needle over the guidewire. Ensure no migration of the guidewire by holding it in place.\nPass a 10 Fr dilator over the guidewire to dilate the opening in the artery. Remove the 10 Fr dilator. Insert a 14 Fr insertion sheath over the guidewire.\nCarefully remove the dilator from the insertion sheath along with the guidewire, keeping the cannula inside the artery.\nFlush the insertion sheath to ensure its position inside the vessel lumen.\nSecure the end of the catheter in place with a 3-0 polyglactin suture.\nUse a 3-0 nylon suture to perform a temporary running closure of the overlying skin.\nRepeat the aforementioned steps for the left femoral artery cannulation using a 5 Fr catheter (no initial dilation). Isolate the left femoral vein in a similar fashion and cannulate it using an 8 Fr catheter. Use a 3-0 nylon suture to perform a temporary running closure of the overlying skin.\nCarotid artery and external jugular vein cannulation",
    "Note: A cannulation of the bilateral external jugular veins and left common carotid artery is performed. A 5 Fr catheter is placed in the left common carotid artery for proximal MAP monitoring, and an 8 Fr catheter in the left external jugular vein for additional central venous access for fluid administration and vasopressor infusion. A 9 Fr catheter is placed in the right external jugular vein for pulmonary artery catheterization with a pulmonary artery (e.g., Swan-Ganz) catheter, while a carotid flow probe is placed around the right common carotid artery for carotid flow rate monitoring. The Seldinger approach is used to gain vascular access for all cannulations.\n\t\nUsing a 10-blade scalpel, make a 6 cm vertical incision about 2 cm lateral to the midline on the left side of the neck.\nUse electrocautery to dissect through subcutaneous tissue until sternocleidomastoid (SCM) muscle is exposed.\nPlace Weitlaner retractors at the proximal and distal aspects of the incision for a full retraction.\nDissect along the lateral border of the SCM muscle to expose the left external jugular vein.\nVessel cannulation can be achieved by following steps 4.1.8 - 4.1.14. Insert, flush, and secure an 8 Fr catheter in the vein.\nFor left common carotid artery exposure, dissect the medial edge of the SCM muscle. Place a Weitlaner retractor to enhance exposure.\nDissect through the connective tissue longitudinally along the lateral border of the trachea. Preserve the thymus glands if they are encountered.\nExpose the carotid triangle, which contains the carotid artery, the internal jugular vein, and the vagus nerve. Palpate the common carotid artery to determine its trajectory.\nCarefully dissect the common carotid artery away from the vein and the nerve.",
    "Perform the carotid cannulation by following steps 4.1.8 - 4.1.14. Insert, flush, and secure a 5 Fr catheter in the artery as described previously.\nRepeat steps 4.1. for the dissection and isolation of the right external jugular vein and right common carotid artery.\nPlace a 4 mm carotid artery flow probe around the right common carotid artery. Apply transducer gel between the flow probe and the vessel for an optimal flow signaling and capture.\nFollowing the steps 4.1.8-4.1.14, cannulate the right external jugular vein using a 9 Fr introducer sheath. Flush and secure the catheter in place. Use a 3-0 nylon suture to perform a temporary running closure of the overlying skin.\n5. PA Catheter Insertion\nFlush the injection port, the proximal port, and the distal port of the catheter with normal saline (NS) and connect them to the transducer tubing. The distal port is designated as the pulmonary artery (PA) port, while the proximal port is designated as the central venous pressure (CVP) port.\nCheck for artifact tracing on the monitor by moving the catheter. This is done to make sure that the catheter is functioning.\nAdvance the PA catheter through the sterile sleeve.\nUsing a 3 cm3 syringe, inflate the balloon of the PA catheter with no more than 1.5 cm3 of air to test for inflation. Deflate the balloon to insert the catheter in the insertion sheath.\nInsert the PA catheter through the 9 Fr insertion sheath. Once the PA catheter is inserted for at least 18 cm, inflate the balloon with no more than 1.5 cm3 of air.",
    "Slowly advance the PA catheter and check the monitor for arrhythmias during the insertion. In case of ventricular ectopy, inflate and deflate the balloon in order to prevent progression. If the insertion becomes difficult in any way, the balloon should be deflated and the catheter should be retracted and reinserted.\nObserve the monitor to evaluate the transition from the right atrium (RA) to the right ventricle (RV) to the PA to the pulmonary artery wedge pressure (PWP).\nDeflate the balloon and confirm that a PA trace returns to the monitor.\n\tNote: The appropriate length of the catheter from the insertion site in the right external jugular vein is approximately 45 - 55 cm.\nConnect the end of the sterile sleeve to the insertion sheath in order to secure the position of the catheter inside the PA.\nConnect the insertion ports of the PA catheter to the capture unit to obtain the cardiac output (CO) and the saturation of venous oxygen (SVO2).\nCalibrate the PA catheter monitoring system. Using the body length and weight of the animal, conduct an in vivo calibration of the PA catheter monitoring system for the animal. Use a venous blood gas for a further calibration using oxygen saturation and hemoglobin levels.\n6. Cystostomy Tube Placement\nMake a 5 cm lower abdominal incision in the midline using a 10-blade scalpel.\nUsing electrocautery, dissect through subcutaneous tissue and the linea alba. Visualize each layer during dissection.\nExtracorporealize the urinary bladder.\nWith two DeBakey forceps, grasp the urinary bladder on the ventral surface away from the ureteral openings.\nUsing electrocautery, make a small opening in the bladder, exposing the inner lumen.\nUse suction to remove any urine from within the bladder lumen. Surgical sponges can be used for any inadvertent spillage of urine outside the bladder.",
    "Use a 4-0 polypropylene suture to perform a temporary purse-string closure of the bladder.\nPlace an 18 Fr Foley catheter inside the bladder lumen and use a 10 cm3 syringe to inflate the balloon. Connect a urinary drainage bag to the Foley catheter and secure it to the side of the operating table.\nTie the 4-0 polypropylene suture to secure the Foley catheter in the bladder lumen.\nUse a 3-0 nylon suture to perform a temporary running closure of the overlying skin of the abdominal wall.\n7. Complete and Partial Aortic Balloon Catheter Insertion\nRandomize animals to receive either the complete or partial aortic balloon occlusion catheters.\nInsert a 0.035 in, 260 cm Amplatz Stiff Guidewire through the 14 Fr insertion sheath in the right femoral artery, and guide it into the supraceliac aorta (Zone 1) using ultrasonography of the abdominal and thoracic aorta.\nInsert the balloon occlusion catheter over the guidewire into Zone 1 of the aorta to perform the occlusion following the hemorrhage.\nConfirm the final placement of the aortic balloon occlusion catheter into Zone 1 of the aorta with ultrasonography.\n8. Intraoperative Hemodynamic and Laboratory Monitoring\nEnsure the connection of the invasive catheters to the monitoring system using tubing, transducers, and tubing to the hemodynamic monitors. Invasive monitoring systems should be ‘zeroed’ at the level of the animal’s heart to ensure accurate monitoring.\nRecord physiologic data throughout the experiment, including the proximal and the distal MAP, heart rate (HR), the CVP, the CO, the PA pressure, the SVO2, end-tidal CO2, and the core body temperature.\nRecord these variables every 5 min during the hemorrhage and the balloon inflation phase, as well as every 15 min during the rest of the experiment.",
    "Collect blood samples at 4 time-points: baseline (BL), post-shock (PS), post-resuscitation (PR), and at the end (E) of the experiment. 10 mL of blood is collected for both plasma and serum analysis at each time point.\nPerform arterial blood gas (ABG) sampling by collecting up to 1 mL of blood in the ABG syringe. Perform ABG sampling at each of the aforementioned time points, and also when needed during the experiment. Use a blood gas analyzer for the analysis.\n\tNote: Each sample should be analyzed within 10 min of drawing the blood because delays longer than 10 min can decrease the efficiency of the results16.\n9. Hemorrhage\nCalculate the TBV.\n\tTBV in mL = weight in g × 0.06 + 0.77\nHemorrhage 35% of the TBV using an automated pump over a period of 20 min. Remove half over the first 7 min, and the other half over the next 13 min.\nCollect the blood in standard blood collection bags. Store them at 4 °C in anticipation of a future transfusion.\nIf the MAP decreases below 30 mmHg, stop the hemorrhage, turn off the isoflurane, and administer 50 - 100 mL boluses of NS.\nRestart the hemorrhage when the MAP returns to 30 mmHg.\n10. Aortic Balloon Occlusion Catheter Inflation and Whole-Blood Resuscitation\nInflate the aortic balloon occlusion catheter with 9 - 12 cm3 of air or until no further decrease in the distal MAP following an additional balloon inflation is noted.\nRemove the wire from the partial aortic balloon occlusion catheter to facilitate distal aortic flow, while leaving it for the complete aortic balloon occlusion catheter. Confirm the placement of the aortic balloon occlusion catheter in Zone 1 using ultrasonography to rule out catheter migration.\nSecure the catheter to the skin using an interrupted 3-0 nylon suture.",
    "Following 40 min of aortic occlusion, resuscitate the animal with whole blood equal in volume to 20% of the TBV via the left femoral vein catheter over a 20 min period using the automated pump. Use a blood warmer for transfusion, targeting a temperature of 40 °C.\nAfter the resuscitation, deflate the balloon incrementally over 5 min.\nRemove the aortic balloon occlusion catheter from the 14 Fr insertion sheath.\nMonitor the hemodynamics closely during this time, given the known risk of ischemia-reperfusion injury with the associated hypotension.\n11. Critical Care, Observation, and Recovery\nObserve the animals for 4 h with a continuous monitoring of their physiological and laboratory parameters.\nProvide maintenance intravenous fluids (NS infusion at 50 ml/h).\nTarget a CVP of 6 mmHg by administering 30 ml/kg boluses of NS followed by 20 ml/kg boluses when the CVP falls below the target. Evaluate the fluid responsiveness hourly.\nTarget a MAP of 60 mmHg by using a norepinephrine infusion (0.024 mg/ml).\nMaintain a physiologic temperature of 38 - 40 °C using a heating blanket.\nAt the end of the 4 h period, euthanize the animals with a sodium pentobarbital (100 mg/kg) injection.\n12. Necropsy\nRemove all essential lines and tubes from the animal.\nPrepare a container with regular ice and place it next to the operating table to freeze the organ tissue immediately after the removal from the body.\nUse a scalpel to make a 6 cm long vertical incision along the left sternal border, dissecting through the skin, subcutaneous tissues, pectoralis muscles, and costal cartilages. Enter the thoracic cavity to expose the heart and the lung.",
    "Remove the pericardial membrane from the heart by making an incision with the scalpel and grab the apex of the heart using forceps. Use a scalpel to cut a 5 x 5 cm section of the heart at the apex.\nUse scissors to cut a 5 x 5 cm section of the lung from the anterior border of the base of the lung.\nExtend the thoracotomy incision into the anterior midline of the abdomen, exposing the abdominal viscera.\nUse forceps to hold the left lobe of the liver and cut a 5 x 5 cm section.\nRepeat the same process for getting samples from the spleen.\nUse the right hand to create a window to enter the left retroperitoneum to grab the kidney. After the renal parenchyma is mobilized, transect the renal artery, vein, and ureter. Remove the renal capsule.\nGently squeeze stool away from a 5 cm long section of small bowel and use scissors to cut a 5 cm long section of bowel from the mesentery.\nUse the scalpel to cut a 5 x 2 cm long section of quadriceps muscle from the thigh.\nProcess these samples further by cutting them into small sections to be placed in microcentrifuge tubes. Flash-freeze these tissue samples by placing the tubes into dry ice or liquid nitrogen.\nUse 50 ml conical tubes containing a formalin solution to fix 3 cm long, finely cut sections of tissue for a histological evaluation.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}