{
  "id": 8341,
  "origin_website": "Jove",
  "title": "Modeling Stroke in Mice: Transient Middle Cerebral Artery Occlusion via the External Carotid Artery",
  "procedures": [
    "The experiments reported in this video were conducted following the national guidelines for the use of experimental animals, and the protocols were approved by the German governmental committees (Regierung von Oberbayern, Munich, Germany). Ten-week-old male C57Bl/6J mice were used and housed under controlled temperature (22 ± 2 °C), with a 12 h light-dark cycle period and access to pelleted food and water ad libitum.\n1. Preparation of the material and instruments\nConnect the heat blanket to maintain the temperature of the operation area and the mouse body temperature during anesthesia at 37 °C.\nAutoclave scissors and forceps, prepare 70% ethanol solution and keep available dexpanthenol eye ointment, several pieces of cotton, and 5-0 coated braided polyester suture ready for use. Prepare a 1 mL syringe with 0.9% saline solution (without needle) to keep the animal's incision site hydrated. Prepare the anesthesia gas (100% O2 + isoflurane).\nPrepare a holder for the laser Doppler probe by cutting the tip of a 10 µL pipet tip (3-5 mm length).\n\tNOTE: All instruments are sterilized using a hot bead sterilizer. Surfaces are also disinfected before and after surgery with a microbial disinfectant spray. Prior to surgery, the areas surrounding the head and chest of mice are disinfected with a wound disinfection spray.\n2. Preparation of the laser Doppler\nInject analgesia to the mouse 30 min before the surgery (4 mg/kg Carprofen and 0,1 mg/kg Buprenorphine, intraperitoneally).\nAnesthetize the mouse by placing it in the induction chamber with an isoflurane flow rate of 4% until the cessation of spontaneous body movement and vibrissae.\nPlace the mouse in a prone position in the operation area with its nose in the anesthesia mask. Maintain isoflurane concentration at 4% for another minute, then reduce it and keep it at 2%.",
    "Set the associated feedback-controlled heating pad for maintaining the mouse body temperature at 37 °C, and gently insert the rectal probe to monitor the temperature throughout the surgical procedures.\nApply dexpanthenol eye ointment on both eyes.\nDisinfect the skin and hair surrounding the left eye and ear with 70% ethanol.\nCut the scalp between the left ear and the eye (1 cm long) to expose the skull bone.\nCut and retire the temporal muscle to visualize the MCA beneath the skull.\nFix with glue the outer part of the tip holding the laser Doppler probe/fiber on top of the left MCA with glue. Then, glue the skin to close the wound around the tip holder. Apply 2-3 drops of hardener glue to speed up the process. Make sure that the laser Doppler fiber is not glued and can be easily removed from the tip holder at any time.\n3. Transient MCAo model (occlusion)\nTurn the mouse into the supine position. Put the snout into the anesthesia cone and fix the paws with tape.\nDisinfect the skin and hair surrounding the chest and make a 2-cm-long midline incision in the neck.\nUse forceps to pull the skin and the submandibular glands apart. Use retractors to hold the sternomastoid muscle, expose the surgical field and find the left common carotid artery (CCA). Dissect the CCA free from connective tissue and surrounding nerves (without harming the vagal nerve) and perform a transient ligation before the bifurcation.\nDissect the external carotid artery (ECA) and tie a permanent knot at the most distal visible part. Place another suture under the ECA, close to the bifurcation, and prepare a loose knot to be used later.",
    "Dissect the internal carotid artery (ICA) and place a microvascular clip on it, 5 mm over the bifurcation. Make sure not to damage the vagal nerve.\nCut a small hole into the ECA between the tight and the loose ligations; be careful not to cut the entire ECA.\nIntroduce the filament and advance it towards the CCA. Tighten the loose ligation in the ECA around the lumen to shortly secure the filament in that position and avoid bleeding when removing the microvascular clip.\nRemove the microvascular clip and insert the filament through the ICA until the origin of the MCA is reached by detecting a sharp reduction (>80%) in the cerebral blood flow as measured by the laser Doppler. Fix the filament in this position by further tightening the knot around the ECA.\n\tNOTE: When the filament goes toward the appropriate direction, it advances smoothly, and no resistance should be observed.\nRecord laser Doppler values before and after filament insertion.\nRemove the retractor and relocate the sternomastoid muscle and the submandibular glands before suturing the wound. Remove the laser Doppler probe, and place the animal in a recovery chamber at 37 °C for 1 h (until filament removal).\n4. Transient MCAo model (Reperfusion)\nAnesthetize the mouse by placing it in the induction chamber with an isoflurane flow rate of 4% until the cessation of spontaneous body movement and vibrissae.\nApply dexpanthenol eye ointment on both eyes.\nPlace the mouse in a prone position in the operation area with its snout in the anesthesia mask. Maintain isoflurane concentration at 4% for another minute, then reduce it and keep it at 2%. Fix the animal´s paws with tape.\nInsert the laser Doppler probe into the probe holder.",
    "Remove the wound suture, use forceps to pull the skin and the submandibular glands apart. Use retractors to gently pull the sternomastoid muscle and expose the surgical field.\nLoosen the ECA suture that tightens the filament, and gently pull the filament. Avoid damaging the silicone-rubber coating of the filament during the removal.\nTightly tie the ECA suture.\nConfirm the increase in the cerebral blood flow in the laser Doppler device (>80% of the initial value before reperfusion).\nRecord laser Doppler values before and after filament removal.\nOpen the transient ligation before the bifurcation from the CCA.\nRemove the retractor, and relocate the sternomastoid muscle and the submandibular glands before suturing the wound. Place the animal in a recovery chamber at 37 °C for 1 h to recover from anesthesia.\nAfter recovery, return the mice to their cages in a temperature-controlled room.\nTake care of the animals by adding wet food pellets and hydrogel in small Petri dishes on the cage floor until day 3 after the surgery.\nInject analgesia every 12 h for 3 d after surgery (4 mg/kg Carprofen and 0.1 mg/kg Buprenorphine).\n5. Sham operation\nPerform all procedures as described above, including the ligation of the arteries and the introduction of the filament (steps 1-3.7).\nRemove the filament immediately after its insertion. Then, place the animal in the recovery chamber for 1 h.\nPlace the animal in the operation area again, and remove the transient ligation of the CCA to ensure complete cerebral blood flow restoration.\nSuture the wound, and place the animal in a recovery chamber at 37 °C for 1 h to recover from anesthesia. After recovery, return the mice to their cages in a temperature-controlled room.",
    "Take care of the animals by adding wet food pellets and hydrogel in small Petri dishes on the cage floor until day 3 after surgery.\nInject analgesia every 12 h for 3 d after surgery (4 mg/kg Carprofen and 0.1 mg/kg Buprenorphine).\n6. Neuroscore\nPerform the Neuroscore always at the same time of the day, and use surgical clothes to maintain a \"neutral smell\" between individual surgeons.\nLet the mice rest for 30 min in the room with an \"open\" cage before the test.\nObserve each item in Table 1 and Table 2 for 30 s.\n7. Intracardiac perfusion\nPrepare a 20 mL syringe containing phosphate-buffered saline (PBS)-heparin (2 U/mL) and place it 1 m above the bench to facilitate gravity-driven perfusion. (OPTIONAL: Perform intracardiac perfusion with 4% paraformaldehyde (PFA) using a 20 mL syringe containing 4% PFA in PBS, pH 7.4).\nInject intrperitoneally 100 µL of ketamine and xylazine (120 and 16  mg/kg body weight, respectively). Wait 5 min and confirm the cessation of spontaneous body movement and vibrissae.\nFix the animal in a supine position, and disinfect the abdominal body surface with 70% ethanol.\nMake a 3-cm-long incision into the abdomen; cut the diaphragm, the ribs, and sternum to visualize the heart completely.\nMake a small incision in the right atrium, and insert the perfusion cannula into the left ventricle.\nPerfuse with 20 mL of PBS-heparin.\nAfter perfusion, decapitate the animal and remove the brain.\nFreeze the brain on powdered dry ice and store at -80 °C until further use.\n8. Infarct volumetry\nFor cryosectioning, use a cryostat to cut the brains into 20-µm-thick sections every 400 µm. Place the sections on slides, and store the slides at −80 °C until use.\nCresyl violet (CV) staining",
    "Prepare the staining solution by stirring and heating (60 °C) 0.5 g of CV acetate in 500 mL of H2O until the crystals are dissolved. After the solution has cooled, store it in a dark bottle. Reheat to 60 °C and filter before every use.\nLet the slides dry at room temperature for 30 min. Immerse them in 95% ethanol for 15 min, in 70% ethanol for 1 min, and then in 50% ethanol for 1 min.\nImmerse the slides in distilled water for 2 min; refresh the distilled water and place the slides in the water for 1 min. Afterward, immerse the slides in the pre-heated staining solution for 10 min at 60 °C. Wash the slides twice in distilled water for 1 min.\nImmerse the slides in 95% ethanol for 2 min. Place them in 100% ethanol for 5 min; refresh the 100% ethanol and place the slides again in the ethanol for 2 min. Afterward, cover the slides with a mounting medium.\nAnalysis (Figure 4C)\n\t\t\nScan the slides and analyze the indirect infarct volume by the Swanson method12 to correct for edema by using the following equation:\n\t\t\t(Ischemic area) = (ischemic region)-((ipsilateral hemisphere)-(contralateral hemisphere))\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}