{
  "id": 4029,
  "origin_website": "Cell",
  "title": "An optimized confocal intravital microscopy protocol for long-term live imaging of murine F-actin organization during naïve lymphocyte migration",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nInjection of isolated LifeAct-GFP lymphocytes\nTiming: 10 min\nCells from LifeAct-GFP donor are injected into a recipient host mouse through surgically exposed femoral vein.\nAnesthetize the recipient host C57BL/6J mouse by intraperitoneal injection of Avertin (300 mg/kg).\nWet with ethanol, cut away skin and gently expose the femoral vein (Figures 1[href=https://www.wicell.org#fig1]i and 1ii).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/743-Fig1.jpg\nFigure 1. Surgical preparation of mouse\n(i and ii) Exposing right femoral vein for i.v. injection.\n(iii) Retro-orbital injection.\n(iv and v) Exposing left inguinal lymph node for imaging.\n(vi) Custom imaging insert with cover glass.\n(vii) Mounting of mouse on imaging insert.\n(∼ 10 × 106 cells) Inject the fluorescent-labeled lymphocytes into the femoral vein using insulin syringe with 30G needle, under the dissecting microscope (Nakanishi et al., 2016[href=https://www.wicell.org#bib6]).\nSeal the needle wound with a cautery pen or apply pressure on the wound with Q-tip to stop bleeding.\nCover the open skin area with a strip of surgical tape.\nReturn the anesthetized mouse to a heated incubator (∼30°C–37°C to maintain physiological temperature before lymph node surgery).\nEnsure the animal is fully sedated by checking every 10–20 min before surgery.\nReinforce with half the dose of initial Avertin injection if necessary.\nNote: If Avertin is not an approved anesthesia for the user’s institute, other injectable anesthesia alternatives such as pentobarbital and ketamine-xylazine could be used instead.\nNote: Tail vein injection could also be used for injecting fluorescent-labeled lymphocytes into the recipient host mouse.\nCritical: It is important to inject these cells ∼20 min before lymph node surgery. This allows the lymphocytes to fully circulate and arrive at the peripheral lymph nodes.\nMouse preparation and inguinal lymph node surgery\nTiming: 15–20 min\nInguinal lymph node of recipient host mouse is surgically exposed and cleared of connective tissue.",
    "Remove the anesthetized mouse from the incubator.\nDetermine if the mouse is fully sedated by lack of response to toe and/or tail pinches.\nInject half dose of initial Avertin injection if necessary.\nAt this point, inject fluorescently labeled antibodies (i.e., CD31-Alexa Fluor 647) via retro-orbital injection (Figure 1[href=https://www.wicell.org#fig1]iii).\nUse an electric trimmer to remove hair on the abdominal area of the mouse. Remove remaining loose hair by alcohol swab and gently patting the area with tape.\nPlace the mouse on a clear surgical board in a supine position and stabilize the mouse to the board with taping each footpad to the board. Body temperature should be maintained by an external heat lamp or a heating pad.\nPlace the mouse under the dissecting microscope. Using surgical scissors, make a midline incision along the ventral surface of the abdominal cavity and gently retract the skin away from the flesh (Figure 1[href=https://www.wicell.org#fig1]iv).\nCritical: During the entire surgical procedure, ensure the exposed tissue is always kept moist with gauze dampened with PBS.\nOnce the skin is retracted so that the inguinal lymph node is visible, pull the skin away gently and stabilize the edges with surgical tape.\nCarefully remove the thin layer of connective tissue covering the area around the lymph node (Figure 1[href=https://www.wicell.org#fig1]v).\nCritical: Avoid contact with the vasculature of interest with surgical tools or injuring the vessels by placing too much force on them by manipulating adipose tissue and connective tissue covering the lymph node.\nUsing fine forceps and micro-scissors, clear the adipose tissue covering and surrounding the lymph node. The main arterial segment lays adjacent to the lymph node and is often covered by venule (von Andrian, 1996[href=https://www.wicell.org#bib10]).\nConfocal intravital imaging\nTiming: 1–4 h\nMouse is placed under the confocal microscope and 4D data collected.",
    "Obtain optimal imaging insert best suited for the microscope stage and cover with Corning cover glass (Figure 1[href=https://www.wicell.org#fig1]vi).\nOnce the lymph node and vessel segments are exposed under the dissecting microscope, gently flip the mouse up-side down, then secure the preparation onto an imaging stage (Figure 1[href=https://www.wicell.org#fig1]vii).\nThe skin flap (with the attached lymph node is maneuvered to where the lymph node is at the middle of the slide. Afterwards, secure the optimal position with surgical tape firmly adhering to the skin flap.\nNote: All corners of the skin flap should be taped firmly to the cover glass. Since the skin flap (along with the attached lymph node) is being pulled away from the mouse body, and quite separated from the mouse body cavity, away from lung, heart, intestinal movement, there shouldn’t be much motion artifacts.\nCritical: Make sure to put a few droplets of 1× PBS on the cover slip between the lymph node and glass to prevent the tissue from drying.\nStart-up the imaging system by switching on the confocal microscope, lasers and computers. Allow the lasers and lamps to warm-up (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/743-Fig2.jpg\nFigure 2. Microscope and mouse set-up and example imaging result\n(Ai and Aii) SP8 DIVE with incubation chamber, fitted with 25× water immersion objective.\n(Aiii) Placing mouse/insert set-up on imaging stage.\n(B) Ideal confocal 4D imaging. Top left, single color channel for LifeAct-GFP cells. Top right, single color channel for CellTracker-orange labeled cells. Bottom left, single channel for CD31-AF647 labeled blood vessels (Bruggisser et al., 2020[href=https://www.wicell.org#bib1]). Bottom right, all 3 channels combined. Scale bar = 60 μm.\nPlace the mouse preparation on the microscope stage, identify the lymph node and vasculature with wide-field settings on the microscope.",
    "Note: The users should be looking for CD31 stained venules with abundant lymphocytes arriving and adhering at the site.\nSwitch to confocal mode and set up 4D imaging acquisition parameters (Figure 2[href=https://www.wicell.org#fig2]B).\nChoose the desired laser settings based on excitation/emission wave lengths of the fluorochrome used.\nSettings for intensity parameters such as gain and pinhole should be adjusted.\nTime-lapse parameter settings should be adjusted to acquire desired frame rate (∼30 – 60 sec per interval) and overall acquisition duration (∼30 – 60 min) (Yan et al., 2019[href=https://www.wicell.org#bib12], Woodfin et al., 2011[href=https://www.wicell.org#bib11], Girbl et al., 2018[href=https://www.wicell.org#bib3]).\nAfter every 1–1.5 hr, inject half dose of initial Avertin to maintain mouse under anesthesia.\nNote: Avoid shifts in the z-plane scan field during time-lapse acquisition by firmly stabilizing the skin flap with surgical tape.\nCritical: Minor shifts in the scan field, especially those in the x-y-plane often occur during the initial time-lapse image acquisition. This can be corrected by analysis software after the experiment. However, if shift becomes too severe, the experiments should be halted. Slight changes such as adjusting or repositioning the skin flap can help.\nUse the appropriate software such as Imaris to create 4D reconstructions from the acquired raw data file (Yan et al., 2019[href=https://www.wicell.org#bib12], Park and Kehrl, 2019[href=https://www.wicell.org#bib7])."
  ],
  "subjectAreas": [
    "Immunology",
    "Antibody",
    "Cell Isolation",
    "Microscopy",
    "Cell Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}