{
  "id": 16309,
  "origin_website": "Jove",
  "title": "Modeling an Enzyme Active Site using Molecular Visualization Freeware",
  "procedures": [
    "NOTE: The protocol for each program is outlined in ten overarching steps, (1) Loading the structure into the program, (2) Identifying the ligands in the active site, (3) Adjusting the representation, (4) Selecting residues within 5 Å to define an active site, (5) Showing the interactions of the enzyme with the active site ligands, (6) Displaying the side chains as sticks and showing/adjusting the active site water molecules, (7) Simplifying the structure, (8) Labeling ligands and hydrogen-bonded side chains, (9) Saving the rendering at any point to return to work on it or share with others, (10) Saving an image for embedding or printing. Steps 1, 4, and 7-10 are identical for each protocol; however, due to the unique operation of each program, some protocols are more efficiently executed when steps 2/3 and 5/6 are interchanged.\n1. UCSF ChimeraX protocol\nNOTE: Trackpad and Mouse Controls. To rotate, click and drag or use two-finger drag (mouse: left click and drag). To zoom, pinch and spread (Mac) or control + two-finger movement (PC) (mouse: scroll wheel). To translate (i.e., move the entire structure) press the option + click and drag (Mac) or shift + click and drag (PC) (mouse: right click and drag). To re-center, use the dropdown menus at the top of the interface to click Actions > View.\nLoading the structure into ChimeraX: In the command line located at the bottom of the GUI that is preceded by \"Command:\", type:\nopen 3fgu\n\tNOTE: After inputting any typed line command, press return on the keyboard to execute it.",
    "Identifying the ligands in the active site: Ensure there are two representations, a cartoon ribbon and sticks. Using the mouse, rotate/zoom the protein to best visualize the ligands displayed near the center of the protein, which are shown as sticks. Hover over a ligand to show its name.\nAdjusting the representation: Use the commands in the substeps below to recolor the protein and ligands, apply CPK coloring to non-carbon atoms, and then deselect the selection. Selected parts of the molecule become highlighted in green.\n\t\nUse the dropdown menus at the top of the interface to change the coloring: Click on Actions > Color > Cornflower Blue. Then, click on Select > Structure > Ligand. To select the color, click on Actions > Color > Gray. To apply CPK coloring, click on Select > All, and then click on Actions > Color > By Heteroatom. Finally, clear the selection by clicking on Select > Clear.\n\t\tNOTE: The selection may also be cleared by pressing control and clicking in the black background of the structure viewer or in the command line by typing: ~select. By default, for most structures containing 1-4 chains, ChimeraX will automatically show water molecules and amino acid residues within 3.6 Å of ligands and ions.\nUse the dropdown menu to hide the currently displayed atoms by clicking on Actions > Atoms/Bonds > Hide.\nUse the dropdown menu to show the ligands and Mg ion in the active site by clicking on Select > Structure > Ligand. Then, click on Actions > Atoms/Bonds > Show. Next, click on Select > Residues > MG, and then on Actions > Atoms/Bonds > Show. To clear the selection, click on Select > Clear.",
    "NOTE: After making the selection with the dropdown menu, step 1.3.3 may be executed by clicking on the Hide and Show buttons in the Atoms toolbar.\nSelecting residues within 5 Å to define an active site: In the structure viewer, to select the ligands press control + shift and perform the mouse click on any single atom or bond in each of the three ligands, i.e., BCG, ANP, and Mg.\n\t\nNext, press the up arrow key on the keyboard until all the atoms of the three ligands are highlighted with a green glow. Define this selection for future use by clicking in the dropdown menu Select > Define Selector. In the pop-up menu, type:\nligands to name the current selection, and then click on OK.\n\t\tNOTE: Clicking the up arrow too many times in step 1.4.1 will select the entire protein. In that case, click the down arrow button until only the atoms of the three ligands are selected.\nUse the dropdown menu to select the residues within 5 Å of the ligands: Click on Select > Zone. In the pop-up window that appears, toggle the Select dropdown menu to Residues, and ensure that the top box is checked (check the less than (<) distance and set to 5.0 Å). Then, click on OK. Only residues which are less than 5 Å away will be highlighted.\n\t\tNOTE: Steps 1.4-1.4.2 can be simplified extensively using the command line, by typing:\nname frozen ligands :BGC:MG:ANP\n\t\tselect zone ligands 5 extend true residues true",
    "Displaying the side chains as sticks and showing/adjusting the active site water molecules: Use the dropdown menu to display the selection and center and zoom on the selection by clicking on Actions > Atoms/Bonds > Show to show them. To center the selection, click on Actions > View. Then, to clear the selection, click on Select > Clear or click anywhere in the empty space .\nShowing the interactions of the enzyme with the active site ligands: Use the dropdown menus and click on Select > User-Defined Selectors > Ligands. Then, click on Tools > Structure Analysis > H-bonds. In the pop-up window, ensure that Limit by Selection is checked, the dropdown menu is set to With At Least One End Selected, and Select Atoms is checked, and then click on OK. To clear the selection, click on Select > Clear.\n\tNOTE: Check the Distance Label box to see bond lengths in Å; however, this makes the view very busy. Finally, you may change the color of the H-bonds by clicking on the Color box and selecting a new color in the pop-up window.\nSimplifying the structure: using the top cartoon toolbar to hide the cartoon or click on the dropdown menu: Actions > Cartoon > Hide.\nLabeling ligands and hydrogen-bonded side chains: Use the mouse to select residues that are hydrogen bonded to the ligands (connected by the dashed lines), as in step 1.4. Then, in the dropdown menus, click on Actions > Label > Residues > Name Combo. Next, click on Select > User-Defined Selectors > Ligands. Then, click on Actions > Label > Residues > Off. Finally, clear the selection, by clicking on Select > Clear.",
    "Saving the rendering at any point to return to work on it or share with others: in the dropdown menu click on File > Save. Select a location, enter a filename, and click on Save.\n\tNOTE: Ensure the format is set to: ChimeraX session *.cxs.\nSaving an image for embedding or printing: First use the mouse to orient the molecule as desired. Change the background color to white by typing in the command line:\nset bgColor white\n\tFinally, click on the snapshot icon in the Toolbar. The image will save to the desktop.\n\tNOTE: Background color is also available in the dropdown menu; on a Mac, click on UCSF ChimeraX > Preferences; on a PC, click on Favorites > Settings > Background.\n2. iCn3D protocol\nNOTE: Trackpad and Mouse Controls: To rotate, click and drag (mouse: left click and drag). To zoom, pinch and spread (mouse: rotate the scroll wheel). To translate (i.e., move the entire structure) click and drag with two fingers (mouse: right click and drag). To re-center, hover over View in the top dropdown menus, and then click on Center Selection.\nLoading the structure into iCn3D: Navigate to iCn3D Web-based 3D Structure Viewer and type 3FGU into the Input MMDB or PDB ID box to load the file.\nIdentifying the ligands in the active site: Hover over Analysis in the dropdown menu, and then click on Seq. and Annotations. The sequences, in this case Proteins and Chemical/Ions/Water, are shown in a stacked table. Scroll down to see the active site ligands ANP, BGC, and Mg listed. In the structure viewer, hover over the ligands in the active site (shown as sticks in the center of the protein cartoon) to view their names.\nAdjusting the representation: No initial adjustments are required for this protocol.",
    "Selecting residues within 5 Å to define an active site: To select the ligands, use the Select dropdown menu and click on Select on 3D. Ensure that Residue is checked .\n\t\nTo select the ligands, hold down the ALT button on a PC or the Option button on a Mac, and click on the first ligand (e.g., BCG) using the mouse or trackpad. Then, press control and click on ANP and MG ligands to add them to the selection.\n\t\tNOTE: The ligands will become highlighted in yellow as they are selected.\nSave this selection using the dropdown menu: Click on Select > Save Selection and use the keyboard to input a name in the pop-up window (e.g., 3Ligands), and then click on Save. The Select Sets pop-up window will now appear.\n\t\tNOTE: If the selection is incorrect, click on Select > Clear Selection.\nSelect the residues within 5 Å of the ligands: In the dropdown menu, click on Select > By Distance. In the popup menu that appears, change the second item (Sphere with a radius), to 5 Å by typing in the block. Click on the boxed word Display, and then close the window by clicking on the cross sign in the upper right-hand corner.\n\t\tNOTE: In the pop-up menu that appears in step 2.4.3, leave the first set with the input \"selected\" and the second set as \"non-selected.\" Note that the atoms/structures within 5 Å become highlighted with a yellow glow when Display is clicked.\nSave the 5 Å active site using the dropdown menu: Hover over Select and click on Save Selection, input a name in the popup window using the keyboard (e.g., 5Ang), and click on Save.",
    "Next create a new selection that combines the two sets (5Ang and 3Ligands): In the Select Sets pop-up menu, ctrl-click (PC) or command-click (Mac) 5Ang and 3Ligands. Click on Select > Save Selection, use the keyboard to type a name (e.g., 5AFull), and then click on Save.\nShowing the interactions of the enzyme with the active site ligands such as hydrogen bonds: Hover over Analysis in the dropdown menu and click on Interactions. A comprehensive pop-up menu of all noncovalent interactions will appear.\n\t\nUncheck everything except the \"Hydrogen bonds\" and \"Salt Bridge/Ionic\" checkboxes. Click on 3Ligands to select the first set and 5Ang for the second set. Click on the boxed text that reads 3D Display interactions. Close the window by clicking on the cross sign in the upper right-hand corner.\n\t\tNOTE: The Contact/Interactions presumably represent induced dipole-induced dipole interaction, which often makes the display busy. If desired, alter the distance for any type of interaction.\nTo show hydrogen bonds only, click on 5Afull in the select sets pop-up window. Then, hover over Analysis in the dropdown menu, and then click on Chem. Binding > Show.\nDisplaying the side chains as sticks and showing/adjusting the active site water molecules: Use the select sets pop-up menu and click on 5AFull. Then, in the dropdown menus, click on Style > Side Chains > Stick. To apply CPK coloring click on Color > Atom. Finally, click on Style > Water > Spheres (if you prefer larger water molecules).\nSimplifying the structure: In the select sets pop-up menu, click on 5AFull. Then, in the dropdown menus, click on View > View Selection (to just see the 5AFull binding site). Next, click on Style > Proteins > Stick (to show the protein chain as stick instead of ribbon).",
    "To color the carbon atoms of the ligands a contrasting color, click on Chemicals in the Select Sets pop-up window. Then, in the dropdown menu, click on View > View selection. Next click on Select > Select on 3D (ensure \"atom\" is checked). Using the controls described in step 2.4.1, use the mouse and keyboard to select all carbon atoms in BGC and ANP. Then, in the dropdown menu click on Color > Unicolor > Cyan > Cyan.\nTo redisplay the entire active site, use the Select Sets pop-up window to click on 5AFull. Then, in the dropdown menu, click on View > View Selection.\nLabeling ligands and hydrogen-bonded side chains: Use the select sets pop-up window to select Interface_all, and then, in the dropdown menu, click on Analysis > Label > Per Residue & Number.\n\tNOTE: You will have to reselect Per Residue & Number each time you wish to add a label, even though the menu item will already be checked from a previous label.\nSaving the rendering at any point to return to work on it or share with others: In the dropdown menu, click on File > Share Link. Copy the short URL (for example: https://structure.ncbi.nlm.nih.gov/icn3d/share.html?r83NqCz41bu7cmcs8) and paste it onto a browser.\nSaving an image for embedding or printing: In the dropdown menu, click on Select > Toggle highlight. Then, click on Style > Background > White. Finally, click on File > Save files > iCn3D PNG Image and choose the desired size.\n3. Jmol Protocol",
    "NOTE: Trackpad and Mouse Controls: To rotate, click and drag (mouse: left click and drag). To zoom: scroll vertically using two fingers (mouse: shift + left click + drag vertically). To translate (i.e., move the entire structure) control + alt + click and drag (PC), control + option + click and drag (Mac). To re-center: shift + double click in the empty space of the structure viewer window.\nLoading the structure into Jmol: Use the dropdown menu at the top of the GUI to set up the workspace with the structure by clicking on File > Console. Then, click on File > Get PDB. In the pop-up window, type: 3fgu\n\tThen, click on OK.\n\tNOTE: Alternately, use the Jmol console to load the structure, by typing: load = 3fgu\n\tNOTE: After inputting any typed line command, press return on the keyboard to execute it.\nAdjusting the representation: Open the pop-up menu by right-clicking (or control + click) anywhere in the Structure Viewer Window.\n\t\nTo change the protein to cartoon representation, in the pop-up menu, click on Select > Selection Halos. Next, click on Select > Protein > All. Finally, click on Style > Scheme > Cartoon.\n\t\tNOTE: Selection halos puts a yellow outline (glow) around all the selected atoms.\nUse the top dropdown menu to hide the waters by clicking on Display > Select > Water. Next, click on Display > Atom > None, and finally click on Display > Select > None.\nIdentifying the ligands in the active site: Use the mouse to zoom in on the active site, and then use the commands in the substeps to display the ligands as sticks.",
    "NOTE: Ligand names appear in the Jmol console when you load the file. You can also view bound ligand names using the pop-up menu, by clicking on Select > Hetero > by HETATM.\n\t\nHover over the ligands with the mouse to view their names. The active site is near the center of the structure; the ligands MG, BGC, and ANP are located in the active site.\nSelect the ligands BCG and ANP: Using the Jmol console, type:\nselect BGC, ANP\nTo display the ligands BCG and ANP as sticks, use the pop-up menu and click on Style > Scheme > Sticks.\nSelecting residues within 5 Å to define an active site: In the Jmol console, type the following command to select atoms within 5 Å of the three ligands:\nselect within (5, (bgc,anp,mg))\nTo select full amino acid residues, type the following in the console and press Enter\nselect within(group, selected)\n\t\tNOTE: The Jmol console is the best way to select the residues within 5 Å.\nDisplaying the side chains as sticks and showing/adjusting the active site water molecules: Right-click to bring up the pop-up menu, and hover over Style > Scheme > Sticks.\n\tNOTE: Step 3.5 shows the active site side chains in stick representation. There will still be some empty halos in the structure which represent the water molecules in the active site.\n\t\nIn the Jmol console, re-execute the following command:\nselect within (5, (bgc,anp,mg))\n\t\tNOTE: To re-execute a command, click within the console, and then use the arrow keys on the keyboard until that command appears, and click on enter to re-execute it.\nTo display the water molecule atoms, remove the ligands and protein from the selection by typing the following two commands:\nselect remove group protein\n\t\tselect remove group hetero and not water",
    "To display the water molecules, click on the dropdown menu Display. Hover over Atom and click on 20% van der Waals. The green Magnesium ions will still be shown as sticks. Display the magnesium ion in the more common sphere representation by typing the following commands in the Jmol console:\nselect Mg\n\t\tspacefill 50%\nRecolor the ligands to distinguish them from the protein: In the Jmol console, type the following to execute a command that recolors the ligands in a lighter color scheme:\nselect (bgc,anp) and carbon; color [211,211,211]\n\t\tselect (bgc,anp) and oxygen; color [255,185,185]\n\t\tselect (bgc,anp) and nitrogen; color [150,210,255]\n\t\tselect (bgc,anp) and phosphorus; color [255,165,75]\n\t\tselect Mg; color palegreen\nShowing the interactions of the enzyme with the active site ligands: Using the Jmol console, execute each line of the following command:\ndefine ligbind (ANP, BGC, MG)\n\tselect within (5, (bgc,anp,mg))\n\tselect remove group hetero and not water\nTo show lines to illustrate hydrogen bonds, type this command in the Jmol console:\nconnect 3.3 (ligbind and (oxygen or nitrogen)) (selected and (oxygen or nitrogen)) strut yellow\n\t\tThen, modify the thickness of the lines by typing the following command in the console:\nselect all; strut 0.1; select none\nSimplifying the structure: To hide the cartoon of the protein and clear the selection, in the Jmol console, type:\nselect all; cartoon off; select none\nLabeling ligands and hydrogen-bonded side chains: In the pop-up window, click on Set Picking > Select Atom. Click on an atom in one of the hydrogen bonded residues. The amino acid and residue numbers appear in the console. Then, use the console to type a label, for example:\nlabel Glu-256",
    "Saving the rendering at any point to return to work on it or share with others: In the top menu, click on the camera icon. Type a file name and select a location to save.\n\tNOTE: An exported JPEG file (.jpg) contains the information for both an image as it appears in the display window at the time of exporting, as well as the current state of the model. To reload the model, open Jmol and drag the saved JPEG file into the Jmol Display Window.\nSaving an image for embedding or printing: In the Jmol console, recolor the background to white, by typing:\nbackground white\n\tAs in step 3.9, click on the camera icon and save the file.\n4. PyMOL protocol\nNOTE: Trackpad and Mouse Controls: To rotate, click and drag (mouse: left click and drag). To zoom, pinch and spread (mouse: right click and drag). To translate (i.e., move the entire structure), control + click and drag (mouse: command + left click and drag). To re-center go to the right-hand object panel and click on A > Orient or Center.\nLoading the structure into PyMOL: In the command line near the top of the GUI (preceded by \"PyMOL>\"), type:\nfetch 3FGU\n\tNOTE: After inputting any typed line command, press return on the keyboard to execute it.\nAdjusting the representation: In the names/object panel on the right-hand side of the PyMOL window, to the right of \"3FGU\" click on H > Waters.\nIdentifying the ligands in the active site: First turn on the sequence viewer by clicking on the top dropdown menu: Display > Sequence.\n\t\nScroll the gray bar to the right until you find the ligand names (BCG, ANP, MG, K).",
    "NOTE: There are two representations, a cartoon ribbon and sticks; the ligands are shown as sticks. Ensure the selecting mode in the mouse controls on the bottom right panel is set to Residue and 3-Button Viewing mode by clicking on these names to toggle through the options.\nUsing the mouse, rotate and zoom to make the ligands visible.\nSelecting residues within 5Å to define an active site: To select the ligands in the active site, click on each one (BCG, ANP, MG) in the structure viewer. A new selection pops up in the names/object panel; to the right of this new object named \"sele\", click on the A button, and then click on Rename in the pop-up menu.\n\tNOTE: To clear an undesired selection, click on the empty space in the structure viewer to deselect.\n\t\nUsing the keyboard, delete the letters \"sele\" that appear on the top left-hand side of the structure viewer window, and in place of them, type:\nligands\n\t\tNOTE: Steps 4.4-4.4.1 can be done using the command line; type:\nsele ligands, resn BGC+ANP+MG\nUse this selection to define the area around the ligands by first duplicating it, click on ligands > A > Duplicate. Then, click on sel01 > A > Rename\n\t\tUsing the keyboard, delete the letters \"se101\" and type:\nactive\nModify this selection to show residues within 5 Å: In the names/object panel, click on active > A > Modify > Expand > by 5 A, Residues. Then, to show these residues as sticks, click on active > S > Licorice > Sticks. Finally, click in the empty space in the Structure Viewer to clear the selection.\n\t\tNOTE: Step 4.4.3 can be done using the command line, type:\nsele active, byres all within 5 of ligands\nshow sticks, active",
    "Displaying the side chains as sticks and showing/adjusting the active site water molecules: In the names/object panel click on ligands > A > Duplicate. To rename the selection, click on Sel02 > A > Rename Selection. Delete the letters in the renaming menu that appears in the top right of the structure viewer, and type:\n\tactive_water\n\t\nTo adjust the new selection to contain active site water molecules, click on active_water > A > Modify > Around > Atoms Within 4 Angstroms. To modify this further and limit to water molecules, click on active_water > A > Modify > Restrict > To Solvent. Finally, click on active_water > A > Preset > Ball and Stick.\n\t\tNOTE: The GUI allows selection within 4 Å; line commands allow selection of a more appropriate distance of 3.3 Å for hydrogen bonding water molecules. The van der Waals radii of the spheres cannot be set in the GUI, but the \"ball and stick\" selection is close to 0.5 Å.\n\t\tNOTE: Steps 4.5-4.5.1 may be executed using the command line, by typing each line of the following code:\nselect active_water, ((ligands)around 3.3) and (resn HOH)\n\t\tshow spheres, active_water\n\t\talter active_water, vdw=0.5\n\t\trebuild\nShowing the interactions of the enzyme with the active site ligands. Zoom in on the active site by clicking on active > A > Zoom. To find the polar contacts between the ligands and active site, click on ligands > A > Find > Polar Contacts > To Any Atoms. Show distances as labels by clicking on ligands_polar_contacts > S > Labels.",
    "Simplifying the structure: Hide the cartoon of the protein, which hides the part of the protein that is not in the active site, by clicking on 3FGU > H > Cartoon in the names/object panel. Next, hide the labels of the hydrogen bond length by clicking on ligands_polar_contacts > H > Labels in the names/object panel.\n\t\nTo color the ligands to differentiate them from the protein, click on ligands > C > By Element > CHNOS and select the option where \"C\" is cyan (a light blue).\n\t\tNOTE: Step 4.7.1 may be executed using the command line. Type:\ncolor cyan, ligands\n\t\tcolor atomic, ligands & !elem C\nLabeling ligands and hydrogen-bonded side chains: In the names/object panel, on the buttons to the right of any object name, click on active > L > Residues.\nSaving the rendering at any point to return to work on it or share with others: In the dropdown menu click on File > Save Session As. Then, select a location in the pop-up window, type a filename, and click on Save.\nSaving an image for embedding or printing: First, change the background to white in the dropdown menu by clicking on Display > Background > White. Export the image as a new file, by clicking on File > Export Image As > PNG."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}