{
  "id": 8886,
  "origin_website": "Jove",
  "title": "High-throughput Analysis of Locomotor Behavior in the Drosophila Island Assay",
  "procedures": [
    "1. Construction of the Island Assay Box\nPrepare a tray made of a robust material, such as poly methyl methacrylate (PMMA), to contain a layer of water (i.e. a bath). Ensure that the material is not white.\n\tNOTE: Dimensions of 40 x 35 x 2.5 cm3 are recommended (Figure 1A).\nPrepare a box (42 x 38 x 25 cm3) made of a robust, transparent material, such as PMMA, to be placed around the bath to prevent the flies from escaping into the laboratory space. Place a hole (20 x 30 cm2) on the lateral side that is large enough for the experimenter to easily handle the vials with flies and drop them on the island (Figure 1A).\nPrepare an elevated platform 10 x 15 x 2.5 cm3 in dimension, made of an impermeable material (PMMA or plastic) that is watertight.\n\tNOTE: This platform is required to have a uniform white surface to ensure good contrast for image analysis. The size is not necessarily fixed, but it should be large enough to make sure that all flies initially land on the platform and get the chance to walk on it (Figure 1A).\nFix the platform by either gluing it in to the bath or placing weights or other heavy objects inside the platform box to prevent positional changes of the platform during the experimental/filming session.\n2. Software Requirements and Installation\nInstallation of image-recording software.\nDownload image-recording software to record the island image series (see the Materials Table) and install the software on a computer.\n\t\tNOTE: The imaging-recording software described in this protocol is only supported by Windows. An alternative for other users has been added to the Materials Table.\n\"Drosophila Island Assay\" macro installation.",
    "Download the \"Drosophila Island Assay\" macro and the compatible Fiji10 version (1.4 or higher) from the following website: https://doi.org/10.6084/m9.figshare.4309652.v1.\nMove the cursor to the \"Island assay\" directory and click on \"view.\"\nClick on \"Download all.\" The folder content will be downloaded as a .zip file; unzip the downloaded file.\nCopy the \"Drosophila Island Assay.ijm\" file into \"Fiji.app/plugins/directory.\"\n\t\tNOTE: When starting Fiji, the \"Drosophila Island Assay\" macro will appear at the bottom of the plugins dropdown menu.\n\"Island Assay Analysis\" script installation and download.\nDownload R11 from the following website: https://cran.rstudio.com. Install it on a computer.\nDownload R studio from the following website: https://www.rstudio.com/products/rstudio/download/. Install it on a computer.\n\t\tNOTE: The \"Island test analysis\" script can be run with R only. R studio, with its easier user-interface, is presented as alternative step for users inexperienced with R.\nDownload the \"Island Assay Analysis\" script from the \"Drosophila Island Assay\" directory at the following website: https://doi.org/10.6084/m9.figshare.4309652.v1.\n\t\tNOTE: After performing step 2.2, the \"Island Assay Analysis\" script can also be found in the unzipped folder called \"Island assay.\"\n3. Preparation of the Flies to Be Tested in the Island Assay\nCollect staged flies for each experimental condition under cold or carbon dioxide (CO2) anesthesia, as previously described13 (over a period of 1 - 2 days).\nPrepare a minimum of 3 sample vials per experimental condition, each containing approximately 15 staged flies. Only use flies with intact wings and that are of similar age and gender.",
    "NOTE: For the experiments described here, 5 sample vials containing 15 male flies of the genotypes w-; Actin-Gal4/+ (control) and w-; Actin-Gal4/GD11950 (tefu RNAi) were collected on the day of eclosion, aged for 4 days, and were used to perform the island assay. RNAi, control strains, and the Actin-gal4 driver were obtained from a commercial source (see the Materials Table).\nLet the flies recover to avoid effects from the anesthetics (at least 1 day when using CO2) before testing the collected flies in the island assay at the age of interest.\n4. Experimental Setup\nNOTE: See Figure 1B.\nAdd cold water with a small amount of soap to the bath tray and position the platform in the middle.\n\tNOTE: The soap decreases the surface tension of the water; flies that touch the water will drown. This prevents increasing amounts of flies flying in the box during the progression of the experimental session.\nPlace the transparent box on top of the tray and illuminate the platform from above using a lamp.\n\tNOTE: Illumination of the platform is mainly required to ensure proper video contrast. An ordinary 12-V LED light is appropriate for this.\nPosition the webcam directly above the platform (outside the box) and connect it to a computer.\nCreate new folders on the computer to store the different experimental data prior to the experiments.\nFollow the structure of the example illustrated in Figure 2A to create the folders. For example, if the experimental design requires testing two genotypes with five replicates each, first create a main folder containing the date of the experiment. Inside the main folder, create two subfolders (one per genotype). Inside the genotype folders, create five new subfolders, one per replicate.",
    "NOTE: For further analysis, it is essential that the image series corresponding to individual experiments are saved in folders with unique names.\n5. Video Settings Setup in the \"Capture Device\" Section of the Interface\nOpen the image-recording software and, under the \"Capture\" tab, click on \"Time-Lapse Images…\" and select the appropriate webcam as the \"Capture Device.\"\nPlace a dead fly on the island; adjust the video settings by clicking on the \"Video Settings\" box. Scroll through the tool bars, adjusting brightness, contrast, and color in a manner such that the dead fly appears black on a white background (Figure 2B). When the adjustments are complete, click \"Ok.\"\n6. Recording and Video Saving Settings Setup in the \"Time-lapse\" Section of the Interface\nAdjust the settings in the \"Time-Lapse Movie Setup\" to save the experiment as an .avi file.Click on \"Browse…,\" select the directory where the movie will be stored, define the name of the video, and press \"save.\"\n\tNOTE: The video file is not used for the quantification of data; however, it might be useful to get an overall idea about the experiment.\nAdjust the settings in the \"Time-Lapse Movie Setup\" section.\nIn the compression box, select \"Intel IYUV code\" for video compression and choose \"Take one frame every 0.1 seconds,\" with the \"Play-back rate (images per second):\" at 10.\nSave the experiment time series as .bmp frames by clicking on \"Advanced…\" Select \"Create a .bmp image for each captured frame.\" Click on \"Browse.\" Select the same directory in the \"During AVI movie capture\" window (as chosen in step 6.1), click \"Open,\" and press \"Ok.\"",
    "NOTE: Notice that, during the experiment, the frames are stored as .bmp files (required for data analysis). The program names the frames as \"A\" followed by the number corresponding to the frame capture sequence (e.g., \"A_number.bmp\") (Figure 2C). Always save the images belonging to different experiments in a new folder to ensure that previously recorded image series will not be overwritten. Be aware that the images are not automatically saved in the same folder as the video file unless this folder is selected under \"Browse…\" upon clicking the \"Advanced\" box.\n7. Island Assay and Data Collection\nPress the start button in the time-lapse image interface of the image-recording software to start the recording.\nTap the experimental vial containing flies (step 3) 2-3 times to ensure that flies are at the bottom of the vial. Quickly remove the plug of the vial and, with a vigorous movement, tap the vial on the platform so that all flies fall onto the platform at the same time (Figure 1C).\nAfter approximately 30 s, press the \"Stop\" button to stop recording.\n\tNOTE: If all flies vanish from the platform, the recording can be stopped earlier.\nRemove the flies that remain for 30 s on the platform by hand after stopping the image recording.\nBefore proceeding to recording the next experiment, change the target directory for the .bmp files and movies (see section 6).\n8. Data Processing: Running the \"Drosophila Island Assay\" Macro\nNOTE: See Figure 1D.\nRun the \"Create stack and Projection\" sub-macro I to produce stacks and projections of the collected image series.\nStart Fiji, click on \"Plugins\" in the toolbar, and chose \"Drosophila Island Assay\" in the dropdown menu; a new window will appear.\nEnter the \"First image time-series identifier\" setting in the macro graphical interface.",
    "NOTE: The recorded image frames are saved as \"A-number.bmp\" according to the order in which the images are obtained. In the \"First frame identifier\" macro interface, fill in the setting with the number given to the first frame by the program and with the file extension. Fill \"First frame identifier\" with \"-0001.bmp,\" since the first frame is called \"A-0001.bmp\" (Figure 2C). In case other image formats (such as .tiff or .jpeg) are generated by the webcam software, specify the correct file extension of the first image in \"First image time-series identifier.\"\nSelect only the \"Create stack and projection\" sub-macro, click \"Ok,\" and select the main directory that contains all subfolders with individual island assay experiments.\n\t\tNOTE: The .bmp files in each individual experiment folder that contain the \"First frame identifier\" will subsequently be processed. Two new files will appear in each individual experiment subfolder, named by default \"Stack_image_name.tif\" and \"Projection_image_name.tif\" (Figure 1D). Once this step is performed, the .bmp files can be deleted. Stack and projection .tif files contain all data and are sufficient for further analysis.\nRun the \"Define Platform\" sub-macro II to select the exact location of the platform.\nOpen the graphical interface of the \"Drosophila Island Assay,\" select only the \"Define platform\" checkbox, and press \"Ok.\"\nIn the \"Choose a Directory\" window, select the main directory where experimental subfolders are stored and press \"Select.\"\n\t\tNOTE: The \"Define Platform\" sub-macro automatically searches for \"Projection_image_name.tif\" files in all subfolders stored in the main directory. The \"Projection_image_name.tif\" image stored in the first folder, together with two windows—\"Define the platform\" and \"ROI manager\"—will open.\nSelect the \"Polygon selections\" tool in the toolbar to draw a selection that matches the island platform.\n\t\tNOTE: It is very important to exclude the borderline of the platform from the selection. See Figure 2D.",
    "After selecting the platform in the first image, click on \"Add\" in the \"ROI Manager\" window; the selected area will appear in the ROI manager window as a set of values (Figure 2D). Press \"Ok\" in the \"Define the platform\" window. The macro will proceed to the next projection.\nClick on the numbers (Figure 2D) stored in the \"ROI manager\" window; the previous selection will then automatically appear in the current image projection.\n\t\tNOTE: Since the island platform is likely to have the same size and position when experiments are performed in a row (as long as the position of the webcam and island remain unchanged), it is useful to store the ROI defining the platform in the \"ROI manager.\" By doing so, the user will save time; in the upcoming projections, it is only necessary to click on the temporarily stored selection in the ROI manager.\nIf the position of the island has slightly moved compared to the previous experiment, adjust the position of the selection by left-clicking in the center of the selection and dragging the selected area to the required position.\nIf the selection does not match with the platform, left-click outside of the selection and delineate a new selection for the platform using the \"Polygon selection\" tool. Store the new selection in the ROI manager by clicking \"Add;\" a new selection will appear in the \"ROI manager\" window that can be used continuously.\nWhen the selection is adjusted, click \"Ok\" in the \"Define the platform\" window and repeat the procedure until all platforms are defined.",
    "NOTE: Notice that a binary image of the platform corresponding to the delineated ROI area in white on a black background, named \"Platform_image_name.tif,\" appeared for each processed image in the same experimental subfolder as the stack and projection images generated in step 8.1.3 (Figure 1D).\nDefine the minimum fly size.\n\tNOTE: This setting defines the minimal fly size in pixels. Particles that are smaller than the specified minimal size will be excluded from the analysis to avoid false positives due to noise.\n\t\nOpen an image stack created by the \"Create stack and projection\" sub-macro I.\nConvert the image stack to 8-bit by clicking Image>>Type>>8-bit.\nGo to the menu, press Image>>Adjust>>Threshold, make sure that the \"Dark background\" box is selected, and press \"Apply;\" a second window called \"Threshold\" will appear. Click on \"Dark background\" and press \"Ok.\"\n\t\tNOTE: A binary image stack will be created in which the flies are defined in black and the platform in white. When this is not the case, apply the \"Invert\" function by clicking Edit>>Invert>>run.\nSet the scale to detect the number of pixels by clicking Analyze>>Set Scale. Apply the following settings: distance in pixels = 1, known distance = 1, pixel aspect ratio = 1, and unit of length = pixel. Press \"Ok.\"\nSelect the \"Wand\" (tracing) tool in the toolbar and click on a fly (black dot) present on the platform. Press ctrl+m (Windows users) or cmd+m (Mac users); a new \"Results\" window will indicate the area of the selected spot in pixels. Do this consecutively for several flies and determine the minimum fly size.\n\t\tNOTE: When running the macro, set the \"Minimum fly size\" setting to the smallest observed fly size minus a margin of 10%. (Figure 2E).\nRun the \"Analysis\" sub-macro III to quantify flies escaping from the platform.",
    "Go to the toolbar, select \"Plugins,\" and chose the \"Drosophila Island Assay.\"\nAdjust the \"Minimum fly size\" setting according to the value defined in step 8.3.\n\t\tNOTE: Use the value defined in step 8.3 only if the standard setting of \"Minimum fly size\" causes exclusion of flies that were present on the platform or if the macro detects background signal as flies.\nIn the \"Number of flies per vial\" setting, fill the maximum number of flies present in the vials during the complete experiment. For example, if one experiment has vials containing 15 flies, others containing 20 flies, and others containing 23 flies, the \"Number of flies per vial\" must be indicated as 23.\nSelect the \"Analyze\" checkbox and press \"Ok;\" a new \"Choose a Directory\" window will appear. Select the main directory (with all subfolders and files inside) and press \"select.\"\n\t\tNOTE: The macro will analyze all images stored in the subfolders as long as they contain the \"stack_image_name,\" \"Projection_image_name,\" and \"Platform_image_name\" files. The macro will process image after image. The macro output consists of a binary result image stack named “result_stack_subfolder_name.tif” and a result text file called \"result_subfolder_name.txt,\" which appear in each data folder. The resulting text file (.txt) contains quantitative measurements corresponding to the image stack and consists of 9 columns. The content of these columns is summarized in Table 1. \"Result_stack_subfolder_name.tif\" corresponds to the image time-series of one experiment, where flies detected during the experiment are represented as black dots on a white background (Figure 1E).\nCarefully inspect the result stack to ensure that no artifacts have occurred and that the macro worked accurately (Figure 2F).",
    "NOTE: Examples of artifacts can be image elements that are not flies but that are detected as such by the image segmentation algorithm (false positives). This can, for example, be due to detection of background signal because of an inaccurate selection of the ROI.\n9. Data Analysis Using \"Island Assay Analysis\"\nStructure the data as indicated in Figure 2A to allow for analysis with the \"Island Assay Analysis\" script. Generate a main directory with subfolders, where each subfolder corresponds to one experimental condition to be analyzed.\nIn the subfolders, generate folders that contain the independent experimental replicates (Figure 2A) and the results.txt files produced by the \"Drosophila Island assay\" macro.\n\tNOTE: The \"Island Assay Analysis\" macro will process all experimental conditions located in the main directory at once.\nStart R or R studio. Click on File>>Open File… in the toolbar and select the \"Island Assay Analysis\" script.\nInstall the ggplot2 and matrixStats packages when running the \"Island Assay Analysis\" script for the first time. Type the following in the console window:\n\t\t> install.packages(\"ggplot2\"), enter\n\t\t> install.packages(\"matrixStats\"), enter.\nSpecify the location of the data and analysis output files in the script. Insert in the following script rows:\nRow 16: Insert the path to the main directory that contains the experiments to be analyzed and compared (in Figure 2A, this is the path directing to the \"Island Assay\" folder).\nRow 19: Insert the path to the folder where the analysis output files are stored.\n\t\tNOTE: The directory indicated in row 16 can only contain the folders to be analyzed. The script will also not work properly if the paths inserted in row 16 and row 19 are the same.\nRun the script by clicking Code>>Run Region>>Run All from the toolbar.",
    "NOTE: Notice that three resulting .csv files and one resulting .txt file (Figure 1E) appear in the directory defined in row 19. These are: (I) The \"data_all_conditions.csv\" file contains the processed data corresponding to each experimental condition and experimental replicates, organized as described in Table 2. (II) The \"Statistics summary.csv\" file summarizes the mean, the standard deviation (SD), and the standard error of the mean (SEM) of the percent of flies on the platform for each experimental condition. (III) The \"AUC.csv\" file contains the area under the curve for each experimental replicate. (IV) Depending on the number of conditions present in the main folder, the script will either export a \"Welch_t-test_results.txt\" file (2 conditions) or an \"AUC_anova_results.txt\" file (more than 2 conditions), where the results of the t-test or ANOVA comparing the area under the curve between experimental conditions are indicated. Notice that four different types of .tiff image files (Figure 1E) appear in the path defined in row 19. These are called: \"Name_Of_Data_Folder.tiff\" (where Name_Of_Data_Folder represents the folder name given by the user), \"AUC.tiff,\" \"Escape_response_all_conditions.tiff,\" and \"AUC_anova.tiff.\" Detailed information about the content of these graphs can be found in the Representative Results of this manuscript and in Figure 3."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}