{
  "id": 2065,
  "origin_website": "Cell",
  "title": "Detection of muscle stem cell-derived myonuclei in murine overloaded muscles",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTenotomy and EdU injection\nTiming: 10 min per muscle\nThis step describes the surgical procedure for mechanical loading of the plantaris muscle by cutting the tendon of the gastrocnemius and soleus muscles. Before starting this experiment, protocols must be approved by institutional experimental animal care and use committee of own facility.\nAnesthetize adult mice (e.g., C57BL/6J, male or female, 10–15 weeks) by Isoflurane with device (e.g., NARCOBIT-E) or anesthesia cocktail (80–100 μL per 10 g) are used. Both male and female aged 10–15 weeks are used.\nShave the fur from the hind limbs using hair clippers (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1549-Fig2.jpg\nFigure 2. Procedure for cutting the tendon of gastrocnemius and soleus muscles\n(A) Picture showing the effect of anesthesia by stimulating the sole of the foot and the incision position.\n(B) Picture of cut skin. After cutting the skin, two distinct tendons appear. The incision was made larger to clearly show the tendon.\n(C) Picture showing insert the tips of the forceps into the underside of both tendons for cutting gastrocnemius and soleus tendons (Achilles tendon).\n(D and E) Pictures of the cutting of Achilles tendon. Use the tip of the forceps, lift the gastrocnemius and soleus tendons to create a space for the micro-scissors to be inserted, and then precisely cut through the tendons.\n(F) Picture of plantaris tendon after cutting Achilles tendon.\n(G and H) Pictures showing removal 1 mm of Achilles tendon.\n(I) Picture of the suturing process.\n(J) Picture of the end of surgery.\n(B′, D′, F′, and G′) Magnified images of the area enclosed by the squares in (B), (C), (F,) and (G).\nSanitize and wipe skin with 70% alcohol or related reagents (e.g., 10% povidone-iodine).\nCut the skin to expose the plantaris and Achilles tendon (Figures 2[href=https://www.wicell.org#fig2]A and 2B).",
    "Note: The incision position is approximately 3–5 mm from the heel. The risk of damage to the plantaris tendon may increase if the incision is too proximal. As tendon exists just beneath the skin, carefully cut the skin. The width of incision should be approximately 2–3 mm.\nTransect the distal Achilles tendons of both gastrocnemius and soleus muscles (Figures 2[href=https://www.wicell.org#fig2]C–2F).\nCritical: Special care must be taken not to damage the plantaris tendon and vasculature around the Achilles tendon.\nRemove 1 mm of the tendon to avoid reconnection of the cut tendon during the experimental time course (Figures 2[href=https://www.wicell.org#fig2]G and 2H).\nSuture the skin using surgical needle (Suture with Needle (E.O.G Stealized)) with suture and a needle holder (Figures 2[href=https://www.wicell.org#fig2]I and 2J).\nOptional: When the contralateral muscle is used as a sham control, skip steps 5 and 6.\nNote: There are several types of suture; the materials and size. Non-absorbable nylon and 6/0 size suture is used in our surgical procedure. The needle is a square type for plastic surgery.\nInject 0.5 mg/mL EdU dissolved in PBS intraperitoneally into mice at 5 mg/kg body weight daily until the day before euthanizing.\nNote: 4 days after tenotomy is too short to detect EdU-positive myonuclei. Samples 7 days after tenotomy were used in our studies.\nFixation of the plantaris muscle\nTiming: 2–5 min per muscle\nThis is a basic procedure for preparing frozen muscle samples.\nDissect the plantaris muscle with sterile scissors and forceps.\nNote: An apparent increase in the size of the plantaris muscle can be observed compared to that of the contralateral sham control (Figure 3[href=https://www.wicell.org#fig3]A). Loaded muscle weight on day 7 after tendon rupture was increased by approximately 20%–40% compared to the contralateral sham control.\nNote: Used dissection tools are sterilized after washing.",
    "Optional: For a positive control of EdU staining, we recommend isolating the jejunum and fixing it using the same protocol as for muscle fixation (Figure 4[href=https://www.wicell.org#fig4]).\nOptional: If the target is a soluble factor, including fluorescent proteins, the isolated plantaris muscle must be fixed with 4% PFA for 30 min, followed by sucrose replacement (10% sucrose/PBS 4°C for 3 h, then in 20% sucrose/PBS 4°C for 12–16 h). 10 mL 4% PFA and 15–20 mL each percentage of sucrose dissolved PBS is necessary for one muscle. Storage container, 20 mL Screw Bottle, or 15 mL tube is used for this step. After sucrose replacement, you can continue from step 10. Sucrose solutions are used on the same day.\nPick the distal tendon of the isolated plantaris muscle with forceps and place it on the cork using kneaded tragacanth gum (Figure 3[href=https://www.wicell.org#fig3]B). Fill the space between the muscle and gum with Tissue-Tek OCT compound.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1549-Fig3.jpg\nFigure 3. Preparation of plantaris muscle for rapid freezing\n(A) Pictures of plantaris muscle from contralateral sham (left) or overloaded muscle 14 days after tenotomy (right).\n(B) Pictures of plantaris muscle standing on kneaded tragacanth gum.\n(C) Pictures of plantaris muscle upside down.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1549-Fig4.jpg\nFigure 4. Positive control for EdU staining\nImmunostaining of EdU (white) in jejunum from EdU-treated operated mice. Nuclei were counterstained with DAPI. Scale bar: 50 μm.\nOptional: If the sample does not stand up straight, turn it upside down and soak it in cooled 2-methylbutane (Figure 3[href=https://www.wicell.org#fig3]C). At this time, one should be careful not to let the sample touch the bottom or the wall of conical beaker.\nFreeze the plantaris muscle in liquid nitrogen-cooled 2-methylbutane in conical beaker for 1 min with vigorous shaking by holding the cork with a pair of forceps.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1549-Fig5.jpg",
    "Figure 5. Rapid freezing is essential for muscle fixation\n(A–C) H&E staining of plantaris muscles frozen in liquid nitrogen (A), liquid nitrogen-cooled 2-methylbutane (B), or liquid nitrogen-cooled 2-methylbutane after 4% PFA fixation (C). In (A), uneven staining and holes (arrows) are observed in the myofibers. In (C), myofiber divergence is observed, which may affect the volume of interstitial spaces. Scale bar: 200 μm.\nCritical: Liquid nitrogen-cooled 2-methylbutane and vigorous shaking are essential for freezing the sample as rapidly as possible. If this process is insufficient or the samples are directly placed into liquid nitrogen, a hole(s) and mottled staining will be seen in the myofibers (Figure 5[href=https://www.wicell.org#fig5]).\nNote: Wait until the 2-methylbutane cools down completely and the white vapor disappears. Then, immerse the muscle sample into the 2-methylbutane cooling with liquid nitrogen. If 2-methylbutane is immersed in liquid nitrogen for a long time, it will freeze; therefore, 2-methylbutane should be removed from liquid nitrogen to allow the frozen 2-methylbutane to melt. Again, the melted 2-methylbutane is put into liquid nitrogen and wait until the white vapor disappears, then immerse the muscle sample into the 2-methylbutane.\nPlace the muscle samples on dry ice for 1 h to vaporize the 2-methylbutane.\nStore the muscle samples in closed containers (e.g., 20 mL Screw Bottle) at −80°C.\nNote: Place the sample in a sealable container and avoid grasping the container by hand to prevent thawing of the sample. The plantaris muscle may be damaged by physical shock (e.g., dropping samples or containers while transport) and should be handled with care (Do not shake and drop the container and samples).\nImmunostaining\nTiming: 2 days\nThis step describes immunostaining for EdU+ myonuclei.\nMake transverse cryosections (6 μm thick) of the plantaris muscles using a cryostat.",
    "Take samples stocked in containers from the –80°C freezer and place in a cryostat.\nKeep the samples in the cryostat for 10 min.\nMake transverse cryosections (6 μm thick) on silane coated slide glass.\nNote: When stocked samples in −80°C deep freezer are not placed next to the cryostat, please transport samples on dry ice, but not in liquid-nitrogen.\nNote: After cutting off at least 1 mm of the proximal side of the plantaris muscle, cut non-sequential 10 cryosections per one muscle. Totally, 40 cryosections can be placed on one slide.\nDry and make a hydrophobic barrier around the section.\nDry slides for 30 min at 15°C–25°C to ensure that cryosections completely attach on slide glass.\nAfter confirming that the glass slide is not wet, trace around cryosections two or three times with a PAP pen (DAKO pen) to create a barrier within 30 min.\nDry the barrier completely for 5 min at 15°C–25°C.\nNote: 30 min is a minimum time, several hours is also acceptable. Do not push the PAP pen tip too strongly onto the slide because excessive liquid leakage will occur and ruin the sample.\nFixation.\nCover the section with 4% PFA dissolved in PBS (approximately 1 mL/slide) and incubate it for 10 min at 15°C–25°C.\nPlace the slides in a slide staining jar (80–100 mL) and wash three times with 1× PBS containing 0.1% Triton X.\nNote: Aqueous solutions containing PFA should not be disposed of in the sink but should be properly disposed of as hazardous waste.\nPermeabilization.\nTreat the slides with 1× PBS containing 0.5% Triton X (approximately 0.5 mL/slide) and incubate for 20 min at 15°C–25°C.\nPlace the slides in a slide staining jar and wash thrice with 1 × PBS.\nEdU staining.",
    "Prepare a reaction cocktail of the Click-iT® EdU Imaging Kit (Click-iT (TM) EdU Alexa Fluor™ 647 Imaging Kit) according to the manufacturer’s instructions.\nCover the sections with reaction cocktail (approximately 0.5 mL/slide) and incubate for 30 min in the dark at 15°C–25°C.\nPlace the slides in a slide staining jar and wash thrice with 80–100 mL 1× PBS containing 0.1% Triton X.\nBlocking.\nCover the sections with 5% skim milk dissolved in PBS (approximately 0.5 mL/slide) and incubate for 1 h in the dark at 15°C–25°C.\nPrimary antibody treatment.\nPrepare the primary antibody against dystrophin protein (rabbit anti-dystrophin polyclonal antibody) by diluting 800 times with 5% skim milk dissolved in PBS (approximately 0.5 mL/slide).\nCover the sections with diluted primary antibody and incubate in humidified chamber in the dark at 4°C for 12–16 h.\nPlace the slides in a slide staining jar and wash thrice with 80–100 mL 1× PBS containing 0.1% Triton X.\nNote: Only the amount of the primary antibody solution needed for the day is prepared. Do not sore the diluted antibody.\nSecondary antibody treatment.\nPrepare the secondary antibody (donkey anti-rabbit antibody, Alexa Fluor 488) by diluting 500 times with 1× PBS (approximately 0.5 mL/slide).\nCover the sections with diluted secondary antibody and incubate for 1 h in dark at 15°C–25°C.\nPlace the slides in a slide staining jar and wash thrice with 80–100 mL 1× PBS containing 0.1% Triton X.\nNote: Only the amount of the secondary antibody solution needed for the day is prepared. Do not sore the diluted antibody.\nMounting.\nCover the sections with VECTASHIELD® Mounting Medium containing DAPI (3–4 drops/slide).\nLay cover glass on the sections.\nPlace tissue paper on the slides and wipe the excess medium.\nFix the cover glass with nail polish.\nDetection of EdU+ myonuclei\nTiming: 0.5–1 h per section",
    "This is the step for acquiring images for quantitative analyses.\nAdjust the exposure time and gain of each channel to blue (DAPI), green (dystrophin), and white (EdU).\nNote: Dystrophin staining might be better than EdU staining for adjusting the focus. To avoid the loss of fluorescent signals, images should be acquired on the same day.\nNote: Low-resolution images make it difficult to determine the location of EdU. A high-magnification lens (x20 objective lens) should be used for the subsequent analyses.\nAcquire individual blue, green, and white images in all areas of the plantaris muscle using All-in-one Fluorescence Microscope BZ-X700.\nPause point: Confirm the saved data and shut down the PC.\nUse Keyence soft system (BZ-X Analyzer and Hybrid Cell count) or similar system to generate stitched images.\nCount the number of EdU+ myonuclei located within myofibers marked by the dystrophin staining. DAPI staining is essential for confirming the myonuclei (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1549-Fig6.jpg\nFigure 6. Detection of EdU+ myonuclei in a section\n(A and B) Immunostaining of dystrophin (green) and EdU (white) in Sham (A) and overloaded (B) plantaris muscles on day 7 after tenotomy. Scale bar: 200 μm.\n(C) Magnified images of the area enclosed by the squares in B. EdU+ nuclei located within the dystrophin marked myofibers (arrows) are defined as new myonuclei derived from muscle stem cells. Scale bar: 50 μm.\nNote: If there is a sample for which it is difficult to acquire a complete and clean image, the number of myofibers can be counted and the number of EdU+ myofiber nuclei per 100 myofibers can be calculated. In this case, the data are presented as EdU+ number per 100 myofibers."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cells",
    "Microscopy"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}