{
  "id": 13385,
  "origin_website": "Jove",
  "title": "A Quantitative Measurement of Reactive Oxygen Species and Senescence-associated Secretory Phenotype in Normal Human Fibroblasts During Oncogene-induced Senescence",
  "procedures": [
    "1. Inducing Oncogene-induced Senescence\nPreparing an H -RasV12 retrovirus\nCoat the 100 mm culture dish by adding 2 mL of 0.001% poly-L-lysine/phosphate buffered saline (PBS) for 5 min at room temperature.\nRemove the poly-L-lysine solution using a glass pipette connected to a vacuum and wash the culture dish by adding 2 mL of 1x PBS.\nPlate 3 x 106 ecotropic BOSC-23 packaging cells on the coated culture dish with Dulbecco's Modified Eagle Medium (DMEM) containing 10% fetal bovine serum (FBS) and 1% penicillin/streptomycin, and culture them at 37 °C in a CO2 tissue culture incubator for 1 d.\nThe next day, transfect 2 µg of pBabe puro-H-RasV12 DNA together with retroviral packaging DNA (2 µg of pGAG/pol and 0.25 µg of pVSVG) using a transfection reagent for 8 h according to the manufacturer's instructions.\nRemove the transfection media and add 8 mL of fresh media.\nAfter 48 h, collect the media containing the viral particles and remove any cellular debris by centrifugation at 500 x g for 5 min.\nFilter the H-Ras virus-containing media with a 0.45 µm syringe filter.\n\t\tNOTE: Avoid any freezing and thawing of the virus supernatants for an efficient viral infection. To obtain the best efficiency, use a virus that was harvested on the same day as infection.\nInfecting WI-38 normal human fibroblasts with the H-RasV12 retrovirus\nPlate 5 x 104 WI-38 cells in a 60 mm culture dish with DMEM containing 10% FBS and 1% penicillin/streptomycin 1 d before harvesting the H-RasV12 retrovirus, and culture them for 1 day at 37 °C.",
    "Remove the growth medium the next day and add 1 mL of H-RasV12 retrovirus media. Add an additional 1 mL of growth medium containing 2 µL of a polybrene stock solution (8 mg/mL in distilled water). Incubate the sample for 1 day in a humidified 37 °C, 5% CO2 tissue culture incubator.\nRemove the H-RasV12 retrovirus mixture 24 h later and wash the cells 2x with 1x PBS. Add growth medium and treat the cells with 2 µg/mL of puromycin for 2 days in a humidified 37 °C, 5% CO2 tissue culture incubator.\nAfter 2 d of puromycin selection, remove the growth medium, and wash the cells 2x with 1x PBS. Add growth medium and culture the cells in a humidified 37 °C, 5% CO2 incubator until the indicated time point (see Figure 1A for a schematic diagram).\n2. Monitoring Senescence via  Senescence-associated β-galactosidase Staining\nPrepare the following stock solutions.\nPrepare 20 mg/mL of 5-bromo-4-chloro-3-indolyl β-D-galactopyranoside (X-gal) in dimethyl formamide (DMF). Store the solution at -20 °C.\nPrepare a citric acid/sodium phosphate buffer by dissolving 3.377 g of Na2HPO4.7H2O (126 mM) and 0.708 g of citric acid (36.8 mM) in 100 mL of distilled water. Adjust the pH to 6.0, if necessary.\nPrepare 0.5 M potassium ferrocyanide. Store the solution in the dark at 4 °C.\nPrepare 0.5 M potassium ferricyanide. Store the solution in the dark at 4 °C.\n\t\tNOTE: The pH of the senescence-associated β-galactosidase (SA β-gal) staining solution is critical for accurate results.\nMake a fresh SA β-gal staining solution by diluting the stock solution containing 150 mM NaCl, 2 mM MgCl2, 5 mM potassium ferrocyanide, 5 mM potassium ferricyanide, 20% (v/v) citric acid/sodium phosphate buffer, and 1 mg/mL of X-gal.",
    "Remove the culture media and wash the cells 1x with 1x PBS. Fix the cells with 3% formaldehyde for 5 min at room temperature.\n\tNOTE: Cells that are not infected with the retrovirus should be used as a negative control. The uninfected control cells should continue to be passaged to maintain their proliferating status.\nRemove the fixation solution from the cells and wash them with 1x PBS. Add freshly prepared 1x SA β-gal staining solution (1.5 mL in a 60 mm culture dish). Seal the dish with a paraffin film to prevent drying and incubate it for 24 h at 37 °C. Alternatively, incubate the dishes together in a humidity chamber.\n\tNOTE: The fixative solution containing 3% formaldehyde should be disposed of as hazardous waste. An incubator without CO2 is desirable, to prevent pH changes during the incubation.\nCheck the staining status of the cells under a microscope on the next day; SA β-gal-positive cells appear blue in the perinuclear region.\n\tNOTE: The proliferating control cells show a low frequency of SA β-gal-positive cells. If the staining is too light, continue the incubation for a slightly longer period (see Figure 1B for representative examples).\nAcquire an SA β-gal staining image with a CCD camera using a 10X or greater objective lens. Capture a sufficient number of images to calculate the staining percentage (>200 cells).\nCalculate the percentage of SA β-gal-stained cells by quantifying the number of the SA β-gal-positive cells relative to the total number of cells.",
    "NOTE: SA β-gal staining should be repeated independently at least 3x, and the mean values should be calculated based on the results of replicate experiments (Figure 1C). The appropriate cell density is critical for the SA β-gal staining experiment. A high confluency can interfere with the change to a senescence-associated morphology and induce a false-positive signal in the control cells.\n3. Quantifying a Reactive Oxygen Species Induction During H-Ras-induced Senescence\nPlate 2 x 105 WI-38 cells on a 60 mm culture dish and provoke H-Ras-induced senescence as described in step 1.\n\tNOTE: This protocol can be applied to other types of cellular senescence models.\nRemove the growth medium at the indicated time point (2, 4, or 6 days), and wash the cells with 1x PBS. Detach the cells by treating them with 1 mL of 0.05% trypsin/EDTA solution and inactivate the trypsin by adding 1 mL of growth medium containing 10% FBS. Determine the cell count.\nTransfer 1 x 105 cells into a 15 mL conical tube, and collect the cells by centrifugation at 500 x g for 5 min.\nPrepare fresh 2',7'-dichlorofluorescin diacetate (DCF-DA) staining media by adding 50 µL of 10 mM DCF-DA to 10 mL of culture medium (the working concentration of DCF-DA is 50 µM).\n\tNOTE: DCF-DA is light sensitive. Light exposure should be avoided.The concentration of DCF-DA and the staining time can be adjusted depending on the cell type.\nRemove the growth medium carefully from the 15 mL conical tube and add 1 mL of freshly prepared DCF-DA staining medium. Carefully resuspend the cell pellet and incubate it at 37 °C for 30 min in the dark. Include a non-stained sample as a negative staining control.\n\tNOTE: Proliferating cells not stained with DCF-DA should be prepared as a negative control.",
    "Collect the cells by centrifugation at 500 x g for 5 min and wash them 1x with 2 mL of 1x PBS. Resuspend the cells with 1 mL of 1x PBS and transfer the sample to the appropriate fluorescence-activated cell sorting (FACS) tube.\nMeasure the 2′,7′-Dichlorodihydrofluorescein diacetate (DCF-DA) fluorescence signal using a flow cytometer equipped with an appropriate laser source. Excite the samples with a blue laser (488 nm) and detect the emitted fluorescence with a 530 ± 30 nm detector (FITC) using a logarithmic scale.\nAnalyze the non-stained negative control cells first. In a dot plot of forward scatter (FSC) versus side scatter (SSC), select live cells using a gating tool and eliminate dead cells and cellular debris.\n\t\tNOTE: The cell size change should be carefully monitored in the dot plot of FSC versus SSC. If the size of the senescent cells is significantly increased, the DCF-DA intensity should be compared in cell populations of the same size after gating in the dot plot of FSC versus SSC.\nIn a single-parameter histogram displaying DCF-DA (488 nm) fluorescence on the logarithmic scale of the x-axis and the number of events (cell number) on the linear scale of the y-axis, adjust the voltage of the 488 nm laser to place the peak from the non-stained cells at the left edge.\nAnalyze the DCF-DA stained samples and record at least 10,000 events for each sample. Acquire the mean fluorescence value of each sample using analysis software specific to the flow cytometer.\n\t\tNOTE: The ROS measurements should be repeated independently at least 3x, and the mean values should be calculated from these results. Representative H-Ras-induced senescence results are shown in Figure 2.\n4. Quantifying IL-6 and IL-8 mRNA expression for Senescence-associated Secretory Phenotype Analysis Using a Real-time Polymerase Chain Reaction\nTotal RNA preparation",
    "Plate 3 x 105 WI-38 cells on a 100 mm culture dish in DMEM containing 10% FBS and 1% penicillin/streptomycin, and culture them at 37 °C in a tissue culture incubator for 1 day. Prepare duplicate cultures for each time point.\nInduce senescence by infecting the cells with the H-RasV12 retrovirus as described in step 1.\nAt 1 day before the harvest, wash the cells 2x with 1x PBS, and add 3 mL of DMEM without FBS.\n\t\tNOTE: This step is conducted to produce the conditioned medium used for ELISA as described in step 5. Serum starvation may induce an expression of IL-6 and IL-8 mRNAs in some sensitive cells. Thus, the IL-6 and IL-8 mRNA expression in cells cultured with and without serum starvation should be compared initially. If serum starvation induces significant changes in the expression of the IL-6 or IL-8 mRNA, the total RNA for qPCR and the conditioned medium for ELISA should be prepared separately.\nCollect the conditioned medium from each sample 24 h later and store the medium at -80 °C for ELISA.\nDetach the cells by treating them with 1 mL of 0.05% trypsin/EDTA solution and inactivate the trypsin by adding 1 mL of growth medium containing 10% FBS. Determine the cell count for the normalization of the ELISA results as described in step 5. Harvest the cells in a 1.5 mL microcentrifuge tube by centrifugation at 500 x g for 5 min.\nRemove the medium by gentle suction and add 1 mL of RNA extraction solution. Then, vortex the microcentrifuge tube vigorously for 15 s. Subsequently, add 200 µL of chloroform and vigorously vortex the mixture again for an additional 15 s.",
    "Centrifuge the sample tubes at 17,000 x g for 10 min at 4 °C. Then, carefully transfer the upper phase to a new 1.5 mL microcentrifuge tube.\n\t\tNOTE: The interphase and the lower organic phase should not be disturbed during the transfer of the upper phase to a new tube.\nAdd 400 µL of isopropanol to precipitate the RNA and mix them well by gentle inversion. Then, incubate the tube at room temperature for 10 min.\nCentrifuge the tube at 17,000 x g for 10 min at 4 °C. Then, discard the supernatant, taking care to retain the RNA pellet.Wash the RNA by adding 1 mL of 75% ethanol and invert the tube 2–3x. Centrifuge the tube for 5 min at 17,000 x g at 4 °C and discard the supernatant.\nDry the RNA pellet at room temperature and dissolve the RNA in 50 µL of diethyl pyrocarbonate (DEPC)-treated distilled water. Using 1 µL of RNA solution, quantify the total RNA concentration with a spectrophotometer.\n\t\tNOTE: Overdrying will reduce the solubility of the RNA; therefore, avoid overdrying the RNA.\ncDNA preparation\nPrepare the reverse-transcription reaction mixture for each sample by adding the following into a thin-walled PCR tube: 2 µg of total RNA (adjust the volume to 10 µL with RNase-free water), 2 µL of 10x RT buffer, 1 µL of a random primer (50 pmol), 0.8 µL of 25x dNTP mix (100 mM), 1 µL of MMLV reverse transcriptase (50 U/µL), and 5.2 µL of RNase-free water.\nSet up the reverse transcription reaction program on the thermal cycler with the following conditions: 42 °C for 60 min and 95 °C for 5 min. Place the PCR tubes in the thermal cycler and start the program.\nReal-time polymerase chain reaction",
    "Prepare the real-time PCR master mix for all reactions. The reaction mixture for each sample is as follows: 25 µL of 2x real-time PCR Master Mix, 1 µL each of the forward and reverse primers for IL-6 or IL-8, and 21 µL of ultra-pure distilled water (DNase- and RNase-free). See Table 1.\n\t\tNOTE: Prepare the real-time PCR reaction mixture for each sample containing actin RNA primers as an internal control. GAPDH can also be used as an internal control for normalization.\nAdd 48 µL of master mix and 2 µL of 3-fold diluted cDNA product with water to each well in a 96-well optical qPCR plate. Perform each reaction in triplicate. Prepare a control well that does not contain the cDNA template as a PCR control.\nSet up the real-time PCR reaction program on the thermal cycler with the following conditions: 10 min at 95 °C, 40 cycles of15 s at 95 °C (denaturation), and 1 min at 60 °C (annealing and extension).\nPerform real-time PCR and record the threshold cycle (CT) value after the completion of the PCR cycles. Calculate the mRNA levels for IL-6 or IL-8 using the 2-ΔΔCΤ method20.\n\t\tNOTE: The relative fold change in expression is determined after the normalization to the actin levels by using the following formula:\n\t\tFold change = 2-Δ(ΔCT)\n\t\tHere,\n\t\tΔCT = CT, IL-6 or IL-8-CT, actin; and\n\t\tΔ(ΔCT) = ΔCT, stimulated-ΔCT, control.\nCalculate the mean value for each duplicate sample.",
    "NOTE: qPCR should be repeated independently at least 3x, and the mean values should be calculated based on these results. Representative H-Ras-induced senescence results are shown in Figure 3. Serum starvation may induce the expression of the IL-6 and IL-8 mRNAs in some sensitive cells. Thus, the IL-6 and IL-8 mRNA expression in cells cultured with and without serum starvation should be compared initially. If serum starvation induces significant changes in the expression of IL-6 or IL-8 mRNA, the total RNA for qPCR and the conditioned medium for ELISA should be prepared separately.\n5. Quantifying the Levels of Secreted IL-6 and IL-8 Proteins for a Senescence-associated Secretory Phenotype Analysis Using ELISA\nThaw the 3 mL of conditioned medium harvested from senescent WI-38 cells as described in step 4. Remove cell debris by centrifugation at 500 x g for 5 min.\nConcentrate the conditioned medium 10-fold by centrifugation at 3,000 x g for 20 min using a centrifugal filter unit.\n\tNOTE: The concentration of the conditioned medium may not necessarily depend on the sample type.\nPerform the ELISA using 50 µL of each concentrated sample of conditioned medium with the appropriate IL-6 and IL-8 ELISA kits.\n\tNOTE: Test each sample in two ELISA wells. Because each time point is duplicated in step 4, this analysis allows us to monitor variations in both the ELISA assay and the sample preparation technique.\n\t\nFor ELISA plate coating, dilute the IL-6 or IL-8 antibody with 1x PBS to a concentration of 0.5 µg/mL for IL-6 or 0.125 µg/mL for IL-8. Add 100 µL of the diluted antibodies to each well of the ELISA plate. Seal the plate with an ELISA plate sealing film and incubate without shaking overnight at room temperature.",
    "Remove the antibody solution by aspiration. Wash each well 4x with 300 µL of 1x wash buffer (0.05% Tween-20 in PBS). Add 300 µL of blocking buffer (1% BSA in PBS) to each well. Incubate at room temperature for 1 h.\nRemove the blocking solution by aspiration. Wash each well 4x with 300 µL of 1x wash buffer. Prepare serially diluted ELISA standards in a dilution buffer (0.05% Tween-20 and 0.1% BSA in PBS) to generate a standard curve.\n\t\tNOTE: The serial dilution for IL-6 is 31.25, 62.5, 125, 250, 500, 1,000, and 2,000 pg/mL. The serial dilution for IL-8 is 2.34, 4.69, 9.38, 18.75, 37.5, 75, and 150 pg/mL.\nAdd either 100 µL of the standard solution or 100 µL of the sample solution (50 µL of concentrated medium with 50 µL of dilution buffer) to each well. Incubate the wells at room temperature for 2 h.\nRemove the standard or sample solution by aspiration. Wash each well 4x with 300 µL of 1x wash buffer. Dilute the detection antibody with the dilution buffer to a concentration of 0.1 µg/mL for IL-6 or 0.25 µg/mL for IL-8. Add 100 µL of the diluted antibody per well. Incubate the wells at room temperature for 2 h.\nRemove the antibody solution by aspiration. Wash each well 4x with 300 µL of 1x wash buffer. Dilute streptavidin-horseradish peroxidase (HRP) in the dilution buffer to a concentration of 0.05 µg/mL. Add 100 µL of streptavidin-HRP solution per well. Incubate the wells at room temperature for 30 min.",
    "Remove the antibody solution by aspiration. Wash each well 4x with 300 µL of 1x wash buffer. Add 100 µL of 3,3′,5,5′-tetramethylbenzidine (TMB) substrate solution to each well. Incubate the wells at room temperature for 20 min to allow for color development. Stop the reaction by adding 100 µL of a 1 M HCl stop solution.\nRead the absorbance of each well with an ELISA reader at 450 nm.\nPlot the standard curve for the generated standards. Calculate the concentrations of IL-6 and IL-8 in the conditioned medium according to the standard curves. Plot the results after a normalization to the cell count. Calculate the mean values for duplicate samples.\n\t\tNOTE: ELISAs should be repeated independently at least 3x, and the mean values should be calculated based on these results (Figure 4).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}