{
  "id": 2188,
  "origin_website": "Cell",
  "title": "Targeted LC-MS/MS-based metabolomics and lipidomics on limited hematopoietic stem cell numbers",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIsolation of murine bone marrow cells\nTiming: 30–45 min\nHematopoietic stem and progenitor cells reside in the bone marrow (BM) niche. In order to recover the maximum cellular output per mouse, pool the BM within mouse femurs, tibias, ilia, and vertebrae.\nPreparation of mouse femurs, tibias, ilia and vertebrae.\nMice must be handled and euthanized according to the guidelines and protocols approved by the country’s authorities.\nPlace the mouse on its belly, if needed, secure animal onto dissecting tray by pinning front palms so that they are raised diagonally from its body, and disinfect with 70% ethanol.\nIsolation of mouse femurs, tibias, ilia, and vertebrae can be achieved by competent dissection of the mouse legs and spine using forceps and scissors. Isolated tissue should be kept in PBS-filled 6-well plates on ice until all bones are collected.\nRemove the surrounding tissue from the bones and the spinal cord from vertebrae using a scalpel. This step will avoid possible contamination as well as potential blockage during the filtration step.\nPreparation of a BM single-cell suspension.\nUse a mortar and pestle to gently crush the bones with 5 mL ice-cold PBS.\nFilter cell suspension through a 40 μm sterile filter into a 50 mL falcon tube. Keep the tubes on ice.\nRepeat steps 2a and 2b until the bones appear to be completely white.\nLysis of erythrocytes.\nCentrifuge the cell suspension at 400 × g for 5 min at 4°C and remove supernatant.\nRe-suspend in 2 mL ice-cold ACK lysis buffer and incubate on ice for 5 min. Increase incubation time to up to 10 min dependent on the size of the pellet.\nStop the reaction by adding 1 mL ice-cold PBS.",
    "Centrifuge the cell suspension at 400 × g for 5 min at 4°C and remove supernatant.\nNote: For further details on how to isolate BM cells, see protocol by (Zhang and Cabezas-Wallscheid, 2019[href=https://www.wicell.org#bib8]).\nCritical: Cells must be kept on ice from the moment the bones are isolated from the mouse. It is recommended to perform the entire preparation process on ice or in a cold room at 4°C.\nEnrichment for hematopoietic stem and progenitor cells\nTiming: 75 min\nTo enrich for lineage negative (Lin−) cells, we use the Dynabeads Untouched Mouse CD4 Cells Kit (Invitrogen). Note that this kit does not contain CD4 and thus does not deplete CD4 positive cells. A biotinylated CD4 antibody can be added if desired or, alternatively, a home-made lineage cocktail of biotinylated lineage antibodies can be used.\nIncubation of cells using the lineage cocktail.\nRe-suspend cells in 500 μL lineage cocktail (100 μL of the cocktail provided in the kit added to 400 μL PBS per mouse BM) and transfer the supernatant into a 2 mL tube.\nIncubate 35 min on a rotating wheel at 4°C.\nCritical: The incubation time of cells with the lineage cocktail should not exceed 45 min since this will cause lower cell recovery.\nOptional: Instead of using the lineage cocktail included in the Dynabeads Untouched Mouse CD4 Cells Kit (Invitrogen), a home-made lineage cocktail can be used ([CD4/CD8a/CD11b/GR-1/B220/Ter-119]-all biotinylated). To obtain a good depletion efficiency, however, the incubation time should be adjusted to at least 45 min.\nMeanwhile prepare the Dynabeads®.\nVortex the beads for 30 s to make sure that they are well re-suspended.\nAdd 400 μL of the Dynabeads® into a 2 mL tube and incubate for 30 s on a depletion magnet until the solution clears.",
    "Remove the supernatant without disturbing the beads and wash with 1 mL ice-cold PBS.\nRepeat step iii for a total of two washing steps.\nRe-suspend in 500 μL PBS and keep on ice until use.\nWash the cells with 12 mL ice-cold PBS in a 15 mL falcon tube.\nCentrifuge the cell suspension at 400 × g for 5 min at 4°C and remove supernatant.\nDepletion of lineage positive cells.\nRe-suspend cell pellet in 1 mL ice-cold PBS and transfer them to the tube containing the Dynabeads®.\nIncubate for 20 min on a rotating wheel at 4°C.\nCritical: The incubation time of cells with the Dynabeads® should not exceed 25 min since this will lead to reduced cell recovery.\nIncubate cells for 5 min on ice on the depletion magnet until the solution clears.\nTransfer the entire supernatant into a new FACS tube and keep cells on ice.\nAdd 1 mL ice-cold PBS and repeat steps 5c and 5d, then combine the two supernatants.\nCritical: Shorter incubation time will reduce efficiency of the depletion process.\nSurface staining of lineage depleted cells for sorting.\nCentrifuge the cell suspension at 400 × g for 5 min at 4°C and remove supernatant.\nRe-suspend in ice-cold PBS containing the surface antibody cocktail ([CD4/CD8a/CD11b/GR-1/B220/Ter-119]-all PeCy7, c-Kit/CD117-PE, Sca-1-APC-Cy7, CD150-BV605, CD48-BV421) and incubate for 30 min at 4°C in the dark.\nNote: Other suitable combinations of fluorescent dyes can be used and will not influence the results.\nFluorescence-activated cell sorting of purified hematopoietic stem cells\nTiming: 1–3 h",
    "Note: Depending on the abundance of the desired cell population, the number of mice, and the event rate of the sorting process, the time required for this step may differ. However, it is recommended to not exceed a sorting time of more than 4 h since this will negatively impact the metabolome and lead to a starvation phenotype of the cells.\nPreparation of cells for FACS.\nAdd 1 mL ice-cold PBS.\nCentrifuge the cell suspension at 400 × g for 5 min at 4°C and remove supernatant.\nRe-suspend pellet in an appropriate volume of PBS dependent on the size of the pellet (usually between 500 μL and 2 mL).\nFilter cells through a filter-cap FACS tube.\nPrepare 1.5 mL-RNAse/DNase/ATP-free tubes containing A) 100 μL StemPro®-34 SFM (Life Technologies) without cytokines for measuring TCA-cycle metabolites and amino acids or B) 100 μL 100% acetonitrile for measuring signaling lipids and retinoids.\nSort A) 10,000 HSCs (Lineage− cKit+ Sca1+ CD150+ CD48−) using the 100 μm nozzle of a FACSAria II, FACSAria III, or FACSymphony (Becton Dickinson) or B) 40,000 HSCs using the 70 μm nozzle while constantly cooling the samples.\nCritical: Cells must not hit the side of the tube but only the surface of the liquid. Also, prepare at least two tubes as negative controls. It is crucial to treat these samples identically to those containing cells.\nCritical: Retinoids are light-sensitive metabolites. It is therefore essential to keep the samples for B) in the dark during and after the sorting process.\nNote: FACS is a very stressful process for most cells.",
    "Depending on the cell type you are interested in, a short recovery step of 20 min in the incubator (37°C; 5% CO2) might increase the number and amount of detected metabolites. However, even a short incubation period will lead to activation of metabolic pathways and, in the case of quiescent populations (such as HSCs), may not reflect the actual in vivo phenotype. Thus, it is highly recommended to adjust the experimental setup according to the biological question being asked.\nTargeted polar metabolomics: A) TCA cycle metabolites and amino acids\nTiming: 45 min–1 h\nWash the cells.\nAdd 1 mL 2.8% glycerol solution per 1.5 mL tube.\nCentrifuge the cell suspension at 400 × g for 5 min at 4°C and remove supernatant.\nCritical: PBS contamination of the flow cytometry sorting process will interfere with the measurement and thus reduce metabolite recovery. Cells must therefore be washed with a glycerol solution. It is important to remove as much supernatant as possible without losing cells. Removing too little supernatant will lead to high background levels for all metabolites contained in the media. To estimate the background levels of the measured metabolites, the two negative controls should be processed in the exact same way (including washing process).\nMetabolite extraction.\nAdd 100 μL of the pre-cooled 80% MeOH extraction buffer containing 1 μL 13C yeast extract to the washed cell pellet.\nEnsure complete re-suspension of the cell pellet by repeated pipetting.\nCentrifuge 3 min at 20,000 × g and 4°C to pellet cell debris.\nTransfer 95 μL of clear supernatant to a fresh Eppendorf tube.\nVacuum concentration of the samples.\nVacuum concentrate (EZ2 elite, Genevac) the samples for 35 min using the aqueous program, lamp off.\nCritical: Do not over-dry the samples, as this will lead to decreased metabolite recovery.",
    "Pause point: Samples can be stored at this point for up to 2 weeks at −80°C.\nLC-MS/MS analysis of TCA cycle metabolites and amino acids\nTiming: 2 h plus 10 min for every sample\nCalibrate the mass spectrometer following the manufacturer’s recommendations. Ensure that the check tune is passed.\nInstall fresh mobile phase buffers HILIC A and HILIC B in sufficient amounts for the expected number of samples.\nPurge liquid chromatography (LC) system with mobile phase. Purge 5 min with 3 mL/min with a 50:50 mix of both mobile phase buffers.\nInstall the Luna aminopropyl chromatography column.\nEquilibrate the LC system with mobile phase buffers in starting conditions.\nCheck LC performance by running a blank sample. Ensure that the backpressure is below 170 bar under starting conditions and remains below 300 bar throughout the gradient run. If backpressure is too high, check for restrictions in the mobile phase flow path.\nEquilibrate the column by running 4 blank samples.\nIt is highly recommended to use quality control samples such as pool samples, mixtures of standards, or reference material to check if the LC-MS/MS performs as expected.\ntable:files/protocols_protocol_1665_10.csv\ntable:files/protocols_protocol_1665_11.csv\nNote: An Agilent 6495 Triple Quadrupole mass spectrometer coupled to an Agilent 1290 Infinity II ultra-high-performance liquid chromatography (UHPLC) system is used for quantification of metabolites in this protocol. The MS parameters are detailed in Table 1[href=https://www.wicell.org#tbl1]. Other LC-MS/MS systems with similar capabilities can be used. For other LC-MS/MS systems, LC and MS parameters may have to be adapted.\nNote: Compound-specific MS settings were optimized separately for all compound using pure standards. These settings are machine-specific and optimization must be repeated on a different machine. Settings used for this protocol are listed in Table 2[href=https://www.wicell.org#tbl2].\nCritical: LC systems operate under high pressure. Refer to manufacturer’s instructions to avoid leakage of mobile phase buffers.",
    "Critical: Mass spectrometers apply high temperatures to evaporate the stream of mobile phase buffer coming from the LC. Refer to manufacturer’s instructions and do not touch hot surfaces to avoid burn wounds. Ensure sufficient ventilation to avoid accumulation of harmful or dangerous vapors. Mass spectrometers apply high voltages to ionize metabolites. Refer to manufacturer’s instructions to avoid electric shock.\ntable:files/protocols_protocol_1665_12.csv\ntable:files/protocols_protocol_1665_13.csv\nTargeted metabolomics: B) Signaling lipids and retinoids\nTiming: 40 min\nCritical: Remember that retinoids are light-sensitive metabolites and it is essential to keep the samples protected from light during processing.\nNote: Metabolites are already extracted when reaching the extraction solution. The contaminant fluid due to the droplets is roughly 1 nL/droplet when using the 70 μm nozzle and will lead to a final ACN concentration of 60%–80%, depending on the number of cells and the FACS setup.\nOf note, steps 1–8 are shared for both protocols (A and B). After step 8 of protocol A, you should continue with this step (20) if assessing protocol B:\nVacuum concentration of the samples.\nVacuum concentrate (EZ2 elite, Genevac) the samples for 35 min using the aqueous program, lamp off.\nCritical: Do not over-dry the samples, as this will lead to decreased metabolite recovery.\nPause point: Samples can be stored at this point for up to 2 weeks at −80°C.\nMicroLC-MS/MS analysis of signaling lipids and retinoids\nTiming: 3 h plus 1 h for every sample\nCalibrate the mass spectrometer following the manufacturer’s recommendations. Ensure that the check tune is passed.\nInstall fresh mobile phase buffer microLC A2 and microLC B1 in sufficient amounts for the expected number of samples on UHPLC System (see Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1665-Fig1.jpg\nFigure 1. Plumbing scheme of microLC setup",
    "During the loading phase, the dashed connections are used to load the sample onto the trap column and discard excess mobile phase. During the analytical phase, the dotted connections are used. Flow from the microLC pump elutes metabolites from the trap column to enable separation on the microLC column and subsequent detection by QQQ-MS.\nPurge UHPLC system with mobile phase. Purge 5 min with 3 mL/min with a 50:50 mix of both mobile phase buffers.\nEquilibrate the UHPLC system with mobile phase buffers in starting conditions.\ntable:files/protocols_protocol_1665_14.csv\ntable:files/protocols_protocol_1665_15.csv\ntable:files/protocols_protocol_1665_16.csv\nInstall fresh mobile phase buffer microLC A1 and microLC B1 in sufficient amounts for the expected number of samples on microLC pump.\nPurge microLC system with mobile phase with 6 full strokes on each channel.\ntable:files/protocols_protocol_1665_17.csv\ntable:files/protocols_protocol_1665_18.csv\nEquilibrate complete system in starting conditions.\nCheck system performance by running a blank sample. Ensure that the UHPLC backpressure is below 120 bar under starting conditions and remains below 250 bar throughout the gradient run. Ensure that the microLC backpressure remains below 900 bar throughout the gradient run. If backpressure is too high, check for restrictions in the mobile phase flow path.\nNote: An Agilent 6495 QQQ mass spectrometer coupled to an Agilent 1290 Infinity II UHPLC system and a Prolab Zirconium Ultra is used for quantification of metabolites in the is protocol. Other LC-MS/MS systems with similar capabilities can be used. In any case, the MS parameters detailed in Table 3[href=https://www.wicell.org#tbl3] may need to be adapted.\nNote: Compound-specific MS settings were optimized separately for all compounds using pure standards. These settings are machine-specific and optimization must be repeated on a different machine. Settings used for this protocol are listed in Table 4[href=https://www.wicell.org#tbl4].\ntable:files/protocols_protocol_1665_19.csv\ntable:files/protocols_protocol_1665_20.csv\nLC-QQQ-MS data pre-processing",
    "Raw liquid chromatography triple quadrupole mass spectrometry (LC-QQQ-MS) data require pre-processing to extract peak area or peak height as alternative measures of signal intensity. Signal intensity can then be used as a proxy for the concentration of metabolites in a sample. Alternative software solutions exist for LC-QQQ-MS data pre-processing, including fully automatic solutions such as MRMprobs (Tsugawa et al., 2014[href=https://www.wicell.org#bib7]) and automRm (Eilertz et al., 2022[href=https://www.wicell.org#bib1]), as well as solutions that facilitate manual peak review, such as skyline (MacLean et al., 2010[href=https://www.wicell.org#bib4]), and vendor-specific solutions such as MassHunter.\nLow-input metabolomics experiments often suffer from low signal intensity. In addition, both hydrophilic interaction liquid chromatography (HILIC) and microLC are notorious for suboptimal retention time reproducibility. Consequently, manual peak review is required to maximize the number of quantified metabolites. We opted to use MassHunter8 because it does not require conversion of our original data to an open format. During manual peak review, it is important to follow a set of guidelines to obtain reliable results:\nSignal intensity in cell extract must be higher than in the blank sample.\nChromatographic peaks of quantifier and qualifier must align well.\nThe ratio in signal intensity between quantifier and qualifier must be similar across all samples. This does not apply to 13C qualifiers.\nIf shifts in retention time occur, they should typically be in the same direction for all metabolites and might increase in the order of measurement. Moreover, retention times could continue to shift in the same direction from sample to sample.\nThe location of the start and end of a chromatographic peak relative to the top of the peak should be as similar as possible for all peaks.\nThe choice of baseline relative to a chromatographic peak and the surrounding background signal should be as similar as possible for all peaks.",
    "If chromatographically separated isotopes are observed, their elution order must always remain the same, even if their retention time shifts.\nSignals that do not meet these criteria should be disregarded in subsequent analyses.\nSome additional considerations that aid data interpretation:\nThe signal intensity of phenol red can be used as a proxy for the amount of medium carry over. Lower signal intensity indicates less carry over.\nSome peaks can show persistent background signals (e.g., cholic acid in the microLC analysis of polar lipids or citric acid in the analysis of polar metabolites). In these cases, subtraction of background signal intensity from the signal intensities recorded for cell extracts may be advisable.\nNormalization of signal intensity values can improve the quality of the results:\nNormalization to cell number (determined by FACS during sample preparation) can be used to compensate for differences in the amount of input material. Differences greater than 3-fold should not be compensated in this way because non-linear effects can occur.\nNormalization to total protein or total DNA in the cell pellet after extraction of metabolites can be used to compensate for differences in the amount of input material. Differences greater than 3-fold should not be compensated in this way because non-linear effects can occur.\nNormalization to the signal intensity of a 13C qualifier can be used to compensate for degradation of compounds prior to analysis and differences in ionization efficiency during MS analysis. This is only reliable if a matching 13C qualifier has been recorded with sufficient signal intensity. Note that for some polar metabolites no 13C quantifier was recorded.",
    "We advise against using quantile normalization or normalization to the sum of all metabolite signals for the data generated with the methods described in this protocol because the limited number of metabolites covered by these LC-QQQ-MS methods can introduce a bias in the data."
  ],
  "subjectAreas": [
    "Mass Spectrometry",
    "Metabolomics",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}