{
  "id": 3634,
  "origin_website": "Cell",
  "title": "Protocol for brain-wide or region-specific microglia depletion and repopulation in adult mice",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nInducing widespread depletion and repopulation of microglia\nTiming: 3 days\nHere we detail how microglial depletion/repopulation can be induced by systemic diphtheria toxin (DT) administration via intraperitoneal (IP) injection into tamoxifen-treated CX3CR1creERT2 × iDTR mice or CX3CR1creERT2 × iDTR × tdTomatoflox mice.\nDiphtheria toxin (DT; Sigma-Aldrich) stock solution is prepared at 2 mg/mL in sterile water (e.g., UltraPure water), according to manufacturer’s instructions, and stored at −80°C in 5 μL aliquots. Avoid freeze thawing DT.\nThe expiration date of the DT stock solution is lot-specific and can be found on the manufacturer’s Certificate of Analysis (Sigma-Aldrich).\nWorking solutions of DT (3 ng/μL) are made by adding 3 μL of DT stock solution to 2 mL of injectable saline in a 2 mL Eppendorf tube. Vortex the working solution and place on ice.\nDT is injected at a dose of 30 ng per gram body weight with 10 μL per gram body weight volume injected; e.g., 20 g mouse will be injected with 200 μL of DT working solution for a 600 ng dose of DT.\nTo inject working DT solution, mice are weighted and appropriate dose/volume DT working solution loaded into a 1 mL syringe attached to 25-gauge needle.\nRestrain the mouse and inject IP with working DT solution. Return the mouse to its home cage.\nMice are injected once daily for three consecutive days, at approximately the same time of day. Microglia should be depleted (>90% depletion) for at least ~24 h after the last DT injection and will undergo endogenous repopulation thereafter. See Troubleshooting 1[href=https://www.wicell.org#mmc1].",
    "Monitor the mice’s weight during DT treatment. Mice should lose no more than 20% of their original body weight over the course of DT treatment. If they do lose greater than 20% of their original body weight, or become sick, then cease DT treatment and monitor mouse’s health.\nCritical: Once diluted, DT working solution should be used within 1 h. Always keep DT on ice. Persons working with mice and DT should have a current diphtheria vaccination.\nInducing region-specific depletion/repopulation of hippocampal microglia\nTiming: ~30 min per animal\nInducing microglial turnover can also be achieved in a region-specific manner for the hippocampus via stereotaxic intra-hippocampal injection of DT into tamoxifen-treated CX3CR1creERT2 × iDTR mice or tamoxifen-treated CX3CR1creERT2 × iDTR × tdTomatoflox mice using stereotaxic rig (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/321-Fig1.jpg\nFigure 1. Setup of stereotaxic rig used for brain injections in mice\nPrepare the DT working solution to deliver 0.1 ng of DT in 0.5 μL of sterile saline. Prepare DT working solution just prior to use. Do not freeze-thaw DT.\nAttach the Hamilton syringe to the syringe pump (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/321-Fig2.jpg\nFigure 2. Hamilton syringe attached and held in place to the syringe pump\nFill the Hamilton syringe with sterile saline using a 1 mL syringe (with no needle attached).\nPrepare the polyethylene tubing prior to surgery. Insert an 18-gauge needle head (needle only) to the end of the tubing. Secure the needle in place with nail polish. Allow nail polish to harden. UV the tubing and keep the needle sterile.\nPrior to attaching to the Hamilton syringe, use an 18-guage needle attached to 1 mL syringe loaded with sterile injectable saline and perfuse saline through the prepared tubing, ensuring that there are no leaks in the tubing and the saline is running through the needle.",
    "Attach the open end of the polyethylene tubing to the Hamilton syringe needle, careful not to puncture holes in tubing. The tubing should be inserted onto the Hamilton syringe by about 0.5 cm to ensure a stable connection (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/321-Fig3.jpg\nFigure 3. Attachment of polyethylene tubing to the Hamilton syringe needle\nConnect the tubing with needle end to the stereotaxic rig and gently hold in place with the stereotaxic rig needle attachment. Be careful not to disturb the needle head or dislodge the needle from the tubing (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/321-Fig4.jpg\nFigure 4. Tubing with needle end connected to Hamilton syringe held in place to stereotaxic rig\nPress the plunger of the Hamilton syringe and expel the sterile saline in the tubing. Carefully remove the droplet from the needle using a sterile tissue or separate sterile 18-guage needle head.\nDraw up some air into the tubing then use a sterile 0.6 mL Eppendorf tube lid filled with DT working solution or sterile saline and draw up into the tubing via the needle head of the tubing (Methods Video S1[href=https://www.wicell.org#mmc1]). This will allow for a gap (marked with a sharpie) between the sterile saline from the Hamilton syringe and your loaded solution, making it easier to tell whether your solution is indeed be delivered and running through the tubing appropriately. Ensure that there are no bubbles when drawing up the working solution into the tubing (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/321-Fig5.jpg\nFigure 5. Tubing filled with working solution to be injected using stereotaxic setup\nAnesthetize the mice via IP injection of 0.01 mg/g BW tiletamine/zolazepam (Zoletil) and 0.01 mg/g BW xylazine. Zoletil/xylazine solution is prepared as below:\nUsing sterile syringe, transfer 0.1 mL of xylazine stock into a 1.5 mL Eppendorf tube.",
    "Add 0.1 mL Zoletil and mix in with 0.1 mL of xylazine by vortex.\nTake 0.1 mL of the Zoletil/xylazine stock mixture and put in new 1.5 mL Eppendorf tube.\nAdd 0.9 mL of injectable saline and mix very well by vortex.\nFor dosing: use just under 0.1 mL/10 g. For example, for a 20 g mouse, give between 0.18–0.19 mL; for a 30 g mouse give 0.28 mL as a starter. Prepare Zoletil/xylazine mixture either day before surgery (kept in fridge at 4°C for ~8–24 h) or just prior to surgery.\nTrim the fur on top of the mouse’s head where the surgery site will be and mount the mouse into the stereotaxic frame.\nCoat the mouse’s head with betadine using a cotton tip.\nPlace eye drops or vaseline to mouse’s eyes to ensure they do not dry out during surgery.\nUsing a scalpel, make a mid-line incision (1.5 cm long) along the skull, and retract the skin using non-dissolvable sutures to keep the skin away from skull.\nUse a surgical marker pen to mark the Bregma location on the skull.\nMove the needle to be positioned directly above Bregma and zero the coordinates on the stereotaxic. Raise the needle, so that you do not hit or scrape the skull when moving the needle and move the needle to the required coordinates (X, −2.0 mm; Y, −1.50 mm). Mark this location with the surgical marker. This will be the site to be injected.\nCarefully and gently drill out a small hole where the injection site will be. Remove the skull piece carefully with fine forceps. Take great care to not damage the underlying cortex.\nLower the needle to the surface of the cortex. Zero the Z coordinates.",
    "Carefully and slowly lower the needle into the brain over 2 min until you reach -2.0 mm Z coordinates.\nLet the needle rest for 3 min.\nStart the syringe pump to deliver the solution. Use a flow rate of 0.2 μL/min. For DT we deliver 0.1 ng in 0.5 μL over 2.5 min.\nStop the pump and allow to rest for 3 min.\nSlowly draw up the needle. Advance 0.1 mm upward every 30 s for the first 1 mm, then slowly draw up for the remaining 1 mm over another 2–3 min.\nRemove the mouse from the stereotaxic frame and place mouse on a heat mat to maintain the animal’s core body temperature.\nSuture the incision.\nAny type of sutures can be used. We typically use coated Vicryl dissolvable sutures (J493G, J&J, Ethicon).\nMonitor the mouse until it has recovered and is awake and walking normally. Return mouse to home cage. Mice should be monitored daily to ensure it has successfully recovered from surgery and the sutures stay intact and the incision site heals.\nNote: The coordinates used herein may be adapted to target other brain regions of interest. Here, with the coordinates above we have targeted microglia in the dorsal hippocampus.\n        Your browser does not support HTML5 video.\n      \nMethods Video S1. Setting up tubing and uptake of solution to be intra-hippocampally delivered via stereotaxic injection, related to step 12\nFluorescence activated cell sorting of microglia\nTiming: ~1 h 45 min per animal",
    "Below we detail how to isolate resident or repopulated microglia (tdTomato-positive) from the hippocampus of tamoxifen-treated CX3CR1creERT2 × iDTR × tdTomatoflox mice. Mice with resident microglia are administered saline, while DT is administered to induce depletion and endogenous microglia repopulation, as detailed above See Troubleshooting 1[href=https://www.wicell.org#sec6.1]. The efficiency of the microglial depletion and repopulation can be assessed by comparing numbers of microglia in microglial depleted animals with vehicle-treated controls (i.e., mice with resident microglia), either via fluorescence activated cell sorting (detailed below), or by immunostaining fixed brain sections with microglial markers (e.g., Iba1).\nMice are euthanized by cervical dislocation and the brains rapidly dissected from skull.\nRemove the brain and submerge in ~3 mL of pre-chilled “microglia isolation buffer” in 50 mL falcon tube on ice. An exact volume of pre-chilled “microglia isolation buffer” is not necessary, so long as the brain is fully submerged in the buffer.\nIn laminar flow hood, transfer brain onto petri dish with drops of ice-cold isolation media (approximately 100–200 μL), and quickly dissect out hippocampus (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/321-Fig6.jpg\nFigure 6. Schematic overview of hippocampus dissection\nUse surgical blade and cut along optic chiasm to remove rostral region of septo-diencephalon (viewed from bottom of brain)\nFrom the top of the brain, use forceps to separate the hemispheres, and push the hemisphere aside.\nUsing circular/rolling motion, raise the hippocampus from overlying cortex and carefully remove using curved forceps. Using the forceps, transfer the isolated hippocampus to a separate petri dish.\nKeep this isolated hippocampus in drops of ice-cold DMEM F12 with HEPES (~200 μL) in a petri dish on ice until remaining dissections are complete.",
    "Repeat for other hemisphere and/or other brain/s. Use a separate petri dish per sample and keep on ice. Process at most 2 mice/samples per run to ensure that all processing is done as quickly as possible. Samples from multiple mice can be pooled to isolate enough cells for downstream applications.\nUsing a scalpel blade, gently dice hippocampi in petri dish on ice until no obvious lumps of tissue remain.\nAdd 0.5 mL of the “papain dissociation buffer” per hippocampi, 0.25 mL onto the minced hippocampi and 0.25 mL on to the side of the petri dish (Figure 7[href=https://www.wicell.org#fig7]). Use a 1 mL pipette to aspirate papain and hippocampi and transfer into a 15 mL Falcon tube. Use the extra papain solution on the side of the petri dish to collect any leftover cells/tissue before adding to the same falcon tube.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/321-Fig7.jpg\nFigure 7. Papain dissociation buffer added to diced hippocampi in Petri dish\nPlace the tubes into the 37°C water bath for 8 min.\nRemove the tubes from the water bath and using a 1 mL pipette very gently titrate (i.e., pipette up and down) the mixture 3 times by holding the tip of the pipette against side of the tube with some pressure. This step is important to break down any clumps, producing a single cell suspension (Methods Video S2[href=https://www.wicell.org#mmc2]).\nReturn tubes to water bath for another 8 min.\nGently triturate 2 times as above.\nGently add 3–4 mL of warm isolation buffer to tube by adding to side of the tube.\nThe Isolation buffer is kept warm at 37°C in the water bath.\nCentrifuge cells at 300 × g for 10 min.\nAspirate off supernatant, being careful not to disturb pellet.",
    "Re-suspend cells by adding 2 mL of the isolation buffer to the cell pellet using a pipette and gently tapping/flicking the tube.\nFilter cells through 40 μm cell sieve (Falcon, BD Biosciences) into FACS tube.\nKeep cells on ice and protected from light.\nDissociated single cells are sorted using a Cytopeia Influx Cell Sorter (BD Bioscience).\nMicroglia sorting strategy is as follows: cells are first defined by their forward scatter vs. side scatter, removing small cellular debris. Single cells are highlighted, and tdTomato-positive cells isolated (Figure 8[href=https://www.wicell.org#fig8]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/321-Fig8.jpg\nFigure 8. Representative FACS gating and tdTomato-positive microglia sorting strategy from an uninjured tamoxifen-treated CX3CR1creERT2 × iDTR × tdTomatoflox mouse with resident microglia\nFor RNA extraction, cells are directly isolated into 300 μL of cell lysis buffer from the Zymo Quick RNA kit in a 1.5 mL RNase-/DNase-free Eppendorf tube. Care should be made to keep the Zymo cell lysis buffer at 22°C–24°C, as the lysis buffer freezes on ice. RNA extraction is performed exactly as according to manufacturer’s instructions (Zymo Research, https://files.zymoresearch.com/protocols/_r1054_r1055_quick-rna_miniprep_kit.pdf[href=https://files.zymoresearch.com/protocols/_r1054_r1055_quick-rna_miniprep_kit.pdf]), completed immediately after cell isolation.\nFrom our experience, we have pooled two ipsilateral hippocampi (i.e., the ipsilateral hippocampi collected from two mice) and we are able to isolate ~40k cells from naive mice, ~20–34k resident microglia cells at 3 days post injury, and ~5–15k repopulating microglia cells at 3 days post injury in a mouse unilateral controlled cortical injury model of moderate traumatic brain injury, as previously described in Willis et al., (2020)[href=https://www.wicell.org#bib2]. We have not attempted to isolate the surviving microglia immediately after DT-induced depletion, when the microglia are >90% depleted. Biological replicates can be pooled during FACS isolation prior RNA extraction to generate more RNA, if needed for downstream applications. Troubleshooting 2[href=https://www.wicell.org#sec6.3]",
    "Critical: For all steps, ensure to perform in RNase and DNase-free manner, avoiding any fixatives, as this will affect sample quality. Process no more than 2 samples at a time to ensure that all processing is done as quickly as possible. All steps with papain should be done quickly, and papain incubation timed to ensure tissue is appropriately digested.\n        Your browser does not support HTML5 video.\n      \nMethods Video S2. Titration of hippocampi tissue in papain, related to step 36"
  ],
  "subjectAreas": [
    "Neuroscience",
    "Immunology",
    "Model Organisms",
    "Flow Cytometry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}