{
  "id": 3268,
  "origin_website": "Cell",
  "title": "Protocol for measuring visual preferences of freely swimming Xenopus laevis tadpoles",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nMeasuring color/luminance preferences of freely swimming tadpoles\nTiming: 35 min\nThis section describes the experimental setup (Figure 2[href=https://www.wicell.org#fig2]A) and provides detailed procedures for recording the visual preferences of freely swimming Xenopus laevis tadpoles.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2860-Fig2.jpg\nFigure 2. Experimental set-up and analysis of color/luminance preference test\n(A) Equipment set-up: The computer monitor is set to display the test stimulus.\n(B) The test dish is placed on the displayed stimulus such that one quarter of the dish represents the region of interest (ROI).\n(C) Graph represents the visual preference of tadpoles across a 30-min trial. The preference is determined by counting every minute, on the minute the number of tadpoles that reside in the ROI. The overall preference for the ROI during the trial is determined by averaging the preference across the 30 time-points. Dashed line represents the average number of tadpoles in the ROI that would be expected if there is no preference for, or avoidance of, the ROI.\nPosition the LCD monitor, Clamp stand and GoPro camera as shown in Figure 2[href=https://www.wicell.org#fig2]A.\nAdd 75 mL of working Steinberg’s solution into the plastic petri dish (test dish).\nUse a transfer pipette to transfer ten randomly chosen tadpoles from the rearing bowl to the test dish.\nNote: If testing the light or color preference of tadpoles previously exposed to pharmacological agents, be sure to first transfer the tadpoles from the exposure bowl to a holding bowl containing working Steinberg’s solution before transfer to the test dish to prevent any drug from contaminating the test dish.",
    "Critical: This test has been optimized using ten tadpoles in a 14 cm diameter test dish. We have determined that, with ten tadpoles in the test dish, there appears to be no schooling behavior that would interfere with the display of individual preferences.1[href=https://www.wicell.org#bib1] If more than 10 tadpoles are used, it would be necessary to determine whether the group displays schooling behavior. If so, this would not be optimal.\nTurn on the computer monitor to display the stimulus on the screen.\nPlace the test dish containing the tadpoles over the stimulus on the monitor such that one-quarter of the test dish displays the test stimulus, or region of interest (ROI) (Figure 2[href=https://www.wicell.org#fig2]B). Tadpoles usually swim freely in the test dish.\nNote: Monitor brightness can be adjusted to a certain set point in the computer display settings and maintained across different experiments/ trials. If using multiple monitors, ensure that the monitor brightness is the same for each computer. For measuring the accurate display properties of a computer monitor, we suggest downloading the “DisplayHDR Test” software.\nNote: Monitor temperature generally is not a concern for backlit LCD monitors with IPS panel, OLED monitors, or mini-LED monitors because these types do not heat up; however, CRT monitors, older backlit LCD monitors with VA/TN panel that don’t have an active cooling solution (fans built in the back of the monitor chassis) heat up, and so should not be used for this experiment.\nTurn on the GoPro camera and record the freely swimming tadpoles for any desired amount of time. The recording is carried out at room temperature (approximately 22°C). Once the recording is completed, turn off the GoPro and retrieve the video for offline analysis.\nNote: Do not place a lid over the test dish during imaging as it may interfere with image acquisition.",
    "Critical: The strength in the preference for light has been observed to oscillate over the 24-h light/dark cycle.2[href=https://www.wicell.org#bib2] Thus, the experiments should be carried out at the same time of the day to avoid potential variations."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Developmental Biology",
    "Behavior"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Ecology & Environmental Biology"
  ]
}