{
  "id": 19393,
  "origin_website": "Jove",
  "title": "Integrated Photoacoustic, Ultrasound, and Angiographic Tomography (PAUSAT) for NonInvasive Whole-Brain Imaging of Ischemic Stroke",
  "procedures": [
    "All animal procedures were approved by the Duke University Medical Center Animal Care and Use Committee and were conducted in accordance with the United States Public Health Service's Policy on Humane Care and Use of Laboratory Animals. Male and female C57BL/6J mice (see Table of Materials) were used for these studies. A minimum of three animals were imaged per stroke model group. See Figure 2 for the workflow followed in this protocol.\nimgsrc://cloudfront.jove.com/files/ftp_upload/65319/65319fig02.jpg\nFigure 2: Summary of the experimental procedure for PAUSAT imaging applied to stroke. Created with Biorender.com. The figure shows the workflow of the imaging procedure starting from (A) the two main stroke models (pMCAO and PT stroke). (B) A retro-orbital injection of the microbubbles must be performed prior to positioning the animal on the PAUSAT membrane. (C) A mask providing continuous anesthesia and a heating pad to keep the animal's body temperature stable are required in this setup. The animal's body is placed on the heating pad while the head rests on the membrane of the system. (D) The order of image acquisition is also displayed in the figure. (E) TTC staining is performed to validate our results in this study. DPI: days post-injury. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65319/65319fig02large.jpg]\n1. Inducing the stroke mouse model\nPermanent middle cerebral artery occlusion (pMCAO) with common carotid artery (CCA) ligation.\n\tNOTE: Briefly, perform permanent ligation of the right CCA and posterior electrocauterization of the right middle cerebral artery (MCA)17. This procedure limits the cerebral blood flow in the right cortex of the brain, causing an ischemic stroke18.\n\t\nInduce anesthesia in an induction chamber using an inhalational mix of 5.0% isoflurane in 30% O2/70% N2 until loss of consciousness (recognized as a loss of the pedal reflex).",
    "Intubate the animal using a 20 G catheter (Table of Materials) and connect it to an automatic ventilator. Set the flow rate based on the animal's body weight and keep the animal anesthetized using 1.5%-2.0% isoflurane in 30% O2/70% N2.\nUsing a heating lamp and a rectal probe connected to a temperature controller device, keep the animal's body temperature at 37 °C.\nPut a drop of lubricant eye ointment on the mouse's eyes.\nPlace the animal in a supine position and remove the hair from the neck area using a hair trimmer.\nClean the skin area by first using a cotton swab with povidone-iodine, and then using a sterile pad with 70% ethanol. Perform this thrice.\nVerify the depth of anesthesia and the absence of pain by slightly pinching the animal's posterior paw.\nMake a 0.8 cm sagittal incision on the middle line of the neck and expose the right CCA.\nPrepare a suture for the CCA ligation by dissociating a 4-0 silk suture into thinner threads that compose the main thread. Use a length of 1.5 cm of one of the subthreads to permanently ligate the CCA.\n\t\tNOTE: After tightening the knot, remove excess thread by cutting the extension at a 1-2 mm distance to the knot.\nApply a drop of bupivacaine before closing the wound.\nClose the incision using interrupted 4-0 silk surgical sutures and apply triple antibiotic ointment on the surface to prevent infection.\nMove the mouse to expose the right lateral side of the animal's body.\nRemove the hair in the region between the ear and the eye area using a hair trimmer.\nDisinfect the surgical area using a cotton swab with povidone-iodine, followed by a sterile pad with 70% ethanol. Repeat this step three times.",
    "Place a sterile drape to secure the surgical area. Then, make a 0.5 cm incision between the right eye and ear of the animal, exposing the joint between the skull and the temporal muscle.\nUsing a cautery loop, cauterize the muscle to separate it from the skull and expose the area of the MCA.\nDrill a 0.2 mm2 window to expose the MCA using an electric drill, and use electrocautery on the MCA to occlude blood flow.\n\t\tNOTE: A single pulse at 80% power intensity is enough to cauterize the MCA.\nUsing a 1mL syringe attached to a 27G needle, apply a drop of bupivacaine (Table of Materials) at the surgical site.\nClose the skin incision using interrupted 6-0 clear monofilament sutures and apply triple antibiotic ointment on the surface to prevent infection.\nAfter completing the surgery, transfer the animal to an incubator with controlled temperature (32 °C) and allow the animal to recover.\nAfter 2 h, transfer the animal to its home cage and provide food and water ad libitum.\nPhotothrombotic stroke (PT stroke)\n\tNOTE: Briefly, PT stroke is performed by illuminating Rose Bengal within the vessels in the brain. Rose Bengal is administered intraperitoneally, and once it has been well distributed throughout the body (5 min), it is illuminated by a green cold light, which activates the Rose Bengal to generate reactive oxygen species (ROS). These ROS damage the membrane of endothelial cells, creating thrombi within the entire illuminated area and leading to local cerebral blood flow disruption19.\n\t\nInduce anesthesia in an induction chamber using an inhalational mix of 5.0% isoflurane in 30% O2/70% N2 until loss of consciousness (recognized as a loss of the pedal reflex).\nSet the animal to a stereotaxic frame, keeping the animal anesthetized using a mask and 1.5%-2.0% isoflurane in 30% O2/70% N2.",
    "Keep the animal at 37 °C using a hot water recirculating heater and a rectal probe to measure the animal's body temperature.\nPut a drop of lubricant eye ointment on the mouse's eyes.\nShave the animal's head using a hair trimmer.\nClean the shaved scalp area three times, first using a cotton swab with povidone-iodine, and then using a sterile pad with 70% ethanol.\nVerify the absence of pain by slightly pinching the animal's posterior paw.\nMake a 1.4 cm sagittal incision on the middle line of the scalp using a scalpel and expose the skull.\nUsing a sharp pencil, make a mark at 1.5 mm from the bregma toward the right side.\nPlace a circular pinhole of 2.5 mm diameter centered on the 1.5 mm mark.\n\t\tNOTE: A square containing a circular pinhole can be made by using double-sided black tape and making a 2.5 mm diameter opening in the center by using a single-hole punch tool of the mentioned size.\nPlace the green cold light on the circular pinhole, keeping the gap between the light and the pinhole to a minimum.\nCover the area using aluminum foil to avoid spreading of the light.\nOnce the setup is ready, inject the animal intraperitoneally with 10 mg/kg Rose Bengal (10 mg/mL in 1x phosphate-buffered saline [PBS]) and wait for 5 min.\nAfter 5 min, turn on the cold light source (intensity: 4.25) and maintain the exposure for 15 min.\nNext, turn off the cold light and verify the stroke either by the naked eye (the area is expected to be whiter than the surrounding area) or using external devices to measure the cerebral blood flow (for example, by using laser speckle contrast imaging (Table of Materials; see step 5.1).",
    "Using a 1mL syringe attached to a 27G needle, apply a drop of bupivacaine (Table of Materials) at the surgical site.\nClose the skin incision using interrupted 6-0 clear monofilament sutures, and apply triple antibiotic ointment on the surface to prevent infection.\nAfter completing the surgery, transfer the animal to an incubator with controlled temperature (32 °C) and allow the animal to recover.\nAfter 2 h, transfer the animal to its home cage and provide food and water ad libitum.\n2. Preparing PAUSAT for imaging\nTurn on the 532 nm laser and leave it on for 15 min to warm-up.\nPrepare the imaging platform for the anesthetized animal.\n\t\nPlace a customized ramp (Figure 2C) attached to the manually adjustable stage (Table of Materials) beside the imaging membrane.\nAttach a mouse tooth-holder with the breathing tube connected to the customized ramp and secure a heating pad on the surface of the ramp.\nAfter the laser has warmed up, check that the laser path and coupling into the fiber-bundle is well-aligned using a near-infrared detector card (Table of Materials) by placing the card in front of the fiber-bundle input and ensuring the laser light enters the bundle.\n\t​NOTE: Adjust any laser path mirrors as necessary to ensure the laser input is centered with the fiber-bundle input.\n3. Preparing the animal for PAUSAT\nNOTE: PAUSAT is performed 1 day following PT stroke surgery or 3 days following pMCAO surgery. Preparing PAUSAT for imaging (step 2) takes about 20 min and should be done immediately before preparing the animal for PAUSAT.\nInduce anesthesia in an induction chamber using an inhalation mix of 5% isoflurane mixed with 30% O2/70% N2 until loss of consciousness (recognized as a loss of the pedal reflex).",
    "Transfer the animal to a heated platform with a tooth-holder and a mask, and maintain the anesthesia at 1.5%-2.0% isoflurane in 30% O2/70% N2.\nUse a heating lamp and a rectal probe connected to a temperature controller device to keep the animal's body temperature at 37 °C.\nTrim the hair on the top of the animal's head by using an electric shaver. Include the region from near the eyes to behind the ears.\nShave the hair on the top of the animal's head by applying a commercial hair removal cream to completely remove the remaining short hair. Leave on the skin for 5-6 min, then wipe off using a cotton swab dabbed in water to help fully remove the cream. Repeat until the skin is clear of hair.\n\tNOTE: For imaging 1 day after the surgery, these steps can be performed before starting the surgery; at 1 day after PT stroke, they can be omitted. When PAUSAT image acquisition is performed several days after the surgery, this step is critically required to be performed.\nOnce the animal and the system are ready for imaging, and right before transferring the animal to the system's platform, inject a 100 µL solution of microbubbles at the stock concentration (Table of Materials) retro-orbitally using a 27 G needle.\n\t​NOTE: Once the bubbles are in circulation in the bloodstream, there is a limited amount of time to image without a significant loss of signal (~10 min).\nPut a drop of eye protection lotion on the mouse's eyes.",
    "NOTE: It is not recommended to apply eye lubricant until the retro-orbital injection is performed to avoid foreign substances reaching the animal's bloodstream. Therefore, hair removal cream application must be performed slowly and carefully to avoid getting too close to the eyes (but enough to expose the region of interest where the stroke is expected). The hair cream removal is performed with a cotton swab previously dabbed in water, preventing the cream from dripping, which can damage the eyes.\n4. PAUSAT Imaging\nNOTE: This is done to image the contra- and ipsi-lateral regions of the brain after stroke\nTransfer the mouse to the integrated PAUSAT (Table of Materials) image platform, placing the mouse in a supine position on the customized ramp (Figure 2C).\nFill the imaging window with enough distilled water on the surface for acoustic coupling.\n\tNOTE: An optional ramp-printed using a 3D printer-is recommended to prevent the animal's body from getting wet during the image acquisition and improve the animal's comfort. It also helps maintain a stable body temperature. Furthermore, the ramp can be attached to a manual stage (Table of Materials) to adjust the focal depth of the dual-element wobbler transducer relative to the mouse head. The custom ramp design file is available upon request to the authors.\nSecure the mouse head in the tooth-holder and ensure proper anesthesia and air flow.\nUsing a heating lamp and a rectal probe connected to a temperature controller device, keep the animal's body temperature at 37 °C.\nOpen the imaging application (Table of Materials) and navigate to B-mode ultrasound.\nUse the live ultrasound window to manually adjust the mouse head to the desired position.",
    "Use the live ultrasound window to adjust the height of the stage, such that the focal depth of the transducer (19 mm) is approximately in the middle of the area to be imaged.\nImaging with B-mode ultrasound\n\t\nAdjust the value of the ultrasound transmission frequency in B-mode (for these studies, use 16 MHz).\nInput the save directory information in the imaging application.\nUse the floating box to select the desired region for the B-mode scan of the brain.\nPress the Acquire Static button.\nCheck the results of the scan in the application once the image acquisition is completed to ensure that the desired region has been imaged.\n\t\tNOTE: Avoid unnecessary delays in B-mode imaging acquisition to ensure that a high enough concentration of microbubbles remains in the bloodstream for the AA.\nImaging with AA\n\t\nReturn to Image Acquisition.\nChange to Acoustic Angiography mode in the imaging application (Table of Materials).\nInput the desired scan protocol parameters (the most important of which is frame spacing and the number of frames per position, which was set to 0.2 mm and 10, respectively, for these studies).\nPress the Acquire Static button.\n\t\tNOTE: The AA acquisition takes longer than the B-mode ultrasound.\nOnce the scan is completed, check the results of the scan under Image Analysis to ensure that the image quality is as expected.\n\t\tNOTE: For AA mode, a more representative whole-brain volume can be acquired by repeating a second scan at a different focal depth inside the brain and later recombining the images with proper post-processing (see Figure 3).\nImaging with photoacoustic tomography\n\t\nOpen the optical parametric oscillator (OPO) application (Table of Materials) and set it to 756 nm.",
    "NOTE: OPOs can easily get out of calibration, so prior to the experiment, ensure that the OPO is calibrated correctly by using an independent spectrometer.\nManually translate the linear-array transducer to the previously determined coordinates to ensure that the wobbler volumes and the linear-array volumes are automatically co-registered.\n\t\tNOTE: It is critical that a co-registration experiment using a phantom grid is done beforehand to determine the exact distance needed to translate the stage, such that the resulting data from both transducers are co-registered in 3D.\nOpen the laser application and turn on the 532 nm laser.\nUsing a laser power meter, measure the energy of the laser output and ensure it is the desired energy (~10 mJ per pulse was used for these studies).\nSelect the desired scanning parameters for PAT (0.4 mm step size, 20 mm scan length, and 10 frames averaged per position).\nOpen the ultrasound data acquisition system MATLAB program (Table of Materials) and press the Run button.\nAcquire the PAT scan by pressing the Start button.\nOnce the scan is complete, open the MATLAB save program. Change the save name to the desired file name and press the Run button.\nChange the OPO wavelength to 798 nm and repeat the steps from 4.10.3 to 4.10.8.\n\t\t​NOTE: For a longitudinal study, it is recommended to allow the animal to recover by placing it in an incubator and under observation for a few hours (following steps 1.1.18 and 1.1.19). If result validation is desired, continue to section 5 immediately after PAUSAT imaging.\n5. Optional: Results validation\nLaser speckle contrast imaging (LSCI).\n\t\nAnesthetize the animal using 1.5%-2.0% isoflurane in 30% O2/70% N2.\nSet the animal to a stereotaxic frame, keeping the animal anesthetized using a mask and the above-mentioned inhalational anesthesia.",
    "Keep the animal at 37 °C using a hot water recirculating heater and a rectal probe to measure the animal's body temperature.\nPut a drop of eye protection lotion on the mouse's eyes.\nVerify the absence of pain by slightly pinching the animal's posterior paw.\nRemove the hair on the animal's scalp using a hair trimmer.\nDisinfect the surgical area using a cotton swab with povidone-iodine, followed by a sterile pad with 70% ethanol. Repeat this step three times.\nMake a 1.4 mm sagittal incision on the middle line of the scalp and expose the skull. Use forceps to hold the scalp and prevent it from occupying the area of the brain to scan.\nApply some drops of saline on the skull and place the laser speckle contrast system device (Table of Materials) over the animal's head.\nUnder the File menu, set the device in Online mode, contained in the submenu Working Mode.\nSelect the default image storage folder in the File menu and the Save Settings submenu.\nIn the Light Source menu, connect the guiding laser (\"Laser on\") and the white light (\"White-light on\") to locate the imaging window at the right position.\nIn the Setting menu, select Magnification settings, move the cursor manually to 2.5, and press Apply and OK to save the settings.\nAdjust the focus by manually moving the focus bar located in the top submenu of the main page.\nIn the Setting menu, select Pseudo Color Threshold Setting, adjust the threshold as desired, and press Apply and OK to save the settings.\nIn the Light Source menu, disconnect the guiding laser (\"Laser off\") and the white light (\"White-light off\") before capturing the image.\nCapture the image by selecting the Play symbol in the top submenu of the main page.\nTriphenyltetrazolium chloride (TTC) staining",
    "Deeply anesthetize the animal using 5% isoflurane in 30% O2/70% N2.\nOnce the animal has stopped breathing, decapitate it using sharp scissors.\nRemove all the skin around the head and the muscles in the neck area.\nMake a sagittal cut in the occipital part of the skull until it reaches the parietal bone.\nMake a horizontal cut (~5 mm) in the left and right side below the blood vessel. Remove the occipital bone of the skull using straight forceps.\nMake a cut (~5 mm) at the frontonasal suture of the skull.\nMake a sagittal cut (~10-15 mm) in the midline of the skull-between hemispheres-and make sure they are completely separated.\nUsing size #7 curved scissors, remove the parietal left and right bones of the skull from the center to the sides.\nTransfer the brain to a container filled with 5 mL of ice-cold 1x PBS and keep it on ice for 10 min.\nTransfer the brain to a stainless-steel brain matrix (1 mm thick sections).\nSection the brain in 1 mm coronal sections using disposable razor blades (Table of Materials).\nHolding the blades by their sides, transfer into a container filled with ice-cold 1x PBS.\nCarefully separate the sections from the blades one by one.\nTransfer the brain slices into a 70 mm diameter Petri dish containing 5 mL of 2% TTC (Table of Materials, 3) in 1x PBS.\nIncubate for 15 min in the dark at room temperature (R/T).\nAfter 15 min, discard the TTC, replace it with 3 mL of formalin, and incubate in the dark for at least 30 min at R/T.\nFinally, transfer the brain slices onto a transparent plastic film and scan the samples, including a ruler in the scan image as a reference for future measurements.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}