{
  "id": 19872,
  "origin_website": "Wiley",
  "title": "Simple, Inexpensive RNA Isolation and One-Step RT-qPCR Methods for SARS-CoV-2 Detection and General Use",
  "procedures": [
    "This section details how to prepare a one-step RT-qPCR master mix using homemade enzymes. First, this protocol describes how to express His-tagged Taq DNA polymerase in E. coli and purify the enzyme using a combination of nickel-NTA and heparin chromatography. Taq DNA polymerase is well expressed in E. coli and easy to purify, with a yield of 6-8 mg/L of culture. Because the enzyme is thermostable, an initial step of high-temperature incubation of the bacterial lysate can be used to denature most E. coli proteins, leaving soluble Taq polymerase in the supernatant. The purified Taq polymerase may optionally be converted into a “hot-start” version using formaldehyde crosslinking (Buratowski, 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0008]). This inactivates the enzyme, which can be reactivated by incubating at 95°C to reverse the crosslinks. While homemade hot-start Taq polymerase permits reaction setup at room temperature, it has the drawback of lower amplification efficiency. This tradeoff should be considered when deciding whether to produce regular or hot-start enzyme. We describe both protocols below.\nSecond, we describe how to express and purify His-tagged M-MLV reverse transcriptase. Like Taq DNA polymerase, this enzyme is well expressed in E. coli and straightforward to purify with a yield of several milligrams per liter. The details of this protocol are very similar to those of the Taq DNA polymerase protocol. Finally, we describe how to prepare the two components of the Basic Economical Amplification Reaction mix (BEARmix; i.e., one-step RT-qPCR master mix): a 4× buffer and an enzyme mix containing the two enzymes purified, Taq polymerase and M-MLV reverse transcriptase.",
    "It is crucial when preparing these components to avoid contamination with in vitro−transcribed RNA or amplified products of previous RT-qPCR reactions. This can be prevented by working in an area of the lab separate from where concentrated in vitro−transcribed RNAs or PCR products have been handled, preferably in a dedicated laminar flow hood such as a biosafety hood or enclosed PCR workstation, and by using a dedicated set of pipettes and filter tips, if possible.\nMaterials\nPlasmid pET-28a_6H-TAQ_E602D (Addgene, #166944)\nBL21 (DE3) or Rosetta (DE3) competent E. coli, or other T7-based protein expression strain\nLuria-Bertani (LB) agar plates (see recipe)\nKanamycin, 50 mg/ml (1000×) stock solution\nChloramphenicol, 34 mg/ml (2000×) stock solution in ethanol [if using Rosetta (DE3) cells]\nLuria-Bertani (LB) liquid medium (see recipe)\n1 M isopropyl β-D-1-thiogalactopyranoside (IPTG; GoldBio, 12481C25) in water\n1× phosphate buffered saline (PBS; see recipe)\nLiquid nitrogen\nTaq lysis buffer (see recipe)\n20 mg/ml lysozyme (Sigma, L6876-10G) in 1× PBS (see recipe)\nGlycerol\n2 M imidazole (Sigma, 12399-500G), adjusted to pH 8 using hydrochloric acid\nβ-mercaptoethanol (Sigma, 444203-250ML)\nNi-NTA agarose (Qiagen, 30230)\nTaq buffer W500 (see recipe)\nTaq buffer W100 (see recipe)\nTaq elution buffer (see recipe)\nSDS-PAGE gels and running buffer (see Current Protocols article: Gallagher, 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0020], for details)\n4× SDS-PAGE sample buffer (see recipe)\nCoomassie blue stain or rapid protein gel stain, such as InstantBlue (Expedeon, ISB1L)\nHeparin dialysis buffer (see recipe)\nHeparin buffer A (see recipe for heparin buffer A/B)\nHeparin buffer B (see recipe for heparin buffer A/B)\nTaq storage buffer (see recipe)\nTaq crosslinking buffer (see recipe)\n16% formaldehyde (Polysciences, Inc., 18814-10)\n2 M Tris·HCl, pH 8 (see, e.g., Moore, 1996[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0037])\nTaq post-crosslinking dialysis buffer (see recipe)\nPlasmid pET-28a_6H-MMLV_RT_D524N-6H (Addgene, #166945)\nM-MLV RT lysis buffer (see recipe)\n5 M NaCl\nM-MLV RT buffer W500 (see recipe)",
    "M-MLV RT elution buffer (see recipe)\nSP buffer A (see recipe)\nSP buffer B (see recipe)\nM-MLV RT storage buffer (see recipe)\n1 M Tris·HCl, pH 8.4 (see, e.g., Moore, 1996[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0037])\n2 M KCl\n1 M MgCl2\nD-(+)-trehalose dihydrate (Sigma, T0167)\n1 M dithiothreitol (DTT; GoldBio, DTT50)\n0.5 M ethylenediaminetetraacetic acid (EDTA), pH 7.5 (see, e.g., Moore, 1996[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0037])\n10 mM dNTP solution (New England Biolabs, N0447L)\nDNase/RNase-free water\nOptional: Laminar flow hood (e.g., biosafety cabinet or enclosed PCR workstation)\nShaker set to 37°C\n5-ml plastic culture tubes with caps (Falcon, 352063)\nFour 2.8-liter Fernbach flasks\n1-liter centrifuge bottles\nSpectrophotometer\n15- and 50-ml conical tubes (e.g., Corning Falcon)\nRefrigerated high-speed centrifuge with rotors for 1-liter bottles and 30-ml tubes\nRotator\nHeat block set to 75°-80°C with wells large enough to accommodate 5-ml plastic culture tubes\n30-ml screw-top centrifuge tubes\n250-ml glass bottle\nEmpty glass or plastic column for gravity flow chromatography (e.g., Qiagen, 34964)\nSupport stand and clamp for holding column\nMagnetic stir plate and stirrer\nVacuum line (optional)\nDialysis tubing, MWCO 12-14 kDa (Spectra/Por 2, 132678)\nDialysis clips (Spectrum, 142153)\nHeparin affinity column compatible with the FPLC system, e.g., 1-ml HiTrap Heparin HP affinity column (Cytiva, # 17040701)\nFast performance liquid chromatography (FPLC) system, e.g., ÄKTA pure (Cytiva)\n4°C microcentrifuge\n1.7-ml microcentrifuge tubes\n250-ml metal beaker\nTip sonicator (Branson Sonifier 450 or equivalent)\n250-ml glass beaker\n1-ml HiTrap SP HP column (Cytiva, 29-0513-24)\nAdditional reagents and equipment for introduction of DNA into cells (see Current Protocols article: Seidman, Struhl, Sheen, & Jessen, 2001[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0048]), SDS-PAGE (see Current Protocols article: Gallagher, 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0020]), staining gels (see Current Protocols article: Sasse & Gallagher, 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0047]), and dialysis (see Current Protocols article: Zumstein, 2001[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0057])\nPurification of Taq DNA polymerase and preparation of hot-start Taq polymerase\nProtein expression",
    "1. Transform expression plasmid pET-28a_6H-TAQ_E602D using your method of choice (see Current Protocols article: Seidman et al., 2001[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0048]) into competent cells of an E. coli strain optimized for T7-based protein expression, such as BL21 (DE3) or Rosetta (DE3). Plate on LB agar supplemented with 50 µg/ml kanamycin [as well as 17 µg/ml chloramphenicol for Rosetta (DE3)], and allow to grow overnight at 37°C.\n2. Inoculate four 5-ml starter cultures of LB liquid medium supplemented with 50 µg/ml kanamycin [as well as 17 µg/ml chloramphenicol for Rosetta (DE3)] each with a single colony from the plate. Grow overnight in a 37°C shaker.\n3. Pool the four 5-ml starter cultures and use 4 ml to inoculate 1 liter of LB liquid medium + 50 µg/ml kanamycin [+ 17 µg/ml chloramphenicol for Rosetta (DE3)] in each of four 2.8-liter Fernbach flasks.\n4. Grow in a 37°C shaker at 200 rpm until the optical density at 600 nm reaches 0.8-1.0.\nThis typically takes 2-3 hr.\n5. Add IPTG to a final concentration of 1 mM (1 ml of a 1 M stock per liter of culture), and grow for 2 hr at 37°C.\n6. Pellet cells by centrifugation for 10 min at 4000 × g, room temperature. Resuspend the pellets in 20 ml of 1× PBS each, pool the four resuspended pellets for a total of 80 ml, and transfer 40 ml of the resuspended cells to each of two 50-ml conical tubes. Pellet again by centrifugation for 10 min at 4000 × g, room temperature, and flash-freeze pellets in liquid nitrogen in the 50-ml conical tubes. Store at −80°C until ready for the next step.\nThe cell pellets are likely stable for months or years when stored at −80°C.\nProtein purification by nickel affinity\nFrozen pellets may be thawed at room temperature.",
    "7. Resuspend two cell pellets (each coming from the equivalent of 2 L of culture) in 40 ml of Taq lysis buffer each.\n8. Add 2 ml of a 20 mg/ml lysozyme solution to each tube (i.e., 1 ml per liter of culture), and rotate the 50-ml conical tubes at room temperature for 15 min.\n9. Distribute the lysate among 5-ml plastic culture tubes, adding approximately 4 ml per tube.\n10. Seal the plastic culture tubes and heat to between 75°C and 80°C in a heat block for 1 hr.\n11. Pool the heated lysates into a 250-ml glass beaker and add 60 ml of Taq lysis buffer (i.e., 15 ml per equivalent liter of culture). Mix by stirring, either on a stir plate or with a pipette.\n12. Distribute the solution between 30-ml screw-top centrifuge tubes, filling each tube at least 3/4 full. Balance the tubes, and centrifuge for 30 min at 38,000 × g, 4°C.\n13. Transfer the supernatant to a 250-ml glass bottle. Add the following and mix well:\n         \n8 ml glycerol (∼10% final concentration)\n0.4 ml of 2 M imidazole, pH 8 (∼10 mM final concentration)\n30 µl of β-mercaptoethanol (∼5 mM final concentration)\n14. Use a gravity flow column to equilibrate the Ni-NTA agarose slurry with Taq lysis buffer. To do this, thoroughly resuspend the Ni-NTA agarose slurry by repeatedly inverting the bottle. Pipette 8 ml of Ni-NTA agarose slurry (4 ml bed volume) into a gravity flow column in a clamp on a support stand. Uncap the bottom of the column, and wash with 40 ml of water, then 40 ml of Taq lysis buffer.\nThis may be done by gravity flow, or alternatively, a vacuum may be applied to the bottom of the column to cause liquid to flow through more quickly.",
    "15. Cap the bottom of the column. Using 10 ml of the lysate, resuspend the Ni-NTA agarose and transfer from the column to the glass bottle containing the rest of the lysate. Stir on a magnetic stir plate at 4°C for 1 hr to allow the protein to bind to the Ni-NTA.\n16. Pour the mixture of lysate and Ni-NTA agarose into the column, and allow it to drain either by gravity flow or by applying a vacuum to the bottom of the column.\n17. Wash with 80 ml of Taq buffer W500 and 80 ml of Taq buffer W100, and allow to drain either by gravity flow or by applying a vacuum to the bottom of the column.\n18. Add 2 ml of Taq elution buffer, and collect the flowthrough (void fraction) in a 15-ml conical tube.\n19. Add 4 ml of Taq elution buffer, and collect the flowthrough (elution fraction) in another 15-ml conical tube. Repeat this step four additional times, for a total of 5 elution fractions in different 15-ml conical tubes. Keep the elution fractions on ice.\n20. Cap and invert each of the 15-ml conical tubes several times to mix the contents. Mix 15-µl samples of the void and each of the elution fractions with 5 µl of 4× SDS sample buffer in separate tubes, and heat to 95°C for 5 min. Separate 5 µl of each sample on an SDS-PAGE gel, and visualize by staining with a protein gel stain (see Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-fig-0002]).\nEssential protocols for SDS-PAGE can be found in Current Protocols article Gallagher, 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0020])\nMore details about analysis of proteins by SDS-PAGE can be found in other Current Protocols articles (Gallagher, 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0020]; Sasse & Gallagher, 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0047]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/683539ed-f5da-41a8-ad47-7bf1eed4b7ec/cpz1130-fig-0002-m.jpg</p>\nFigure 2",
    "Purification of Taq polymerase. (A) Coomassie-stained 10% SDS-PAGE gel of initial Ni-NTA purification. P, insoluble pellet after heat denaturation. S, supernatant after heat denaturation. F, Ni-NTA column flowthrough. 0-5, Ni-NTA elution fractions. (B) Coomassie-stained 10% SDS-PAGE gel of flowthrough (F), wash (W), and elution peak fractions from heparin purification step. (C) Chromatogram of HiTrap heparin purification. Black curve, 280 nm absorbance. Blue curve, conductivity. In this example, the initial peak is the column flowthrough, and the peak of Taq elution occurred at 30% SP Buffer B.\n21. Pool the fractions that contain protein. Wash dialysis tubing with water and heparin dialysis buffer. Use a dialysis clip to seal one end of the dialysis tubing, transfer the protein to the dialysis tubing, and seal the other end with a second clip. Transfer the sealed dialysis tubing containing the protein to a beaker with 2 L of heparin dialysis buffer, and incubate with gentle stirring on a magnetic stir plate overnight at 4°C.\nSee Current Protocols article: Zumstein (2001[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0057]) for additional detail on dialysis.\nProtein purification on a heparin column\n22. Connect a 1-ml HiTrap heparin column to an FPLC system, according to the manufacturers’ instructions, and equilibrate with at least 10 column volumes of heparin buffer A.\nWe use a 1-ml HiTrap heparin column, but a larger column may be required if scaling up the protocol.\n23. Remove the protein solution from the dialysis tubing by detaching one of the two dialysis clips and pouring the solution from the open end of the tubing into a 50-ml conical tube. Distribute the solution among 1.7-ml microcentrifuge tubes, and microcentrifuge 5 min at 16,000 × g, 4°C. Transfer the supernatant to a new tube, being careful not to transfer any pelleted material.",
    "24. Load the centrifuged protein onto the heparin column according to the manual for your FPLC system.\n25. Elute with a 0%-100% gradient of heparin buffer B, according to the manual for your FPLC system (see Fig. 2C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-fig-0002]).\n26. Based on the 280 nm absorbance readout from your FPLC system, determine which fractions have the highest total protein concentration. Analyze samples of these fractions by SDS-PAGE (see Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-fig-0002]).\n27. Based on the SDS-PAGE gel, pool the fractions that contain the highest concentration of pure Taq DNA polymerase, i.e., those that exhibit a strong band at the correct molecular weight (∼94 kDa) with minimal contaminant bands of other molecular weights. Proceed as described below, depending on the type of Taq you are preparing:\n         \nIf preparing non-hot-start Taq, dialyze overnight against Taq storage buffer (at least 100 sample volumes). The next day, transfer dialysis tubing to a second beaker of Taq storage buffer, and dialyze for an additional 2-3 hr. Store aliquots at −80°C for long-term storage or −20°C for short-term use. Measure the absorbance of the protein at 280 nm with a spectrophotometer, using the dialysis buffer in the beaker as a blank. Use the Beer-Lambert law, C = A/(xε), to determine the molar protein concentration, where C is the concentration, A is the absorbance, ε is the extinction coefficient (112760 M-1cm-1 for Taq DNA polymerase), and x is the pathlength of your spectrophotometer (in cm). Convert mol/L into g/L by multiplying by the molecular weight, 93910 g/mol.\nIf preparing hot-start Taq, dialyze overnight against Taq crosslinking buffer (at least 100 sample volumes). The next day, transfer tubing to a second beaker of Taq crosslinking buffer, and dialyze for an additional 2-3 hr.",
    "It is critical in the crosslinking step to use a buffer that does not contain primary amines (i.e., HEPES, not Tris). Proceed to step 28.\nPreparing hot-start Taq polymerase by formaldehyde crosslinking\nProtocol adapted from Buratowski (2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0008]).\n28. Transfer the dialysate from step 27b to a 50-ml conical tube, add 16% formaldehyde to a final concentration of 0.45%, and mix well.\n29. Incubate for 45 min at 37°C.\n30. Add 75 µl of 2 M Tris·HCl, pH 8, per ml of dialysate, mix well, and incubate for 2 min at room temperature to quench the crosslinking reaction.\n31. Dialyze three times (first dialysis for 30 min, then for 60 min, and finally for 90 min) against Taq post-crosslinking dialysis buffer (at least 100 sample volumes for each dialysis).\n32. Dialyze overnight against Taq storage buffer (at least 100 sample volumes).\n33. The next day, dialyze 2-3 hr against at least 100 sample volumes of Taq storage buffer. Determine the protein concentration as described in step 27a above. Store aliquots at −80°C for long-term storage or −20°C for short-term use.\nPurification of M-MLV reverse transcriptase\nProtein expression\n34. Grow four 1-liter cultures of E. coli expressing M-MLV reverse transcriptase, following steps 1-6 of the Taq polymerase purification protocol (substitute plasmid pET-28a_6H-MMLV_RT_D524N-6H for the Taq plasmid used in step 11). Induce M-MLV RT cultures with 1 mM IPTG for 3 hr, rather than 2 hr, at 37°C.\nProtein purification using Ni-NTA\n35. Resuspend pellets in 20 ml of M-MLV RT lysis buffer per liter of culture (80 ml total for 4 L of culture).\n36. Add lysozyme to a final concentration of 1 mg/ml, and incubate on a rotator at 4°C for 30 min.\n37. Transfer to a metal beaker on ice and lyse cells by sonication.",
    "We use a 1-cm-diameter tip on setting 7 of a Branson Sonifier 450, 5 cycles of 30 s on, 30 s off. Place the sonicator tip approximately 5 mm from the bottom of the beaker. Adjust the vertical position of the sonicator tip after 2-3 rounds of sonication to compensate for downward motion of the beaker due to melting of the ice.\n38. Add 9.6 ml of 5 M NaCl and 40 ml of M-MLV lysis buffer.\n39. Distribute between 30-ml screw-cap tubes, filling each at least 3/4 full, and centrifuge 30 min at 37,000 × g, 4°C.\n40. Wash 4 ml bed volume of Ni-NTA agarose (8 ml slurry volume) with 40 ml each of water and M-MLV RT lysis buffer.\n41. Mix supernatant with Ni-NTA agarose in a beaker, and stir on a stir plate for 1 hr at 4°C.\n42. Pour slurry into a gravity column and allow the liquid to drain.\n43. Wash with 40 ml of M-MLV RT buffer W500 followed by 40 ml of M-MLV RT lysis buffer.\n44. Elute with M-MLV RT elution buffer. Collect one 2-ml void fraction followed by five 4-ml elution fractions in 15-ml conical tubes.\n45. Mix 15-µl samples of the void and elution fractions with 5 µl of 4× SDS sample buffer in separate tubes, and heat to 95°C for 5 min. Separate 5 µl samples of each elution fraction mix on an SDS-PAGE gel (see Current Protocols article: Gallagher, 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0020]) and stain using a protein gel stain (see Current Protocols article: Sasse & Gallagher, 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0047]) (Fig. 3A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-fig-0003]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/c2b555e0-95ae-4e62-b47b-42e75e2af014/cpz1130-fig-0003-m.jpg</p>\nFigure 3",
    "Purification of M-MLV reverse transcriptase. (A) Coomassie-stained 10% SDS-PAGE gel of Ni-NTA purification. F, Ni-NTA flowthrough. 0-5, Ni-NTA elution fractions. D, soluble dialysate after overnight dialysis. P, precipitate after overnight dialysis. (B) Coomassie-stained 10% SDS-PAGE gel of the indicated microgram quantities of purified M-MLV protein after HiTrap SP purification and dialysis against M-MLV RT storage buffer. (C) Chromatogram of purification on a 5-ml HiTrap SP column. Black curve, 280 nm absorbance. Blue curve, conductivity. In this example, the initial tall peak is the column flowthrough, and M-MLV reverse transcriptase elution occurred at 15% SP Buffer B.\n46. Pool peak fractions, and dialyze them overnight against at least 100 volumes of SP buffer A.\nProtein purification on a HiTrap SP column\n47. Connect a HiTrap SP column to an FPLC system, according to the manufacturers’ instructions, and equilibrate with 10 column volumes of SP buffer A.\n48. Microcentrifuge the dialysate from step 46 for 5 min at 16,000 × g, 4°C, and transfer the supernatant to a fresh tube, avoiding any pelleted material.\nWhile we typically observe a pellet after centrifugation, the bulk of the protein remains in the supernatant.\n49. Load the supernatant on the column, wash with 10 column volumes of SP Buffer A, and elute with a 0%-100% gradient of SP Buffer B (balance SP buffer A), according to the manual from the FPLC manufacturer.\n50. Mix 15 µl samples of input, flowthrough, and peak fractions (determined by 280 nm absorbance) with 5 µl of 4× SDS-PAGE sample buffer, heat to 95°C for 5 min, and separate by SDS-PAGE (see Fig. 3B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-fig-0003]).\nSee Current Protocols articles: Gallagher (2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0020]) for SDS-PAGE and Sasse & Gallagher (2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0047]) for staining gels.",
    "51. Pool the peak fractions containing protein (typically ∼5 ml), and dialyze overnight against at least 100 volumes of M-MLV RT storage buffer. The next day, transfer dialysis tubing to a second beaker of M-MLV RT storage buffer, and dialyze for an additional 2-3 hr. Store aliquots at −80°C for long-term storage or −20°C for short-term use.\nSee Current Protocols article: Zumstein (2001[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0057]) for additional detail on dialysis.\n52. Determine the concentration, as described in step 27a, of the Taq polymerase purification protocol, using an extinction coefficient at 280 nm of ε = 79870 M-1cm-1 and a molecular weight of 63700 g/mol for M-MLV reverse transcriptase (Fig. 3C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-fig-0003]).\nPreparation of the BEARmix one-step RT-qPCR master mix\n53. Prepare 4× BEARbuffer by combining the ingredients below in a 15-ml conical tube. Add water to around the 11 ml mark on the tube and invert the tube repeatedly to dissolve all the trehalose. Then, add water to bring the total volume up to the 12.5 ml mark on the tube.\n         \ntable:\n﻿0,1\nComposition,Per 12.5 ml\n\"200 mM Tris·HCl, pH 8.4\",2.5 ml of 1 M stock\n300 mM KCl,1.875 ml of 2 M stock\n12 mM MgCl2,150 µl of 1 M stock\n40% trehalose,5 g\n40 mM DTT,500 µl of 1 M stock\n0.4 mM EDTA,10 µl of 0.5 M stock\n1.6 mM dNTPs,2 ml of 10 mM stock\nDNase/RNase-free water,To 12.5 ml\n54. Using the concentrations determined in the preceding steps (step 27a for non-hot-start Taq DNA polymerase, step 33 for hot-start Taq DNA polymerase, and step 52 for M-MLV reverse transcriptase), prepare a 100× BEAR enzyme solution by mixing the two enzymes with MMLV storage buffer to obtain final concentrations of 1.6 mg/ml for Taq DNA polymerase and 0.17 mg/ml for M-MLV reverse transcriptase.",
    "55. Store 500 µl aliquots of 100× BEAR enzymes at −20°C.\nThe 100× BEAR enzyme mix will not freeze when stored at −20°C, due to the presence of 50% glycerol in M-MLV storage buffer.",
    "RNA purification is an expensive and time-consuming step in SARS-CoV-2 diagnostic testing. While direct addition of clinical samples to RT-qPCR reactions, also known as “direct RT-qPCR,” provides a simple alternative (Bruce et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0007]; Esbin et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0015]; Graham et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0023]; Hasan et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0024]; Smyrlaki et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0049]), the composition of standard commercial swab collection buffers such as UTM and V-C-M is not optimized for compatibility with direct RT-qPCR (Graham et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0023]). Here, we describe a simple alternative collection solution for the subsequent detection of SARS-CoV-2 RNA from nasopharyngeal swab samples, which does not inhibit RT-qPCR when added at volumes of up to 6.65 µl per 10 µl reaction. Additionally, this method is compatible with heat-inactivation of SARS-CoV-2 in sealed tubes, to protect testing center personnel (Graham et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0023]).\nIMPORTANT NOTE: Samples should be collected by qualified medical personnel in compliance with all applicable biosafety and other regulations. In our previous work, we have tested direct RT-qPCR of patient swab samples in UTM and evaluated our proteinase K collection solution using “contrived” swab samples comprising cultured SARS-CoV-2 and human nasal mucus (Graham et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0023]). However, collection of patient swab samples into PK solution has not yet been evaluated clinically.\nMaterials\n200 µg/ml proteinase K (PK) (Millipore, 70663-5)\nThe solution can be stored at −20°C or 4°C, and is also stable at room temperature for at least 2 weeks (Graham et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0023]). We have found that solutions of Millipore proteinase K are stable and active when the lyophilized powder is reconstituted in distilled water. Other manufacturers (e.g., Worthington Biochemical Corporation) recommend that lyophilized PK be reconstituted in other solutions such as 50 mM Tris·HCl, pH 8.0, with 1 mM CaCl2.\nNasopharyngeal collection swabs (e.g., Typenex Medical, SW0102)",
    "A method for 3D printing of swabs has also been described (Ford et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0017]).\nSwab collection tubes (e.g., Typenex Medical, TC0201)\nIncubator set at 37°C\nIncubator set at 75°C\n1. Collect patient NP swab samples and deposit directly into 2 ml of 200 µg/ml PK in screw-cap swab-collection tubes.\nFor safety, tubes may be sealed and the outside of each tube disinfected with 70% ethanol. While we have not assessed the long-term stability of viral RNA for real patient swab samples in PK solution, we have found that SARS-CoV-2 genomic RNA was stable for at least 3 days at room temperature in “contrived” swab samples consisting of a mixture of cultured virus and human nasal fluid diluted in PK solution (Graham et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0023]).\n2. Incubate samples at 37°C for 30 min.\n3. Incubate samples at 75°C for 30 min to inactivate both virus and proteinase K. Samples can now be used in RT-qPCR.\nIncubation at 75°C for 30 min was found to inactivate cultured SARS-CoV-2 (Graham et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0023]).\nHeat-inactivated samples may be added directly to an RT-qPCR mix (up to 6.75 µl per 10 µl reaction; see Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-prot-0004]). Alternatively, samples collected in commonly used commercial collection solutions, such as UTM or V-C-M, may be directly added to RT-qPCR reactions to a maximum of ∼5%-10% of the total reaction volume. However, we have found that addition of larger quantities of UTM or V-C-M inhibits RT-qPCR using either BEARmix or TaqPath One-Step Master Mix (Thermo Fisher).",
    "If patient samples were not collected in a buffer compatible with direct RT-qPCR analysis (such as that described in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-prot-0002]), Alternate Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-prot-0003] can be used instead to prepare RNA samples for subsequent analysis.\nDenaturing swab collection solutions such as DNA/RNA Shield (Zymo Research) inactivate SARS-CoV-2 and preserve RNA integrity, but also strongly inhibit RT-qPCR. Non-denaturing swab collection solutions such as UTM and V-C-M may be added to RT-qPCRs in small quantities (5%-10% of the total reaction volume), but these solutions inhibit RT-qPCR when added in larger quantities. This creates a problem because achieving maximal detection sensitivity requires adding as much RNA as possible per reaction. The isopropanol precipitation procedure described below provides a simple and inexpensive means of isolating and concentrating RNA from swab samples, which can then be used for RT-qPCR. One pitfall of this method is that it concentrates the RNA into a pellet, which may be lost during the aspiration step. Thus, it is essential to include a recovery control (e.g., human RNase P RNA or exogenously added bacteriophage MS2 genomic RNA) to verify successful RNA recovery in each sample.\nIMPORTANT NOTE: Samples should be collected by qualified medical personnel in compliance with all applicable biosafety and other regulations.\nMaterials\nProteinase K solution (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-prot-0002] materials list)\n2× DNA/RNA Shield (Zymo Research #R1200) or DNA/RNA Shield Collection Tube with Swab (Zymo Research #R1107-E)\n3 M sodium acetate solution, pH 5.2 (see recipe)\nLinear polyacrylamide (Invitrogen, AM9520)\n               \nAlternatively, linear polyacrylamide can be synthesized in the laboratory by polymerizing monomeric acrylamide (Gaillard & Strauss, 1990[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0019]).\n100% isopropanol (room temperature)\n75% ethanol (room temperature)\nDNase/RNase-free water\n1.7-ml microcentrifuge tubes\nFilter pipette tips\nGel loading tips (e.g., Flat Gel Loading Tip, Micro, 0.3 mm flat 83 × 0.33 mm, Denville #P3082)\nMicrocentrifuge set to 4°C",
    "Thermomixer, incubator, heat block, or water bath set to 30°C\n1. Collect swab samples in either of the following ways:\n         \nFollow steps 1-3 of Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-prot-0002] to collect a swab sample into 2 ml of proteinase K solution.\nCollect a swab sample in 2 ml of 1× DNA/RNA Shield (Zymo Research), which inactivates SARS-CoV-2 while preserving RNA.\n2. Transfer 400 µl of inactivated swab sample liquid to a 1.7-ml microcentrifuge tube, and add 40 µl of 3 M sodium acetate (pH 5.2) and 1 µl of 5 mg/ml linear acrylamide carrier. Mix well by pipetting up and down five times.\nTo concentrate the RNA further than described here, start with a larger initial volume of inactivated swab sample and rescale the quantities of isopropanol and sodium acetate accordingly.\n3. Add 440 µl of isopropanol. Mix well by inverting the tubes five times.\n4. Incubate at −20°C for 30 min.\nIncubation at −80°C for the same amount of time may further improve recovery.\n5. Microcentrifuge 15 min at 16,000 × g, 4°C.\n6. Carefully aspirate the supernatant, being careful not to disturb the pellet on the bottom of the tube (see Fig. 1C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-fig-0001]).\nThe pellet may or may not be clearly visible at this stage. The use of fine gel-loading tips helps to avoid aspirating the pellet; it may also help to hold the tubes in front of a light (Fig. 1C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-fig-0001]). Hold the aspiration tip slightly above the bottom of the tube, on the side of the tube that was oriented toward the axis of the centrifuge rotor. Be sure to use a fresh tip for each sample to avoid cross-contamination.\n7. Add 1 ml of 75% ethanol to each tube.\n8. Microcentrifuge for 5 min at 16,000 × g, room temperature, and carefully aspirate the pellet again.",
    "It helps to aspirate all but ∼10-20 µl, briefly centrifuge the samples again, and then thoroughly aspirate the remaining supernatant.\n9. Add 50 µl of RNase-free water directly to each pellet.\nTo achieve a higher concentration of RNA, resuspend in a smaller volume of water.\n10. Heat the sample at 30°C for 10 min to redissolve RNA.\nIf using a thermomixer, shaking the samples may help to dissolve the RNA.",
    "Below we describe how to set up RT-qPCR reactions using the Basic Economical Amplification Reaction mix (BEARmix) described in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-prot-0001]. RT-qPCR reactions may be set up in 96- or 384-well plates by adding either purified RNA or other RNA-containing samples (e.g., inactivated swab samples from Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-prot-0002] or Alternate Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-prot-0003]) to a mixture of buffer, dNTPs, enzymes, and primers. Real-time amplification is detected by including either an intercalating dye or hydrolysis probe in the reaction mixture. It is most efficient to array samples in multiwell plates and transfer them to a master mix plate using either a multichannel pipette or a pipetting robot. Reactions must be prepared on ice if using non-hot-start Taq polymerase, but may be prepared at room temperature if using hot-start Taq polymerase.\nWhile we developed this master mix to quantify SARS-CoV-2 RNA, it can be used to quantify other RNAs as well, either for clinical diagnostics or basic research. The same mix without reverse transcriptase can be used as a qPCR master mix for DNA quantification. Whatever the application, it is important to validate the performance of your laboratory-made master mix by analyzing nucleic acid standards of known concentration (see Support Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-prot-0005]).\nMaterials\nGene-specific PCR primers\nFor hydrolysis probe-based reactions only: TaqMan probe [here we use a primer and probe pre-mix in the 2019-nCoV EUA Kit from Integrated DNA Technologies (cat no. 10006770)]\n               \nWe have tested BEARmix using the CDC-recommended SARS-CoV-2 N1 and N2 primer/probe sets and the human RNase P control primer/probe set, which can be obtained pre-mixed in the 2019-nCoV EUA Kit from Integrated DNA Technologies (cat no. 10006770).\nFor intercalating dye-based reactions only: SYTOX Orange (Thermo Fisher, cat. no. S11368), SYBR Green (Thermo Fisher, cat. no. S7563), or comparable dsDNA-binding fluorescent dye, 100 µM solution in DMSO\nNuclease-free water",
    "4× BEARbuffer (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-prot-0001])\n100× BEAR enzymes (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-prot-0001])\nIn vitro-transcribed RNA (see Support Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-prot-0005])\n96-well or 384-well qPCR plates (Thermo Scientific, AB-0800/W and AB-3384)\nIce bucket\n96-well or 384-well metal block (Universal Medical, cat no. 81001)\nMultichannel (8-channel or 12-channel) 10-μl or 20-μl pipette\nReal-time thermocycler\n               \nWe have tested this protocol on BioRad CFX 96 and CFX 384 instruments.\n1. Prepare solutions of primers and fluorogenic reagent:\n         \nFor hydrolysis probe-based reactions, prepare or obtain a primer/probe mixture containing forward and reverse gene-specific PCR primers at 6.7 μM each and TaqMan probe at 1.7 μM in nuclease-free water.\nFor intercalating dye-based reactions, dilute SYTOX Orange to a working stock of 100 μM in dimethylsulfoxide (DMSO). In addition, prepare a mixture of forward and reverse PCR primers at a concentration of 6.7 μM each in nuclease-free water.\n2. Prepare master mix:\n         \nFor hydrolysis probe-based reactions, mix the following on ice in the order listed, rescaling the volumes as needed for the desired total number of reactions. “X” represents the sample volume, which may be up to 6.65 µl. We typically use 6.65 µl of sample volume.\n                  \ntable:\n﻿0,1,2\n,Per reaction,110-reaction master mix (for a full 96-well plate)\nWater,(6.65 − X) μl,110 * (6.65 − X) μl\n4× BEARbuffer,2.5 μl,275 μl\n100× BEAR enzymes,0.1 μl,11 μl\nPrimer/probe mixture,0.75 μl,82.5 μl\nFor intercalating dye-based reactions, mix the following on ice in the order listed, rescaling the volumes as needed for the desired total number of reactions. Mix thoroughly by pipetting or vortexing after addition of SYTOX Orange, to avoid exposing the enzymes to a high concentration of DMSO at the bottom of the tube. “X” represents the sample volume, which may be up to 6.55 µl.\n                  \ntable:\n﻿0,1,2\n,Per reaction,110-reaction master mix (for a full 96-well plate)",
    "Water,(6.55 − X) μl,110 * (6.55 − X) μl\n4× BEARbuffer,2.5 μl,275 μl\n100 µM SYTOX Orange,0.1 μl,11 μl\n100× BEAR enzymes,0.1 μl,11 μl\nPrimer mixture,0.75 μl,82.5 μl\nIMPORTANT NOTE: Prepare the master mix immediately before use, and keep it on ice. Do not subject the master mix to freeze-thaw cycles after adding BEAR enzymes.\n3. Aliquot master mix for the desired number of reactions (samples + controls) into multiwell qPCR plates placed in a metal cooling block on ice.\n4. Distribute samples and controls into a new multiwell plate, and then transfer them to the reaction plate using a multichannel pipette. For each RT-qPCR plate, include a positive control reaction with in vitro−transcribed RNA (see Support Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-prot-0005]) and a negative control reaction with water only.\nIt is also a good idea to include positive and negative RNA extraction controls in which no-RNA and positive control RNA samples are processed in the extraction step.\n5. Optional: To quantify the absolute number of RNA molecules per sample, include a 10-fold dilution series of known concentrations of an in vitro−transcribed standard (see Support Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-prot-0005]).\nFor accurate quantification, the Cq values of this dilution series should span a range that encompasses the Cq values of the unknown samples. While Cq values will likely vary between different preparations of master mix and different thermocyclers, representative results are shown in Figure 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-fig-0004], where a range of template concentrations between 103 and 106 molecules gave Cq values between 35 and 23 cycles.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/e934f490-1d18-4260-8922-ebfd8a60b7a1/cpz1130-fig-0004-m.jpg</p>\nFigure 4",
    "Sample BEARmix RT-qPCR reactions of in vitro−transcribed SARS-CoV-2 N gene RNA. A series of dilutions was prepared and subjected to isopropanol precipitation following Alternate Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-prot-0003]. Isopropanol-precipitated samples (red) and non-precipitated standards (blue) were analyzed by RT-qPCR. (A) Top panel: Fluorescence traces from individual TaqMan RT-qPCR reactions using the CDC SARS-CoV-2 N2 primer/probe set. Results were consistent between technical duplicates, and precipitated samples gave comparable traces to non-precipitated samples, indicating essentially complete RNA recovery. Bottom panel: Second derivative of the curves in the top panel. Cq values (indicated by vertical lines) were determined by fitting the peak of the second derivative to a parabola. The PCR cycle number is shown on the x-axis. (B) Plots of Cq value (number of cycles, y-axis) vs. base-10 logarithm of RNA molecule number (x-axis) with best-fit lines by linear regression in MATLAB. Left panel: TaqMan fluorescence readout (same reactions as in (A). Right panel: SYTOX Orange dsDNA dye-based readout using the N2 primer set. Each data point is the mean of two technical duplicates. Control experiments (not shown) confirmed that there is negligible fluorescence bleed-through from TaqMan FAM signal into the HEX channel used to detect SYTOX Orange.\n6. Run the following cycling program in a qPCR instrument:\n         \n50°C for 10 min.\n95°C for 5 min.\nExtend this incubation to 20 min when using hot-start Taq polymerase.\n95°C for 3 s.\n55°C for 30 s; read plate fluorescence in appropriate fluorescence channel(s).\nRepeat steps (iii) and (iv) 44 additional times.",
    "When using non-hot-start Taq polymerase, it is best to transfer the reactions directly from ice to a PCR block pre-heated to 50°C, without allowing them to sit at room temperature. On BioRad CFX96 and CFX384 qPCR instruments, close the lid and start the PCR cycle without the reaction plate. When the block temperature reaches 50°C, open the lid (which will automatically pause the program), insert the plate, and close the lid to resume the program.\nThe appropriate channels to use for measuring fluorescence will depend on the instrument and intercalating dye or hydrolysis probe(s) used. Fluorescence from SYTOX Orange can be measured in the HEX (hexachlorofluorescein) channel on BioRad instruments.\n7. Determine Cq values using one of two methods:\n         \nThreshold-based (Ct): Using the software for your qPCR thermocycler, determine at which cycle the fluorescence intensity crosses a user-specified threshold. Using positive and negative controls as benchmarks, choose a threshold that clearly distinguishes amplification from non-amplification.\nSecond derivative-based: Determine the cycle at which the second derivative of fluorescence with respect to cycle number is maximal (Rasmussen, 2001[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0046]). Local fitting to a parabola may be used to define the peak position with sub-cycle precision. Some qPCR thermocycler software packages include a built-in second-derivative Cq option, or the data may be exported (without baseline subtraction) and analyzed using custom code. Sample code for second-derivative analysis can be found at https://gitlab.com/tjian-darzacq-lab/second-derivative-cq-analysis[href=https://gitlab.com/tjian-darzacq-lab/second-derivative-cq-analysis].\n8. For clinical diagnosis, first analyze numerous known-positive and known-negative clinical specimens by RT-qPCR, and choose a Cq value that reliably separates positive from negative samples (IGI Testing Consortium, 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0030]). Score unknown samples as positive if their Cq value falls below this threshold and negative if their Cq value falls above this threshold.",
    "9. Optional: To quantify the absolute number of RNA molecules per sample, plot the Cq values of the standard curve (see step 5) against the logarithm of the number of input RNA molecules (see Fig. 4B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-fig-0004]), and use a best-fit line to determine the number of RNA molecules in unknown samples.",
    "This protocol describes how to prepare a stock of in vitro−transcribed (IVT) RNA of a known concentration to serve as a standard for determining the absolute number of RNA molecules in a sample by RT-qPCR. IVT RNA is also invaluable for troubleshooting primer design and master mix performance. Due to the high concentrations of RNA produced by in vitro transcription, it is critical to avoid contaminating RT-qPCR reagents with IVT RNA, for instance, through dispersal by aerosols. Aerosol-free filter tips should be used when pipetting all reagents. Ideally, preparation of IVT RNA should occur in a separate area of the laboratory from where other RT-qPCR reagents are prepared, and a different set of pipettes should be used. One solution is to set up RT-qPCR reactions and aliquot RT-qPCR reagents in a dedicated qPCR setup hood or tissue culture hood.\nMaterials\nSample to use as a template for PCR (e.g., 2019-nCoV_N_Positive Control, Integrated DNA Technologies, 10006625)\nPCR primers flanking the amplicon(s) of interest (see step 1)\nPCR master mix [e.g., BEARmix (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-prot-0001]) or NEB 2× Q5 Master Mix]\nAgarose gel with ethidium bromide or other fluorescent DNA dye (see Current Protocols article: Voytas, 2000[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0052])\nGel extraction kit (e.g., Zymoclean Gel DNA Recovery Kit; Zymo Research, D4007)\nHiScribe T7 Quick Kit (NEB)\n               \nT7 RNA polymerase from other suppliers may be used, following the manufacturer's instructions, or T7 RNA polymerase may be purified according to published protocols (e.g., He et al., 1997[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0025]). Also see\nhttp://archive.today/QOVhS[href=http://archive.today/QOVhS].\nRNA purification kit, such as Qiagen RNeasy Mini kit (cat. no. 74104) or TRIzol RNA purification kit (Invitrogen, 12183555)\nNuclease-free water\nRazor blades\nUV-vis spectrophotometer (e.g., Nanodrop)\nUV transilluminator or other gel illuminator",
    "Additional reagents and equipment for BEARmix single-step reaction (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-prot-0001]), agarose gel electrophoresis (see Current Protocols article: Voytas, 2000[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0052]), and RNA purification (see Current Protocols article: Dowhan, 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0013])\n1. Design forward and reverse primers flanking the amplicon(s) of interest. At the 5′ end of the forward primer, include the T7 promoter sequence 5′-TAATACGACTCACTATAGGG-3′. For instance, for the SARS-CoV-2 N gene, we amplified the entire 1260-bp open reading frame using the following primers:\n         \ntable:\n﻿0,1,2\na.,SARS-CoV-2_N_forward,5′ TAATACGACTCACTATAGGGttaggcctgagttgagtcagc 3′\nb.,SARS-CoV-2_N_reverse,5′ ttaggcctgagttgagtcagc 3′\n2. Amplify the target from RNA or cDNA/DNA in a 50-μl PCR using either a BEARmix single-step reaction (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-prot-0001]) or a commercial PCR master mix, respectively.\nIf using BEARmix, include a 68°C extension step of 1 min per kb of the desired product. M-MLV RT may be omitted from the BEARmix reaction if cDNA or a cDNA clone is used as a template.\n3. Separate the PCR product on an agarose gel (see Current Protocols article: Voytas, 2000[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0052]), and excise the full-length product band using a razor blade.\n4. Extract DNA from the product band using a gel extraction kit.\n5. Determine the concentration of the PCR product by measuring absorbance at 260 nm using a spectrophotometer.\nTypical concentrations are on the order of 10 ng/μl.\n6. Set up a 20-μl in vitro transcription reaction using the HiScribe T7 Quick Kit (NEB) by mixing:\n         \n10 μl HiScribe T7 NTP buffer mix.\n8 μl template DNA (typically at ∼10 ng/µl).\n2 μl HiScribe T7 RNA polymerase mix.\nThe manufacturer recommends a maximum of 1 μg of DNA per 20 μl reaction, but purified PCR products are seldom this concentrated, in our experience.\n7. Incubate the reaction overnight at 37°C.\n8. Purify RNA using the RNA purification kit of your choice.",
    "We typically use the TRIzol RNA purification kit, but a spin column kit, or phenol-chloroform precipitation and isopropanol precipitation, could also be used (see Current Protocols article: Dowhan, 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0013]).\n9. Determine the concentration of purified RNA on a spectrophotometer by measuring absorption at 260 nm and using the formula C = A/(εx), where A is the absorbance, ε = 0.025 (ng/μl)-1cm-1 is the extinction coefficient of ssRNA, and x is the pathlength of the spectrophotometer.\nAlternatively, use the “single-stranded RNA” setting within the Nanodrop spectrophotometer software to calculate the RNA concentration.\n10. Convert the concentration in ng/μl to molecules/μl.\nMultiply the number of nucleotides by 330 g/mol/nucleotide (3.3 × 1011 ng/mol/nucleotide) to get the molecular weight of the ssRNA product. Divide the concentration in ng/μl by the molecular weight, and multiply by Avogadro's number (6.022 × 1023 molecules/mol) to get the concentration in molecules/μl.\n11. Dilute the RNA in nuclease-free water to the nearest whole-number power of 10, and then prepare a series of further 10-fold serial dilutions in water down to a working stock concentration of 106 molecules/μl. For instance, if the starting concentration is 1.4 × 1012 molecules/µl, prepare an initial dilution to 1012 molecules/µl, and then prepare further serial dilutions, of 1011 molecules/µl, 1010 molecules/µl, etc., down to 106 molecules/µl. Store the original RNA stock, intermediate dilutions, and working stock aliquots at −80°C.",
    "The protocol below provides an alternative to Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-prot-0004] for detection of RT-PCR amplification, and involves the use of a conventional thermocycler and a fluorescent gel imager in place of a real-time qPCR thermocycler. Real-time qPCR thermocyclers are expensive instruments that are not universally available. Conventional thermocyclers are cheaper and more ubiquitous and, importantly, they make it possible to distinguish the presence or absence of SARS-CoV-2 RNA by imaging PCR plates or tube strips at the end of the PCR run using a standard fluorescence gel imager. Such an endpoint assay makes it possible to score positive and negative samples without an expensive real-time PCR instrument.\nThe detection threshold may be adjusted in this protocol by varying the number of PCR cycles. While increasing the total cycle number may permit detection of smaller amounts of RNA, this can also increase the background fluorescence of negative samples. An optimal cycle number may be chosen by performing a series of reactions for a set of known-negative and known-positive samples for a different numbers of cycles, to determine at which cycle number the fluorescence of known-positives and known-negatives is most distinct. To test the reliability of scoring positive and negative samples by eye, the evaluator should be blinded to the identity of positive and negative samples.\nAdditional Materials (also see Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-prot-0004])\nPCR tube strips or 96- or 384-well plates.\nPCR thermocycler\nFluorescence gel imager: a commercial gel imager (e.g., BioRad Chemidoc) or a home-built fluorescence imaging system (Nuñez et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-bib-0040]).\nOptional: ImageJ (https://imagej.net/Fiji[href=https://imagej.net/Fiji]) or similar software for quantifying intensity of regions of interest within images",
    "1. Set up reactions according to Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-prot-0004], steps 1 to 4, then proceed to Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-prot-0004], step 6, and run the PCR reaction using a regular thermocycler instead of a real-time qPCR thermocycler.\n2. Image the RT-PCR plates or tubes on an imager in the appropriate fluorescence channel(s).\nAdjust the exposure settings so that the fluorescence intensity inside the positive control wells is not saturated and positive and negative controls are clearly distinguishable. The outlines of the wells may be saturated if the plastic is autofluorescent, but this is not a problem as long as the fluorescence inside the positive and negative control wells is clearly distinguishable. Some background fluorescence will likely be observed due to nonspecific TaqMan probe degradation by BEARmix, but this can be distinguished from true amplification based on comparison with negative and positive controls (Fig. 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-fig-0005]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/108da69b-133c-4adf-9be4-87e416ac0dc2/cpz1130-fig-0005-m.jpg</p>\nFigure 5",
    "Quantification by endpoint detection of SARS-CoV-2 N gene RNA. The qPCR plate used for the TaqMan reactions in Figure 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.130#cpz1130-fig-0004] was imaged in the fluorescein channel on a BioRad Chemidoc imager with an exposure time of 75 ms (left panel) or 50 ms (right panel), and in the white light channel with an exposure time of 25 ms. Shown is an overlay of the fluorescein channel in green and the white light channel in magenta for one replicate set, such that white pixels indicate saturation of both channels. Contrast is enhanced in the left panel to display more clearly the fluorescence of the well contents, causing the outline of the plate to be saturated (white). A lower-contrast overlay is shown on the right panel. The outlines of the wells appear as green circles due to autofluorescence of the plastic. The number of RNA molecules per reaction is indicated above each column. Reactions containing RNA are clearly distinguishable from control reactions without RNA.\n3. Score positive and negative samples by eye. Alternatively, to quantify the fluorescence intensity within each well, use the “ROI Manager” function in ImageJ to draw identically sized circular regions of interest and calculate their integrated intensity.\nWhile exact quantification of ROIs is more cumbersome, it may allow for less subjective scoring of positives and negatives."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}