{
  "id": 4232,
  "origin_website": "Cell",
  "title": "A time-resolved fluorescence resonance energy transfer screening assay for discovery of protein-protein interaction modulators",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nProtein expression and cell lysate stock preparation\nTiming: 4 days\nThis major step describes the specific protocol to prepare cell lysate from HEK293T cells co-overexpressing Flag-SMAD3 and His-SMAD4 WT or R631H. We have also used this protocol for overexpressing proteins with various tag configurations in HEK293T cells or other protein expression systems (Du et al., 2013[href=https://www.wicell.org#bib7]; Mo et al., 2019[href=https://www.wicell.org#bib23]; Xiong et al., 2018[href=https://www.wicell.org#bib31]).\nSeeding HEK293T cells – Day 1\nBefore seeding cells, check cells visually and under microscope to make sure the cells are healthy indicated by observing 1) pinky orange culture media, 2) majority of cells are attached to the bottom of the flask, 3) cells are in plump or elongated shape, and 4) reached 70%–80% confluency in monolayer.\nPre-warm cell culture medium, PBS and trypsin to 37°C in water bath.\nCarefully remove media from one 175 cm2 flask of the required cells into a waste pot (containing laboratory disinfectant), taking care not to increase contamination risk with any drips.\nWash the cells twice with PBS.\nAdd 3 mL trypsin, incubate in CO2 incubator at 37°C until cells are rounded up and detached from the bottom.\nAdd 10 mL cell culture medium to cease trypsinization.\nDetach and resuspend cells by pipetting the medium with cells up and down against the flask bottom.\nCount viable cell numbers using TC20TM Automated Cell Counter by following manufacturer’s protocols (https://www.bio-rad.com/webroot/web/pdf/lsr/literature/10024423.pdf[href=https://www.bio-rad.com/webroot/web/pdf/lsr/literature/10024423.pdf]).\nNote: We recommend using cells with ≥90% viability.\nAlternatives: Viable cell number can be counted automatically using other automated cell counters or manually using a hemocytometer under a microscope.\nPrepare cell suspensions at concentration 0.3–0.5 × 106 cells/mL by diluting cells in culture medium.\nPlate 2 mL cell suspension per well in 6-well plate and incubate in CO2 incubator at 37°C for 24 h.",
    "Note: We recommend testing the optimal plating density within the recommended range for the cells to reach 70%–80% confluency on the second day for transfection, and to reach >80% transfection efficiency using GFP plasmid as control (Jäger et al., 2013[href=https://www.wicell.org#bib17]). Troubleshooting 1[href=https://www.wicell.org#sec6.1]\nAlternatives: Other cell culture plates or dish formats could also be used with cell numbers adjusted proportionally.\nPlasmid transfection – Day 2\nThaw PEI stock solution (1 mg/mL) at 25°C and mix by gently inverting tubes before use.\nNote: Properly prepared PEI solution should be clear. We do not recommend using PEI solutions that are cloudy or with precipitation.\nCritical: To develop a robust TR-FRET assay for HTS, we recommend testing the combinations of various epitope-tagged constructs with corresponding TR-FRET fluorophore pairs (Table 1[href=https://www.wicell.org#tbl1]) (Blagg and Workman, 2017[href=https://www.wicell.org#bib1]).\nAlternatives: We used PEI as a cost-effective transfection reagent for large-scale HTS application and it produces very high transfection efficiencies (>70%) in HEK293T cells (Schirrmann and Büssow, 2010[href=https://www.wicell.org#bib34]). Other plasmid transfection reagents, such as FuGene® HD, can also be used by following manufacturer’s protocol (https://www.promega.com/products/luciferase-assays/transfection-reagents/fugene-hd-transfection-reagent/?catNum=E2311&gclid=Cj0KCQiA3NX_BRDQARIsALA3fIKo0C-VsU8ps6GFihjTxZrYOPgzlevuV0g6XAz_O1hUwSvCl67bVIcaAjGrEALw_wcB#protocols[href=https://www.promega.com/products/luciferase-assays/transfection-reagents/fugene-hd-transfection-reagent/?catNum=E2311&gclid=Cj0KCQiA3NX_BRDQARIsALA3fIKo0C-VsU8ps6GFihjTxZrYOPgzlevuV0g6XAz_O1hUwSvCl67bVIcaAjGrEALw_wcB])\nAdd 100 μL transfection mixture (1.5 μg Flag-SMAD3, 1.5 μg His-SMAD4-R361H or WT, and 9 μg PEI in Opti-MEM) per well and mix well by gently rocking the plate. Incubate plates in CO2 incubator at 37°C for 48 h.\nNote: We recommend gently vortexing the transfection mixture and incubating at 25°C for 15–30 min to allow the formation of stable DNA:PEI complex for efficient transfection. Plasmids expressing fluorescence protein can be used to rapidly estimate the transfection efficiency.\nNote: Depending on the expression of each plasmid when co-expressed, the ratio of plasmids may need to be changed from 1:1 to ensure optimal expression of each encoded protein from the plasmid that gives desired assay performance. Troubleshooting 2[href=https://www.wicell.org#sec6.3].",
    "Critical: Transfection efficiency >80% estimated from fluorescence protein are recommended for the following cell lysate preparation. To ensure the desired transfection efficiency specific to this protocol, we recommend i) removing 500 μL growth medium from each well before adding transfection mixture to increase the DNA:PEI complex working concentration, ii) adding transfection mixture in a dropwise manner, and iii) supplementing 1 mL fresh pre-warmed medium per well 24 h after transfection.\ntable:files/protocols_protocol_989_6.csv\nLysate stock preparation – Day 4\nWash monolayer cell culture with 1× PBS three times, followed by adding trypsin (0.25%, 200 μL) and incubate in CO2 incubator at 37°C for 1 min. Detach transfected HEK293T cells from cell culture plate by adding 1 mL of cell culture medium and pipetting up and down. Transfer cell suspension from each well to a pre-chilled microcentrifuge tube and pellet cells by centrifuge at 200 × g for 5 min. Discard the supernatant and wash cell pellet once with ice-cold PBS.\nAdd 100 μL lysis buffer per sample and vortex vigorously for 5 s to resuspend cell pellet. Lyse cells with rotation for 30 min at 4°C, followed by a centrifuge at 10,000 × g for 10 min at 4°C. Aspirate the supernatant and place in a fresh tube kept on ice. Combine lysates from wells transfected with the same plasmids to reduce variation.\nMeasure the protein concentration using the Bradford assay by following manufacturer’s instructions (https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2FMAN0011181_Coomassie_Bradford_Protein_Asy_UG.pdf&title=VXNlciBHdWlkZTogIENvb21hc3NpZSAoQnJhZGZvcmQpIFByb3RlaW4gQXNzYXkgS2l0[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2FMAN0011181_Coomassie_Bradford_Protein_Asy_UG.pdf&title=VXNlciBHdWlkZTogIENvb21hc3NpZSAoQnJhZGZvcmQpIFByb3RlaW4gQXNzYXkg]).",
    "Note: If using cell lines which adhere well to plate surface, we recommend washing the cells with ice-cold PBS first, then adding lysis buffer directly to the well to detach cells from plates, and transferring them to tube. Cell pellets can be stored at −80°C for short-term or in liquid nitrogen for long-term storage. Both 0.5% Triton X-100 and 1% NP-40 lysis buffer work for cell lines used in this study. Other lysis buffer with different washing stringency could be used.\nAlternatives: For determination of protein concentration, other assays, such as BCA assay, can also be used by following manufacturer’s instructions https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2FMAN0011430_Pierce_BCA_Protein_Asy_UG.pdf&title=VXNlciBHdWlkZTogUGllcmNlIEJDQSBQcm90ZWluIEFzc2F5IEtpdA==[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2FMAN0011430_Pierce_BCA_Protein_Asy_UG.pdf&title=VXNlciBHdWlkZTogUGllcmNlIEJDQSBQcm90ZWluIEFzc2F5IEtpdA==]\nTR-FRET assay development and evaluation\nTiming: 1 day\nThis step describes how cell lysate-based Time-Resolved Fluorescence-Resonance-Energy-Transfer (TR-FRET) assay was designed, evaluated and optimized to monitor protein-protein interactions for high-throughput screening of compounds (Du et al., 2011[href=https://www.wicell.org#bib9]; Fu, 2004[href=https://www.wicell.org#bib10]).\nDose-dependent TR-FRET assay\nPerform serial dilution of cell lysate in the FRET buffer.\nNote: We recommend 2-fold serial dilution directly in a black 384-well plate with final volume of 15 μL/well to reach 8–16 titrations in total. Empty FRET buffer without lysate will be used as background control.\nAdd TR-FRET antibody mixture.\nNote: We recommend adding 15 μL/well antibody mixture containing 2× fluorophore-conjugated antibodies (1:500 diluted anti-FLAG M2-Tb and 1:250 diluted anti-6xHIS-D2 antibodies in FRET buffer). The optimal dilution and ratio of conjugated antibodies may vary based on the expression levels of PPI. Troubleshooting 3[href=https://www.wicell.org#sec6.5].\nCritical: Mix the reaction thoroughly by centrifugation of the plate at 200 × g for 5min.\nMeasure TR-FRET signal using a BMG Labtech PHERAstar FSx reader by following manufacture’s manual.",
    "Note: We recommend incubating the assay plate for 2 h at 4°C before the measurement. Unless necessary to read plate cold, let assay plate come to 25°C before reading so that there is no variation in signal due to temperature changes while reading. We recommend using the HTRF optic module (excitation at 337 nm, emission A at 665 nm, emission B at 620 nm) with following measurement settings: integration start at 50 μs, integration time for 150 μs and 8 flashes per well.\nCritical: We noticed that bubbles in the well may lead to inaccurate readings, and thus recommend eliminating bubbles before the measurement.\nEstimation of an optimal dilution factor of cell lysate\nThe TR-FRET signal is calculated as the ratio of F665 nm/F620 nm × 104, where F665 nm and F620 nm are the fluorescence intensity at 665 and 620 nm, respectively.\nPlot the raw FRET signal against cell lysate concentration as shown in Figure 2[href=https://www.wicell.org#fig2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/989-Fig2.jpg\nFigure 2. Cell lysate dose-dependent TR-FRET curves showing different TR-FRET signals from lysate expressing different pairs of SMAD4-WT/R361H and SMAD3 constructs\nThe TR-FRET signal from cell lysate expressing the plasmid combination indicated in 3&4 exhibit higher S/B and assay window than that in 1&2. The lysate concentration-dependent “bell curve” of 3&4 represents a typical “hook effect” in this antibody-based TR-FRET assay. Selection of optimal lysate concentration should be in the upward-sloping phase, where PPI signal positively correlates with PPI concentration, but not in the downward-sloping phase, where PPI signal negatively correlates with PPI concentration due to the artifact from low antibody occupancy. Data are presented as mean ± SD from triplicate of a representative experiment.",
    "Estimate an optimal dilution factor of cell lysate with desired assay window. The chosen dilution factor should avoid ramifications of the hook effect (Ross et al., 2020[href=https://www.wicell.org#bib26]). The selected dilution factor will be used for assay performance evaluation and primary HTS implementation.\nNote: To maximize the opportunity to reveal inducers that may enhance mutant SMAD4/SMAD3 interaction, we selected the EC90 (90% maximal effective concentration) condition of the SMAD4R361H/SMAD3 interaction, which corresponded to EC10 (10% maximal effective concentration) of the SMAD4WT/SMAD3 PPI.\nCritical: Selection of optimal dilution factor should be in the upward-sloping phase, where PPI signal positively correlates with PPI concentration, but not in the downward-sloping phase, where PPI signal negatively correlates with PPI concentration due to the artifact from low antibody occupancy.\nAssay performance evaluation\nPrepare the working reaction mixture by diluting the cell lysate stock according to the optimal dilution factor identified in step 5 in FRET buffer (containing 1:1000 anti-FLAG M2-Tb and 1:500 anti-6xHIS-D2 antibodies) to the selected concentration.\nNote: We recommend including cell lysate co-expressing SMAD4-WT and SMAD3 PPI as a known biological positive control in parallel for assay development and performance evaluation. Cell lysate expressing empty-vector controls are recommended as a technical negative control.\nAdd 5 μL/well working reaction mixture into 1536-well solid bottom plate.\nNote: Multidrop™ Combi Reagent Dispenser was used to add the working cell lysate, which was also used for the similar steps during the subsequent HTS.\nNote: To cost-effectively scale up the assay for HTS, we recommend miniaturizing the assay by scaling down proportionally the volume from 30 μL in a 384-well plate to 5 μL in a 1536-well plate format. We did not observe any significant changes of the TR-FRET signal between 384- and 1536-well plate format.",
    "Note: We recommend centrifugation of the plate at 200 × g for 5 min and incubation at 4°C for 2 h.\nCritical: To mitigate the evaporation-induced edge effect, we recommend adding the working cell lysate in the center and dispensing FRET buffer in the empty surrounding wells.\nMeasure TR-FRET signal using a BMG Labtech PHERAstar FSx reader by following manufacture’s manual.\nCalculate the Signal-to-Background (S/B) ratio and Z’ for SMAD4-WT/SMAD3 and SMAD4-R361H/SMAD3 PPI, respectively (Figure 3[href=https://www.wicell.org#fig3]), using equations as shown in Table 2[href=https://www.wicell.org#tbl2].\nCritical: S/B ratio >4 and Z’ factor >0.5 suggests a robust assay condition for HTS (Zhang et al., 1999[href=https://www.wicell.org#bib32]).\nTo determine the assay performance in terms of DMSO tolerance, repeat steps 3a–3d by comparing the assay performance with various DMSO added up to 10% (v/v) during step 3a. To determine the assay performance in terms of temporal stability, repeat step 3c–3d after various incubation time ranging from 2–24 h.\nNote: Given that DMSO is a common solvent used in chemical libraries ((Wigglesworth et al., 2012[href=https://www.wicell.org#bib33]); Janzen and Popa-Burke, 2009[href=https://www.wicell.org#bib19]), we recommend evaluating the assay performance in the presence of DMSO prior to the HTS. Specific to this protocol, the final DMSO concentration is 2% (v/v) during the HTS. Our results show that our reaction system is stable and robust up to 10% DMSO (Figure 4[href=https://www.wicell.org#fig4]). For confirmation studies in biological assays, DMSO concentration should be adjusted based on DMSO tolerance test results for a particular assay system, usually less than 1%. The stock concentration of re-ordered compounds should be prepared accordingly.\nCritical: A DMSO tolerant and temporally stable assay that maintains similar robustness (S/B ratio >4 and Z’ factor >0.5) is recommended for HTS application.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/989-Fig3.jpg\nFigure 3. Signal-to-Background (S/B) ratio and Z’ factor for SMAD4-WT/SMAD3 and SMAD4-R361H/SMAD3 PPI respectively in both 384-well format and 1536-well format",
    "S > 4 and Z′ factor >0.5 suggests a robust assay condition for HTS. Data are presented as mean ± SD from triplicate of a representative experiment.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/989-Fig4.jpg\nFigure 4. DMSO tolerance test\nTR-FRET PPI signal were measured using cell lysate containing various amount of DMSO as indicated. Data are presented as mean ± SD from triplicate of a representative experiment.\ntable:files/protocols_protocol_989_7.csv\nuHTS primary screening\nTiming: 2 days\nThis step describes primary screening process to identify small molecule PPI inducers of SMAD4-R361H/SMAD3 PPI by using the TR-FRET assay we detailed above in an ultrahigh-throughput 1536-well plate format. We have applied similar protocol to identify small molecule PPI inhibitors for other targets as well.\nCritical: With the established TR-FRET assay, starting with a pilot screening is highly recommended. The positive compounds successfully identified and validated will provide more confidence on the screening platform.\nPlate the working reaction mixture in black 1536-well solid bottom plates (5μL/well) using MultiDrop Combi reagent dispenser following manufacturer’s protocol (https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLPD%2Fmanuals%2FN05616_ver1.7%2520Multidrop%2520Combi%2520User%2520Manual.pdf&title=TXVsdGlkcm9wIENvbWJpIFVzZXIgTWFudWFs[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLPD%2Fmanuals%2FN05616_ver1.7%2520Multidrop%2520Combi%2520User%2520Manual.pdf&title=TXVsdGlkcm9wIENvbWJpIFVzZXIgTWFudWFs]).\nNote: Taking the dispenser dead volume into account, we recommend preparing 1–10 mL extra reaction mixture.\nNote: We recommend adding a known negative biological control, such as cell lysate expressing empty vector control, and positive biological control, such as cell lysate expressing SMAD4-WT/SMAD3 PPI, in each plate for screening quality control.\nCritical: Even if some wells will not be used, we recommend adding working reaction mixture or control lysates to fill the whole plate to mitigate the evaporation-induced edge effect.\nAdd 0.1 μL compounds from the 384-well compound plate by using a robotic liquid handler, such as Biomek NXp Automated Workstation with Pintool (VP Scientific) (Cleveland and Koutz, 2005[href=https://www.wicell.org#bib4]) by following manufacturer’s protocol (https://www.beckman.com/techdocs/B20063AC/wsr-145922[href=https://www.beckman.com/techdocs/B20063AC/wsr-145922])",
    "Note: We selected our inhouse Emory Enriched Bioactive Library (EEBL), a library of 2036 bioactive compounds. The working stock of 1 mM was used. The final compound concentration is 20 μM with 2% DMSO (v/v). Each compound is tested with single concentration point in four replicates (Figure 5[href=https://www.wicell.org#fig5]).\nNote: We recommend centrifugation of the plates at 200 × g for 5 min and incubation at 4°C for 16 h before measuring the TR-FRET signal.\nAlternatives: Other chemical libraries with different stock concentrations can be used accordingly depending on the desired hit rate.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/989-Fig5.jpg\nFigure 5. Schematic illustration of the compound adding from 384-well compound plate to 1536-well reaction buffer plate\nEach compound tested at one dose in four replicates.\nMeasure the TR-FRET signal using a BMG Labtech PHERAstar FSx reader by following manufacture’s manual.\nData analysis to calculate the compound’s effect on PPI modulation as the change of TR-FRET signal (ΔTR-FRET) upon compound treatment using the equation as indicated (Table 3[href=https://www.wicell.org#tbl3]).\ntable:files/protocols_protocol_989_8.csv\nNote: We analyzed the screening data by using Bioassay software from CambridgeSoft (Cambridge, MA). Based on the PPI inducing effect with cutoff of ΔTR-FRET≥2SDPPI (40% in this case) compared with the DMSO control, we prioritized the top ranked 23 primary hits. These hits were then cherry-picked from the parental stock for dose-response studies.\nNote: To further validate the cherry-picked compounds, a dose-response confirmatory assay is highly recommended to test whether those compounds can reproducibly induce a significant increase of the TR-FRET signal. Troubleshooting 4[href=https://www.wicell.org#sec6.7].\nPause point: If the hit rate is lower than expected, based on the PPI and chemical libraries used, we recommend re-evaluating the whole procedure by troubleshooting 5[href=https://www.wicell.org#sec6.9]"
  ],
  "subjectAreas": [
    "High Throughput Screening",
    "Molecular/Chemical Probes",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}