{
  "id": 6477,
  "origin_website": "Bio",
  "title": "Simultaneous Fluorescent Recordings of Extracellular ATP and Intracellular Calcium in Mammalian Cells",
  "procedures": [
    "Fura2 loading2-3 days prior to experiment, plate cells in uncoated 35 mm glass-bottom dish (or uncoated 48 mm glass-bottom culture plates) and allow cells to grow to sub-confluence in CO2 incubator (5% CO2, 37 °C).On the day of the experiment, aspirate medium and add 1 ml Fura2 staining solution (solution is at room temperature when added). Incubate cells at room temperature for 30 min in the dark.Aspirate Fura2-staining solution, and wash cells twice with physiological solution. Add imaging solution with luciferase (990 μl/35 ml dish or 297 μl/well in 48-well plate) and allow cells to acclimatize for 10 min at room temperature on the bench (in light-limiting conditions) prior to imaging.Instrument preparationTurn on the UV lamp to warm up 10-20 min prior to imaging.When ready to image, add drop of oil (Carl ZeissTM ImmersolTM Immersion Oil, Fisher Scientific, catalog number: 12-070-397) onto 40x objective lens and position glass bottom dish/plate on top of lens. Bring cells into focus and ensure cell and cell-free regions are visible within the field-of-view.Open imaging software (e.g., Volocity) and enter the following imaging parameters:Sampling rate: 2 timepoints per secondExposure time: 50-200 msNote: Find minimal exposure time required to obtain low-noise images. Longer exposures may result in photobleaching effects. Excitation/emission: 380 nm/510 nmOptional: If automated shutter is available (e.g., Lambda DG-4), close shutter between exposures to minimize photobleaching effects.ImagingFor all imaging trials, record 10-15 s of baseline, apply stimulation and record for additional 100-120 s. Stimulation can be mechanical, for example using a glass micropipette as described in our prior work (Mikolajewicz et al., 2018b), or can be a biochemical stimulus carefully added at 1% volume at 100x of the desired final concentration.Note: For representative fluorescent images of Fura2-loaded cells bathed in luciferin imaging solution, refer to our prior work (Mikolajewicz et al., 2018b).",
    "Also see Sorensen and Novak, (2001) for images of cells bathed in luciferin-imaging solution.  To control for effects of drugs/solutions on D-luciferin signal, acquire recordings of cell-free wells containing luciferase-free imaging solution following stimulation with vehicle alone versus vehicle + drugs.To control for effects of drugs/solutions on luciferase activity, acquire recordings of cell-free wells containing luciferase-supplemented imaging solution following stimulation with ATP alone versus ATP + drugs.To control for effects of mechanical agitation resulting from the application of drugs, add vehicle (e.g., physiological solution) to wells containing Fura2-loaded cells bathed in luciferase-supplemented imaging solution.To establish ATP calibration curve for luciferin recordings, carefully add 1% volume of 100x ATP solution (e.g., 3 μl of 100 μM ATP added to 297 μl imaging solution in 48-well plate to achieve 1 μM ATP stimulation) into the well containing imaging solution, in presence and absence of luciferase (positive and negative controls shown in Figure 2).Notes:Triplicate wells are recommended for each concentration. Concentrations ranging from 0.1-1,000 μM ATP are recommended. Calibration curve can be established in the absence or presence of fura2-loaded cells. The latter is recommended to better mimic experimental conditions and control for the influence of any cell-derived factors that may influence luciferase activity. Measuring Fura2-responses in the same wells also provides additional information about the range of ATP concentrations that Fura2-loaded cells will respond to.  The application protocols should be the same for experimental recordings, controls and calibration.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190515/20190515020404_1553.jpgFigure 2. Effect of ATP on D-luciferin and Fura2 fluorescence (ex 380/em 510). A. Fluorescence of luciferin in the presence and absence of luciferase following addition of 1 μM ATP. B. Fluorescence of Fura2-loaded cells stimulated by 1 μM ATP (+ATP) or vehicle (-ATP)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}