{
  "id": 10261,
  "origin_website": "Jove",
  "title": "Fabrication of 3D Cardiac Microtissue Arrays using Human iPSC-Derived Cardiomyocytes, Cardiac Fibroblasts, and Endothelial Cells",
  "procedures": [
    "1. Medium, reagent, culture plate preparation\nCell wash solution for cell culture: Use 1x phosphate buffered saline (PBS) or Hanks balanced salt solution (HBSS) without calcium or magnesium.\nCardiomyocyte differentiation media\n\t\nPrepare differentiation Medium #1 by adding 10 mL supplement (50x B27 plus insulin) to 500 mL cardiomyocyte basal medium (RPMI 1640).\nPrepare differentiation Medium #2 by adding 10 mL supplement (50x B27 minus insulin) to 500 mL cardiomyocyte basal medium (RPMI 1640).\nPrepare purification Medium #3 by adding supplement (50x B27 plus insulin) to 500 mL cardiomyocyte basal medium (RPMI 1640) minus glucose.\nEndothelial growth media and Magnetic-activated cell sorting (MACS) reagents\n\t\nPrepare endothelial growth medium (EGM) with commercially available endothelial cell growth medium supplement kit.\nPrepare cell separation sorting buffer solution by diluting bovine serum albumin (BSA) stock solution to 1:20 with rinsing solution.\nCardiac fibroblast differentiation medium: Prepare cardiac fibroblast differentiation medium with fibroblast basal medium (DMEM-high glucose) and Serum-Free Fibroblast Life Factors kit.\nCardiac microtissue fabrication and maintenance medium: Prepare filtered medium with cardiomyocyte basal medium (RPMI 1640) with supplement (50x B27 plus insulin) and EGM in 70/30 v/v% ratio.\nSmall molecule and growth factor stock solutions\n\t\nFor differentiation of all three cell types, prepare 200 µL aliquots of GSK3-beta inhibitor CHIR 99021 (6-[[2-[[4-(2,4-Dichlorophenyl)-5-(5-methyl-1H-imidazol-2-yl)-2-pyrimidinyl]amino]ethyl]amino]-3-pyridinecarbonitrile); Wnt inhibitor IWR-1-endo (4-(1,3,3a,4,7,7a-Hexahydro-1,3-dioxo-4,7-methano-2H-isoindol-2-yl)-N-8-quinolinyl-Benzamide; and transforming growth factor beta (TGF-β) inhibitor SB431542 (4-[4-(1,3-Benzodioxol-5-yl)-5-(2-pyridinyl)-1H-imidazol-2-yl]benzamid) at 10 mM concentration in dimethyl sulfoxide (DMSO).\nFor human iPSC-EC differentiation, prepare 100 µL aliquots of basic fibroblast growth factor (bFGF) (20 µg/mL), vascular endothelial growth factor 165 (VEGF165; 50 µg/mL), and bone morphogenetic protein 4 (BMP4; 20 µg/mL) in 0.1% (w/v) BSA in ultrapure distilled water. Store the aliquots at -20 °C; for long-term storage, aliquots can be stored at -80 °C for up to 1 year.\nPre-coating plates for maintenance of iPSC-CMs, iPSC-ECs, and iPSC-CFs.",
    "Prepare basement membrane matrix medium coated 6-well plates for iPSC-CM re-plating by diluting Growth Factor Reduced (GFR) basement membrane matrix medium in DMEM/F12 in a 1:200 ratio. Add 2 mL of diluted basement membrane matrix medium to each well of the 6-well plate and leave it to set for at least 2 to 4 h.\nPre-coat 6-well plate or 10 cm dish with gelatin. Liquefy 2% gelatin solution in a water bath at 37 °C and prepare filtered 0.2% (v/v) gelatin in PBS in an appropriate volume as needed. Coat the culture plate with 10 mL of 0.2% gelatin for at least 30 min at 37 °C prior to use.\n\t\t​NOTE: Gelatin plates can be used for both iPSC-CFs and iPSC-ECs after MACS.\nFabrication of microtissue molds: Prepare 2% low melting agarose solution in PBS in a dry 100 mL glass bottle. Sterilize the agarose at 121 °C, 15 psi for 20 min prior to use. Autoclave the casting silicone micro-molds at 121 °C, 15 psi for 15 min.\nSolutions for digestion, immunostaining, and flow cytometry\n\t\nFor microtissue digestion, prepare an enzyme digestion buffer of Dispase I (1 U/mL) and Liberase (3 U/mL) in PBS. Keep this solution on ice.\nFor both cell and microtissue fixation, use ice cold commercially available fixation reagent containing 4.2% paraformaldehyde (PFA).\nPrepare 0.25% Triton X-100 in PBS for permeabilization and 0.1% Tween-20 for washes. The solution can be stored at room temperature.\nFor fluorescence-activated cell sorting (FACS) analyses, prepare FACS buffer [PBS or HBSS with 2% fetal bovine serum (FBS)] and store at 4 °C.\nFor immunostaining, prepare 2% normal goat/donkey/rabbit serum in PBS. Choose the serum species based on the host in which the antibodies were raised.\n2. Cardiac differentiation and purification",
    "NOTE: All iPSCs should be maintained at ~75% to 80% confluency prior to cardiomyocyte differentiation. iPSCs used for this protocol were derived from peripheral blood mononuclear cells (PBMCs) using Sendai virus reprogramming performed at the Stanford Cardiovascular Institute (SCVI) Biobank.\nPrior to differentiation, culture iPSC colonies up to passage (P20).\nRemove the iPSC culture medium from the 6-well plate and wash the cells once with 2 mL PBS.\nOn day 0, begin mesendoderm induction by adding 2 mL of differentiation Medium #1 with CHIR (6 µM final) in each well. The final concentration may vary between 6 to 9 µM for different iPSC lines. Hence, it is recommended to test different CHIR concentrations on a 6-well plate to identify optimal cardiac mesoderm induction.\nOn day 2, recover the cells by replacing with fresh 2 mL Medium #1 in each well.\nOn day 3, replace medium in each well with 2 mL differentiation Medium #1 with Wnt inhibitor IWR-1-endo (5 µM) to induce cardiac-lineage specification.\nOn day 5, recover the cells by replacing medium with fresh 2 mL Medium #1 in each well.\nOn day 7, replace medium with 2 mL Medium #2 in each well. Spontaneous beating of cardiomyocytes may be observed as early as day 8-9. For some lines, beating cells may appear as late as day 11.\nFor purification of the differentiation culture, replace with 2 mL minus glucose Medium #3 in each well on day 10.\nOn day 13, recover the cells by changing the medium with 2 mL plus glucose Medium #2 in each well.\nOn day 16, perform second round of purification with 2 mL of Medium #3 in each well.\nRecover the cells on day 19 with 2 mL plus glucose Medium #2.",
    "On day 20, wash the wells once with 1 mL PBS and dissociate the cells using 1 mL 10x Trypsin for 6 min at 37 °C. After incubation, the cells are lifted off the well surface into single cells for less than 15 s and added to 15 mL conical tube with equal volume of Medium #2 to neutralize the enzyme. Centrifuge the cell suspension for 3 min at 270 x g.\nResuspend the cell pellet in 3 mL Medium #3. Count the cells and add appropriate volume of Medium #3 to plate a total of ~3 million cells in each well of a new basement membrane matrix medium coated 6-well plate. On the second day after re-plating, replace the medium with fresh 2 mL Medium #2, and replenish with 2 mL Medium #2 every other day until trypsinization of cardiomyocytes for freezing or future experiments.\n3. Endothelial cell differentiation and MACS\nAt 75% to 80% iPSC confluency, wash the plate with PBS, 2 mL per well.\nBegin differentiation at day 0 by replacing with 2 mL of differentiation Medium #1 with 6 µM CHIR.\nOn day 2, replace the medium with 2 mL of differentiation Medium #1 with 2 µM CHIR.\nOn day 4, replace the medium with 2 mL of EGM supplemented with 20 ng bFGF-2, 50 ng VEGF165, and 20 ng BMP4.\nChange the medium with 2 mL of EGM supplemented with growth factors every 2 days from day 6 to day 10. Addition of TGFβ inhibitor (SB431542) at 8 µM concentration is optional to promote endothelial expansion and suppress differentiation of other mesenchymal origin cell types.",
    "On day 12, begin steps for MACS by rinsing each well with 1 mL of PBS followed by cell dissociation using 1 mL of 10x Trypsin in each well of a 6-well plate for 8 min at 37 °C.\nPrepare an equal volume of EGM medium in a 50 mL conical tube to neutralize the dissociation enzyme. Place a 40 µm cell strainer on the 50 mL conical tube and pass the dissociated cell suspension through the strainer. Change the filter for every 2 to 3 dissociated wells.\nEnumerate the total viable cells using 0.4% Trypan blue using a hemocytometer or an automated cell counter.\nPellet the cell suspension at 300 x g for 5 min in a pre-cooled centrifuge set at 4 °C.\nDiscard the supernatant and resuspend the cell pellet in appropriate volume of sorting buffer based on the total count in step 3.8.\n\tNOTE: Add 80 µL of sorting buffer per 107 total cells.\nFor magnetic bead labeling, add 20 µL of FcR Blocking reagent per 107 cells and incubate for 5 min.\nAdd 20 µL of CD144 or CD31 Microbeads per 107 cells and mix well. Incubate the cell suspension in dark at 4 °C for 15 min.\nAdd 20 mL of sorting buffer to wash the labeled cells and pellet the cells 300 x g for 5 min in a pre-cooled centrifuge set at 4 °C.\nResuspend the cell pellet in 3 mL of sorting buffer and leave it on ice.\nPrepare a magnetic separation column by placing the column in the separator notch.\nEquilibrate the column by rinsing with 3 mL of sorting buffer and collect the flow through in a waste conical tube.",
    "Once the rinsing buffer flows through, resuspend the cell suspension thoroughly to break any clumps and apply the cell suspension onto the column.\nAfter the cell suspension has flowed through, wash the column with 3 mL of sorting buffer three times to remove any unlabeled cells.\nRemove the column from the separator and place it in a 15 mL conical tube for CD144+/CD31+ cell elution.\nAdd 5 mL of sorting buffer onto the column and immediately flush the magnetically labeled cells with the plunger.\nDetermine the viable cell number using 0.4% Trypan blue using a hemocytometer or an automated cell counter.\nCentrifuge the cell suspension in a pre-cooled centrifuge at 300 x g for 3 min.\nResuspend the cell pellet in appropriate volume of EGM with 5-8 µM of TGFβ inhibitor (SB431542) based on the total count in step 3.21.\nPlate this passage 0 (P0) cells at an appropriate cell density (4 x 104 cells/cm2) on a pre-coated 0.2% gelatin plate.\nFor P0 and P1, continue to replenish the medium with fresh EGM every 2 days with TGFβ inhibitor. From P2, cells can be cultured in endothelial growth medium without TGFβ inhibitor.\n4. Cardiac fibroblast differentiation\nAllow iPSCs to become 90% to 95% confluent; wash each well with 1 mL PBS.\nBegin differentiation at day 0 by adding 2 mL of differentiation Medium #1 with 11 µM CHIR. For sensitive iPSC lines, the concentration may vary between 9-10 µM.\nOn day 1, observe the plate. It is normal to observe significant cell death with ~30% to 40% cells adhered to the plate.\nOn day 3, add 2 mL of differentiation Medium #1 with 5 µM IWR-1-endo to promote expansion of cardiac progenitors.",
    "On day 4, replace the medium with 2 mL of cardiac fibroblast differentiation medium. Replace with fresh medium every 2 days till day 16.\nOn day 18, detach the cells using 1 mL of 10x Trypsin in each well of a 6-well plate for 10 min at 37 °C.\nDisrupt the cell layer thoroughly and pass the cell suspension through a 70 µm cell strainer in a 50 mL conical tube containing equal volume of DMEM/F12 medium supplemented with 5% FBS.\nDetermine the viable cell number using 0.4% Trypan blue using a hemocytometer or an automated cell counter.\nCentrifuge the cell suspension at 300 x g for 5 min to obtain a pellet.\nFor the first re-plating, resuspend the cell pellet in an appropriate volume of differentiation medium and plate at a cell density (6 x 104 cells/cm2) on a 0.2% gelatin coated plate until 90% confluency.\nSplit the plate and maintain the cardiac fibroblasts in regular DMEM/F12 with 10% serum on gelatin coated plates.\n5. Casting of cardiac microtissue molds and cell seeding\nMelt the agarose in a microwave in a 100 mL glass bottle until boiling. Spray the agarose bottle and place it in the biosafety cabinet. Allow the agarose to cool down for ~3 min.\nPipette 700 µL of molten agarose in a silicone micro-mold of 9 x 9 array. Avoid generating bubbles while pipetting.\nCarefully place the mold on a pre-cooled ice block to accelerate agarose gelation.\nEnsure that once the agarose is gelled, it becomes translucent. Carefully bend around the edges of the micro-mold to loosen the agarose replica. Then, gently peel the replica from all sides to detach the agarose replica from the silicone micro-mold.",
    "Transfer the agarose microtissue tray containing 81 circular recesses (800 µm diameter; 800 µm depth) into a sterile 12-well plate.\nAdd 2 mL of PBS to the agarose microtissue tray and inspect under the microscope for any trapped bubbles or irregular shaped wells.\nSubmerge the agarose tray in 2 mL 70% ethanol overnight, followed by UV treatment in the biosafety cabinet for 1 h.\nPrior to use, remove the 70% ethanol and wash twice with distilled water and a final wash with 2 mL PBS.\nTrypsinize, neutralize, and count iPSC-CMs, iPSC-ECs, and iPSC-CFs and place the cell suspensions on ice.\nRemove the PBS from the well and the cell seeding chamber carefully without touching the recesses.\nIn a new tube, mix iPSC-CMs, iPSC-ECs, and iPSC-CFs in 7:2:1 ratio, respectively, to achieve a final cell density of 106 cells/mL. Higher cell densities will result in larger microtissues.\n\tNOTE: Do not exceed 2 x 106 cells/mL.\nCarefully add the 200 µL of the cell suspension dropwise in the seeding chamber.\nAllow the cells to settle at 37 °C in a CO2 incubator for 2 h.\nAdd microtissue fabrication medium surrounding the agarose mold to just cover the surface of the inner chamber.\nAfter 24 h, the cells self-assemble and compact significantly in the circular recesses. Replace with fresh medium every 2 days for maintenance.\n6. Fixation and permeabilization of cells and cardiac microtissues for immunostaining\nFor each individual cell types, culture the cells separately on basement membrane matrix medium or gelatin coated chamber slides (approximately 2.5-3 x 105 cells/mL). Cardiac microtissues can be collected in 15 mL conical tube by gently flushing them out of the circular recesses.",
    "Aspirate the medium and rinse the cells or microtissues with 1 mL PBS; thereafter, fix with the fixation buffer containing 4.2% PFA for 20 min for the chamber slides and 1 h for microtissues at room temperature.\nAspirate the PFA and add 1 mL of permeabilizing solution (0.25% Triton X-100 in PBS) for 5 to 7 min for chamber slides and 20 min for microtissues in 15 mL conical tube.\n\tNOTE: From this step onwards, the samples can be gently rocked on a benchtop rocking platform.\nAspirate the permeabilizing solution and rinse once with 2 to 3 mL of PBS.\nIncubate the cells with 500-1,000 µL of blocking solution (2% to 5% normal goat serum or donkey serum) for at least 1 h for the chamber slides and 3 to 4 h for the microtissues.\nIncubate the cells or cardiac microtissues with conjugated antibodies prepared in the blocking solution sufficient to cover the sample. Incubate with anti-cardiac Troponin-T (cTnT2) (1:50), anti-CD31 (1:75), and anti-DDR2/Vimentin (1:50) for 1 h for the chamber slides and overnight at 4 °C for cardiac microtissues.\nWash the chamber slides three times with 500 µL 0.1% Tween-20 for 5 min between each wash and a final wash with PBS.\nFor the cardiac microtissues, wash with 2 mL 0.1% Tween-20 five times with 20 min duration between each wash. Perform a final wash step for an additional 20 min.\nIncubate the cells or microtissues with 4',6-diamidino-2-phenylindole (DAPI) (1 µg/mL) prior to confocal microscopy.\nFor cardiac microtissues, transfer carefully to a 35 mm glass bottom dish and add PBS to submerge microtissues.\nFor 3D imaging, using a 20x or 40x oil immersion objective gain center focus of the microtissue and adjust exposure parameters for each fluorophore.",
    "For obtaining a Z-stack, set first and last coordinates in Live mode with a total imaging depth of 100-200 µm with 5-10 µm slice interval.\n7. Digestion of cardiac microtissues and preparation of cells for flow cytometry\nTo digest microtissues, gently flush the microtissues with Medium #1 out of the circular recesses using a wide-bore 1 mL pipette tip into a 15 mL conical tube.\nAllow the microtissues to settle and aspirate the medium carefully and rinse the cells or microtissues with 1 mL PBS and add 200-300 µL of enzyme digestion buffer for 20 min at 37 °C. At 10 min, mix the microtissues gently for 1 min and incubate again at 37 °C for the remainder of time.\nAfter incubation, use a regular 1 mL pipette tip to mix the microtissues vigorously to obtain a turbid cell suspension.\nOnce the microtissues are sufficiently digested into single cells, immediately neutralize the cell suspension with 5 mL of medium containing 5% FBS and strain the cell suspension through a 40 µm cell strainer. Count the total number of cells and centrifuge the single cell suspension at 300 x g for 5 min at 4 °C.\nAspirate the supernatant and resuspend 1 x 105-1 x 106 cells in 100 µL annexin-binding buffer with FITC Annexin V and 100 µg/mL propidium iodide (PI) or To-Pro3 dead cell exclusion dye for 10 min on ice.\nAfter incubation, add 300 µL of the annexin binding buffer to the cell suspension and transfer to a round bottom FACS tube for flow cytometry analysis. Use the correct lasers and emission filters for the select fluorophores.\nFor quantification of cell surface markers using fixed cells, perform the fixation and permeabilization of the cell pellet as described in steps 6.2 and 6.3.",
    "After permeabilization, rinse the cell pellet and incubate the cells with respective conjugated antibodies for 1 h. Wash the cell pellet in 4 mL FACS buffer (2% FBS in PBS) and centrifuge at 300 x g for 3 min. Repeat the wash step twice.\nResuspend the cells in 200-300 µL FACS buffer for flow cytometry analysis.\nAdjust the forward and side scatter properties with an unstained sample and consider using an isotype control for each fluorophore to adjust the laser voltages. Collect a minimum of 20,000 events for data analysis.\n8. Performing contraction analyses of spontaneously beating cardiac microtissues\nRecord videos of cardiac microtissues to capture at least three beats. Set the recording resolution to at least 1280 x 720 pixels at frame rate >30 frames per second and save the video in .AVI format.\nRun the MotionGUI script11 in a MATLAB environment to launch the user interface.\nFind the .AVI file location in your folder to load the video. Then, enter the frame rate at which the video was captured in the Input panel.\nIn the advanced input panel, a pixel size may be specified based on the resolution and the capture magnification.\nA suitable macroblock pixel size can be specified (default 16) and a detectable pixel motion depending on the strength of microtissue contraction.\nAfter adjusting the parameters, click on Get Motion Vectors to begin the analysis.\nSelect a region of interest with the Choose AOI radio button to exclude areas surrounding the single microtissue in the circular recess.\nUse the function Map Time Ave to generate a mean contraction heatmap based on motion detected on X and Y axes.\nFor peak tracing data, use the function Get Contraction Data to automatically measure the contraction and relaxation peaks.",
    "In the event of a low signal-to-noise ratio, apply a peak height and distance threshold to correctly annotate the maximum contraction velocity (blue dot) and maximum relaxation velocity (red triangle).\nAfter setting the correct thresholds, select Analyze Peaks to obtain the contraction and relaxation values with beat rate and beat interval.\nObtain measurements from a minimum of 25 individual microtissues for statistical analyses.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}