{
  "id": 7571,
  "origin_website": "Bio",
  "title": "Stimulus-induced Robust Narrow-band Gamma Oscillations in Human EEG Using Cartesian Gratings",
  "procedures": [
    "In the following sections, we describe in detail the procedure for EEG recording, artefact rejection, and data analysis used in Murty et al. (2020, 2021). These methods are built upon and have evolved from the methods that we used inMurty et al. (2018). For minor differences in these methods, we direct the readers to the original articles.EEG room setup The experimenter’s rig comprised of a stimulus presentation computer, a recording computer, an analysis computer (optional), and an eye-data acquisition computer. The subject area was separated from the rig using thick curtains that also made sure that it was dark. Subjects sat on a stable chair and placed their chin on a chin rest. Their head was supported by cheek and head-rests mounted on the chin rest. We placed the gamma corrected monitor in front of and at the level of the chin rest, at a mean ± standard deviation (SD) distance of 58.1 ± 0.8 cm (range: 53.8–61.0 cm) from the subjects, according to their convenience. The monitor subtended a width of at least 52° and height of at least 30° of the visual field. The chin rest or its components never obstructed the monitor, and the entire monitor was always visible to the subjects. We calibrated the stimuli to the viewing distance for all subjects. We placed the eye-tracking camera below and at the center of the monitor. We instructed the subjects to wear spectacles, if prescribed.EEG recording On the day of the experiment, we requested subjects to wash their hair with shampoo prior to coming for the recording session. We also briefed the subjects about the procedure and took their written consent before starting. Electrodes were placed on the scalp according to the international 10–10 system, using the electrode cap and gel as suggested by the manufacturer.",
    "We ensured that the gel under one electrode did not come in contact with the gel under another electrode. We also ensured that electrode impedances were less than 25 KΩ while applying gel, and rejected those electrodes that could not satisfy this criterion from analysis. After this process, we seated the subjects on the subject’s chair and calibrated the eye-tracker. We then presented a set of stimuli on the stimulus presentation monitor, while the subjects fixated on a small (0.1°) fixation point on the monitor. We acquired raw EEG signals by referencing all 64 electrodes to location ‘FCz’ on the scalp (see Figure 5). We filtered these signals online between 0.016 Hz (first-order filter) and 1000 Hz (fifth-order Butterworth filter), sampled at 2,500 Hz, and digitized at 16-bit resolution (0.1 μV/bit).Stimuli Stimuli were static achromatic images whose luminosity varied sinusoidally across space, giving a sense of continuous, alternating black-and-white bars on the monitor. Such images are called gratings. These gratings are characterized by spatial frequency and orientation: spatial frequency is the frequency of the sinusoid (expressed as cycles per degree [cpd] of the visual field), and orientation is the direction perpendicular to the direction of the sinusoid (0° being vertical gratings). Gratings could further be varied in terms of their size (diameter) and contrast. We had observed that gratings with spatial frequency 1–4 cpd, having a diameter larger than 16° of visual field, and at 100% of contrast elicited robust slow and fast gamma oscillations in humans (Murty et al., 2018). Video 1 shows example full-screen stimuli (varied in spatial frequency and orientation) at 100% contrast.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Video showing example gratings and example trials.  Each trial began with the appearance of a fixation point at the centre of the stimulus presentation screen.",
    "Within a trial, a series of gratings were presented (2 to 3 per trial) for 800 ms, with an interstimulus interval of 700 ms. Gratings were achromatic sinusoidal Cartesian gratings, whose spatial frequency was randomly chosen from 1, 2, and 4 cpd. The orientation of the gratings was randomly chosen from 0°, 45°, 90°, and 135°. The fixation point was presented on the screen throughout the trial, and disappeared at the end of the trial.Stimulus presentation Details of stimulus presentation could be found in Murty et al. (2018, 2020, 2021). Example trials are shown in Video 1, and a video of a subject performing the task is shown in Video 2. Typically, the subjects fixated on the fixation point for 1,000 ms at the start of each trial. After this initial fixation period, we presented a series of gratings (2 to 3 per trial) for 800 ms, with an interstimulus interval of 700 ms. After the last stimulus of the trial was presented, the fixation point disappeared, and the subjects were allowed to rest their eyes by breaking fixation, while keeping their head stable. We performed each experiment in 1–2 blocks in a single session, according to the comfort of the subject. We gave breaks between blocks, during which the subjects could relax by removing their head off the chin rest. However, the distance of the chin rest from the monitor was kept constant between blocks. For a few subjects reported in Murty et al. (2018, 2020), we performed the experiments in two sessions according to the comfort of the subjects. For each session, we repeated the entire procedure of eye-tracker and stimulus calibration for monitor-to-chin rest distance.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Video of a subject performing the task.  Subjects had to fixate on the fixation point throughout the trial.",
    "The trial was aborted if they broke fixation during the trial. After the trial ended or aborted, they were allowed to rest their eyes by breaking fixation, but keeping their head stable. Sounds were played through in-built speakers on iMac (the stimulus presentation computer) that alerted the subjects at the start of the trial, as well as when the trial ended, or when they broke fixation during the trial.Data segmentation We first segmented EEG data between -1 to 2.2768 seconds around each stimulus onset time (total: 8192 points), and generated a N x 8192 data matrix for each electrode, where N is the number of stimulus repeats. Each segment is abbreviated as a “repeat”.Artifact rejection We wanted to find a common set of bad repeats for all the electrodes, which would allow us to also do connectivity/causality analysis. In many cases, a small set of electrodes had a large number of bad repeats, so including those electrodes drastically reduced the total number of repeats for all electrodes. Therefore, we designed a fully automated artifact rejection pipeline to (i) find a set of bad electrodes, and (ii) a set of common bad repeats in the remaining good electrodes.As mentioned above, we rejected data offline from those electrodes whose impedance was more than 25 KΩ. We further rejected repeats with fixation breaks (defined as eye-blinks or shifts in eye-position outside a square window of width 5º, centered on the fixation spot) during 0.5s–0.75s of stimulus onset. We preprocessed the recorded data as follows (also described in Murty et al., 2020): For each unipolar electrode (Figure 2):  We considered data for each electrode into smaller segments from -500 ms to 750 ms of stimulus onset.",
    "We then applied trial-wise thresholds in both time and frequency domain, as follows:For raw waveforms (time-domain):  We first high-pass filtered the signal for each repeat at 1.6 Hz, to eliminate slow trends if any. We filtered the signal only for the purpose of artefact rejection, but not for final data analysis. Any stimulus repeat for which the filtered waveform deviated by six times the standard deviation (SD) from the mean at any time bin was considered as a bad repeat for that electrode.For Power Spectral Density (PSD; frequency-domain):  We estimated multi-tapered PSDs from 0 to 200 Hz for each trial separately, with five tapers (time-bandwidth product or TW=3), using Chronux toolbox [(Mitra and Bokil, 2008), http://chronux.org/, RRID:SCR_005547]. Any stimulus repeat, for which the PSD deviated by 6 SD from the mean at any frequency point, was considered as a bad repeat for that electrode.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4379/bioprotoc-12-07-4379-g002.jpgFigure 2. Flowchart for separating bad repeats for each unipolar electrode.  Common set of bad repeats (Figure 3):  We next created a common set of bad repeats across all 64 unipolar electrodes, as follows:We first discarded those electrodes that had more than 30% of all repeats marked as bad (from step a).We then created a common set of bad repeats, by including in it any repeat (that was marked as bad in step a) in any of the ten unipolar electrodes used for analysis (P3, P1, P2, P4, PO3, POz, PO4, O1, Oz, and O2).Next, we included in this set any repeat (that was marked as bad in step a), if it occurred in more than 10% of the total number of remaining electrodes. This was the final set of bad repeats that we discarded, so the rest of the stimulus repeats were used for analysis.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4379/bioprotoc-12-07-4379-g003.jpgFigure 3.",
    "Flowchart for creating a common set of bad repeats across all analyzable unipolar electrodes.  Further rejection of electrodes (Figure 4):  As mentioned above, we discarded those electrodes that had impedance more than 25 KΩ, or those that had more than 30% of all repeats marked as bad. Occasionally, we observed electrodes for which the PSD tended to flatten out (which could happen if it hit a noise floor, for example). We therefore added another pipeline to reject such electrodes. To this end, we calculated PSD slopes for each unipolar electrode, as follows:We estimated PSDs for each analyzable repeat using one taper (TW=1) and averaged the resulting PSDs.We fitted a power-law function, P(f)=A.f-β to these trial-averaged PSDs, where A (scaling factor), and β (slope) are free parameters obtained using least square minimization (using the fminsearch function in MATLAB), and P is the PSD across frequencies f∈[56 84] Hz.We discarded those electrodes that had slopes less than 0. We did this separately for each block.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4379/bioprotoc-12-07-4379-g004.jpgFigure 4. Flowchart for discarding bad unipolar electrodes. For any block, if there were no analyzable bipolar electrodes (see Data Analysis subsection below), we discarded that block for that subject, and pooled the data across the rest of the blocks for data analysis. For minor differences in rejection of blocks for Murty et al. (2020, 2021), kindly refer to the respective articles."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}