{
  "id": 19264,
  "origin_website": "Jove",
  "title": "Mouse Model of Middle Cerebral Artery Occlusion",
  "procedures": [
    "1. MCAO Method\nThis protocol was approved by the Institutional Animal Care and Use Committees at UCSF and Kent State University, and abides by the National Institutes of Health guidelines for the use of experimental animals.\nCut a 5-0 monofilament suture (Harvard Apparatus, Holliston, MA) into 20 mm segments. Round the tip of each segment by heating it near a cauterizer (Braintree Scientific, Inc., Braintree, MA). Measure the diameter of the tip using a micrometer (Applied Image Inc., Rochester, NY). We use a suture with a final tip diameter of 0.21-0.22 mm for a mouse with body weight of 25-30 g.\nSterilize all surgical tools by autoclaving (minimum 121 °C, 15 PSI, for 15 min). Sanitize the surgery table and associated equipment using 70% ethanol.\nAnesthetize an 8-12 week-old mouse (25-30 g) with 5% isoflurane (Aerrane, Baxter, Deerfield, IL) in 30% O2 / 70% N2O using the V-10 Anesthesia system (VetEquip, Inc., Pleasanton, CA). Following induction of anesthesia, reduce the level of isoflurane and maintain it at 1.5%.\nPlace the mouse in the supine position on a heating pad. Insert a rectal probe, and monitor and maintain body temperature between 36.5-37.5 °C using the TR-200 homeothermic temperature system (Fine Science Tools Inc., Foster City, CA).\nShave the fur on the ventral neck region with electric clippers (Braintree Scientific) to expose the skin. Disinfect the surgical site using three applications of 70% ethanol.\nUnder a stereo dissecting microscope (Nikon, Japan), make a 1 cm long midline incision on the neck. Use retractors (Braintree Scientific) to expose the surgical field and identify the right common carotid artery (CCA), external carotid artery (ECA), and internal carotid artery (ICA). Carefully dissect the arteries free from surrounding nerves and fascia.",
    "Dissect the ECA further distally and coagulate the ECA and its superior thyroid artery (STA) branch using a bipolar coagulator (Howard Instrument Inc., Tuscaloosa, AL). Cut the ECA and STA at the coagulated segment.\nLoosely tie two 8-0 silk sutures around the ECA stump. Apply a vascular clamp (Fine Science Tools) at the bifurcation of the CCA into the ECA and ICA.\nMake a small incision at the end of ECA stump with Vannas-style spring scissors (Fine Science Tools). Measure and record the length of a 5-0 monofilament suture rounded at the tip. Insert the suture into the incision and advance to the clamp. Tighten the two silk sutures around the lumen just enough to secure yet preserve mobility of the in-dwelling monofilament suture.\nRemove the clamp from the bifurcation. Gently advance the monofilament suture from the lumen of the ECA into the ICA for a distance of 9-10 mm beyond the bifurcation of CCA to occlude the origin of MCA. The duration of surgery is about 30-45 min.\nSuture the incision on the neck and place the mouse in a 35 °C nursing box to recover from anesthesia, and return it to the cage. It generally takes 5-10 min for the mice to recover from anesthesia. To perform transient MCAO, the researcher can re-anesthetize the mouse and withdraw the suture back into the stump of ECA after a period of time, usually between 0.5-2 h.",
    "Twenty-four hours after the induction of MCAO, anesthetize the mouse with 5% isoflurane and euthanize it by cervical dislocation. Decapitate the mouse and collect the brain. Slice the brain coronally into four 2-mm slices with a brain matrix (Braintree Scientific) on ice. Incubate the brain slices in 2% 2,3,5-triphenyltetrazolium chloride (TTC) (Sigma-Aldrich) in 1X PBS for 20 min at room temperature to determine the size and extent of the infarction. Fix the brain slices in 10% neutral buffered formalin solution (Sigma-Aldrich) at 4 °C until imaging. The extent of infarction can be quantified as described in JoVE protocol 955 (http://www.jove.com/index/Details.stp?ID=955[href=http://www.jove.com/index/Details.stp?ID=955]) 9.\n2. Representative Results\nThe infarcts generated by MCAO are seen in the striatum and the dorsolateral cortex. The striatum is more sensitive to ischemia than the cerebral cortex. Thirty minutes of MCAO will produce an infarct only in the striatum, while more than one hour of MCAO will damage both striatum and cortex. After 24 h permanent MCAO, the total infarct percentage is ~40±5% of the hemisphere and the mortality rate after surgery is ~10%. We exclude mice from further studies if excessive bleeding occurs during surgery, the operation time exceeds 90 min, mice fail to recover from anesthesia within 15 min, or hemorrhage is found in the brain slices or at the base of the circle of Willis during postmortem examination.",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/2761/2761fig1.jpgFigure 1. Representative images of TTC-stained brain slices (coronal level 1-4) after 24 h of permanent MCAO. In living tissue TTC is enzymatically reduced by dehydrogenases to 1,3,5-triphenylformazan (TPF), which is red in color, while in necrotic areas it remains white due to absence of such enzymatic activity. Therefore, the area of infarction can be identified by its white color due to lack of conversion of TTC to TPF. Note: TTC is somewhat heat and light unstable so protect stained sections from heat and light as much as possible."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}