{
  "id": 15196,
  "origin_website": "Jove",
  "title": "Expansion of Two-dimension Electrospun Nanofiber Mats into Three-dimension Scaffolds",
  "procedures": [
    "All in vivo procedures outlined below were approved by the IACUC Committee at the University of Nebraska Medical Center.\n1. Prepare the Solutions for Standard Electrospinning\nIn a 20 mL glass tube, dissolve 2 g of poly(ε-caprolactone) (PCL, Mw= 80 kDa) in a solvent mixture of dichloromethane (DCM) and N,N-dimethylformamide (DMF) with a 4:1 ration (v/v) at a concentration of 10% (w/v).\n\tCAUTION: Handle DCM and DMF in a well-ventilated hood to avoid exposure to fumes. Do not expose DCM to plastic materials.\nPlace the glass tube into a lab rotator until the solution becomes clear. The solution may mix overnight.\nIf intending to embed bioactive materials such as peptides or drugs into the scaffold, create a separate solution and store at the 4 °C until ready to use.\n\t\nPrepare the fluorescent dye solution (50 μg/mL) using 20 mL of PCL solution.\n2. Set Up the Electrospinning Apparatus (Figure 1A)\nAdd the PCL solution to a 20 mL syringe with a 21 gauge blunt needle attached. Ensure that there is no air in the syringe and associated tubing.\nPlace a rotating steel drum with the ground collector 12 cm from the needle tip.\nUsing alligator clips, connect the Direct Current (DC) High Voltage power supply to the needle and ensure that the collector is grounded.\n\tCAUTION: Always turn off the power supply before handling any connected materials.\n3. Electrospinning\nFor the 20 mL of PCL solution, set the parameters of the syringe pump as follows: diameter = 20.27 mm, flow rate = 0.5 mL/h. Check if the droplets are forming at the tip of the needle.\nIf the incorporation of bioactive molecules is desired, set up the apparatus to allow for co-axial electrospinning (Figure 1B). Create a customized coaxial nozzle using hypodermic needles.",
    "NOTE: Such nozzles are also available commercially. Note that a solution of dye is prepared to simulate the adding such molecules.\n\t\nPrepare a 1% solution of the fluorescent dye Coumarin 6 in water. Add 3 mL of the 1% dye to a small syringe. Connect the syringe to the same coaxial nozzle as the PCL solution. Once again, ensure that there are no air bubbles.\nFor this 3 mL solution, set the parameters of the syringe pump as follows: diameter = 9.49 mm, flow rate = 0.02 mL/h. Check if the droplets are forming at the tip of the needle.\nApply an electric potential of 20 kV between the spinneret (22-gauge needle) and a ground collector located 20 cm away from the spinneret. Collect the aligned nanofiber mats in a drum rotating at 2,000 rpm. Collect the PCL nanofiber mats once they reach a thickness of ~1 mm.\n4. Generation of PCL Nanofiber Mats with Arrayed Holes.\nFabricate PCL nanofiber mats.\n\t\nDissolve PCL beads in a solvent mixture consisting of DCM and DMF with a ratio of 4:1(v/v) at a concentration of 10% (PCL) (w/v). Pump the PCL solution at a flow rate of 0.7 mL/h using a syringe pump while a potential of 20 kV is applied between the spinneret (a 22-gage needle) and a grounded collector located 12 cm apart from the spinneret.\nCollect the nanofiber membrane using a rotating drum with a rotating speed larger than 500 rpm.\nImmerse the PCL nanofiber mats in liquid N2 for 5 min (i.e., become stiff). Keep the PCL nanofiber mats in liquid N2 and punch PCL nanofiber mats with a 0.5 mm-diameter punch.\n5. Expansion of 2D Nanofiber Mats with/without Arrayed Holes via Subcritical CO2 Liquid (Figure 2).",
    "Place the PCL nanofiber mats into liquid nitrogen for 5 min and cut into 1 cm x 1 cm squares using sharp surgical scissors while submerged in liquid nitrogen to avoid deformation of the edges.\nPlace the cut mat in a 30 mL centrifuge tube with ~1 g of dry ice. Tightly cap the lid and allow for the dry ice to change into liquid CO2.\nOnce liquid has formed in the tube, quickly release the pressure by opening the cap.\n\tCAUTION: Use proper thermal protective gear when working with liquid nitrogen and dry ice. Do not open the pressurized tube towards the face. The centrifuge tube should not be used repeatedly.\nRemove and observe the puffed scaffold from the tube. Place the scaffold in a new centrifuge tube with dry ice and repeat until the desired thickness is achieved. Sterilize the expanded nanofiber scaffolds in ethylene oxide prior to incubation with cells.\n6. Characterization of Expanded Nanofiber Scaffolds\nCharacterize the morphology and structure of the expanded nanofiber scaffolds using scanning electron microscopy (SEM).\n\t\nPlace the samples with double-sided conductive tape to the metallic stud and coat with platinum for 40 s using a sputter coater at 40 mA.\nExamine the fibers using SEM according to previous studies9. Collect the images at an accelerating voltage of 15 kV.\nCharacterize in vitro release profiles and bioactivity of released peptides.\n\t\nWeight 10 mg of nanofiber membranes before and after the expansion in CO2.\nImmerse the samples in PBS buffer and collect 10 μL of supernatant at different time points (0-28 days).\nUse Enzyme-Linked Immuno Sorbent Assay (ELISA) kit to quantify the LL-37 peptide concentration in the collected supernatant.\nExamine cellular infiltration in vivo and host response.",
    "Put the 9-week old Sprague-Dawley (SD) rats in an anesthesia chamber, connect to isoflurane vapor and anesthetize the rats. Transfer the rats to an operating table after the rats become complete anesthesia without feelings. Continuously anesthetize the rats using an isoflurane-nose cone with vaporizer during the surgery. Shave the hair of rat’s backs by an animal’s shaver and sterilize it with iodine and alcohol skin scrub. Create subcutaneous pockets via 1.5 cm incisions at supraspinal sites on the dorsum using a scalpel.\nInsert one expanded nanofiber scaffold (1.5 mm-thick) into the subcutaneous pocket using tweezers for each incision. Close the incision using a stapler.\nAt 1, 2, and 4 weeks, euthanize the rats with 95% CO2. Gently dissect the explant and the surrounding tissue using surgical scissors. Prior to histological analysis, immerse the tissue in formalin for at least 3 days, and then embed with paraffin. Section the tissue with a microtome, then perform hematoxylin and eosin (H&E), Masson’s trichrome staining.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}