{
  "id": 2300,
  "origin_website": "Cell",
  "title": "A protocol to induce systemic autophagy and increase energy metabolism in mice using PEGylated arginine deiminase",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTo induce arginine depletion, we delivered ADI-PEG 20 weekly via intraperitoneal injection (IP) into genetically obese db/db mice, and age-matched littermate db/db mice are used as controls. The following procedure is written for a 5-week treatment regimen. Although we have not yet dosed over a longer period of time, prior mouse and human studies with treatment duration up to 13 weeks have been reported without serious drug-related adverse events (Hajji et al., 2022[href=https://www.wicell.org#bib3]; Tsai et al., 2017[href=https://www.wicell.org#bib10]).\nADI-PEG 20 treatment\nTiming: 5 weeks\nAfter the animals are acclimated and experimental groupings are finalized, initiate ADI-PEG 20 treatment.\nTake mice cages one at a time to a dedicated biosafety cabinet for animal procedures.\nRemove the cage lid, food, and water bottle from the cage.\nMeasure the body weight of every mouse in the cage and record the weights.\nPrior to ADI-PEG 20 injection, obtain a single-use syringe with needle and draw the necessary volume for injection.\nDeliver 5 IU/animal intraperitoneally (IP). In our case, we injected 50 μL per animal at protocol doses.\nFor control animals, IP inject equal volumes (50 μL) of 0.9% saline per animal.\nNote: Stock ADI-PEG 20 solution is clear and colorless. ADI-PEG 20 is prepared and shipped in small glass vials. Each vial contains 3.5 mL solution with a protein concentration of ∼11.0 mg/mL. ADI-PEG 20 should be stored at −80°C, and aliquoted to avoid repeated freeze-thaw cycles. To prepare working stocks of ADI-PEG 20 for treatment, we thawed 1 vial of stock ADI-PEG 20 and aliquoted the undiluted contents into separate tubes. The volume of the aliquot is calculated to match the number of mice we need to inject, such that we only use 1 aliquot per round of treatments.",
    "Optional: ADI-PEG 20 can be diluted and injected on the day of treatment. The stock material is slightly more viscous than water, but is highly miscible with other diluents, such as 0.9% saline solution.\nCritical: Experimentalists should optimize delivery volume based on the lot/stock concentration of ADI-PEG 20 available. The timing of the weekly ADI-PEG 20 injection must be kept consistent every week. For example, our ADI-PEG 20 treatments in db/db mice occurred every Wednesday at 8:00 AM ± 30 min.\nAfter injection, slowly and carefully place the animal into a fresh cage with new bedding and nestlets (two squares per cage).\nOnce each animal has been treated, weigh the remaining water and rodent chow. Freshly replenish food and water into the cage, and secure the lid.\nTo measure food and water consumption, weigh the residual chow and measure the amount of water left 24 h (or a time interval of choice) later using a graduated cylinder.\nSubtract the leftover food weight and water volume by the initial to get the total consumption per cage.\nIndividual mouse consumption can be estimated by dividing the total cage consumption by the number of animals per cage.\nReturn the cage to its original precise position within the housing suite, such that the visual environment of the mouse remains consistent throughout the trial. Move on to the next cage and repeat steps 3–6.\nMonitor body weight, food consumption, water consumption, and record daily.\nNote: Daily monitoring of body weight, food consumption, and water consumption are not necessarily required. Adjust the monitoring frequency based on research interest and goal. However, we recommend daily monitoring as the animals become more polydipsic and polyuric with age and advancing obesity.",
    "Note: Depending on the experimental design, experimentalists can eliminate food intake as a variable by pair-feeding, or through food access restriction.\nCritical: Experimentalists should maintain consistent time-of-day for measurements, regardless of the monitoring frequency adopted for their experiment. For example, body weight measurements in ADI-PEG 20-treated db/db mice occurred daily at 8:00 AM ± 30 min in 24-h intervals. This is because mouse body weight fluctuates throughout the day. This body weight fluctuation is often further pronounced in obese mice when compared with lean mice.\nBody composition can be measured depending on the availability of an echoMRI.\nLiver dissection\nTiming: 1 day\nThe following protocol describes in detail the steps for mouse euthanasia, liver dissection, and tissue handling. Liver dissection for the entire cohort can generally be completed in one day. Depending on the size of the cohort, animal sacrifice can occur in parallel with the help of lab mates.\nSacrifice mouse 48 h after the last ADI-PEG 20 injection.\nCritical: Tissue collection for each mouse should be completed 48 h ± 30 min after the last ADI-PEG 20 injection.\nEuthanize mouse by cervical dislocation.\nNote: Other approved methods of euthanasia with or without a secondary physical method of euthanasia to ensure death are also acceptable, as long as the person/people performing the procedures are fully trained.\nSpray the mouse fur with 70% ethanol to prevent fur contamination into dissected tissues.\nPlace the mouse in a supine position on the dissection table.\nLocate the abdomen and make a small longitudinal incision along the midline and expose the peritoneal sheath.\nCarefully make another small incision on the parietal peritoneum without damaging any internal organs.",
    "From the small incision, make an inverted Y- or inverted T-shaped incision connecting to the xiphoid process of thorax to expose the abdominal cavity and viscera (Figures 2[href=https://www.wicell.org#fig2]A and 2C).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1794-Fig2.jpg\nFigure 2. Illustration of murine liver lobes to aid lobe identification during liver dissection\n(A) Ventral view of a male db/db mouse liver. Scale bar, 5 mm.\n(B) Figure (A) with corresponding liver lobes outlined by dot line and color coded.\n(C) Ventral view of the same male db/db mouse liver with the medial lobe folded cranially to reveal the liver lobes underneath.\n(D) Figure (C) with corresponding liver lobes outlined by dot line and color coded. The white bold line marks the excision line to remove the left lateral lobe (gray).\nRight medial lobe (orange), left medial lobe (blue), right lateral lobe (purple), left lateral lobe (gray), caudate process (yellow), gallbladder (green), and inferior vena cava (IVC, red). The papillary process is located underneath the left lateral lobe (gray) and is not depicted in this figure.\nNote: Experimentalists can also make a horizontal incision along the inferior aspect of the 12th rib to expose the entire liver.\nIdentify the left lateral lobe of liver (Figure 2[href=https://www.wicell.org#fig2]). Gently lift the left lateral lobe using a pair of surgical forceps and excise at the point of attachment (Figure 2[href=https://www.wicell.org#fig2]D, marked by white bold line).\nOptional: The gallbladder sits just underneath the right medial and the left medial lobe of the liver (Figures 2[href=https://www.wicell.org#fig2]B and 2D). Avoid gallbladder rupture during liver dissection. To achieve this, carefully remove the gallbladder first by using forceps to grip the common bile duct. Cut and lift away the entire structure after incising the common bile duct, with the gallbladder fully intact.",
    "Coarsely cut the left lateral lobe into small pieces and place all liver pieces in a labeled 1.7 mL tube.\nImmediately snap-freeze in liquid nitrogen.\nRemove the remaining liver lobes. Quickly place the liver tissue in a separately labeled 1.7 mL tube and immediately snap-freeze in liquid nitrogen.\nOptional: If liver weight is desired, excise out all lobes of liver first. Zero the weight on an analytical balance with a small 1″ disposable weighing dish.\nOptional: Other tissues of interest can also be harvested. If additional tissues are desired, experimentalist should incorporate sufficient dissection time for the additional tissues.\nCritical: When collecting multiple tissues, tissues that are more metabolically active, such as liver and heart, should be prioritized for rapid collection. Subcutaneous adipose tissue and visceral adipose tissue that are less metabolically active can be collected last.\nStore all tissue samples at −80°C.\nPause point: Liver and other tissues can be left at −80°C for long-term storage.\nRNA extraction and cDNA synthesis\nTiming: 8 h\nThe following protocol describes in detail the steps for RNA extraction from murine liver tissue. RNA extraction and cDNA synthesis can be completed in one day or split into multiple days. Briefly, liver tissue is isolated using TRIzol™ Reagent (Invitrogen). Complementary DNA (cDNA) is synthesized using QuantiTect® Reverse Transcription Kit (Qiagen).\n25–35 mg of liver tissue collected from step 19 of this protocol is used for RNA extraction.\nUse 750 μL of TRIzol Reagent per sample for RNA extraction in a prelabeled 1.7 mL tube.\nHomogenize the liver tissue in TRIzol Reagent with a 1.5 mL KONTES® PELLET PESTLE® Grinder (Kimble Chase).\nPerform RNA extraction using TRIzol Reagent by following the manufacturer’s instructions (Detailed protocol can be found in the following link: TRIzol™ Reagent User Guide).",
    "Use a spectrophotometer to measure the concentration of extracted RNA.\nSynthesize cDNA from extracted RNA using QuantiTect Reverse Transcription Kit by following the manufacturer’s instructions (Detailed protocol can be found in the following link: QuantiTect® Reverse Transcription Kit Quick-Start Protocol).\nReverse transcription reaction components and reaction setup is described in the materials and equipment section of this protocol.\nCritical: Use sterile tubes that are certified RNase- and DNase-free, and sterile, low-binding, filtered tips that are certified RNase- and DNase-free for all steps described."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Metabolism"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}