{
  "id": 19135,
  "origin_website": "Jove",
  "title": "Eye Tracking Young Children with Autism",
  "procedures": [
    "1. Eye-Tracking Equipment\nAlthough a variety of eye-tracking systems are commercially available, those that are most conducive to testing young children with ASD share the following features:\nFirst and foremost, the eye-tracker needs to account for head motion, which if uncorrected, can compromise the integrity of acquired gaze data. While many older systems ensured accurate tracking through head stabilization via the use of a chin-rest or head mounted systems (see Figure 1), these options are not ideal eye-tracking solutions for young children who may resist efforts to restrict head movement, or have equipment placed upon them. Fortunately, most modern commercial infrared video eye-tracking systems use a reference system based on corneal reflections that are resilient to minor head movements. Eye-tracking systems that either offer integrated or remote head tracking solutions are preferred and are now widely available.\nUnobtrusive eye-tracking systems that do not interfere with the testing session are recommended for testing children with ASD. These can be models that are integrated within a display monitor (e.g., Tobii Technology models TX300, T60XL, or T120; SensoMotoric Instruments model RED500), or table-top versions (e.g., Tobii Technology TX300, X120; Applied Science Laboratories model D6 Optics; SR Research model EyeLink 1000) placed inconspicuously within range of the participant. As table-top versions are not locked into a specific screen size, they offer increased methodological flexibility but are less automated and may require more manual adjustment.",
    "Researchers should also select an eye-tracking system with a sampling rate appropriate for addressing their research questions. Most corneal reflection eye-tracking systems have a minimum sampling rate of 50 Hz (i.e., 50 data points per second), which is adequate for examining young children's perceptual patterns during their visual scanning of static images13 and dynamic videos10. However, researchers interested in subtle oculomotor behavior14 (e.g., smooth pursuit, gain, and/or express saccades) will want to invest in a system with a higher sampling rate (i.e., ≥ 250 Hz). Be aware that in some systems that allow for several sampling rate options, higher sampling rates often are enabled at the expense of freedom of head movement, making it more difficult to keep a kinetic child within eye-tracking range. Higher frame rates require faster sampling and processing of video data, which is typically accomplished by cropping the image obtained from the camera. This results in a reduction of the used field of view, which thereby reduces the range of permissible head movement. Researchers who use systems that offer different sampling rate options should select one that is high enough to address their research question but low enough to allow for expected levels of head movement.\n2. Testing Environment and Stimuli\nSparse room décor is recommended for the immediate eye-tracking environment in order to minimize the chances that the child's attention is drawn outside the display. Similarly, a dimly lit room helps reduce the salience of competing non-display stimuli.",
    "However, because some young children with ASD may experience visual and/or auditory hypersensitivities, researchers should avoid testing in a completely darkened room that heightens the brightness of the display or including overly loud or jarring sound effects in their presentations, as these may be aversive for some children with ASD and result in reduced testing compliance. Darkened environments may also increase pupil dilation which can make the pupil more difficult to track, though this may vary depending on the eye-tracking equipment used. For most cases, standard office lighting is recommended.\nTo further reduce the chances of the child being distracted away from the display, the experimenter should not be visible to the participating child. This may be achieved by placing a partition between the eye-tracking station and the experimenter-manned host computer or by simply positioning the experimenter out of view from the participant. A second camera can help the experimenter retain a view of the participant in this situation. Indeed, some commercial eye-trackers integrate a camera within the display so that video of the participant is relayed in real time to the host computer for experimenter monitoring.\n3. Procedures\nYoung children, particularly those with an ASD, may be apprehensive about experiencing a novel testing environment. While prior familiarity with the testing space and/or experimenter may help to mollify these feelings, this is not always possible. At a minimum, apprehensive children should be accompanied by a parent or familiar adult throughout the testing session. In some cases, researchers should be prepared to be patient while the child becomes accommodated to the new environment.",
    "Before the testing session begins, the experimenter may choose to have a children's video or cartoon playing on the display monitor. This often helps make the child feel more at ease while also ensuring attention is directed towards the testing display. The experimenter may then take advantage of the child's captured attention to position the child within eye-tracking range and transition directly into the calibration sequence.\nSeating for the child must allow for vertical adjustment in order to ensure that all children, regardless of height and posture, can be positioned within eye-tracking range. While the distance of the chair from the display will depend upon the size of the screen and the desired visual angle, the height of the chair needs to be adjusted based upon the child's stature so that line of sight is standardized across all participants. Because not all children sit in the chair in exactly the same way, it is also often necessary to slightly adjust the participant-to-display distance in order to ensure that each child is positioned at the optimal distance from the screen for acquiring high quality data. This distance will be specified by the eye-tracking manufacturer, and is most easily achieved by using a mobile chair.\nExperimenters may first attempt to have the child, if small enough, sit alone in a buckled car seat on an adjustable lift or in a portable high chair that attaches to adjustable-height office chair. We have also had success using a Rifton chair, particularly with children who have used it previously in classroom or home settings, as it is easy to position and helps restrict mobility that may result in data loss.",
    "Children who only remain compliant while sitting upon the lap of the caregiver, or who require the body support the caregiver can provide, can also be accommodated by having caregiver sit in an office chair that may be raised or lowered to position the child within the standardized distance parameters. See Figure 2 for an example of this set-up. Statistics regarding lap versus chair sitting should always be retailed for analyzing possible confounds. In order to ensure that only the child's eyes are acquired by the eye tracker, researchers may have caregivers wear infrared-blocking or opaque sunglasses, or simply instruct them to close their eyes during testing. Caregivers should also be instructed to be still and refrain from verbally or non-verbally communicating with the child during the testing procedure.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3675/3675fig1.jpg\nFigure 1.  A head-mounted eye-tracking system.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3675/3675fig2.jpg\nFigure 2.  A child may sit on the lap of the caregiver if the child requires physical assistance in sitting, or if it is necessary for maintaining compliance.\nFor eye-tracking systems that provide the experimenter with a window displaying the participant's eyes within the range of permitted head movement, the child's eyes should be positioned in the middle of the window in order to increase the chances that the eye tracker will retain an image of the eye even if the child slouches, straightens or sways during testing.",
    "Once properly positioned, the experimenter should begin the calibration procedure. As young children with ASD may be unable or unwilling to follow verbal instructions to look to specific locations on the screen (as is typical for many calibration sequences), the use of dynamic stimuli, accompanied by sound, may more effectively capture attention and thus result in more accurate gaze data. Typically, a 5-point sequence is brief enough to retain the child's attention while also providing an accurate calibration. Eye-tracking studies with infants often employ just a 2-point calibration while a 9-point calibration is typical for investigations with adolescents and adults.\nExperimenters may maximize the child's visual attention to the display during testing by designing a concise and compelling task that has minimal task demands (e.g., a passive viewing task). Further, including an inter-stimulus animation with an accompanying sound effect (perhaps similar to those used during the calibration sequence) can help redirect attention to the display for children whose attention has lapsed. Additionally, positioning this inter-stimulus animation in a predefined location can ensure that all visual scanning patterns begin in the same spot for all participants.\nIf the research task is lengthy, the experimenter may use this inter-stimulus animation as an \"anchor\" to determine if calibration drift is occurring. Typically, if drift exceeds 3 degrees of visual angle, re-calibration should be administered. Additionally, if multiple tasks or trials are included, re-calibration is recommended between each one to eliminate drift over the course of testing.\n4. Analysis",
    "Most eye-tracking systems yield raw data files that include, at a minimum, a timestamp, X and Y coordinates of the point of regard (sometimes for both eyes), the distance from the display or stimulus, along with an index that characterizes an event or change in stimulus presentation. Some software programs also yield information about pupil diameter and fixation metrics.\nHow one chooses to condense the vast amount of raw data is determined by the research question. Most often the goal is to characterize metrics of fixation density and/or oculomotor dynamics. However, once these constructs are characterized, superordinate constructs such as attention and memory can be examined under specific design conditions.\nFixation Density: While many different algorithms exist that characterize fixation density15, all analyze two primary components: temporal and spatial information. For example, a fixation can be defined as the point of regard remaining within a diameter of 1° of visual angle for at least 100 milliseconds, though these parameters are often anchored by the research question. Common dependent variables include number of fixations, average duration of fixation, and total fixation time, and the spatial arrangement and/or sequence of individual fixations (i.e., scan paths)16.\nFixation analyses are often conducted within predefined \"Areas of Interest\" (AOI). Researchers may be interested in whether children with and without ASD differ in their fixation time to specific AOIs (such as the eyes on a face), their latency to first fixate AOIs, or in the patterns of their gaze shifts between AOIs. Additionally, the metrics listed in 4.3 can also be applied to AOI analyses.",
    "Children with ASD, particularly those with impairments in sustaining attention, often exhibit more missing gaze data than controls. This may occur due less visual attention to onscreen stimuli or by excessive blinking (sometimes produced by an overly bright display or a too dark testing environment). To control for missing data differences between groups, researchers may want to conduct analysis as a proportion of gaze time onscreen instead of in absolute values that can be confounded by missing data. Further, in order to protect against unreliable data caused by insufficient sampling, researchers should require that all participants who are included in the final sample pass a \"minimum time\" cut off. The specificity of this cut off will vary by study, but in general participants with more missing than recorded data should be considered suspect.\nIn contrast to fixation analysis, velocity-based algorithms incorporate the change in Euclidean distance between subsequent recordings and focus primarily on saccades. A saccade is indicated when the velocity (distance/time) exceeds a certain threshold. If concurrent recordings do not exceed this velocity threshold for a specified period of time, a fixation is indicated.",
    "Oculomotor Dynamics: Characterizing oculomotor dynamics requires a high sampling eye-tracking system that is sufficiently sensitive to subtle changes in eye position and eye movement. Although many dependent variables can be investigated within the scope of oculomotor dynamics including saccades, ocular drift, and pursuit, all indices rest upon the velocity of eye movement. Characterizing this velocity is based on two properties (i.e., distance and time) and thus allows for the examination of other properties of oculomotor dynamics, including the distribution or pattern of saccade velocities, the distribution or pattern of saccade amplitude, the distribution or pattern of saccade duration, as well as the latency of saccade and accuracy of saccade termination (i.e., gain). Common paradigms include visually guided saccade tasks, antisaccade tasks, memory guided saccade tasks, and predictive saccade tasks.7, 17 The extant literature contains a large body of research on saccade dynamics that could benefit interested researchers18-20.\n5. Representative Results\nimgsrc://cloudfront.jove.com/files/ftp_upload/3675/3675fig3.jpg\nFigure 3.  Figure 3 represents a fixation map generated in research by our group. Shown here are the individual fixations, depicted by purple circles, by a single child with ASD while viewing a static image. Fixations from this and similar tasks are analyzed across participants to determine if children with and without ASD differ in their visual attention to various AOIs.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3675/3675fig4.jpg",
    "Figure 4. Figure 4 represents an example of a final product that includes many of the steps described above, including: 1) applying a fixation filter to raw gaze data, 2) assigning fixations to specific AOIs, and 3) condensing and comparing patterns of fixations across a group of typically developing (TD) children and a group of children with ASD. More specifically, this figure demonstrates that within a visual exploration paradigm, children with ASD explore (i.e., fixate) fewer social images TD children when \"High Autism Interest\" (HAI) objects are concurrently displayed. When \"Low Autism Interest\" (LAI) objects are presented with social stimuli, however, exploration of social images does not differ significantly between groups, suggesting that social attention in ASD is modulated based upon the relative salience of competing stimuli.21"
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}