{
  "id": 1744,
  "origin_website": "Cell",
  "title": "Analyzing causal relationships in proteomic profiles using CausalPath",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nFormat data\nTiming: 1 h\nThe code below will run quickly (< 1 min). Modification of the R code for particular user datasets is likely to be more time-consuming.\nThe code can be run in R with the command:\nsource(\"phospho_mass_spec_data_extract.R\")\nCritical: The purpose of this step is to produce input files in the format as described in the “Data Format” section. Users are free to choose alternative methods for conducting this step; see “Alternatives.” This step is not necessary if your source data is already formatted for CausalPath.\nAlternatives: The data reformatting step can be done in many different ways. This protocol uses the R environment as an example. Users are encouraged to format source data in the CausalPath input format in the manner they are most comfortable whether it be through the use of any programming language or an alternative file editing method they prefer.\nCritical: The R code and input Excel spreadsheet must be in the same directory.\nCritical: Reformatted data will be produced in the file “data_causalpath.txt”. Modifications to the code should result in a data file with a data format as described above.\nAlternatives: The provided R code converts one of the sheets (named “Cond #2 TiO2 Brief\") in the original xlsx file. An alternative is to include multiple sheets in the same conversion for more complete analysis.\nAdjust parameters\nTiming:  <15 min\nMake modifications to the “parameters.txt” as necessary\nModify, add, or remove parameters in the “parameters.txt” file while keeping the format of each line as “parameter-name = parameter-value”\nproteomics-values-file = data_causalpath.txt\nid-column = ID\nsymbols-column = Symbols\nsites-column = Sites\neffect-column = Effect\nvalue-transformation = signed-p-values\nvalue-column = SignedP\nthreshold-for-data-significance = 0.1 phosphoprotein\ncolor-saturation-value = 10\ncalculate-network-significance = true\npermutations-for-significance = 10000\nfdr-threshold-for-network-significance = 0.1\nuse-network-significance-for-causal-reasoning = true",
    "show-all-genes-with-proteomic-data = false\ngene-activity = GP6 a\nNote: Users reproducing this protocol do not need to make modifications to the parameters.txt above.\nNote: Pre-formatted data and configuration files, as well as result files, are at this link (zenodo.org/record/5311589[href=http://zenodo.org/record/5311589]).\nRun CausalPath\nTiming: 1 h\nRun the CausalPath algorithm\nEnsure that the \"causalpath.jar\", \"data_causalpath.txt\", and \"parameters.txt\" files are organized in the directory structure as shown below.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1199-Fx4.jpg\nNote: For a single analysis, both the input files data file (e.g., “data_causalpath.txt”) and configuration file (i.e., “parameters.txt”) can be put in a directory by themselves, as shown above. For multiple analyses of the same data, the data can be placed in the parent directory and reused for the different analyses.\nNote: Results will be produced in the same directory as the “parameters.txt” file.\nRun the CausalPath analysis from a command line terminal\njava -jar causalpath.jar gpvi_mass_spec\nNote: Results will be produced in the same directory as the input files. The directory structure of a successful CausalPath run will appear as follows:\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1199-Fx5.jpg\nDescription of all possible output files is available on the project site (github.com/PathwayAndDataAnalysis/causalpath/blob/master/wiki/OutputFiles.md[href=http://github.com/PathwayAndDataAnalysis/causalpath/blob/master/wiki/OutputFiles.md]). The principal files are as follows:\ncausative.sif: A Simple Interaction Format (SIF) network representation for identified causal relations is visualized. Used by Newt and ChiBE visualization.\ncausative.format: This file complements causative.sif and provides styling (e.g., color information) for the SIF. Used by Newt and ChiBE visualization.\ncausative.json: Result network in JSON format, used by the webserver for visualization.\nresults.txt: Details of each inference made by the algorithm. This file is useful when further computation is planned on the CausalPath results.\nVisualize phosphoproteomic network using causalpath.org\nTiming:  <15 min\nCausalPath results can be visualized and explored using the project website (causalpath.org[href=http://causalpath.org]).\nOn causalpath.org[href=http://causalpath.org], click “Visualize results from previous analysis”",
    "Select the folder containing the result files (see the “Run CausalPath” section for details) or a parent folder that contains multiple result folders. Figure 1[href=https://www.wicell.org#fig1] visualizes the output of CausalPath.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1199-Fig1.jpg\nFigure 1. CausalPath output\n(A) Resulting causal network.\n(B) Legend for graph notation for causal explanations; see (Babur et al., 2021[href=https://www.wicell.org#bib5]) for a detailed explanation.\n(C) Render comparison of CausalPath output using alternative tools.\nCritical: A folder must be selected and not individual files\nAccept the browser request to upload files if prompted\nOnce the upload completes and the visualization page loads, the next step is to double-click the folder name from the left-hand sidebar\nNote: Users can click the “Show legend” button for a guide to the visualization.\nNote: Users can drag nodes to reposition them and click on phosphorylation sites to learn their positions.\nOptional: The complexity of large networks is managed (i.e., simplified) through the “Topology grouping” feature. “Topology grouping” groups nodes that have the same graph topology. This feature can be turned off by clicking the “Topology grouping” checkbox.\n(Alternative) visualize results using the Newt pathway editor\nTiming:  <15 min\nCausalPath results can alternatively be visualized and explored using the Newt Pathway Viewer & Editor (web.newteditor.org[href=http://web.newteditor.org]) (Balci et al., 2020[href=https://www.wicell.org#bib6]).\nClick File → Import → SIF then select the “causative.sif” to import the network\nClick File → Import → SIF Style the select the “causative.format” to import the network colorization\nOptional: “Topology grouping” can be turned on to simplify large networks. This is done by clicking the “Map” tab on the right-hand sidebar then clicking the “Enable Topology Grouping of SIF Nodes” checkbox.\nAlternatives: Users can also use ChiBE as a visualization tool and instructions are provided on the ChiBE project page (github.com/PathwayCommons/chibe[href=http://github.com/PathwayCommons/chibe]).",
    "Note: The text here summarized the three options for visualization of results; Figure 1[href=https://www.wicell.org#fig1]C shows a render comparison between the tools. The comments below may guide user decisions in selecting the best tool for their needs.\nThe CausalPath site\nProvides a legend to help explore the networks\nDoes not provide an image export feature; take a screenshot if needed\nVisualization is done as a client-side browser operation that does not require sending files to the server\nNewt/ChiBE\nExports high-resolution vector graphics useful for publication-quality images\nOnly requires the upload of resulting networks.\nChiBE\nCan be run locally\nRuns on Linux and Windows."
  ],
  "subjectAreas": [
    "Proteomics",
    "Bioinformatics",
    "Systems Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology"
  ]
}