{
  "id": 13745,
  "origin_website": "Jove",
  "title": "Kidney Regeneration in Adult Zebrafish by Gentamicin Induced Injury",
  "procedures": [
    "NOTE: Ethics Statement: All experiments were conducted in accordance with Massachusetts General Hospital guidelines for animal use in research.\n1. Advance Preparation\nDetermine how many adult zebrafish 6-12 months old to injure. Plan to injure 10-20% more fish than will be needed. In order to minimize variability, use age matched sibling fish reared together in the same tank so that they are roughly the same size and have less genetic variability. Female fish are much easier to inject compared to the male fish, due to the larger capacity of the abdomen. However, males and females give similar results.\nWhen doing the experiment for the first time, plot a dose curve to determine the appropriate gentamicin dosage for a specific strain of fish. Test each new batch of gentamicin before use in experiments since the purity of gentamicin varies from batch to batch. Proper dosage should be determined by assessing expression of injury markers such as lhx1a. (See Figure 1A-D).\nPrepare gentamicin solution. Gentamicin stock solution may be stored in -20 °C and thawed for later use. For example, for an 80 mg/kg dose (80 mg gentamicin/kg of bodyweight) in a fish weighing 0.5 g, prepare 2 mg/ml of gentamicin in phosphate buffered saline as a convenient working solution. This provides a 20 µl of gentamicin for intraperitoneal injection into the fish.\n\tNOTE: In general, 80-120 mg/kg achieve good results, but doses as low as 40 mg/kg may be appropriate. Gentamicin may also be purchased in solution to minimize hazardous exposure to lab personnel.\n\tNOTE: Gentamicin in high doses can be toxic. Wear gloves and mask when weighing powder.",
    "Prepare 100 ml of 0.016% tricaine water for anesthetizing fish. Prepare a 25x stock of tricaine (4 g/1 L) dissolved in sterile milliQ water adjust to pH 7 and store at 4 °C until use. Dilute 4 ml in 100 ml of fish water for a working concentration of 0.016%.\n\tNOTE: Tricaine is an anesthetic and skin irritant, wear gloves when handling.\nMake a fish scoop out of a plastic transfer pipet by cutting the bulb into a scoop shape and cutting 2 slots in the bottom to drain water. Load 1ml syringes (with 10 µl gradations) with the prepared gentamicin solution and attach a 30½ G needle. Remove any air bubbles. Twist the needle on the syringe to make sure that the angled tip on the needle is facing away and the syringe markings are facing forward and readable. For control injections, prepare a syringe and needle with sterile PBS.\nPrepare a scale with a clean surface or weigh boat as well as paper towels for drying fish and for holding fish for injection.\nPrepare individual small half-liter containers with lids for holding fish for observation overnight post injection. Small transparent plastic mating cages are useful for this purpose. These containers should NOT be white - ideally they should be clear so that the white epithelial casts shed by the fish can be observed on a black bench top. Fill each container with enough fish water for the fish to swim comfortably.\n2. Intraperitoneal Injection of Gentamicin\nAnesthetize the fish in 0.016% tricaine solution in fish water. Wait for the gill ventilation rate to slow and for the fish to no longer respond to touch.",
    "Scoop up the fish using the fish scoop, moving from head toward tail in order to avoid injuring the gills or fins. Place the fish on paper towels to absorb the excess water by turning the fish out gently on its side and shake off excess water from the scoop.\nScoop up the fish again and place it in the weigh boat on the zeroed scale and weigh the fish. Round to the nearest 0.25 g, and calculate the appropriate amount of gentamicin to inject.\n\tNOTE: For a 0.5 g fish use a 20 µl injection at 80 mg/kg dose.\nScoop up the fish again and place it on a dry folded paper towel. If injecting using the right hand, hold the paper towel in the left hand and place the fish’s head pointing left, with the belly easily accessible.\nHold the syringe with the needle at a 45° angle to the skin of the belly, anterior to the cloaca. Push the needle just under the skin, then decrease the angle and slide the needle forward under the skin, avoiding the internal organs. Depress the plunger the appropriate amount, pause to make sure no liquid is coming out around the needle, then withdraw the needle. If holding the fish steady is a problem, brace elbows against torso to stabilize them.\n\tNOTE: Wear gloves when handling gentamicin solution.\nDrop each fish into an individual container. Observe the fish and ensure its recovery from anesthesia. Keep fish at 28.5 °C overnight.\n\tNOTE: If the fish doesn’t revive immediately, use a plastic transfer pipet to irrigate water across its gills to revive it.\nUse the same syringe and needle when injecting multiple fish with the same dose of gentamicin. Dispose of the used syringe and needle into the appropriate biohazard sharps container.",
    "3. Post Injection Observation of Injury\nThe next day (1 day post injury), place the injected fish in its container on a dark surface. White casts of dead epithelial tissue excreted by the injured fish should be visible. (See Figure 1E-H). If there are no casts, either the fish was not injured by the gentamicin injection (either the dose was too low, or some of the gentamicin leaked during the injection process) or the fish was severely injured resulting in complete blockage of the ureters and cloaca with sloughed tissue.\n\tNOTE: If the fish is unable to clear the casts from its body it will usually die within 2-3 days and is therefore unusable for longer assays. If no casts are visible, euthanize the fish in tricaine water by immersing for at least 10 min after gill movement stops.\nIf white tissue casts are visible, set the fish aside and continue checking the other fish. An appropriate dose of gentamicin will result in 80-90% of the fish being usable. Pool the injured fish and then split them into different treatment groups if desired.\n4. Care of Recovering Fish\nKeep fish in clean water and uncrowded environment. Dirty water and crowding will lead to infections and unintended death. Try to keep no more than 6 fish/500 ml of fish water and change the water daily if possible.\n\tNOTE: This is a minimum volume for conservation of space or if the investigator wishes to perform experiments using expensive drug treatments.\nDo not feed the fish until 3 days post injury. Recovering fish will not eat at first, and any food in the tank will decompose and promote bacteria growth. Starting at 3 days post injury, feed a small amount once a day.\n5. Analysis of Injured Kidneys",
    "For in situ hybridization for lhx1a mRNA expression, kidneys can be harvested from fish at desired timepoints. Euthanize fish in tricaine water on ice at least 10 min until gill movement stops, then remove the head with a razor blade and open the body cavity and remove the internal organs with forceps.\nLeave the kidney in place (pigmented organ attached to the dorsal body wall) and fix the fish in 4% paraformaldehyde in PBS overnight. Dissect out the kidney15 and continue with standard in situ hybridization.\n\t\nBriefly, wash the kidneys in PBST (phosphate buffered saline 0.5%Tween 20), permeabilized with proteinase K in PBST (10 µg/ml) for 1 hr at room temperature. Post-fix with 4% paraformaldehyde, and washed again with PBST.\nThen pre-hybridize the kidneys overnight at 68 °C  in hybridization buffer (50% formamide, 5x SSC, 50 µg/ml heparin, 500 µg/ml tRNA, 0.1% Tween20, pH 6.0).\nIncubate the samples with digoxigenin labeled probe in hybridization buffer, then wash for 5-10 min each with 100%, 75%, 50%, 25% hybridization buffer at 68 °C, then moved to room temperature and wash twice for 30 min with 2x SSC with 0.1% Tween20, and wash twice for 30 min with 0.2x SSC with 0.1% Tween20.\nEquilibrate the sample 3x 5 min in MAB (0.1 M maleic acid, 0.15 M NaCl, pH 7.5) and blocked overnight at 4 °C in MAB with 10% goat serum. Then incubate samples overnight in anti-digoxigenin-AP Fab 1:5,000 in MAB.\nWash the sample 5x for 1 hr in MAB, and equilibrate 3x for 15 min in NTMT (0.1 M Tris pH9.5, 0.05 M MgCl2, 0.01 M NaCl, 50 µl Tween20).",
    "Then treat the kidneys with NBT/BCIP to detect signal. Fix the kidneys with 4% paraformaldehyde and incubated in dimethylformamide to remove excess NBT/BCIP, bleached overnight in deionized water. Wash the kidneys and then photograph in PBST with 50% glycerol under a coverslip.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}