{
  "id": 13045,
  "origin_website": "Jove",
  "title": "In Vitro Investigation of the Effects of the Hyaluronan-Rich Extracellular Matrix on Neural Crest Cell Migration",
  "procedures": [
    "All procedures were approved by the Animal Ethics Committee of the Osaka University Graduate School of Dentistry.\n1. Culture of mouse cranial neural crest cells\nNOTE: The neural crest cell line used in this study comprises O9-1 cells, originally derived from Wnt1-Cre; R26R-GFP-expressing cells isolated from E8.5 mouse embryos12 (see discussion). The method described here for culturing O9-1 cells follows a previously established protocol13.\nPrepare the basement membrane matrix-coated plate.\n\t\nThaw the basement membrane matrix (see Table of Materials) on ice. Dilute the matrix 1:50 in chilled 1x PBS, and keep on ice.\nCoat a 10 cm culture plate with 10 mL of the diluted basement-membrane matrix solution. Incubate the plate at room temperature for 1 h, and aspirate the matrix before use.\nWash the plate 3x with 2 mL of PBS.\nCulture O9-1 cells on the basement membrane matrix-coated plate.\n\t\nWarm the complete embryonic stem (ES) cell medium (see Table of Materials) in a water bath at 37 °C.\nGently mix the O9-1 cell suspension (see Table of Materials) and count the number of cells using an automated cell counter (see Table of Materials). Adjust the cell concentration to 1.1 × 106/mL with complete ES cell medium.\nAdd 8 mL of pre-warmed complete ES cell medium to the matrix-coated 10 cm culture plate, and seed the O9-1 cells at 1.1 x 106 cells/plate. Incubate at 37 °C in a 5% CO2 humidified incubator.\nThe next day, replace the medium with fresh complete ES cell medium (pre-warmed to 37 °C). Replace with fresh medium every 2-3 days thereafter.\n\t\tNOTE: When the cells are approximately 80% confluent (3-4 days after plating), they can be dissociated with 0.25% trypsin-EDTA and passaged further or frozen for later use. Representative images of O9-1 cells are shown in Figure 1.",
    "Wash the culture plate with 2 mL of 1x PBS prior to trypsinization. Add 2 mL of pre-warmed 0.25% trypsin-EDTA and incubate for 5 min at 37 °C. Check for complete cell detachment; gently tap the side of the plate a couple of times if necessary.\nAdd 2 mL of pre-warmed complete ES cell medium to the culture plate and transfer the dissociated cells to a 15 mL conical tube. Centrifuge the tube at 300 x g for 5 min.\nDiscard the supernatant without disturbing the cell pellet. Then, add 2 mL of pre-warmed complete ES cell medium to the tube, and thoroughly resuspend the cells by pipetting. Seed the cells on a new culture plate at the desired cell density.\nAlternatively, prepare a frozen cell stock by adding 1 mL of cell freezing medium containing 10% dimethyl sulfoxide (DMSO) to the tube in place of complete ES cell medium and thoroughly resuspending the cells. Transfer the cell suspension to cryo tubes, and store at −80 °C.\n2. Preparation of the HA/Col1-coated dish\nNOTE: The original method of coating HA/Col1 onto glass-bottom dishes was proposed by Irie et al.7.\nCarefully add 50 µL of undiluted triethoxysilane to a 3.5 cm glass-bottom dish (see Table of Materials). Incubate for 5 min at room temperature (RT) and protect from light.\n\tNOTE: The incubation with triethoxysilane should not exceed 5 min. This may affect the coating efficiency and produce undesirable products.\nWash the dish quickly 3x with 2 mL of distilled water. Add 50 µL of 0.25% glutaraldehyde, diluted 100x in PBS, per dish, and incubate at RT for 30 min.\nWash quickly 4x with 2 mL of PBS. Then, coat the dishes with 300 µL of collagen type I in 0.2 N acetic acid at RT for 1 h.",
    "Wash quickly 3x with 2 mL of PBS. Add 300 µL of 200 µg/mL fluoresceinamine-labeled sodium hyaluronate-H2 (FAHA-H2) (diluted in PBS) to each dish and incubate overnight at RT. Wash again 3x with 2 mL of PBS. After aspirating the PBS, air-dry the plate for 5 min on a clean bench.\n\t​NOTE: FAHA-H2 is a fluoresceinamine-labeled sodium hyaluronate with an average molecular weight ranging from 1,200-1,600 KDa. HA of an appropriate molecular weight can be used according to the research design.\n3. Migration assay on the HA/Col1-coated dish\nNOTE: A wound closure-based assay using defined 500 µm cell-free gaps in Col1/HA substrates was performed using 2-well culture inserts (see Table of Materials). The O9-1 cells express Tmem2, which is required for the adhesion and degradation of HA in the extracellular space9 (Figure 2 and Figure 3).\nAfter drying the coated glass-bottom dish, attach the 2-well culture inserts to the dishes, and fill the inserts externally with 1 mL of PBS.\nSeed the O9-1 cells into the wells at 1 x 104 cells in 100 µL of Dulbecco's modified Eagle medium (DMEM) containing 2% fetal bovine serum (FBS) per insert. Culture the cells for 2 days at 37 °C in a 5% CO2 humidified incubator.\nRemove the inserts carefully from the coated glass-bottom dishes with tweezers. Wash the coated glass-bottom dishes gently with 2 mL of 1x PBS to remove the cells and cell debris. Add 2 mL of fresh DMEM containing 2% FBS into the culture dishes.\nCapture phase-contrast images now as the starting time point using an all-in-one fluorescence microscope in monochrome mode with high-resolution settings (gain at 6 dB, no binning). Objective lenses with magnifications of 4x to 20x were used for imaging in this study (see Table of Materials).",
    "NOTE: Capture the phase-contrast images with the corresponding scale bars and save them in TIFF format.\nCulture the cells for an additional 48 h at 37 °C and 5% CO2. Capture phase-contrast images at 24 h and 48 h in culture using the all-in-one fluorescence microscope.\nFix the cells at 48 h with 1 mL of 4% paraformaldehyde (PFA) for 15 min at room temperature or overnight at 4 °C. Then, wash the dishes 3x for 5 min each with 1 mL of fresh PBS.\nPlace a coverslip with mounting medium (see Table of Materials) for further morphological observation.\n\tNOTE: The dishes can be imaged immediately or stored for up to 2 months at 4 °C.\nOptional: Immunolabel the cells for proteins of interest.\n\tNOTE: A protocol to detect the focal adhesion (FA) complex using a mouse-derived monoclonal anti-vinculin antibody (see Table of Materials) is described here as an example.\n\t\nIncubate the dishes (from step 3.6) with 0.5 mL of blocking buffer (5% normal goat serum in PBS) for 60 min.\n\t\tNOTE: Choose an appropriate blocking buffer for the primary antibody. A typical blocking buffer would be 5% normal serum from the same species as the secondary antibody used.\nPrepare the diluted primary antibody in antibody dilution buffer (1% normal goat serum in PBS). Incubate the dishes with 0.5 mL of diluted primary antibody overnight at 4 °C.\n\t\tNOTE: Choose the appropriate antibody dilution buffer. Typically, the antibody is used at a 1:50-1:200 dilution.\nRinse 3x for 5 min each with 2 mL of PBS. Prepare the diluted goat-derived anti-mouse secondary antibody in the antibody dilution buffer (1% normal goat serum in PBS). Incubate the dishes with 0.5 mL of diluted secondary antibody for 1-3 h at room temperature.",
    "NOTE: Typically, the secondary antibody is used at a 1:500-1:1,000 dilution. DAPI can be used for staining the nuclei.\nRinse 3x with 2 mL of PBS for 5 min each time. Place the coverslip with 50 µL of mounting medium.\n\t\tNOTE: The dishes can be imaged using the all-in-one fluorescence microscope with a GFP filter (excitation: 470/40, emission: 525/50) and a TexasRed filter (excitation: 560/40, emission: 630/75) in monochrome mode with high-resolution settings (gain at 6 dB, no binning). Objective lenses with magnifications of 4x to 20x were used for the imaging in this study.\n\t\t​NOTE: The slide can be stored for up to 2 months at 4 °C.\n4. Data analysis\nOpen the ImageJ 1.51s software. In the ImageJ window, select File > Open from the menu bar to open the saved image file.\nFor setting the measurement scale, draw a line of the same distance as the scale bar. Go to Analyze > Set scale and type the known distance and units of the line in the appropriate boxes of the Set scale window.\nDraw a straight line between the cell gap, and press Analyze > Measure to transfer the values to a data window. Measure at least five different positions in each sample, and average the distances to obtain the representative sample data. Perform the statistical analyses using appropriate software (see Table of Materials).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}