{
  "id": 4378,
  "origin_website": "Bio",
  "title": "Purification and TEM of Afp and Its Variants",
  "procedures": [
    "Note: Centrifugation steps were performed at 4 °C unless otherwise noted.    Afp purification protocol   A single inoculating bead (Protect Microorganism Preservation System) from the -80 °C stock of an appropriate Afp or its derivatives bearing E. coli strain is used to inoculate 3 ml of LB with the respective antibiotics.   The culture is incubated overnight at 37 °C with agitation at 250 rpm (overnight culture).   1 ml of the overnight culture is used to inoculate 50 ml of fresh LB with appropriate antibiotic/s.    The 50 ml of the cell culture is grown at 37 °C with agitation to an OD600 of 1.0. Note: OD600 measurements are taken from the cell cultures diluted with the LB media at ratios of 1:10. A cuvette with LB medium is used as a blank.   The cells are transferred into sterile falcon tubes (50 ml) and harvested by centrifugation at 2,268 x g for 10 min at room temperature.   The cell pellets are resuspended in fresh 50 ml 0.4x LB broth with respective antibiotic/s. Note: Initially 1 ml of the 0.4x LB broth is added to each pellet and the pellet is resuspended by vigorous taping on the tube. Then the tube is filled up to 50 ml with 0.4x LB broth and the content of the tube is transferred to the same 50 ml flask as the culture was grown. Antibiotics are added directly to the flask.    500 μl of steril filtered 20% arabinose (final concentration 0.2%) is added to each 50 ml culture to induce the protein expression. Note: After arabinose is added, avoid shaking the cultures.    The cultures are incubated for a further 24 h at 22 °C at 40 rpm.    The induced cells are harvested by centrifugation for 10 min at 2,268 x g.",
    "Note: Higher centrifugation speed (4,629 x g for 10 min) may be nessessary if pellet is too loose.    The pellet from each 50 ml culture is re-suspended at 4 °C in 0.8 ml pre-chilled TM buffer.   The resultant approximately 0.9 ml re-suspensions are transferred into 1.7 ml microcentrifuge tubes and subjected to three 20-sec rounds of sonication using a Sanyo Soniprep 150 Sonicator (18 Ω). At least 1 min of incubation on ice is included between sonication steps.   One μl (10 units) of the DNase is added and the sample is left at room temperature for 10 min.    Following the DNase incubation step the suspension is centrifuged at 16,000 x g for 10 min at 4 °C.   The pellets are discarded and clear supernatants containing soluble recombinant protein are filtered through 0.45-µm-pore-size filters.  Notes:    If the samples need to be stored for 1-2 days, 0.02% (final concentration) NaN3 is added to each tube.    Storage longer than 2 days was not tested; however for a better reproducibility it is recomended to proceed with the purification immediately after this step.     The resin is packed into a 1.5 x 50 cm (D x L) column according to the manufacturers’ instructions, resulting in a column bed 1.5 cm in diameter and 46 cm in height. Note: The SEC column can be reused.   The column is attached to the BioLogic LP System and equilibrated with 150-200 ml TBS at a flow rate of 2 ml/min.   Protein solution is then loaded and eluted in a 65 ml of buffer at 0.5 ml/min at room temperature. Elution of protein was monitored by absorbance at 280 nm with the typical OD280 values of 0.01-0.2. SEC protocol:  table:",
    "﻿0,1,2\nPeriod of time (min),Flow rate (ml/ min),Action\n0-40,0.5,Discard\n40-130,0.5,Collect 1.5 min per fraction (0.75 ml each fraction)\n130-200,0.5,Divert to waste",
    "The 1.5 ml fractions from the elution peak (approximately 75-90 min retention time) are collected and pooled as follows: fraction numbers 18-27 (pool I); 28-31 (pool II); 32-46 (pool III). Note: The pool II usually contains the Afp or its derivates with the least amount of cellular contaminants, while pool I and III contain less concentrated Afp particles with higher amounts of cellular contaminants. However, due to slight variations in column filling density, the fractions to be pooled have to be determined experimentally each time the column is repoured.    The pooled SEC fractions containing Afp or its derivatives are centrifuged at 151,139 x g for one hour and 10 min at 4 °C in a Beckman Optima TM L-100K ultracentrifuge (fixed angle). Notes:   It is helpful to label the outside of the tube where the pellet is likely to precipitate.    The tube after the centrifugation has to be handled very carefully. Proceed to the next step immediately after the ultracentrifugation step to avoid disturbance of the pellet.     After the centrifugation the supernatant is carefully removed using a pipette without disturbing the pellet but leaving approximatley 150-200 µl that was left enabbling the later resuspenssion of the pellet (Figure 1).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140510/20140510052452_8853.jpg Figure 1. Removing supernatant after ultracentrifugation. The supernatant is removed using a pipette; approximately 150-300 µl covering the invisible pellet is left behind.    The tube is incubated for 30-60 min at 22 °C at 40 rpm, tilted with the labelled side down (Figure 2) in order to gently solubilise the pellet.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140510/20140510052514_5849.jpg Figure 2. Gentle resuspension of the pellet. The tube is placed as shown in the figure and gently agitated for 30-60 min.    Following incubation, the often transparent retentate containing particles of interest is resuspended in residual buffer (usually approximately 150-200 μl) by pipetting up and down.",
    "The resuspended pellet is transferred to the 1.7 ml Eppendorf tube and centrifuged for 30 sec at 16,000 x g. The pellet is discarded and supernatant is transferred to a new eppendorf tube with 0.02% sodium azide (final concentration) added. This preparation is used for visualizing Afp particles or its variants using transmission electron microscopy or for other applications.  Note: Afp particles of approximately 70% purity can be purified using this method.      Negative staining and TEM of Afp and its variants   The grids are charged by using glow discharging following manufacturer’s instructions no longer than 15 min before applying a sample.   To visualise Afp and its variants, 3 μl of the re-suspended pellet is applied to a freshly glow-discharged plastic-coated 200-mesh grid.    The sample is allowed to settle for 60 sec.    Excess fluid is wicked off using Whatman #1 filter paper and then stained for 45 sec with a 0.7% filtered uranyl acetate (pH 5.0).  Note: 0.5-1.0% can also be used.   The grid is left to air dry on a filter paper for 5-15 min.   Grids are examined in a Morgagni 268D TEM at a nominal magnification of 70,000-180,000 operated at 80 KeV following manufacturer’s instructions. The images are captured using a Megapixel III digital camera. Several examples of the Afp images are shown in Figure 3.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140510/20140510052614_8322.jpg Figure 3. Examples of the uncropped Afp images taken at nominal magnifications 89,000 (A) and 110,000 (B)"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}