{
  "id": 10103,
  "origin_website": "Jove",
  "title": "Microfluidic Synthesis of Microgel Building Blocks for Microporous Annealed Particle Scaffold",
  "procedures": [
    "1. MethMAL annealing macromer synthesis\nNOTE: This protocol is specifically for modifying 1 g of PEG-maleimide but can be scaled up to make larger batches.\nAdd 1 g of 4-arm 20 kDa PEG-maleimide to 10 mL of 1x phosphate-buffered saline (PBS, pH 7.4) in a small glass beaker with a stir bar. Stir the solution at 300 rpm until the PEG is fully dissolved (~30 min).\nAdd 14.65 mg of 2-aminoethanethiol (0.67:1 thiol [SH] to maleimide [MAL] molar ratio) to the reaction with stirring at 300 rpm.\n\tNOTE: The thiol groups on 2-aminoethanethiol will be added to approximately three arms of the PEG-MAL via Michael-type addition, leaving amine end groups.\n\t\nObserve the following example calculation for the amount of 2-aminoethanethiol to add:\nimgsrc://cloudfront.jove.com/files/ftp_upload/64119/64119eq1v2.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/64119/64119eq2v2.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/64119/64119eq3v3.jpg\n\t\tNOTE: To avoid measuring a very small amount, dissolve 100 mg of 2-aminoethanethiol in 1 mL of 1x PBS (pH 7.4) and add 146.5 µL of that solution to the reaction.\nWait for 1 h and 10 min after step 1.2., then mix 160.1 mg of 4-(4,6-Dimethoxy-1,3,5-triazin-2-yl)-4-methylmorpholinium chloride (DMTMM, 12:1 molar ratio to PEG) and 32.77 µL of methacrylic acid (8:1 molar ratio to PEG) in 5 mL of 1x PBS (pH 7.4) in a new glass beaker and react for 50 min with stirring at 300 rpm.\n\tNOTE: At this step, the methacrylic acid reacts with DMTMM to form a highly reactive ester that can then be coupled to the available amine groups on the PEG.\n\t\nObserve the following example calculation for calculating the amount of DMTMM to add:\nimgsrc://cloudfront.jove.com/files/ftp_upload/64119/64119eq4v2.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/64119/64119eq05.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/64119/64119eq06.jpg\nObserve the following example calculation for calculating the amount of methacrylic acid to add:\nimgsrc://cloudfront.jove.com/files/ftp_upload/64119/64119eq4v2.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/64119/64119eq07.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/64119/64119eq08.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/64119/64119eq09.jpg\nAdd the methacrylic acid/DMTMM solution to the beaker with the 20 kDa PEG-MAL/2-aminoethanethiol solution.",
    "Add 53.56 µL of triethylamine (1:1 molar ratio to methacrylic acid) to the beaker and allow to react overnight with stirring at 300 rpm. Cover the beaker with foil to prevent dust and other contaminants from entering the beaker.\n\t\nObserve the following example calculation for the amount of triethylamine to add:\nimgsrc://cloudfront.jove.com/files/ftp_upload/64119/64119eq10.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/64119/64119eq11.jpg\nTransfer the reaction to snakeskin dialysis tubing (molecular weight cut-off: 3,500 Da).\nPlace the dialysis tubing in a large beaker with 1 M NaCl in deionized (DI) water (volume should cover tubing entirely) for 3 days with stirring at 300 rpm. Change the 1 M NaCl solution 2x daily for a total of six washes.\nDialyze for 6 h in DI water. Change the DI water each hour for a total of six washes.\nTransfer the reaction to a 50 mL conical tube and freeze at −80 °C.\nLyophilize the tube for at least 72 h at a start temperature of −70 °C and a temperature ramp of 0.01 °C/min until 0 °C.\nPrepare the sample for 1H-NMR by dissolving 25 mg of MethMAL in 700 µL of chloroform-d and transfer to an NMR tube.\nAcquire the 1H-NMR spectra.\n\tNOTE: The spectra in this protocol were acquired using a 500 MHz spectrometer with the following parameters: sweep width = 6,467.3 Hz, time delay = 13.1 s, acquisition time = 5.1 s, pulse time = 5.1 µs, and number of scans = 8.\nFor analysis, integrate the maleimide peak as a reference (~6.76 ppm) and then integrate the two methacrylamide peaks (~5.35 ppm and 5.6 ppm). Divide the ratio of the methacrylamide peak areas by the total area of all three peaks to obtain the percentage of arms modified with methacrylamide.",
    "NOTE: An acceptable modification is 67%-75% methacrylamide functional group substitution. An example 1H-NMR spectrum for MethMAL is shown in Figure 1.\n\t\nUse equation (1) as the degree of substitution equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/64119/64119eq12.jpg   (1)\nimgsrc://cloudfront.jove.com/files/ftp_upload/64119/64119fig01.jpg\nFigure 1: Chemical structure and 1H-NMR spectrum of MethMAL. (A) Chemical structure: the MethMAL annealing macromer is composed of 20 kDa 4-arm poly(ethylene glycol) modified with three methacrylamide arms. (B) This structure generates peaks at 5.36 ppm (3) and 5.76 ppm (2) not present in PEG-MAL spectra, and one maleimide arm, which generates a peak at 6.71 ppm (1). The solvent, chloroform, generated a peak at 7.26 ppm, and residual water in this sample generated a peak at 2.2 ppm (labeled on spectra). In the MethMAL spectra, the maleimide peak had an integrated area of 0.27, and the sum of the methacrylamide peaks areas was 0.73 (0.37 + 0.36). The methacrylamide percentage modification was 73% (0.73/(0.27 + 0.73)). This figure is from Pfaff et al.14. Copyright (2021) American Chemical Society. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64119/64119fig01large.jpg]\n2. Microgel precursor gelation kinetics\nNOTE: Gelation time can be modified by adjusting the pH of the buffer used to dissolve the gel precursor components. For PEG-maleimide hydrogels, a more acidic pH typically corresponds to slower gelation time since the thiolate concentration is decreased at lower pH15.\nPredetermine the desired concentrations of polymer, crosslinker, and other gel precursor components (i.e., peptides, glycosaminoglycans). Dissolve the PEG-MAL, RGD, and MethMAL (PEG-backbone) in 10x PBS (pH 1.5) and the MMP-2 crosslinker in 1x PBS (pH 7.4).\n\tNOTE: In this protocol, the gel precursor solution is a published formulation3, which consists of 45.88 mg/mL 4-arm PEG-MAL (10 kDa), 0.82 mg/mL RGD, 8.06 mg/mL MethMAL, and 4.62 mg/mL MMP-2 crosslinker (enzymatically degradable crosslinker).",
    "Prepare a viscometer, or an equivalent instrument, to monitor storage and loss moduli using a gap size of 0.4 mm, a shear strain of 1.0, a frequency of 1.0 Hz, and a duration of 10,800 s.\n\t\nAttach a 35 mm plate rotor (P35/Ti) geometry. Use a humidified chamber or a damp sponge around the geometry to maintain a humidified environment.\nMix the PEG-backbone and MMP-crosslinker in a 1:1 volumetric ratio.\nPipette 400 µL of the gel precursor solution onto the center of the viscometer stage.\nSlowly lower the geometry onto the stage until it reaches the predetermined gap size of 0.4 mm and immediately begin monitoring storage (G') and loss (G'') moduli for up to 6 h at room temperature.\n\t\tNOTE: Gelation is considered to begin when the storage modulus becomes greater than the loss modulus, and gelation is considered complete when the storage modulus plateaus. A representative gelation kinetics curve is shown in Figure 2.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64119/64119fig02.jpg\nFigure 2: Representative curve of gelation kinetics of an MAP gel precursor solution (pH 4.5) determined by a viscometer. Gelation begins at the rapid increase in storage (G') modulus, and gelation completes when the G' curve plateaus. G'' indicates the loss modulus. This figure is from Pruett et al.3. Copyright (2021) Wiley-VCH GmBH. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64119/64119fig02large.jpg]\n3. Microfluidic device fabrication\nNOTE: This protocol describes device fabrication of a microfluidic step-emulsification device design adapted from de Rutte et al.13, which can be seen in Figure 3A. However, this protocol can be used with any device design that is etched into a SU-8 wafer. It is recommended to outsource the SU-8 silicon wafer master fabrication, unless the appropriate cleanroom facilities are available for fabrication.\nCreate the first polydimethylsiloxane (PDMS) microfluidic device from an SU-8 wafer photomask.",
    "Prepare ~200 g of PDMS by mixing the base and curing agent in a 10:1 w/w ratio (see the Table of Materials).\nPlace the SU-8 wafer in a culture dish (tape the edges of the wafer to the dish), with the microfluidic design facing up.\nPour PDMS into the dish to create a 1-1.5 cm thick layer over the wafer. Place the dish under vacuum to remove any bubbles.\nLet the PDMS cure until solidified (24 h at room temperature or ~2 h at 60 °C).\nOnce the PDMS has cured, carefully use a razor blade or a scalpel to cut a rectangle through the PDMS, such that there is a 0.5-1 cm margin around the design on the wafer.\n\t\tNOTE: Do not use too much pressure and be very gentle to avoid damaging (e.g., cracking, scratching) the wafer.\nWedge a spatula into one of the cuts and slide it along the cuts to separate the PDMS from the wafer.\n\t\tNOTE: As the PDMS separates from the wafer, an air bubble will begin to form under the PDMS (refer to Figure 3B).\nUse the spatula to gently lift the rectangle of PDMS out of the dish.\n\t\tNOTE: The resultant gap in the PDMS above the wafer will be the mold for the microfluidic devices.\nCreate subsequent PDMS microfluidic devices from the SU-8 wafer photomask.\n\t\nPrepare ~15-20 g of PDMS per mold by mixing the base and curing agent in a 10:1 ratio.\nPour PDMS into the rectangular gap in the mold to create a 5 mm layer of PDMS above the wafer. Put the mold under vacuum to remove any bubbles.\nLet the PDMS cure until fully solidified (24 h at room temperature or 2 h at 60 °C).",
    "Once the PDMS has cured, use a razor blade or a scalpel to cut the PDMS around the edges of the rectangle.\n\t\tNOTE: Do not use too much pressure and be very gentle to avoid damaging (i.e., cracking) the wafer.\nWedge a spatula into one of the cuts and slide it along the cuts to separate the PDMS from the wafer.\n\t\tNOTE: As the PDMS separates from the wafer, an air bubble will begin to form under the PDMS.\nUse a 1.5 mm biopsy punch to create holes through the PDMS rectangle at the two inlets and outlet (refer to Figure 3B).\nIf there are multiple devices on a single wafer, use a spatula or razor blade to lightly score the PDMS between each device, then gently fold the PDMS along the scored lines so that the PDMS separates very cleanly on its own.\nStore the PDMS devices in a dust-free container.\nBond the PDMS microfluidic devices to glass slides.\n\t\nPrepare one glass slide per PDMS microfluidic device. Use tape, filtered air, or isopropyl alcohol (IPA) washes to remove any dust from the slide. Make sure the slides are completely dry before moving on to the next step.\nPlace a glass slide and a PDMS device, design-side up, next to each other on a small plastic tray (a 96-well plate lid works well for this) and place it in a plasma cleaner. Close the door and air-flow valve and turn on the vacuum pump. Let it run for at least 30 s, then turn it off.\nConnect the oxygen tank gas tube to the air-flow valve. Let the plasma chamber fill with oxygen for 30 s, then turn off the oxygen, and close the air-flow valve.",
    "Turn the vacuum pump on and set the radiofrequency (RF) level to high. Wait until the chamber turns a violet-pink color (refer to Figure 3B). Allow 30 s to pass.\nWhen the timer goes off, turn off the plasma and vacuum. Then, slowly open the air-flow valve to release the vacuum. Remove the tray from the plasma cleaner.\nGently flip the PDMS device onto the glass slide to bond them. As bonding happens, observe the slight difference in the transparency of the PDMS.\n\t\tNOTE: For the best results, store the bonded devices at 60 °C until immediately before use.\nSurface-treating the PDMS microfluidic devices\n\t\nPrepare the surface treatment by diluting PFOCTS (trichloro(1H,1H,2H,2H-perfluorooctyl)silane) in Novec oil (1:50). Use 1 mL for 3-4 devices. Transfer the volume to a 1 mL syringe and attach a 25 G needle.\n\t\tNOTE: The needles used in this protocol are beveled, so take care when handling sharps. Blunt needles can also be used if desired.\nCut a 10-12 cm piece of Tygon tubing per device that will be treated.\nCut a piece of PEEK tubing, ~7 cm in length. Insert a couple of millimeters of the PEEK tubing into the end of Tygon tubing, as shown in Figure 4A, to help prevent the needle from puncturing the Tygon tubing inlets.\nTake the device(s) out of the heated chamber and insert the non-PEEK end of the Tygon tubing into the aqueous inlet hole.\nInsert the needle of the surface treatment syringe into the PEEK tubing and cover the oil chamber outlet hole (refer to Figure 3B).",
    "Inject the treatment into the device slowly and ensure that it fills the device, without bubbles. Wait for the aqueous chambers to fill first, followed by the smaller channels, and then the oil chamber. Remove the Tygon tubing from the device. Once the device has been filled, let it rest for 10 min at room temperature.\nFill a 5 mL syringe with oil only (no silane) and attach a 25 G needle.\nAspirate the surface treatment out of the device through the inlets and outlet. Insert Tygon tubing into the aqueous inlet, insert the syringe with oil into the PEEK tubing, and flush each device with oil. Aspirate the oil out of the device.\nRepeat the oil flush 2x more. Remove the Tygon tubing.\n\t\tNOTE: The device is ready to be used.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64119/64119fig03.jpg\nFigure 3: Microfluidic PDMS device. (A) Computer-assisted design (AutoCAD) drawing of microfluidic device design. Microgel droplet formation occurs in the channels on either side of the oil channel, as seen in the magnified outcropping. (B) Overview of PDMS device fabrication. Abbreviation: PDMS = polydimethylsiloxane. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64119/64119fig03large.jpg]\n4. Microfluidic generation of microgels\nPredetermine the desired concentrations of polymer, crosslinker, and other gel precursor components (i.e., peptides, glycosaminoglycans). Dissolve the PEG-MAL, RGD, and MethMAL (PEG-backbone) in 10x PBS (pH 1.5) and the MMP-2 crosslinker along with 5 µM of biotin-maleimide in 1x PBS (pH 7.4).\n\tNOTE: In this protocol, the gel precursor solution is a published formulation3 consisting of 45.88 mg/mL 4-arm PEG-MAL (10 kDa), 0.82 mg/mL RGD, 8.06 mg/mL MethMAL, and 4.62 mg/mL MMP-2 crosslinker (enzymatically degradable crosslinker). The methods outlined below will yield ~3 mL of microgels.",
    "Prepare 6 mL of surfactant solution by diluting the stock 5% FluoroSurfactant to at least 1% in Novec oil. Add this solution to a 10 mL syringe.\n\tNOTE: Fluorinated surfactant is immiscible with water, which allows it to be easily removed during the gel transition to the aqueous phase during the PBS washes in the purification step.\nCut three pieces of Tygon tubing that are an appropriate length for the syringe pump height.\nCut two pieces of PEEK tubing, ~1 inch in length. Insert a couple of millimeters of the PEEK tubing into the end of two pieces of Tygon tubing, as shown in Figure 4A, to help prevent the needle from puncturing the Tygon tubing inlets.\nInsert the non-PEEK end of the Tygon tubing into the inlets of the microfluidic devices. Insert the remaining piece of Tygon tubing (with no PEEK tubing on the end) into the microfluidic device outlet, as shown in Figure 4C.\nAdd at least 3 mL of oil to a 5 mL plastic syringe and attach it to a 25 G needle. Carefully insert the needle into the PEEK tubing on one of the Tygon inlets. Gently flush the tubing and device with oil. Collect the oil from the outlet in a conical tube. Repeat the oil flush on the other Tygon inlet.\nSet the syringe pumps to the desired flow rates.\n\tNOTE: This protocol uses 3 mL/h for the aqueous flow rate and 6 mL/h for the oil flow rate. It may be required to use two separate syringe pumps.\nConnect the syringe containing the surfactant to the oil inlet via a 25 G needle (refer to Figure 4A) and gently dispense enough oil to prime the tubing and the oil channel of the microfluidic device.",
    "Once the device and oil inlets have been set up, add 0.5 mL of oil to a new 5 mL syringe, which will contain the gel precursor. The purpose of this small amount of oil is to help flush the precursor solution through the microfuilidic device towards the end of the run.\nIn a conical tube, combine 1.5 mL of the PEG-backbone solution and 1.5 mL of the crosslinker solution. Vortex for 30 s and quickly transfer the combined gel precursor solution to the 5 mL syringe.\nConnect the syringe with the gel precursor solution to the aqueous inlet via a 25 G needle. Gently dispense enough solution to prime the tubing and the aqueous channel.\nClamp the syringes onto the respective syringe pumps and press run (refer to Figure 4B). Ensure that there is liquid flowing through both the aqueous and oil channels.\n\tNOTE: It is recommended to use a microscope to visualize microgel formation within the PDMS device.\nLook for particles of uniform size from the channels (refer to Figure 4D). Collect the microgels from the outlet in a conical tube.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64119/64119fig04.jpg\nFigure 4: Microfluidic setup. (A) Depiction of the method for connecting PEEK tubing (top) and Tygon tubing to a 25 G needle on a syringe (bottom). (B) Microfluidic setup with syringe pumps, tubing, device, and microscope. (C) Image of microfluidic device setup, with two inlets (aqueous and oil) and one outlet. (D) Schematic of the microfluidic device and representative brightfield image of expected microgel formation from the channels in a step-emulsification device. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64119/64119fig04large.jpg]\n5. Purification and sterilization of microgels",
    "Once gelation is complete (determined as time to storage modulus plateau in gelation kinetics characterization), use a pipette to carefully remove the oil phase from the bottom of the tube (refer to Figure 5). Deposit this into an appropriate waste container for fluorinated waste.\n\tNOTE: The gelation time can be accelerated by adding an organic soluble base to the collection tube (e.g., triethylamine), but it is important to note that the addition of a strong base may hydrolyze any unreacted maleimides. If it is desired to functionalize microgels through excess maleimides post gelation, skip the addition of triethylamine.\nAdd more oil into the microgel collection tube in a 1:1 ratio. Mix by gently inverting the collection tube. Do not vortex.\nLet the collection tube settle for ~5 min to allow the phases to separate. Look for the oil phase at the bottom and the aqueous phase (the microgels) on the top (refer to Figure 5).\nRepeat the oil washes at least 2x more.\nAdd more oil in a 1:1 ratio with the gel and add 1x PBS in a 4:1 PBS to gel ratio. Invert to mix several times. To separate the layers, centrifuge the tube at ~2,000 x g for ~30 s. Look for the oil phase at the bottom of the tube, gel in the middle, and PBS on top (refer to Figure 5).\nRemove the oil phase with a pipette and discard in a waste container.\n\tNOTE: Do not remove the PBS. Use a larger conical tube to continue washes if the original collection tube was 15 mL.",
    "Repeat oil and PBS washes 2x more. Look for the gel to transition from opaque to clear by the final wash, as shown in Figure 5, indicating that the surfactant was removed and the gel is in the PBS phase.\nRemove all oil. Do not remove PBS from the conical tube.\nIn a chemical fume hood, use a glass pipette to add hexanes to the tube at an equal volume to the PBS. Vortex the conical tube for 30 s or until mixed thoroughly. Centrifuge at 4,696 x g for 5 min.\nAfter separation, look for hexanes in the top layer, PBS in the middle, and gel at the bottom (refer to Figure 5). Remove the hexane layer and discard it in a container for organic waste. Aspirate the PBS.\nRepeat hexane and PBS washes at least 2x more or until the gel appears nearly translucent (refer to Figure 5). Wash the gel with PBS 1x more so any remaining hexanes are removed. Centrifuge at 4,696 x g for 5 min. Aspirate the PBS layer. Take care not to disturb the gel pellet.\n\t\nTo cap, or quench, any unreacted maleimides in the microgels, prepare a 100 mM solution of N-acetyl-L-cysteine in 1x PBS and add this solution to the gel. Place on a tube rotator at 37 °C overnight, followed by many washes with PBS to remove unreacted N-acetyl-L-cysteine.\nFor long-term storage (up to 1 year), resuspend the microgels in 70% IPA and store at 4 °C to help prevent the growth of bacteria on the microgels.",
    "To sterilize the microgels, add 70% IPA to the gel in a 4:1 v/v ratio in a biosafety hood. Vortex the tube for 30 s, then centrifuge at 4,696 × g for 5 min. Aspirate the IPA supernatant from the gel pellet in a biosafety hood. Perform 2x more IPA washes followed by 3x washes with sterile 1x PBS.\n\t\tNOTE: All IPA should be removed before using the gel with cells or animals.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64119/64119fig05.jpg\nFigure 5: Overview of the microgel purification procedure. Abbreviations: PBS = phosphate-buffered saline; IPA = isopropyl alcohol. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64119/64119fig05large.jpg]\n6. Microgel size characterization\nNOTE: It is recommended to allow microgel particles to equilibrate in 1x PBS overnight at 37 °C to swell to their final diameter before sizing.\nImage gel particles.\n\t\nSpin down the MAP gel at 4,696 × g for 5 min and aspirate the supernatant.\nUsing a positive displacement pipette, remove 5 µL of microgels from the gel pellet and dilute in 1 mL of PBS in a microcentrifuge tube (1:200 dilution). Adjust this dilution as needed.\n\t\tNOTE: During the formulation of the gel precursor solution, 5 µM of biotin-maleimide can be added and used as an alternative to labeling microgels with a fluorophore. In this case, a streptavidin-fluorophore can be added at a 1:300 dilution (from 1 mg/mL stock). Allow incubation with streptavidin for at least 15 min prior to imaging.\nUsing a positive displacement pipette, transfer 100 µL of the diluted microgels to the wells of a clear 96-well plate.\nUse a widefield or confocal microscope to visualize the microgels with a 10x objective. Acquire images of the microgels for analysis.\nSee Figure 6 for representative confocal images of microgels.\nSizing particles with ImageJ\n\t\nOpen the image files from the microscope in ImageJ.",
    "Select Analyze | Set Scale and set the image scale according to the microscope objective.\nSelect Image | Type | 8-bit.\nSelect Image | Adjust | Threshold and then select the \"Otsu\" auto-threshold option from the dropdown box.\nClick on Analyze | Set Measurements and select Feret's Diameter and limit to threshold.\nClick on Analyze | Analyze Particles and enter the area size range (in pixel^2) expected for the microgels (to exclude small debris from being analyzed). Change circularity to 0.75-1.00 and select Show | Outlines. Check Display Results and Exclude on Edges.\n\t\tNOTE: The circularity shape filter excludes microgels on the image border that may yield an inaccurate diameter measurement.\nRun the Analyze Particles module.\nWait for the output, which is the Feret's diameter of each particle, and export these results to a spreadsheet.\nIn this protocol, calculate the polydispersity index (PDI) to determine the heterogeneity in microgel size. Analyze at least 100 microgels to define a population: a PDI range of 1.00-1.05 defines a monodisperse population, and a PDI greater than 1.05 defines a polydisperse population. Use equation (2), equation (3), and equation (4) to calculate the PDI, as described below.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64119/64119eq13.jpg (2)\nimgsrc://cloudfront.jove.com/files/ftp_upload/64119/64119eq14.jpg (3)\nimgsrc://cloudfront.jove.com/files/ftp_upload/64119/64119eq15.jpg (4)\nimgsrc://cloudfront.jove.com/files/ftp_upload/64119/64119fig06.jpg",
    "Figure 6: Representative images of microgels. (A) Fluorescent confocal image of microgel population A, (B) image of thresholded microgels, and (C) particle outlines after ImageJ analysis. (D) Fluorescent confocal image of microgel population B and (E) transmitted light image of microgels (microgels are nearly translucent). (F) Depiction of representative results from the ImageJ analysis outlined in this protocol. Both microgel populations have relatively monodisperse PDIs. Both populations of microgels were synthesized with a 3 mL/h aqueous flow rate and a 6 mL/h oil flow rate. However, the difference in microgel size is due to differences in microfluidic device step size. For example, microgel population A was synthesized with a microfluidic device with a channel step size of 11 µm, and microgel population B was synthesized in a device with a step size of 40 µm. Scale bars = 100 µm. Abbreviation: PDI = polydispersity index. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64119/64119fig06large.jpg]\n7. Microporous annealed particle (MAP) scaffold annealing\nCreate a stock solution of 2 mM lithium phenyl-2,4,6-trimethylbenzoylphosphinate (LAP) in 1x PBS (pH 7.4).\nDilute the LAP stock solution to 0.2 mM in a volume of 1x PBS equivalent to the gel volume. If using the LAP photoinitiator for cell studies or animal studies, be sure to sterilize the solution before use.\nSpin down the MAP gel at 4,696 × g for 5 min and aspirate the supernatant.\nUsing a positive displacement pipette, transfer the desired volume of gel into a microcentrifuge tube.\nAdd 0.2 mM LAP to the gel in a 1:1 volumetric ratio (final LAP concentration is 0.1 mM).\nVortex the mixture and incubate for at least 15 min in the dark.\nCentrifuge the mixture at 18,000 × g for 5 min to pellet the gel.\nCarefully remove the supernatant from the gel pellet.",
    "Transfer the MAP gel to the target location with a positive displacement pipette.\nApply focused light (365 nm, 8.66mW/cm2) to the sample for 113 s to anneal the scaffold.\n\tNOTE: The annealing time of 113 s has been optimized as previously published for LAP concentration of 0.1 mM14, but additional optimization for different photoinitiator concentrations may be needed.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64119/64119fig07.jpg\nFigure 7: MAP scaffold annealing. (A) Schematic of MAP scaffold annealing. When exposed to a photoinitiator and light, the methacrylamide functional groups on the MethMAL macromer undergo a click photopolymerization reaction, which bonds the surfaces of the microgels together. (B) Depiction of a 3D rendering (Imaris) of a two-photon microscope image of MAP microgels (green) annealed together in a 3D puck shape, with dextran (red) in the pores. (C) Depiction of a 3D rendering (Imaris) of a two-photon microscope image showing the porosity of a MAP scaffold that has been perfused with fluorescent 70 kDa dextran (red). Scale bars = (B) 100 µm, (C) 70 µm. Abbreviations: MAP = microporous annealed particle; MethMAL = custom annealing macromer. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64119/64119fig07large.jpg]"
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}