{
  "id": 20009,
  "origin_website": "Wiley",
  "title": "Methods for Automated Single Cell Isolation and Sub-Cloning of Human Pluripotent Stem Cells",
  "procedures": [
    "The IsoCell platform aims to automate single cell seeding and clonal expansion while decreasing hands-on time and scaling the procedure down to a minimal use of consumables and resources. The miniature workflow is based on the formation of a grid between two immiscible fluids. The grid contains chambers that enable cell culture in less than 1 μl of volume. The IsoCell exploits the principle of a fluid-shaping technology (Soitu et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-bib-0013], 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-bib-0014]; Walsh et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-bib-0016]). Briefly, the IsoCell creates small-scale cell culture chambers on (optionally coated) polystyrene dishes using an aqueous phase (cell medium or substrate coating) and an immiscible liquid overlay (the fluorocarbon oil FC40STAR). This results in an array of 256 cell culture reservoirs that are completely separated from each other by the immiscible FC40STAR. The device applies a technology developed by Walsh and colleagues whereby grids are formed on top of a protein-coated surface of a cell culture dish, in a liquid phase overlaid with FC40STAR (Soitu et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-bib-0013]). The integrated liquid-handling system automates cell isolation, feeding, and harvesting. Single cell seeding follows a Poisson distribution, limiting the number of single-cell chambers to 94 per grid (256 chambers). In-chamber verification of single cells is performed on a standard bright-field microscope using a 40× or 100× magnification. The contents of the chambers are stable, do not mix, and can be manipulated without extra care. The FC40STAR layer on top of the chambers does not mix with the aqueous phase of the culture medium, allows gas exchange, prevents evaporation of such small volumes, and remains in place for the entire cloning workflow.\nThis protocol describes a workflow in which the IsoCell platform is applied to enable robust, efficient, cost-effective, and easy-to-handle hPSC clone isolation and expansion (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0002]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/87197fc2-e643-44a3-8c16-5fcd911df9e9/cpsc123-fig-0002-m.jpg</p>\nFigure 2",
    "Basic Protocol: IsoCell hPSC single cell isolation and clonal expansion. (A) Step-by-step flowchart showing automated hPSC single cell seeding and clone expansion using the IsoCell platform. Time points are defined in days (d) or minutes (min). (B) (1) IsoCell device, arrows point to the needles from the dispensing (DS) and the jetting system (JS); (2) adaptor for microscopy counting with chamber coordinates; and (3) pipetting aid for achieving very gentle FC40STAR filling of the plate. (C) Scheme of a 256-chamber grid generated in a 60-mm coated culture dish (upper part) and representative picture from a grid after selected chambers were filled up with medium (lower part). (D) Representative pictures showing chambers with single or multiple cells to be scored at day 0 (scale bar: 200 µm). On the right, different single cell morphologies that can be seen within 30 min after plating (scale bar: 50 µm). The graph shows single cell seeding efficiencies (mean ± SD, n = 4) for two different hiPSC lines. (E) Representative pictures of clone outgrowth at day 2 and 5 for two hiPSC clones (scale bar: 200 µm). Cloning efficiency (right) is calculated as relative to the number of chambers with single cells at day 0 (mean ± SD, n = 4). (F) Pictures showing examples for colony size in chambers at day 8 (left) and chambers after enzymatic dissociation and extraction (scale bars: 200 µm). (G) Troubleshooting: an example of grid formation failure is depicted on the left (scale bar = 2 mm). Inefficient harvesting due to short enzymatic treatment is shown on the right (scale bar: 200 µm).",
    "Cell3imager Duos was used for pictures in panel C, a Leica DMi8 microscope with phase contrast was used for pictures in panels D, E, F, and G, and an Olympus SZX16 stereomicroscope was used for grid pictures in panel G.",
    "NOTE: Special training on how to operate the instrument is recommended. Here we give an overview, but full details are beyond the scope of this protocol. Please contact the manufacturer for further information.\nMaterials\nFC40STAR (Iota Sciences, cat. no. SKU10040)\nDulbecco's phosphate-buffered saline without Ca2+ and Mg2+ (DPBS; e.g., ThermoFisher Scientific, cat. no. 10010023)\n70% ethanol (e.g., Carl Roth, cat. no. T913.3)\nhPSC culture (see relevant Current Protocols articles)\nStemFlex medium (ThermoFisher Scientific, cat. no. A3349401)\nCloneR (Stem Cell Technologies, cat. no. 05888; see Support Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0008] for use in medium preparation)\nCell culture−grade water (e.g., Corning, cat. no. 25-055-CM)\nTrypLE Select Enzyme (ThermoFisher Scientific, cat. no. 12563011)\nEssential 8 medium (ThermoFisher Scientific., cat. no. A1517001) or mTeSR (Stem Cell Technologies, cat. no. 85850)\nLaminar flow hood (e.g., Herasafe, ThermoFisher Scientific)\nIsoCell device (Iota Sciences)\n1.5-ml microcentrifuge tubes (e.g., Eppendorf, cat. no. 30120086)\nClone G kit-A—with tissue-culture treated 6-cm dishes (Iota Sciences, cat. no. SKU 10030)\nP1000 repeat pipettor\n200- and 1000-µl pipette tips (e.g., Eppendorf, cat. no. 3123000055 and 3123000063)\n200- and 1250-µl pipette tips (e.g., Biozyme, cat. no. 770200 and 770600)\n5- and 10-ml serological pipettes (e.g., Corning, cat. no. 357543 and 357551)\nInverted microscope with phase-contrast optics, 4×, 10×, and 20× objectives (e.g., DMi8, Leica)\nCell culture incubator (e.g., Binder)\nGeltrex-coated 96-well tissue-culture plates (prepared as described in Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0004])\nAdditional reagents and equipment for laminin coating of dishes (Support Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0007]), preparing single cell suspension of hPSCs (Support Protocol 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0010]), preparation of medium containing anti-apoptotic small molecules (Support Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0008]), and subculture and expansion of hPSC clones (Support Protocol 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0011])\nGrid preparation and single cell seeding (day 0)\nInitialize IsoCell device\n1. Check FC40STAR level in the reserve bottle on the back of the device.",
    "FC40STAR level of the reservoir can be manually adjusted from the main display of the instrument (“more” > “FC40STAR levels”). The instrument will then estimate the amount of FC40STAR remaining for further operations and give an alert when the level may be too low. FC40STAR bottle level is an estimation; therefore, it is important to verify it before starting any process.\n2. Power on the IsoCell device.\n3. Run the start-up routine by following the wizard on the display. 1.5-ml tubes containing sterile water, 70% ethanol, DPBS, and StemFlex medium must be prepared in advance and placed in the corresponding spots in the IsoCell tube rack.\n4. If necessary, replace the dispenser needle: from the menu choose “more” > “replace dispenser,” then follow the instructions (Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0002]).\nThe dispenser needle must be changed at least every time a new Clone G kit-A is used.\n5. Switch the heater on: from the menu choose “Settings” > “Options” > “heater on.”\nPrepare grid using FC40STAR\n6. Coat the necessary number of 6-cm culture dishes provided in the Clone G kit-A with laminin 521 as described in Support Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0007].\n7. Carefully remove the coating solution from the 6-cm dish using a P1000 repeat pipettor with a 1000-µl pipette tip.\n8. Very carefully add 1 ml of StemFlex medium by placing the pipette at the side wall of the dish and releasing the medium very slowly.\n9. Remove the washing medium using the P1000 repeat pipettor with a 1000-µl tip.\n10. Repeat step 3, avoiding any bubble formation, and incubate at room temperature for 5-10 min.\n11. Remove the StemFlex medium from the dish carefully using the P1000 repeat pipettor with a 1000-µl tip.",
    "12. Place the pipetting aid accessory on top of the culture dish and dispense 2 ml FC40STAR into the center (Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0002]).\nThis procedure ensures that FC40STAR covers the surface of the dish slowly and without bubble formation. The procedure can be performed without the pipetting aid accessory using a P1000 pipet and slowly pipetting FC40STAR against the side walls of the dish.\n13. Proceed immediately to grid preparation on the IsoCell instrument: from the menu choose “isolate” > “Grid,” then follow the wizard. A grid with 256 chambers can be seen on the dish (Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0002] and C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0002]).\nPrepared grids should be used within the same day on which they are generated.\nSingle cell seeding and scoring\n14. Prepare an hPSC single cell suspension by following Support Protocol 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0010].\n15. Re-suspend hPSCs in StemFlex supplemented with CloneR (preparation described in Support Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0008], i.e., 1:20 dilution) with a concentration of 10,000 cells/ml.\nThe concentration of the cell suspension can be adjusted within a range of 5-10000 cells/ml to achieve optimal numbers of single-cell chambers; see Troubleshooting.\n16. Place 0.5-1 ml of cell the suspension in a 1.5-ml tube, resuspend, and place the tube in the IsoCell rack in position that is depicted by the wizard.\nImmediately start the single cell dispensing to avoid cell sedimentation!\n17. Perform single cell seeding with the IsoCell device: from the menu choose “Isolate,” and follow the instructions.\nThe IsoCell device will proceed with deposition of ∼200 nl cell suspension per microchamber\n18. Scoring: Immediately or at least within 10-20 min after seeding, visually identify and record chambers containing single cells using an inverted microscope (10× objective recommended) and the microscope plate adapter provided by Iota Sciences (Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0002] and D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0002]).",
    "Adjusting the focal plane up and down allows identification of the chamber or the coordinate of the chamber printed on the plate adapter. The focal plane of the chamber walls is roughly the same as that of the cells.\nIt is important to quantify single cell chambers within 30 min of dispensing, when cells are not fully attached and have a round shape and the cell borders appear bright due to their refraction. 30 min to 1 hr after dispensing, mitotic events can occur and become false negative as duplets.\nThe GRID is limited to around 94 single-cell chambers out of 256 due to Poisson distribution. With the protocol described here, ∼60-80 chambers containing a single cell were achieved. Variations can occur depending on the cell preparation, counting method, and the experience of the operator (Fig. 2D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0002]).\n19. Place the dish in the incubator at 37°C in a humidified environment, preferably under hypoxic conditions (5% O2, 5% CO2) for 24 hr.\nhPSC cultures are preferably maintained in hypoxic conditions to avoid spontaneous differentiation.\n20. Data input in IsoCell (single cell containing-well coordinates): First, create the experiment: from the menu choose “More” > “add dish” (name the experiment). Second, register the chambers containing a single cell: from the menu choose “Isolate” > “input data,” then select coordinates and save. This allows the IsoCell to automate feeding and harvesting of only the relevant chambers during the subsequent workflow.\n21. Shut down the IsoCell device by following the device wizard for shut-down routine.\nClonal culture maintenance in IsoCell chambers (d1 to ∼d10)\n22. Initialize IsoCell instrument as described in step 1.",
    "23. On day 1 after single cell seeding, perform the fill up routine for the wells registered with a single cell. Follow the wizard: “Culture” > “Fill,” then select the dish. Use StemFlex medium supplemented with CloneR.\nThis procedure will add 600 nl of medium to each chamber containing a single cell that has been plated in 200 nl of medium. The resulting volume in one chamber is about\n800 nl (Fig. 2C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0002]). Evaporation of the medium is prevented due to the FC40STAR layer on top.\n24. On day 3 and day 5, perform medium change, only in the preselected single-cell containing chambers, with StemFlex supplemented with CloneR following the “Culture” > “Feed” program and the wizard instructions (Fig. 2E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0002])\nCloning efficiency scoring (number of wells with outgrowth relative to number initially containing a single cell) can be performed at day 5 or later, and is an important quality control for the procedure (Fig. 2E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0002]).\n25. From day 6 to day ∼10, perform daily medium change with StemFlex medium without CloneR as explained in step 24.\nOn day 7, cell death can be seen due to the CloneR removal; after that, colonies will re-shape to a more compact morphology with more defined borders, which helps the investigator select well-established cultures for further replating (Fig. 2F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0002]).\n26. Regularly monitor clone growth and confluence in order to decide the time point for further expansion.\nThe cloning efficiency is dependent on the specific hPSC line used. This has to be considered in order to estimate the number of dishes to be plated to isolate a sufficient number of clones.\n27. Shut down the IsoCell device by following the device wizard for shut-down routine.\nClone harvesting and transfer to 96-well plate using the IsoCell (after day 10)",
    "Clones with 50%-70% confluency can be re-plated for further expansion and downstream application (genotyping, freezing, etc.; Fig. 2F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0002]). The time point of adequate confluence may vary between clones, and is highly dependent on the hPSC line.\n28. Prepare in advance 0.2-ml tube strips (provided in the Clone G kit-A) with 120 µl StemFlex medium supplemented with CloneR and five 1.5-ml tubes containing: water, 70% ethanol, DPBS, TrypLE, and StemFlex medium supplemented with CloneR.\n29. Prepare a 96-well plate coated with Geltrex as described in Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0004]\n30. Remove coating solution from the 96-well plate and add 100 µl StemFlex medium supplemented with CloneR. Place in the incubator at 37°C until use.\n31. Select the clones to be re-plated by groups of 8 or 16.\nUp to 16 clones can be detached and harvested per round according to the IsoCell program.\n32. Initialize IsoCell device as described in step 1.\n33. Cell harvesting should proceed following the wizard: “Harvest” > “Detach,” then choose chambers.\nAt this point is important to verify cell detachment by microscopy. Poor detachment results in expansion failure. Some hPSC clones may need longer enzymatic incubation (program can be paused) (Fig. 2F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0002]).\n34. Proceed to “Harvest” > “Extract.” IsoCell will collect each detached clone in a 0.2-ml tube already containing 150 µl of StemFlex medium supplemented with CloneR.\nThis program can be run for up to 16 samples at the time.\n35. Resuspend and manually transfer each cell suspension from step 34 to one well of a 96-well plate using a pipette.\n36. Incubate the 96-well plate at 37°C in a humidified environment, preferably in hypoxic conditions (5% O2, 5% CO2).\n37. Power off IsoCell device according to the shutdown instructions.\n38. At day 1 after re-plating, monitor cell attachment.",
    "39. At day 2 after re-plating, perform a 50% medium change with Essential 8 or mTeSR medium.\nIf there are only a few cells that are scattered throughout a well, change 50% medium with StemFlex supplemented CloneR daily until they recover.\nAfter adapting the clones to Essential 8 or mTeSR medium (according to the original maintenance/expansion medium), clones may be subjected to further expansion as described in Support Protocol 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0011]. For cell freezing, DNA collection for genotyping etc. standard procedures should be followed that are described elsewhere.",
    "The CellenONE instrument utilizes image-based cell detection and acoustic dispensing technology. The equipment performs automated image acquisition combined with fast processing using advanced algorithms in order to identify the cells of interest. Bright-field morphological parameters (diameter, circularity, and elongation) can be combined with up to four fluorescence signals to select specific cells for subsequent isolation. Therefore, application of live/dead dyes, fluorescently labeled antibodies, and fluorescence reporters enables the selection of specific cell subpopulations.\nSingle cell isolation is performed by drop-on-demand technology. Nanoliter drops are generated by piezo-acoustic technology, which ensures gentle cell isolation (https://www.cellenion.com/[href=https://www.cellenion.com/]). Only single cell−containing drops are dispensed in each well of a target plate. Cells can be dispensed in a wide variety of target vessels, including any type of multi-well plate, e.g., 96- or 384-well plates. Empty drops or drops containing multiple cells are collected in a recycling tube for further use.\nAll acquired images and parameters of the isolated events are recorded by the software, and a final report with statistics can be automatically generated at the end of the process. Therefore, all information about the contents and corresponding parameters of each single well of the target plate is available.\nIn this alternate protocol, we provide a basic step-by-step procedure including all considerations, parameters, and important variables adapted to hPSC single cell isolation and posterior clonal expansion using CellenONE X1/F1 platform (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0003]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/801c507a-455f-430b-a325-35a8df6799d8/cpsc123-fig-0003-m.jpg</p>\nFigure 3",
    "Alternate Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0002]: CellenONE hPSC single cell isolation and clonal expansion. (A) Overview flowchart showing automated hPSC single cell seeding using CellenONE instrument. The instrument and its details are depicted in the lower part. (B) left: Representative picture showing a stable drop (no satellite drops or deviations should be visible); right: setting of the ejection boundaries delimiting the ejection and sedimentation regions (ER and SR, respectively), arrow shows the direction of drop ejection. (C) Table showing recommended isolation parameters for hPSC dispensing, obtained from the analysis of five independent experiments (D) Left: exemplary pictures from CelleONE dispensing report—a single cell event can be evaluated by review of the recorded images. Area between green and pink lines is the so called “safe space”; no element should be present within these boundaries, to ensure single cell isolation. Right: graph showing single cell seeding efficiency for two hiPSC lines using CellenONE (mean ± SD, n = 5). (E) Left: representative pictures showing clonal expansion in culture; dotted lines delimit the borders of the colonies (scale bars: 400 µm). Right: graph showing cloning efficiencies for two hiPSC lines (mean ± SD, n = 5). (F) Troubleshooting: panel showing the importance of the correct nozzle focus (pointed with white arrows) to guarantee correct isolation and high recovery rate. Cell3imager Duos was used for pictures in panel F. PDC = Piezo Dispense Capillary.\nNOTE: Special training on how to operate the instrument is recommended. Here we give an overview, but full details are beyond the scope of this protocol. Please contact the manufacturer for further information.\nMaterials\nsciCLEAN8 (Scienion, cat. no. C-5283)\nBleach solution containing active Cl (e.g., Miltenyi, 130-093-663)\n70% ethanol (e.g., Carl Roth, cat. no. T913.3)\nHydrogen peroxide (e.g., Carl Roth, cat. no. 8070.1)\nhPSC suspension (see relevant Current Protocols articles)",
    "StemFlex medium (ThermoFisher Scientific, cat. no. A3349401)\nY-27632 (Stem Cell Technologies, cat. no. 72305; see Support Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0008] for use in medium preparation)\nPropidium iodide, 1.0 mg/ml solution in water (ThermoFisher Scientific, cat. no. P3566)\nLaminar flow hood (e.g., Herasafe, ThermoFisher Scientific)\nCellenONE F1.1 (1 channel: green) or F1.4 (4 channels: blue, green, orange, red)\nPiezo Dispense Capillary (PDC; Cellenion, P-20-CM)\n384-well sciSOURCE plate (Scienion, CPG-5501-1)\nSerological pipettes, 5 and 10 ml (e.g., Corning, cat. no. 357543 and 357551)\nRepeat pipettors, 200 and 1000 µl (e.g., Eppendorf, cat. no. 3123000055 and 3123000063)\nPipette tips, 200 and 1250 µl (e.g., Biozyme, cat. no. 770600)\nCell culture incubator (e.g., Binder)\nAdditional reagents and equipment for preparing target plates (Support Protocols 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0007] and 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0009]), preparing single cell suspension of hPSCs (Support Protocol 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0010]), preparation of medium containing anti-apoptotic small molecules (Support Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0008]), and subculture and expansion of hPSC clones (Support Protocol 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0011])\nCellenONE setup (day 0)\nThis protocol does not include full details for the handling of the device software or hardware. This protocol describes all steps relating specifically to hPSC single cell isolation (Fig. 3A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0003]).\n1. Power on the instrument and follow the initial routine: filter and de-gas fresh autoclaved water and place it on the system bottle; re-fresh water for the washing procedure; empty waste; check water in the humidification system as well as the chiller.\n2. Start the CellenONE software and follow the “prime” instructions.\n3. Install the piezo dispenser capillary (PDC) according to the wizard (Fig. 3A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0003]).\n4. Align the nozzle and correct the offset as recommended by the manufacturer.\n5. Adjust pulse and voltage until a stable drop is achieved (Fig. 3B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0003]). Verify drop volume.\nDrop instability can be detected by drop deviation or presence of satellite drops.\n6. Perform a Sci-Clean task.",
    "This task ensures that the nozzle is perfectly clean and helps to stabilize the drop. In this step, a diluted detergent and sonication are applied.\n7. Perform a sterilization routine.\nThis routine includes a serial clean in bleach solution, ethanol, and H2O2 to decontaminate the PDC.\n8. Check drop stability.\nA stable drop is shown in Figure 3B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0003]. A deviation in the drop trajectory or appearance of satellite drops are signs of drop instability. Drop stability should always be validated before and after performing a dispensing task.\n9. Set target plate platform at 4°C for the whole process.\nSetting temperature at 4°C ensures higher cell viability.\n10. Set chamber humidity greater than 15%.\n11. Open the sciSOURCE 384-well plate in a laminar flow hood, seal it with aluminum foil, and place it on the CellenONE source stage (Fig. 3A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0003]).\n12. If drop is stable, the following steps can be performed.\nSingle cell isolation (day 0)\n13. Prepare the target plates as described in Support Protocols 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0007] and 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0009].\n14. Prepare hPSC cell suspension as described in Support Protocol 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0010].\n15. Resuspend hPSCs in StemFlex medium supplemented with Y-27632 (preparation described in Support Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0008]) at a concentration of 200 cells/µl.\nThe cell suspension for spotting MUST be prepared with Y-27632 since CloneR is too viscous and generates a film at the end of the nozzle, which makes the drop unstable and therefore not suitable for isolation. In the event that StemFlex medium supplemented with Y-27632 also generates a film, DPBS containing Y-27632 can be used with similar results regarding cell survival.\n16. If required, add propidium iodide (final concentration 2 µg/ml) for sorting viable cells by fluorescence discrimination.",
    "17. Transfer 30 µl of cell suspension into one well of the SciSOURCE plate and register the well coordinates of the well in the software.\n18. Place the target plate in the corresponding position (Fig. 3A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0003]).\nDo NOT forget to remove the lid of the target plate before the isolation procedure starts; not doing so will damage the PDC.\n19. Take up 10 µl of hPSC suspension with the PDC and check drop stability.\n20. Enter CellenONE (cell isolation) mode.\n21. Create a folder for the set of experiments and name the run.\n22. Choose continuous dispensing in transmission mode (T) until cells can be seen in the capillary.\n23. Change to manual dispensing mode and dispense drops. When no cells are in the observed area, record a background image.\n24. Perform a “mapping”; adjust ejection boundaries and save the selection (green and pink line shown in Fig. 3D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0003]).\n25. Perform “analysis” on 100 events with wide detection parameters (default).\n26. Create a gate that includes cells with the desired morphological parameters to ensure single cell isolation, and save the selection.\nRecommended morphological parameters for hPSC isolation are depicted in Figure 3C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0003].\n27. If additional fluorescence parameters are to be used for sorting, switch to Transmission>Fluorescence (T > F) mode.\n28. Turn on desired channels (blue, green, orange, and/or red) and adjust power for a maximum fluorescence intensity 120.\n29. Perform a background subtraction when no cells are in the field of view of the camera.\nIf the background signal is high due to some artifact in the capillary, perform a washing task and a manual PDC cleaning with lint-free wipes (e.g., Kimwipes) and 70% ethanol.\n30. Perform “analysis” in T > F mode using already selected morphological parameters, and adjust the fluorescence gate for the sorting.",
    "For propidium iodide staining, a negative gate must be selected for viable cells.\n31. By continuously dispensing, verify that single cells with desired parameters are being positively selected (green ring around them), and that aggregates or duplets are shown in red (Fig. 3D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0003]).\nIf too many events fit the parameters but are aborted (yellow ring around the event), try diluting the sample.\n32. Once all is set, select standby mode to avoid clogging of the nozzle by cells that have sedimented.\nStandby mode ejects picoliter drops in a continuous fashion.\n33. Select the target plate and the positions to be spotted.\n34. Check drop stability.\n35. Start the run.\nIf the cell suspension is adequate and the desired events frequent enough (high recovery rate), dispensing will take about 3-4 min for a complete 384-well plate.\n36. When the run is finished, cover the target plate with the lid and place it in the incubator at 37°C in a humidified environment, preferably under hypoxic conditions (5% O2, 5% CO2).\n37. Export data folders to be analyzed with the CellenONE report software.\n38. Flush the PDC, perform a nozzle wash-removal task, and shut down the CellenONE instrument according to the manufacturer recommendations.\nSingle cell scoring and quality check\n39. Obtain the PDF document name as CellenONE report using the data folders exported in step 37.\nMultiple parameters from the run can be revised and validated using this report. Statistical results can be compared between individual dispensing runs.\n40. Review the nozzle images for each event isolated and validate the single cell isolation.",
    "Percentage of validated single cell events relative to the total spotted events is considered to be the single cell seeding efficiency score (Fig. 3D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0003]). This score can be used to calculate cloning efficiency as a quality control parameter for an experiment.\nClone culture maintenance (day 1 to ∼10)\n41. On day 3 after seeding, perform a partial medium change with StemFlex medium supplemented with CloneR. In a well of a 96-well plate, remove 40 µl and add 50 µl per well; in the wells of a 384-well plate, remove 20 µl and add 30 µl.\nMore medium is added than removed to compensate for medium evaporation, which is especially prevalent in the outer wells of the cell culture plates. A full medium change (100 and 50 µl, respectively) has also been tested and gives similar results.\n42. On day 4, monitor clone outgrowth and score wells with a positive outcome (Fig. 3F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0003]).\nCloning efficiency can be calculated as a proportion of wells with outgrowth in relation to the total number of wells containing a single cell directly after dispensing at day 0.\n43. On day 6, repeat the partial medium change described step 41 only on wells with cell growth.\nThis minimizes the use of reagents and requires less time.\n44. On day 9, perform a partial medium change using StemFlex medium without CloneR.\n45. From day 10 onwards, perform a full medium change daily with StemFlex medium until the clones are ready to be passaged (70% confluent).\n46. Follow Support Protocol 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0011], describing further clonal expansion for later applications such as freezing, genotyping, and expansion for cell banking.\nStandard protocols for such applications can be followed. Detailed procedures are out of the scope of the methods described in this article.",
    "The working principle of the Cytena single-cell dispenser (c.sight/f.sight) or single cell “printer” is an inkjet-like technology using a silicon microfluidic chip within a proprietary disposable cartridge which generates free-flying, picoliter droplets that encapsulate the cells. The microfluidic chip is embedded in the dispensing cartridge. The lower part of the cartridge is called the nozzle, and is the interrogation point for the dispensing event. A microscopy system coupled to a camera detects the droplets and their composition. The cell-containing drop is assessed based on cell size and roundness; single cell−containing droplets are selected and ejected into multi-well plates (96 or 384 wells). The system contains a pneumatic shutter below the nozzle, which remains closed until a positive single cell event occurs, allowing droplets containing more than one cell, or empty droplets, to be aspirated away. The entire sorting procedure is automatically documented as a series of images for each positive droplet recorded by the camera system.\nNOTE: Special training on how to operate the instrument is recommended. Here we give an overview, but full details are beyond the scope of this protocol. Please contact the manufacturer for further information.\nMaterials\nEssential 8 medium (ThermoFisher Scientific., cat. no. A1517001)\nCloneR (Stem Cell Technologies, cat. no. 05888; see Support Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0008] for use in medium preparation)\nhPSC culture (see relevant Current Protocols articles)\nStemFlex medium (ThermoFisher Scientific, cat. no. A3349401)\nLaminar flow hood (e.g., Herasafe, ThermoFisher Scientific)\nCytena c.Sight (no fluorescence option) or f.sight (1 channel = green) connected to computer running Cytena software\nCartridge (Cytena Celllink, cat. no: 42581/40-40 SHC)\nSerological pipettes, 5 and 10 ml (e.g., Corning, cat. no. 357543 and 357551)\nRepeat pipettors, 200 and 1000 µl (e.g., Eppendorf, cat. no. 3123000055 and 3123000063)\nPipette tips, 100, 200 and 1250 µl (e.g., Biozyme, cat. no. 770200 and 770600)",
    "Cell culture incubator (e.g., Binder)\nAdditional reagents and equipment for preparing target plates (Support Protocols 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0007] and 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0009]), preparing single cell suspension of hPSCs (Support Protocol 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0010]), preparation of medium containing anti-apoptotic small molecules (Support Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0008]), and subculture and expansion of hPSC clones (Support Protocol 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0011])\nCytena setup (day 0)\n1. Start the instrument and the connected computer.\n2. Start the Cytena software.\n3. Choose the format of the target plate (96-well or 384-well).\nSingle cell printing (day 0)\n4. Prepare the target plates as described in Support Protocols 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0007] and 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0009].\n5. Prepare an hPSC single cell suspension by following Support Protocol 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0010].\n6. Re-suspend hPSCs in Essential 8 medium supplemented with Y-27632 (preparation described in Support Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0008]) at a concentration of 1000 cells/µl.\nEssential 8 medium must be used for the cell suspension because it has reduced protein content, which prevents blockage of the cartridge. Slightly longer trypsinization time and the use of a 40-µm cell strainer are recommended to remove cell aggregates from the suspension (see Support Protocol 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0010]).\n7. Take a new cartridge and unpack it under sterile conditions.\n8. Add 70 µl of the cell suspension into the cartridge using a 200-µl repeat pipettor and pipette tip.\n9. Open the lid of the Cytena instrument and mount the cartridge using the provided screw (Fig. 4A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0004]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/a4c44b00-2ca1-4e66-b50b-6e2a29cae02b/cpsc123-fig-0004-m.jpg</p>\nFigure 4",
    "Alternate Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0003]: Cytena hPSC single cell isolation and clonal expansion. (A) Overview flowchart showing automated hPSC single cell seeding using Cytena (c.sight) instrument. Images of the instrument and its main components such as cartridge and pipetting arm are depicted in the lower part. (B) Pictures showing the proper droplet formation and the validation of the vacuum system performance. (C) Table showing the recommended morphological parameters to ensure single hPSC isolation. (D) Left: example of the nozzle images (lower part of the cartridge) taken before and after a single cell printing process; each dispensing event is documented. Right: graph showing single cell seeding efficiency for two hiPSC lines using Cytena (mean ± SD, n = 4) (right). (E) Left: Representative pictures showing clonal expansion in culture at different time points (scale bars: 1 mm). Right: graph showing cloning efficiencies for two hPSC lines (mean ± SD, n = 4). (F) Troubleshooting: panel showing the correct focus and alignment of cartridge to the camera (good and bad focus are depicted) for successful single cell printing. Incucyte imager was used for pictures in panel E. QC = quality control.\n10. Attach a sterile 100-µl pipette tip to the pipetting arm in such a way that it sits in the cell solution within the cartridge (Fig. 4A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0004]).\n11. Move arm to camera position.\n12. Place the target plate on the substrate carrier.\nCarefully check that the plate is correctly placed, with the plate lid removed.\n13. Close the lid and return to the software.\n14. Open the droplet quality control (QC) tab to automatically start the process.\n15. Ideally, a droplet should appear right away in the QC camera window. It should look as depicted in Figure 4B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0004].",
    "The droplet should be stable. If the droplet is unstable, it may be necessary to adapt the stroke parameters by changing length and speed values. The settings we recommend are length “10” and speed “120.”\n16. When the droplet is stable, check the vacuum shutter. Use vacuum setting check box “turn on” to switch on the shutter. The droplet should disappear (Fig. 4B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0004]). Once the droplet has been reliably removed, proceed with the cell printing.\n17. Set program settings as follows (Fig. 4C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0004]):\n         \nProgram: Printing\nNumber cells/well: 1\nCell size: 10-30 µm\nCell roundness: 0.5-1.0.\n18. Press the Play button to start the printing process\n19. When the printing process has finished, place the plate in the incubator at 37°C in a humidified environment, preferably under hypoxic conditions (5% O2, 5% CO2).\nSingle cell scoring and quality check\n20. Export the images generated for the run. A total of five pictures showing the nozzle during the isolation process are recorded for each positive single cell droplet.\n21. Review the nozzle images for each event isolated and validate the single cell isolation.\nPercentage of validated single cell events in relation to the total number of spotted events is considered to be the single cell seeding efficiency score (Fig. 4D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-fig-0004]). This score can be used to calculate cloning efficiency as a quality control parameter for an experiment.\nClone culture maintenance (day 1 to ∼10)\n22. On day 3 after seeding, perform a partial medium change with StemFlex medium supplemented with CloneR (preparation described in Support Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0008]). For 96-well plates: remove 40 µl and add of 50 µl per well; for 384-well plates remove 20 µl and add 30 µl.\nA full medium change (100 and 50 µl, respectively) has also been tested and gives similar results.",
    "23. On day 4, monitor clone outgrowth and record wells with positive outcome.\nCloning efficiency can be calculated as the proportion of wells with outgrowth in relation to the total number of wells containing a single cell on day 0.\n24. On day 6, repeat partial medium change described in step 22 only on wells with cell growth.\nThis minimizes the use of reagents and requires less time.\n25. On day 9, repeat partial medium change from step 22 using StemFlex medium without CloneR.\n26. From day 10 onwards, perform a full medium change daily with StemFlex medium until the clones are ready to be passaged (70% confluent).\n27. Follow Support Protocol 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0011], describing further clonal expansion for later applications such as freezing, genotyping, and expansion for cell banking.\nStandard protocols for such applications can be followed. Detailed procedures are out of the scope of the methods described in this article.",
    "Soluble forms of basement membrane extract purified from murine Engelbreth-Holm-Swarm tumor cells, such as Geltrex (ThermoFisher Scientific) or Matrigel (Corning), are widely used as a feeder-free alternative to murine embryonic fibroblast feeder cells for hPSC cultures. Here, we briefly describe the coating procedure for standard plastic tissue culture−treated plates using Geltrex.\nMaterials\nGeltrex (ThermoFisher Scientific, cat. no. A1413302)\nKnockOut DMEM/F-12 (ThermoFisher Scientific, cat. no. 12660012)\nLaminar flow hood (e.g., Herasafe, ThermoFisher Scientific)\n50-ml tubes  (e.g., Corning Falcon, cat. no. 430290)\nMulti-well culture vessels (e.g., 96 well, Corning, cat. no. 353072; see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-tbl-0001])\nSerological pipettes, 5 and 10 ml (e.g., Corning, cat. no. 357543 and 357551)\n1.5-ml tubes  (e.g., Eppendorf, cat. no. 30120086)\nParafilm M sealing film (Sigma, P6543-1EA)\nCell culture incubator (e.g., Binder)\nTable 1.\n                Coating Solution and Medium Volumes for Different Cell Culture Vessels\ntable:\n﻿Plate,Area (cm2)/well,Coating solution/well,Culture medium/well\n6-well,9.5,1 ml,2 ml\n12-well,3.8,0.6 ml,1 ml\n24-well,1.9,0.3 ml,0.5 ml\n48-well,1.0,0.2 ml,0.3 ml\n96-well,0.32,0.05 ml,0.1 ml\n384-well,0.056,0.02 ml,0.06 ml\n1. Thaw a frozen Geltrex vial by placing it in ice.\nGeltrex in its concentrated form will start to polymerize and form a gel within a few minutes when warmed up to room temperature; hence, all media and tubes should be pre-cooled to 4°C, and solutions should be kept on ice during handling. It is suggested to thaw stock solutions of Geltrex overnight on ice, aliquot small volumes (0.1-1 ml) into pre-cooled tubes, and re-freeze at −20°C to avoid multiple freeze-thaw cycles. Follow manufacturer's guidelines for handling and dilution where available.\n2. Pre-cool a 50-ml Falcon tube containing 49.5 ml DMEM/F12 by placing in ice for 30 min.\n3. Add 0.5 ml Geltrex to the 49.5 ml of cold DMEM/F-12 and invert tube gently several times to mix.",
    "Geltrex dilutions ranging from 1:100 to 1:120 can be used for hPSC culture with similar results.\n4. Add appropriate volume of diluted Geltrex solution to desired wells of culture vessels (see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-tbl-0001] below).\n5. Incubate culture vessels with Geltrex solution for at least 30 min at 37°C before use.\n6. For preparation and storage of coated plates for up to 2 weeks, add 1.5× the volume recommended in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-tbl-0001] of Geltrex/DMEM/F12 solution, then seal lids on plates using Parafilm and store at 4°C.\nThe increased volume is to prevent drying of the plates due to evaporation, which will cause the coating to degrade.",
    "The quality of the hPSC cultures has a major impact on the downstream application of the cells. Daily medium change and monitoring of cell density and morphology are required to preserve self-renewal, pluripotency, and differentiation capacities.\nMaterials\nhPSC culture (see relevant Current Protocols articles)\nGeltrex-coated plates (e.g., 6-well; see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0004])\nEssential 8 medium (ThermoFisher Scientific., cat. no. A1517001) or mTeSR (Stem Cell Technologies, cat. no. 85850)\nLaminar flow hood (e.g., Herasafe, ThermoFisher Scientific)\nInverted microscope with phase-contrast optics, 4×, 10×, 20× objectives (e.g., DMi8, Leica)\nSerological pipettes, 5 and 10 ml (e.g., Corning, cat. no. 357543 and 357551)\nPipette tips, 10 µl (e.g., Biozyme, cat. no. 770020)\n50-ml tubes (e.g., Corning Falcon, cat. no. 430290)\nGlass Pasteur pipette (e.g., VWR, cat. no. 612-1701)\nCell culture vacuum pump (e.g., Integra)\nCell culture incubator (e.g., Binder)\nWater bath (e.g., VWR)\nAdditional reagents and equipment for passaging of hPSC (Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0006])\n1. Most hPSC cultures can be regularly maintained in 6-well Geltrex-coated plates (Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0004]).\n2. Use an inverted microscope with phase-contrast optics (4× to 10× objective) to visually monitor the growth and morphology of the hPSC colonies.\nRegions identified as differentiated should be mechanically removed by scraping the bottom of the plate with a plastic pipette tip (10 µl).\n3. For medium change: Prepare an aliquot of Essential 8 or mTeSR medium in a 50-ml tube with the volume needed for the medium change according to the number of wells (2 ml/well), and warm it to 37°C using a water bath.\nAvoid warming up excess medium, in order to preserve growth-factor activity for a longer period of time.\n4. Aspirate medium from the wells using a vacuum system with sterile tip (e.g., glass Pasteur pipette).",
    "5. Add pre-warmed fresh Essential 8 or mTeSR medium according to the hPSC line specification, using 5- or 10-ml pipettes.\nRecommended culture medium volumes for different culture vessels are given in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-tbl-0001].\n6. When cultures reach 70%-80% confluency, passage according to Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0006].",
    "Standard hPSC cell culture practices include the regular passaging of the cells to maintain self-renewal and pluripotent capacities. Classical enzymatic splitting is harsh for the cells, and the survival rate is lower than with passaging in aggregates or clumps. Here we describe a standard procedure for hPSC splitting using EDTA to “loosen” cell-cell and cell-plate contact without exposing hPSC to single cell dissociation.\nMaterials\nhPSC culture (see relevant Current Protocols articles)\nEssential 8 medium (ThermoFisher Scientific., cat. no. A1517001) or mTeSR (Stem Cell Technologies, cat. no. 85850)\n0.5 M EDTA, pH 8.0 (ThermoFisher Scientific., cat. no. 15575020)\nDulbecco's phosphate-buffered saline without Ca2+ and Mg2+ (DPBS; e.g., ThermoFisher Scientific, cat. no. 10010023)\nLaminar flow hood (e.g., Herasafe, ThermoFisher Scientific)\nGeltrex-coated plates (e.g., 6-well; see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0004])\nInverted microscope with phase-contrast optics, 4×, 10×, 20× objectives (e.g., DMi8, Leica)\nCell culture vacuum pump (e.g., Integra)\nGlass Pasteur pipette (e.g., VWR, cat. no. 612-1701)\nSerological pipettes, 5 and 10 ml (e.g., Corning, cat. no. 357543 and 357551)\n50-ml tubes (e.g., Corning Falcon, cat. no. 430290)\nCell culture incubator (e.g., Binder)\nWater bath (e.g., VWR)\nAdditional reagents and equipment for maintaining hPSC in culture (Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0005])\n1. hPSC confluence before splitting should be 70%-80%. Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0005] provides details on keeping hPSC in culture.\n2. Prepare Geltrex-coated tissue culture−treated 6-well plate(s) as described in Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0004].\n3. Aspirate the Geltrex coating solution from the prepared 6-well plate and add 2 ml per well of Essential 8 or mTeSR medium. Keep the plate in the incubator at 37°C until it will be used.\n4. Dilute 0.5 M EDTA to a final concentration of 0.5 mM in DPBS\nFor example, dilute 500 µl 0.5 M EDTA in 49.5 ml DPBS.\n5. Aspirate culture medium from the wells to be split.",
    "6. To wash the wells, add 1 ml of 0.5 mM EDTA to each well and immediately remove it by aspiration.\n7. Add 1 ml 0.5 mM EDTA to each well and incubate for 3-4 min at room temperature.\nMonitor the process with an inverted phase-contrast microscope; when cells are rounding up and separate from the neighboring cells, the incubation should be stopped. Cells should not detach!\n8. Remove EDTA solution from the wells by aspiration and add 2 ml of Essential 8 or mTeSR medium using a 5-ml serological pipette.\n9. Triturate gently using a 1000-μl pipette tip against the culture surface three times to detach the hPSC clumps.\n10. Collect the clump suspension and distribute dropwise in the plate prepared in step 3.\nThe splitting density will determine how quickly cells will reach confluency for passaging again. Typically, we split 1:6 to 1:20, which would be 333-100 µl volume per well according to the volume in which the clumps were triturated (see step 8), providing about 3-6 days outgrowth.\n11. Incubate at 37°C, preferably under hypoxic conditions (5% O2, 5% CO2).\n12. Change medium every day and monitor the culture as described in Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0005].",
    "hPSC feeder-free cultures need extracellular matrix (ECM) components to successfully attach and generate colonies while keeping pluripotency and self-renewal capacities. Recombinant Laminin 521 is widely used, and in practice increases single cell cloning efficiency compared to commonly used ECMs such as Matrigel or Geltrex. In addition, the purity of Laminin 521 is an advantage for imaging purposes.\nMaterials\nHuman recombinant Laminin 521 (Bio Lamina, cat. no. LN521-05) \nDPBS with calcium and magnesium (e.g., ThermoFisher Scientific, cat. no. 14040117) \nLaminar flow hood (e.g., Herasafe, ThermoFisher Scientific)\nClone G kit-A—with tissue-culture treated 6-cm dishes (Iota Sciences, cat. no. SKU 10030)\n96-well tissue-culture treated plates (e.g., Corning, cat. no. 353072)\n384-well cell culture plate (e.g., Greiner, 781182)\nSerological pipettes, 5 and 10 ml (e.g., Corning, cat. no. 357543 and 357551)\nRepeat pipettors, 200 and 1000 µl (e.g., Eppendorf, cat. no. 3123000055 and 3123000063)\nMultichannel pipette (e.g., Eppendorf, cat. no. 3125000052)\nPipette tips, 200 and 1250 µl (e.g., Biozyme, cat. no. 770200 and 770600)\n15-ml tubes (e.g., Corning Falcon, cat. no. 352096)\n50-ml tubes (e.g., Corning Falcon, cat. no. 430290)\nSterile disposable plastic pipetting reservoirs (e.g., ThermoFisher Scientific., cat. no. 95128095)\nParafilm M sealing film (e.g., Sigma, P6543-1EA)\nCell culture incubator (e.g., Binder)\n1. Thaw Laminin 521 on ice.\n2. Prepare the coating solution by diluting Laminin 521 in DPBS with calcium and magnesium to a final concentration of 5 µg/ml. Total volume depends on number of plates to be coated.\nPrepare 8 ml coating solution per 384-well plate, 5 ml coating solution per 96-well plate, or 2 ml coating solution per 6-cm IsoCell culture-treated dish provided in the Clone G kit-A (Iota Sciences).",
    "3. Add 20 µl coating solution per well of a 384-well plate, 50 µl coating solution per well of a 96-well plate, or 2 ml coating solution per IsoCell culture-treated dish.\nThe use of multichannel pipettes or dispensing robots for multi-well plates simplifies the task and reduces the hands-on time.\n4. Distribute the coating solution evenly\nFor 96- and 384-well plates, centrifuge 1 min at 300 × g to ensure that the bottoms of all wells are covered.\n5. Incubate Laminin 521 at least 2 hr at 37°C for multiwell plates before using them, or maximum of 2 hr for 6-cm dishes.\nBest results can be obtained if the plates are prepared fresh. If the plates are not going to be used the same day, they can be sealed with Parafilm and stored immediately after coating at 4°C for up to 1 week, but with a significant reduction in performance.",
    "The use of Rho-kinase (ROCK) inhibitors such as Y-27632 or supplements enhancing cell survival such as CloneR has been shown to play an important role in at least partially blocking apoptotic events in hPSC, among other cell types. We have established the single cell seeding and clonal expansion described in this method paper using these small molecules and supplements to enhance hPSC survival. Here we describe the preparation of culture medium containing anti-apoptotic factors.\nMaterials\nY-27632 (Stem Cell Technologies, cat. no. 72305)\nDMSO (e.g., Sigma-Aldrich, cat. no. D2650)\nCloneR (Stem Cell Technologies, cat. no. 05888)\nEssential 8 medium (ThermoFisher Scientific, cat. no. A1517001)\nmTeSR (Stem Cell Technologies, cat. no. 85850)\nStemFlex medium (ThermoFisher Scientific, cat. no. A3349401)\n1. Dissolve Y-27632 in DMSO to prepare a 10 mM stock solution.\nAliquots can be kept at −20°C until use.\n2. Thaw a ready-to-use vial of CloneR or aliquot of Y-27632.\n3. Calculate the final volume needed of medium containing small molecules.\n4. Refer to Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-tbl-0002] for medium preparation.\nTable 2.\n                Anti-Apoptotic Small Molecules and Supplement Dilutions in Medium\ntable:\n﻿Medium,Small molecule stock concentration,Small molecule final concentration,Dilution\nStemFlex + CloneR,10×,0.5×,1:20\nStemFlex + Y-27632,10 mM,10 µM,1:1000\nEssential 8 + Y-27632,10 mM,10 µM,1:1000",
    "This protocol describes how to prepare the target multi-well culture plates for automated single cell seeding using CellenONE and Cytena instruments. This is a manual procedure; however, the use of liquid-handling robots reduces the hands-on time and standardizes the workflow.\nMaterials\nStemFlex medium containing CloneR, prepared as described in Support Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0008]\nPenicillin/streptomycin (ThermoFisher Scientific, cat. no. 15140122; optional)\nLaminar flow hood (e.g., Herasafe, ThermoFisher Scientific)\n96- or 384-well tissue-culture treated plates pre-coated with Laminin 521 as described in Support Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0007]\nMultichannel pipette (e.g., Eppendorf, cat. no. 3125000052)\nSterile disposable plastic pipetting reservoirs (e.g., ThermoFisher Scientific., cat. no. 95128095)\nPipette tips, 200 and 1250 µl (e.g., Biozyme, cat. no. 770200 and 770600)\nPipette tips, 300 µl (e.g., Eppendorf, cat. no. 10497221)\nCell culture vacuum pump (e.g., Integra)\nMultichannel adaptor for the cell culture pump (e.g., Integra)\nCentrifuge (e.g., Eppendorf) with plate adapter\n1. Aspirate the coating solution from the plate (see Support Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0007], step 5) using the a multichannel pipette and 200-µl pipette tips with adapter connected to the cell culture vacuum pump system.\n2. Add StemFlex medium supplemented with CloneR (see Support Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0008]) using a multichannel pipette.\nVolumes: 60 µl/well (384-well plate); 100 µl/well (96-well plate).\nOptional addition of antibiotics to the medium (penicillin/streptomycin, 1×) for the single cell seeding minimizes the risk of bacterial contamination, especially when using the CellenONE device, and does not affect cell viability.\n3. If using 384-well plates, centrifuge plates for 1 min at 300 × g, to ensure even surface coverage by the medium and remove any bubbles. If bubbles can be observed after filling of a 96-well plate centrifugation can also be applied.\n4. Keep the multi-well plate at 4°C until use within 24 hr.",
    "This protocol describes a procedure, optimized for cell viability, to obtain a homogeneous single cell suspension from hPSC cultures, to be used for automated single cell isolation. Before this point, standard culture conditions for feeder-free hPSC culture using Essential 8 or mTeSR medium should be maintained, as described in Support Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0004], 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0005], and 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0006], in order to ensure good-quality starting cultures. The procedure is described for hPSCs cultured in 6-well plates. Volumes have to be adapted for other formats taking into account the culture surface, as described in Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0004] and Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-tbl-0001].\nMaterials\nhPSC culture (see Support Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0004], 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0005], and 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0006])\nDulbecco's phosphate-buffered saline without Ca2+ and Mg2+ (DPBS; e.g., ThermoFisher Scientific, cat. no. 10010023)\nTrypLE Select Enzyme (ThermoFisher Scientific, cat. no. 12563011)\nEssential 8 medium (ThermoFisher Scientific, cat. no. A1517001) or mTeSR (Stem Cell Technologies, cat. no. 85850)\nStemFlex medium (ThermoFisher Scientific, cat. no. A3349401)\nCloneR (Stem Cell Technologies, cat. no. 05888; see Support Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0008] for use in medium preparation)\nY-27632 (Stem Cell Technologies, cat. no. 72305; see Support Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0008] for use in medium preparation)\n0.04% Trypan blue (e.g., Sigma-Aldrich, cat. no. T8514-20ML)\nLaminar flow hood (e.g., Herasafe, ThermoFisher Scientific)\nInverted microscope with phase-contrast optics, 4×, 10×, 20× objectives (e.g., DMi8, Leica)\nMultichannel pipette (e.g., Eppendorf, cat. no. 3125000052)\nSterile disposable plastic pipetting reservoirs (e.g., ThermoFisher Scientific., cat. no. 95128095)\nPipette tips, 200- and 1250-µl (e.g., Biozyme, cat. no. 770200 and 770600)\nPipette tips, 300-µl (e.g., Eppendorf, cat. no. 10497221)\nCell culture vacuum pump (e.g., Integra)\nMultichannel adaptor for the cell culture pump (e.g., Integra)\n6-well tissue-culture treated plates (e.g., Corning, cat. no. 353046)\nSerological pipettes, 5 and 10 ml (e.g., Corning, cat. no. 357543 and 357551)\n15-ml tubes (e.g., Corning Falcon, cat. no. 352096)\n1.5-ml tubes (e.g., Eppendorf, cat. no. 30120086)",
    "Centrifuge (e.g., Eppendorf)\nAutomated cell counter with counting chambers (e.g., Countess II, ThermoFisher Scientific) or hemocytometer (Neubauer counting chamber)\nCell culture incubator (e.g., Binder)\nWater bath (e.g., VWR)\nAdditional reagents and equipment for preparation of medium containing anti-apoptotic small molecules (Support Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0008]) and cell counting (see Current Protocols article: Phelan & May, 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-bib-0008])\n1. Verify 70%-80% hPSC culture confluency using inverted microscope with phase contrast (4× objective).\n2. Aspirate and discard medium from the well to be harvested.\n3. Wash the well with 1 ml DPBS.\n4. Aspirate and discard DPBS. Add 1 ml TrypLE.\nGentle enzymatic dissociation reagents comparable to TrypLE such as Accutase can also be used.\n5. Incubate at room temperature until cells are loose (typically 3-5 min). Monitor this step with the microscope. Remove the TrypLE carefully. Make sure the cells are still attached to the bottom of the plate while TrypLE is being removed.\nUnnecessarily long incubations decrease cell viability.\n6. Add 1 ml Essential 8 or mTeSR medium to the well to neutralize the enzymatic action, and gently homogenize the cells suspension using a 1000-µl pipette tip.\n7. Transfer the cell suspension to a 15-ml tube and centrifuge 5 min at 300 × g, room temperature.\n8. Aspirate supernatant.\n9. Re-suspend the cell pellet with 1 ml of medium.\nMedium for resuspension will be different according to downstream applications: hPSC single cell isolation by IsoCell (StemFlex medium containing CloneR), CellenONE (StemFlex medium or DPBS containing Y-27632), or Cytena (Essential 8 medium containing Y-27632). See Support Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0008] for preparation of these media.\n10. Prepare an aliquot for cell counting 1:1 in 0.04% trypan blue (e.g., 10 µl cell suspension + 10 µl trypan blue).\n11. Homogenize the aliquot and load 10 µl in the cell counting chamber.",
    "Dedicated chambers are provided specifically for automated counters. A Neubauer chamber (hemocytometer) can also be used, as described in Current Protocols article Phelan & May (2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-bib-0008]).\n12. Express the result in number of viable cells/ml.\nThis value is used for further calculations regarding cell suspension concentrations required for each single cell dispensing method.",
    "After hPSC clones derived from single cells have reached 60%-70% confluence, they can be dissociated and further expanded for downstream genotyping, characterization, or freezing. Initial seeding with CellenONE and Cytena instruments will have already been performed in 96- or 384-well plates. For IsoCell, the first expansion step into 96-well plates is described in the Basic Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0001]. Here we describe how to passage these clones into larger plate formats. The decision on the plate format to scale up the culture will depend on the several factors: how many clones have to be expanded, workload, possibility of automation, amount of cells needed for downstream purposes, etc.\nMaterials\nStemFlex medium (ThermoFisher Scientific, cat. no. A3349401)\nCloneR (Stem Cell Technologies, cat. no. 05888; see Support Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0008] for use in medium preparation)\nhPSC clones in wells of 96-well plate or 384-well plate (Basic Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0001])\nDulbecco's phosphate-buffered saline without Ca2+ and Mg2+ (DPBS; e.g., ThermoFisher Scientific, cat. no. 10010023)\nTrypLE Select Enzyme (ThermoFisher Scientific, cat. no. 12563011)\nEssential 8 medium (ThermoFisher Scientific, cat. no. A1517001) or mTeSR (Stem Cell Technologies, cat. no. 85850)\nLaminar flow hood (e.g., Herasafe, ThermoFisher Scientific)\n12-well tissue-culture treated plates (e.g., Corning, cat. no. 353043)\nSerological pipettes, 5 and 10 ml (e.g., Corning, cat. no. 357543 and 357551)\nRepeat pipettor, 200 and 1000 µl (e.g., Eppendorf, cat. no. 3123000055 and 3123000063)\nPipette tips, 200 and 1250 µl (e.g., Biozyme, cat. no. 770200 and 770600)\nCell culture vacuum pump (e.g., Integra)\nInverted microscope with phase-contrast optics, 4×, 10×, 20× objectives (e.g., DMi8, Leica)\nCell culture incubator (e.g., Binder)\n48-well tissue-culture treated plates (Corning, cat. no. 353078)\n15-ml tubes (e.g., Corning, cat. no. 352096)\nWater bath (e.g., VWR)\nAdditional reagents and equipment for Geltrex coating of cell culture plates (Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0004]) and preparation of medium containing anti-apoptotic small molecules (Support Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0008])",
    "To split a 96-well plate of clones\n1a. Coat in advance, with Geltrex (Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0004]), the number of wells of 12-well plates according to the number of clones to be passaged (1 × 96-well to 1 × 12 well).\n2a. Aspirate and discard the coating solution from the 12-well plate and add 1 ml of StemFlex supplemented with CloneR per well (see Support Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0008]). Keep the plate in the incubator at 37°C until it will be used.\n3a. Aspirate and discard the medium from a well of the 96-well plate with a clone of interest.\n4a. Add 200 µl DPBS per well and subsequently discard it to wash the well.\n5a. Add 30 µl TrypLE to the well, distribute it evenly, and monitor cell detachment at room temperature using an inverted microscope.\nTrypLE incubation time may vary from clone to clone within the range of 3-10 min\n6a. Neutralize the TrypLE with 150 µl StemFlex supplemented with CloneR. Pipette up and down three times using a P200 tip on a repeat pipettor set at 150 µl.\n7a. Collect the suspension and directly transfer it into one well of the previously prepared 12-well plate (step 2a)\n8a. Distribute the cell suspension in the 12-well plate well by a gentle cross movement of the plate.\n9a. Incubate at 37°C, preferably under hypoxic conditions (5% O2, 5% CO2).\nTo split a 384-well plate of clones\n1b. Coat in advance, with Geltrex (Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0004]), the number of wells in a 48-well plate according to the number of clones to be passaged (1 × 384-well to 1 × 48 well).",
    "2b. Aspirate and discard the coating solution from the 48-well plate and add 0.3 ml per well of StemFlex supplemented with CloneR (see Support Protocol 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0008]). Keep the plate in the incubator at 37°C until it will be used.\n3b. Aspirate and discard the medium from a well of the384-well plate with the clone of interest.\n4b. Add 80 µl DPBS per well and subsequently discard it to wash the well.\n5b. Add 15 µl TrypLE to the well, distribute it evenly, and monitor cell detachment at room temperature using an inverted microscope.\nTrypLE incubation time may vary from clone to clone.\n6b. Neutralize the TrypLE with 80 µl StemFlex supplemented with CloneR. Pipette up and down three times using a P200 tip on a repeat pipettor set at 80 µl.\n7b.. Collect the suspension and transfer it directly to one well of the previously prepared 48-well plate (step 2b)\n8b. Homogenize the cell suspension in the 48-well plate by gentle cross movement of the plate.\n9b. Incubate at 37°C, preferably under hypoxic conditions (5% O2, 5% CO2).\nCulture maintenance after clone splitting\n10. On day 2 after splitting, adapt clones to the regular cell culture medium (Essential 8 or mTeSR) by changing medium to a 1:1 mixture of StemFlex:Essential 8 or mTeSR.\n11. Change medium every day from here on.\n12. Further culture expansion follows standard procedures for hPSC culture maintenance and splitting, as described in Support Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0004]-3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpsc.123#cpsc123-prot-0006].\nOther procedures including clone genotyping, characterization, or freezing can be performed using standard protocols that are out of the scope of this article and described in the literature."
  ],
  "subjectAreas": [
    "Stem Cell Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}