{
  "id": 8116,
  "origin_website": "Bio",
  "title": "pERK Detection Assays Using the Surefire AlphaScreen<sup>®</sup> Kit (TGR Biosciences and PerkinElmer)",
  "procedures": [
    "Notes: 1) Cells can either be stably or transiently expressing receptor of interest. 2) It is recommended to first perform a timecourse analysis to determine the time at which ligand-mediated pERK1/2 is maximal. For this, follow the same protocolusing a single concentration of ligand  (recommended concentration 100x Kd).       Recommended initial timecourse (min): 90, 60, 45, 30, 15, 10, 8, 6, 4, 2, 1, 0.  3) Subsequent timecourses can then be refined to determine the precise time at which            maximum ligand-induced pERK1/2 occurs.      I.   Cell preparation   Seed cells in suitable nutrient media (e.g. DMEM, 10% FBS, no antibiotics) into a sterile 96-well plate and incubate in a humidified environment at 37 °C, 5% CO2 to be ~90% confluent the following day (~24 h).   Note: Optimization for cell number depending on the cell line used will be necessary (we suggest a starting range of 10,000-50,000 cells per well). Recommended density for CHO FlpIN cells is 30,000 cells/ well.      II.  Stimulation    The day following seeding, aspirate nutrient media, rinse once with 100 μl PBS, and replace with 90 μl prewarmed DMEM (no FBS).   Incubate in a humidified environment at 37 °C, 5% CO2 for a minimum of 4 h (recommended 6 h, up to overnight (O/N)).   Prepare serial dilutions of ligands at 10x final concentration in DMEM, enough for 10 μl/well, to be performed in duplicate (minimum), and enough for the number of timepoints if doing a timecourse.  Note: Concentration range to use will depend on ligand affinity for receptor. For initial timecourse test, select a concentration 100x Kd of ligand and a DMEM control. The concentrations can then be refined in subsequent experiments. If using a peptide or ‘sticky’ ligand, prepare serial dilutions in DMEM with 0.1% BSA.",
    "Prepare a suitable concentration of FBS in DMEM, enough for 10 μl/well, to be performed in duplicate (minimum), and enough for the number of timepoints if doing a timecourse.  Note: This is the internal control for the experiment – FBS promotes pERK1/2. Recommended final concentration of FBS in a CHO FlpIN cell line is 3-10%.    Following preincubation in DMEM, add 10 μl of 10x prepared ligands or FBS to cells for a total volume of 100 μl, 1x final concentration.  Note: For initial timecourse, begin at 90 min, and add ligand or FBS to cells at each timepoint until time 0 (no addition). For concentration response, add ligand or FBS at time of maximal induced pERK1/2 as determined through timecourse.   After completion of stimulation, rapidly remove ligand-containing media from cells.  Note: Depending on the cell type, this may involve flicking or gentle aspiration.   Add 50 μl 1x Surefire® Lysis buffer.  Note: Optimization for lysis volume will be necessary, and depends on the cell type, expression level of the receptor and efficiency of coupling to pERK1/2 pathways. Recommended starting lysis volume in a CHO FlpIN cell line is 30-100 μl.   Incubate lysates at room temperature (RT) for 5-10 min on an orbital shaker.       III. Detection    In reduced lighting conditions, prepare detection buffer.    Transfer 5 μl of cell lysate from each well to a 384-well ProxiPlate.    In reduced lighting conditions, add 8.5 μl Detection buffer to each sample.   Seal the plate with TopSeal and wrap in foil.  Note: Small volumes are subject to evaporation, TopSeal is essential.   Incubate at RT for 2 h or 37 °C for 1 h in reduced lighting conditions.  Note: If incubating at 37 °C, ensure the plate has returned to RT before measuring luminescence (~15 min at RT following 37 °C incubation should suffice).",
    "Detection beads are temperature sensitive.    Analyse luminescence on a Fusion-α or Envision plate reader using standard α-screen settings.        IV. Data analysis   Data should be normalized to the response elicited by the FBS control."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}