{
  "id": 5793,
  "origin_website": "Bio",
  "title": "Protein Expression and Purification of the Hsp90-Cdc37-Cdk4 Kinase  Complex from <em>Saccharomyces cerevisiae</em>",
  "procedures": [
    "Generating the co-expression constructTo co-express human Hsp90β, human Cdc37 and human Cdk4 we utilized viral 2A peptides. This way we were able to construct a single plasmid, which had all three proteins in it. (see Figure 1) The exact 2A sequence we used (referred to as P2A) was sourced from Porcine Teschovirus-1 and was GSGATNFSLLKQAGDVEENPGP. The resulting construct was of this arrangement: hCdc37-TEVsite-P2A-hHsp90β-TEVsite-FLAG-P2A-hCdk4-TEVsite-HisTag. The nucleotide sequence which was inserted between hCdc37 and hHsp90 was: CAGAACCTGTACTTTCAGGGCGGATCCGGTGCCACCAACTTTAGCTTGTTGAAGCAGGCTGGAGACGTGGAGGAAAATCCTGGACCC, between hHsp90 and hCdk4 was: CAAAACTTATACTTCCAGGGTGACTATAAGGACGATGACGACAAAGGCTCCGGTGCCACCAACTTCTCATTATTGAAACAGGCCGGTGATGTAGAGGAAAATCCAGGACCT, and after hCdk4 was: CAGAATCTGTATTTTCAGGGACATCATCACCATCACCATTAATGA. The complete sequence above was codon optimized (the regions between proteins were manually checked to be dissimilar to ease cloning). See Appendix[href=https://os.bio-protocol.org/attached/file/20170917/Appendix.docx] for complete insert sequence. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170920/20170920210044_5769.jpgFigure 1. Design and cloning of the construct with Hsp90, Cdc37 and Cdk4 in itThe sequence was then split into two pieces (at nucleotide number 2,212) and both parts were ordered as GeneArt Strings DNA from Thermo Fisher Scientific. Using NEBuilder, primers were designed to amplify the 83nu vector and each of the GeneArt Strings DNA as to clone them using Gibson Assembly Cloning Kit. 83nu vector and each of the GeneArt Strings DNA are amplified using a PCR machine, then digested with DpnI at 37 °C overnight (O/N) (~16 h), PCR cleaned up, assembled using Gibson Assembly Cloning Kit and transformed into E. coli TOP10 cells supplied with the kit, which are plated and grown O/N at 37 °C on LB-carbenicillin plates. Next day, pick 10 colonies and start a 5 ml culture of LB together with 100 mg/L of carbenicillin with each colony. After 24 h growth at 37 °C with shaking, the plasmid DNA is extracted utilizing miniprep kit and sent for sequencing (tiling every 500 bp through the whole gene).",
    "In our case, the best clone had one mutation due to synthesis errors, which was corrected utilizing Q5 Site Directed Mutagenesis Kit and the protocol therein. The final construct is sequenced and stored in distilled nuclease free water at -20 °C for future use. 4 °C fridge is used for short-term storage of DNA (under a week).Expression of the Hsp90/Cdc37/Cdk4The plasmid is transformed into JEL1 (MAT-alpha, leu2 trp1 ura3-52 nprb1-1122 pep4-3 deltahis3::PGAL10-GAL4) yeast strain using Frozen-EZ Yeast Transformation II Kit protocol and plated on SD-His plates. After 3 days, pick a colony and inculcate into 100 ml SD-His media in a 250 ml flask and grow at 30 °C O/N shaking at 200 rpm. Next day, inoculate 6 x 1 L flasks of YPGL media (autoclaved) each with 10 ml of the O/N culture. After about 24 h at 30 °C and 200 rpm (optical density [OD] of 1, measured on the spectrophotometer), add powder galactose to a final concentration of 2% w/v to induce protein expression. The culture is pelleted after 6 h of growth at 3,000 x g for 20 min. Pellets are scooped up and frozen at -80 °C. Purification of the Hsp90/Cdc37/Cdk4 complexResuspend the cell pellets in lysis buffer with protease inhibitors first with spatula, then pass the sample through a 16 G syringe needle (about 160 ml total for 6 L yeast culture). Then pass the lysate through EmulsiFlex-C3 machine at 25,000 psi, 5 complete passes for lysis following standard manufacturer’s procedures.Clear the lysate by centrifuging at 30,000 x g for 30 min. Equilibrate 5 ml bed volume of Ni-NTA beads with 20 bed volumes (100 ml) of lysis buffer at room temperature utilizing a glass gravity column.",
    "The supernatant from the centrifuge spin is added to the beads, and then rocked for 1 h at 4 °C in the capped glass gravity column. After 1 h incubation, wash the beads with 20 bed volumes of lysis buffer and then elute into 10 bed volumes of lysis buffer + 500 mM imidazole, utilizing a glass gravity column for both steps. Then incubate the resulting eluate with pre-equilibrated (10 bed volumes of lysis buffer utilizing the magnetic stand) Anti-FLAG M2 Magnetic Beads (1 ml bed volume) in a 50 ml plastic conical tube for 1 h at 4 °C, rocking. Wash the beads with 10 bed volumes of lysis buffer utilizing the magnetic stand and a 15 ml tube, and elute the sample with 3 bed volumes of lysis buffer with 75 μg/ml of FLAG peptide, twice, 25 min each timeAdd TEV protease to the eluent (2.5 mg) and dialyze sample against 4 L of dialysis buffer O/N utilizing dialysis tubing. Dilute the sample 1:1 with the dialysis buffer without NaCl and load onto pre-equilibrated MonoQ 10/100GL column on an ÄKTApurifier system. After washing out the unbound sample (about 3 CV [column volumes]), a gradient is run up to 1 M NaCl (over 20 CV) with fractionation to elute the bound complex (comes off at about 25% conductivity). The fractions are pooled, concentrated and then loaded on HiLoad 16/600 Superdex 200pg column pre-equilibrated in gel filtration buffer. The peak fractions (at about 0.5 CV) are pooled, concentrated, flash frozen in liquid nitrogen and stored at -80 °C. At various points (see Figure 2) during the purification aliquots are taken to be run on SDS-PAGE gel (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170920/20170920210428_3750.jpgFigure 2. SDS-PAGE gels of Hsp90-Cdc37-Cdk4 purification from yeast. A. SDS-PAGE gels show aliquots at different steps during the purification.",
    "Cell lysate–right after step C2 of purification, Supernatant–supernatant at step C3, His beads flow-through–flow-through at step C5, His beads elution–elution at step C5, Flag beads flow through–flow through of flag beads at step C6, Flag beads elution–elution at step 7. B. Two gels are fractions off MonoQ 10/100GL column and size exclusion column runs."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}