{
  "id": 15110,
  "origin_website": "Jove",
  "title": "High-Throughput Image-Based Quantification of Mitochondrial DNA Synthesis and Distribution",
  "procedures": [
    "1. Preparation of the siRNA mixture\nOne day before the start of the experiment, seed cells (e.g., HeLa) on a 100 mm dish so that they reach 70%-90% confluence the next day.\n\tNOTE: All operations must be carried out under sterile conditions in a laminar flow chamber.\nPrepare the appropriate amount of siRNA diluted to a concentration of 140 nM in Opti-MEM medium (see Table of Materials). A 96-well plate can be used as a reservoir.\nAdd 5 µL of the siRNA solution (or Opti-MEM medium for the control samples) to each well of a black 384-well cell culture microplate.\n\tNOTE: Depending on the number of siRNA samples tested, an electronic or multi-channel pipette can be used.\nPrepare the appropriate amount of RNAiMAX transfection reagent solution (see Table of Materials) in Opti-MEM medium. Add 1 µL of RNAiMAX for every 100 µL of medium.\nAdd 10 µL of the transfection reagent solution to each well of the 384-well plate. The most convenient and fastest way to do this is with a reagent dispenser.\nIncubate the siRNA with the transfection reagent for 30 min at room temperature.\n2. Preparation of cells for transfection\nDuring the incubation (step 1.6), aspirate the medium using a suction device (see Table of Materials), and wash the cells with 3 mL of PBS.\nAdd 1.5 mL of trypsin diluted 1:2 in PBS, and incubate the cells at 37 °C for 10 min.\nCheck if the cells have detached; if so, add 3 mL of DMEM medium with 10% FBS. Suspend the cells thoroughly, and transfer them to a 15 mL tube. Take at least 150 µL of the suspension, and count the cells in a cell-counting chamber (see Table of Materials).",
    "Prepare a cell suspension at the appropriate concentration (35,000/mL for the HeLa line) in DMEM medium with 10% FBS, penicillin, and streptomycin.\n3. Cell transfection\nAdd 20 µL of the cell suspension to each well of the 384-well plate using the reagent dispenser. This will result in 700 cells seeded per well.\nIncubate the cells for 1 h at room temperature, and then place them in the incubator for 72 h (37 °C and 5% CO2).\n4. BrdU incorporation\nPrepare a 90 µM solution of BrdU (see Table of Materials) in DMEM medium with 10% FBS.\nAt 56 h after the siRNA transfection (16 h before cell fixation), add 10 µL of 90 µM BrdU solution to each well of the 384-well plate (the final BrdU concentration is 20 µM).\n\tNOTE: The action should be performed as fast as possible; therefore, it is best to use a reagent dispenser, electronic pipette, or multi-dispenser pipette. Remember to prepare control wells without the addition of BrdU.\nIncubate the cells for 16 h (37 °C and 5% CO2).\n5. Labeling of mitochondria\nPrepare a 20 µM solution of BrdU in DMEM with 10% FBS, and add to it the mitochondria tracking dye solution (see Table of Materials) to a concentration of 1.1 µM.\nAt 15 h after the start of BrdU incorporation (1 h before cell fixation), add 10 µL of the mitochondria tracking dye solution (see Table of Materials) to each well of the 384-well plate (the final dye concentration is 200 nM).\n\tNOTE: Use a reagent dispenser, electronic pipette, or multi-dispenser pipette. Remember to retain control wells without the addition of BrdU but with the addition of the mitochondria tracking dye.\nIncubate the cells for 1 h (37 °C and 5% CO2).\n6. Cell fixation",
    "NOTE: All washing is most conveniently carried out using a microplate washer, while the addition of reagents is most quickly carried out using a reagent dispenser.\nUsing the microplate washer (see Table of Materials), rinse each well twice with 100 µL of PBS. After the second wash, leave 25 µL of PBS in the well.\n\tNOTE: Leaving PBS in the well reduces the likelihood of cell detachment during the addition of liquid in the next step. All the washes are completed with the PBS left in; therefore, the solution added in the next step should always be prepared at a 2x concentration as it will be added in an equal volume to the remaining PBS.\nFix the cells by adding 25 µL of an 8% formaldehyde solution in PBS with 0.4% Triton X-100 and Hoechst 33342 at a concentration of 4 µg/mL (the final concentrations of individual reagents are 4%, 0.2%, and 2 µg/mL, respectively) (see Table of Materials).\nIncubate the plate in the dark at room temperature for 30 min.\n7. Blocking\nRinse each well four times with 100 µL of PBS. After the last wash, leave 25 µL of PBS in the well.\nAdd 25 µL of 6% BSA in PBS (the final BSA concentration is 3%) to each well.\nIncubate the plate in the dark at room temperature for 30 min.\n8. Addition of the primary antibodies\nAspirate the BSA using a microplate washer, and leave 10 µL of solution in the well.\nAdd 10 µL of the primary antibody solution prepared in 3% BSA in PBS. Use anti-BrdU at 0.8 µg/mL and anti-DNA at 0.4 µg/mL (the final concentrations of antibodies are 0.4 µg/mL and 0.2 µg/mL, respectively) (see Table of Materials).\nIncubate the plate in the dark at 4 °C overnight.",
    "9. Addition of the secondary antibodies\nRinse each well four times with 100 µL of PBS. After the last wash, leave 10 µL of PBS in the well.\nAdd 10 µL of the 4 µg/mL secondary antibody solution prepared in 6% BSA in PBS (the final concentration is 2 µg/mL). Use isotype-specific antibodies (anti-mouse IgG1 and anti-mouse IgM) conjugated to fluorochromes such as Alexa Fluor 488 and Alexa Fluor 555 (see Table of Materials).\nIncubate the plate in the dark at room temperature for 1 h.\nRinse each well four times with 100 µL of PBS. After the last wash, leave 50 µL of PBS in the well.\nSeal the plate with an adhesive sealing film (see Table of Materials), and store it in the dark at 4 °C. Imaging must be performed within 2 weeks.\n10. Imaging\nNOTE: Imaging must be performed with an automated wide-field microscope; the microscope must be equipped with a motor stage supplied with controls to image individual areas of the plate automatically.\nCheck the autofocus settings in the corner areas of the plate (wells A1, A24, P24, P1) and in the center.\n\tNOTE: For imaging, it is recommended to use a 20x short working distance objective (see Table of Materials) with the highest possible numerical aperture.\nBased on the intensity histograms generated by the imaging software in live view mode, select a sufficiently long exposure time for the individual fluorescence channels so that the resulting image is not oversaturated.\nSet the appropriate number of planes for imaging on the z-axis.",
    "NOTE: The field of view at 20x magnification is large enough that not all cells are in the same plane of focus, so z-sectioning must be performed to view all the cells in their correct plane of focus. Usually, five planes are enough. Depending on the availability of disk space, individual z-stacks or only maximum intensity projections can be saved. The image analysis shown in the representative results section is based on maximum intensity projections.\nSelect the appropriate number of fields of view to display per well.\n\tNOTE: Depending on the confluence, approximately 60-300 cells can be imaged in one field of view. Typically, for HeLa cells with a confluence of 60%-90%, imaging five fields of view will allow one to analyze from 500 cells to over 1,000 cells.\nSelect the wells to be imaged, and start imaging.\n11. Quantitative image analysis\nNOTE: The quantitative analysis of acquired images can be performed using an open-source software such as Cell Profiler15. For the present study, the analysis was performed using the ScanR 3.0.0 software (see Table of Materials).\nStart the analysis by performing background correction for all the images from all the fluorescence channels. Depending on the size of the analyzed objects, select the appropriate filter size: 80 pixels for cell nuclei and 4 pixels for BrdU and mtDNA spots.\nStart segmenting the image by creating a mask of the main object based on the ratio of the intensity of the fluorescence signal to the background for the channel corresponding to the cell nuclei.\nCreate masks for the sub-objects representing the BrdU and mtDNA spots, respectively, using the fluorescence channels appropriate for the given structures.\n\tNOTE: Each sub-object is assigned to the closest main object (cell nucleus).",
    "Set the parameters to be measured during the analysis, and measure the intensity of the individual pixels within each mask for all the fluorescence channels.\n\tNOTE: It is also necessary to calculate the number of sub-objects assigned to a given cell nucleus and the area of each sub-object.\nDefine the derived parameters to be calculated based on the obtained data. To obtain the total fluorescence intensities for the BrdU or mtDNA channel, sum up the intensities of all the sub-objects assigned to a given cell nucleus. To obtain the mean fluorescence intensity, divide the total fluorescence intensity by the sum of the area of the sub-objects assigned to a given cell nucleus.\n\tNOTE: To ensure that the created sub-object (BrdU or mtDNA spot) is actually located in the mitochondria, it is necessary to gate them based on the fluorescence intensity from the mitochondria tracking dye.\nPerform further analysis of the data obtained with the ScanR software using the R 4.2.2 statistical Software16 along with the following packages: dplyr17, data.table18, ggplot219, and ggpubr20. This step is optional.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}