{
  "id": 9980,
  "origin_website": "Jove",
  "title": "Agrobacterium tumefaciens-Mediated Genetic Engineering of Green Microalgae, Chlorella vulgaris",
  "procedures": [
    "All media and solutions must be autoclaved prior to use unless otherwise stated. All centrifuge tubes, pipette tips, etc., should be sterile or autoclaved before use. For easy reference, the media recipes used in this protocol are listed in Table 1.\n1. Preparation of A. tumefaciens  electrocompetent cells\nInoculate Agrobacterium (AGL-1) into a 25 mL sterile shaker flask of LB media (supplemented with rifampicin, 20 mg/L-1) from a frozen glycerol stock and grow overnight at 28-30 °C and 150 rpm.\n\t​NOTE: The Agrobacterium strain AGL-1 is (see Table of Materials) resistant to rifampicin, ampicillin, chloramphenicol, and streptomycin and can be obtained from several suppliers.\nThe following day, dilute the culture 1,00,000-fold by adding 0.5 µL of the overnight culture to 50 mL autoclaved ultra-pure water and spread 10 µL of this diluted culture on an LB plate, and then incubate at 28-30 °C for 1-3 days.\nPick a colony and start a 20 mL overnight culture in LB with rifampicin at 28-30 °C.\nThe next day, inoculate 500 mL LB media (no antibiotic) in a shaker flask with 9 mL of the overnight culture and grow at 28-30 °C until the OD600 reaches 0.5.\nDivide the culture evenly into ten 50 mL centrifuge tubes and chill on ice for 30 min. Pre-cool the centrifuge to 4 °C.\nCentrifuge the tubes at 4 °C and 4000 x g for 15 min. Subsequently, remove as much supernatant as possible using a pipette and resuspend the pellet in each tube in 50 mL of ice-cold water.\nCentrifuge the cells at 4 °C and 4000 x g for 15 min. Remove the supernatant and resuspend the pellet in 25 mL of ice-cold water in each tube.",
    "Centrifuge the cells at 4 °C and 4000 x g for 15 min. Remove the supernatant and resuspend the pellet in 1 mL of ice-cold 10% (w/v) glycerol in each tube.\nCombine all tubes into one 50 mL tube and centrifuge the cells at 4 °C and 4000 x g for 15 min. Remove the supernatant and resuspend the pellet in 400 µL ice-cold 10% (w/v) glycerol. The cell concentration should be about 1-3 x 1010 cells/mL.\nDistribute the cells as 50 µL aliquots in sterile prechilled microtubes. Freeze in liquid nitrogen and store in a -80 °C freezer.\n2. Electroporation of A. tumefaciens\nAdd 50 µL of AGL-1 A. tumefaciens electrocompetent cells into a prechilled 0.1 mm cuvette and add 2 µL of pCAMBIA1302 or similar plasmid (conc 15 ng/µL) (see Table of Materials).\nElectroporate at 2400 V using an electroporator (200 Ω, capacitance extender 250 µFD, capacitance 25 µFD, exponential decay, see Table of Materials). The time constant should be >4.5 ms for successful electroporation with exponential decay.\nImmediately add 1 mL of LB media to the cuvette and gently pipette up and down to mix. Transfer the 1 mL of resuspended cells into a 1.5 mL microtube and incubate it at 28-30 °C for at least 1 h to recover.\nPlate the cells on LB agar containing the appropriate antibiotic (i.e., 50 mg/L of kanamycin for pCAMBIA1302 for prokaryotic selection).\nIncubate at 28-30 °C for 2-3 days.\nSelect one colony, grow overnight in LB with the appropriate selection (50 mg/L of kanamycin for pCAMBIA1302), and cryopreserve the plasmid-containing strain using 50% glycerol at -80 °C for future use.\n3. AMT of C. vulgaris",
    "NOTE: Prepare C. vulgaris (UTEX 395, see Table of Materials) and A. tumefaciens cultures in parallel for co-cultivation. C. vulgaris cultures should be started 3 days before preparing A. tumefaciens cultures. Protocol was modified based on that published by Kumar et al.7.\nPrepare C. vulgaris culture\n\t\nC. vulgaris is traditionally stored on slants or maintained in log-phase cultures in illuminated conditions. From a log phase culture at OD600 = 1.0, spread 0.5 mL onto a Tris-Acetate-Phosphate (TAP, see Table 1) agar plates (1.2% w/v agar A) and grow for 5 days at 25 °C with illumination (50 µE/m2s). This will yield approximately 5 x 106 cells.\nPrepare A. tumefaciens culture\n\t\nGrow A. tumefaciens AGL-1 pCAMBIA1302 strain in a shaker flask by inoculating 10 mL of LB media supplemented with 15 mM glucose, 20 mg/L rifampicin, and 50 mg/L kanamycin (see Table of Materials) using the glycerol stock. Incubate at 28-30 °C and 250 rpm overnight.\nInoculate 1 mL of overnight culture into 50 mL of LB with 15 mM glucose, 20 mg/L rifampicin, and 50 mg/L kanamycin and incubate at 28-30 °C and 250 rpm until the OD600 reaches 1.0.\nCocultivate C. vulgaris and A. tumefaciens\nTo prepare the A. tumefaciens culture for co-cultivation, transfer the grown culture to a 50 mL tube and centrifuge at 4000 x g for 30 min at room temperature. Remove the supernatant using a pipette and wash the cells twice with the induction medium.\n\t\tNOTE: The induction media used is TAP media adjusted to pH 5.5 and supplemented with F/2 medium trace metals and vitamins with 200 µM acetosyringone (AS, see Table of Materials). Resuspend the cells in induction media such that OD600 = 0.5.",
    "To prepare the C. vulgaris culture for co-cultivation, add 25 mL of induction media to the C. vulgaris plate containing ~ 5 x 106 cells. Transfer to a 50 mL tube. Centrifuge the cells at 4000 x g for 15 min at room temperature and discard the supernatant.\nMix the algal cell pellet with 200 µL of the bacterial suspension (OD600: 0.5) and incubate them in a rotary shaker at 21-25 °C at 150 rpm for 1 h.\nSpread the mixed culture (200 µL) onto induction media plates supplemented with 15 mM glucose and incubate at 21-25 °C in the dark for 3 days.\nAfter 3 days, use 10 mL of TAP media supplemented with 400 mg/L cefotaxime or 20 mg/L of tetracycline (see Table of Materials) to collect the microalgae and incubate in the dark at 21-25 °C for 2 days to eliminate A. tumefaciens from the culture.\nPlate 500 µL of the culture onto selective media, e.g., TAP media supplemented with 20-70 mg/L of Hygromycin B (when using pCAMBIA1302) and 400 mg/L-1 cefotaxime or 20 mg/L of tetracycline. Incubate 21-25 °C in the dark for 2 days before placing them in an illuminated chamber.\n\t\tNOTE: Resistant colonies will appear 5-7 days after light exposure.\nPick single colonies from the transformation plate and re-streak them on TAP agar plates supplemented with 400 mg/L of cefotaxime or 20 mg/L of tetracycline and 20-70 mg/L of Hygromycin B.\n4. Colony PCR (cPCR) to confirm gene integration in C. vulgaris  transformants",
    "Extract genomic DNA from a C. vulgaris transformant after subculturing at least twice from a single colony using a plant genomic DNA extraction kit (see Table of Materials). Using this as a template for PCR, design primers for the mgfp5 region of the T-DNA (mgfp5-Fwd: 5' CCCATCTCATAAATAACGTC 3', and M13-Rev: 5' CAGGAAACAGCTATGAC 3').\n\t\nUsing a Q5 high-fidelity DNA polymerase master mix kit (see Table of Materials), perform polymerase chain reaction (PCR) to validate transgene integration.\n\t\tNOTE: The following conditions were used for the present study: 98 °C for 3 min; 35 cycles (98 °C for 10 s, 57 °C for 30 s, 72 °C for 1 min); 72 °C for 5min. Use pCAMBIA1302 as a positive control and wild-type C. vulgaris genomic DNA as a negative control.\nTo confirm that there is no pCAMBIA1302 present in the sample due to residual contamination by A. tumefaciens, use colony PCR. Add a small amount of transformant cells to 10 µL of sterile water and boil at 98 °C for 15 min. Use this as a template for PCR.\n\t\nDesign primers for a region outside of the T-DNA on pCAMBIA1302 (B1-Fwd: 5'AGTAAAGGAGAAGAACTTTTC 3' and B1-Rev: 5'CCTGATGCGGTATTTTCTC 3').\n\t\tNOTE: The following conditions were used for the present study: 94 °C for 3 min; 30 cycles (94 °C for 30 s, 48 °C for 30 s, 68 °C for 5 min); 68 °C for 7 min. Use a boiled colony of A. tumefaciens AGL-1 (pCAMBIA1302) as a positive control and a boiled colony of wild-type C. vulgaris as a negative control.\nTo confirm that there is no A. tumerfaciens contamination present in the sample, use colony PCR. Add a small amount of transformant cells to 10 µL of sterile water and boil at 98 °C for 15 min. Use this as a template for PCR.",
    "Design primers for the virE2 gene contained on the AGL-1 virulence plasmid (virE2-Fwd: 5' AGGGAGCCCTACCCG 3' and virE2-Rev: 5' GAACCAGCCTGGAGTTCG 3').\n\t\tNOTE: The following conditions were used for the present study: 94 °C for 3 min; 30 cycles (94 °C for 30 s, 53 °C for 30 s, 68 °C for 3 min); 68 °C for 7 min. Use a boiled colony of A. tumefaciens AGL-1 (pCAMBIA1302) as a positive control and a boiled colony of wild-type C. vulgaris as a negative control.\nRun PCR samples on a DNA agarose gel along with a ladder (1 Kbp DNA ladder, see Table of Materials) to confirm the size of the resulting fragments16.\n5. Measuring the fluorescence of transformants\nInoculate each transformant from a log-phase maintenance culture or TAP agar slant into 50 mL of TAP supplemented with 200 mg/L-1 cefotaxime and 25 mg/L-1 Hygromycin B such that the starting OD600 = 0.1. Inoculate one culture with wild-type C. vulgaris and only 200 mg/L-1 cefotaxime as the negative control. Incubate at 25 °C at 150 rpm with 150 µmol/m2s of photosynthetically active light (see Table of Materials).\nEvery 24 h, take a 300 µL of sample and measure the absorbance and fluorescence (excitation 488 nm, emission 526 nm) in a 96-well plate reader or UV/Vis spectrometer and fluorometer (see Table of Materials). Use a black plate with a transparent bottom for simultaneous measurements.\n6. Crude protein extraction, protein purification, and SDS-PAGE electrophoresis\nInoculate transformant (#50) from a log-phase maintenance culture into 300 mL of TAP supplemented with 200 mg/L-1 cefotaxime and 25 mg/L-1 Hygromycin B to reach the OD680 = 0.1. Inoculate one culture with wild-type C. vulgaris and only 200 mg/L-1 cefotaxime as the negative control. Incubate at 25 °C at 150 rpm with 150 µmol/m2s of photosynthetically active light.",
    "Extract the crude protein sample from the transformant (#50) and wild-type strains using 5 mL lysis buffer (see Table 1), followed by sonication for 4 min.\nPurify crude protein sample with a Ni-NTA resin through 5 mL polypropylene columns (see Table of Materials).\nLyophilize the 15 mL purified protein samples and resuspend them in 1 mL lysis buffer for SDS-PAGE analysis17.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}