{
  "id": 18121,
  "origin_website": "Jove",
  "title": "Quantitative Analysis of the Cellular Lipidome of Saccharomyces Cerevisiae Using Liquid Chromatography Coupled with Tandem Mass Spectrometry",
  "procedures": [
    "1. Preparation of sterile media for culturing yeast\nPrepare 90 mL of a complete YP medium that contains 1% (w/v) yeast extract and 2% (w/v) bactopeptone.\nPrepare 90 mL of a synthetic minimal YNB medium containing 0.67% (w/v) yeast nitrogen base without amino acids, 20 mg/L L-histidine, 30 mg/L L-leucine, 30 mg/L L-lysine, and 20 mg/L uracil.\nDivide 90 mL of the complete YP medium equally into two 250 mL Erlenmeyer flasks (i.e., 45 mL each).\nDivide 90 mL of the synthetic minimal YNB medium into two 250 mL Erlenmeyer flasks (i.e., 45 mL each).\nAutoclave the flasks with YP and YNB media at 15 psi/121 °C for 45 min prior to use.\n2. Yeast strain\nUse the wild type strain BY4742 (MATα his3Δ1 leu2Δ0 lys2Δ0 ura3Δ0).\n3. Culturing yeast in the complete YP medium with glucose\nAutoclave a 20% (w/v) stock solution of glucose at 15 psi/121 °C for 45 min prior to use.\nAdd 5 mL of the sterile 20% (w/v) stock solution of glucose to each of the two Erlenmeyer flasks containing the sterile YP medium for a final concentration of 2% glucose (w/v).\nUse a microbiological loop to inoculate cells of the wild type strain BY4742 into each of the two Erlenmeyer flasks containing the YP medium with glucose.\nCulture the cells overnight at 30 °C with rotational shaking at 200 rpm.\nTake an aliquot of yeast culture. Use a hemocytometer to determine the total number of yeast cells per mL of culture.\n4. Transferring yeast to and culturing them in the synthetic minimal YNB medium with glucose\nAdd 5 mL of the sterile 20% (w/v) stock solution of glucose to each of the two Erlenmeyer flasks containing the sterile YNB medium to a final concentration of 2% glucose (w/v).",
    "Use a sterile pipette to transfer a volume of the overnight yeast culture that contains the total number of 5.0 x 107 cells into each of the two Erlenmeyer flasks containing the YNB medium with glucose.\nCulture the cells for at least 24 h (or more, if the experiment requires) at 30 °C with rotational shaking at 200 rpm.\n5. Preparation of reagents, labware and equipment for lipid extraction\nPrepare the following: 1) high grade (>99.9%) chloroform; 2) high grade (>99.9%) methanol; 3) 28% (v/v) ammonium hydroxide solution in nano-pure water; 4) glass beads (acid-washed, 425-600 µM); 5) a vortex with appropriate adapter; 6) 15 mL high-speed glass centrifuge tubes with polytetrafluoroethylene lined caps; 7) 17:1 and 2:1 mixtures of chloroform and methanol; 8) a chloroform/methanol (2:1) mixture with 0.1% ammonium hydroxide (v/v); 9) ABC solution (155 mM ammonium bicarbonate, pH = 8.0); 10) a mixture of internal lipid standards prepared in a 2:1 mixture of chloroform and methanol as indicated in Table 1; and 11) 2 mL glass sample vials with polytetrafluoroethylene lined caps for the extraction of cellular lipids.\n6. Preparation of reagents, labware, and equipment for LC\nPrepare the following: 1) acetonitrile/2-propanol/nano-pure water (65:35:5) mixture; 2) a vortex with appropriate adapter; 3) an ultrasonic sonicator; 4) glass vials with inserts for a wellplate; 5) an LC system equipped with a binary pump, degasser, and an autosampler; 6) a C18 reverse-phase column (2.1 mm; 75 mm; pore size 130 Å; pH range of 1-11) coupled to a pre-column system; 7) mixture A: acetonitrile/water (60:40); and 8) mixture B: isopropanol/acetonitrile (90:10).\n7. Lipid extraction from yeast cells\nTake an aliquot of yeast culture. Use a hemocytometer or measure OD600 to determine the total number of yeast cells per mL of culture.",
    "Take a volume of yeast culture that contains a total number of 5.0 x 107 cells (3.3 units OD600). Place this volume of culture into a prechilled 1.5 mL microcentrifuge tube.\nHarvest the cells by centrifugation at 16,000 x g for 1 min at 4 °C. Discard the supernatant.\nAdd 1.5 mL of ice-cold nano-pure water and wash the cells by centrifugation at 16,000 x g for 1 min at 4 °C. Discard the supernatant.\nAdd 1.5 mL of ice-cold ABC solution and wash the cells by centrifugation at 16,000 x g for 1 min at 4 °C. Discard the supernatant. The cell pellet can be stored at -80 °C prior to lipid extraction.\nTo begin the lipid extraction, thaw the cell pellet on ice.\nResuspend the cell pellet in 200 µL of ice-cold nano-pure water. Transfer the cell suspension to a 15 mL high-strength glass screw top centrifuge tube with a polytetrafluoroethylene lined cap. Add the following to this tube: 1) 25 µL of the mixture of internal lipid standards prepared in chloroform/methanol (2:1) mixture; 2) 100 µL of 425-600 µM acid-washed glass beads; and 3) 600 µL of chloroform/methanol (17:1) mixture.\nVortex the tube at high speed for 5 min at room temperature (RT) to disrupt the cells.\nVortex the tube at low speed for 1 h at RT to facilitate the extraction of lipids.\nIncubate the sample for 15 min on ice to promote protein precipitation and the separation of the aqueous and organic phases from each other.\nCentrifuge the tube in a clinical centrifuge at 3,000 x g for 5 min at RT. This centrifugation step allows to separate the upper aqueous phase from the lower organic phase, which contains all lipid classes.",
    "Use a borosilicate glass pipette to transfer the lower organic phase (~400 µL) to another 15 mL high-strength glass screw top centrifuge tube with a polytetrafluoroethylene lined cap. Do not disrupt the glass beads or upper aqueous phase during such transfer. Keep the lower organic phase under the flow of nitrogen gas.\nAdd 300 µL of chloroform-methanol (2:1) mixture to the remaining upper aqueous phase to allow the extraction of sphingolipids and PA, PS, PI, and CL. Vortex the tube vigorously for 5 min at RT.\nCentrifuge the tube in a clinical centrifuge at 3,000 x g for 5 min at RT.\nUse a borosilicate glass pipette to transfer the lower organic phase (~ 200 µL) formed after centrifugation to the organic phase collected at step 7.13.\nUse the flow of nitrogen gas to evaporate the solvent in the combined organic phases. Close the tubes containing the lipid film under the flow of nitrogen gas. Store these tubes at -80 °C.\n8. Separation of extracted lipids by LC\nAdd 500 µL of acetonitrile/2-propanol/nano-pure water (65:35:5) mixture to a tube containing the lipid film obtained at step 7.16. Vortex the tube 3x for 10 s at RT.\nSubject the content of the tube to ultrasonic sonication for 15 min. Vortex the tube 3x for 10 s at RT.\nTake 100 µL of a sample from the tube and add it to a glass vial with an insert used for a wellplate. Eliminate air bubbles in the insert before pacing it into the wellplate.",
    "Use an LC system to separate different lipid species on a reverse-phase C18 column CSH coupled to a pre-column system (see Table of Materials). During the separation, maintain the column at 55 °C and at a flow rate of 0.3 mL/min. Keep the sample in the wellplate at RT.\nUse the mobile phases that consist of mixture A (acetonitrile/water [60:40 (v/v)]) and mixture B (isopropanol/acetonitrile [90:10 (v/v)]). For a positive mode of the detection of parent ions created using the electrospray ionization (ESI) ion source, the ESI (+) mode, the mobile phases A and B contain ammonium formate at the final concentration of 10 mM. For a negative mode of parent ions detection, the ESI (-) mode, the mobile phases A and B contain ammonium acetate at the final concentration of 10 mM.\nUse a sample volume of 10 µL for the injection into both the ESI (+) and ESI (-) mode.\nSeparate different lipid species by LC using the following LC gradient: 0-1 min 10% (phase B); 1-4 min 60% (phase B); 4-10 min 68% (phase B); 10-21 97% (phase B); 21-24 min 97% (phase B); 24-33 min 10% (phase B).\nRun extraction blanks as the first sample, between every four samples, and as the last sample. Subtract the background to normalize data.\nA representative total ion chromatogram from LC/MS data of lipids extracted from cells of the wild type strain BY4742 is shown in Figure 1.\n9. Mass spectrometric analysis of lipids separated by LC\nUse a mass spectrometer equipped with a HESI (heated electrospray ionization) ion source to analyze lipids that were separated by LC. Use the settings provided in Table 2.\nUse the Fourier transform analyzer to detect parent ions (MS1) at a resolution of 60,000 and within the mass range of 150-2,000 Da.",
    "Use the settings provided in Table 3 to detect secondary ions (MS2).\n10. Identification and quantitation of different lipid classes and species by processing of raw data from LC-MS/MS\nSee the Table of Materials for software to carry out the identification and quantitation of different lipids from raw LC-MS/MS files. This software uses the largest lipid database, containing more than 1.5 million lipid ion precursors (MS1) and their predicted fragment ions (MS2). The software also uses MS1 peaks for lipid quantitation and MS2 for lipid identification. A representative chromatogram of two isomeric phosphatidylserine forms (34:0) that have the same m/z value but different retention times, as well as their MS1 and MS2 spectra, are shown in Figure 2, Figure 3, and Figure 4, respectively.\nSearch LC-MS raw files containing full-scan MS1 data and data-dependent MS2 data for free (unesterified) fatty acids (FFA), cardiolipin (CL), phytoceramide (PHC), phytosphingosine (PHS), phosphatidylcholine (PC), phosphatidylethanolamine (PE), phosphatidylglycerol (PG), phosphatidylinositol (PI), phosphatidylserine (PS), and triacylglycerol (TAG) lipid classes using an m/z tolerance of 5 ppm for precursor ions and 10 ppm for product ions. Other search parameters are shown in Table 4. Follow the instructions provided in the software user manual. The identities of internal lipid standards and lipid species with unusual fatty acid composition need to be verified manually.\nTo identify and quantitate different lipid classes and species with the help of freely available open-source alternatives for the Lipid Search software, use the Lipid Data Analyzer (http://genome.tugraz.at/lda2/lda_download.shtml[href=http://genome.tugraz.at/lda2/lda_download.shtml]), MZmine 2 (http://mzmine.github.io/[href=http://mzmine.github.io/]), or XCMS (https://bioconductor.org/packages/release/bioc/html/xcms.html[href=https://bioconductor.org/packages/release/bioc/html/xcms.html]) software to process raw data from LC-MS/MS.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}