{
  "id": 6130,
  "origin_website": "Bio",
  "title": "Small Molecule-Based Retinal Differentiation of Human Embryonic  Stem Cells and Induced Pluripotent Stem Cells",
  "procedures": [
    "Thawing and passaging human ES and iPS cellsSterilization before handling the cellsExpose the Biological Safety Cabinet to UV light for 1 h prior use, spray 70% ethanol and wipe the working area inside the cabinet, the tools and supplies that will be used inside the cabinet.Preparation of Matrigel-coated platesTake 1 aliquot of frozen Matrigel (110 µl) (BD Biosciences) and thaw on ice.Note: The Matrigel aliquots are prepared ahead of time and stored in -80 °C freezer.Dissolve 110 µl Matrigel in 12 ml chilled (4 °C) DMEM/F-12 basal medium (GE Healthcare), pipette up and down to mix the Matrigel and medium very well.Add 2 ml of the mixture of Matrigel and medium to each well of a 6-well plate (Greiner Bio One, DNase and RNase free, treated), and let the plate sit in an incubator (37 °C) for 2-12 h before seeding the cells into the plate.Preparation of Essential 8 human ESC/iPSC culture medium (see Recipe 1)Thawing and seeding cellsIn general, 1 well of the cells in a 6-well plate that is at 60-70% of confluence is prepared to be frozen into 2 cryovials. One vial of cryopreserved cells can be successfully recovered into 1-2 wells of a Matrigel-coated 6-well plate. Note: The number of wells plated may need to be adjusted depending on how many cell aggregates were cryopreserved. Typically, twice as many cell aggregates will need to be plated per well upon thawing to account for lower post-thaw viability than during routine passaging. Label the Matrigel-coated plate, warm Essential 8 culture medium (with supplement of Rock Inhibitor [Recipe 2]) to room temperature (~25 °C), and prepare all other cell culture supplies before starting the protocol to ensure that the thawing procedure is done as quickly as possible.",
    "Quickly thaw the cells in a 37 °C water bath by gently shaking the cryovial continuously until only a small frozen cell pellet remains. Remove the cryovial from the water bath and wipe it with 70% ethanol.Use a 2 ml serological pipette to transfer the contents of the cryovial to a 15 ml conical tube. Note: Using a 2 ml serological pipette instead of a 1 ml micropipette will minimize breakage of cell aggregates. Add 5-7 ml of warm Essential 8 medium (supplied with Rock Inhibitor) dropwise to the 15 ml tube, gently mixing as the medium is added. Centrifuge cells at 270 x g for 3 min at room temperature.Aspirate the medium, leaving the cell pellet intact, gently resuspend the cell pellet in 1 ml of Essential 8 medium (with Rock Inhibitor) using a 2 ml serological pipette, maintain the cells as aggregates.Transfer 0.5 ml of the cell mixture onto a well of a Matrigel-coated 6-well plate containing Essential 8 with Rock Inhibitor (i.e., two wells can be plated from each cryovial). Place the plate in a 37 °C hypoxia-capable incubator (5% CO2, 5% O2), move the plate in several quick, short, back-and-forth and side-to-side motions to evenly distribute the cell aggregates. Do not disturb the plate for 24 h.Note: Uneven distribution of aggregates may result in increased differentiation of human ES and iPS cells (Figure 2). Perform daily medium changes using Essential 8 medium and visually assess cultures to monitor the growth until the next passaging time. Check for undifferentiated colonies that are ready to be passaged (dense-centered) approximately 6-7 days after thawing (Figure 1 and Figure 2A).",
    "Note: If only a few undifferentiated colonies are observed after thawing, it may be necessary to select only these colonies for passaging and replate them in the same size well (i.e., without splitting) on a newly-coated plate.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180613/20180613182721_9278.png Figure 1. Undifferentiated iPSC colonies in Essential 8 media (scale bar = 400 μm) Passaging human ES and iPS cellsHuman ES and iPS cells maintained in Essential 8 medium can be passaged using several different methods. The non-enzymatic EDTA dissociation method is described below: Clean off any flat or differentiating cells (Figure 2B) with a 1,000 µl pipette tip under a microscope in a sterilized working area.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180613/20180613183208_0561.jpg Figure 2. Undifferentiated and differentiating human ESC colonies in culture. A. An undifferentiated human ESC colony. B. A differentiating human ESC colony with whorled appearance that needs to be cleaned up prior to subculture. (scale bars = 400 µm) Rinse cells with 2 ml of DPBS once or twice.Add 1 ml of 0.1% EDTA dissociation reagent per well on a 6-well plate, incubate at room temperature for 3-5 min.Check under a microscope for signs of dissociation.Aspirate EDTA dissociation reagent without disturbing the cells.Add 1 ml of Essential 8 medium (with Rock Inhibitor supplement).Use a cell scraper to lift the cells from the bottom of the well, triturate with a 1,000 µl pipette gently to break down into cell clusters containing 20-40 cells.Add 2 ml of Essential 8 medium (with Rock Inhibitor added) to a new well.Add cells from original well to the new well to reach 20% of confluence. Usually 1:5 ratio for a confluent plate.Note: If there are too few cells, cells don't grow as well; if there are too many cells, cells grow too quickly and should be split soon.",
    "Small clumps are ideal, if cells remain as big chunks, gently triturate the large size cell aggregates with a 1,000 µl pipette for a few times to break them down.Place the plate back into a hypoxia 37 °C incubator (5% CO2 and 5% O2) and evenly distribute cells by shaking plate front to back and side to side as above.Perform daily medium changes, 2 ml Essential 8 medium per well, and visually assess cultures to monitor growth until the next passaging time.Induction of neuro-retinal fateMedium preparationPreparation of Neuronal Stem Cell Culture Medium (NSC) (500 ml) (see Recipe 3).Preparation of NSC medium with 0.5% FBS (100 ml) (see Recipe 4).Preparation of ISLI + KSR Retinal Induction Medium (50 ml) (see Recipe 5).Retinal induction in human ES and iPS cellsWhen the cells in wells reach 60-70% confluence, start treating cells with ISLI + KSR retinal induction medium (2 ml per well of a 6-well plate), daily medium change for 5-6 days. Once the cells are in ISLI + KSR medium, culture the cells in a normoxic 37 °C incubator with 5% CO2 level.Procedure of splitting differentiating cells (Days 6-7) Change 2 ml fresh ISLI + KSR retinal induction medium for cells at least 1 h before splitting.At the time of splitting, aspirate the medium.Add 1 ml TrypLE Express dissociation reagent to the well; incubate 6-8 min at room temperature until the cells loose contact with each other and the plate.Scrape the cells gently from the bottom of the well and transfer the cell suspension into a 15 ml centrifuge tube. Take care not to make single cell suspension.Rinse the well with 2 ml 1x HBSS once to collect the remaining cells from the well.Centrifuge at 270 x g for 3 min.Aspirate the supernatant gently without disturbing the cell pellet.",
    "Add 3-4 ml 1x HBSS to resuspend the cell pellet, centrifuge again at 270 x g for 3 min.Aspirate 1x HBSS gently without disturbing the cell pellet.Resuspend the cell pellet in fresh ISLI + KSR retinal induction medium. The splitting ratio is 1:3. Evenly distribute the cells as above by shaking the plate and return to the incubator under normoxic conditions.Next day, check the cell survival by looking the percentage of cells attached to the bottom of the plate, dead cells do not attach and float in culture medium. If there is too much cell death, rinse cells with 2 ml 1x HBSS once or twice to clean up the dead cells. Wean cells into NSC culture medium supplemented with 0.5% FBS gradually by adding 1 ml ISLI + KSR medium and 1 ml NSC + 0.5% FBS medium on Day 1 post-split; 0.5 ml ILSI + KSR medium + 1.5 ml NSC + 0.5% FBS medium on Day 2; from Day 3 and onward, the differentiating cells will be cultured in NSC + 0.5% FBS medium to let them undergo further differentiation. When the cells reach confluence, the cells need to be split into new Matrigel-coated plates with the TrypLE dissociation method. This is usually done every 7 days with a split ratio of 1:3 to 1:5 depending on the cell line.Note: Rock Inhibitor can be added to the NSC medium at the step to help cell survive after dissociation if the cells are old or stressed. Isolation of Neuroretinal Rosettes (Days 18-21)The differentiating cells are mixed populations that are composed of retinal progenitor cell population and retinal pigmented epithelial progenitor cells (RPE) (Figure 3A) as they both arise from the same optic vesicle.",
    "The retinal stem/progenitors form clusters (neuroretinal rosettes) and can be manually separated and expanded (Figure 3B).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180613/20180613183922_1394.jpgFigure 3. Differentiated Early Retinal Rosettes in Culture. A. Retinal Rosettes prior to picking and sorting at 3 weeks; B. Purified neuro-retinal cultures following picking and replating. Scale bars = 100 μm.Procedure of manually separation of the retinal stem/progenitor cells and retinal pigmented epithelial cells Sterilize the bench surface and any areas on and around the microscope and tools that need to be in direct contact with the cells with 70% ethanol.Change to fresh NSC + 0.5% FBS medium for the cells before picking.Under a microscope, gently scrape the areas that have densely-packed neuronal cells with a sterile micropipette tip. If too large, scrape regions containing 100-200 cell clusters.After most of neuronal areas are lifted, collect the medium that contains the floating neuronal rosettes.Transfer them into a new Matrigel-coated well with a 1,000 µl pipette to let the cells attach and grow in NSC medium in the incubator (37 °C, 5% CO2).Retinal Stem/Progenitor cell expansionThe manually purified retinal stem/progenitors need to be cultured in NSC + 0.5% FBS medium for several months to allow the cells undergo further differentiation to give rise to all types of differentiated retinal neurons (Figure 4). The dissociation method is described below:TrypLE Dissociation Method of Differentiating Retinal Cells Aspirate the old medium.Rinse cells with 1-2 ml 1x HBSS (or DPBS) once or twice.Aspirate 1x HBSS.Add 1 ml of TrypLE Express dissociation reagent to the cells, incubate for 6-8 min at room temperature, and check under the microscope for signs of dissociation (The cell-cell connections loosen up and empty spaces show up among densely packed cells). Do not wait until the cells are lifted (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180613/20180613184432_8638.jpgFigure 4. TrypLE dissociation of differentiating retinal cells for expansion. A.",
    "Morphology of retinal cells before dissociation. B. Morphology of retinal cells after 6 min of TrypLE dissociation. Scale bars = 400 µm.Scrape cells using a cell scraper.Transfer cells into a 15 ml centrifuge tube.Spin at 270 x g for 3 min.Aspirate the supernatant and add 2 ml 1x HBSS and resuspend the cells.Spin at 270 x g for 3 min.Aspirate the supernatant and add NSC + 0.5% FBS medium to resuspend the cells (2 ml per well), usually the splitting ratio is 1:3.Note: Rock Inhibitor can be added to the medium at the step to help cell survive after dissociation if the cells appear stressed.Add 2 ml of cells in NSC + 0.5% FBS medium into the wells.Put the plate into an incubator (37 °C, 5% CO2) and shake left to right and back and forth to evenly distribute the cells.Cells will be cultured in NSC + 0.5% FBS medium.Change media every 2-3 days as needed.At 1 months of induced retinal differentiation, seed cells onto Poly-D-lysine (Sigma-Aldrich) and Matrigel-coated cover glasses and followed by immunocytochemistry analysis to check the retinal differentiation status. At this stage, most of cells are retinal progenitors by their expression of retinal stem/progenitor cell markers PAX6, and LHX2. After characterization, cells can be cryopreserved.Retinal Stem/Progenitor cell cryopreservationFreezing Neuro-retinal Stem Cells Rinse cells with 1-2 ml of 1x HBSS twice.Add 1 ml of TrypLE per well on a 6-well plate and incubate for 6-8 min.During this time, start labeling cryovials with date, cell line, info, etc.Check under a microscope for signs of dissociation as in Step D4.Scrape cells using a cell scraper.Transfer everything into a 15 ml tube.Spin for 3 min at 270 x g.Dispose of the supernatant.Add 2 ml of 1x HBSS and resuspend the cells.Spin for 3 min at 270 x g.",
    "Dispose of the supernatant.Add the calculated amount of freezing medium to resuspend the cells.Add 1 ml of cells and freezing medium to each cryovial.Immediately place all cryovials into a freezing chamber.Transfer chamber into a -80 °C freezer.Next day, remove vials and place into an appropriate box in the -80 °C freezer.Transfer vials to liquid nitrogen next day.Thawing Retinal Stem/Progenitor cellsOne vial of cryopreserved retinal stem/progenitor cells can be successfully thawed into 1 well of a Matrigel-coated 6-well plate. Label the Matrigel-coated plate, warm NSC + 0.5% FBS medium (with supplement of Rock Inhibitor) to room temperature (~25 °C) and prepare all other cell culture supplies before starting the protocol to ensure that the thawing procedure is done as quickly as possible. Quickly thaw the cells in a 37 °C water bath by gently shaking the cryovial continuously until only a small frozen cell pellet remains. Remove the cryovial from the water bath and wipe it with 70% ethanol or isopropanol to sterilize. Use a 1 ml micropipette to transfer the contents of the cryovial to a 15 ml conical tube.Add 7 ml of 1x HBSS dropwise to the 15 ml tube, gently mixing as the medium is added.Centrifuge at 270 x g for 3 min.Aspirate the supernatant and add 2 ml of warm NSC medium (supplied with Rock Inhibitor) to the 15 ml tube to resuspend the cells.Transfer the cell mixture onto an empty well of a Matrigel-coated 6-well plate. Place the plate in a 37 °C normoxic incubator (5% CO2), move the plate in several quick, short, back-and-forth and side-to-side motions to distribute the cell aggregates. Do not disturb the plate for 24 h.Change media next day. If excessive cell death occurs, rinse cells with 1x HBSS before medium change.",
    "Perform medium changes every 2-3 days as needed using NSC medium and visually assess cultures to monitor the growth until the next passaging time.At 2 and 3 months of induced retinal differentiation, seed cells onto Poly-D-lysine (Sigma-Aldrich) and Matrigel-coated cover glasses and followed by immunocytochemistry analysis to check the photoreceptor differentiation status (Figures 5 and 6).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180613/20180613184846_9836.jpgFigure 5. Confluent Neuro-retinal culture following three months of culture (scale bar = 400 μm)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180613/20180613184919_5890.jpgFigure 6. Immunocytochemistry analysis of the retinal cells generated from human iPSCs at 6 weeks of retinal differentiation. Cells expressed retinal stem cell markers PAX6 and LHX2 as well as photoreceptor markers, OTX2 and RCVRN (scale bars = 10 µm).Immunocytochemistry protocolAspirate the old culture media. Rinse cells in 1x HBSS 2 times gently without lifting the cells.Fix cells in 4% Paraformaldehyde solution (Electron Microscopy Sciences) for 30 min at room temperature.Rinse cells in 1x PBS for 3 times, 5 min for each rinse.Block the cells in 10% Normal Donkey Serum Blocking Solution (Jackson Immuno Research Laboratories, the blocking solution is prepared by diluting the stock in 1x PBS that contains 0.5% Triton X-100) for 1 h at room temperature.Add the primary antibodies with pre-determined concentrations (Table 1) (prepared in serum blocking solution) to the cells and incubate overnight in a cool room in a humidified chamber.Table 1. Primary Antibodies for retinal analysisimgsrc:https://en-cdn.bio-protocol.org/attached/image/20180613/20180613190138_0916.jpgNext day, rinse off the non-binding primary antibodies with 1x PBS, 3 times, 5 min for each rinse.Add the secondary Antibodies and incubate at room temperature for 1 h in the dark in a humidified chamber.Rinse off the non-binding secondary antibodies with 1x PBS 3 times, 5 min for each rinse.DAPI (working concentration is 0.5 µg/ml, prepared in PBS) stains the nuclei of cells for 3-5 min.",
    "Mount the cells on cover glasses onto histology slides with anti-fading Fluoromount G mounting medium (Electron Microscopy Sciences).Note: The samples are ready for image collection on a fluorescence-capable microscope."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}