{
  "id": 15366,
  "origin_website": "Jove",
  "title": "A Nanobar-Supported Lipid Bilayer System for the Study of Membrane Curvature Sensing Proteins in vitro",
  "procedures": [
    "1. Cleaning of nanochip\nPlace the nanochip in a 10 mL beaker with the patterned side facing up.\n\tNOTE: This quartz nanochip has been fabricated via electron beam lithography as described before21. The geometry and arrangement of the nanostructure on the chip can be custom designed. The sizes of the gradient nanobars used here are 2000 nm in length, 600 nm in height, and 100 to 1000 nm in width (100 nm step-set).\nCarefully add 1 mL of 98% sulfuric acid to the beaker, and ensure the acid fully covers the front and backside of the chip.\n\tNOTE: 98% sulfuric acid is extremely corrosive and can cause rapid tissue destruction and serious chemical burns upon contact with the skin or eyes. Use it in the fume hood with proper protection.\nSlowly rotate the beaker and add 200 µL of 30% hydrogen peroxide drop by drop until the whole beaker becomes hot. Ensure that sulfuric acid and hydrogen peroxide are well mixed to form piranha solution for the removal of organic molecules from the nanochip17. There are alternative techniques for generating the SLB on clean hydrophilic surfaces, such as UV light and ozone exposure as described earlier23.\n\tNOTE: The reaction is extremely exothermic and can cause the solution to boil, so add hydrogen peroxide to the sulfuric acid drop by drop and keep rotating.\nPlace the beaker in a secondary glass container and keep the nanochip immersed in the piranha solution overnight to clean the impurities thoroughly.\n\tNOTE: Place the beaker in the fume hood without any cover in case the reaction can generate gas.\nTake the beaker out and carefully pipette the piranha solution into an acid waste container.",
    "Load 5 mL of deionized water into the beaker to dilute the residual acid and discard it into the acid waste. Repeat this step five times and use 5 M NaOH to neutralize the acid waste.\nGrab the chip with tweezers and wash with a continuous stream of deionized water to remove residual acid thoroughly. Blow-dry the chip with 99.9% nitrogen gas for SLB formation22.\n2. Generation of small unilamellar vesicles (SUVs)\nAdd 100 µL of chloroform into an amber vial.\n\tNOTE: Chloroform is a highly volatile, colorless liquid, and it can be toxic if inhaled or swallowed. Use it in the fume hood with the mask and gloves on.\nDissolve 500 µg of the lipid mixture in chloroform. The composition of the lipid mixture used here is 89.5 mol% of egg phosphatidylcholines (PC), 10 mol% of brain phosphatidylserine (PS), and 0.5 mol% of Texas Red 1,2-dihexadecanoyl-sn-glycero-3-phosphoethanolamine, triethylammonium salt (Texas Red DHPE).\nBlow-dry the lipid mixture in the vial with 99.9% nitrogen gas until the chloroform is volatilized and the lipid mixture is dry.\n\tNOTE: This step should be performed in the fume hood. Avoid liquid spatter when blow-drying.\nPlace the lipid mixture present in the amber vial without the lid in the aluminum foil-covered vacuum desiccator. Then vacuum dry the sample with a pump for 3 h to completely volatilize the chloroform.\nAdd 250 µL of phosphate-buffered saline (PBS) buffer to the vial. Vortex the solution until it is homogeneous.\n\tNOTE: PBS buffer consists of 150 mM NaCl, without calcium, magnesium, and phenol red; the pH is adjusted to 7.2 for making the PC and PS lipid bilayer.",
    "Sonicate the lipid mixture for 30 min at a frequency of 50 kHz in a bath sonicator. Then transfer the lipid mixture into a 1.5 mL centrifuge tube and seal with parafilm.\nFreeze the lipid mixture in liquid nitrogen for 20 s and then thaw at 42 °C for 2 min in a water bath. Repeat the freeze-thaw cycles 30 times. After that, the lipid mixture looks like a clear liquid.\n\tCAUTION: Liquid nitrogen has a boiling point of about −195.8 ˚C. It can cause frostbite or cryogenic burns. Use it in the unconfined space with heat insulation gloves on.\nRinse two glass gas-tight syringes and the connector of the mini-extruder with ethanol, chloroform, and methanol respectively. Repeat the rinsing sequence five times to pre-clean the apparatus. Leave them in the fume hood until the organic solvent is completely volatilized.\nAssemble the mini-extruder apparatus and pass 500 µL of PBS buffer through the connector to pre-wet the apparatus, then discard the buffer from another syringe. This step removes impurities and facilitates extrusion.\nAssemble the mini-extruder apparatus with a 100 nm pore-sized polycarbonate filter membrane.\n\tNOTE: The pore size of the filter membrane determines the diameter of liposomes.\nTake 500 µL of PBS buffer with one of the syringes and gently push it through the filter to fill the second empty syringe at the other end. Repeat the extrusion back and forth three times to check the apparatus leakage and discard the buffer from the second syringe.\nPass the lipid mixture through the mini extruder to replace the PBS buffer. Then extrude back and forth 20 times to form SUVs. The multilamellar character of the vesicles may be retained with insufficient number of extrusion times, which will affect SLB formation23.",
    "Collect the SUVs from the second syringe to reduce the contamination with larger particles and transfer it into a 1.5 mL centrifuge tube.\n\tNOTE: Remove the syringe straight out of the connector in case the syringe breaks off.\nWrap the tube with aluminum foil to prevent bleaching of fluorescent-labeled lipids and store them at 4 ˚C. Usually, the SUVs can be stored for up to 7 days.\n3. Formation of the SLB on a nanochip\nTake out the cleaned nanochip from deionized water carefully with a pair of tweezer and blow-dry with 99.9% nitrogen gas.\nPerform surface cleaning of the nanochip with air plasma treatment for 1 h.\nAssemble the nanochip in a polydimethylsiloxane (PDMS) chamber, which consists of two pieces of PDMS-a middle PDMS and a top PDMS (Figure 1A). The middle PDMS is thin (~0.5 mm) with a large oval-shaped opening in the center to ensure sufficient exposure to the nanobar pattern. The top PDMS is thick (~4.0 mm) with two small holes within the large oval opening as an inlet and an outlet for liquid handling.\n\t\nPlace the chip on a clean surface with the pattern facing up.\nGently cover the middle PDMS with the chip, and make sure that the whole pattern is exposed to the central area of the large oval-shaped opening in the middle PDMS.\nCover the top PDMS with the middle PDMS and keep its two small holes within the region of the large oval hole of the middle PDMS. Then the PDMS chamber is assembled.",
    "NOTE: PDMS is the most widely used silicon-based organic polymer. It is biocompatible, transparent, as well as deformable to be designed as a customized shape for chip assembly and imaging under the microscope. More importantly, it can be covalently stuck to another PDMS layer or glass tightly after plasma treatment, making it suitable as the chamber to prepare the SLB. This step ensures that each layer of PDMS is tightly fitted to avoid gaps and leakage.\nLoad the SUVs into the PDMS chamber from one of the two small holes in the top PDMS with a pipette and incubate for 15 min at room temperature to form the SLB.\nGently pipette the PBS buffer into the PDMS chamber from one side of the small hole and remove the waste with a cotton bud from the other hole to wash away the unbound SUVs. Then acquire the SLB formed on the nanochip (the quality of the SLB is tested by fluorescence recovery after photobleaching (FRAP) as shown in step 4.4 and discussed in the representative results section).\n\t​NOTE: When pipetting the PBS buffer into the chamber, the pipette tip should be full of the buffer and in contact with the liquid surface to avoid injecting any bubbles.\n4. Imaging the SLB and the curvature sensing protein binding on the nanochip\nNOTE: This section will depend on the microscope system available for the experiment. Here, an overall guideline on how to perform the imaging will be described. The detailed settings can be changed between the different microscope setups.",
    "Set up the laser scanning confocal microscopy using a 100x (N.A.1.4) oil objective. Open the ZEN software to select the excitation laser power that can excite the fluorescence of the lipid and protein. Choose Acquisition mode > Smart Setup > Texas Red DHPE / EGFP.\nAdjust the focus with the focus knob to locate the nanobars on the chip until the nanobar edges are sharp under the lipid channel.\nSet the scanning parameters as below to obtain a control image of the lipid channel before adding protein: Frame Size = 512 px x 512 px (512 pixels x 512 pixels, a pixel size of 124 nm), Bits per Pixel = 16 (16-bit depth), Scan speed = 5, and Averaging = 4 (averaging mode of four times/line).\nConduct the FRAP assay by bleaching the fluorescent-labeled lipid bilayer on a random single nanobar area.\n\t\nSelect the Experiment Regions and Bleaching checkboxes. Draw a circular area of 5 µm diameter which can include the whole nanobar at the center (nanobar size is 2 µm) and add to the Experiment Regions. Input time-lapse imaging parameters as the following example: choose Scan speed = 9 and Averaging = 1. Choose Time Series > Duration = 100 cycles and Interval = 2 s. Input bleaching parameters as the following example: select the Start after # images checkbox and choose three images.\nSelect the laser checkboxes that perform FRAP and change the power to 100.0%. Click Start Experiment for the FRAP experiment.\n\t\tNOTE: FRAP is a common method to characterize the mobility of cellular molecules. If the SLB has good fluidity, the fluorescence in the bleached area will gradually recover as bleached fluorophores diffuse out and unbleached fluorophores from other areas diffuse in.",
    "Load the protein solution into the PDMS chamber and incubate for 5 min at room temperature to allow the binding of the protein on the SLB.\n\tNOTE: The proteins used in Figure 2G,H to demonstrate lipid composition facilitate protein binding on nanobar-curved SLBs are 74 µM GFP and 79 µM GFP-His. These two proteins are green fluorescence proteins without or with His-tag. The proteins used for curvature sensing study in Figure 4 and Figure 5 are 16 µM F-BAR, 16 µM IDRFBP17, and 16 µM FBAR+IDRFBP17. These three proteins are the domains from FBP17, which is a typical BAR protein that is intuitively assumed as both curvature generators and sensors. Each protein volume is 20 µL.\nRe-focus the nanobars and repeat step 4.3 to take images of both lipid and protein channels for protein curvature sensing detection.\nRepeat step 4.4 to conduct the FRAP assay on both lipid and protein channels and perform time-lapse imaging to characterize the mobility of curvature sensing protein.\n5. Reuse of nanochip\nGrab the nanochip with tweezers and carefully detach it from the PDMS chamber in a 50 mL beaker filled with deionized water.\n\tNOTE: This is a critical step. Prevent the tweezers from touching the nanostructure, and do not force the chip to separate to avoid cracks.\nWash the nanochip thoroughly with anhydrous ethanol to remove organic residues attached on the surface.\n\tNOTE: Use clean tissue paper to remove water on the surface before washing with anhydrous ethanol.\n\tCAUTION: Anhydrous ethanol is a highly volatile and slightly hazardous chemical. Avoid contact with the skin and eyes. Use it in the fume hood with the mask and gloves on.\nWash the chip thoroughly with plenty of deionized water to remove residual ethanol. Then blow-dry the chip with 99.9% nitrogen gas.",
    "NOTE: It is important to remove all traces of ethanol on the chip before proceeding to the next step because the piranha acid can react violently with organic solvent and may cause explosions.\nPlace the chip in a clean 10 mL beaker with the pattern side facing up and clean the chip with piranha solution for reuse which follows the same steps as 'cleaning of nanochip'.\n6. Image quantification\nRotate the images acquired by a microscope so that the nanobar array is in a vertical position for subsequent analysis in Fiji software.\nUse a custom-written MATLAB code 'c_pillarmask_averaging' to locate the individual nanobar by a square mask (51 pixels x 51 pixels) both in the lipid channel and protein channel.\n\tNOTE: This MATLAB code is specially designed for the nanochip. It can be obtained on GitHub via the link: https://github.com/wtzhaolab/GNB_SLB_MX.\nSubtract the background signals of each image with the three ROIs (5 pixels x 5 pixels) at the corners of the image by the meshgrid function in MATLAB code 'BarGra_avg'. This operation aims to correct potential uneven background noises caused by the microscope setup or chip leveling on the microscope stage.\nGenerate the average images of the same-sized nanobars using MATLAB code 'BarGra_avg', where each point is the mean of the values at that point in all the individual nanobar square masks. Generate 3D surface plots of the average images in Fiji software to show the average signal distribution around the nanobars intuitively. Choose Analyze > Surface Plot > Input 100 for Polygon Multiplier, and select Shade, Draw Axis, and Smooth checkboxes.",
    "Segment each nanobar into three areas, which include two nanobar-end areas and one nanobar-center area to extract their fluorescence intensities respectively by MATLAB code 'avg_nanobar_quantification'. The sizes of the nanobar ROIs are adjusted according to the dimension of the nanobars using the 'position' file.\nDivide the protein intensities by lipid intensities extracted from the MATLAB code 'avg_nanobar_quantification' at the bar-end area to get the nanobar-end density which excludes the surface area effect.\nPlot the nanobar-end density with different concentrations in GraphPad Prism to get the binding curve. Open the Analyze menu. Choose Nonlinear regression (curve fit) > Binding - Saturation > Specific binding with Hill slope function to fit the curve with the Hill equation and then calculate the KD and Hill coefficient value.\nThe lipid and protein intensities are normalized to their corresponding intensities at the 600 nm nanobars center acquired in the same image using the MATLAB code 'avg_nanobar_quantification'.\nUse the brightest nine pixels of normalized protein intensities at the nanobar-end area divided by the bar-center area to quantify the protein curvature sensing with same-sized nanobars, the value is named as \"end-to-center ratio\". Use the ratio of normalized protein intensity to normalize lipid intensity to quantify the protein curvature sensing range with different-sized nanobars, the value is named as \"Normalized Nanobar-End Density\". These values are calculated by the MATLAB code 'avg_nanobar_quantification'.\nLoad the FRAP stack image in Fiji software. Choose the FRAP area and generate an ROI. Choose the More > Multi measure function to measure the intensity of the FRAP area for each time. Plot the intensity in GraphPad Prism to generate the FRAP recovery curve.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}