{
  "id": 14477,
  "origin_website": "Jove",
  "title": "Marble Burying and Nestlet Shredding as Tests of Repetitive, Compulsive-like Behaviors in Mice",
  "procedures": [
    "All protocols using animals were carried out in strict accordance with the recommendations in the Guide for the Care and Use of Laboratory Animals of the National Institutes of Health. The protocols were approved by the Institutional Care and Use Committee of Wayne State University (Permit Number A3310-01).\n1. Preparation of Cages for Marble Burying and Nestlet Shredding\nUse standard polycarbonate rat cages (26 cm x 48 cm x 20 cm) with fitted filter-top covers for the marble burying test. Add fresh, unscented mouse bedding material to each cage to a depth of 5 cm and level bedding surface by inserting another cage of the same size onto the surface of the bedding. This has the added advantage of impressing a template of parallel lines on the bedding surface that can be used for marble placement.\nPlace standard glass toy marbles (assorted styles and colors, 15 mm diameter, 5.2 g in weight) gently on the surface of the bedding in 5 rows of 4 marbles (see Figure 1A). Wash marbles in mild laboratory detergent, rinse exhaustively in distilled-deionized water, and dry prior to each use.\nUse standard polycarbonate rat cages (19 cm  x 29 cm x 13 cm) with fitted filter-top covers for the nestlet shredding test. Add fresh, unscented mouse bedding material to each cage to a depth of 0.5 cm and pack bedding by insertion of another cage of the same size onto the surface of the bedding.\nWeigh commercially available cotton fiber nestlets (5 cm x 5 cm, 5 mm thick, ~2.5 g each) on an analytical balance and place one nestlet is placed on top of the bedding in each test cage (see Figure 3A).\nSet stop watches or timers for timing session lengths (30 min for each test).\n2. Animal Handling Prior to Testing",
    "House mice individually or in groups in a room with a 12 hr light/dark cycle. Provide all mice with food and water ad libitum. Handle mice gently for three to five days prior to testing. Use mice of either sex for both tests.\nPerform behavioral testing between 9:00 am and 4:00 pm and transport all home cages containing mice to the testing room 60 min before the start of testing.\n3. Marble Burying Test\nPlace one mouse into a corner of the cage containing marbles, being careful to place the mouse on bedding as far from marbles as possible, and place the filter-top cover on the cage. Withhold food and water during the test. Allow mouse to remain in the cage undisturbed for 30 min.\nRemove the mouse and return it to its home cage after test completion, taking extreme care not to move or dislodge the marbles in the process of removing the subject from the cage.\nTask scorers (2-3) blind to the treatment conditions or genotype of the mouse being tested to count the number of marbles buried. Score a marble as buried if two-thirds of its surface area is covered by bedding. Average scores for the number of marbles buried for each mouse.\nRetrieve all 20 marbles from the bedding. Dispose of bedding.\n4. Nestlet Shredding Test\nPlace one mouse into a cage containing a single, preweighed nestlet and place the filter-top cover on the cage. Withhold food and water during the test. Leave mouse undisturbed in the cage with the nestlet for 30 min.\nRemove mouse and return to it to its home cage after test completion. Remove the remaining intact nestlet material from the cage with forceps and allow to dry O/N.",
    "Weigh remaining unshredded nestlet and divide this weight by the starting weight to calculate percentage of nestlet shredded. If desired, score the form of the nest produced by the subject mouse using a definitive 5-point nest rating scale17 but realizing that this scale is generally intended for scoring nest building, not obsessive-like shredding.\nDiscard remaining shredded nestlet material and bedding.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}