{
  "id": 2068,
  "origin_website": "Cell",
  "title": "Nuclear transfer system for the direct induction of embryonic transcripts from intra- and cross-species nuclei using mouse 4-cell embryos",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation of recipient mouse embryos\nTiming: 6 days\nHere, we detail preparation of recipient embryos for NT by performing in vitro fertilization (IVF) of mouse oocytes and sperm and collection of 4-cell stage embryos arrested at G2 phase with demecolcine. Refer to Manipulating the Mouse Embryo: A Laboratory Manual (Behringer et al., 2014[href=https://www.wicell.org#bib1]) for the standard methods of mouse embryo manipulation.\nSuperovulation is induced by injecting 7.5 U of pregnant mare serum gonadotrophin (PMSG) to 3 or 4 C57BL/6 female mice (>8 weeks of age) and then 48 h later, 7.5 U of human chorionic gonadotropin (hCG). We normally perform the injection at 5:00–7:00 PM.\nOn the next day at 7:30–9:30 AM, euthanize a male mouse by cervical dislocation.\nFor collecting sperm from a DBA/2 fertile male mouse (>8 weeks of age), hold the cauda epididymis by forceps, cut the ductus epididymis with a small surgical scissors (Natsume Seisakusho Co., Ltd., B-12), collect sperm with a fine needle (TGK, 454-50-75-01), transfer the sperm with the same needle to 200 μL drop of human tubal fluid (HTF) medium in a 35-mm dish covered with liquid paraffin on a heated Thermo plate.\nPreincubate it for 1.5 h at 37°C under 5% CO2 in air for capacitation.\nDuring the sperm preincubation, euthanize female mice by cervical dislocation.\nCollect cumulus-oocyte complexes (COCs) from the excised oviducts of sacrificed C57BL/6 female mice 15–16 h after hCG injection. For this COCs collection, transfer the excised oviducts in a 35-mm dish covered with liquid paraffin on a Thermo plate.\nTear off the membrane of the ampulla of fallopian tube by a fine dissecting needle (TGK, 454-50-75-01) and pull COCs using the same needle out of the fallopian tube.\nRecover COCs into pre-equilibrated HTF medium (200 μL drop) on a Thermo plate.",
    "Soon after the recovery of COCs, add the preincubated sperm suspension prepared in step 2 to the COCs-containing HTF medium to be the final concentration of 2 × 102 sperm/μL using P10 Pipetman, and further incubate at 37°C under 5% CO2 in air for 2 h.\nFor removing cumulus cells, add 12 μL of hyaluronidase (10 mg/mL) to the fertilized zygotes-containing HTF medium at 2 h post insemination (hpi) and incubate at 37°C under 5% CO2 in air for 5 min.\nAfter denudation, wash the zygotes several times in pre-equilibrated potassium simplex optimized medium (KSOMaa), transfer the washed zygotes to drops of KSOMaa (35 μL, covered with liquid paraffin) in a 60-mm dish, and incubate at 37°C under 5% CO2 in air.\nAt 6 hpi, check the morphology of zygotes under the microscope and remove abnormal embryos such as parthenogenetically activated, polyspermy, degenerated, and fragmented embryos.\nFurther culture normally fertilized embryos in drops of KSOMaa (35 μL, covered with liquid paraffin) until reaching the 4-cell stage at 40 hpi.\n(Optional) Injection of mRNA or siRNA into the IVF-derived BDF1 embryos is performed from 6 hpi and completed within 2 h. If the transgenic mouse ES cell line, termed NeoR5 (Miyamoto et al., 2011[href=https://www.wicell.org#bib16]) containing 20–30 copies of Lac operator repeats, is used as donor cells, the injection of 200 ng/μL Lac repressor mCherry (LacR-mCherry) mRNA enables us to trace the injected nuclei due to the specific accumulation of LacR-mCherry at the transgene Lac operator repeats (Figure 1[href=https://www.wicell.org#fig1], arrows).\nmRNA or siRNA solution is spun down by benchtop centrifuge (Bio Medical Science, BSR-Mini6000KS) at 22°C for 1 min.\nLoad 2 μL of mRNA or siRNA solution to Femtotip using micro loader (Eppendorf) (Figures 2[href=https://www.wicell.org#fig2]A and 2B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1552-Fig2.jpg\nFigure 2. RNA injection into fertilized eggs using the Eppendorf Femtojet 4i system",
    "(A) A Femtotip (left) and micro tips (right, Eppendorf) to load mRNA or siRNA solution to Femtotips.\n(B) The process of loading solution to Femtotip using a micro loader tip (steps 1 and 2) and the Femtotip loaded with 2 μL of solution is connected to Eppendorf Femtojet 4i injector (step 3).\n(C) Femtojet 4i system set for mRNA injection, placed on the right of Figure 2D. Rid is open and injector is not connected (red arrow).\n(D) Insertion of the filled Femtotip to the Femtojet 4i system (red arrow) and our manipulation system for RNA/DNA injection to eggs/embryos.\nInsert the filled Femtotip to injector (Figure 2[href=https://www.wicell.org#fig2]B).\nTurn on Femtojet 4i. Make sure that the injection tube is disconnected when turning on (Figure 2[href=https://www.wicell.org#fig2]C). After the calibration, insert the injection tube (Figure 2[href=https://www.wicell.org#fig2]D) and apply clean function to remove air bubbles. Choose the appropriate pressure setting; in our hands, pi: 300 hPa and pc: 50 hPa are used (Figure 2[href=https://www.wicell.org#fig2]C). Injection time is controlled by foot pedal in order to achieve an equal volume of injection (typically, 0.05–0.2 s).\nInject 5–10 pl of mRNA or siRNA solution to the cytoplasm of zygotes during 6–8 hpi in M2 medium. Microinjection is performed at 22°C.\nThe injected zygotes are cultured in KSOMaa drops (35 μL, covered with liquid paraffin).\nNote: The drops of media should be prepared under liquid paraffin 1 day before sperm/oocyte collection and equilibrated for 12–16 h. After collection of the cauda epididymis and oviduct from male and female mice respectively, all steps were performed under liquid paraffin.",
    "Note: When loading mRNA or siRNA solution into Femtotip, bubbles are often contaminated at the tip of Femtotip. In that case, pipetting using micro loader can remove the bubble. It is important to remove as much bubbles as possible from the tip.\nNote: LacR-mCherry protein stored in embryos is imported into nuclei and can mark the place of nuclei. Furthermore, the specific accumulation of LacR-mCherry at the transgene Lac operator repeats distinguishes injected NeoR5 and other embryonic nuclei. Alternatively, transgenic donor cells such as Histone H2B-GFP-expressing cells could be used for tracing the injected nuclei. However, it might be difficult to distinguish the injected nuclei and embryonic nuclei if fluorescent proteins are expressed from injected nuclei and finally accumulated in embryonic nuclei.\nCritical: After the injection, leave the injected embryos at 22°C for more than 10 min for recovery. If embryos are returned to the incubator soon after injection, embryo lysis is often observed. Embryos should not be kept at 22°C more than 30 min.\nDuring 40–42 hpi, prepare KSOMaa drops containing 0.1 μg/mL demecolcine (35 μL, covered with liquid paraffin) and transfer to the incubator for equilibration (at least 30 min). Prepare M2 medium containing 0.1 μg/mL demecolcine while waiting for the equilibration of KSOMaa with demecolcine and store the M2 medium with demecolcine on ice until use. Transfer the 4-cell stage embryos to the equilibrated KSOMaa drops containing 0.1 μg/mL demecolcine before 43 hpi and further culture until 46 hpi at 37°C under 5% CO2 in air.\nCritical: To avoid a potential change in demecolcine concentration in the embryo culture medium, prepare culture drops including 0.1 μg/mL demecolcine just before the NT experiment.\nNuclear transfer to elicit embryonic transcriptional reprogramming (NT-ETR)\nTiming: 2–3 h",
    "This section describes the NT process in which donor cells are fused with a G2-arrested mouse 4-cell stage embryo. We named this NT system as NT-ETR, and include a schematic of the process of NT-ETR in Figure 3[href=https://www.wicell.org#fig3].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1552-Fig3.jpg\nFigure 3. The whole process of NT-ETR\nIVF-derived BDF1 mouse embryos are injected with or without LacR-mCherry mRNA solution at 6 hpi and cultured in KSOMaa medium containing 0.1 μg/mL demecolcine from 40 hpi. At 46 hpi, NT of differentiated donor cells is performed. The NT embryos are further cultured for 2 or 24 h and subjected to immunofluorescence staining, qRT-PCR or RNA-seq analyses. IVF represents in vitro fertilization. Figure 3 is modified from the original Figure 3 of Tomikawa et al. (2021)[href=https://www.wicell.org#bib20].\nAt 45 hpi, detach the donor cells (differentiated ES, C2C12 or Oryx dammah cells) from PBS-pre-washed culture dishes by the treatment with 0.25% Trypsin-EDTA solution for 1–2 min at 37°C under 5% CO2 in air. The Trypsin-EDTA solution containing cells are mixed with each culture medium and cells are collected by centrifugation (300 g, 5 min). Resuspend the pellets in each culture medium at 0.1–2 × 105 cells/mL.\nTo collect the differentiated ES cells, ES cells cultured in the differentiation medium for 4 days are collected for NT.\nMonolayers of C2C12 cells at approximately 60%–70% confluency (semi-confluent) are collected and used for NT.\nOryx dammah cells after three passages are used for NT when cells reach at 60%–70% confluency.\nNote: We have not rigorously synchronized the cell cycle of donor cells. It might be possible that rigorous cell cycle synchronization, for example by using demecolcine for donor cell cycle synchronization as well, would further improve the reprogramming efficiency.",
    "Thaw 5 μL of the frozen HVJ-E solution on ice. Then, mix with 20 μL of the diluted Cell Fusion Buffer from the kit (GenomeONETM-CF kit, dilute the original buffer solution in the kit with ultra-pure water by 20 times).\nPrepare each reagent drop (10 μL for M2 medium and donor cell suspension, and 5 μL for HVJ-E solution) aligned on a 10-cm dish lid, which is covered with mineral oil as shown in Figure 4[href=https://www.wicell.org#fig4]A. Keep the rest of the prepared HVJ-E solution (15 μL should be left) on ice.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1552-Fig4.jpg\nFigure 4. Technical points during NT-ETR procedure\n(A) Drops of reagents for NT-ETR, set on the 10 cm dish lid.\n(B) Our manipulation system for NT-ETR. Holding and injection pipettes are set on the manipulator, equipped with the XYClone laser system.\n(C) Aspiration of two donor cells together with HVJ-E solution just before injection of the cells to a 4-cell embryo. Two to three times more volume of HVJ-E solution than donor cells is needed for successful fusion of donor cells with a 4-cell embryo.\n(D) The process of making a hole in the zona pellucida of a recipient 4-cell embryo by the XYClone laser system (I and II). Red pointer in the black circle marks the place for laser illumination. Scale bar, 20 μm.\n(E) Injection of two donor cells and HVJ-E solution into the perivitelline space of a recipient 4-cell embryo through the hole of zona pellucida, produced by XYClone laser illumination (I–IV). Scale bar, 20 μm.\nSet up the manipulation system on microscope. Our setting is shown in Figure 4[href=https://www.wicell.org#fig4]B.\nTransfer the 4-cell embryos incubated in the demecolcine-containing KSOMaa medium to a M2 medium drop with 0.1 μg/mL demecolcine at 46 hpi just before NT.",
    "Aspirate HVJ-E solution into the injection pipette, and pick up two donor cells with a minimal volume of cell suspension medium (see troubleshooting 1[href=https://www.wicell.org#sec6.1]). Relatively small cells are picked up.\nNote: A single nucleus can be also fused with the arrested 4-cell embryos. We have confirmed that at least 2 nuclei can be reprogrammed in a 4-cell embryo. The advantage of injecting multiple nuclei is that it can increase the chance of detecting newly transcribed genes from the transplanted nuclei.\nTransfer donor cells to a HVJ-E solution drop and aspirate the cells together with the two to three times more volume of HVJ-E solution than donor cells (Figure 4[href=https://www.wicell.org#fig4]C).\nAnchor an embryo with holding pipette, and make a small hole in the zona pellucida by the XYClone laser system (laser power: 220) (Figure 4[href=https://www.wicell.org#fig4]D).\nNormally, one or two treatments with laser illumination is enough to make a hole on zona pellucida for injection pipette to penetrate.\nCritical: Avoid illuminating with the laser more than two times as it can damage embryos.\nNote: In case the XYClone laser system is not available, a piezo micromanipulator can be also used to make a hole in the zona pellucida to deliver donor cells to the perivitelline space of recipient 4-cell embryos.\nInsert the injection pipette containing cells and HVJ-E solution into the perivitelline space of a recipient 4-cell embryo and place the tip of the pipette between two blastomeres (Figure 4[href=https://www.wicell.org#fig4]E). Then, donor cells are ejected with HVJ-E solution (Figure 4[href=https://www.wicell.org#fig4]E).\nLeave the manipulated embryo in a M2 medium drop for 5 min at 22°C.",
    "Critical: The activity of the HVJ-E solution decreases significantly after returning to 22°C. If the manipulation time exceeds more than 1 h, prepare the HVJ-E solution drops again. In this case, the remaining HVJ-E solution prepared at step 10 should be kept on ice and such ice-cold solution can be used for making HVJ-E drops for NT-ETR. If this condition is kept, the efficiency of cell fusion should be more than 80% (see troubleshooting 2[href=https://www.wicell.org#sec6.3]).\nTransfer the manipulated embryos to equilibrated KSOMaa medium containing 0.1 μg/mL demecolcine and culture for 2 and 24 h (see troubleshooting 3[href=https://www.wicell.org#sec6.5]). When identifying newly transcribed genes, NT embryos are cultured in the demecolcine-containing KSOMaa medium with or without 25 μg/mL α-amanitin (final concentration) for the comparison.\nUse the NT embryos for immunofluorescence, reverse transcription-polymerase chain reaction (RT-PCR) or RNA-sequencing (RNA-seq) analyses.\nIf NT embryos are subjected to immunostaining, fix embryos in 4% paraformaldehyde and follow the protocol described in Tomikawa et al. (2021)[href=https://www.wicell.org#bib20].\nIf NT embryos are used for RT-PCR, 3–5 embryos are extracted using Arcturus PicoPure RNA isolation kit as described in Tomikawa et al. (2021)[href=https://www.wicell.org#bib20].\nIf NT embryos are subjected to RNA-seq, 3–5 embryos are transferred to lysis buffer as follows.\nTreat the NT embryos with Tyrode’s solution for removing zona pellucida, followed by three times washes with 0.1% BSA/PBS (see troubleshooting 4[href=https://www.wicell.org#sec6.7]).\nFill a glass capillary with 1 μL of 0.1% BSA/PBS by capillary action.\nPick up 3–5 embryos and the minimal volume of BSA/PBS to the BSA/PBS-filled glass capillary.\nTransfer the NT embryos in 1 μL of 0.1% BSA/PBS to 9.5 μL of 1× Reaction buffer from SMART-seq v4 Ultra Low Input RNA Kit. SMART-seq library preparation was performed using SMART-seq v4 Ultra Low Input RNA Kit[href=https://www.takarabio.com/resourcedocument/x33067] and Nextera DNA Sample Preparation Kit according to the manufacturer’s instruction.",
    "Pause point: Fixed embryos can be stored for a week at 4°C. When snap-freezing of lysed embryos in liquid nitrogen is performed, such frozen lysates can be stored at −80°C up to a month.\nNote: For detecting embryonic transcription from the injected cells, NT embryos are incubated for 24 h after NT-ETR. NT embryos collected 2 h after NT-ETR are used as a negative control.\nNote: For RNA-seq analyses, paired-end sequencing (50 bp + 25 bp) was performed by the NextSeq platform (IIllumina). More than 10 million reads per sample are recommended to obtain.\nDetection of newly transcribed genes from the injected nuclei\nTiming: 1–4 h for steps 20–23\nTiming: 1–2 h per sample for steps 24–27\nTiming: 1–2 h per sample for steps 28–36\nTiming: 1–4 h for steps 37–39\nTiming: 3–4 h per sample for steps 40 and 41\nTiming: 1–4 h for steps 42–46\nFor well annotated species with available cDNA references, a combination of kallisto (Bray et al., 2016[href=https://www.wicell.org#bib3]) and sleuth (Pimentel et al., 2017[href=https://www.wicell.org#bib18]) was used to quantify transcriptional abundances and identify newly transcribed genes (steps 20–36). This pipeline was developed for NT-ETR using three strains of mice (Tomikawa et al., 2021[href=https://www.wicell.org#bib20]). For organisms with less well annotated genomes or where cDNA references are not available, the alternative pipeline based on STAR aligner (Dobin et al., 2013[href=https://www.wicell.org#bib4]) and DESeq2 (Love et al., 2014[href=https://www.wicell.org#bib14]) was used (steps 37–46). This second pipeline was used for the Oryx dammah data from Tomikawa et al. (2021)[href=https://www.wicell.org#bib20]. In general, pipelines based on kallisto/sleuth will be faster than those based on STAR/DESeq2.\nReference genome preparation\nTranscriptomes must be downloaded. For the three mouse strains used for NT-ETR in Tomikawa et al. (2021)[href=https://www.wicell.org#bib20], cDNA references were available at the Sanger Mouse Genomes Project: https://www.sanger.ac.uk/data/mouse-genomes-project/[href=https://www.sanger.ac.uk/data/mouse-genomes-project/]",
    "Generate a combined reference genome by concatenation of the cDNA fasta file. This may be achieved using cat at the command line:\ncat genome1.cdna.fa genome2.cdna.all.fa genome3.cdna.all.fa > merged.cdna.fa\nTrimming of adapter sequences and quality control (recommended)\nInitial quality control (QC) checks can be done with fastqc, available from the Babraham bioinformatics site: https://www.bioinformatics.babraham.ac.uk/projects/fastqc/[href=https://www.bioinformatics.babraham.ac.uk/projects/fastqc/]\nfastqc -o OutputDir -t Sample1_R1.fastq.gz Sample1_R2.fastq.gz\nReads were trimmed of adapter sequences using TrimGalore! available from Babraham: https://www.bioinformatics.babraham.ac.uk/projects/trim_galore/[href=https://www.bioinformatics.babraham.ac.uk/projects/trim_galore/]\ntrim_galore --paired -o OutputDir Sample1_R1.fastq.gz Sample1_R2.fastq.gz\nThe result of trimming will generate new pair of fastq files trimmed of adapter sequences with filenames following the convention Sample1_1_val_1.fq.gz and Sample1_2_val_2.fq.gz for read 1 and read 2, respectively.\nTranscript quantification\nDownload and install kallisto. Full installation instructions are available at the Patcher lab GitHub repository: https://pachterlab.github.io/kallisto/[href=https://pachterlab.github.io/kallisto/]\nIndex the newly generated merged cDNA reference file using kallisto:\nkallisto index -i merged.cdna.idx merged.cdna.fa\nTo align reads to the transcriptome, use the quant function with the trimmed fastq files:\nkallisto quant -i merged.cdna.idx -o OutputDir Sample1_1_val_1.fq\nSample1_2_val_2.fq -b 100\nThis will generate a file of transcript abundances with maximum likelihood estimated abundancies stored in the tsv file and bootstrapped samples stored in the h5 file (see troubleshooting 5[href=https://www.wicell.org#sec6.9]).\nTo reduce time spent on these stages, steps 24–26 can be run for all samples in parallel using a HPC cluster.\nDifferential transcript abundance and downstream processing\nHaving generated transcript abundances for all relevant samples (steps 24–27), downstream analysis relies on the R package Sleuth. Full installation instructions and help can be found at the Patcher lab GitHub repository: https://pachterlab.github.io/sleuth/[href=https://pachterlab.github.io/sleuth/]\nSamples are read into Sleuth and pre-processed using the function sleuth_prep:\nidata <- data.frame(path=path/to/samples, sample=samples, timepoint =\nc(\"NoAmn\",\"NoAmn\",\"NoAmn\",\"Amn\",\"Amn\",\"Amn\"),stringsAsFactors=FALSE)\nso <- sleuth_prep(idata, read_bootstrap_tpm = TRUE, extra_bootstrap_summary =\nTRUE)\nA linear model (full model) is fit to the abundance data with a parameter accounting the two conditions:",
    "Ttome <- sleuth_fit(so, ∼timepoint, 'full')\nA second (reduced complexity) model can be fit to the data, which assumes abundancies equal in the two conditions:\nTtome <- sleuth_fit(so, ∼1, 'reduced')\nTtome <- sleuth_fit(so, ∼1, 'reduced')\nA likelihood ratio between the full model and reduced model is then used to determine differential abundance:\nTtome <- sleuth_lrt(so, 'reduced', 'full')\nTtome <- sleuth_fit(so, ∼1, 'reduced')\nA data frame summary of the results can be generated by calling sleuth_results to allow export to other formats:\nsleuth_table_gene <-\nsleuth_results(Ttome,'reduced:full','lrt', show_all = FALSE)\n(Optional) To quantify differential abundance at the gene level rather than the transcript level, a data frame containing the mapping of transcripts to gene level annotation can be passed at sleuth prep stage:\nTtome <- sleuth_prep(idata,read_bootstrap_tpm = TRUE,\ntarget_mapping = GeneDF, extra_bootstrap_summary = TRUE)\n(Optional) As an alternative to a likelihood ratio test, it is possible to calculate differential abundancies using a Wald test:\nmodel <- sleuth_wt(so, 'timepointNoAmn','full')\n(Optional) Dimensionality reduction in the form of PCA may be applied to the data using Sleuth’s inbuilt function plot_PCA. Alternatively, individual abundance files can be read into R and other programming environments and PCA run using appropriate in-built functions. Note that due to the limited number of samples, approaches such as UMAP and tSNE are not appropriate.\nTo identify newly transcribed genes, steps 28–34 were calculated by comparing α-amanitin- treated and untreated NT samples.",
    "To identify strain-specific newly transcribed genes, differential expression between α-amanitin-treated and -untreated samples were calculated using step 32 using a strain-specific mapping of transcriptome to strain-specific gene (see troubleshooting 6[href=https://www.wicell.org#sec6.11]). This can either be done by manually generating a spreadsheet of mappings or using the read.gtf function of the refGenome R package to read the .gtf files and extract the \"transcript_id\" and \"gene_name\" entries and appending a genome identifier to the \"gene_name column\". If genomes were downloaded from the Sanger Mouse Genomes project website, the \"gene_name\" column will already be appended with a genome identifier.\nReference genome preparation\nAs before, reference genomes must first be downloaded. The Oryx dammah genome assembly (Dudchenko et al., 2017[href=https://www.wicell.org#bib5], 2018[href=https://www.wicell.org#bib6]; Humble et al., 2020[href=https://www.wicell.org#bib8]) and gff3 annotation was downloaded from the DNAZoo website: https://www.dnazoo.org/assemblies/Oryx_dammah[href=https://www.dnazoo.org/assemblies/Oryx_dammah].\nNote: While STAR is capable of using gff3 files, it may be helpful to convert them to gtf files using the gffread function (http://ccb.jhu.edu/software/stringtie/gff.shtml[href=http://ccb.jhu.edu/software/stringtie/gff.shtml]):\ngffread oryx.gff3 -T -o oryx.gtf\nGenomes are first indexed for use with STAR aligner. Full installation instructions for STAR are available at the Dobin GitHub repo https://github.com/alexdobin/STAR[href=https://github.com/alexdobin/STAR]). Note that both mouse and oryx genomes must be indexed, and indexing may take several hours for larger genomes. Example code for indexing the oryx genome will look like:\nSTAR --runMode genomeGenerate --limitGenomeGenerateRAM 48000000000 --\ngenomeDir OryxGenomeIndexFolder –genomeFastaFiles\noryx.genome.dna.toplevel.fa --sjdbGTFfile oryx.gtf --sjdbOverhang 149\nAdapter trimming and QC\nRead files should be pre-processed with fastqc and TrimGalore! as in pipeline 1 (see steps 22–23).\nTranscript quantification\nAdapter-trimmed reads are first aligned to the mouse genome to filter out mouse transcripts, with unmapped reads subsequently mapped to the oryx genome. To map to the mouse genome, the following options were used (see troubleshooting 5[href=https://www.wicell.org#sec6.9]):\nSTAR --genomeDir MouseGenomeIndexFolder --sjdbGTFfile mouse.gtf --\noutReadsUnmapped Fastx --sjdbOverhang 149 --readFilesIn Sample1_1_val_1.fq\nSample1_2_val_2.fq --quantMode GeneCounts",
    "To map unmapped reads to the oryx genome, the following options were used:\nSTAR --genomeDir OryxGenomeIndexFolder --sjdbGTFfile oryx.gtf --outReadsUnmapped\nFastx --sjdbOverhang 149 --readFilesIn path/to/mouse/results/Unmapped.out.mate1\npath/to/mouse/results//Unmapped.out.mate2 --quantMode GeneCount\nTo speed up this stage, steps 39–40 can be applied to all samples in parallel using HPC platforms.\nDownstream analysis\nThe result of STAR alignment is an output folder containing reads counts, which are stored in a tab delimited file ReadsPerGene.out.tab, and a bam file containing sequence alignment. Differential expression (DE) of individual genes is calculated using DESeq2 based on the count data in ReadsPerGene.out.tab. Installation instructions for DESeq2 can be found at Bioconductor: https://bioconductor.org/packages/release/bioc/html/DESeq2.html[href=https://bioconductor.org/packages/release/bioc/html/DESeq2.html]. Example code for performing DE analysis is shown below:\nddsHTSeq<-DESeqDataSetFromHTSeqCount(sampleTable=sampleTable,\ndesign=∼condition)\ndds <- DESeq(ddsHTSeq)\nres1<-results(dds, contrast=c(\"condition\",\"NT\",\"Am\"))\n(Recommended) Bigwig files can be generated from individual sample bam files to visualize mapped reads using genome browsers such as IGV (https://software.broadinstitute.org/software/igv/[href=https://software.broadinstitute.org/software/igv/]). This is recommended for less completely annotated genomes such as Oryx dammah. Bigwig files can be generated from bam files using DeepTools (https://deeptools.readthedocs.io/en/develop/index.html[href=https://deeptools.readthedocs.io/en/develop/index.html]):\nbamCoverage --minMappingQuality 1 --bam Sample1.bam -- binSize 10 --\nskipNonCoveredRegions --outFileName Sample1.bw\nFor identification of newly transcribed genes, steps 42–43 were calculated by comparing α-amanitin-treated and untreated NT samples.\nOrtholog identification\nFollowing identification of differentially expressed genes in Oryx dammah, orthologs to bovine gene were extracted from the extended gff3 files. To do so, a compiled list of all ortholog matches or part matches were extracted from the gff3 file e.g.,:\nawk 'OFS=\"∖t\" {if ($3==\"match\") {print $1,$4-1,$5,$7,$9}}' oryx.gff3 >\noryx_matches.txt\nA list of transcript/gene identified with partial matches could then be extracted using grep with keyword “BOVIN”.\ngrep \"BOVIN\" oryx_match.txt > oryx_bovine_match.txt\nThe resultant tab delimited txt file will contain mapping form transcript IDs in the oryx genome to bovine gene IDs.",
    "(optional) To identify other orthologs e.g., mouse or human, step 45 can be repeated using keywords \"HUMAN\" or \"MOUSE\".\nMotif analysis was performed on the promoter regions of differentially expressed gene sets\nTiming: 2 h per sample\nMotif analysis\nThe TSS for each gene in each genome of interest was identified using GenomicFeatures package in R and exported as a tab delimited bed file:\nrefgenes <- makeTxDbFromGFF(\"mousegenome1.gtf\",format=\"gtf\") transcripts\n<- genes(refgenes, columns=c(\"tx_id\",\"tx_name\"))\ntss <- resize(transcripts, width=1, fix='start')\nwrite.table(as.data.frame(tss), file =\n\"MouseGenom1TSS.bed\",quote=FALSE,sep=\"∖t\",col.names=FALSE)\nThis result of step 47 is a bed file containing the TSS location of genes. Coordinates can be extended using bedtools (https://bedtools.readthedocs.io/en/latest/[href=https://bedtools.readthedocs.io/en/latest/]) slop function:\nbedtools slop -i MouseGenom1TSS.bed -g mouse.geome1.chrom.sizes -b 1000 >\nPromoters.mouse.genome1.bed\nIndividual promoter bed files could be filtered by differentially expressed gene lists:\ngrep -f Delist1.txt MouseGenom1TSS.bed > DEMouseGenom1TSS.bed\nFor example, if Delist1.txt contains a list of DE genes from a given mouse strain (genome 1), the bed file would filter the TSS (+/- a specified size) coordinates of only those genes, allowing subsequent strain-specific motif analysis.\nGenome sequences for the DE promoter regions of a given mouse genome could be extracted with bedtools function fastaFromBed:\nfastaFromBed -fi mouseGenome1.fasta -bed DEMouseGenom1TSS.bed -fo\nDEMouseGenom1TSS.fasta\nFinally, de novo motif analysis was performed using Homer (Heinz et al., 2010[href=https://www.wicell.org#bib7]). Full installation instructions are available from http://homer.ucsd.edu/homer/:\nfindMotifs.pl DEMouseGenom1TSS.fasta fasta OutputDir -mset vertebrates\nSteps 47–51 could be repeated for each genome of interest, to generate strain-specific enrichment for NT-ETR using 3 different strains of mice and for the mouse/oryx NT-ETR."
  ],
  "subjectAreas": [
    "Bioinformatics",
    "Cell Culture",
    "Cell Biology",
    "Developmental Biology",
    "Molecular Biology",
    "Gene Expression"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology"
  ]
}