{
  "id": 9349,
  "origin_website": "Jove",
  "title": "Brain Slice Biotinylation: An Ex Vivo Approach to Measure Region-specific Plasma Membrane Protein Trafficking in Adult Neurons",
  "procedures": [
    "All animal handling and tissue harvesting was performed in accordance with the guidelines of the University of Massachusetts Medical School Institutional Animal Care Use Committee (IACUC), following the approved protocol #A1506 (Melikian, P.I.).\nRequired solutions\nArtificial cerebrospinal fluid (ACSF) - Make fresh daily\n125 mM NaCl, 2.5 mM KCl, 1.2 mM NaH2PO4, 1.2 mM MgCl2, 2.4 mM CaCl2, 26 mM NaHCO3, and 11 mM glucose\nNote: Prepare ACSF as a 10x stock solution, excluding NaHCO3 and glucose. Make 1x working solutions daily from the 10x stock, supplementing with fresh NaHCO3 and glucose.\nSucrose-supplemented ACSF (SACSF) – Make fresh daily\n250 mM sucrose, 2.5 mM KCl, 1.2 mM NaH2PO4, 1.2 mM MgCl2, 2.4 mM CaCl2, 26 mM NaHCO3, and 11 mM glucose\nNote: Prepare SACSF as a 10x stock solution, excluding NaHCO3 and glucose. Make 1x working solutions daily from the 10x stock, supplementing with fresh NaHCO3 and glucose.\nSulfo-N-hydroxysuccinyl-SS-Biotin (sulfo-NHS-SS-biotin, Pierce Chemical Company)\nStock solutions should be 200 mg/ml in DMSO and are resistant to multiple freeze/thaw cycles. Aliquots are stored at -20 °C. The succinyl ester is rapidly hydrolyzed in aqueous solution, so working solutions should be prepared immediately prior to applying to slices.\nSlice Quench Solution\nACSF supplemented with 100 mM glycine\nRIPA Lysis Buffer\n10 mM Tris, pH 7.4, 150 mM NaCl, 1.0 mM EDTA, 1% Triton-X-100, 0.1% SDS, 1% Na deoxycholate\nRIPA with Protease Inhibitors (RIPA/PI) – Make fresh daily\nRIPA supplemented with 1 μM leupeptin, 1 μM pepstatin, 1 μM aprotinin, and 1 mM phenylmethyl sulfonyl fluoride.\n1. Prepare Brain Slices\nMake fresh 1x SACSF and 1x ACSF\nChill SACSF on ice in a small beaker. This will be used to hold the freshly harvested mouse brain.\nSaturate the ACSF and SACSF with oxygen by bubbling with 95%/5% O2/CO2, 20 min on ice.",
    "P30-38 mice should be used for optimal tissue viability. Sacrifice animals by cervical dislocation and decapitation, and rapidly remove brains into prechilled, oxygenated SACSF.\nUsing a vibrating microtome, make 300 μm brain sections in region of interest.\nIf desired, slices can be further dissected prior to recovery to enrich for particular brain regions or separate right and left hemispheres to use as control and experimental slices, respectively.\nUsing a fire-polished Pasteur pipette, transfer slices to mesh-bottomed chambers set into 24-well plates.\nAllow slices to recover for 40 min, 31 °C in oxygenated ACSF, with continual, gentle bubbling.\n2. Drug Treatment (if appropriate) and Slice Biotinylation\nFollowing recovery, wash slices 3x in prewarmed (37 °C), oxygenated ACSF bubbling constantly with 95%/5% O2/CO2.\nAdd test compounds and incubate with continuous oxygenation.\n\t\nFor convenience, add a 1/10th volume of 10x concentrated drug, and mix by gently inverting.\nShake plates gently in a water bath at the desired temperature.\nFollowing drug treatment, rapidly chill slices by washing 3x in ice cold ACSF.\n3. Biotinylate Surface Proteins\nPrepare 1.0 mg/ml sulfo-NHS-SS-biotin in ice cold ACSF immediately prior to labeling.\nAdd 0.75 ml sulfo-NHS-SS-biotin to slices and incubate slices on ice, 45 min.\nWash slices three times quickly with ice cold ACSF, then incubate for 10 min in ice cold ACSF on ice.\nWash slices three times with ice cold slice quench buffer and incubate with 0.75 ml slice quench buffer two times, 25 min, on ice to quench free sulfo-NHS-SS-biotin.\n4. Prepare Tissue Lysates\nWash slices three times in ice cold ACSF and transfer each slice to a microcentrifuge tube using a fire-polished Pasteur pipette.\nGently pellet slice by centrifuging 200 x g, 1 min and carefully aspirate remaining ACSF.",
    "Add 400 µl ice cold RIPA/PI and break up tissue by pipetting up and down once through a P200 pipette.\nTransfer dissociated slice/RIPA to a fresh tube and incubate 30 min, 4 °C, rotating, to complete lysis.\nPellet cellular debris by centrifuging, 18,000 x g, 15 min, 4 °C.\nDetermine lysate protein concentrations using the BCA protein assay, with bovine serum albumin (BSA) as a standard.\n5. Isolate Biotinylated Proteins\nOptimize Bead/total protein ratio.\nNote: Individual protein expression levels can vary widely across different brain regions. Unless all of the biotinylated protein in a given amount of tissue lysate is captured, it is not possible to accurately detect any potential changes in surface expression. Therefore, it is imperative to empirically determine the optimal bead/total protein ratio for a particular protein/brain region prior to embarking upon a new slice biotinylation study.\n\t\nIncubate 25 µl streptavidin agarose beads with increasing amounts of tissue lysate (approximate range 25-200 µg), and then proceed as described below for binding, washing and elution steps.\nQuantify the resulting immunoreactive bands and choose a bead/lysate ratio in the linear range of binding that will permit accurate quantification of either increased or decreased protein surface expression.\nPrepare Streptavidin-Agarose Beads\n\t\nDetermine total bead volume needed for all samples. Prepare a sufficient bead volume for that amount plus one extra (i.e. 4 samples at 25 µl/sample = 100 µl beads + one extra = 125 µl beads.\nVortex Streptavidin bead stock and pipette out desired volume. If using a P200 pipette, cut off the end of the tip to prevent blockage or bead damage.\nWash beads 3 times in 0.5-1.0 ml RIPA/PI to remove preservatives, vortexing after each RIPA addition and collecting beads between washes by centrifuging 18,000 x g, 1 min, at room temperature.",
    "Aspirate off buffer between washes using a glass Pasteur pipette attached to a vacuum flask. A plastic P200 tip attached to the end of the glass Pasteur pipette provides finer control when aspirating. It is not necessary to remove absolutely all the buffer for the first two washes, as it risks aspirating beads into the pipette. After the final wash, remove as much excess buffer as possible without aspirating the beads.\nAdd RIPA/PI to bring beads back to their original volume, pipetting up and down to resuspend. Avoid vortexing at this point, as beads will stick to the tube wall.\nAliquot beads into microcentrifuge tubes using a P200 with the tip cut off. Pipette up and down several times between sampling to assure beads remain evenly suspended and dispersed among the tubes.\nBind biotinylated proteins to streptavidin beads\n\t\nDistribute cell lysates to the tubes containing the agarose beads. For experiments where multiple samples are being compared, make sure to use the same amount of protein for each sample for accurate comparisons.\nAdd additional RIPA/PI to bring to samples to a 200 µl minimal volume. This assures that samples will mix adequately during the incubation and also unifies the protein concentrations across samples.\nPlace tubes in a tube rotator and mix overnight at 4 °C.\nIn separate tubes, dispense an equivalent of the total lysate volume used for each sample. Alternatively, if the sample volumes are high, a fraction of total lysate volume can be reserved instead, to accommodate maximal load volumes on SDS-PAGE gels. These will be used to normalize the surface expression to the total protein amount.",
    "Add either an equal volume of 2x or 1/5 volume of 6x SDS-PAGE sample buffer and either incubate at 4 °C, in parallel with bead samples, or store at -20 °C until samples are analyzed.\n6. Elute and Analyze Samples\nPellet beads by centrifuging 18,000 x g, 2 min, at room temperature.\nAspirate supernatant and wash beads three times with 0.75 ml RIPA. To minimize bead loss, leave a small head volume of buffer above beads between washes. After the final wash, remove as much RIPA as possible, without disrupting the bead pellet.\nElute biotinylated proteins from streptavidin beads by reducing the disulfide linkage. Add 25 µl 2x SDS-PAGE reducing sample buffer, vortex well and rotate samples 30 min, room temperature.\nNote: Many membrane proteins have a high tendency to aggregate when boiled in SDS-PAGE sample buffer, severely impairing their electrophoretic mobility. If this is the case for the protein being investigated, avoid heating samples and, instead, elute slowly at room temperature. If boiling is absolutely necessary (e.g. if another protein assessed in parallel requires boiling), sample buffer can be supplemented with 2 M urea (final concentration) to minimize aggregation. While effective in reducing aggregation in some cases, urea often compromises band appearances.\nAnalyze samples by immunoblot.\nThaw total lysate samples and rotate in parallel with bead samples, 30 min, room temperature.\nSeparate proteins on SDS-PAGE gels.\nIdentify protein(s) of interest by immunoblotting.\n\t\nBe certain that bands are detected in the linear range of detection for proper quantification.\nTo assure that the biotinylation reagent has not gained access to intracellular proteins via damaged/compromised cells. This is best accomplished by immunoblotting in parallel for an intracellular protein specific to the cell type being investigated.",
    "Quantify band densities and calculate relative protein surface density as a percent of the total protein expression level.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}