{
  "id": 6480,
  "origin_website": "Bio",
  "title": "An Adjustable Protocol to Analyze Chemical Profiles of Non-sterile Rhizosphere Soil",
  "procedures": [
    "Equipment preparationGrowth tubes for plant development and subsequent chemical sampling (Figure 2A).To create growth tubes, in a fume-hood use a pre-heated soldering iron to melt 7 mm holes in the base of 30 ml plastic tubes. This step will need to be repeated for as many tubes are required. Growth tubes can be thoroughly washed with pure distilled water and reused several times. Fit tubes with 40 mm2 miracloth at the bottom to hold soil. Fill tube with desired soil matrix (~40 ml), for instance 9:1 (v/v) mixture of sand and dry compost (see Materials and Reagents for more information).Note: For larger plant species, such as 4-week-old maize seedlings, growing in clay agricultural soil, 50 ml Falcons were suitable with similar sized holes (Figure 2C). Pressurized lid (for larger Falcons) to aide in pushing the liquid through the growth tube (if necessary; Figure 2D).Create these lids by drilling a hole, smaller than the diameter of the syringe, and forcing the syringe through, securing with strong and watertight epoxy. Applying silicon to the edges and thread of the lid will ensure a tight seal to allow sufficient pressure. This set-up may be required for soil that retains more water, in order to shorten the time of flushing the soil with extraction solution.Note: Simultaneous assays can be performed using the same experimental set-up. For instance, non-destructive rhizosphere or bulk soil can be sampled prior to extraction solution application to allow elemental analysis, or DNA/RNA extractions for determination of microbial community compositions and soil functional analysis.Experimental set-up of growth system (Arabidopsis; Figures 2A and 2B)Stratify Arabidopsis seeds for 2 days in the dark in autoclaved water at 4 °C.Note: Seeds can be surface sterilized if appropriate for the experimental design. Such techniques are effective and straightforward (Lindsey et al., 2017).",
    "Wrap soil-filled growth tubes in tin foil to limit algal growth and stand growth tubes in individual Petri dishes to prevent cross-contamination between bio-replicates. Seal tubes to the Petri dish with masking tape to provide stability. Stand tubes in a tray.Apply 15 ml of water to individual Petri dishes to saturate the soil.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190516/20190516020142_3056.jpgFigure 2. Experimental set-up for sampling rhizochemicals. A-C. Photos show collection tubes containing plant-free and plant-containing soils (1. Arabidopsis and 2. Maize). Tubes were covered with foil to prevent algal growth and were placed onto small Petri dishes to prevent cross-contamination. D. Example of the pressurized lid that connects to an epoxy-secured syringe. This allows the application of pressure during sample collection, in order to increase (this word was pluralized) the speed and yield of sample collection while minimizing exposure of living cells to potentially damaging organic solvents. When using larger plants such as maize, the shoot is gently removed with scissors just before applying the pressure.Pipette four seeds onto the soil surface of individual tubes. If desirable, prepare unseeded soil-only samples to act as controls. Cover trays with a lid and place into a growth cabinet with the appropriate growth conditions. Petri dishes should be supplied with 5-10 ml of water bi-weekly.After seedling emergence, carefully thin seedlings using tweezers to leave one seedling per pot.Note: In short day growth conditions (8.5:15.5 light:dark; 20 °C light, 18 °C dark; 65-70% relative humidity) final watering, prior to metabolite extraction, should be no later than 3 days.Experimental set-up of growth system (Maize; Figure 2C)Imbibe seeds overnight in autoclaved, sterile water before placing on Petri dishes containing sterile, damp filter paper in the dark at 23 °C for two days. Plant germinated seeds in soil-filled growth tubes, 1.5 cm from the soil surface.",
    "Wrap growth tubes in foil and cover the surface with black plastic beads to limit algal growth.Place the tubes in a growth chamber with the desired environmental conditions.Note: Soil can be adapted depending on the experimental design, but more organically rich soil may produce harder to interpret results. Furthermore, depending on the soil used, 25% of perlite will aide drainage during the collection with extraction buffer (see below). For the example demonstrated here, compost was used, but agricultural soil can also be used (see Pétriacq et al., 2017 for more details).Metabolite extraction from control and Arabidopsis/maize soil (Figure 3)Collect plant soil samples from tubes containing one 5-week-old Arabidopsis plant, or one 17-day-old maize plant (timings can depend on experimental design).Note: The timings used in this protocol assume similar growth conditions to those mentioned above. For Arabidopsis, with the seedling intact, apply ice-cold extraction solution (5 ml), to the top of the tubes and avoid any disturbance of the soil surface.Note: With larger plant, you may want to sever, or simultaneously sample the seedling. If doing so, be careful to avoid contaminating the extraction solution with damaged plant material. Furthermore, when using larger plants such as maize, the shoot can be gently removed with scissors just before applying the pressure. After 1 min, 4-4.5 ml can be collected from the drainage hole in 5 ml centrifuge tubes. For use with maize, gently slit the seedling with a blade around 0.5 cm of the soil surface, and subsequently apply 15 ml of the extraction solution to the soil and induce pressure to the top of the pot, using a modified lid containing a syringe. After 1 min, 5-10 ml are collected in centrifuge tubes.",
    "Centrifuge to pellet soil residues (5 min, 3,500 x g), aliquot 4 ml of supernatant into a new centrifuge tube.Flash-freeze in liquid nitrogen and freeze-dry until complete dryness.Notes: Samples can now be stored at -80 °C until chemical analysis.  If the soil is not saturated, less flow-through can be collected. The longer the buffer is in contact with the plant the more chance there is of tissue damage and bias through cellular metabolites. Limit time for which samples are exposed to MeOH is less than 1 min, to prevent the risk of root damage. Irrelevant for sampling with sterile distilled water.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190516/20190516020959_1928.jpgFigure 3. Sampling workflow. See figure for notes.Preparing samples for UPLC-qTOF analysisResuspend dried aliquots into 100 µl of methanol:water:formic acid (50:49.9:0.1, v/v).Sonicate at 4 °C for 20 min, vortex and centrifuge (15 min, 14,000 x g, 4 °C) to remove potential particles that could block the UPLC column. Alternatively, filter the samples through 0.2 µm disposable cartridge obtained from analytical suppliers.Transfer final supernatants (80 µl) into glass vials containing a glass insert before injection through the UPLC system. During this process, generate a quality control (QC) sample by mixing 5 µl of each sample into one single vial. This will act as a control for analytical reliability of the LCMS system, and for optional normalization of the data in case of MS intensity drift when running a high number of samples (Broadhurst et al., 2018).UPLC-qTOF Set-upLC and MS characteristics are fully detailed in Pétriacq et al. (2017). Using a SYNAPT G2si HDMS Q-TOF mass spectrometer (Waters), coupled to a UPLC BEH C18 column (2.1 x 50 mm, 1.7 μm, Waters) with a guard column (VanGuard, 2.1 x 5 mm, 1.",
    "7 µm, Waters) for separation of compounds at a flow rate of 400 μl min−1, prepare the mobile phases as A; water with 0.05% formic acid, and B; acetonitrile with 0.05% formic acid with the following gradient: 0-3 min 5-35% B, 3-6 min 35-100% B, holding at 100% B for 2 min, 8-10 min, 100-5% B. Set the column temperature to 45 °C and use an injection volume of 10 μl.Use a mass range of 50-1,200 Da and a scan time of 0.2 s (ESI- and ESI+) with the instrument operating in sensitivity mode for the MS full scan (i.e., without collision energy). Ramp collision energy in the transfer cell from 5 to 45 eV (MSE), using appropriate voltage conditions for ESI- mode (e.g., Capillary, -3 kV; Sampling cone, -25 V; Extraction cone, 4.5 V) and ESI+ mode (e.g., Capillary, +3 kV; Sampling cone, +25 V; Extraction cone, 10 V). Source temperature for each mode should be 120 °C, desolvation temperature at 350 °C, desolvation gas flow at 800 L h-1 and cone gas flow at 60 L h-1.Calibration of the qTOF mass spectrometerPrior to analysis, calibrate the Q-TOF detector with a solution of sodium formate. During each run, accurate mass measurements can be ensured by infusing leucine enkephalin peptide as an internal reference (i.e., lock mass) with 10 s scan frequency, cone voltage of 40 V and a capillary voltage of 3 kV.Inject 6 QCs samples at the beginning of the analytical run, then every 10 injections, and finish with QC sample at the end of the analytical run.Inject blank samples (50% methanol, v/v) between each treatment and between ESI- and ESI+ ionization modes for stabilization of the electrospray ionization source.",
    "Processing of MS data for statistical analysis (see Figure 4 for a schematic of the subsequent analytical steps) and deconstruction of rhizochemicalsAfter the run has finished, convert raw files, here obtained from MassLynx, into CDF or mwXML format, using the Databridge function in MassLynx, or ProteoWizard (MsConvert).For subsequent alignment and integration of metabolic peaks, use R with the XCMS package installed (Smith et al., 2006) and the standard script described in Supplemental Data S1[href=https://os.bio-protocol.org/attached/file/20190513/3245 Supplemental Data S1.docx]. Peaks can be retained for analysis when present in all bio-replicates (n = 3, in an example where there are 3 bio-replicates), at a threshold intensity of 10 (I = 10) and at maximum resolution range of 20 ppm. XCMS parameters should be adjusted according to the mass spectrometer used in the study (here this is q-TOF), and nuances of the particular dataset being investigated.Normalize peak values from each run against total ion current (TIC). For each sample, normalized peak values will generate separate datasets for ESI+ and ESI- ionization modes.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190516/20190516021726_1700.jpgFigure 4. Analytical workflow for the identification of rhizosphere metabolites. Mass spectrometry data are processed using XCMS (Smith et al., 2006) for peak identification (RT-m/z features) and alignment, grouping, and retention time (RT) correction, then checked for quality control and normalized (Median-centered, cube-root transformation and Pareto scaling). Metabolomics overview is given by principal component analysis (PCA), which is crucial to verify sufficient metabolomics separation between extracts from plant-containing and plant-free tubes. If the global differences are not convincing by PCA, the rhizosphere chemistry in the plant-containing soil might be too much diluted by bulk soil chemistry, and further adjustments of collection systems are necessary (e.g., bigger plants, other soil, different extracting solutions, and longer sample extraction).",
    "In the specific case of binary comparison (plant-free versus plant-containing tubes), biomarker detection can be performed with S Plot obtained from (Orthogonal) Partial Least Square-Discriminant Analysis (O)PLS-DA (Worley and Powers, 2013). This supervised technique provides Variable Important for the Projection (VIP) scores that reflect the discriminant statistical power of each variable for the PLS discriminant model. Ultimately, univariate statistical comparison via volcano plots (fold change vs. statistical significance) allows for straightforward identification of metabolic markers that are specific to the rhizosphere (i.e., rhizochemicals). Statistical analysis of MS dataFor this experimental set-up, the strength in identifying ‘rhizosphere’ chemical signatures comes from a combination of the experimental design, i.e., free soil vs. planted soil, and the subsequent binary statistical comparison, obtained through a volcano plot showing statistical significance against biological significance. Further statistical tests (e.g., ANOVA, t-tests with consideration for multiple comparisons, such as false discovery rate–FDR or Bonferroni corrections, where appropriate) can be used for the quantification and annotation of markers that are affected by the treatment. Such pipelines depend on the conditions used in the initial structure of the experiment and question being asked.  Prior to analysis, an appropriate normalization is required. Median-normalization, cube-root transformation and Pareto scaling of the data seem to perform best on metabolomics datasets (van den Berg et al., 2006): the original structure of the dataset is conserved while the influence of peaks with high intensity is softened compared to peaks with low intensity.Global differences in metabolic signals between treatment/point combinations can be visualized for anions (ESI-) and cations (ESI+) separately, or jointly where both datasets are concatenated, by principal component analysis (PCA), using MetaboAnalyst online (v. 3.0; http://www.metaboanalyst.ca[href=http://www.metaboanalyst.ca/]; (Xia et al., 2015) on median-normalized, cube-root-transformed and Pareto-scaled data.",
    "For quantification of the number of ions showing quantitative differences between binary treatments (specifically the comparison between plant-free soil and plant-containing soil), volcano plots can be created on median normalized, Pareto-scaled and cube-root transformed data, with a cut-off value of > 2 fold-change (Log2 > 1) and a statistically significant threshold of P < 0.05 (Welch’s t-test; MetaboAnalyst). These markers can then be selected for identification. When a condition of ‘rhizosphere’ chemicals is screened against the corresponding soil, then volcano plots can deconstruct the markers that are specific to semiochemicals of the rhizosphere. When soil chemistry is the target, conventional heatmap or cluster analysis could be performed and the relevant markers further retained for subsequent analysis (such as ANOVA with subsequent Hierarchal clustering through Pearson’s correlation (Williams et al., 2018). It is highly recommended that you adhere to the guidelines laid out by the Metabolomics Standards Initiative (Fiehn et al., 2008; Goodacre et al., 2007; Sumner et al., 2007).Annotation of putative metabolic markersPutative annotation of the selected ion markers can be assigned, based on accurately detected m/z values at a mass accuracy < 30 ppm), using METLIN chemical database (Smith et al., 2005), or other chemical/metabolite database available online, or in house. PubChem can then be used to check the predicted pathway or class annotation (https://pubchem.ncbi.nlm.nih.gov/[href=https://pubchem.ncbi.nlm.nih.gov/])."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}