{
  "id": 7049,
  "origin_website": "Bio",
  "title": "Headpost Surgery for <em>in vivo</em> Electrophysiological Recording in the Mouse Inferior Colliculus during Locomotion",
  "procedures": [
    "Headpost surgeryPlace mice on a heating pad in the stereotaxic frame under Isoflurane anesthesia (1-4%).Apply eye ointment to prevent dryness.Inject meloxicam subcutaneously around the neck (5 mg/kg).Clean the scalp by wiping with 70% ethanol.Inject 2% lidocaine underneath the scalp as a local anesthetic.Make an incision to expose the top of the skull.Gently remove the tissue around the posterior end of the skull over the IC and cerebellum with forceps.Clean the skull surface and let it dry completely.Mark the target area on the skull with a pen (AP: ~5.0 mm from bregma; ML: ~1.0 mm).Choose a location for the ground screw toward the anterior end of the skull (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3840/bioprotoc-10-23-3840-g003.jpgFigure 3. Headpost surgery and craniotomy. A. Exposed skull during headpost surgery. At this point, a ground screw has been secured, and 3 marking lines have been drawn based on stereotaxic measurements (the two rostrocaudal lines mark the midline and 1 mm lateral to the midline, respectively; the mediolateral line marks the location 5 mm posterior to the bregma). B. Headpost has been cemented. C-D. Craniotomy performed on the day of recording. (A-B) on the day of headpost surgery, and (C-D) on the day of recording.Carefully screw a ground screw into the skull using a screw driver. Take care not to go too deep into the brain. The depth can be assessed by examining the dent in the brain surface when removing the brain from the skull for histology. In the case of the screw listed here, we find that about 3 turns (~1.2 mm) give consistently good placement. Apply a small amount of dental cement only at the bottom portion of the screw.Position a headpost using a holder attached to the stereotaxic manipulator, such that IC is accessible for future craniotomy (~2 mm x 1 mm).",
    "Make sure the skull area posterior to the target area is sufficiently exposed and free of tissue to allow cementing of the posterior side of the headpost circle.Apply dental cement to secure the headpost. To prevent the headpost from coming off, it is critical to prepare the skull surface as dry as possible. Use swabs and wipes to absorb any liquid and wait until the surface becomes dry. Lift up the headpost and apply cement to its bottom surface, then bring it down to the skull. Apply cement to fill any space left out between the headpost and the skull. The skull surface posterior to the target area, below the posterior rim of the headpost circle, runs vertically, creating large space between the skull and the headpost. It may take several rounds of cementing to fill in this space to form a thick, stable base. Going around the inner rim of the headpost circle, extend cement from the skull over the top surface, encasing the rim. Keep the target area for craniotomy as free of cement as possible. Prevent cement from touching the skin because this may weaken the cementing.Turn off the isoflurane and let the animal recover.Habituation to head fixation and treadmillNote: We kept our mice on a reverse light-dark cycle, and our behavior and recording sessions occurred during the dark period. Wait at least one day after the head-post surgery.Place the mice on a treadmill and hold them by the headpost and screw in the headpost to the head-fixing frame.Adjust the height of the head-fixing frame and the angle of the treadmill plate (~10 degrees) so that the mice can move as naturally as possible.Keep the mice head-fixed for ~30 min per day. Repeat the procedure for > 3 days.",
    "For habituation, we looked at the following behavioral changes: 1) a reduction in urination and defecation while on the treadmill, and 2) the mice stop struggling and begin to run voluntarily.Surgery on the day of neural recordingPlace the mice in the stereotaxic frame using the headpost under isoflurane anesthesia.Based on the markings made during the headpost surgery, perform craniotomy (~2 mm x 1 mm) using a dental drill. The opening should be large enough for the electrode array. The skull overlying the IC tends to be thick and vascular, so drill slowly, applying saline to the region periodically. Also, take care not to damage the transverse sinus, which can be included in the craniotomy. We recommend performing durotomy later right before the electrodes are lowered into the brain (Procedure D, step 3).Cover the opening with Kwik-Cast.Let the mice recover.Neural recordingPosition the mice on the treadmill and secure their head in the head fixing frame.Remove Kwik-Cast over the craniotomy.Perform durotomy using a 30 g needle and fine forceps.Position the electrodes at target locations, set the depth to zero at surface, and lower them into the brain. To minimize the interference by line noise, we performed neural recording in a shielded walk-in sound booth, had the light source for surgery turned off during recording, and kept the electrode connector and the headstage as close as possible. Certain type of animal movements such as hunching can introduce artifacts into neural recording. Movement-related artifacts are often similar across electrodes, so when necessary, they can be digitally subtracted using a reference electrode or using one of the recording channels without spiking activity.With sufficient habituation as mentioned in Procedure B, recording sessions can last up to ~4 h (Video 1).",
    "If the mice are not well habituated, they may struggle to pull themselves off the head-fixing frame, or they raise their tail toward the head, ending up hitting the electrodes. The treadmill plate needs to be cleaned with tissue as needed. Add saline periodically to the recording area to prevent the brain tissue from drying. We did not provide water during recording, but this may be helpful.At the end of the recording, make marking lesions at the desired electrodes (30 μA for 10 s).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Example video recording of a neural recording session Perfusion and histologyPerform perfusion and histological processing for Nissl staining as needed according to the standard procedures (see for example, https://doi.org/10.1038/protex.2015.022[href=https://doi.org/10.1038/protex.2015.022])."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}