{
  "id": 1116,
  "origin_website": "Nature",
  "title": "Immunohistochemistry with Ventana",
  "procedures": [
    "5.7.1 STAINING\nThis assay is performed in the Oncology Laboratory in the: \nMolecular Pathology Room:  Microtomy\nMain laboratory: Immunohistochemistry staining\nExtraction Room: Drying out and mounting\nNotes on the protocol \nAntigen retrieval is performed by warm incubation in EDTA buffers \\(ph8). The main problem with this method is that some epitopes are irreversibly damaged by heat, something which is more likely to occur if the tissue is poorly fixed. Special adhesive layers are used to avoid tissue cuts becoming unstuck \\(See section 5.5.2). The method of antigen retrieval, incubation time and concentration of the antibody vary according to the staining used \\(see table below). This is performed at 95ºC, except for PDL1 which is carried out at 100ºCX.\nMicrotomy\n1. Cutting is carried out as described in SOP-003.\n  Immunohistochemistry staining\n2. Enter the cases to be processed with the VENTANA BenchMark ULTRA \\(ROCHE) and print the labels. \n  3. Check the jars of reagents and residues \\(fill or empty as necessary). \n  - Ventana CC1 ULTRA\n- Ventana EZ PREP 10X\n- Ventana LCS ULTRA\n- Ventana Reaction Buffer\n- Ventana SSC\n- Fill the rest with distilled water \n- If full, empty the waste jar into the appropriate residue jar \n4. Place the VENTANA KIT Ultraview, Optiview and/or Optiview Amplification Kit rack, as well as the rack with the vials of antibody to be used into the machine\n  5. Label the samples and place on the shelves. \n  6. Press start. The machine will begin scanning the reagents and samples and the process will initiate. \n  \nSteps \n11. Heat the carrier at 60ºC and incubate for 4 minutes \n  12. Wash 3 times with EZ PREP solution at 72ºC to remove the paraffin \n  13. Heat the glass slide to 36ºC and perform 3 washes with reaction buffer",
    "14. Apply a drop of UV DAB inhibitor and incubate for 4 minutes to stop the endogenous peroxidase from working\n  15. Perform 2 washes with reaction buffer \n  16. Apply a drop of the primary antibody and incubate for a specific period depending of the antibody \\(see table) \n  Ultraview Kit \\(UV)\n17. Perform 2 washes with reaction buffer \n  18. Apply a drop of UV HRP Multimer and incubate for 8 minutes \n  19. Perform 2 washes with reaction buffer \n  20. Apply a drop of UV DAB Chromogen and a drop of UV DAB H2O2 and incubate for 8 minutes \n  21. Perform 1 wash with reaction buffer \n  22. Apply a drop of UV DAB Copper and incubate for 4 minutes \n  23. Perform 1 wash with reaction buffer \n  24. Apply a drop of Hematoxylin and incubate for 4 minutes, except for the LKB1 antibody which is incubated for 8 minutes\n  25. Perform 2 washes with reaction buffer \n  26. Apply a drop of Bluing and incubate for 4 minutes \n  27. Perform 2 washes with reaction buffer \n  Optiview Kit \\(OV)\n17. Perform 3 washes with reaction buffer \n  18. Apply a drop of OV HQ universal linker, incubate for 12 minutes and perform 3 washes with reaction buffer \n  19. Apply a drop of OV HRP Multimer, incubate for 12 minutes and perform 2 washes with reaction buffer \n  20. Apply a drop of OV Amplifier and a drop of OV Amplification H2O2 and incubate for 12 minutes\n  21. Perform 2 washes with reaction buffer \n  22. Apply a drop of OV Amplification Multimer and incubate for 8 minutes \n  23. Perform 3 washes with reaction buffer \n  24. Apply a drop of OV H2O2 and a drop of OV DAB, incubate for 8 minutes and perform 1 wash with reaction buffer",
    "25. Apply a drop of OV Copper, incubate for 4 minutes and perform 1 wash with reaction buffer \n  26. Apply a drop of Hematoxylin, incubate for 4 minutes and perform 2 washes with reaction buffer \n  27. Apply a drop of Bluing, incubate for 4 minutes and perform 2 washes with reaction buffer \n  Notes: Steps 21-23 refer to the Optiview Amplification Kit and are not performed for the pFGFR1 antibody.  \nDrying out and mounting samples \n28. After staining, the cut is soaked in soapy water to remove oils remaining from the staining process. \n  29. Incubate the sample for 2 minutes in 70% ethanol \n  30. Incubate the sample for 2 minutes in 96% ethanol \n  31. Incubate the sample for 2 minutes in absolute ethanol \n  32. Incubate the sample for 2 minutes in xylene \n  33. Leave to dry \n  34. Apply a drop of DPX to the sample \n  35. Place a glass cover over the whole of the tissue and remove bubbles by applying gentle pressure \n  36. Leave to dry and observe under the microscope \n  \nOnce the sample is determined to be evaluable, the scheme to be followed for antibodies is: \na) According to the proportion of stained tumoral cells\nb) According to the intensity of neoplastic cells stained: \n- 0 \\(lack of intensity) \n- 1 \\(weak staining) \n- 2 \\(moderate staining)\n- 3 \\(intense staining)"
  ],
  "subjectAreas": [
    "Biological Techniques",
    "Computational Biology And Bioinformatics"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}