{
  "id": 2176,
  "origin_website": "Cell",
  "title": "Isolation of human and mouse myeloid-derived suppressor cells for metabolic analysis",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIsolate immune cells from mouse bone marrow\nTiming: ∼1 h + 15 min/additional mouse\nBone marrow immune cells are isolated by flushing and mechanical dissociation. If the bone marrow is from tumor bearing mice, then MDSCs can then be sorted directly. However, if the bone marrow from non-tumor bearing mice is used, subsequent derivation of MDSCs must be carried out. All steps are performed in a biosafety cabinet to ensure sterility. Cell suspensions should be kept on ice for maximal cell viability and yield. See Methods video S1[href=https://www.wicell.org#mmc1] for visualization of steps 2–6.\nEuthanize mice by IACUC-approved method.\nDissect away the skin to reveal the hind leg muscles.\nIsolate both hind legs.\nPalpate the hip socket to identify location and ensure femur is intact upon removal.\nCut along the length of the femur and tibia to remove the majority of the muscles.\nPush forward on the hip socket to dislocate the femur and cut away the muscles and ligaments stabilizing the hips to detach the legs.\nIsolate femur and tibia.\nDislocate the tibia from the ankle by repetitively hyperextending the joint.\nPull the muscle toward the patella to reveal the tibia.\nBreak off the fibula.\nDislocate the tibia from the patella by repetitively hyperextending the joint.\nPlace tibia in a petri dish containing sterile PBS.\nHold the patella and extend the joint to dislocate the femur from the patella.\nPlace the femur in petri dish with sterile PBS.\nFill a sterile 15 mL conical tube with 15 mL of sterile PBS for collection (collection tube).\nFlush the bone marrow from the femur and tibia into the collection tube.\nFill a 1 mL tuberculin syringe with a 27G needle with 600 μL of sterile PBS from the collection tube.",
    "Optional: Use surgical scissors to cut off the hip-end of the femur.\nNote: Highly recommended; the needle easily clogs if this step is skipped.\nInsert the sterile PBS-filled syringe into the cut end of the femur and flush out the bone marrow with 600 μL of PBS into the collection tube.\nRefill the needle with 600 μL of PBS from the collection tube and flush femur an additional time.\nRefill the needle with 600 μL of PBS from the collection tube.\nCut the ankle-end of the tibia.\nInsert the PBS-filled syringe into the cut end of the tibia and flush with 600 μL of PBS into the collection tube.\nRepeat until all bones are flushed.\nCentrifuge samples at 1,500 RPM (about 505 × g) for 5 min.\nRemove the supernatant.\nResuspend in 3 mL sterile ACK lysis buffer for 1 min at room temperature.\nCritical: Red blood cells (RBC) lyse in culture and this is toxic to the plated bone marrow cells, reducing MDSC yield. Therefore, it is important not to look over this step.\nNeutralize with 10 mL of sterile PBS.\nCentrifuge samples at 1,500 RPM (about 505 × g) for 5 min.\nNote: If tumor bearing mice were the source of bone marrow, continue to step 32, as MDSCs will be present in this suspension of cells.\nIf non-tumor bearing mice were the source of bone marrow, resuspend in 1 mL of sterile MDSC-generation media.\nQuantify cells.\nNote: Around 40 × 106 cells per mouse are expected. (troubleshooting 2[href=https://www.wicell.org#sec6.3]).\nContinue to step 28 if not isolating human MDSCs.\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Mouse bone marrow harvest, related to steps 2–6",
    "Bone marrow is harvested from the femur and tibia from both mouse hind legs. Majority of the muscles are cut away, which allows to easy dislocation and isolation of the bones from the remaining muscles and tendons. The bone marrow is flushed out from the bone using PBS-filled syringes. For increased yield, multiple mice of the same genotype or treatment groups may be pooled if desired and appropriate.\nIsolate human peripheral blood mononuclear cells (PBMCs)\nTiming: 1 h + 15 min/additional patient\nHuman PBMCs are isolated by density centrifugation.\nSpin down blood from healthy volunteer or patient donors at 1,500 RPM (about 505 × g) for 5 min.\nPlace 4 mL of sterile, room temperature LymphoprepTM in a 15 mL conical tube.\nResuspend blood cell pellet in 4 mL of PBS.\nPipette the cell suspension slowly on top of the aliquoted LymphoprepTM at a 45° angle to overlay the samples without mixing.\nCentrifuge at 2,000 RPM (about 898 × g) for 20 min at room temperature WITHOUT brakes to prevent disruption of the density gradient.\nCarefully pipette the white middle layer containing the leukocytes into a new sterile 15 mL conical tube. Refer to Figure 2[href=https://www.wicell.org#fig2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1654-Fig2.jpg\nFigure 2. Density centrifugation isolation of PBMCs\nBlood collected from donors can be centrifuged with LymphoprepTM to assist in the separation the PBMCs from other blood components.\nCritical: Avoid aspirating the upper layers, which include platelets, as they can contaminate the isolated PBMCs.\nCentrifuge samples at 1,500 RPM (about 505 × g) for 5 min.\nAspirate off supernatant.\nResuspend in 10 mL of sterile PBS.\nCentrifuge samples at 1,500 RPM (about 505 × g) for 5 min.\nRepeat steps 23 and 24 for an additional wash.\nResuspend in 1 mL of sterile MDSC-generation media.\nQuantify cells.\nMDSC derivation with increased β-adrenergic signal",
    "Timing: 6 days\nIsolated immune cells (from human PBMCs or non-tumor bearing mouse bone marrow) are cultured with IL-6 and GM-CSF to derive MDSCs. Here we use isoproterenol, a pan β-adrenergic agonist, to increase β-adrenergic signaling in MDSCs during this process. Investigators may use other agents that are active in vitro in a similar manner to determine whether they play a role in altering MDSC derivation or their subsequent metabolic activity.\nPlate cells at 1 × 106 cells/mL density in 2 mL in a 24-well plate in MDSC-Derivation Media.\nAdd final concentration 10 μM isoproterenol or PBS.\nNote: Isoproterenol can be substituted for the treatment specific for the experimental need of the lab. The treatment regimen will have to be optimized individually. We recommend a pilot experiment with different concentrations of the treatment.\nPlace cells at 37°C 5% CO2 incubator for 6 additional days. (troubleshooting 3[href=https://www.wicell.org#sec6.5]).\nReplenish media and Isoproterenol every 2–3 days.\nResuspend and harvest cells into 15 mL conical.\nCritical: Human PBMC-derived MDSC may adhere to the plate. Detach the adherent cells using Detachin Cell Detachment Solution according to manufacturer’s protocol[href=https://lib.store.yahoo.net/lib/yhst-131428861332406/T100100-T100106-T100110-Detachin-Manual.pdf] and pool with the isolated suspension cells. Alternative non-protease cell detachment solutions may be used. Mouse MDSCs usually do not adhere to the plate and do not need this step.\nSpin down at 1,500 RPM (about 505 × g) for 5 min.\nResuspend in 1 mL of MDSC-generation media and plate in a fresh 24-well plate.\nMagnetic sorting of derived MDSCs\nTiming: 45 min + 10 min/Additional sample\nDerived MDSCs are sorted to ensure consistent sample quality. The MDSCs are sorted magnetically rather than by fluorescent-activated cell sorting to prevent alterations in metabolic profile due to experimental handling (Llufrio et al., 2018[href=https://www.wicell.org#bib7]).\nHarvest cells into sterile 5 mL round bottom polystyrene tubes with caps.",
    "Detach adherent cells using Detachin Cell Detachment Solution.\nCentrifuge sample at 1,500 RPM (about 505 × g) for 5 min.\nRemove supernatant by aspiration.\nResuspend in 1 mL sterile PBS.\nQuantify.\nSet aside 0.1–1 × 106 cells in a new non-sterile 5 mL round bottom polystyrene tube for flow cytometric evaluation of sort efficacy.\nProceed to step 41 with cells from step 39.\nIsolate MDSCs using STEMCELL magnetic isolation kit according to manufacturer’s instructions.\nNote: For mouse-derived MDSC, use the EasySepTM Mouse MDSC (CD11b+GR1+) Isolation Kit (Instructions available here[href=https://cdn.stemcell.com/media/files/pis/DX22923-PIS_1_0_0.pdf]). For human PBMC-derived MDSC, use the EasySepTM HLA Chimerism Whole Blood CD33 Positive Selection Kit (Instructions available here[href=https://cdn.stemcell.com/media/files/pis/DX22166-PIS_1_0_1.pdf]).\nResuspend cells in 1 mL sterile PBS.\nQuantify. (troubleshooting 4[href=https://www.wicell.org#sec6.7]).\nIsolate 0.1–1 × 106 cells into a new non-sterile 5 mL round bottom polystyrene tube for flow cytometric evaluation of sort efficacy.\nProceed to step 41 with cells from step 35.\nIsolate appropriate number of cells for metabolic analysis in a sterile 15 mL conical tube.\nProceed to step 58 for Fatty Acid Oxidation Analysis.\nProceed to step 79 for if Oxidative Phosphorylation Analysis without FAO analysis is desired.\nProceed to step 93 for Glycolysis Analysis.\nFlow cytometric confirmation\nTiming: 1 h + 10 min/Additional sample\nIsolated MDSC yield and purity are confirmed by flow cytometry.\nCentrifuge samples from steps 32 and 37 at 1,500 RPM (about 505 × g) for 5 min.\nResuspend in 100 μL PBS + 0.5 μL/ 1 × 106 cells FcBlock.\nStain at room temperature (20°C–25°C) for 10 min.\nAdd 100 μL PBS + 0.5 μL/1 × 106 cells of antibodies to each sample:\nNote: Make a master mix of antibody dilutions to ensure even dispersal of antibodies across all samples.\nMouse:\ntable:files/protocols_protocol_1654_11.csv\nHuman:\ntable:files/protocols_protocol_1654_12.csv\nStain at room temperature (20°C–25°C) for 20 min, protected from light.",
    "Add 1 mL of PBS to each sample to dilute excess antibodies.\nCentrifuge sample at 1,500 RPM (about 505 × g) for 5 min.\nResuspend samples in 200 μL of flow buffer.\nCharacterize MDSCs on available flow cytometer.\nNote: Use single-color controls using beads to set up appropriate compensation matrix prior to data collection.\nMouse bone marrow derived MDSC are defined as CD45+, CD11b+, Gr-1+ (Ly6G/ Ly6C).\nHuman PBMC derived MDSCs use: CD11b+, CD14+, CD33+.\nSeahorse XF assay plate preparation\nTiming: 1 h + 10 min/plate + 1 day\nBefore analysis, suspension cells must be adhered to the plate using Cell-Tak. Plates are usually prepared one day in advance but may be stored at 4°C for up to 2 weeks. If the number of injections is equivalent, multiple assays may be run on the same plate. Therefore, it is recommended to plan the sample layout in advance to ensure that the appropriate number of plates is coated. Plates are prepared in a biosafety cabinet to ensure sterility.\nCoat XF96 Cell culture microplate with Cell-Tak.\nQuickly add 20 μL Cell-Tak and Tissue Adhesive solution (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]) into each well.\nCover the plate and let it sit in the hood for 20 min at room temperature (20°C–25°C).\nRinse wells with sterile, tissue culture grade water.\nRemove residual solution by aspiration.\nAdd 100 μL of sterile, tissue culture grade water.\nRemove solution by aspiration.\nCover the plate and invert to let it dry in the hood for 20 min at room temperature (20°C–25°C).\nTightly cover plate with parafilm and store at 4°C until use or for up to 2 weeks.\nSensor cartridge hydration and calibration\nTiming: 20 min + 5 min/plate + 1 day incubation",
    "For proper detection of changes in pH and/or O2 concentration, the probe tips of the sensor cartridge must be fully hydrated. Cartridges are easily hydrated overnight (minimum 4 h and maximum 72 h) in a 37°C incubator, followed by calibration in the XF Calibrant solution provided by Agilent. All steps are performed in a biosafety cabinet to ensure sterility. Detailed instructions are provided on the Agilent webpage, available here[href=https://www.agilent.com/en/product/cell-analysis/how-to-run-an-assay].\nRehydrate Agilent Seahorse sensor cartridge by submerging in sterile, tissue culture grade water.\nOpen a sensor cartridge pack from the Agilent Flux Pack.\nSeparate the utility plate and sensor cartridge and rest sensor cartridge upside down next to the utility plate.\nAdd 200 μL of sterile, tissue culture grade water into each well of the utility plate.\nCarefully replace the sensor cartridge onto the utility plate to submerge the sensors in the water.\nPlace in a humidified, non-CO2, 37°C incubator overnight (usually 12–18 h).\nPlace 25 mL/ plate of XF Calibrant in a 50 mL conical tube and place a humidified, non-CO2, 37°C incubator overnight (usually 12–18 h).\nFinish sensor cartridge rehydration by replacing the water with the pre-warmed XF Calibrant.\nRemove pre-warmed XF Calibrant and sensor cartridge from incubator.\nRemove sensor cartridge from utility plate and set it down upside down.\nAspirate off the water from the utility plate.\nAdd 200 μL of pre-warmed XF Calibrant in each well of the utility plate.\nCarefully replace the sensor cartridge onto the utility plate to submerge the sensors.\nPlace in a humidified, non-CO2, 37°C incubator for 1 h prior to assay.\nFatty acid oxidation (FAO) assay\nTiming: 1 day + 3 h",
    "FAO rates of MDSCs are analyzed by changes in oxygen consumption rate (OCR) using the Seahorse XF Palmitate Oxidation Stress test kit. Media is changed to the substrate limiting media (with continued treatment) 24 h prior to experiment. A Mito Stress assay usually follows the etomoxir treatment. Detailed protocol for usage of the XF Palmitate Oxidation Stress Test Kit is provided by Agilent, available here[href=https://www.agilent.com/cs/library/instructionsheet/public/instructionsheet-agilent-seahorse-xf-palmitate-oxidation-stress-test-kit-quick-start-guide-cell-analysis-5994-1716en-agilent.pdf].\nCentrifuge samples at 1,500 RPM (about 505 × g) for 5 min.\nResuspend in substrate limiting media (SLM) with 10 μM Isoproterenol/ PBS or desired treatment. (See materials and equipment[href=https://www.wicell.org#materials-and-equipment] section for media recipe).\nPlate at 1 × 106 cells/mL in 24 well plates.\nIncubate at 37°C at 5% CO2 for 24 h.\nNote: See problem 5[href=https://www.wicell.org#sec6.9] for exposure length.\nWarm Cell-Tak coated 96-well flat bottom plate from step 52 to room temperature (20°C–25°C).\nHarvest cells from plates according to steps 29ai and 29aii.\nCentrifuge at 1,500 RPM (about 505 × g) for 5 min.\nResuspend samples in 1 mL of 1× KHB Assay Working Solution pre-warmed to 37°C. (See materials and equipment[href=https://www.wicell.org#materials-and-equipment] section for media recipe).\nQuantify.\nDilute and plate cells at 1 × 105 cells in 150 μL of 1× KHB Assay Working Solution with 10 μM Isoproterenol/ PBS or desired treatment on Cell-Tak coated 96-well flat-bottom plates from step 62.\nNote: Plate at least 6 wells/sample to insure triplicate in each Palmitate-BSA vs BSA exposure conditions.\nCritical: One well at each corner of the well must be left blank, containing only 180 μL of the 1× KHB Assay Working solution without any cells, for machine calibration.\nAllow cells to adhere to the plate.\nIncubate at room temperature (20°C–25°C) for 45 min.\nSpin down plates for 5 min at 1,500 RPM (about 505 × g).\nSit in non-CO2 37°C incubator for 10 min.",
    "Load assay compounds into injection ports on the sensor cartridge from step 57.\nResuspend provided compounds from the kit in the volume of 1× KHB working assay solution specified in the user manual[href=https://www.agilent.com/cs/library/usermanuals/public/user-manual-substrate-oxidation-stress-test-kits-cell-analysis-5994-1164en-agilent.pdf].\nPrepare 2–3 mL of working solution according to the user manual to make a 10× working solution.\nLoad 100–200 μL of 10× working solution into the designated ports.\nOptional: Add 20 μM Hoechst stain with last injection for cell density normalization.\nIf performing cell normalization, obtain a pre-run brightfield and fluorescence image of each well. Otherwise, this step can be skipped.\nPrepare Seahorse XFe 96 Extracellular Flux Analyzer.\nDesign experimental template using the Standard Substrate Oxidation Stress Test Assay template and update plate map on the Wave software. Refer to the Agilent webpage[href=https://www.agilent.com/cs/library/usermanuals/public/user-manual-substrate-oxidation-stress-test-kits-cell-analysis-5994-1164en-agilent.pdf] for detailed assistance.\nNote: If using a Seahorse XFe24 Analyzer, the optimal cell density (50%–90% confluency) and injection times must be optimized for the larger well surface area and volume. There is a default 2-minute wait step requirement prior to each measurement.\n3 measurements of baseline oxygen consumption rate. (OCRbaseline).\nInject 100 μM etomoxir (ETX).\n5 OCR measurements at maximal exogenous FAO inhibition. (OCR+ETX).\nInject 2 mM Oligomycin.\n3 OCR measurements.\nInject 1 mM carbonyl cyanide 4-(trifluoromethoxy)phenylhydrazone (FCCP).\n3 OCR measurements.\nInject 1 mM Rotenone and 1 mM Antimycin A.\n3 OCR measurements.\nRun calibration.\nClick “Run”.\nInsert sensor cartridge from step 69 when prompted.\nClick “I’m Ready”.\nRun Calibration.\nAdd 30 μL of Palmitate-BSA (1 mM Palmitate conjugated to 0.17 mM BSA) or BSA (0.17 mM) to appropriate sample wells.\nRun samples on Seahorse XFe 96 Extracellular Flux Analyzer.\nClick “Open tray” and load cell plate without the lid.\nClick “Load Cell Plate” to run the assay.",
    "If performing cell normalization, normalize the data to cell count. If not, this step can be skipped.\nObtain post-run brightfield and fluorescence image of each well.\nCalculate each well’s live cell count.\nClick “Normalize”.\nEnter live cell count into the Normalization grid.\nSet Normalization Unit as Cells.\nClick “Apply”.\nExport data from the Wave software into GraphPad Prism format.\nNote: Data may be graphed using the default Wave software as well.\nGraph the individual OCR measurements for each treatment condition.\nCalculate the average OCR of the sample triplicates per treatment condition.\nUse the averages to calculate the FAO contribution, defined as OCRbaseline - OCR+ETX. (troubleshooting 5[href=https://www.wicell.org#sec6.9]).\nOxidative phosphorylation (OxPhos) assay\nTiming: 3 h\nOxPhos levels of MDSCs are measured by oxygen consumption rate after priming in OCR media without CO2. Detailed protocol for usage of the Mito Stress Test Kit is provided by Agilent, available here[href=https://www.agilent.com/cs/library/usermanuals/public/XF_Cell_Mito_Stress_Test_Kit_User_Guide.pdf].\nWarm Cell-Tak coated 96-well flat bottom plate from step 52 to room temperature (20°C–25°C).\nCentrifuge samples at 1,500 RPM (about 505 × g) for 5 min.\nResuspend cells in OCR medium pre-warmed to 37°C. (See materials and equipment[href=https://www.wicell.org#materials-and-equipment] section for media recipe).\nPlate at 1 × 105 cells in 180 μL in Cell-Tak coated 96-well flat-bottom plates from step 79.\nNote: Plate each experimental condition in triplicate.\nCritical: One well at each corner of the well must be left blank, containing only 180 μL of the OCR medium, for machine calibration.\nAllow cells to adhere to the plate.\nIncubate at room temperature (20°C–25°C) for 45 min.\nSpin down plates for 5 min at 1,500 RPM (about 505 × g).\nSit in non-CO2 37°C incubator for 10 min.\nLoad assay compounds into injection ports on the sensor cartridge from step 57.",
    "Resuspend provided compounds from the kit in the volume of OCR medium specified in the user manual.[href=https://www.agilent.com/cs/library/usermanuals/public/XF_Cell_Mito_Stress_Test_Kit_User_Guide.pdf]\nPrepare 2–3 mL of working solution according to the user manual to make a 10× working solution.\nLoad 100–200 μL of 10× working solution into the designated ports.\nOptional: Add 20 μM Hoechst stain with last injection for cell density normalization.\nIf performing cell normalization, obtain a pre-run brightfield and fluorescence image of each well. Otherwise, this step can be skipped.\nPrepare Seahorse XFe 96 Extracellular Flux Analyzer.\nDesign experimental template and update plate map on the Wave software. Refer to the Agilent webpage[href=https://www.agilent.com/cs/library/usermanuals/public/XF_Cell_Mito_Stress_Test_Kit_User_Guide.pdf] for detailed assistance.\nNote: If using a Seahorse XFe24 Analyzer, the optimal cell density (50%–90% confluency) and injection times must be optimized for the larger well surface area and volume. There is a default 2-minute wait step requirement prior to each measurement.\nObtain 3 measurements of baseline oxygen consumption rate. (OCRbasal).\nInject 2 mM Oligomycin to inhibit mitochondrial complex V.\nObtain 3 OCR measurements. (OCR+Oligomycin).\nInject 1 mM carbonyl cyanide 4-(trifluoromethoxy)phenylhydrazone (FCCP) to induce maximal respiration.\nObtain 3 OCR measurements. (OCR+FCCP).\nInject 1 mM Rotenone and 1 mM Antimycin A to inhibit the electron transport chain.\nObtain 3 OCR measurements. (OCR+Antimycin A/Rotenone).\nRun calibration.\nClick “Run”.\nInsert sensor cartridge from step 84 when prompted.\nClick “I’m Ready”.\nRun Calibration.\nRun samples on Seahorse XFe 96 Extracellular Flux Analyzer.\nClick “Open tray” and load cell plate without the lid.\nClick “Load Cell Plate” to run the assay.\nIf performing cell normalization, normalize the data to cell count. If not, this step can be skipped.\nObtain post-run brightfield and fluorescence image of each well.\nCalculate each well’s live cell count.\nClick “Normalize”.\nEnter live cell count into the Normalization grid.\nSet Normalization Unit as Cells.\nClick “Apply”.",
    "Export data from the Wave software into GraphPad Prism format.\nNote: Data may be graphed using the default Wave software as well.\nGraph the individual OCR measurements for each treatment condition.\nCalculate the average OCR of the sample triplicates per treatment condition.\nUsing the average OCR, calculate ATP Production, defined as OCRbasal - OCR+Oligomycin, and Maximal Respiratory Capacity, defined as OCR+FCCP - OCR+Antimycin A/Rotenone.\nGlycolysis assay\nTiming: 3 h\nGlycolysis levels in MDSCs are measured by extracellular acidification rate. Detailed protocol for the usage of the XF Glycolysis Stress Test kit is provided by Agilent, available here[href=https://www.agilent.com/cs/library/usermanuals/public/XF_Glycolysis_Stress_Test_Kit_User_Guide.pdf].\nWarm Cell-Tak coated 96-well flat bottom plate from step 52 to room temperature (20°C–25°C).\nCentrifuge samples at 1,500 RPM (about 505 × g) for 5 min.\nResuspend cells in ECAR medium pre-warmed to 37°C. (See materials and equipment[href=https://www.wicell.org#materials-and-equipment] section for media recipe).\nPlate at 1 × 105 cells in 180 μL in Cell-Tak coated 96-well flat-bottom plates from step 93.\nNote: Plate each experimental condition in triplicate.\nCritical: One well at each corner of the well must be left blank, containing only 180 μL of the ECAR medium, for machine calibration.\nAllow cells to adhere to the plate.\nIncubate at room temperature for 45 min.\nSpin down plates for 5 min at 1,500 RPM (about 505 × g).\nSit in non-CO2 37°C incubator for 10 min.\nLoad assay compounds into injection ports on the sensor cartridge from step 57.\nResuspend provided compounds from the kit in the volume of ECAR medium specified in the user manual[href=https://www.agilent.com/cs/library/usermanuals/public/XF_Glycolysis_Stress_Test_Kit_User_Guide.pdf].\nPrepare 2–3 mL of working solution according to the user manual to make a 10× working solution.\nLoad 100–200 μL of 10× working solution into the designated ports.\nOptional: Add 20 μM Hoechst stain with last injection for cell density normalization.",
    "If performing cell normalization, obtain a pre-run brightfield and fluorescence image of each well. Otherwise, this step can be skipped.\nPrepare Seahorse XFe 96 Extracellular Flux Analyzer.\nDesign experimental template and update plate map on the Wave software. Refer to the Agilent webpage[href=https://www.agilent.com/cs/library/usermanuals/public/XF_Glycolysis_Stress_Test_Kit_User_Guide.pdf] for detailed assistance.\nNote: If using a Seahorse XFe24 Analyzer, the optimal cell density (50%–90% confluency) and injection times must be optimized for the larger well surface area and volume. There is a default 2-minute wait step requirement prior to each measurement.\nObtain 3 measurements of non-glycolytic extracellular acidification rate (ECAR). (ECARnon-glycolytic).\nInject 10 mM Glucose to induce glycolysis.\nObtain 3 ECAR measurements. (ECAR+glucose).\nInject 2 mM Oligomycin to inhibit mitochondrial complex V and induce maximal glycolysis.\nObtain 3 ECAR measurements. (ECAR+Oligomycin).\nInject 100 mM 2-Deoxy-glucose (2-DG) to inhibit glycolysis.\nObtain 3 ECAR measurements (ECAR+2-DG).\nRun calibration.\nClick “Run”.\nInsert sensor cartridge from step 98 when prompted.\nClick “I’m Ready”.\nRun Calibration.\nRun samples on Seahorse XFe 96 Extracellular Flux Analyzer.\nClick “Open tray” and load cell plate without the lid.\nClick “Load Cell Plate” to run the assay.\nIf performing cell normalization, normalize the data to cell count. If not, this step can be skipped.\nObtain post-run brightfield and fluorescence image of each well.\nCalculate each well’s live cell count.\nClick “Normalize”.\nEnter live cell count into the Normalization grid.\nSet Normalization Unit as Cells.\nClick “Apply”.\nExport data from the Wave software into GraphPad Prism format.\nNote: Data may be graphed using the default Wave software as well.\nGraph the individual ECAR measurements for each treatment condition.\nCalculate the average ECAR of the sample triplicates per treatment condition.\nUsing the average ECAR, calculate rate of glycolysis, defined as ECAR+glucose – ECARnon-glycolytic, and glycolytic capacity, defined as ECAR+Oligomycin - ECAR+2-DG."
  ],
  "subjectAreas": [
    "Immunology",
    "Metabolism",
    "Cell Isolation",
    "Cancer",
    "Cell Biology",
    "Cell-Based Assays",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}