{
  "id": 17683,
  "origin_website": "Jove",
  "title": "Isolation and Cultivation of Mandibular Bone Marrow Mesenchymal Stem Cells in Rats",
  "procedures": [
    "All animal experimental procedures in this paper were approved by the Animal Care Committee of Shanghai Ninth People's Hospital, Shanghai Jiao Tong University School of Medicine.\n1. Preparation\nUse two 5-week-old male Sprague Dawley rats for the experiment.\nSterilize all the instruments, including needle holders, tweezers and scissors at high temperature or immersed in 75% ethanol for 10 min.\n\tNOTE: Ethanol immersion should not be too long to avoid cell damage.\nPrepare culture media beforehand, the composition of which is provided in Table 1. Supplement each medium as described below.\n\t\nPreparation of α-MEM culture medium (with 10% FBS): Supplement minimum essential medium alpha (α-MEM) with 10% fetal bovine serum and 1% penicillin and streptomycin.\nPreparation of osteogenic differentiation medium: Supplement osteogenic differentiation basal medium with 10% fetal bovine serum, 1% glutamine, 1% penicillin-streptomycin, 0.20% ascorbic acid, 1% β-glycerophosphate and 0.01% dexamethasone.\nPreparation of osteogenic induction medium: Mix 70% α-MEM culture medium (with 10% FBS) and 30% osteogenic differentiation medium.\nPreparation of adipogenic differentiation medium A: Supplement adipogenic differentiation basal medium with 10% fetal bovine serum, 1% glutamine, 1% penicillin-streptomycin, 0.20% insulin, 0.10% IBMX, 0.10% Rosiglitazone and 0.01% Dexamethasone.\nPreparation of adipogenic differentiation medium B: supplement adipogenic differentiation basal medium with 10% fetal bovine serum, 1% glutamine, 1% penicillin-streptomycin and 0.20% insulin.\nPreparation of chondrogenic differentiation medium: Supplement chondrogenic differentiation basal medium with 0.01% Dexamethasone, 0.30% Ascorbic acid, 1% ITS, 0.10% Sodium pyruvate, 0.10% Proline and 1% TGF-β3.\n\t\tNOTE: The osteogenic differentiation medium must be used up within a month after configuration. The effective period of the configured chondrogenic differentiation medium is 12 h.\n2. Isolation and cultivation of rat mBMSCs\nNOTE: All experimental operations should be performed on ice as much as possible to maintain cell viability.\nHarvesting rat mandibles",
    "Euthanize two 5-week-old male Sprague Dawley rats by CO2 asphyxiation. Ensure that the animal’s breathing is stopped before proceeding with the experiment.\nRinse these rats in a beaker containing 75% ethanol for 3 min.\nPlace the rat inside a clean fume hood to harvest mandibles.\n\t\tNOTE: Sterilize the fume hood by ultraviolet light radiation for 30 min before use.\nPlace the rat in a supine position. Incise the skins and buccinator muscles from bilateral angulus oris to the posterior region of the mandible, which is the only movable bone with lower incisor.\n\t\tNOTE: It is recommended to make a 2 cm incision on each side of the angulus oris to get a clear operation field.\nOpen the mouth of the rat by pushing the maxillary and mandibular incisors towards the opposite direction with both thumbs to expose the mandibular teeth, which are attached to the mandible.\nCompletely disconnect the buccal muscles and the tendons attached to the coracoids and the inferior border of mandible.\n\t\tNOTE: An increased mobility of the mandible is observed during this step because of the lack of muscle tension.\nPress the mandibular posterior teeth and rotate back and downwards until the condyles on both sides are clearly exposed.\n\t\tNOTE: This step is performed to artificially open the mouth of the rat to the maximum extent possible to dislocate the condyle. The mandible is connected to skull through bilateral condyles, so the exposure of the condyles leads to the disconnection between the skull and mandible.\nSeparate the mandible body from the skull.\nClean the adherent soft tissue on the bone surface using a wet gauze.\nPlace the bone in a 10 cm sterile glass dish filled with precooled minimum essential medium-α (α-MEM) or phosphate buffer saline (PBS) on ice to preserve the viability.",
    "Isolation and cultivation of the mBMSCs\n\t\nCut off the anterior bone along the mesial edge of the first molar from the mandibular body. Remove the mandibular ramus including coracoid and condyle along the distal edge of the third molar to expose the marrow cavity.\nFill a 10 cm sterile glass dish with 10 mL of α-MEM (with 10% FBS).\nUse 1 mL syringe to aspirate α-MEM culture medium. With the syringe needle inserted into the bone marrow cavity, repeatedly flush the bone marrow into the dish. Flush the bone cavity at least 3 times from both mesial and distal sides of the bone, respectively, until the bone turned white.\n\t\tNOTE: This is the most critical step, as the bone marrow cavity of a rat mandible is not as obvious as in long bone and the proper point to insert the needle needs to be determined empirically. All experimental samples above should be stored on ice to maintain cell viability and so the operation time must be no longer than 2 h.\nTransfer the media containing the flushed cells into a 15 mL centrifuge tube and centrifuge at 800 x g in 4 °C for 5 min. Discard the supernatant.\nResuspend the cells with 3 mL of α-MEM (with 10% FBS). Plate the cells in a new 10 cm culture dish and incubate at 37 °C in a 5% CO2 incubator.\nCheck the morphological changes and growth of these cells on the 3rd day of culture. Remove the culture medium with nonadherent cells and tissue fragments. Gently add 10 mL of fresh α-MEM (with 10% FBS).\nAfter 7 days of culture, P0 mBMSCs reached 70% to 80% confluence.\nFlow cell sorting\n\tNOTE: P0 mBMSCs were phenotypically identified and primarily purified through flow cell sorting.",
    "Aspirate and discard the culture medium and then wash the dish with PBS. Discard the PBS.\nAdd 1 mL of 0.25% trypsin with 0.02% EDTA in the dish. Digest the cells at 37 °C for 5 min, then add 2 mL of α-MEM (with 10% FBS) to stop the reaction.\nTransfer the cells suspension into a 15 mL centrifuge tube and centrifuge at 800 x g for 5 min.\nResuspend the cells in 120 μL of PBS (with 10% FBS) after centrifugation.\nBlock these cell suspensions with 1 μL of antibody against CD16/CD32 at 4 °C for 15 min.\nTransfer 100 µL of the cell suspension into a new microcentrifuge tube, stain the cells with Phycoerythrin (PE)-conjugated antibody against CD45, fluorescein-isothiocyanate (FITC)-conjugated antibody against CD90 and Allophycocyanin (APC)-antibody against CD29 at 4 °C for 1 h in the dark13,15. The concentration of antibodies used in this experiment is shown in Table 2. Use the other 20 µL of cell suspension as unstained negative control.\nThen centrifuge the tubes at 800 x g for 5 min, discard the suspension, and resuspend the cells in 0.5 mL of PBS (with 10% FBS).\nAdd 10 μL of 0.01 mg/mL DAPI for 10 min before analysis.\nUse 40 nm filters placed on centrifuge tubes to filter the cells.\nAnalyze the cells on Fluorescence-activated cell Sorter. Set the panels as follows. Firstly, remove dead cells from total cell count by gating DAPI- cells, then gate CD29+CD90+CD45- in the selected cells as targeted mBMSCs.\nCollect the sorted CD29+CD90+CD45- cells into a 15 mL centrifuge tube with 3 mL of α-MEM (with 10% FBS) pre-prepared.",
    "Centrifuge the tubes at 800 x g for 5 min. Remove the collection buffer and add 1 mL of fresh α-MEM (with 10% FBS) to resuspend the cells. Then plate them in a 6 cm culture dish.\n3. Colony formation capability\nNOTE: This step was performed to check for the division ability of mBMSCs.15\nSelect second passage mBMSCs (P2) for this experiment. When the cell confluence reached 80% to 90%, reseed the cells in a serial gradient in a 6 well plate to evaluate their clonal proliferation ability.\n\tNOTE: It is recommended to set the gradient from 1 x 102 to 1 x 103 cells per well, but the final dilutions of different cell lines of human or animal origin were empirically determined.\nCulture the cells in α-MEM (with 10% FBS) for approximately two weeks until a good number of the colony forming units could be seen under light microscope. Refresh the culture medium every 3 days.\nAspirate and discard the culture medium, wash the wells with PBS twice for 5 min at a time. Next add 4% paraformaldehyde solution to each well and fix for at least 10 min.\nRemove the paraformaldehyde and rinse the wells twice with PBS.\nStain the cells with crystal violet staining solution and incubate them in 37 °C for about 10 min.\n\tNOTE: The staining time adjusted appropriately until the desired shade is achieved.\nRemove the staining solution and wash the samples with distilled water to stop the reaction.\nImage under a stereomicroscope and count scattered cell colonies which consisted of at least 50 cells.\n4. Multilineage differentiation of mBMSCs\nNOTE: The P2 mBMSCs were used for subsequent experiments unless otherwise described.\nOsteogenic induction of mBMSCs",
    "Digest the mBMSCs as described above. Seed cells at a density of 2.5 x 105/cm2 in a 12 well plate supplemented with 1 mL α-MEM (with 10% FBS).\nWhen the cell confluence reached 60-70%, change the medium into 30% osteogenic induction media. Culture the cells with α-MEM (with 10% FBS) as a negative control and change the medium every 2 days.\n\t\tNOTE: After a great good number of calcium nodules appear during osteogenesis, it is recommended to change the medium exchange pattern to a half volume medium exchange every 2 days, to prevent osteoblasts from floating.\nAfter culturing for seven days, assess the calcification of these cells by alkaline phosphatase staining16,17.\nRemove the culture medium and fix the cells with 4% paraformaldehyde for 10 min. Rinse the cells using 1 mL of PBS per well for 3 min twice.\nThen stain the cells with alkaline phosphatase staining solution and incubate at 37 °C for 10-30 min.\n\t\tNOTE: Incubation can be performed overnight at room temperature to obtain the required color.\nWash the wells with distilled water to stop the reaction. Take photographs under light microscope. Red pigmented granules represent alkaline phosphatase (ALP) activity.\nAfter culturing the remaining cells for another 7 days, perform alizarin red staining to evaluate the mineralization capacity of the cells.\nStain the cells with 0.5% alizarin red staining solution after cell fixation for 10 min16,18. Stop the chromogenic reaction with distilled water after 3-5 min.\n\t\tNOTE: The reaction time can be extended depending on the color developed.\nFinally, place the culture plate under the light microscope to observe the effect of osteogenic staining; red nodules indicate calcium deposits of these cells.\nAdipogenic induction of mBMSCs\n\t\nSeed P2 mBMSCs in a 12 well plate as described above.",
    "After the well become 90% confluent, culture the cells with adipogenic differentiation medium A. Use cells cultured in α-MEM culture medium (with 10% FBS) as negative control.\nAfter 2 days of induction, aspirate the medium A from the well and add 1 mL of adipogenic differentiation medium B in each well.\nAfter one day, remove medium B and start the cycle again with medium A added back into the well. Culture the cells alternately using medium A and B.\nApply the differentiation medium A and B alternately for three cycles and detect the adipogenesis of these cells by oil red O staining16,18.\n\t\tNOTE: Lots of round and big lipid droplets can be observed by culturing these cells with differentiation medium B for an additional 2 to 3 days.\nRemove the medium and fix the cells with 4% paraformaldehyde for 10 min. Wash out the cells with PBS.\nStain the cells with oil red O staining solution and incubate at 37 °C for approximately 3 min.\nRemove the staining solution and wash the wells with distilled water.\nObserve adipogenesis under light microscope.\nChondrogenesis induction of mBMSCs\n\t\nSeed P2 mBMSCs in 15 mL centrifuge tube at a density of 5 x 105/cm2.\nCentrifuge the tubes at 300 x g for 5 min. Discard the supernatant.\nResuspend the cells with 0.5 mL of chondrogenic differentiation medium. Centrifuge the cells at 300 x g for 5 min.\nLoosen the cap of the centrifuge tube and incubate it at 37 °C in a 5% CO2 incubator. Renew the medium every 2 days.\n\t\tNOTE: Cells start pelleting after 24 h. It is recommended not to move the centrifuge tube for 48 h. Be careful not to aspirate the cell pellet when changing the medium.",
    "After 21 days of induction, fix the cell pellets with 4% paraformaldehyde, followed by dehydration, paraffin embedding and sectioning.\nAfter deparaffinization and hydration, stain the slides in Alcian blue solution for at least 15 min18,19,20,21, then wash with distilled water to stop the reaction. Capture the photographs under light microscope.\nFor immunofluorescent staining of collagen type II, perform the steps below.\n\t\t\nIncubate the slides with 5 µg/mL proteinase K for 15 min at 37 °C after the deparaffinization and hydration step.\nIncubate the slides in blocking buffer for 1 h at 37 °C.\nApply 1 µL of collagen type II antibody in 200 µL of blocking buffer to the slides and incubate overnight at 4 °C.\nThe next day, wash the slides with PBS twice and incubate with secondary antibodies at 37 °C for 1 h.\nIncubate the slices with 40,6-diamidino-2-phenylindole (DAPI) for 10 min.\nTake photographs of each slides under fluorescence microscopy.\n5. Real-time PCR\nExtract total RNA from mBMSCs using a guanidium isothiocyanate based commercially available reagent.\nPerform reverse transcription of RNA into complementary DNA using a commercially available kit. The reaction conditions of reverse transcription were as follows: 65 °C for 5 min, 37 °C for 15 min, 85 °C for 15 s.\nPerform real-time PCR to detect osteogenesis and adipogenesis specific genes using primers listed in Table 3. The PCR amplification procedure was as follows: 95 °C for 5 min. 95 °C for 5 s, 60 °C for 30 s for 40 cycles.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}