{
  "id": 7497,
  "origin_website": "Bio",
  "title": "Reconstitution of Membrane-associated Components of a G-protein Signaling Pathway on Membrane-coated Nanoparticles (Lipobeads)",
  "procedures": [
    "Preparation of phospholipidsAn 80:20 molar ratio of DOPC:DOTAP (Melia et al., 2000) is prepared by combining 1.26 mL of DOPC (31.5 mg, 40 µmol) and 279 µL of DOTAP (7.0 mg, 10 µmol) with 461 µL of chloroform.[DOPC] = 20.0 mM, [DOTAP] = 5.0 mM; total [phospholipid] = 25.0 mMAliquot 200 µL portions (4.0 μmol DOPC and 1 μmol DOTAP) into glass tubes and evaporate them under a stream of nitrogen gas.Dried down lipids are stored in darkness at -20°C for up to six months until use.Preparation of silica nanoparticlesSilica particles are disaggregated by mixing 200 μL (5 mg; 1.4 × 1013 particles) of silica particles with 1 mL of 95% ethanol.Vortex at maximum speed for 2 min.Incubate for a minimum of 1 h at room temperature (overnight is preferable).Centrifuge the silica suspension at 10,000 × g for 10 min in the Eppendorf 5415D centrifuge at 10°C.Resuspend the pellet with 1.0 mL of ice-cold HNM buffer, vortex for 2 min, and centrifuge again at 10,000 × g for 10 min in the Eppendorf 5415D centrifuge at 10°C, to remove residual ethanol.Resuspend the pellet with 1.0 mL of ice-cold HNM buffer, vortex for 2 min, and keep on ice until use.Preparation of lipobeadsThe dried-down DOPC/DOTAP lipid mixture is mixed with the silica particle suspension at room temperature without nitrogen gas, and gently vortexed (setting #5-6) for 2 min, then allowed to settle for 1 min. This process is repeated four more times.Final concentration: 80:20 DOPC:DOTAP = 5 mM (total phospholipid), [lipobead] = 23 nMAssemble the Mini Extruder (a video created by the manufacturer describing the assembly of the Mini Extruder is found here: https://www.youtube.com/watch?v=8ei62ZmLgSM[href=https://www.youtube.com/watch?v=8ei62ZmLgSM]):Pre-wet two 10 mm filter supports with HNM buffer and place one inside the O-ring of the internal membrane support.Place the membrane support into the outer casing.",
    "Place a single polycarbonate 0.1 µm membrane on top of the membrane support.Place the second filter support on the second membrane support and place the second membrane support into the outer casing (O-rings facing each other).Place the Teflon bearing into the retainer nut.Finger-tighten the retainer nut onto the outer casing.Attach an empty gas-tight syringe to one end of the Mini Extruder.Pre-wet the assembly by passing HNM buffer through the Mini-Extruder with the second gas-tight syringe.Extrude the lipid/silica suspension through the Mini Extruder:Load the lipid/silica mixture into one of the gas-tight syringes.Firmly depress the syringe barrel to force the lipobeads through the membrane quickly (~10 s duration per cycle)Repeat a total of 15 times, with the lipobead suspension finally filling the originally empty syringe (this prevents aggregates that never passed through the filter from being recovered).Separate the unilamellar lipobeads recovered from the syringe from unbound phospholipids by centrifugation at 10,000 × g for 10 min at room temperature in the Eppendorf 5415 D centrifuge.Resuspend the pellet with 500 µL of HNM buffer for a lipobead concentration of 46 nM.Lipobead preparations are stable for ~2 days if stored in the dark at room temperature.Binding PDE6 to lipobeadsAdd 10 µL of 46 nM lipobead preparation (0.46 pmol) to purified PDE6 holoenzyme and incubate at room temperature for 30 min.The amount of PDE6 added to the lipobead preparation can be varied from 10 fmol (1 nM concentration) to at least 10 pmol (1 μM concentration), without exceeding the maximum binding capacity of the lipobeads. The amount of PDE6 added to the lipobeads is determined as described in Step G2b.The glycerol concentration of the PDE6 stock solution must be less than 10% (v/v) for optimal binding to lipobeads.",
    "To reduce the glycerol concentration, the stock solution of PDE6 can be buffer exchanged using 50 kDa MWCO Amicon Ultra-4 filtration units. The protein is diluted over ten-fold with HNM buffer, followed by centrifugation at 3,000 × g for 10-20 min. Centrifugation time will depend on the initial volume of protein.Spin the PDE6-lipobead mixture at 10,000 × g for 10 min in the Eppendorf centrifuge in the cold room (~10°C).Remove supernatant as soon as possible after centrifugation, as the pellet loosens over time.To determine the extent of PDE6 binding to lipobeads, the supernatant can be recovered and assayed. As seen in Figure 2, over a range from 0.01 to 10 pmol of PDE6 added, 85 ± 6% is bound to lipobeads.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4303/bioprotoc-12-02-4303-g002.jpgFigure 2. Binding of PDE6 to lipobeads. Lipobeads (0.46 pmol) are mixed with 40 μL of the indicated amount of PDE6 and incubated for 30 min. Following centrifugation, the supernatant fractions are assayed for PDE6 activity (see Step G2b), to calculate the percent of total PDE6 activity bound to the lipobeads. Data represent the mean ± S.D. (n = 3).Use the lipobead pellet containing bound PDE6 for the subsequent incubation with Gtα*.Preparation of aluminum fluoride-activated Gtα* (Gtα-GDP-AlF4-)For Gα-GDP preparations stored in 50% (v/v) glycerol, the glycerol concentration is first reduced by buffer exchange using HNM buffer and ultrafiltration.The glycerol concentration of the Gtα preparation must be less than 10% (v/v) for optimal binding to lipobeads.Perform buffer exchange by first diluting the Gtα stock solution over ten-fold with HNM buffer, placing the protein sample in the upper chamber of a 30 kDa MWCO Amicon Ultra-4 filtration unit, and centrifuging at 3,000 × g for 10-20 min (depending on the initial volume of the diluted protein).Purified Gtα-GDP is activated by the addition of aluminum fluoride (Bigay et al., 1987).",
    "In a final volume of 50 μL, add the following:45.6 μL of Gtα-GDP in Gtα storage buffer [containing <10% (v/v) final glycerol concentration].2.0 µL of 745 µM AlCl3 (final concentration = 30 µM).2.0 µL of 250 mM NaF (final concentration = 10 mM).0.4 µL of 1 M MgCl2 (final concentration = 8 mM).Incubate on ice for 15-30 min.Formation of Gtα*-PDE6 complex on lipobeadsAdd 50 µL of Gtα* (either Gtα-GDP-AlF4- or Gtα-GTPγS) to the PDE6-containing lipobead pellet, mix well, then incubate for 45 min at room temperature.The concentration of Gtα* added to the PDE6-bound lipobeads can be varied up to a maximum of ~5 μM (this being the limit of solubility of purified Gtα that is added to the lipobead mixture).For chemical cross-linking experiments (see Figure 3), the cross-linker is added to the lipobead suspension prior to centrifugation. Add BS3 to a final concentration of 0.125 mM, from a 0.5 mM working solution or 10 mM stock solution. Allow crosslinking reactions to proceed for 45 min at room temperature, followed by centrifugation at 10,000 × g for 10 min. Resuspend the pellets in 1× gel loading sample buffer for SDS-PAGE.For enzymatic assays of cGMP hydrolysis of PDE6 (see Figure 4), the lipobeads containing Gtα*-PDE6 are not centrifuged prior to addition of cGMP substrate to initiate the assay of PDE6 hydrolytic activity.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4303/bioprotoc-12-02-4303-g003.jpgFigure 3. Chemical cross-linking of the activated complex of Gtα and PDE6. Cross-linking of PDE6 and Gtα* was performed by first binding 9 pmol of PDE6 to 0.46 pmol lipobeads for 20 min followed by centrifugation. The lipid pellet was resuspended with 115 pmol Gtα-GDP-ALF and incubated for 45 min followed by centrifugation. The pellet was resuspended in 20 μL of HNM buffer containing 0.125 mM BS3 and crosslinking proceeded for 45 min.",
    "Lane A contains purified PDE6, lane B contains purified Gtα*, and lane C contains the crosslinked mixture.Analytical methodsDetermination of protein concentrationThe concentration of PDE6 or Gtα is determined by the bicinchoninic assay (Thermo Fisher, Inc.) following the manufacturer’s protocol.For analysis of Gtα samples containing excess unbound nucleotide, buffer exchange using Amicon Ultra-4 30 kDa ultrafiltration units (following the procedure described in Step E1b) with buffer lacking guanine nucleotides is performed, to remove interference with the protein assay.PDE6 enzymatic activity assayQuantify the rate of cGMP hydrolysis using a colorimetric assay of inorganic phosphate, in which the breakdown of cGMP to 5’-GMP by PDE6 is followed by addition of 5’-nucleotidase to liberate inorganic phosphate (Cote, 2000).To measure the total amount of PDE6 present in a sample, incubate the enzyme with trypsin to proteolytically digest the inhibitory γ-subunit that is tightly bound to the holoenzyme (Pentia et al., 2005). Calculate the amount of PDE6 in the sample with knowledge of the catalytic turnover number for trypsin-activated PDE6 [kcat = 5600 cGMP hydrolyzed per s per PDE6 (Mou et al., 1999)].To calculate the percent of maximal activation induced by addition of Gtα (see Figure 4), the extent of transducin activation of PDE6 catalytic activity on lipobeads is referenced to the maximum trypsin-activated enzyme activity (Step G2b).Measure the PDE6 basal (i.e., nonactivated) activity on lipobeads in the absence of added Gtα*."
  ],
  "subjectAreas": [
    "Biochemistry",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}