{
  "id": 18149,
  "origin_website": "Jove",
  "title": "Skeletal Muscle Neurovascular Coupling, Oxidative Capacity, and Microvascular Function with 'One Stop Shop' Near-infrared Spectroscopy",
  "procedures": [
    "This protocol follows the guidelines of the institutional review board at the University of Texas at Arlington and conforms to the standards set by the latest version of the Declaration of Helsinki. Accordingly, written informed consent was (and should be) obtained prior to commencement of research procedures.\n1. Instrumentation\nNOTE: The following instrumentation description is based on the near-infrared (NIR) spectrometer and data acquisition system used in our lab (see Table of Materials). Thus, the instructions include steps that are necessary for the optimal function of these devices. These steps include the calibration of the NIR probe using the accompanying software and calibration phantom, and the application of a dark cloth to exclude ambient light. In the event that different data collection hardware and/or software are used, investigators should consult their own specific user manuals for calibration and ambient light considerations. Figure 1 illustrates the experimental set-up and instrumentation described immediately below.\nInstruct the subject to lie supine with their legs inside a lower body negative pressure (LBNP) chamber (Figure 1A), so that their belt line is approximately even with the opening to the LBNP box. For instructions on how to build a LBNP chamber, see References17.\nPlace three electrocardiogram electrodes on the subject: two in an inferior, mid-clavicular location and one on the subject's left side medial to the iliac crest. This configuration provides the best results due to limited access to the lower limbs, instrumentation of the upper limbs, and arm movement during hand grip exercise.\nPlace a non-invasive blood pressure monitor module on the subject's dominant wrist. Place the finger blood pressure cuffs on each finger and connect them to the module (Figure 1B). Ensure the finger blood pressure cuffs are properly calibrated according to the user's manual accompanying your device.",
    "Instruct the subject to grasp a hand grip dynamometer (HGD) with their non-dominant arm in a slightly abducted position. The arm should be comfortably positioned on a bedside table. The distance and angle of the HGD should be adjusted to allow for optimal grip strength with minimal arm movement (Figure 1C).\nSecure the HGD to a bedside table.\nMeasure the maximum voluntary contraction (MVC) of the participant. Tell the participant that, when prompted, they must squeeze the HGD as hard as possible while only utilizing the muscles in the hand and forearm. Instruct the subject that they must refrain from recruiting their upper arm, chest, shoulder, or abdominal muscles when performing the maximum grip.\nRepeat Step 1.6 three times, separated by at least 60 s. Record the maximum force achieved (best of 3). This maximum force will be used to calculate the exercise intensity for skeletal muscle oxidative capacity and neurovascular coupling (below).\nPlace a rapid-inflation cuff around the upper arm of the exercising hand. Connect the airline from the rapid inflation controller to the cuff.\nIdentify the flexor digitorum profundus. Use a skin marker to demarcate the borders of the palpable muscle.\nEnsure that the NIR spectrometer is properly calibrated according to the user's manual included with your device. Clean the skin over which the NIR probe will be positioned with an alcohol prep wipe.\nPlace the NIR probe over the center of the belly of the muscle (flexor digitorum profundus) and affix it securely to the forearm.\nWrap the probe and forearm with dark cloth, minimizing interference from ambient light (Figure 1C, Figure 1D).\nWhen ready to perform the functional sympatholysis portion of the study, seal the subject into the LBNP chamber.\n2. Skeletal Muscle Oxidative Capacity",
    "NOTE: A representative data tracing illustrating the experimental procedure for measuring skeletal muscle oxidative capacity is depicted in Figure 2. This experimental approach has previously been validated against in vivo phosphorus MRS18 and in situ muscle respirometry19, and is gaining widespread acceptance20.\nInstrument the subject as indicated above (Instrumentation).\nInstruct the subject to lie still for 2 min while monitoring deoxyhemoglobin (HHb) and oxyhemoglobin (HbO2) via the NIR probe.\n\tNOTE: This rest period allows the subject to recover from any movement artifact associated with the instrumentation process, and ensures stable baseline measurements. If after 2 min no significant fluctuations have occurred, the subject may be considered at a steady state, or resting baseline.\nPrior to cuff occlusion, notify your subject that you will be inflating the cuff. Inflate the upper arm cuff at least 30 mmHg above systolic blood pressure for 5 min (i.e., suprasystolic). Instruct the subject to keep their arm as still and relaxed as possible both during cuff inflation and following cuff deflation.\n\tNOTE: This 5 min brachial artery cuff occlusion protocol closely reflects the currently accepted clinical standard for vascular occlusion tests21,22,23,24,25.\nRecord the initial/baseline value (prior to cuff occlusion) and the nadir value of tissue saturation (StO2) during the cuff occlusion and determine the midpoint between these two values.\nimgsrc://cloudfront.jove.com/files/ftp_upload/57317/57317eq1.jpg\nAllow the subject to recover from the cuff occlusion and return to the resting baseline values. Once the subject has maintained a resting baseline for at least 1 full min, continue to the next step.",
    "Instruct subject to squeeze and maintain an isometric hand grip at 50% of their MVC. Encourage the subject to maintain their isometric contraction until the tissue desaturates by 50%. Upon achieving this value, tell the subject to relax their hand and inform them that no more exercise or movement is needed.\nWithin 3 - 5 s following exercise cessation, administer the following rapid cuff occlusion series (one series = 1 inflation + 1 deflation), as previously established18:\n\tSeries #1 - 6: 5 s on/5 s off\n\tSeries #7 - 10: 7 s on/10 s off\n\tSeries #11 - 14: 10 s on/15 s off\n\tSeries #15 - 18: 10 s on/20 s off\nAfter completing the 18th inflation/deflation series, instruct the subject to rest, allowing tissue saturation to return to initial baseline values. After these values have remained consistent for at least 2 min, repeat steps 2.4 and 2.5.\nCalculating Skeletal Muscle Oxidative Capacity\nCalculate the slope of change in the StO2for each of the individual 18 cuff occlusions, forming the monoexponential recovery points illustrated in Figure 2C.\nFit the calculated data from 2.7 to the following monoexponential curve18,19,26\n\t\ty = End - Δ x e-kt\n\t\tNOTE: 'y' is the relative muscle oxygen consumption rate (mV̇O2) during cuff inflation, 'End' represents the mV̇O2 immediately following the cessation of exercise; delta ('Δ') signifies the change in mV̇O2 from rest to the end of exercise; 'k' is the fitting rate constant; 't' is time. Tau is calculated as 1/k.\n3. Reactive Hyperemia\nNOTE: A representative data tracing illustrating the experimental procedure for measuring reactive hyperemia is depicted in Figure 3.\nWith the subject lying supine and instrumented as described above (Instrumentation), instruct the subject to lie as still as possible.",
    "Once the subject has achieved a consistent resting state, continue to record at least 1 min of baseline data and then rapidly inflate a blood pressure cuff on the upper arm to a suprasystolic pressure (30 mmHg above systolic blood pressure).\nAt the 5 min mark, rapidly deflate the cuff while recording the hyperemic response.\nContinue recording for at least 3 min to capture the subject's recovery.\nCalculating Reactive Hyperemia\n\tNOTE: The NIRS parameters calculated are depicted in Figure 3.\n\t\nCalculate baseline StO2 as the average StO2 over 1 full min prior to the onset of arterial cuff occlusion.\nDetermine the resting skeletal muscle metabolic rate as the desaturation rate (i.e., average slope) during cuff occlusion (defined as Slope 1)27,28.\nCalculate reactive hyperemia as follows:\n\t\ta) the average upslope following cuff release (i.e., reperfusion rate, defined as slope 2), calculated from the moment of cuff release through the linearly increasing phase of the rebound trace;\n\t\tb) the highest StO2 value reached after cuff release (denoted as StO2max);\n\t\tc) the reactive hyperemia area under the curve (AUC); calculated from the time of cuff release to 1-, 2- and 3-min post cuff-occlusion (AUC 1-min, AUC 2-min, and AUC 3-min, respectively); and\n\t\td) the hyperemic reserve, calculated as the change in StO2 above baseline and reported as a percent (%) change. This value is calculated as the highest saturation achieved during the post-occlusive rebound minus the average saturation calculated in step 3.5.1 (see above).\n\t\tNOTE: Large differences in baseline data will greatly affect the interpretation of the hyperemic reserve.\n4. Functional Sympatholysis\nNOTE: A representative data tracing illustrating the experimental procedure for measuring functional sympatholysis is depicted in Figure 4.\nInstrument the subject as indicated above (Instrumentation).\nEnsure an airtight seal in the LBNP chamber.",
    "With the subject lying still and at rest, collect 3 min of baseline data.\nAt the 3 min mark, turn on the vacuum. Adjust the vacuum so that the pressure inside the LBNP chamber is between -20 and -30 mmHg. Allow the vacuum to run for 2 min while monitoring the subject's response.\nAt the 5 min mark, turn off the vacuum and allow the subject to rest for 3 min.\nAt the 8 min mark, initiate the voice prompt guiding the subject through the rhythmic hand grip exercise (20% MVC).\nConfirm that the subject is maintaining their squeeze throughout the entirety of each gripping phase and relaxing completely during between each repetition. Monitor their force output and confirm that they are achieving 20% MVC with each grip. Continue exercise until the 11 min mark.\nAt the 11 min mark, turn on the vacuum encouraging the subject to continue their rhythmic exercise. Allow the vacuum to run from 11 - 13 min, then turn it off.\nHave the subject continue performing rhythmic hand grip exercise at 20% of their MVC for an additional 2 min. Upon exercise cessation, have the subject rest quietly and lie still.\nCalculating Functional Sympatholysis\nNormalize the change in oxyhemoglobin with LBNP to the total labile signal (TLS), determined during 5 min cuff occlusion:\nimgsrc://cloudfront.jove.com/files/ftp_upload/57317/57317eq2.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/57317/57317eq3.jpg\nCalculate each event as the final 20 min average of each event.\nCalculate the exercise-induced attenuation of the oxyhemoglobin reduction:\nimgsrc://cloudfront.jove.com/files/ftp_upload/57317/57317eq4.jpg\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}