{
  "id": 11852,
  "origin_website": "Jove",
  "title": "Spatial Profiling of Protein and RNA Expression in Tissue: An Approach to Fine-Tune Virtual Microdissection",
  "procedures": [
    "All human tissues were acquired from commercial biobanks or accredited tissue banks under warranty that appropriate Institutional Review Board approval and informed consent were obtained.\nNOTE: The protocol is performed using the Discovery Ultra and the GeoMx Digital Spatial Profiler. See the Table of Materials for details about reagents, equipment, and software used in this protocol.\n1. Automated visualization protocol for spatial proteomics assays\nProgram autostainer to apply fluorescent visualization antibodies\n\t\nIn the autostainer software, click on the home button and choose Protocols. Then, click on Create/Edit Protocols and select RUO DISCOVERY Universal as the procedure.\nClick on First Sequence > Deparaffinization > Depar v2. For Medium Temperature, choose 72 Deg C, then click on Pretreatment and select Cell Conditioning and CC1 Reservoir. For Very High Temperature, choose 100 Deg C, then click on CC1 8 Min and continue clicking until CC1 64 Min is selected.\nClick on Inhibitor > DISCOVERY Inhibitor, and for Incubation Time, choose 8 Minutes. Then, click on Antibody > High Temp Ab Incubation; for Low Temperature, choose 37 Deg C; for Antibody, choose the antibody number from the dispenser label (Antibody 6 in this example); for Plus Incubation Time, select 32 Minutes.\n\t\tNOTE: This protocol has three different antibody numbers. The first antibody is FAP, the second is Pan-Cytokeratin, and the third is Antibody X.\nClick on Multimer HRP > Multimer HRP Blocker, then for Antibody Blocking, choose Gt Ig Block, and for Incubation Time, choose 4 Minutes. Next, on Multimer HRP Reagent, select OMap anti-Rb HRP, and for Incubation Time, choose 16 Minutes. Then, click on Cy5, and for Long Incubation Time, choose 0 Hr 8 Min.",
    "Click on Dual Sequence and choose Antibody Denaturation, then select Antibody Denature CC2-1, and for Very High Temperature, choose 100 Deg C. Ensure that incubation time is 8 min. Next, click on DS Inhibitor and select Neutralize.\nClick on DS Antibody, and for Very Low Temperature, choose 37 Deg C. Then, in Antibody, choose the antibody number from the dispenser label (Antibody 3 in this example), and for Plus Incubation Time, select 32 Minutes.\nClick on DS Multimer HRP and choose DS Multimer HRP Blocker. Then, for Antibody Blocking, select Gt Ig Block, and for Incubation Time, choose 4 Minutes. Next, on Multimer HRP Reagent, select OMap anti-Ms HRP, and for Incubation Time, choose 16 Minutes. Then, click on DS Rhodamine 6G, and for Long Incubation Time, choose 0 Hr 8 Min.\nClick on Triple Stain and select TS Antibody Denaturation, then select Antibody Denature CC2-2, and for Very High Temperature, select 100 Deg C. Ensure that incubation time is 8 min. Next, click on TS Inhibitor and select TS Neutralize.\nClick on TS Antibody, and for Very Low Temperature, select 37 Deg C. Then, in Antibody, select the antibody number from the dispenser label (Antibody 7 in this example), and for Plus Incubation Time, select 32 Minutes.\nClick on TS Multimer HRP and choose TS Multimer HRP Blocker. Then, for Antibody Blocking, select Gt Ig Block, and for Incubation Time, choose 4 Minutes. Next, on Multimer HRP Reagent, select OMap anti-Rb HRP, and for Incubation Time, choose 16 Minutes. Then, click on TS FAM, and for Long Incubation Time, choose 0 Hr 8 Min.\nAdd a title to the protocol. Select a protocol number, add a comment, and click on Active followed by Save.\nPrepare slides, print labels, and start the autostainer run",
    "Bake vendor procured FFPE (Formalin-fixed, paraffin-embedded) human tissue sections in an oven set to 70 °C for 20-60 min. While slides are baking, print labels by clicking Create Label in the autostainer software. Next, click on Protocols, select the protocol number, and click on Close/Print. Add relevant information on the slide label and click on Print.\nRemove slides from the oven and let them cool down to room temperature (RT). Apply the previously printed protocol labels to the corresponding slides.\nLoad refillable antibody dispensers with antibodies according to the antibody label number assigned in step 1.1. In this protocol, use Antibody 6 for FAP at 1 µg/mL, use Antibody 3 for Pan-Cytokeratin at 0.1 µg/mL, and use Antibody 7 for Antibody X at 2.5 µg/mL. Dilute each antibody in the specified diluent and prime the refillable antibody dispensers.\nGather blocking, detection, and amplification pre-filled reagent dispensers mentioned above and place them on a reagent tray. Load slides in the slide trays (up to 30 slides per run) and click on Running followed by Yes. Note that DAPI is not used for nuclear counterstaining.\nConfirm the start of the run by checking the run duration on the autostainer software. The protocol takes ~11 h for completion and can run overnight.\nThe next day, ensure run completion by observing green flashing lights on the slide tray slots. Then, take the slides off the instrument and rinse the slides vigorously in 1x Reaction Buffer until the liquid coverslip solution is completely removed.\nSpatial profiling platform protocol for proteomics assay\n\t\nFollow the spatial proteomics protocol indicated in the note below. Include the following changes to the protocol to enable the 3-plex automated labeling procedure.",
    "Perform steps 1.2.1-1.2.6 the day before starting the spatial proteomics protocol and move straight to the antigen retrieval step of the spatial proteomics protocol after performing step 1.2.6. Omit the visualization procedure outlined in the spatial profiling proteomics protocol.\nReplace SYTO 13 with SYTO 64 at 5000 nM to enable fluorophore integration. Dilute SYTO 64 in 1x TBS and incubate in a humidity chamber for 15 min.\nWhen setting up the scan parameters in the spatial profiling platform, select the filters and focusing channels according to the fluorophores used in the visualization panel to allow 3-plex integration. Use FITC for DISCOVERY FAM and set the exposure to 200 ms, use Cy3 for DISCOVERY Rhodamine 6G and set the exposure to 200 ms, use Texas Red for SYTO 64 and set the exposure to 50 ms (specify this as the focus channel), and finally, use Cy5 for DISCOVERY Cy5, set the exposure to 200 ms, and save changes.\n\t\tNOTE: Detailed instructions of the spatial profiling proteomics protocol are found on the official website Support tab by selecting Documentation > User Manuals. Here, look for the protein protocol for nCounter using Bond RX.\n2. ROI selection for spatial transcriptomics assays\nBake FFPE cell pellet sections in an oven set to 70 °C for 20-60 min. Follow the spatial profiling platform NGS protocol indicated in the note below and scan slides on the spatial profiling platform, selecting sizes of 50 µm and 300 µm. The following recommendation is highlighted for the spatial transcriptomics assay:\n\t\nWhen preparing the library, if various sizes of ROIs were selected, pool together ROIs of similar sizes to make one library per size. This is to ensure that sufficient sequencing depths are achieved for all ROIs without bias from size.",
    "NOTE: Detailed instructions of the spatial profiling platform are found on the official website Support tab by selecting Documentation > User Manuals. Here, look for the RNA protocol for NGS applications using Bond RX.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}