{
  "id": 8402,
  "origin_website": "Jove",
  "title": "Anaerobic Protein Purification and Kinetic Analysis via Oxygen Electrode for Studying DesB Dioxygenase Activity and Inhibition",
  "procedures": [
    "1. General Materials and Methods\nPrepare all the required media as described in Table 1. Autoclave at 120 ˚C for 15 min. Sterile filter the SOC solution, after the addition of MgCl2 and glucose, by passing it through a 0.2 µm filter. Adjust the pH of the Miller's Lysogeny Broth (LB media) solution prior to autoclaving. Supplement the LB-Amp media solution after autoclaving with sterile solutions of 0.2 mM L-cysteine, then 0.1 mM ferrous ammonium sulfate to enhance protein expression and solubility.\nPrepare the Laemmli buffer and running buffer for polyacrylamide gel electrophoresis (PAGE) as described in Table 2. Adjust the pH of the solutions (using 1 M HCl and Tris base for buffer preparation) before diluting the components to their final volumes.\nPrepare the buffers for protein purification as described in Table 3. Adjust the pH of the solutions (using 1 M HCl and Tris base for buffer preparation) before diluting the components to their final volumes.\nTransfer the prepared buffers to a bottle that can be sealed with a one-hole rubber stopper and contains a glass tube.\n\t\nUse a hose to connect the glass tube in the stopper to a vacuum source. Allow the solution to degas under negative pressure for approximately 30 min while stirring at medium speed.\nBreak the vacuum seal first, then turn off the vacuum. Next, pierce through the rubber stopper with two 20G needles (one that is long enough to reach the bottom of the bottle, and one shorter needle that can be used as a gas escape vent). Bubble in a steady flow of nitrogen while stirring at medium speed for 30 min.",
    "Remove the needles and repeat the degassing and bubbling in nitrogen for a total of three cycles. When finished, properly seal the bottle with a solid rubber stopper. Further secure the stopper with paraffin film and copper wire (20G), and place them into the glovebox.\n\t\tNOTE: All materials are placed into the glovebox and subjected to 3 cycles of purging the antechamber, followed by vacuuming out the oxygen and refilling it with nitrogen. Buffers used for purification and concentration can be capped and stored in the glove box indefinitely.\nPrepare the sodium dithionate solution by dissolving approximately one spatula (0.31\" x 2\", the smaller end of a double-ended micro-tapered stainless-steel spatula) full of sodium dithionate in approximately 1 mL of degassed water in a 1.5 mL microcentrifuge tube. Seal the tube with paraffin film before removal from the glove box.\n\tNOTE: Store solid sodium dithionate in the glove box to prevent oxidation.\n2. Preparation of the Amylose Column for Protein Purification\nMake a slurry from high flow amylose resin (15 mL) combined with 5 column volumes (75 mL) of amylose column buffer. Transfer the resin slurry into two 50 mL serum bottles and seal each bottle with a rubber septum. Puncture a 20G, 305 mm needle through the septa, and bubble nitrogen into the slurry for approximately 1 minute to remove oxygen from the suspension. Transfer the resin and protein-containing solution into the glove box.",
    "In the glove box, pour the resin into a 2 x 30 cm borosilicate column fitted with a simple stopcock, allowing the resin to settle and create a level bed. Drain off the column buffer and equilibrate the column with 3 column volumes (~30 mL total) of degassed amylose column buffer using pressurized nitrogen gas to push the buffer through the resin at approximately 1 drop/s or 5 mL/min, until the solvent is just above the resin bed.\n\tNOTE: After the protein is eluted (see step 3.5 below), the amylose column resin is regenerated by washing with 1 column volume (10 mL) of water, then 1 column volume of 1% sodium dodecyl sulfate (SDS), and finally, 3 column volumes (30 mL) of water. This step can be completed outside of the glove box. The column resin is stored at 4 °C in 20% ethanol and can be regenerated up to 5 times.\n3. Protein Expression and Anaerobic Purification of DesB\nNOTE: The DesB gene was commercially synthesized, having been placed into pET-15b, pET-32a, and pMAL- c5x vectors using the NdeI and BamHI restriction cloning sites.\nComplete the protein expression assays according to manufacturer's guidelines to determine the correct conditions for large scale expression (described in brief below).",
    "Transform the DesB-containing plasmids into commercially made, chemically competent E. coli BL21 (DE3) cells, according to the manufacturer's instructions. In brief, thaw the cells on ice for 10 min, add approximately 10-50 ng of plasmid DNA to the cell mixture, heat shock the cells at 42 °C for 10 s, and incubate them on ice for an additional 5 min. Add SOC media to obtain a final volume of 1 mL and allow the cells to shake (~200 rpm) at 37 °C for 60 min. To an LB-Amp plate, add and spread 100 µL of the cell solution and incubate overnight at 37 °C.\nSelect a single colony-forming unit from the plate after overnight incubation and use this colony to inoculate 10 mL of LB-Amp media. Grow the cells overnight, with shaking (~200 rpm) at 37 °C.\nTo 10 mL of media, add 100 µL of the overnight growth solution, and shake the new media as described in step 3.1.2 at 37 °C. When the optical density at 600 nm (OD600) is between 0.4-0.8, add isopropyl β-D-1-thiogalactopyranoside (IPTG) to obtain a final solution concentration of 1 mM.\nImmediately remove a 1 mL aliquot of the solution and transfer it to a 1.5 mL microcentrifuge tube with labeled time = 0 hours. Spin the tube at 15,000 x g for 10 min to pellet the cells. After spinning, remove the supernatant and store the cells at 4 °C.\nRemove additional aliquots (1 mL each) at time intervals after the addition of IPTG (typically at 5, 10, 12, 18 and 24 h). As described in step 3.1.4, centrifuge each tube, decant the supernatant, and store the cells at 4 °C.",
    "Once all the aliquots are obtained, resuspend the cells from each timepoint in 30 µL of bacterial protein extraction solution, incubate them at room temperature for 10-15 minutes, and centrifuge the tubes at 15,000 × g for 5 min to separate the soluble and insoluble proteins.\nTransfer the soluble protein solution to a new microcentrifuge tube and resuspend the remaining insoluble pellets with 30 µL of bacterial protein extraction solution.\nCombine the 30 µL of each solution (both soluble and insoluble solutions for each timepoint) with an equal volume of Laemmli buffer, then visualize on an SDS-PAGE gel40. Select conditions corresponding to the lanes containing the correct size bands in the soluble fraction for large scale protein expression and purification.\n\t\tNOTE: Since minimal soluble protein was initially generated using the conditions above, various supplements were added to test for effects on the soluble protein expression, with 0.2 mM L-cysteine and 0.1 mM ferrous ammonium sulfate showing enhanced protein expression. According to this protein expression screen, an appropriate expression vector for soluble production of DesB was pMAL- c5x vector.\nFollowing transformation into Escherichia coli BL21 (DE3), make a stock of DesB/pMal-c5x by combining 900 µL of bacterial culture (grown overnight with shaking at 200 rpm and 37 °C) with 100 µL of 80% glycerol. Store the stock at -80 °C in a cryogenic tube.\n\tNOTE: Make a new frozen stock approximately every 6-8 months.\nUse a pipette tip to scrape cells from the frozen stock and start a bacterial culture, growing overnight in 5 mL of LB-Amp media at 37 °C with shaking. Inoculate 1.5 liters of LB-Amp media in a 2 L flask at 37 °C and 200 rpm, using the overnight grown bacterial culture.",
    "NOTE: Due to the observed sensitivity of the protein to oxygen, it was found that reduced headspace in the flask and moderate shaking speeds improved protein yield for large-scale expression.\nInduce protein expression when the optical density at 600 nm (OD600) is between 0.4-0.8 with 1 mM IPTG and supplemented with 0.2 mM L-cysteine and 0.1 mM ferrous ammonium sulfate. Lower the incubation temperature to 30 °C and shake at 200 rpm. Spin down the cells via centrifugation after 24 h post-induction at 4,700 x g for 10 min and discard the spent media.\nResuspend the cell pellet in 20 mL of amylose column buffer per every 1.5 L of growth, followed by the addition of 1 mg of lysozyme. Stir for 20 minutes on ice.\n\tNOTE: More buffer can be added if the solution is too viscous, as protein solutions that are too viscous may disrupt the following homogenizing step.\nLyse the resuspended cell solution via high pressure homogenization with 3-5 passes at approximately 15,000 psi. Transfer the protein to a 50 mL centrifuge tube and flush the headspace with nitrogen for 1 min. Then, centrifuge the cell lysate at 20,000 x g for 40 min to remove the insoluble debris.\n\tNOTE: Successful homogenizing causes the protein to form micelles as it flows through the tube and into the collection flask, and the solution appears as a translucent grey-brown color. Keep the homogenized protein on ice throughout the process.",
    "After centrifugation, transfer the supernatant into a 50 mL tube (more than one may be necessary), cap the tube with a rubber septum, and with a 20-gauge needle, slowly bubble nitrogen gas through the solution for 2 min to displace oxygen. Wrap the septum with paraffin film and further secure it with copper wire, and bring the supernatant into the glove box along with the column materials.\nEquilibrate the column (see step 2.3) and load the protein supernatant onto the column. Collect the flow-through in 5 mL fractions under moderately pressurized nitrogen (1 drop/second or approximately 5 mL/min). Next, wash the column using another 3 column volumes of amylose column buffer and manually collect 3 mL fractions in glass test tubes under moderately pressurized nitrogen (approximately 5 mL/min). Elute the protein using 5 column volumes (~50 mL) of elution buffer and manually collect 3 mL fractions under moderate nitrogen pressure (approximately 5 mL/min).\n\tNOTE: The fractions can alternatively be collected using gravity filtration. Approximately 12 elution fractions should be collected.\nCollect 30 µL aliquots of fractions and remove them from the glove box to allow the visualization of protein-containing fractions via SDS-PAGE analysis.\n\tNOTE: The collected fractions remain in the glove box for the duration of this test. Purified DesB typically elutes from the column in fractions 3 through 5.\n4. Anaerobic Protein Concentration/Buffer Exchange\nAssemble the pressurized, stirred cell concentrator with a 76 mm reconstituted cellulose membrane filter (10 kDa cutoff). Add a sufficient amount of 20% ethanol into the concentrator to keep the membrane wet as the assembled concentrator is transferred into the glove box.\n\tNOTE: Ensure that there are no tears in the membrane and that the O-ring is not wrinkled.",
    "After bringing the stirred cell concentrator into the glove box, wash the ethanol solution off the membrane with water. Cap and pressurize the stirred cell to clean the tubing and membrane of any excess water.\nAdd all the fractions containing protein as determined by SDS-PAGE (Figure 3) to the concentrator. Add sufficient exchange buffer to yield 150 mL of total protein solution volume.\nPressurize the stirred cell chamber using an external N2 line and concentrate the protein to 50 mL with moderate stirring speed.\n\tNOTE: Achieving a concentration of 50 mL takes approximately 20 min.\nSupplement 100 mL of exchange buffer with 0.1 mM dithiothreitol (DTT) and 0.1 mM ferrous ammonium sulfate, add the solution to the stirred cell, and concentrate the protein to a total volume of 50 mL with a moderate stirring speed.\nAfter the solution reaches a volume of 50 mL, add in the supplemented exchange buffer once more, but concentrate the solution to a total volume of 10 mL with moderate stirring speed.\nFilter the concentrated protein using a 0.45 µm pore size syringe filter and aliquot into individual 0.2 mL polymerase chain reaction (pcr) tubes (each containing approximately 150 µL of the protein solution). Remove the capped aliquots from the glove box and immediately flash freeze them with liquid nitrogen. Store the aliquots at -80 °C.\n5. Desalting DesB\nFlush the glove bag with nitrogen gas for approximately 1.5 hours before use.\nThaw a 150 µL aliquot of purified DesB protein inside of the glove bag, on ice.\nWhile the protein thaws, prepare a small gravity, desalting column containing 3 mL of Sephadex G-25 coarse desalting gel in a 9 mL borosilicate column. Wash the column with 2 column volumes (~6 mL) of degassed desalt buffer.",
    "NOTE: Replace the desalting gel when there is a change in gel color from white to yellow (after approximately 7 uses).\nLoad the thawed DesB onto the column via a gravity-controlled process. Discard the flow-through. Elute the protein with approximately 5 mL of desalting buffer.\n\tNOTE: The pressure from the gas tank continually filling the glove bag will affect the rate at which the solutions drip from the column.\nFor initial determination of protein elution from the column, collect 12 vials/elutions (containing 3 drops per vial). Sealed with a rubber septum, remove them from the glove bag and test for the presence of protein either directly (through SDS-PAGE gel analysis) or indirectly (through examination of the activity of each fraction).\n\tNOTE: Typically, the fractions are tested individually for activity, as described in step 7.1, with the greatest activity corresponding to the fraction with the greatest concentration of active protein. DesB usually elutes starting in the 7th drop, after which the following 9 drops of desalted protein are collected. Protein aliquots are stored on ice during the kinetics measurements (steps 7.1-7.4).\n6. Preparing the Oxygen Electrode\nPolish the silver anode ring and platinum cathode with electrode cleaner and a damp Q-tip until there are no visible signs of black oxide deposits.\nWith scissors, cut approximately one 1.5-inch square of spacer paper (or cigarette rolling paper, which works equally as well). Then, cut 1) small triangles onto each face of the square and 2) slits into the corners to aid wrapping of the electrode.",
    "Add 5 drops of a 50% KCl solution onto the silver anode groove and connect them so they form one continuous ring of solution. Add 2 drops of the 50% KCl solution to the top of the platinum electrode. Carefully place the spacer paper on top of the platinum electrode and smooth out the spacer paper so there are no air bubbles.\n\tNOTE: Use caution to avoid tearing the spacer paper.\nCut a piece of the S4 30m PTFE (polytetrafluoroethylene) membrane that is approximately 2 inches long and place it on top of the spacer paper. Cut off the edges of the membrane so they are aligned with the outer ring of the electrode.\nUsing the O-ring applicator, push the small O-ring over the electrode to secure the spacer paper and membrane onto the electrode. Place the larger O-ring onto the circular groove of the electrode, ensuring there is no membrane underneath it. Slide the top chamber of the electrode onto the base and screw the two together.\n\tNOTE: The two are screwed on properly if no air bubbles stick to the sides of the chamber.\nPlace the assembled electrode on its base and connect the electrode to the monitoring system. Initiate the electrode control program and calibrate the electrode by performing the liquid phase calibration protocol (Figure 4A). The temperature variable should be the temperature of the room in which the experiment is performed, and the ambient pressure variable is dependent on the region and current weather conditions.\n\tNOTE: Ambient pressure can be obtained from a weather report for the region.",
    "Add 1 mL of 25 mM Tris buffer to the electrode chamber, insert the plunger, begin the calibration of an oxygen saturated solution, and adjust the stirrer speed to 100. After the electrode stabilizes, the calibration set-point for the oxygen saturated solution is determined (Figure 4B).\nWithout removing the plunger, use a 1.2 x 40 mm needle and 1 mL syringe to inject approximately 1 mL of sodium dithionite solution into the chamber, being careful to avoid adding any air bubbles (Figure 4C). Use a rubber stopper to seal the electrode chamber immediately after sodium dithionite addition.\nAllow the calibration to continue until all the oxygen is utilized and the program is completed and save the calibration (Figure 4D). Aspirate the solution from the chamber and rinse the plunger and chamber with deionized water 5-6 times to ensure complete removal of the sodium dithionite. When rinsing, use a plastic tube equipped with a pipette tip connected to a side-arm vacuum flask. Avoid damaging the membrane.\n7. Kinetic Assays Using the Oxygen Electrode\nIdentify the desalted aliquots containing active protein by serially testing 1 µL of enzyme solution for activity in a solution of 25 mM Tris buffer, with pH 7.5 and containing 100 µM gallate. Use the aliquot(s) with the greatest observed activity for the remaining experiments. (See step 5.5.1)\nDetermine the rate of the enzymatic reaction by measuring O2 consumption using an O2-sensitive Clark-type electrode with computer integration via the electrode control unit.\n\t\nFor each kinetics data point measurement of DesB, add 1 mL of 25 mM Tris buffer (pH 7.5) to the electrode chamber. Add a calculated volume of a 25 mM stock solution of gallate to the Tris buffer to achieve the desired final substrate concentration (0.05-25 mM).",
    "NOTE: Prepare fresh stock solutions of gallate and inhibitory compounds with water daily and adjust the pH to 7.5 with the addition of 0.1 mM NaOH, if necessary.\nAfter 10 s of stirring to allow for mixing of the solution, seal the chamber with the plunger slowly and screw the top down. A clean tissue may be used to soak up the excess liquid that is displaced from the chamber. Allow the electrode to equilibrate where it can produce a stable measurement of the oxygen concentration in the solution for at least 1 minute before proceeding to the addition of enzyme (background O2 consumption rate of ± 0.5 µM/min).\nUsing a gas tight 10 µL syringe, add approximately 1 µL of enzyme (approximately 3-7 µM enzyme) to the electrode chamber through the plunger.\n\t\tNOTE: The amount of enzyme can be increased or decreased in response to the observed activity of the specific aliquot to allow for reaction rates to be sufficient.\nCalculate the reaction velocity based on the slope of the first 30 s of linear data after enzyme addition and correct for background O2 consumption using the 30 s of data immediately prior to enzyme addition. The rate of catalysis is equal to the rate of O2 consumption (Figure 5A).\nAfter collection of the rate data for a given substrate concentration, empty the electrode chamber through aspiration by using a plastic tube connected to a side-arm vacuum flask and rinsing repeatedly with water for 4-6 cycles. Set up the solution in the electrode as described in step 7.2.1 using a new substrate concentration.\nVary substrate concentrations in an unordered manner and replicate throughout the course of the experiment to account for decreases in enzyme activity with time (Figure 5B).",
    "NOTE: When replicates of a specific concentration are run and demonstrate more than a 30% decrease in rate compared to an earlier run, no additional assays should be performed with that batch of enzyme. Typically, after 30-40 runs, the enzyme demonstrates a 30% decrease in activity.\nDetermine the kinetic parameters, kcat (the catalytic constant for the conversion of substrate to product) and Km (the Michaelis constant, operationally defined as the substrate concentration at which the initial rate is one-half of the maximum velocity), by a least-squares fitting of data from each of the substrate concentrations to the Michaelis−Menten equation (Figure 6) using GraphPad Prism.\nAdd 4-nitrocatechol (4NC) to test its impact on dioxygenation kinetics and determine the inhibition constant (Ki) with DesB. For each reaction condition, stock solutions of Tris (50 mM), gallate (25 mM), and 4NC (25 mM) are combined and diluted with water to yield a 2 mL solution of 25 mM Tris buffer (pH 7.5) with 1 mM gallate and varying concentrations of 4NC. The volume of 4NC was varied to achieve the desired final inhibitor concentration (0.05-20 mM).\n\t\nAfter 10 seconds of stirring to allow mixing of the solution, place the plunger in the chamber slowly and screw the top down. A clean tissue may be used to soak up the excess liquid that is displaced from the chamber. Allow the electrode to equilibrate and produce a stable measurement of oxygen concentration in the solution for at least 1 minute before proceeding to the addition of enzyme (background O2 consumption rate of ± 0.5 µM/min).\nAs described previously, add the protein (step 7.2.3), determine the reaction rate (step 7.2.4), and reset the electrode for the next condition.",
    "As a part of this series of experiments, determine the reaction rate in the absence of inhibitor multiple times. Determine the inhibition by standardization of the rates of oxygen consumption in the presence of various inhibitor concentrations with 1 mM substrate and the absence of inhibitor (v/vo).\nFit the inhibition of gallate dioxygenation to equation 7.3A and then the inhibition data to equation 7.3B using a graphing program (Figure 7).\nDetermine the precise enzyme concentration for each experiment by performing a Bradford assay after completion of all kinetic runs.\n\tNOTE: All rates were corrected for enzyme concentration. This step does not need to be done in a glove box or glove bag.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}