{
  "id": 5400,
  "origin_website": "Bio",
  "title": "Isolation and Primary Culture of Adult Human Adipose-derived Stromal/Stem Cells",
  "procedures": [
    "ASC isolation (Figure 1)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170228/20170228090852_8688.jpgFigure 1. Schematic representation of the ASC isolation process. The lipoaspirate is separated into 50 ml conical tubes, blood is aspirated, washed with PBS, incubated with digestion solution, the digestion solution is neutralized, and the tube is centrifuged. Once the tube is centrifuged, the supernatant is discarded and the SVF is washed until it is white. The SVF is then resuspended, cells are counted, then plated on cell culture plates.Warm water bath to 37 °C.Collect lipoaspirate from operating room in a sterile specimen collection container. Lipoaspiration samples commonly drain directly into vacuum containers in the operative field. These containers are sterile and can be safely transported to the laboratory where cell isolation can occur. Keep lipoaspirate at room temperature until ready to isolate cells and maintain sterile conditions when transferring to the tissue culture hood.Prepare digestion solution (see Recipe 1). Filter the solution under sterile conditions with a vacuum filter.Prepare resuspension solution (see Recipe 2). Filter the solution under sterile conditions with vacuum filter. Place resuspension solution in a 37 °C water bath. Warm digestion solution and PBS in the water bath to 37 °C.Place lipoaspirate and prepared solutions into a sterile cell culture hood and perform the following steps under sterile conditions.Separate lipoaspirate into sterile 50 ml centrifuge tubes by placing about 15 ml of lipoaspirate in each tube. Allow lipoaspirate to separate into blood and fat layers. The fat layer will float to the top of the tube, and the blood layer will be underneath it (see Figure 1).Pierce the fat layer with the aspiration pipette, and aspirate the blood layer using a 2 ml aspiration pipet. Avoid aspirating the fat layer, as this will clog the aspiration pipette (see Figure 1).",
    "Wash the fat layer with PBS until the lipoaspirate is a light reddish-yellow hue. The volume of PBS required will vary depending on how much blood is present in the lipoaspirate sample. The volume of PBS needed will range from 5 to 20 ml, and multiple washes will be required until the wash solution is clear. Centrifuge the solution at 300 x g at room temperature for 5 min to separate the wash from the fat layer. Aspirate the PBS wash below the fat layer, and avoid aspirating the fat layer and the cell pellet at the bottom of the centrifuge tube (see Figure 1). Incubate lipoaspirate in a volume of digestion solution equivalent to the original amount of lipoaspirate (15 ml) for 60 min at 37 °C. For example, 15 ml of lipoaspirate should be incubated in 15 ml of digestion solution. Mix the tube(s) by vigorously shaking the tube for 1 min and mix the tubes intermittently every 5 to10 min throughout the digestion time.Neutralize collagenase by adding an equal amount of resuspension solution to the digestion solution used. For example, 15 ml of lipoaspirate incubated in 15 ml of digestion solution should be neutralized by 15 ml of resuspension solution.Centrifuge the solution at 300 x g at room temperature for 5 min. This step separates floating adipocytes, oil, fat, collagenase solution and the SVF.Discard supernatant, leaving about 5 ml of solution and the SVF cell pellet. Resuspend the SVF cell pellet in 10 ml PBS.Repeat steps A12 and A13 two times or until pellet appears white. These washes remove red blood cells and other non-adherent cells without compromising the yield of ASCs.Resuspend the SVF in 5 ml of resuspension solution. Pipet 10 µl of cells into a 1.5 ml microcentrifuge tube.Add 10 µl of trypan blue.",
    "Mix the solution with the cells by pipetting up and down 3-5 times. Add 10 µl of the mixed trypan blue-cell solution to the hemocytometer. Count cells in the four outer quadrants. As an alternative to trypan blue, mix 1 µl of 1:1 solution of 100 µg/ml ethidium bromide and 100 µg/ml acridine orange with 25 µl of cells. Add 10 µl of the mixture to the hemocytometer. Count the cells under fluorescent microscopy.Use the following equations to determine the total number of cells per milliliter and the total number of cells: imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170301/20170301031854_7789.jpgWhere, ‘2’ represents the dilution factor, ‘10,000’ represents the hemocytometer constant. Plate the cells on 145 cm2 culture dishes at a density of 100 cells per cm2 in 20 ml of CCM (approximately 14,500 cells per 145 cm2 culture dish). The expected cell yield ranges from 1.6 x 105 to 1.1 x 106 cells per ml of liposuction tissue.Maintain cells in a humidified 5% CO2 incubator at 37 °C for 24-72 h. Since donor variability is expected with human samples, the variability in initial incubation duration is associated with differences in the rate at which different donors’ cells will adhere to the plate. After 24-72 h, gently wash cell layer with PBS to remove non-adherent cells, leaving behind the adherent ASCs on the plate. Aspirate and discard PBS wash.Replace medium with CCM (15 to 20 ml for 145 cm2 plate) following the aspiration of PBS. Replace the medium with CCM every 2 to 3 days until cells have reached 70-80% confluence. Time to confluency will depend on the proliferative rate of the cells. Confluency of 80% can be expected within 4 to 10 days with medium replacements every 2-3 days. The cells should be passaged (see Procedure B) or cryopreserved (see Procedure C) once sufficient proliferation has occurred.",
    "Visualize cells under light microscopy to check for the absence of floating cells. The presence of floating cells indicates poor adherence and cell death. Continue to maintain cells in a humidified 5% CO2 incubator at 37 °C for 24-72 h.Expansion of ASCsVisualize the cells under light microscopy (see Figure 2). The cells should be approximately 80% confluent at the time of expansion. This confluence level is optimal as it prevents changes in cytokine expression that occurs when ASCs overgrow.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170301/20170301025130_7109.jpgFigure 2. Light microscopy of passage (p) 0 and p4 ASCs under 4x and 10x magnification. The ASCs are identified by their spindle-shaped morphology. Scale bars = 100 μm.Warm 0.25% trypsin-EDTA, media, and PBS in 37 °C water bath. Aspirate off CCM from the cell culture plate.Wash cells with 10 ml PBS and aspirate the wash.Add 2-5 ml of 0.25% trypsin to a 145 cm2 plate to adequately cover the entire area.Place 145 cm2 plates in the incubator set to 37 °C for a minimum of 5 min and no more than 20 min as cells will begin to lift into solution. Visualize the cells under light microscopy to determine whether the enzymatic reaction is complete and the cells have lifted. Neutralize the trypsin by adding an equal volume of CCM. The reaction should not take longer than 10 min and should be neutralized if 10 min have passed to prevent degradation of the cell membrane. Pipet the cell solution into a sterile 50 ml conical centrifuge tube and spin at 300 x g for 5 min at room temperature.Aspirate the supernatant, leaving behind the cell pellet. Resuspend the cell pellet in CCM. Plate cells at a density of 100 cells per cm2.",
    "Cryopreservation of ASCsRemove the vial compartment of the freezing container and ensure that the freezing container is filled with isopropanol to the appropriate volume.Prepare freezing medium (see Recipe 4).Aspirate the media, wash with 10 ml PBS, and aspirate the PBS. The PBS washes away residual sera which inhibits trypsin.Add 2-5 ml of 0.25% trypsin to a 145 cm2 plate to adequately cover the entire area.Place cells in a 37 °C cell culture incubator for 5 min.Visualize the cells under light microscopy to determine whether the enzymatic reaction is complete and the cells have lifted. Neutralize the trypsin by adding an equal volume of CCM. The reaction should not take longer than 10 min and should be neutralized if 10 min has passed. Centrifuge 300 x g for 5 min at room temperature. Resuspend in 1 ml PBS. Count cells using the hemocytometer method as above.Centrifuge 300 x g for 5 min at room temperature. Aspirate supernatant and resuspend cells in freezing media to approximately 1 x 106 cells/ml.Pipet 1 ml of cell suspension into clean 1.2 ml cryogenic vials. Using this volume of cell suspension, each cryogenic vial will have approximately 1 x 106 frozen cells. Label vials with appropriate sample titles and date of freezing. Once the cells are in the freezing media, move vials to -80 °C freezer within 5 min. Extended exposure to DMSO at room temperature can lead to decreased cell viability. Place vials into an alcohol jacketed freezing container. The alcohol jacketed container slows the rate of cooling to about -1 °C/min, which is the ideal rate of cooling for cell preservation.Place alcohol jacketed freezing container into -80 °C freezer. Once the cells have been in the freezer for 24 h, they may be moved into liquid nitrogen."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}