{
  "id": 2640,
  "origin_website": "Cell",
  "title": "Protocol for designing and preparing gallium particles using cell membrane encapsulation for applications in melanoma cryoablation therapy",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nStep 1: Purification of C8161 cell membrane\nTiming: 2–3 h\nPreprocess C8161 cells.\nTake out C8161 cells (cultured in Step [preparation one[href=https://www.wicell.org#sec1.1]]) which are in the logarithmic growth phase (about 5×106 cells/T75 flask) from 37°C incubator and put them into the biosafety cabinet (Airtech, China).\nRemove the cell culture medium in T75 flask, and add 10 mL 1× PBS solution to wash C8161 cells for 2–3 times.\nAdd 2 mL trypsin and incubate the cells in a 37°C incubator for 2 min.\nThen, transfer the cell culture dish to the inverted microscope stage, observe the cell digestion under the microscope until the cells become round and detach in large quantities.\nAdd 2 mL C8161 complete medium to immediately stop the digestion.\nTransfer the cell suspension from the culture dish to a centrifuge tube, and then centrifuge at 300 g for 3–5 min.\nAfter centrifugation, move the centrifuge tube to the biosafety cabinet, then open the lid and remove the supernatant to obtain C8161 cell pellet.\nPrepare the purified C8161 cell membrane.\nDisperse the C8161 cells pellet (about 1×107 of cells) in 50 mL lysis buffer (composed of 0.25 M sucrose, 1 mM EDTA, 20 mM HEPES, and a cocktail of protease inhibitors).\nSonicate the C8161-lysis buffer suspension in a Cell Disruption Apparatus (JY92-IIN, Ningbo Scientz) for 30 cycles on ice (power: 200 W; 3 s ON, 7 s OFF; 30 cycles).\nCentrifuge the mixture at 10,000 g for 25 min (4°C) to keep the supernatant and remove the cell sediment.\nTransfer the supernatant into a 26.3 mL Beckman ultracentrifuge tube. And centrifuge at 150,000 g for 35 min (4°C) by an ultracentrifuge (Beckman) to get cell membrane pellet.",
    "Disperse C8161 cell membrane pellet in 1× PBS (1 mL per tube). And then transfer C8161 cell membrane into a new 1.5 mL EP tube (Corning).\nDetect the protein concentration of C8161 cell membrane by BCA Protein Assay Kit.\nStep 2: Obtain gallium particles (GaPs), cell membrane encapsulated gallium particles (Ga/MPs), and antitumor drug paclitaxel-loaded Ga/MPs (Ga/M/PPs)\nTiming: 4–6 h\nPrepare chitosan oligosaccharide solution (Table 1[href=https://www.wicell.org#tbl1]).\ntable:files/protocols_protocol_2135_1.csv\nA stock solution with 50 mL should be stored for no longer than 30 days at 25°C.\nWeigh 2 g chitosan oligosaccharide (COS) by an analytical balance with the precision of 0.0001 g (METTLER TOLEDO).\nDissolve COS in double distilled H2O (ddH2O) to get COS solution (40 mg/mL COS).\nPrepare GaPs. Troubleshooting[href=https://www.wicell.org#troubleshooting] section (problem 1[href=https://www.wicell.org#sec6.1]).\nMelt about 4 mL liquid metal-Ga in a 65°C DHG desktop blast drying oven (Shanghai Yiheng).\nNote: It is a good idea to use glass beaker to melt Ga since the glass beaker can resist high temperatures and metal corrosion. When Ga is in liquid state, it is confirmed that the Ga has been completely melted.\nPreheat COS solution in the 65°C DHG desktop blast drying oven.\nNote: Herein, COS solution is preserved in 15 mL centrifuge tube (Corning).\nAdd 4 g melted Ga metal into 10 mL preheated COS solution by 1 mL pipette (Eppendorf).\nDisperse Ga in COS solution at 25°C by ultrasonic cell disruptor (JY92-IIN, Ningbo Scientz) to obtain GaPs solution with a concentration of 0.4 g/mL.\nNote: The ultrasonic cell disruptor has a probe which is the key to fabricate GaPs. The parameters of sonication dispersion method are as follows: power: 200 W; 4 s ON, 4 s OFF, 150 cycles.\nCentrifuge the above mixture at 150,000 g for 35 min (4°C) and suspended by COS solution to collect GaPs solution.\nAssemble Ga/MPs.",
    "Isolate C8161 cell membrane by hypotonic cracking method (with the cells from step 1).\nMix 160 mg GaPs and 1.6 mg C8161 cell membrane with a pipette.\nSonicate the above mixture in the ultrasonic bath (power: 400 W, frequency: 45 kHz) at 25°C for 2 min.\nSqueeze the mixture with a 1 mL syringe for 12 times through the 5 μm polycarbonate membrane Avanti mini extruder (Avanti Polar Lipids) to obtain the membrane-coated Ga particles (Ga/MPs).\nAssemble Ga/M/PPs. Troubleshooting[href=https://www.wicell.org#troubleshooting] section (problem 2[href=https://www.wicell.org#sec6.3], problem 3[href=https://www.wicell.org#sec6.5]).\nMix 160 mg GaPs and 1.6 mg paclitaxel and 1.6 mg C8161 cell membrane with a pipette.\nSonicate the above mixture in the ultrasonic bath (power: 400 W, frequency: 45 kHz) at 25°C for 2 min.\nSqueeze the mixture by a 1 mL syringe through the 5 μm polycarbonate membrane for 12 times to obtain paclitaxel-loaded membrane-coated Ga particles (Ga/M/PPs).\nCAUTION: When taking out the glass beaker from the water bath, please wear insulated gloves because the oven temperature oven reaches up to 65°C.\nStep 3: Morphological comparison of GaPs and Ga/MPs by TEM and cryo-TEM\nTiming: 2 days\nThe Ga particles are characterized by transmission electron microscope (TEM) at 25°C (Figure 1[href=https://www.wicell.org#fig1]A) and cryo-TEM at −196°C (Figure 1[href=https://www.wicell.org#fig1]B) to capture their morphological variation in a frozen condition.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2135-Fig1.jpg\nFigure 1. TEM images and cryo-TEM images of Ga/MPs\n(A) TEM image of Ga/MPs at 25°C.\n(B) Cryo-TEM image of Ga/MPs under freezing treatment at −196°C. All scale bars: 500 nm.\nPrepare the samples of GaPs and Ga/MPs for TEM observation.\nPrepare two new 300 mesh carbon-coated copper meshes.\nDrop 5 μL GaPs solution and 5 μL Ga/MPs solution prepared in step 2 in 1 mL COS solution separately onto copper meshes.",
    "Incubate the sample for 1 min and then suck out the excess sample solution with clean filter papers.\nDrop 5 μL ddH2O onto the copper meshes by a 10 μL pipette to wash the samples for 2 times to remove the COS on top of the copper meshes.\nStain Ga/MPs by 2% v/v uranyl acetate for 2 min.\nDry the copper meshes at 25°C for 2 min.\nObserve the samples by transmission electron microscopy (TEM, HT7700, Japan) with the voltage of 80.0 kV.\nPrepare the samples of GaPs and Ga/MPs for cryo-TEM observation.\nSpread out 5 μL GaPs solution and 5 μL Ga/MPs solution separately onto copper meshes and incubate for 1 min.\nRemove the excess sample solution with clean filter paper.\nPlunge the copper meshes into liquid ethane for rapid freezing at about −183.3°C.\nNote: Ethane is the gaseous state at 25°C. Before the sample is prepared, ethane gas is first blown into a metal cup cooled in liquid nitrogen. The ethane changes from gas state to liquid state in the cup.\nStore the prepared samples in liquid nitrogen at about −196°C for cryo-TEM (FEI Tecnai F20 TEM, Netherlands) observation, the parameters of the cryo-TEM are as follows: voltage: 200 kV, magnification: 3k.\nCAUTION: Cryogenic liquids such as liquid ethane (boiling point: −183.3°C) and liquid nitrogen (boiling point: −196°C) need to be handled carefully to avoid frostbite.\nCritical: Rapid freezing treatment of samples under liquid ethane can promote the amorphous state ice formation without ice crystal, which keeps the frozen sample particles stay in their natural morphology state without any destruction to sample structure and electron diffraction interference during measurement as well.\nStep 4: Cell uptake\nTiming: 2 days\nDigest C8161/B16 cells.",
    "Take out C8161/B16 cells (cultured in Step [preparation one[href=https://www.wicell.org#sec1.1]]) which are in the logarithmic growth phase (about 5 × 106 cells/T75 flask) from 37°C incubator and put them into the biosafety cabinet.\nRemove the cell culture medium in T75 flask, and add 10 mL 1× PBS solution to wash C8161/B16 cells for 2–3 times.\nAdd 2 mL trypsin, incubate in the incubator at 37°C for 2 min.\nTransfer the cell culture dish to the inverted microscope stage, and observe the digestion of the cells under a microscope until the cells become round and detach in large quantities.\nAdd 2 mL cell complete medium to immediately stop the digestion.\nTransfer the cell suspension from the culture dish to a centrifuge tube, and then centrifuge at 300 g for 3 min.\nAfter centrifugation, move the centrifuge tube to the biosafety cabinet, then open the lid and remove the supernatant.\nCo-culture Ga particles and C8161/B16 cells.\nSuspend C8161/B16 cells by 5 mL 1× PBS, and count them with a hemocytometer.\nSeed C8161/B16 cells into confocal 8-well dishes (1.0 × 104 cells/dish, Corning) with the corresponding DMEM complete medium.\nCulture C8161/B16 cells in the incubator at 37°C for 12 h.\nLabel Ga/MPs, Ga/M/PPs with 100 μM 1,10-dioctadecyl-3,3,30,30-tetramethylindo-carbocyanine perchlorate (DiI) in 1× PBS at 25°C for 5 min. Ga/MPs solution: DiI= 10:1, v/v. Ga/M/PPs solution: DiI= 10:1, v/v.\nTransfer the mixture into a 0.5 mL concentration tube (50 kDa), and centrifuge at 3000 g for 5 min (20°C) to remove the free Dil and get Dil-Ga/MPs and Dil-Ga/M/PPs.\nAdd GaPs, Dil-Ga/MPs and Dil-Ga/M/PPs into confocal 8-well dish to co-incubate with C8161/B16 cells at 37°C for 4 h to prepare the co-incubated C8161/B16 cells.\nObserve the co-incubation results of cells by confocal microscope.",
    "Remove the cell culture medium in the confocal dish, and wash the co-incubated C8161/B16 cells with 200 μL 1× PBS for 2–3 times to remove free GaPs, Dil-Ga/MPs and Dil-Ga/M/PPs.\nFix the co-incubated C8161/B16 cells with 200 μL of 4% v/v of paraformaldehyde (Beyotime) for 10 min.\nStain the nucleus of the co-incubated C8161/B16 cells with 200 μL DAPI solution for 10 min.\nRinse the cells with 200 μL 1× PBS for 2–3 times.\nObserve the cells using 40× objective by the confocal laser scanning microscope (ZEISS).\nStep 5: Temperature-dependent deformation and endosomal escape\nTiming: 2 days\nTreat the co-incubated cells at different temperature.\nDigest C8161 cells as per step 9 in step 4.\nSuspend the cells by 5 mL 1× PBS, and count them with a hemocytometer.\nSeed C8161 cells into confocal 8-well dishes (1.0×104 cells/dish) with DMEM complete medium.\nCulture C8161 cells in the incubator at 37°C for 12 h.\nLabel Ga/MPs with 10 μM DiI in 1× PBS at 25°C for 5 min.\nTransfer the mixture into a 0.5 mL concentration tube (50 kDa), and centrifuge at 3000 g for 5 min to remove the free Dil.\nAdd DiI-Ga/MPs into the confocal 8-well dish to co-incubate with C8161 cells at 37°C for 4 h.\nPlace C8161 cells (defined as control group) at 25°C for 5 min. And place C8161 cells (defined as cryo group) at −80°C for 5 min.\nIncubate all the cells at 37°C for 10 min to rewarm.\nAspirate cell culture medium with Dil-Ga/MPs, and wash C8161 cells with 200 μL 1× PBS for 2–3 times.\nObserve the endosomal escape results of the co-incubated cells.\nStain endosomes with Lysotracker Deep Red in DMEM medium for 20–30 min.\nRinse C8161 cells by 200 μL 1× PBS for 2–3 times.",
    "Observe the co-localization of Ga/MPs and endosomes with a 63× oil immersion objective by a confocal laser scanning microscope.\nStep 6: In vitro cytotoxicity\nTiming: 3 days\nSeed cells into 96-well plate and do the frozen treatment.\nDigest C8161/B16/HaCaT cells as per step 9 in step 4 respectively.\nSuspend C8161/B16/HaCaT cells by 5 mL 1× PBS, and count C8161/B16/HaCaT cells by a hemocytometer.\nSeed C8161/B16/HaCaT cells into 96-well plate (4.0 × 103 cells/ well) with the corresponding DMEM complete medium.\nCulture C8161/B16/HaCaT cells in 37°C incubator for 12 h.\nAdd 1× PBS, GaPs (400 ng/μL), Ga/MPs (400 ng/μL), Ga/M/PPs (400 ng/μL) into 96-well plate to co-incubate with C8161/B16/HaCaT cells at 37°C for 24 h.\nPlace C8161/B16/HaCaT cells (defined as control group) at 25°C for 5 min. And place C8161/B16/HaCaT cells (defined as cryo group) at −80°C for 5 min.\nNote: Here, both control group and cryo groups contains 12 samples: PBS-C8161, PBS-B16, PBS-HaCaT, GaPs-C8161, GaPs-B16, GaPs-HaCaT, Ga/MPs-C8161, Ga/MPs-B16, Ga/MPs-HaCaT, Ga/M/PPs-C8161, Ga/M/PPs-B16, Ga/M/PPs-HaCaT.\nIncubate all the cells at 37°C for 10 min to rewarm.\nMeasure and calculate cell viability.\nRemove cell culture medium, and wash them with 100 μL 1× PBS for 2–3 times to clean 1× PBS, GaPs, Ga/MPs or Ga/M/PPs in the culture medium.\nAdd 10 μL CCK-8 (Cell Counting Kit-8, Dojindo) reagent into each well of 96-well plate.\nAfter 1 h incubation, the multifunctional enzyme marker (Thermo Scientific) is applied to the optical density (OD) with the excitation wavelength of 450 nm.\nNote: The cell viability is calculated by the formula (ODeg-ODb)/(ODcg-ODb), where ODeg means the OD of cells cultured by GaPs, Ga/MPs, Ga/M/PPs with and without freezing treatments, ODcg means the OD of cells cultured by 1× PBS, and ODb means the OD of wells filled with only CCK-8 solution.\nStep 7: In vivo antitumor cryotherapy",
    "Timing: 11 weeks\nC8161 tumor-bearing mice are applied for in vivo cryotherapy with three Ga particles (GaPs, Ga/MPs and Ga/M/PPs) injected directly into tumor sites to achieve high performance of tumor ablation under freezing treatment.\nInject the pre-prepared three Ga solutions (GaPs, Ga/MPs and Ga/M/PPs, obtained from step 2) separately into tumor site 24 h ahead of in vivo cryo-treatments.\nPrepare 200 μL 1× PBS solution, 200 μL GaPs solution, 200 μL Ga/MPs solution, and 200 μL Ga/M/PPs solution.\nNote: The concentrations of the three Ga solutions are all 0.4 g/mL. 1× PBS and the three Ga solutions are separately mixed by a pipette before injecting into mouse tumor sites.\n56 tumor-bearing mice prepared in Step [preparation two[href=https://www.wicell.org#sec1.2]] are randomly divided into 8 groups and each group have 7 mice.\nNote: Here, 1- PBS group means inject 100 μL 1× PBS per mouse into the tumor tissue site, 2- PBS+Cryo group means inject 100 μL 1× PBS per mouse into the tumor tissue site with tumor cryoablation, 3-GaPs group means inject 100 μL GaPs solution per mouse into the tumor tissue site, 4-GaPs+Cryo group means inject 100 μL GaPs solution per mouse into the tumor tissue site with tumor cryoablation, 5-Ga/MPs group means inject 100 μL Ga/MPs solution per mouse into the tumor tissue site, 6-Ga/MPs group means inject 100 μL Ga/MPs solution per mouse into the tumor tissue site with tumor cryoablation, 7-Ga/M/PPs group means inject 100 μL Ga/M/PPs solution per mouse into the tumor tissue site, 8-Ga/M/PPs group means inject 100 μL Ga/M/PPs solution per mouse into the tumor tissue site with tumor cryoablation.\nIn-vivo cryo-treatments with cryoablation system. Troubleshooting[href=https://www.wicell.org#troubleshooting] section (problem 4[href=https://www.wicell.org#sec6.7], problem 5[href=https://www.wicell.org#sec6.9]).\nIntraperitoneally inject 2.5% v/v Avertin solution for mice with dosage of 100 μL/10 g.",
    "Directly insert cryoprobe of HYG-II cryoablation system into tumor tissue (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2135-Fig2.jpg\nFigure 2. The schematic of cryoablation treatment for tumor-bearing mouse\nIn order to perform cryoablation, cryoprobe is inserted into tumor site and cryosurgery system controls the ablation temperature by alternating cold medium liquid nitrogen and heat medium ethanol delivery for cooling and heating.\nTreat tumor-bearing mice for 4 min for each time and twice totally with the interval of 7 days.\nMonitor body temperature of mice by infrared camera and thermocouple during treatment process.\nMeasure body weight of mice.\nMeasure tumor length and width of mice by the Vernier caliper, and accordingly to calculate the tumor volumes.\nObserve tumor growth by in vivo small animal optical imaging device (IVIS Spectrum, PerkinElmer, America) with Em: 540 nm, Ex: 500 nm, exposure time: 2 s.\nCritical: In the animal experiment, the Ga based drug dosage is 10 mg per mouse (500 mg/kg). Many studies have reported the safe dosage of metal Ga in living bodies, and 700 mg/kg has been identified as its maximum tolerated dose (MTD). (Yan et al., 2018[href=https://www.wicell.org#bib8]). In this experiment, the Ga dosage in mice have met the requirement of MTD."
  ],
  "subjectAreas": [
    "Material Sciences",
    "Biotechnology And Bioengineering",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}