{
  "id": 8486,
  "origin_website": "Jove",
  "title": "Combining Behavior and EEG to Study the Effects of Mindfulness Meditation on Episodic Memory",
  "procedures": [
    "All procedures were approved by the Institutional Review Board of Bowdoin College, in accord with federal guidelines for the protection of human subjects.\n1. Subject recruitment and preparation for the experiment\nRecruit 40 18-29 year old subjects who are meditation naïve, right-handed, fluent English speakers, with normal or corrected to normal vision, with no neurological conditions.\n\tNOTE: Studying younger children and older adults would require a separate age-specific study. The development of the frontal and parietal lobes is important for performing the episodic memory task. And there is variability in the EEG across age. Studying younger children and older adults requires age specific cognitive tasks and specialized EEG recording and data analysis protocols that are not accommodated in the present protocol. Recruit only right-handed subjects to reduce variability in EEG activity.\nRandomly assign 40 subjects to a mindfulness meditation experimental or waitlist control group for a total of 20 subjects in each group.\nSchedule the experimental sessions and mindfulness meditation training such that the delay between pre-training and post-training experimental sessions are equal for the mindfulness meditation experimental and waitlist control groups (see Figure 1 for a visual depiction of the sessions).\nimgsrc://cloudfront.jove.com/files/ftp_upload/61247/61247fig1.jpg\nFigure 1: Visual depiction of the sessions. Subjects completed the Five Facet Mindfulness Questionnaire (FFMQ)46 and performed the episodic memory task while EEG was recorded during the pre-training and post-training experimental sessions. Subjects were randomly assigned to either train in mindfulness meditation for four weeks or remain on a waitlist to be trained in mindfulness meditation. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61247/61247fig1large.jpg]\nInform subjects about the procedures involved in the behavioral testing, the EEG recording, and the mindfulness meditation training. Ensure that subjects refrain from practicing meditation outside those conducted for the research study.\n2. Mindfulness questionnaire",
    "For each experimental session, have subjects complete the Five Facet Mindfulness Questionnaire (FFMQ)46 (see Supplementary File 1).\nAnalyze the mindfulness data.\n\t\nMeasure each subject’s mindfulness by calculating scores for FFMQ Total as well as Observe, Describe, Awareness, Nonjudge, and Nonreactive scales by summing up the scores for each subscale (note that for some items the scoring must be reversed (i.e., change 1 to 5, 2 to 4, 4 to 2, and 5 to 1) according to the instructions in the FFMQ46 (see scoring instructions in Supplementary File 1).\nCompare subjects’ FFMQ Total as well as Observe, Describe, Awareness, Nonjudge, and Nonreactive scores for the mindfulness meditation experimental and waitlist control group across pre-training and post-training experimental sessions.\n3. Episodic memory task\nPrepare a list of 800 adjectives that are equated for word frequency according to the Kucera and Francis47 word norms (see Supplementary File 2).\nFor each experimental session, have subjects practice the encoding phase by presenting 10 words and performing the encoding task as described below.\nFor each experimental session, have subjects perform the encoding phase.\n\t\nHave subjects study a list of 200 adjectives and either create a mental image of a spatial scene described by the adjective (place task) or think about the meaning of the word and rate its pleasantness (pleasant task).\nAfter presentation of each word, ask subjects to rate how well they performed the encoding task (see Figure 2 for a visual depiction of the encoding procedure).\nFor each experimental session, have subjects practice the source retrieval phase by presenting the 10 words that were shown at encoding practice and five new words, and perform the source retrieval task as described below.\nFor each experimental session, have subjects perform the source retrieval phase while recording EEG.",
    "Present the 200 words that were shown at encoding randomly intermixed with 200 new words. Send time stamps that correspond to each behavioral condition to the EEG recording. Words should be presented in 20 blocks to give subjects rest breaks to rest their eyes.\nDuring the presentation of each word, ask subjects to indicate if the word was new or if they recognized it as being studied in the encoding phase. For recognized words, ask subjects to indicate the source, whether the word was studied in the place task or the pleasant task (see Figure 2 for a visual depiction of the source retrieval procedure).\n\t\tNOTE: The episodic memory task can be designed using any software designed for behavioral research such as EPrime which can send time stamps to the EEG recording using Task Events (see Table of Materials). Tutorials and example experiments are available online (e.g., https://pstnet.com, https://step.talkbank.org48).\nimgsrc://cloudfront.jove.com/files/ftp_upload/61247/61247fig2.jpg\nFigure 2: Visual depiction of the experimental paradigm. During the episodic memory task, subjects studied adjectives and either imagined a scene (place task) or judged its pleasantness (pleasant task). During the source retrieval phase subjects decided which task was performed with each word (“Old Place Task” or “Old Pleasant Task”) or “New”. This figure has been modified from Nyhus et al.60. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61247/61247fig2large.jpg]\nMark each trial based on the behavioral condition and the subject’s response (see Figure 3 and Figure 4) and analyze the episodic memory behavioral data.\n\t\nMeasure subjects’ ability to remember source information by calculating item discrimination (item d’, see Figure 3):\nZ​(hit rate) – Z(false alarm rate)\nMeasure subjects’ ability to remember source information by calculating source discrimination (source d’, see Figure 4).\nZ(correct source rate) – Z(incorrect source rate)",
    "Compare subjects’ item and source discrimination (item and source d’) for the mindfulness meditation experimental and waitlist control group across pre-training and post-training experimental sessions.\nimgsrc://cloudfront.jove.com/files/ftp_upload/61247/61247fig3.jpg\nFigure 3: Data categories included in the measurement of word memory. Trials were marked based on the behavioral condition and the subject’s response and used to calculate item discrimination (item d’). Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61247/61247fig3large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/61247/61247fig4.jpg\nFigure 4: Data categories included in the measurement of source memory. Trials were marked based on the behavioral condition and the subject’s response and used to calculate source discrimination (source d’). Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61247/61247fig4large.jpg]\n4. EEG recording and analysis\nSet up the EEG cap (see Table of Materials).\n\tNOTE: An EEG capping tutorial and other useful information is available through online resources (e.g., https://pursue.richmond.edu49).\n\t\nMeasure the subject’s head and put all the electrodes on the correct size EEG cap according to the extended international 10-20 system.\nClean the subject’s forehead with an alcohol wipe.\nApply the EEG cap to the subject’s head by parting their hair then inserting conductive gel with a Luer-lock syringe with a blunted needle.\nUsing the EEG recording software, click on impedances and make sure they are under the resistance level recommended by the specific EEG system chosen for use by the researchers.\nAsk the subject to remain as still as possible during the experiment. Show the subject the EEG signal when they are still and when they blink or make jaw or facial movement.\nRecord the EEG.\n\t\nSet the EEG amplifier with the EEG recording software by clicking on edit workspace and set to acquire signal with a .1‒100 Hz bandpass filter and 500 Hz sampling rate for all subjects.\nStart the EEG recording.",
    "Start the source retrieval phase and ensure that the time stamps from the source retrieval task are showing up in the EEG recording.\nOnce the subject has completed the source retrieval task, clean the EEG cap and electrodes with deionized water and disinfectant.\nProcess and analyze the EEG data.\n\t\nHigh-pass filter the data at 1 Hz and low-pass filter the data at 100 Hz.\nIdentify and interpolate bad channels using surrounding channels50.\nRe-refence the data to an average reference51.\nSegment the data relative to the onset of each time stamp from the source retrieval task and subtract a pre-stimulus baseline period.\nIdentify and remove artifacts in the EEG data such as eye-blink and eye-movement artifacts. Detect and reject trials with large artifacts (voltage fluctuations of over 1,000 μV or data 5 standard deviations beyond the norm). Reconstruct the EEG after running independent component analysis (ICA)52 and identifying and removing noise components53.\nConvert the EEG data to the time-frequency domain across 100 log-spaced frequencies from 3 Hz to 125 Hz using a Morlet wavelet transformation with the wavelet increasing from 3 cycles at 3 Hz to 25 cycles at 125 Hz.\nCompare theta power relative to pre-stimulus baseline in the mindfulness meditation experimental and waitlist control groups across pre-training and post-training experimental sessions in right frontal and left parietal channels which show effects during source retrieval54,55,56,57. All analyses should control for multiple comparisons.\n\t\tNOTE: The EEG data can be processed and analyzed using publicly available software designed for signal processing such as EEGLab58. EEGLab training workshops and tutorials are available through the Swartz Center for Computational Neuroscience (https://sccn.ucsd.edu/eeglab/index.php).\n5. Mindfulness meditation training\nHire a mindfulness meditation instructor trained in the Mindfulness Based Stress Reduction (MBSR) technique59.\n\tNOTE: Instructors trained in the MBSR technique can be found online (e.g. https://www.brown.edu/public-health/mindfulness/programs/mbsr-teacher-recognition).",
    "Have the 20 subjects in the mindfulness meditation experimental group meet as a group for one hour each week for four weeks with the mindfulness meditation instructor.\n\tNOTE: The standard MBSR course is eight weeks and includes breath awareness, sitting meditation, yoga, and relaxation techniques. The mindfulness meditation training should include aspects of the standard MBSR course such as breath awareness and sitting meditation (see Supplementary File 3). These practices, which relate to focusing attention and executive function are most likely to contribute to episodic memory.\nHave subjects practice mindfulness meditation for at least 20 min each day using a guided breath awareness meditation recording provided by the mindfulness meditation instructor.\nTrack daily mindfulness meditation practice by asking subjects how many minutes they practiced mindfulness meditation, what they did during their meditation, and how the practice was going for them through daily emailed surveys (see Table of Materials).\n\tNOTE: Researchers should consider excluding subjects who do not spend a substantial amount of time practicing mindfulness meditation.\nSchedule the post-training experimental session as soon as possible after completion of the mindfulness meditation training.\n\tNOTE: Researchers should consider excluding subjects who are unable to complete the post-training experimental session soon after the completion of the mindfulness meditation training. Please reach out to experts in cognitive neuroscience who use the EEG technique for randomized controlled experiments for further information."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}