{
  "id": 17577,
  "origin_website": "Jove",
  "title": "Carrier-assisted One-pot Sample Preparation for Targeted Proteomics Analysis of Small Numbers of Human Cells",
  "procedures": [
    "NOTE: The step-by-step cLC-SRM analysis is shown in Figure 1.\n1. Pretreatment of PCR tubes\nAdd 100 µL of nonhuman (e.g., Shewanella oneidensis) cell lysate digests at 0.2 µg/µL to PCR tubes. Incubate at room temperature for overnight to coat PCR tube surface.\nRemove the cell lysate digests by pipetting, rinse PCR tubes with HPLC-grade water 3 times, and then airdry PCR tubes in a fume hood.\nStore coated PCR tubes in a 4 ˚C freezer till further use.\n2. FACS sorting\nAlign a fluorescence-activated cell sorter (FACS) (see Table of Materials) into a 96-well PCR plate using fluorescent beads with dyes that can be excited by the laser source to provide reliable reference signals.\nVerify that the FACS machine is well aimed for sorting cells into the bottom of PCR plates.\n\t\nSet the angle of the sort stream to the minimum possible to maximize the success rate that the cells will be sorted into the bottoms of wells rather than hit the sides.\nTo aim the machine, use the test stream to 'sort' droplets of PBS buffer (e.g., 100 droplets) onto the well of an empty plate to make sure that the collected droplets are on the bottom. If the droplets do not land in the right position, recalibrate the cell sorter and repeat till the droplets in the sort stream are collected correctly.\nPlace the coated PCR tubes into a 96-well PCR tube rack.\nSort desired numbers of human breast cells (MCF7 or MCF10A) into precoated PCR tubes.\nImmediately centrifuge the sorted breast cells at 100 x g for 10 min at 4 °C to keep them at the bottom of the tube to avoid potential cell loss.\nStore the sorted cells in a -80 °C freezer until further analysis.",
    "3. Addition of protein carrier, heavy internal standards, and TFE\nAdd 4 µL of 25 mM NH4HCO3 into PCR tubes containing collected cells.\nAdd 1 µL of 10 ng/µL bovine serum albumin (BSA) in 25 mM NH4HCO3 into sample tubes.\nAdd 0.3 µL of 100 fmol/µL crude heavy peptide standards (total 30 fmol) into sample tubes.\n\tNOTE: Aliquots of crude heavy peptide standards for EGFR/MAPK pathway proteins are made at a nominal concentration of 100 fmol/µL in 25 mM NH4HCO3. Dispense the small volume of crude heavy peptide standards at 100 fmol/µL into the middle of the solution and make sure there is no left-over liquid in the pipet tip.\nAdd 9 µL of 100% TFE into sample tubes with the final concentration of ~60% TFE.\nCentrifuge at 1500 x g for 5 min and then gently vortex at 100 x g for 3 min.\n4. Cell lysis and protein denaturation\nSonicate FACS-sorted breast cells on ice for 1 min with 1-min intervals for a total of 5 cycles at the 70% amplitude and 0.5 Hz.\nIncubate samples at 90 °C for 1 h for protein denaturation using a PCR thermocycler with the heated-lid option.\n\tNOTE: TFE is a volatile solvent with a boiling point of 74 °C, and thus the heated-lid option is selected to avoid complete drying with substantial sample loss.\nCool samples to room temperature with centrifugation at 1500 x g for 3 min.\n5. Reduction and alkylation (optional)\nAdd 0.6 µL of 50 mM DTT for a final concentration of 2 mM.",
    "NOTE: DTT solution needs to be freshly prepared each time. Weigh 77.5 mg of DTT and then dissolve into 1 mL of 25 mM NH4HCO3 to make 500 mM DTT. 10 µL of 500 mM DTT is then added into 90 µL of 25 mM NH4HCO3 to make 50 mM DTT.\nCentrifuge at 1500 x g for 5 min and then gently mix at 850 rpm for 3 min.\nIncubate at 56°C for 1 h with gentle shaking at 100 x g.\nCool samples to room temperature and centrifuge at 1500 x g for 3 min.\nAdd 0.5 µL of 60 mM IAA to the RT-PCR tube with the final concentration of ~2 mM.\n\tNOTE: IAA solution needs to be freshly prepared each time. Weigh 74.3 mg of IAA and then dissolve into 1 mL of 25 mM NH4HCO3 to make 400 mM IAA. 15 µL of 400 mM IAA is added into 85 µL of 25 mM NH4HCO3 to make 60 mM IAA.\nIncubate in the dark at room temperature for 30 min with gentle shaking at 100 x g.\n\t​NOTE: The reduction and alkylation steps are optional when there are no cysteine-containing peptides selected for target proteins.\n6.Trypsin digestion\nReduce the sample volume to ~4 µL using a SpeedVac concentrator.\n\tNOTE: TFE is a volatile solvent with boiling point at 74°C. High percentage TFE inhibits trypsin digestion.\nAdd 9 µL of 25 mM NH4HCO3 and 1-3 µL of 15 ng/µL trypsin for digestion with the final trypsin concentration of 1-3 ng/µL.\n\t​NOTE: For 10 FACS-sorted human breast cells (~1 ng), the ratio of trypsin enzyme over protein is ≥15:1, 750-fold higher than that in standard trypsin digestion (the ratio of 1:50).\nMix gently at 100 x g for 3 min and incubate overnight (~16 hours) at 37 °C.",
    "Add 0.5 µL of 5% formic acid to stop the enzymatic reaction.\nCentrifuge for 1 h at 1500 x g.\nStore in -80 °C freezer until further LC-SRM analysis or in 4 °C freezer for immediate analysis.\n7. Preparation for direct LC-SRM analysis\nRemove the cap of the PCR tube that was used for collection (Step 2) and processing (Step 6) of FACS-sorted breast cells.\nInsert PCR tube into LC vial.\nClose the LC vial for LC-SRM analysis.\n\t​NOTE: For small numbers of cells processed in 96-well PCR plate, the mat cover will be added to seal the plate for direct LC-SRM analysis.\n8. LC-SRM analysis\nAnalyze samples using UPLC coupled to a triple quadrupole mass spectrometer.\nConnect capillary C18 columns (75 µm i.d. × 20 cm for standard gradient and 100 µm i.d. × 10 cm for short gradient) to a chemically etched 20 µm i.d. fused silica electrospray emitter via a stainless metal union.\nUse a 20 µL sample loop for directly loading all of the sample (~15 µL in total) into the LC column to maximize detection sensitivity.\nUse 0.1% formic acid in water and 0.1% formic acid in 90% acetonitrile as mobile phases A and B for capillary RPLC separation.\nUse the binary LC gradient at flow rates of 300 nL/min for a standard gradient when large numbers of target proteins (>10) are measured. Standard gradient: 5-20% B in 26 min, 20-25% B in 10 min, 25-40% B in 8 min, 40-95% B in 1 min and at 95% B for 7 min for a total of 52 min and the analytical column re-equilibrated at 99.5% A for 8 min.",
    "Use the binary LC gradient at flow rates of 400 nL/min for a short gradient when small numbers of target proteins (≤10) are measured. Short gradient for fast separation: 5-95% B in 5 min and the analytical column re-equilibrated at 99.5% A for 5 min with a total 10 min LC run time.\nOperate the QQQ mass spectrometer with ion spray voltages of 2,400 ± 100 V, a capillary offset voltage of 35 V, a skimmer offset voltage of -5 V and a capillary inlet temperature of 220° C.\nObtain the other QQQ MS parameters from automatic tuning and calibration without further optimization.\nSpike different concentrations of crude heavy peptide standards into 20-50 ng/µL of nonhuman cell lysate digests before LC-SRM analysis of samples to determine peptide LC retention time (RT) for building a scheduled SRM method and potential interference transitions for accurate quantification.\nUse the RT scheduled SRM mode for multiplexed quantification with the scan window of ≥6 min.\n\t​NOTE: The scan window will be adjusted accordingly depending on the number of transitions in a certain time window.\nSet the total cycle time to 1 s, and the dwell time for each transition is automatically adjusted depending on the number of transitions scanned at different retention time windows. A minimal dwell time of 10 ms is needed for each SRM transition. All target proteins can be simultaneously monitored in a single LC-SRM analysis\n9. Data Analysis\nImport raw data files into publicly available Skyline software33 for data visualization of each target peptide to determine their detectability.\nUse two criteria to determine SRM peak detection and integration: 1) same LC retention time; 2) approximately the same relative SRM peak intensity ratios across multiple transitions between endogenous (light) peptides and their corresponding (heavy) isotope-labeled peptide internal standards.",
    "Inspect all the SRM data manually to ensure correct SRM peak assignment and SRM peak boundary for reliable quantification using the above two criteria.\nUse the best transition with a high SRM signal but without matrix interference for protein quantification, and use the other transitions as a reference.\nUse multiple replicates to obtain the standard deviation (SD) and coefficient of variation (CV).\nCalculate the signal-to-noise ratio (S/N) by the peak apex intensity over the average background noise within a retention time region of ±15 s for standard gradient and ±6 s for short gradient. The limit of detection (LOD) and the limit of quantification (LOQ) are defined as the lowest concentration points at which the S/N ratio is at least 3 and 7, respectively.\nApply one additional criteria for conservatively determining the LOQ values besides S/N ≥7: surrogate peptide response against different cell numbers must be within the linear dynamic range.\nUse the Excel software to plot all calibration curves. Load the RAW data from QQQ MS into publicly available Skyline software to display graphs of extracted ion chromatograms (XICs) of multiple transitions of target proteins monitored.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}