{
  "id": 11182,
  "origin_website": "Jove",
  "title": "On-Chip Endothelial Inflammatory Phenotyping",
  "procedures": [
    "1. Cell Culture and Substrate Preparation\nCut 3-inch circular substrates from a 100 x 20 mm tissue culture dish (BD Falcon) using a lathe. Sterilize substrates by submersion in 70% ethanol. Place in a Petri dish and coat with 4 ml type-I collagen (100 μg/ml) for 1 hr at room temperature, then rinse with 4 ml 1 x PBS.      \nSuspend Human Aortic Endothelial Cells (HAEC, passage 4-6) at 6.5x105 cells/ml and seed by applying 1 ml directly to substrate. Place in a 37 °C, 5% CO2 incubator and allow cells to adhere to the substrate for 1 hr.        \nAdd 9 ml of Endothelial Growth Medium-2 (EGM-2) supplemented with 1x antibiotic-antimycotic solution to the cells. Change media every 2 days until the cells reach 90% confluency.        \nMaintain THP-1 cells in RPMI 1640 medium supplemented with 10% FBS and 1x antibiotic-antimycotic solution. Passage cells when they reach a density of 106 cells/ml. \n2. Cell Shearing Protocol \nCells are conditioned in a custom cone-and-plate Cell Shearing Device (CSD). Device details and design specifications are documented in Table 1 and Figure 4.\nPrepare the CSD. Sterilize the chamber housing with ethanol and rinse with sterile PBS. Heat the housing to 37 °C and level to ensure that the cone is perpendicular to the cell monolayer. Assemble the substrate with the cells from the bottom of the housing and set the cone to the desired height.\nUse Leibovitz-15 (L-15) medium supplemented with Endothelial BulletKit as the shearing medium to maintain proper pH in the absence of  CO2. To stimulate inflammation, add tumor necrosis factor-α (TNF-α, 0.5 ng/ml) to the shearing medium and inject 6 ml in the device via a syringe connected to an inlet port, taking care not to introduce air bubbles in the chamber.",
    "Shear cells at a high magnitude steady shear stress (HSS, 15 dyne/cm2) or an oscillatory shear stress (OSS, 0 ± 5 dyne/cm2, 1 Hz) for 4 hr. The desired SS is achieved by rotating the cone above the cells, which is precisely controlled with a micro-stepping motor as previously described.6 The wall SS at the surface (τw) is approximated by:\nimgsrc://cloudfront.jove.com/files/ftp_upload/4169/4169eq1.jpg\nwhere μ is the viscosity of the medium, ω is the angular velocity of the cone, and α is the cone angle (0.5°). The cone alignment with the substrate is adjusted to within 0.05° through precision leveling and the gap height set at 20 ± 10 μm using a depth gauge to minimize circumferential and radial variation in τw. The device has been validated to ensure laminar flow characteristics. Remove cells from the device and prepare for analysis of monocyte adhesion.\n3. Fabrication of PDMS Microfluidic Chamber\nObtain master mold for desired microfluidic channel number and channel height depending on the application. The characteristics of the specific design used in this protocol are detailed in Table 1. The method for creating these is already well documented in the literature.1 Briefly, the network of channels is designed using CAD software (Autodesk Inventor) and printed at 5000 dpi on a transparency. Negative photoresist (SU8) is spun onto a silicon wafer to a thickness of 100 μm. The transparency is overlaid and exposed to UV light. Non-polymerized photoresist is removed to generate the positive replica master. \nTo make PDMS solution mix silicone base with silicone curing agent 10:1 by weight in a weigh boat and stir with a 5 ml serological pipet. Be careful not to scrape the walls of the weigh boat to avoid adding plastic flakes to the solution.",
    "Place the master wafer in a 100x15mm Petri dish and pour the PDMS solution into the dish.\nCover the dish and place it into a vacuum container for 15 minutes to remove bubbles. After 15 minutes take the Petri dish out and remove any excess bubbles by gently blowing air over the surface.\nPlace the Petri dish in an oven for 1 hour at 70 °C. Remove the dish and cut out the microfluidic chambers using a sharp blade.\n4. Assembly of Device on Microscope\nTurn on light source to inverted microscope and set heater to 37 °C. Attach tubing to a 10 ml syringe and fill with distilled water such that there are no bubbles. Place the syringe in the syringe pump and set flow rate to induce a wall SS of 1 dyne/cm2. The wall shear stress (τw) generated along the centerline of the channel is approximated using the standard equation for a parallel-plate flow chamber:\nimgsrc://cloudfront.jove.com/files/ftp_upload/4169/4169eq2.jpg\nwhere μ is the viscosity of the medium, Q is the volumetric flow rate, h is the channel height, and w is the channel width. Note: since the channels are of finite width the actual τw will vary with w depending on the channel aspect ratio, and measurements are avoided at the 25% nearest the side walls.1,7\nPlace PDMS chamber in water and use a 100μl micropipette to remove air from the individual channels. Attach vacuum adapter to chamber making sure that the valve is set to off.\nPlace Petri dish with HAEC monolayer over the objective. Place the PDMS chamber over the Petri dish and carefully set it on the HAEC monolayer while assuring that no air bubbles form between the device and the monolayer. Turn the valve so that the vacuum is on and the chamber is firmly attached.",
    "Cut 19 gauge needles blunt such that there is only 5 mm of metal left. Fill the plastic reservoir with buffer and put into PDMS chamber entrance. Repeat for appropriate number of channels to be used. Attach tubing from syringe pumps to PDMS channel exits.\n5. Monocyte Adhesion Assay Under Shear Stress\nSuspend THP-1 cells at 2x106 cells/ml in HBSS + Ca2+/Mg2+ + 0.1% HSA. Activate THP-1 cells by incubating with stromal derived factor-1 (SDF-1, 50 μg/ml) for 15 min at room temperature.\nTurn on syringe pump to establish flow, then add 50 μl of cell suspension to reservoir without introducing air bubbles. Once flow is fully developed, begin data acquisition.\nRun for 5 min at appropriate flow rate, adding buffer to the reservoir if the solution gets low. Continue flowing buffer into the channels to wash out any unbound cells in the flow stream. \n6. Data Acquisition and Analysis\nAcquire digital image sequences at 3 frames/s for 2 min following fully developed flow along the longitudinal axis of the channel at 3 locations in the channel, taking care not to record immediately after entrance or before exit ports or in the 25% nearest the side walls. \nCount the number of arrested cells per field by identifying their phase-bright appearance in the same focal plane as the monolayer. \nFirm cell arrest is defined by movement < ½ cell diameter in 10 s. Average data over 3 random fields / channel and quantify using ImageJ software.\n7. Representative Results",
    "Although the vascular endothelium is uniformly exposed to agonists that contribute to systemic inflammation, atherosclerosis is a focal disease that develops preferentially at sites of flow disturbance in arteries, implicating spatial heterogeneity in endothelial function.8 Circulating inflammatory mediators such as TNF-α are elevated in human serum under metabolic stress and correlate with impaired endothelial function.9, 10 TNF-α induces a well-characterized response in EC that includes up-regulation of cell adhesion molecules (CAMs; e.g. VCAM-1, ICAM-1, E-selectin) and chemokines that recruit monocytes from the circulation, a hallmark of the early atherosclerotic lesion.11 Hemodynamics is an important regulator of endothelial inflammatory phenotype.12 High magnitude shear stress (HSS; e.g. 15 dynes/cm2) or pulsatile shear stress (PSS; e.g. 15 ± 5 dynes/cm2) associated with sites of resistance to atherosclerosis in arteries down-regulate TNF-α-induced responses. Conversely, low magnitude shear stress (LSS; e.g. 2 dynes/cm2) or oscillatory shear (OSS; e.g. 0 ± 5 dynes/cm2), characteristic of susceptible sites in vivo, exacerbate cytokine-induced inflammation.13, 14 Our microfluidic PDMS devices provide a platform for conducting mechanistic studies to test hypotheses related to the superposition of metabolic stress with hydrodynamic factors in the regulation of endothelial function and pathology. The utility and versatility of the approach is broadly illustrated through the following representative results. \nimgsrc://cloudfront.jove.com/files/ftp_upload/4169/4169fig1.jpg",
    "Figure 1. Shear stress differentially modulates THP-1 cell adhesion to TNF-α inflamed endothelial monolayers.  These data were acquired using the detailed protocol described above and documented in the video. HAEC monolayers were simultaneously exposed to a low dose of the inflammatory cytokine TNF-α (0.5 ng/ml, ~EC50 for VCAM-1 up-regulation) and either HSS (15 dynes/cm2) or OSS (0 ± 5 dynes/cm2, 1 Hz) in a custom CSD for 4 hr as described in the detailed protocol. THP-1 cell arrest was quantified under shear flow in a PDMS flow chamber. This cell line that mimics the phenotype of human monocytes was chosen for its reproducibility and ease of use. HSS attenuated the inflammatory response compared to OSS, resulting in decreased THP-1 cell arrest. Data were analyzed by Student's t-test and are represented as mean ± SEM of 3 independent experiments. Adapted with permission from DeVerse et al.5\nThe following data demonstrate the versatility of our approach using examples from our published work. Departures from the above protocol are indicated where applicable.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4169/4169fig2.jpg\nFigure 2. Modulation of cytokine-induced VCAM-1 expression and monocyte recruitment in a shear stress gradient. A)  HAEC monolayers were stimulated with TNF-α (0.3 ng/ml) for 4 hr under flow in a VMMC designed based on Hele-Shaw flow theory.15 A linear decrease in SS magnitude along the centerline of the channel was achieved by designing the sidewalls of the chamber to coincide with the streamlines of a two dimensional stagnation flow and shaping the end of the channel to match the iso-potential lines. The wall shear stress (τw) generated along the centerline of this channel at an axial distance from the entrance (x) is given by: \nimgsrc://cloudfront.jove.com/files/ftp_upload/4169/4169eq3.jpg",
    "where μ is the viscosity of the medium, Q is the volumetric flow rate, h is the channel height, w1 is the channel entrance width, and L is the total channel length. Q was chosen to generate a gradient in SS magnitude from 16 dynes/cm2 at the inlet to 0 at the stagnation point \"a\" just proximal to the outlet. B)-C) VCAM-1 expression was measured in situ by immunofluorescence microscopy using antibodies conjugated to quantum dots and presented as percentage median fluorescence intensity (MFI) of unstimulated static control. SS did not modulate the basal level of VCAM-1, which is low in unstimulated HAEC (grey triangles). However, VCAM-1 expression increased relative to TNF-α at LSS magnitudes, peaking at ~2 dynes/cm2 and returning to the TNF-α baseline or below at shear magnitudes > 5 dynes/cm2 (black squares). D) Monocytes (106/ml) were perfused at 2 dynes/cm2 for 5 min in parallel flow channels over monolayers preconditioned as in A). Monocyte recruitment to endothelium quantitatively correlated with the VCAM-1 expression at a given shear stress magnitude. Notably, the ability to probe VCAM-1 expression and monocyte recruitment with fine spatial resolution in a monolayer revealed significant changes over a narrow range in SS magnitude that would not be appreciated by applying only a few discrete values of shear in separate experiments. Data were analyzed by repeated measures ANOVA and differences assessed by Newman-Keuls posttest, *P < 0.05 from TNF-α under static conditions. Data are mean ± SEM from 3-6 independent experiments. Adapted with permission from Tsou et al.2\nimgsrc://cloudfront.jove.com/files/ftp_upload/4169/4169fig3.jpg",
    "Figure 3. Triglyceride-rich lipoproteins (TGRL) modulate cytokine-induced inflammation in proportion to donor serum triglyceride levels and VCAM-1 expression.  HAEC monolayers were stimulated with TNF-α (0.3 ng/ml) for 4 hr simultaneously with TGRL (10 mg/dl ApoB) isolated from human subjects after a high fat meal in static culture. A) VCAM-1 expression was measured separately in suspended EC by flow cytometry and monocyte adhesion quantified using a VMMC as described in the detailed protocol. Data are presented as % change from TNF-α. Monocyte arrest varied in direct proportion to endothelial VCAM-1 expression, which increased directly with the level of donor serum triglyceride. B) Monocyte arrest for a subset of pro-inflammatory donors was abrogated in the presence of a VCAM-1 blocking antibody. Significance was determined by paired Student's t-test, means ± SEM from 3-5 independent experiments. Adapted with permission from Wang et al.4Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}