{
  "id": 10008,
  "origin_website": "Jove",
  "title": "Label-Free Surface-Enhanced Raman Scattering Bioanalysis Based on Au@Carbon Dot Nanoprobes",
  "procedures": [
    "1. Fabrication of Au@CDs\nNOTE: Figure 1 illustrates a fabrication procedure for Au@CDs.\nPrepare CD solution using citric acid (CA) and gallic acid (GA) via a typical hydrothermal treatment procedure18. Add 100 µL of 3.0 mg mL-1 of the prepared CD solution into 200 µL of 10 mM chloroauric acid (HAuCl4) (see Table of Materials) at room temperature for 10 s until a purple suspension is produced.\nCentrifuge the purple suspension at 4,000 × g for 10 min at room temperature and gently remove the supernatant using a pipette if removing the Au@CD colloids is difficult.\nResuspend the Au@CDs with 200 µL of deionized water (resistivity of 18.2 MΩcm) to wash the excess CDs.\nRepeat step 1.2 and obtain the core-shell NPs, redispersed in 100 µL of deionized water, and store at 4 °C. The NPs can be stored for 1 month.\n2. Characterization of Au@CDs\nTransmission electron microscopy (TEM)\n\t\nLeave the CD and Au@CD samples overnight at -80 °C to lyophilize from a frozen solution and crush after lyophilization into powder.\nDisperse the obtained powder samples into the deionized water adequately by sonication, at 100% power, for 5 min.\nDrop a few drops of the sample suspension onto a Cu-coated TEM grid covered with a lacey carbon film, and capture images after drying using a transmission electron microscope at a 200 kV acceleration voltage (see Table of Materials).\nFourier transform infrared spectroscopy (FT-IR)\n\t\nRepeat step 2.1.1 to obtain power samples, grind a few pre-dried KBr particles into powders in a mortar, add a pinch of the sample, and mix with the KBr powders simultaneously for IR characterization16.\nUltraviolet-visible-near infrared (UV-vis-NIR) absorbance spectroscopy\n\t\nPrepare the suspension of CDs and Au@CDs with proper concentration to ensure the absorbance is less than one and perform UV-vis-NIR characterization16.\nRaman spectra",
    "Switch on the 785 nm semiconductor laser, with a laser power of 10 mW and objection magnification of 20x. Set the exposure duration to 5 s and accumulations number to three.\nAdd an equal volume of prepared Au@CDs samples into 5 µL of methylene blue (MB) solution and thoroughly mix.\nPlace a drop of suspension onto the brass substrate to collect the SERS spectra.\n3. Cell culture\nCulture human epithelial lung carcinoma cells (A549 cells, passaged in the laboratory) in Dulbecco's modified Eagle medium (DMEM) supplemented with 10% fetal bovine serum (FBS) and 1% penicillin-streptomycin and incubate in a humidified incubator at 37 °C with 5% CO2.\nSeed the cells in 96-well plates (1 × 105 cells/well) and treat with Au@CDs in different concentrations in the range of 20-100 µM. Use a CCK-8 assay kit to measure the cell viability (see Table of Materials). Three independent duplicates are used in each treatment.\nFor performing the SERS experiments, proceed following the steps below:\n\t\nPut a sterile sapphire chip (see Table of Materials) into the 12-well plates and then seed the cells onto a single well with 1 mL of medium. Incubate the plates in a humidified incubator at 37 °C with 5% CO2overnight to reach 70%-80% confluence.\nAdd the Au@CDs into the single well and incubate for 4-6 h.\n\t\tNOTE: Before incubation, test the stability of substrates, especially solution phase NPs. These materials are susceptible to degradation through dissolution, aggregation, and sedimentation processes during storage and use, which may decrease EM losses and decrease SERS activity. More significantly, for cellular uptake, it could be largely affected by the size of the NPs22.",
    "During the incubation, substrates will enter the cells through endocytic uptake. After incubation, observe the cells under an optical microscope until a few black particles are seen inside the cells.\n\t\tNOTE: If the SERS intensity is weak, try to enhance the Au@CD concentration or prolong the incubation time.\nRemove the medium, gently rinse the sapphire chips with phosphate-buffered saline (PBS), and dip them in PBS for SERS detection16.\n4. Cell SERS experiments\nOpen the computer, switch on the Raman spectrometer, start the software and then switch on the 785 nm laser (see Table of Materials).\nClick on New Measurement and start a new spectral acquisition. Calibrate17 with silicon wafers before sample measurement.\nTake a 20x objective lens to ensure a clear cellular image is observed, then change the objective lens to 50x. Set the laser power from low to high and the appropriate exposure time and accumulations.\n\tNOTE: Before SERS measurement, check the appropriate laser power to prevent irreversible cell damage and ensure that the acquisition parameters are consistent. SERS intensity is related to laser power, spot size, accumulation, and exposure time.\nChoose a point of cells to measure and click on Run. Each cell is measured by 20 spots, and 10 cells are measured to take the average.\n\tNOTE: Intracellular components are complicated, leading to wide spectra disparity. Therefore, take spectra in similar cellular regions and take as many spectra as possible.\nSave the spectra.\nClick on New Streamline image acquisition, then click on Video Review, select the range to be photographed, and click OK. Set the parameters: 785 nm edge streamline, centre of 1,200 cm-1, exposure duration of 5 s, accumulations number of three, and laser power to 50%.",
    "Click on New of Living imaging, choose Signal to Baseline, set the range from first limit 625 to second limit 1,700, and then click on Area setup. Then set the proper steps, and click on Apply and OK. Finally, click Run to start performing SERS imaging.\n5. Bacterial culture and SERS measurements\nDilute overnight cultures of E. coli and S. aureus (1:100) in 5 mL of the new Luria-Bertani (LB) medium (see Table of Materials). After growth at 37 °C to A600 0.4 to 0.6, centrifuge the culture at 5,000 × g for 5 min to pellet the cells.\nResuspend the pellets in 1 mL of PBS followed by a 5 min 5,000 × g centrifugation (at room temperature) twice.\nMix the bacterial culture with the Au@CDs and observe the mixture directly under the SERS platform.\n6. Data analysis\nSmooth the spectra and correct the baseline.\nPerform principal component analysis (PCA)16 with the processed data.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}