{
  "id": 10429,
  "origin_website": "Jove",
  "title": "Labeling of Blood Vessels in the Teleost Brain and Pituitary Using Cardiac Perfusion with a DiI-fixative",
  "procedures": [
    "All animal handling was performed according to the recommendations for the care and welfare of research animals at the Norwegian University of Life Sciences, and under the supervision of authorized investigators.\n1. Preparation of Instruments and Solutions\nPrepare DiI stock solution dissolving 5 mg of DiI crystal in 1.5 mL plastic tube with 1 mL of 96 % EtOH. Vortex for 30 s and keep covered using aluminum foil.\nNOTE: The DiI stock solution can be conserved in the dark at -20 °C for several months.\nPrepare the fish holder (Figure 1A) by cutting a piece of polystyrene to 5 cm length, 3 cm width, and 2 cm thickness, and gluing it to a 9 cm-diameter plastic dish. Make a 3 cm boat-shaped hole with a scalpel blade in the polystyrene.\nPrepare the perfusing system (Figure 2) by adding a 30-50 cm long plastic cannula at the extremity of the needle.\nPrepare 40 mL of fresh 4% paraformaldehyde solution (PFA) by diluting 10 mL of 16% PFA with 30 mL of phosphate buffered saline solution (PBS) in a 50 mL plastic tube.\nPrepare 10 mL of fixative/DiI solution by diluting 1 mL of DiI stock solution in 9 mL of freshly prepared 4% PFA in a 10 mL plastic tube. Keep in the dark until use.\nNOTE: The DiI crystals that are not dissolved can be kept in the stock solution tube, and new ethanol can be added to prepare new DiI stock solution (see step 1.1).\nPrepare 50 mL of tricaine (MS-222) stock.\nDissolve 200 mg of Tricaine powder in 48 mL of H2O. Add 2 mL of 1 M Tris base (pH 9). Adjust to pH 7 with 1 M HCl and store at -20 °C.",
    "Dilute 5 mL of Tricaine stock in 50 mL of clean water in a small glass.\nPrepare several 5 cm glass pipettes (Figure 2) by stretching a glass capillary with a pipette puller following the manufacturer's instructions.\n2. Dissection and Perfusion\nNOTE: PFA is a toxic volatile compound, therefore the dissection and perfusion should be performed in a hood or in a ventilated room, and the user must be wearing a gas mask.\nPrepare the dissection tools including small scissors, and one sharp and one strong forceps before dissection.\nFill the syringe with the prepared solution of PFA/DiI by placing it in the 50 mL tube and drawing up. Then place the needle with the cannula at the extremity of the syringe (Figure 2).\nFix the syringe to the bench using several pieces of tape placed in different directions, adjust the position of the microscope and the seat to obtain a good position for dissection and for pressing the syringe piston (Figure 1B).\nNOTE: In this protocol, the elbow is used to press down the syringe piston, but other possibilities options may be used, e.g., assistance from another person.\nEuthanize the fish with an overdose of tricaine by placing the fish in the solution prepared in step 1.7. Wait 30 s and test the reflexes of the fish by grabbing its caudal fin with the forceps. The fish can be used when it has stopped responding to the stimuli.\nPlace the fish in the fish holder with its abdomen facing up and pin one needle into the extremity of the head and another one above the tail to keep the fish in place.\nOpen the anterior abdomen with the scissors by horizontally cutting the superficial layer of skin.",
    "Using forceps, remove the skin above the heart until a clear access to the ventricle and the bulbus arteriosus is provided (Figure 3).\nAdd a glass pipette at the extremity of the capillary and break the end of the tip of the glass pipette.\nNOTE: The hole of the broken tip should be big enough to let the liquid out, but still small enough to easily enter the tissue. The glass pipette can be reused if not broken or clogged.\nBring the glass pipette close to the ventricle and add pressure to the syringe piston with the elbow to force the liquid out.\nPin the heart ventricle with the glass pipette while adding pressure to the syringe.\nDirectly after, perforate the sinus venosus with forceps to enable blood to leave the circulation.\nNOTE: The heart ventricle becomes more fragile because of the fixative. It also becomes less red as the blood is diluted with the fixative/DiI solution.\nFrom the ventricle, adjust the angle of the glass pipette to find the entrance of the bulbus arteriosus. Bring the pipette opening inside the bulbus arteriosus as shown in Figure 2, and add more pressure to the syringe.\nNOTE: The bulbus arteriosus is transparent and the tissue is elastic. When replacing blood with DiI/fixative, the glass pipette inside the heart should become more visible and by adding pressure, the size of the bulbus arteriosus should expand. This step is crucial to make sure that enough pressure has been used to replace all the blood with the fixative/DiI solution, and that all blood vessels have been reached. Often when successful, the PFA provokes muscle contractions and the fish will be moving.\nContinue adding pressure on the syringe for 30-60 s still keeping the glass pipette inside the bulbus arteriosus.",
    "Remove the glass pipette and the needles from the fish.\nDissect the brain and the pituitary, and incubate tissues in fresh 4% PFA in PBS for 2 h in the dark at room temperature.\nNOTE: Dissection of brain and pituitary previously has been described in detail in two different ways by Fontaine et al.26 and Ager-Wick et al.27. Because of the fixation, the tissue becomes quite hard and the fragile link between the brain and the pituitary may be broken. After dissection, post fixation processing can also be performed overnight at 4 °C.\nRinse the tissue twice in PBS for 10 min before preparing for imaging.\nNOTE: The tissue can then be mounted between slide and cover slip with spacers in between and mounting medium for confocal imaging (see Figure 4), or sectioned with a vibratome as described in detail in Fontaine et al.26 before mounting between slide and cover slip for imaging with a stereomicroscope (see Figure 4).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}