{
  "id": 6844,
  "origin_website": "Bio",
  "title": "Bacterial Lawn Avoidance and Bacterial Two Choice  Preference Assays in <em>Caenorhabditis elegans</em>",
  "procedures": [
    "P. aeruginosa Lawn Avoidance AssayDay 1Synchronization of C. elegansThe assays are described for conditions where a gene is knocked down by RNAi (see Notes for details and assays with mutants). Transfer gravid adult N2 animals from E. coli OP50 plates to control RNAi plates (15-20 animals per RNAi plate), as well as RNAi plates for any gene of interest. Use one RNAi plate for each gene knockdown.Incubate the plates at room temperature (22 °C) for 2 h.Remove the gravid adults from the RNAi plates and incubate the plates at 20 °C for 72 h to obtain synchronized adult animals.Day 2Take out a vial of frozen P. aeruginosa PA14 from -80 °C and immediately streak on an LB agar plate. Incubate the plate at 37 °C for 12-14 h.Day 3Pick a single colony of P. aeruginosa PA14, inoculate in 2 ml of LB in a 14 ml polypropylene round-bottom tube, place vertically on a shaker, and grow it for 10-12 h at 250 rpm and 37 °C.Place 20 µl of inoculum on the center of 35 mm SK plates (Figure 1A) that are modified NGM (3.5% instead of 2.5% peptone) plates. Let the inoculum dry at room temperature (20-30 min). Invert the plates upside down (to prevent cracks in agar from drying out) and incubate at 37 °C for 12 h.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200513/20200513021559_4233.jpgFigure 1. Schematic representation of plates. A. Avoidance assay plates contain a spot of pathogenic bacteria in the center. B. The two-choice preference assay plates contain spots of the two types of bacteria placed diagonally opposite. The cross (×) in the center of the two-choice preference assay plate indicates the site of the transfer of C. elegans. C. The surface of a training plate is fully covered with the pathogenic bacteria.Day 4Cool the P.",
    "aeruginosa plates from 37 °C to room temperature for 30 min.Transfer 30 synchronized adult animals just outside P. aeruginosa lawn on SK plates. Use three P. aeruginosa plates per C. elegans strain/condition. Scrape off the residual E. coli from outside P. aeruginosa lawns on SK plates using platinum wire worm pick.Incubate the plates with animals at 25 °C.At various times of incubation (2, 4, 8, 12, and 24 h or as required), count the number of animals that are inside the lawn, outside the lawn, and have crawled on the sidewalls of plates.Naïve Two Choice Preference AssayDay 1Synchronize C. elegans as described for lawn avoidance assay (Procedure A, Day 1) and incubate at 20 °C for 72 h.Day 2Take out a vial of frozen P. aeruginosa PA14 from -80 °C and immediately streak on an LB agar plate. Incubate the plate at 37 °C for 12-14 h.Streak RNAi bacteria (E. coli HT115) from -80 °C on LB agar plates containing 100 µg/ml ampicillin. Incubate the plate at 37 °C for 12-14 h.Day 3Pick a single colony of P. aeruginosa PA14, inoculate in 2 ml of LB in a 14 ml polypropylene round-bottom tube, place vertically on a shaker, and grow it for 10-12 h at 250 rpm and 37 °C.Pick a single colony of RNAi bacteria (E. coli HT115), inoculate in 10 ml of LB with 100 µg/ml ampicillin in a 15 ml tube, place horizontally on a shaker, and grow it for 10-12 h on at 250 rpm and 37 °C.After growth, concentrate RNAi bacteria 10-20 fold by centrifuging at 5,000 rpm for 5 min at room temperature.Place 20 µl of each inoculum diagonally opposite onto 35 mm SK plates (Figure 1B). Let the inoculum dry at room temperature (20-30 min).",
    "Invert the plates upside down and incubate at 37 °C for 12 h.Day 4  Cool the two-choice preference assay plates from 37 °C to room temperature for 30 min.Transfer 30 synchronized adult animals to the centers of two-choice preference plates equidistant from both the lawns (Figure 1B). Use 3 two-choice preference assay plates per C. elegans strain/condition.Scrape off residual E. coli from the center of the two-choice preference assay plates using a worm pick (as described in Procedure A, Day 4).Incubate the plates with animals at 25 °C.At various times of incubation (2, 4, 8, 12, and 24 h or as required), count the number of animals that are on the E. coli lawn, P. aeruginosa lawn, outside the lawns, and have crawled on the sidewalls of plates. Trained Two Choice Preference AssayDay 1Synchronize C. elegans as described for lawn avoidance assay (Procedure A, Day 1) and incubate at 20 °C for 54 h.Take out a vial of frozen P. aeruginosa PA14 from -80 °C and immediately streak on an LB agar plate. Incubate the plate at 37 °C for 12-14 h.Day 2Pick a single colony of P. aeruginosa PA14, inoculate in 2 ml of LB in a 14 ml polypropylene round-bottom tube, place vertically on a shaker, and grow it for 10-12 h at 250 rpm and 37 °C. Store the P. aeruginosa plate at 4 °C.Place 20 µl of inoculum on 35 mm SK plates and spread it on the entire surface of the plates to obtain full lawns of P. aeruginosa (Figure 1C). Invert the plates upside down and incubate at 37 °C for 12 h.Streak RNAi bacteria (E. coli HT115) from -80 °C on LB agar plates containing 100 µg/ml ampicillin. Incubate the plate at 37 °C for 12-14 h.",
    "Day 3Pick a single colony of P. aeruginosa from the plate stored at 4 °C on Day 2, inoculate in 2 ml of LB in a 14 ml polypropylene round-bottom tube, place vertically on a shaker, and grow it for 10-12 h at 250 rpm and 37 °C.Pick a single colony of RNAi bacteria (E. coli HT115), inoculate in 10 ml of LB with 100 µg/ml ampicillin in a 15 ml tube, place horizontally on a shaker, and grow it for 10-12 h on at 250 rpm and 37 °C.Cool the full lawn P. aeruginosa plates from 37 °C to room temperature for at least 30 min.Transfer 54 h old synchronized C. elegans grown at 20 °C (from Day 1) to full lawns of P. aeruginosa, and incubate at 25 °C for 18 h. This will constitute the trained group of animals.For control naïve animals, maintain the animals on their corresponding RNAi plates and incubate at 25 °C for 18 h along with the training groups.Prepare two-choice preference plates (Figure 1B) as described above in naïve two-choice preference assay (Procedure B, Day 3). Invert the plates upside down and incubate at 37 °C for 12 h.Day 4 Cool the two-choice preference assay plates from 37 °C to room temperature for 30 min.Transfer 30 synchronized adult animals from the full lawn P. aeruginosa plates to the center of a two-choice preference assay plate equidistant from both the lawns. Use 3 two-choice preference assay plates per C. elegans strain/condition. This will be the trained group of animals.Likewise, transfer 30 synchronized adult animals from RNAi plates to the center of a two-choice preference assay plate equidistant from both the lawns. Use 3 two-choice preference assay plates per C. elegans strain/condition. This will be the control group of naïve animals.",
    "Scrape off the residual bacteria from the centers of two-choice preference assay plates using a worm pick (as described in Procedure A, Day 4).Incubate the plates with animals at 25 °C.After 1 h of incubation, count the number of animals that are on the E. coli lawn, P. aeruginosa lawn, outside the lawns, and have crawled on the sidewalls of plates."
  ],
  "subjectAreas": [
    "Microbiology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}