{
  "id": 12332,
  "origin_website": "Jove",
  "title": "Large-Scale Gravitaxis Assay of Caenorhabditis Dauer Larvae",
  "procedures": [
    "The strains used in the present study are C. elegans (N2) and C. briggsae (AF16) (see Table of Materials). A mixed-sex population of dauers was used for each assay.\n1. Chamber preparation\nWork in a fume hood. Set up the workspace with a Bunsen burner, 1-2 razorblades, pliers, tweezers, and a plastic cutting surface (see Table of Materials).\nFor each chamber, gather two 5 mL serological pipettes. Remove the cotton plug from one pipette with tweezers. Hold a razorblade over the Bunsen burner until hot using pliers. Use the heated blade to slice off the tapered end of the second pipette so that the entire pipette has a uniform diameter (Figure 1A).\nWorking quickly, bring the two modified pipette ends close to the flame, melting them slightly. Join these ends by pressing them firmly together, ensuring that the walls of both pipettes are continuous. If any gaps are visible after joining, break them apart and repeat this step (Figure 1A,B).\n2. Filling the chambers with agar\nPrepare NGM with 4% agar according to standard worm procedures21. While the agar is still molten, fill each chamber by attaching it to a serological pipettor and slowly drawing up the solution. Seal the tip with paraffin film before removing the chamber from the pipettor. Lay the chamber flat (parallel to the benchtop) to cool.\n\t​NOTE: Covering the flask with cling-wrap (see Table of Materials) after autoclaving helps prevent bubbles from forming in the solution18.\n\t\nTo minimize any variations in the consistency of the agar due to uneven cooling, hold the pipettor (see Table of Materials) parallel to the benchtop while drawing up the agar. Lay the chambers flat on the benchtop and allow the agar to harden before moving.",
    "NOTE: The agar percentage and media content can be tailored to the experiment. 4% agar is stiffer than the roughly 2% concentration used for plate pouring and prevents worms from burrowing through the medium in our hands. However, other experimenters have observed burrowing behavior by adult worms in up to 9% agar18,19.\nOnce cooled, heat a 3 mm hex key (or another metal tool of the same size, see Table of Materials) over a Bunsen burner. Firmly press it into the wall of each chamber about 5 mm to one side of the midline, creating a small opening in the plastic (Figure 1C). Use a heated blade to remove the cotton and tapered ends of the chamber and seal these ends with paraffin film.\n\t​NOTE: Once prepared, each chamber must be used within 1 day or kept at 4 °C for several days. Cover any exposed openings with paraffin film to prevent the agar from drying out.\n3. Isolating dauer larvae\n10-15 days prior to the experiment, chunk each strain onto 2-3 large NGM plates with OP50 bacteria and wrap with paraffin film. After 10-15 days, each plate must be fully starved with thousands of dauer larva present on the agar, walls, and lids.\n\tNOTE: Make plates ahead of time using a thick OP50 recipe for maximum crowding (see Table of Materials). Dauer formation can also be induced through other methods, including the addition of pheromones or by growing at higher temperatures22.\nCollect worms by rinsing the lids and plates with M9 buffer and pipetting the solution into 15 mL centrifuge tubes. Spin at 1,600 x g for 30-60 s at room temperature and aspirate most of the M9 buffer with a pipette or vacuum aspirator.",
    "Isolate dauers by treating with 1% SDS followed by a 30% sucrose flotation gradient following the previously published report20.\n\t\nAdd 7 mL 1% SDS solution to each worm pellet. Leave the worms in SDS for 30 min; rotate the tubes continuously during this time to allow for aeration. Rinse 3-5x with M9 to remove the detergent.\nNext, add 5 mL M9 followed by 5 mL of cold, filtered 60% sucrose solution. Mix thoroughly, and then centrifuge at 1,600 x g for 5 min at room temperature to create a separation gradient.\nFill new 15 mL centrifuge tubes with 2 mL of M9 buffer. Crush the ends of glass Pasteur pipettes to widen the bore and use these pipettes to transfer the top layer of the solution (containing isolated dauers) from the sucrose gradient to the new tubes. Rinse the dauers 3-5x with M9.\n\t​NOTE: There will be thousands of isolated dauers in solution at this point. They may be used immediately or kept aerated by rotating in 5-7 mL M9 overnight.\n4. Adding dauers to the chamber\nCentrifuge dauers at 1,600 x g for 5 min at room temperature and aspirate most of the M9 solution with a pipette or vacuum aspirator. To estimate worm density, manually count the number of worms in three separate 1 µL droplets under a dissecting microscope. Use the average of these counts to approximate the number of worms per µL.\n\tNOTE: Some small volume pipettors may be unable to reach the bottom of a 15 mL centrifuge tube; in this case, a concentrated droplet of worms can be transferred first to a piece of paraffin film.",
    "Cut the end of a 10, 20, or 200 µL pipette tip to widen the bore. Set the micropipette to a slightly larger volume than the intended aspiration volume. Aspirate approximately 1-2 µL of the concentrated worm solution (ideally between 100-300 worms) and allow a small amount of air to enter the tip.\n\tNOTE: Large numbers of worms (1,000+) in one chamber may increase the range of distances traveled due to overcrowding9.\nGently push the pipette tip into the agar while depressing the micropipette. This will create an injection site in the agar without clogging the tip. Release the worms into the agar. Use paraffin film to seal the opening.\n5. Running and scoring the assay\nNOTE: Gravitaxis can be tested under various conditions that may affect behavior9.\nTo eliminate as many variables as possible, place the chambers within a dark Faraday cage (see Table of Materials) at room temperature.\nLabel each chamber and hang it vertically within the Faraday cage (perform this using labeling tape). Test horizontal controls concurrently by laying some chambers flat within the same environmental conditions. Test the experimental strains against vertically oriented N2 worms as a positive control. Use horizontally oriented chambers containing N2 dauers as an additional negative control.\n\tNOTE: Horizontal and vertical assays must be performed in the same setting within the lab to minimize environmental variability between the two conditions. A large incubator may be used to house both Faraday cages.\nDauers begin to disperse from the start site after a few hours and take several hours to reach either end of the chamber. Leave the chambers undisturbed during this time and score within 12-24 h following injection.",
    "NOTE: Do not use a paralytic (such as sodium azide) to immobilize worms that have reached the ends of the chambers. Because the overall distribution of worms is being measured instead of a preference index (as in a two-choice assay), sodium azide is unnecessary and may alter the results.\nRemove and score gravitaxis chambers one at a time. Look for live dauers under a dissecting microscope and mark their locations in ink (Figure 1C,D). Do not score worms within 2.5 cm to either side of the injection site, as these worms are not likely to be demonstrating a directional preference.\n\t\nAlso, avoid scoring worms that appear dead or are trapped in the liquid. Discard any chambers containing >50% dead or swimming worms.\n\t\tNOTE: Once the chamber has been removed from the testing area, it needs to be scored promptly for accuracy. Dauers must only be visible between the agar's surface and the pipette's wall. If burrowing behavior is observed, consider increasing agar concentration in future assays.\nTo quantify the results, use a marker to divide each half of the chamber into seven 3.5 cm sections starting 2.5 cm away from the injection site (on some pipettes, 3.5 cm = 1 mL volume). Use a manual tally counter (see Table of Materials) to tally the number of worms observed in each section.\n\tNOTE: There should be seven sections on each side of the origin, which can be numbered from -7 (bottom) to +7 (top). These numbers must correspond to the same relative locations based on how the chambers were constructed; agar is drawn from the -7 end to the +7 end in step 2.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}