{
  "id": 7066,
  "origin_website": "Bio",
  "title": "Isolation of Extracellular Vesicles Derived from Mesenchymal Stromal Cells by Ultracentrifugation",
  "procedures": [
    "Mesenchymal stem cell preparationBone marrow-MSCs (BM-MSCs) were isolated from femurs of Lewis and Fisher rats (200 g). In brief, the bone shaft was extracted inserting a 22 G needle and flushed out with alpha-MEM supplemented with 10% FBS and 2 mM EDTA and cell clumps desegregated. The cell suspension was centrifuged at 400 x g for 20 min at room temperature. Rat BM-MSCs were seeded and expanded in alpha-MEM supplemented with 10% FBS (Ramírez-Bajo et al., 2020a). Therefore, BM-MSCs were characterized according to standardized criteria defined by International Society for Cellular Therapy (ISCT) (see Note 1; Figure 1).Culture MSCs in T75 cm2 flask using 7 ml of complete alpha-MEM medium. Trypsinization is performed at approximately 80% confluence.Wash cell culture with pre-warmed PBS, add 3 ml trypsin and incubate at 37 °C for 4 min.Stop the reaction with 9 ml of complete medium and spin down at 600 x g for 5 min at room temperature to count cells and check viability of culture.Count MSC’s number and their viability with an automated cell counter following manufacturer’s instructions (see Note 2).Plate the cells at a density of 5 x 105 cells in a flasks T150 cm2 with 15 ml of complete alpha-MEM medium.Incubate at 37 °C in 5% CO2 environment.Replace with fresh complete alpha-MEM medium (pre-warmed to 37 °C) every two days thereafter.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3860/bioprotoc-10-24-3860-g001.jpgFigure 1. Representative images of MSCs characterization by flow cytometry and multi-lineage differentiation potential. A. Flow cytometry analysis of MSC. Cells were positive for surface stem cell markers (CD44, CD29 and CD90), and negatives for endothelial (CD31), and hematopoietic (CD45) markers. B. Adipogenic differentiation (x200 magnification) as demonstrated showing positivity for oil red staining. C. Osteogenic differentiation (x100 magnification) as demonstrated showing positivity for alkaline phosphatase activity, and was revealed by SigmaFast BCIP/NBT chromogen staining.",
    "EVs isolation by ultracentrifugationWhen the cells are approximately 80% confluence, aspirate the supernatant and add 6 ml of PBS (pre-warmed to 37 °C) to wash the residual FBS. Repeat washing step one more time.Replace PBS with 15 ml of RPMI1640 deprived of FBS (pre-warmed to 37 °C) and incubate for 16 h.Harvest the MSC conditioned serum free medium and transfer to 50 ml conical tube and keep at 4 °C.Trypsinize MSCs and determine cell number and viability in an automated cell counter following manufacturer’s instructions (repeat Steps A1-A3).Our estimation at time of collection was ± 1.5 x 106 MSCs and ± 95% of live cells.Centrifuge MSC conditioned serum free medium at 3,000 x g for 20 min at 4 °C and micro filtrate with 0.22 μm pore filter membranes to remove cell debris and apoptotic bodies.Transfer cell-free supernatants into a 38.5 ml capacity open-top thin wall ultra-clear tube. Balance opposite tubes within 10 mg of each other (see Notes 3-4).Ultracentrifuge at 100,000 x g for 1 h, 4 °C, using SW32 Ti rotor.Carefully remove tubes from the rotor.Remove supernatant by aspiring carefully with a Pasteur pipette.Resuspend EVs pellets with a 200 µl of freezing medium and froze them at -80 °C for later use (see Notes 5-6).EVs characterizationSee Note 7.EVs quantification:Nanosight Tracking Analysis (NTA) Particle size distribution and concentration measurement:Take 1 ml of EVs solution (dilution factor 1:40 in PBS 0.1 µm filtered) and vortex.With a syringe without needle, inject EVs solution slowly (avoiding bubbles) into the chamber of particle size analyzer for visualization. It is important to have approximately 20-60 particles in the field of view, to obtain an accurate concentration and size values (Video 1).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. EVs moving under Brownian motion recorded by NTA.",
    "This video visualizes the expected Brownian motion of the EVs in liquid suspension illuminated by a laser light source. The EVs size distribution and concentration are measured using the combination of the light scattering properties with Brownian motion. The real time monitoring helps to determine changes in the characteristics of vesicle populations.Take triplicate readings during 60 s at 30 frames per second (fps), camera level at 16 and manual monitoring of temperature. Figure 2A shows representative results obtained by NanoSight from EVs produced by MSCs.Protein quantification:Determination of protein concentration (A280nm) was checked by NanoDrop using 2 µl of EVs solution following the manufacturer's instructions.Assessment of absence of contaminants by Electron MicroscopyUse a holey carbon support film on a 400-mesh copper grid. Glow discharge the grid and place 3 µl of the EVs sample (from Step B10) on a plunger (Leica EM GP) and blot it with Whatman No. 1 filter paper.Vitrify the suspension by rapid immersion in liquid ethane (-179 °C) and mount the grid on a Gatan 626 cryo-transfer system and insert it into the microscope.Take images using cryo-electron microscope operates at 200 kV, record on a GatanUltrascan US1000 CCD camera and analyze with a Digital Micrograph 1.8 (n = 3 per group) (Figures 2B-2C).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3860/bioprotoc-10-24-3860-g002.jpgFigure 2. Characterization of EVs by electron microscopy and Nanoparticle Tracking Analysis (NTA). A. NTA measurement shows the concentration and size distribution. The mean EVs size was 201.9 ± 101.4 nm. B-C. Representative cryo-electron microscopy images of EVs (scale bars 0.5 and 0.2 µm, respectively). Cryo-electron microscopy allows to visualize the grid with an irregular distribution of hole sizes and shapes, and inside of them EVs of various sizes with lipid bilayers. The white arrow points a vesicle with a double membrane (white arrow). Most vesicles have an intact membrane and a round shape.",
    "Some vesicles are single, double and multilayer, in the case that contains inside another smaller or two and more (black, blue and red arrow, respectively)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}