{
  "id": 4280,
  "origin_website": "Bio",
  "title": "Monoclonal Antibody Purification (<em>Nicotiana benthamiana</em> Plants)",
  "procedures": [
    "Transform electrocompetent agrobacteria cells with plant-expressing viral vector DNA plasmid containing the sequence for the mAb of interest at 2,000 V for 5 msec.After shaking transformed cells for 1 h at 28 °C to establish antibiotic resistance, streak cells on LB agar plates (containing 30 μg/ml Rifampicin, 50 μg/ml Gentamicin and 50 μg/ml Kanamycin) and grow in 28 °C incubator for 3 - 4 days.Pick a single transformed bacterial colony and grow in 5 ml of YenB media plus 30 μg/ml Rifampicin and 50 μg/ml Kanamycin at 28 °C and 225 rpm overnight.Transfer 5 ml starter culture to large flask containing 95 ml fresh YenB media plus the same antibiotics and grow at 28 °C and 225 rpm overnight.Measure the optical density at 600 nM using UV/Vis Spectrophotometer using YenB media as a blank. Calculate the volume of the large culture required for a final OD600 equal to 0.03 in the total volume of infiltration buffer needed (1.6 L).Centrifuge calculated volume of bacterial culture at 5,000 x g, room temperature for 15-30 min. Re-suspend the pelleted bacteria in any volume of infiltration buffer and dilute to final volume of 1.6 L.Note: For example, if measure OD600 is 1.25 then the following calculation would be made (1.25) x = (0.03) (1.6 L) x = 38.4 ml of bacterial culture would need to centrifuged then re-suspended in infiltration buffer.Transfer the re-suspended bacteria to vacuum apparatus and fill to final volume. Apply 25 inches Hg of pressure to all the leaves of an entire N. benthamiana plant (between 26-30 days old) for 2 min then release the vacuum causing the bacterial inoculum to enter the leaves (Figure 1). The same infiltration buffer can be re-used for up to approximately 16 plants without any noticeable depreciation in inoculation.",
    "Note: Efforts should be made to keep plant soil from entering infiltration buffer but it will not interfere with successfully infecting plants.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140113/20140113052252_8990.jpgFigure 1. Vacuum Infiltration. The mAb vector is delivered via A. tumefaciens into N. benthamiana leaves using vacuum infiltration (see above, procedure step 7).Plants are grown post-infiltration the same as before infiltration, at 27 °C and > 50% humidity following a 16 h daytime/8 h nighttime schedule. Water the plants every other day.At 7 days post infiltration (dpi), harvest the infected leaves expressing mAb by cutting the leaves at the base of the stem and measure the total mass. Inoculated leaves are distinguishable by the mosaic phenotype displayed after 4-5 days post infiltration compared to non-inoculated leaves.mAb is extracted in cold extraction buffer by using an industrial blender while mixing 2 ml buffer for every 1 g leaf tissue.Note: For the remaining duration of the procedure, all efforts are made to ensure the mAb remains at 4 °C including extraction and purification.The leaf extract is centrifuged at 15,000 x g for 10 min at 4 °C to pellet plant debris.The partially clarified extract is pH adjusted to 7.0 using sodium hydroxide and centrifuged at 15,000 x g for 10 min at 4 °C to pellet starches and small plant debris. The final step of extraction requires the clarified extract to be passed through a 0.2 µm bottle top filter using a vacuum. mAb is purified initially by using a HiTrap Protein A HP column from GE Healthcare via FPLC on an AKTA purifier. The column is equilibrated with 10 column volume (CV) of Protein A Equilibration/Wash buffer.mAb clarified extract is loaded at 2 ml/min. After the extract has been loaded to the column, unbound proteins are washed out of the column using Protein A Equilibration/Wash buffer (10 CV).",
    "Protein A Elution buffer is used to elute mAb from the Protein A column using a step gradient to 100% Protein A Elution buffer for 10 CV. The pH is adjusted from 3.0 to 7.0 using 1 M Tris buffer (pH 8.0) for the fractions containing mAb.Note: A step gradient is programmed into the method run so that the AKTA purifier transitions from 0% elution buffer to 100% elution buffer in a single step.Following Protein A purification, a HiTrap Phenyl HP column from GE Healthcare is utilized. The column is equilibrated with 10 CV in Phenyl HP Equilibration/Wash buffer.Protein A eluted mAb is diluted 1:10 in Phenyl HP Equilibration/Wash buffer and loaded at 2 ml/min. Unbound protein is washed off of the column using 10 CV Phenyl HP Equilibration/Wash buffer.Phenyl HP Elution buffer is used to elute mAb from the column using a linear gradient from 0% Phenyl HP Elution buffer to 100% Phenyl HP Elution buffer over 30 CV followed by an additional 5 CV at 100% Phenyl HP Elution buffer.Note: A linear gradient is programmed into the method run so that the AKTA purifier controls the incremental transition from 0% elution buffer to 100% elution buffer for which the entire length of elution is 30 CV.Purified mAb is formulated into dulbecco’s phosphate buffered saline (DPBS) pH 7.2. Purity is analyzed by densitometry of an overloaded Coomassie-stained sodium dodecyl sulfate polyacrylamide gel electrophoresis (SDS-PAGE) under reducing and non-reducing conditions.Activity is determined by antigen capture enzyme-linked immunosorbent assay (ELISA), surface plasmon resonance and in vitro virus neutralization assays."
  ],
  "subjectAreas": [
    "Immunology",
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}