{
  "id": 19417,
  "origin_website": "Jove",
  "title": "Magnetic Resonance-Guided Stereotaxy for Infusions to the Pig Brain",
  "procedures": [
    "The study was approved by the Institutional Animal Care and Use Committee at Houston Methodist Research Institute, IACUC approval number IS00006378. All experimental methods were performed in accordance with the relevant national and institutional guidelines and regulations.\n1. Animal positioning\nPosition the subject for optimal access to the top of the skull: place the subject on the MRI table in preparation for the MRI scan.\n\tNOTE: Subject information: domestic swine, female, 25 kg, 14 weeks of age.\n\t\nSedate the subject with ketamine (600 mg intramuscularly [IM]) and midazolam (5 mg IM). Administer the analgesics hydromorphone (4 mg IM), carprofen (100 mg per os), and fentanyl (25 µg topical), the antibiotic ceftriaxone (550 mg intravenously [IV]), and NaCl (0.9% IV).\nIntubate the subject. Maintain anesthesia with 2%-3% isoflurane.\nMonitor the subject's vital signs throughout the procedure.\n\t\nMechanically ventilate at 16-19 respirations/min with a ventilator.\nPlace the subject on the MRI table in preparation for the MRI scans.\nPlace the subject in a prone position with the head facing the MRI bore.\nPlace a standard MRI four channel flex coil on the head holder.\nStabilize the subject's head with the head holder.\nRaise the torso with towels and foam pads. The goal is for the head to fall slightly downward, with the neck flexed and the snout nearly touching the table. This will help to ensure that the stereotactic frame and infusion cannula fit within the bore of the MRI scanner. Anchor the MRI head holder pins on the bilateral zygoma to keep the head affixed to the MRI table.\nCheck that the top of the skull is inclined toward the back of the scanner with the neck flexed. This position enables the surgeon to have access to the top of the scalp when the subject enters the MRI.",
    "Once set, the MRI table is moved into the bore of the scanner until the subject's head reaches the end of the bore.\n2. Planning surgical insertion with MRI-assisted visualization guidance\nPrepare the area in a sterile fashion, taking care to avoid the prepared material from getting into the subject's eyes. Place sterile towels around the surgical area. Place a sterile drape with an opening toward the top of the skull that the surgeon can access.\nPlace the fiducial planning grid on the subject's scalp by affixing the adhesive side of the grid over the patient's head, centered around the location of where the burr hole will be.\nPeel off the top fluid-filled layer of the grid while firmly holding the lower layer in position.\nPerform the MRI scout scan with the grid set in place. The scan often requires intravenous MR contrast agent administration to visualize the vasculature: use a 1 mmol/mL concentration of the contrast agent gadolinium contrast agent for an infusion volume of 2.5 mL.\n\tNOTE: The scout scan is a preliminary image taken before the definitive imaging study. The purpose is for the surgeon to ensure that imaging is carried out close to the region of interest, and to define imaging boundaries. The recommended dose at the 1 mmol/mL concentration, as per the manufacturer, for the contrast agent is 0.1 mL per kilogram that the animal weighs.\nSelect the precise brain location for cannula insertion in the MR-guidance software.\nEnsure the software allows the visualization of the surgeon's planned trajectory for cannula placement, based on the target selected. Ensure the software outputs the trajectory visualization and the corresponding entry point.",
    "NOTE: For this study, a site in the frontal cortex was selected to target white matter. This is a location where many human gliomas arise and grow22. It is also a preferential site for dissemination along white matter tracts23.\n\tNOTE: Consider the surgeon's decision for an entry point, target, and desired trajectory to minimize pial and sulcal transgressions and avoid blood vessels.\nAdjust the suggested trajectory, including the desired entry and target points, by manually dragging the projected entry and target points in the software to avoid blood vessels and minimize pial and sulcal transgressions. The trajectory can be changed and viewed in three dimensions.\nOnce the desired trajectory is identified based on the surgeon's preference, run the MR-guidance software to find the entry point on the grid.\n\t\nScroll through the planned trajectory on the scan to find the entry point on the scalp. The software specifies the grid coordinates based on the projection of the planned trajectory on the grid.\n3. Securing the stereotactic frame and adjusting the alignment iteratively through software projection\nAssemble the stereotactic frame around the desired entry point coordinates on the grid by first securing the base with six bone-anchored screws and four offset screws.\nSecure the six bone-anchored screws to the skull over the grid, through the scalp. The six anchor screws are used to stabilize the stereotactic frame and avoid any movement during drilling.\nSecure the four offset screws located at the base of the tower through the skin, anchored on the skull. They act as a counter force to tighten the center bone screws, by lifting the frame base to the center screws, and to stabilize the base.\nOnce the stereotactic frame base is secure, continue with frame assembly.",
    "Perform the high-resolution T1-weighted MPRAGE MRI scan, an option in the MRI software, with the frame set in place to capture the frame fiducials and confirm the trajectory.\nConfirm the desired projected cannula insertion trajectory with the software, visualizing the MRI scan and planned trajectory.\n\t\nSubsequent 2D turbo spin echo MRI scans are taken to confirm alignment of the frame with the subject once the frame is in place. If there is a misalignment between the current frame position and the desired trajectory, the software outputs adjustment parameters.\n\t\tNOTE: The software calculates the radial difference between the projection of the current position of the stereotactic frame and the defined target point. This error is used to calculate the projected error, which is in turn used to calculate the required adjustments to the frame to minimize it.\nPerform the pitch-roll and X-Y adjustments by turning the thumb wheels, as indicated by the output adjustment parameters in the software.\nRepeat the software-enabled MRI visualization of the trajectory and perform rotational and translational adjustments (using the thumb wheels) of the targeting cannula as necessary.\nUsing the MR-guidance software, measure the thickness of the skull at the desired trajectory and the total distance to the brain.\n\t​NOTE: The software calculates the distance from the top of the frame (screwed to the skull) to the target point to estimate the total length.\n4. Drilling and inserting the cannula for infusion\nUse an iodine scrub before performing the incision to prevent infection.\nMake a 3 cm incision on the scalp, using a scalpel under the stereotactic frame.\nSet up the frame for drill insertion by performing the adjustments prior to creating the access hole.\n\t\nRemove and replace the center guide tube with one that fits a 3.4 mm drill bit for drilling.",
    "Ensure that an assistant is present to hold the frame in place while the surgeon drills with a manual drill to add additional stability to the frame.\nLet the surgeon drill with a manual twist drill to create a 3.4 mm diameter burr hole.\nSet up the frame for the second drill insertion to widen the burr hole and avoid bony collisions that may alter the trajectory.\n\t\nSet up the drill with the 4.5 mm drill bit; replace the center guide tube with one that fits this bigger drill bit.\nCreate a 4.5 mm burr hole.\nPerform an MRI scan to ensure the targeting cannula has returned to the planned trajectory, as drilling through the frame can sometimes shift the cannula.\nPierce the dura with a sharp stylet.\nInsert the pre-primed frame-compatible infusion cannula. Ensure the cannula has a consistent neutral or positive back pressure to limit the introduction of air bubbles.\n\tNOTE: The software provides a specified depth to the planned target.\nMeasure the depth on the stereotactic frame-compatible infusion cannula and use the cannula-associated depth stop. This depth stop ensures that the cannula reaches the desired location and does not go beyond it. There is also a lock and dock assembly with an additional screw to ensure the cannula stays at the desired depth.\n5. Monitoring the infusion with repeated MRI scans\nPerform an MRI scan to assess the insertion of the cannula to the correct target location in the brain.\nStart the infusion of the desired agent as a co-infusion with a gadolinium-based contrast agent.",
    "NOTE: In this experiment, a 1 mM concentration of gadolinium-based contrast agent was used, but this may need to be adjusted based on the application. A total of 300 µL of infusion volume was administered at a rate of 10 µL/ min, although this may be varied as well.\nPerform an MRI scan at regular time intervals to monitor the infusion and volume of distribution of the cannula-inserted agent in the brain, which can be inferred due to the co-infusion of gadolinium.\n\tNOTE: A hyperintense area around the cannula tip indicates the presence of the gadolinium-based contrast agent.\nOnce infusion ends, stop the pump.\n\tNOTE: The infusion rate used in this study was 30 µL/ min, until the 300 µL volume of the cell suspension was completely infused.\nLet the cannula stay in the brain for 5 min following termination of the infusion prior to removing the cannula.\n\tNOTE: The infusion cannula is typically left in place for 5 min following the termination of the infusion to reduce backflow21,24.\nRemove the cannula manually through the frame.\nRemove the frame from the head by disassembling it in reverse order from how it was built.\nClose the incision with a running 3-0 or 4-0 monocryl suture.\nTurn off the isoflurane to prepare for recovery.\nExtubate the subject and allow the subject to recover under observation by the veterinary team."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}