{
  "id": 19504,
  "origin_website": "Jove",
  "title": "Optimizing the Setup and Conditions for Ex Vivo Electroretinogram to Study Retina Function in Small and Large Eyes",
  "procedures": [
    "All experiments using mice were conducted in accordance with the NIH Guide for the Care and Use of Laboratory Animals and were approved by the Institutional Animal Studies Committee at the University of Utah. Pig eyes for demonstration of this video were obtained postmortem from the slaughterhouse (Sustainable Swine Resources, Johnsonville). Eyes were obtained from human donors after brain or cardiac death with consent for research use through the Utah Lions Eye Bank, the San Diego Eye Bank or Lifesharing, which are fully accredited by the FDA, the Association of Organ Procurement Organizations (AOPO) and the Eye Banks of America Association. The use of human donor eyes had exempt status at the University of Utah (IRB no. 00106658) and ScrippsHealth IRB (IRB no. 16-6781).\n1. Setting up the ex vivo ERG\nTo convert a multielectrode array setup, connect the ex vivo ERG specimen holder via a head stage to a differential amplifier, which is plugged into the analog input of the interface board of the multielectrode array system. Use the recording software for the multielectrode array to record and store the input data from the ex vivo ERG. Set the gain of the differential amplifier to 100 and add an additional 10x voltage amplification depending on the digitizer specifications. Set the low pass filter to 100 Hz.\nTo convert a patch clamp setup, connect the ex vivo ERG specimen holder via a head stage to a differential amplifier, which is connected to the head stage of the patch clamp amplifier. Use the patch clamp system software and digitizer to record and store the input data from the ex vivo ERG. Set the gain of the differential amplifier to 100 and apply an additional 10x voltage amplification via the patch clamp head stage. Set the low pass filter to 100 Hz.",
    "Connect LEDs with the appropriate wavelengths (e.g., approximately 530 nm to elicit rod photoreceptor and ON-bipolar cell responses) to the microscope. Control the LEDs with recording software that enables the triggering of light stimuli. To control light stimuli, use an LED driver controlled by analog outputs from a digitizer.\nCalibrate the light output of the LEDs at the position of the retina in the specimen holder using a photodiode. If necessary, insert neutral density filters into the light path to dim the light intensity.\nUse a commercially available or custom built ex vivo ERG specimen holder.\n\tNOTE: Drawings for CNC machining from polycarbonate can be obtained from the authors upon request.\nTo prepare the electrode, insert an Ag/AgCl pellet electrode into a threaded luer connector. Fill the inside of the luer connector with hot glue and insert a 2 mm socket into the hot glue from the non-threaded side. Solder a silver wire of the EP1 electrode to the 2 mm socket. Screw the finished electrode, with an o-ring on the thread, into the electrode ports of the ex vivo ERG specimen holder.\n\t​NOTE: Electrodes can be used for a long time. If the pellet surface accumulates dirt and/or gets dark (this can cause high offset voltage and/or electrical drift), it can be \"polished\" using fine sandpaper.\nAt least 1 day prior to experimentation, glue filter papers onto the domes of the ex vivo ERG specimen holder using epoxy glue, ensuring that the glue does not obstruct the electrode channel (see 3 for video).\n2.  Animal preparation\nDark adapt animals for at least 6 h or overnight.\n3. Equipment preparation",
    "Fill the perfusion line of the ex vivo ERG with Ames' medium bubbled with 5% carbon dioxide and 95% oxygen. Connect the perfusion line to a heating element with a DC current source or heat controller near the specimen holder to warm the Ames' medium, so that the retina is kept at approximately 35-38 °C.\nFill both halves of the ex vivo ERG specimen holder with electrode solution, seal the perfusion line with luer stoppers, connect the electrodes, and assemble the specimen holder with four screws (see 3 for video).\nCheck the resistance and offset voltage between the electrodes in the assembled specimen holder by inserting the probes of the multimeter into the electrodes.\n\tNOTE: If there are no blockages, and electrodes are in good condition, the resistance should be below 100 kΩ and offset voltage below 5 mV.\nConnect the assembled specimen holder to the perfusion line and place onto the stage of a microscope set up to deliver light flashes. Ensure that the specimen holder and perfusion line do not contain any air bubbles.\n4. Tissue preparation\nSacrifice the animal with CO2 and immediately enucleate the eyes, or obtain large animal or human donor eyes.\nClean the globe of the remaining connective tissue and extraocular muscles. Trim off the optic nerve.\nOn filter paper, carefully place a small incision with a razor blade along the ora serrata, approximately 1 mm from the limbus in the mouse eye. Insert fine vannas scissors into the incision and cut along the limbus to remove the anterior portion of the eye with the lens.",
    "Move the eye cup into a dish containing Ames' medium. Grasp the sclera with fine forceps, taking care to not touch the retina. Insert vannas scissors between the retina and the sclera and cut the sclera from the peripheral toward the central part. Take care not to touch or damage the retina.\nImmobilize the sclera by holding one side of the incision with vannas scissors against the bottom of the dissection dish. Grasp the sclera with forceps on the other side of the incision. Remove the sclera without touching or damaging the retina by pulling apart the sclera on either side of the incision to allow isolation of the retina with minimal damage to the tissue.\nRemove the anterior segment with the lens from the fellow eye and store the eye cup at room temperature in Ames' solution bubbled with 5% carbon dioxide and 95% oxygen.\n\tNOTE: Functional light responses from eyes stored in this way can be obtained for several hours.\nIn large eyes, including human donor eyes, clean the globe of the remaining connective tissue and remove the anterior segment and lens, similarly to the procedure described for the mouse eye. Use a scalpel to make a cut approximately 3 mm from the limbus. Insert curved dissection scissors into the incision and cut along the limbus to remove the anterior portion of the eye with the lens. Obtain retinal specimens for ex vivo electroretinography with a 3-6 mm disposable biopsy punch.\n5. Mounting the tissue on the specimen holder\nPlace the lower half of the specimen holder into a large Petri dish and fill with oxygenated Ames' medium so the dome of the specimen holder is just submerged.",
    "Carefully grasp the edge of the retina with fine forceps and transfer the retina onto the dome of the ex vivo specimen holder, photoreceptor side facing up.\nLift the specimen holder from the Ames' solution, taking care that the retina stays in place.\nCompletely dry the plate of the specimen holder to minimize noise, electrical crosstalk, and signal shunting.\nAssemble both halves of the specimen holder with four screws and connect the perfusion line. Dry the electrode in the lower half of the specimen holder and connect the anode cable to the inner retinal side and the cathode cable to the photoreceptor side.\nPerfuse the specimen holder with at least 1 mL/min of oxygenated Ames' medium for 10-20 min to allow time for light responses to stabilize.\n6. Recording retinal neuronal cell function\nRecord response families by exposing the retina to light flashes of increasing intensity. For example, record mouse rod photoreceptor response families with light intensities ranging from approximately 10 to 1,000 photons/µm2 and those from mouse ON-bipolar cells with light intensities ranging from approximately 0.6 to 20 photons/µm2.\nMeasure photoreceptor light responses (a-wave) in the presence of 100 µM barium chloride, which blocks potassium channels in Müller glial cells, and 40 µM DL-AP4, which blocks glutamatergic signal transmission to ON-bipolar cells (Figure 2B).\nTo isolate the b-wave, which originates from the function of the ON-bipolar cells, first record combined light responses from both photoreceptor and ON-bipolar cells in the presence of barium chloride alone (Figure 2A). Then, perfuse for 5-10 min with Ames' medium containing barium chloride, as well as DL-AP4, and record photoreceptor responses to the same light stimuli as before (Figure 2B). Subtract photoreceptor responses from combined photoreceptor and ON-bipolar cell responses, thus calculating ON-bipolar cell light responses alone (Figure 2C).\n7. Optimizing ON-bipolar cell function",
    "NOTE: The b-wave, which originates from the ON-bipolar cells, is highly sensitive to the temperature in the specimen holder and the perfusion rate.\nMaintain a perfusion rate of at least 0.5 mL/min to obtain the b-wave.\n\tNOTE: A higher perfusion rate of 1-2 mL/min is preferable to maintain a large and stable response from ON-bipolar cells.\nEnsure that for a given perfusion rate, the temperature in the specimen holder near the retina is close to body temperature (i.e., approximately 35-38 °C).\n\tNOTE: It is important adjust the temperature of the perfusate, which is heated before it reaches the ex vivo ERG specimen holder, so that it is within the optimal temperature range at the retina.\nStore eye cups for later experimentation protected from light and in oxygenated Ames' medium at room temperature to maintain normal a- and b-waves for several hours.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}