{
  "id": 18497,
  "origin_website": "Jove",
  "title": "An Improved Method for Rapid Intubation of the Trachea in Mice",
  "procedures": [
    "The Institutional Animal Care and Use Committees (IACUC) at the University of Washington and Cedars-Sinai Medical Center have approved the animal work necessary for these studies.\n1. Preparation\nSterilize both the blunt end forceps and the depressor via autoclave.\nUsing a biological safety cabinet, prepare a working stock of BLM in PBS from the lyophilized powder.  Sonicate the solution for 10 min at 35 Khz to assure even mixing.\n\tNote: A total volume of between 30 and 45 µl is recommended to prevent pipetting variation on the low end, and suffocation with larger volumes.\nPrepare a clean workspace that includes approximately 1 m2 for the procedure itself, as well as designated locations for cages both before and after the procedure.\nFix the base of the procedure board to the bench immediately in front of the researcher by laying 2 or 3 strips of laboratory tape across the base and underlying bench. See Figure 1 for further specifications on creating a board.\nTie a single length of size 4.0 suture thread between the two positioning screws of the procedure board.\nGenerate a makeshift spirometer by removing and discarding the plunger from three 1 ml syringes, and depositing 60 µl of PBS into the top of each barrel to form an airtight seal. Secure the hub of the catheter loosely to one of the syringes and place it to one side of the board.\nAspirate 300 µl of air into a 1 ml syringe and place it to one side of the board.\nCut an additional piece of tape approximately 6 inches in length and place to one side. This will be used to secure the animal to the board in step 2.4.",
    "Set up an isoflurane chamber. Attach O2, isoflurane, and vacuum to the appropriate ports on both the exposure chamber and the clearance vacuum. Alternatively, administer anesthetic in an isoflurane-compatible biological safety cabinet.\n2. Intubation\nAnesthetize the mouse with isoflurane in the chamber until it loses consciousness and respiration slows to an appropriate rate. A typical exposure includes 4% isoflurane and 2% O2 for 3 to 4 min, and the ideal outcome is 2 to 2.5 min of sedation. This corresponds to a respiration rate of 1 breath every 2 sec.\nWhile waiting for sedation to set in, aspirate between 30 and 45 µl of BLM into a pipettor and place to one side.\nWhen ready, suspend the sedated mouse by its upper incisors from the thread attached to the positioning screws of the procedure platform. Make sure that the animal's dorsum lies flat against the platform surface.\nBeing careful not to restrict ventilation, place a piece of tape loosely across the lower (caudal) portion of the thoracic cavity, just above the diaphragm. Placement should be tight enough to maintain proper alignment during the procedure, but not so tight that it restricts respiration.\nTurn on the illuminator to between 80% and 100% intensity and orient the gooseneck so that it is 1 to 2 cm from the surface of the skin, near the solar plexus. Periodically check the tip of the gooseneck for heat to ensure that it does not injure the mouse.\nStanding behind the platform, use the sterile, blunt end forceps to locate the tongue. Being careful to avoid the lower incisors, gently grip and draw the tongue out of the oral cavity.",
    "Using the remaining hand, insert the depressor and use it to flatten the tongue against the floor of the oral cavity. Release the forceps, but leave the depressor in place for the next two steps.\nOrient the light so that the trachea is visible by guiding the gooseneck proximally from the level of the solar plexus until it reaches the level of the mainstem bronchi.\nNote: The trachea can be easily distinguished by the action of respiration, which causes the emitted light to fluctuate in intensity. When correctly positioned, this structure will be discernable in the axial plane as a centrally located pin of light with minimal ambient light in the oral cavity itself.\nAngle the syringe so that it follows the natural path of the trachea, and lower the 22-G catheter tip, with the attached syringe containing the droplet, straight into the lumen. The PBS bubble will begin to rise and fall with each breath upon successful placement.\nNote: This action may be delayed by several seconds as a result of deep sedation.\nFeed the catheter in an additional 5 mm. Remove the tongue depressor.\nShift the syringe to the opposite hand, and gripping the hub, gently remove the syringe.\nDeposit between 30 and 45 µl of BLM into the center of the interior of the catheter hub, attach the second syringe and dispense 300 µl of air into the hub.\nReplace the second syringe with the first containing the bubble of PBS. The bubble will continue to rise and fall if the procedure has been performed successfully.\n3. Post-procedural Care\nRemove the catheter and tape, and place the animal in a dry warm place until it regains consciousness - typically within a couple of minutes.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}