{
  "id": 18743,
  "origin_website": "Jove",
  "title": "Application of Biolayer Interferometry (BLI) for Studying Protein-Protein Interactions in Transcription",
  "procedures": [
    "1. Preparation of proteins\nUse a dialysis bag (with an appropriate cut-off size) to dialyze each protein to be used for BLI assays (including both the His-tagged ligand and the analyte) against 1,000 volumes of the BLI buffer (25 mM Tris-HCl, 150 mM NaCl, 0.1 mM EDTA, 10 mM MgCl2, 0.1 mM DTT, pH 8.0, pre-chilled to 4 ˚C) at 4 ˚C for 4 h.\n\tNOTE: BLI assays require the ligand to be present at concentrations that saturate the binding sites on the biosensor and the analyte to be highly purified so that the molar concentrations of the analyte that react with the ligand is known. Methodologies for the expression and purification of His- and Strep-tagged proteins are not covered here, but can be found in previous publications14,15. Although this system does not require the ligand to be in highly purified form, it is essential to dialyze even unpurified ligands to the BLI buffer in order to minimize shifts in white-light interference patterns caused by any buffer changes during the assay.\nSwitch to fresh BLI buffer and continue the dialysis for another 4 h.\n2. Biosensor hydration and assay set-up\nApproximately 10 min prior to the start of an assay, pipette 200 µL of the BLI buffer into a PCR tube.\nRemove a Ni-NTA-biosensor from the original packaging by holding the wide portion of the biosensor using a gloved hand.\nPlace the biosensor over the PCR-tube such that only the glass tip of the biosensor is submerged in the BLI buffer.\nKeep the biosensor tip submerged for at least 10 min to ensure full hydration.\n\t\nVerify that the glass tip of the Ni-NTA-biosensor does not touch anything other than the BLI buffer during the above step.",
    "NOTE: This protocol uses a Ni-NTA-biosensor in conjunction with a His-tagged ligand. If needed, a SA-Streptavidin-biosensor can be used in conjunction with a biotinylated ligand instead if: (i) both the ligand and analyte carry a His tag or (ii) neither of them does.\nTurn the BLItz machine on.\nEnsure that the machine is connected to the computer through a USB data output port at the back of the machine.\nOn the computer, open the associated software (e.g., BLItz Pro), and click on Advanced Kinetics on the left-hand side of the screen.\nOn the software, type out all appropriate information about the experiment (including the Experiment Name, Description, Sample ID, and Protein Concentration) under each respective heading.\nClick on Biosensor Type and choose Ni-NTA from the drop-down menu.\n\t\nUnder the Run Settings heading, verify that the Shaker is set to Enable.\nUnder the Step Type List heading, verify that there are 5 items listed: Initial Baseline, Loading, Baseline, Association, and Dissociation.\n\t\tNOTE: The duration of each step can be changed from default as needed. For optimal results, use a minimum of 30 s for Initial Baseline and Baseline; and 120 s for Association and Dissociation. The duration of the Loading step (ranging from 120 to 240 s) will depend upon the concentration of the ligand and affinity of the His-epitope tag on the ligand to the Ni-NTA-biosensor.\nRemove the hydrated Ni-NTA-biosensor from the PCR tube and affix it to the biosensor mount on the machine by sliding the wide portion of the biosensor onto the mount.\n\tNOTE: Do not let the biosensor dry out during the experiment.\nPlace a 0.5 mL black microcentrifuge tube into the tube holder of the machine and pipette 400 µL of the BLI buffer into it.",
    "Verify that the slider of the machine is positioned such that the tube holder is situated in front of the black arrow on the machine.\nClose the cover of the machine such that the biosensor tip becomes submerged in the buffer in the microcentrifuge tube.\nClick Next on the software to begin recording the Initial Baseline.\n3. Loading of ligand onto biosensor\nAfter the Initial Baseline step has finished recording, open the cover of the machine.\nMove the slider to the right such that the drop holder (instead of the tube holder) is situated in front of the black arrow.\nPipette 4 µL of a dialyzed His-tagged ligand (from Step 1.1) onto the drop holder and close the cover of the machine.\n\tNOTE: The optimal concentration of the ligand to be used may vary for each protein. A concentration between 1.0 to 2.0 mg/mL is usually adequate to saturate the NTA at the tip of the biosensor in 240 s.\nOn the software, click Next to begin Loading.\n4. Washing away additional ligand\nAfter the Loading step has finished recording, open the cover of the machine.\nMove the slider to the left such that the tube holder is once again situated in front of the black arrow.\nClose the lid of the machine and ensure that the biosensor tip is submerged into the BLI buffer of the tube in the tube holder.\nClick Next once again on the software to begin recording the Baseline.\n5. Association of analyte to ligand\nAfter the Baseline step has finished recording, open the cover of the machine.\nRemove the drop holder and clean it by pipetting out any protein and rinsing it with double-deionized water (ddH2O) for a total of 5 times.",
    "Use a tissue wipe to clean the surface of the drop holder after the wash.\nReplace the drop holder back onto the machine.\nMove the slider on the machine to the right such that the drop holder is once again situated in front of the black arrow.\nPipette 4 µL of a dialyzed analyte (from Step 1.1) onto the drop holder and close the cover of the machine.\nOn the software, click Next to begin Association.\n6. Dissociation of analyte from ligand\nAfter the Association step has finished recording, open the cover of the machine.\nMove the slider on the machine to the right such that the tube holder is once again situated in front of the black arrow.\nOn the software, click Next to begin Dissociation.\nAfter the Dissociation step has finished recording, open the cover of the machine.\nRemove the drop holder and tube holder.\nRinse both with ddH2O thoroughly to wash away any protein.\nRemove the biosensor and discard it safely.\n7. Repeating interactions with different concentrations\nRepeat Steps 2-7 for the same ligand-analyte pair using different analyte concentrations.\n\tNOTE: The concentration of the analyte may need to be adjusted across several runs before obtaining optimal results. In our experience, a ratio of 1:5:10 of analyte concentrations, starting with 75 nM, is usually adequate.\n8. Analyzing the data using the software\nOnce all runs have finished, save the data on the software by clicking File and then Save Experiment As on the left side of the screen.\nUnder the Run Data heading, select Step Correction and Fitting (1:1) and click Analyze to generate kinetic data.\nTo extract the quantitative data into a worksheet and generate graphs, click on Export to CSV and save the recorded data as a .csv file. Open the .csv file using spreadsheet software.",
    "To most effectively show the Association and Dissociation kinetics, remove all plot points prior to the Baseline step, and normalize all subsequent plot points from the final Baseline value.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}