{
  "id": 13293,
  "origin_website": "Jove",
  "title": "Controlled Cortical Impact Model of Mouse Brain Injury with Therapeutic Transplantation of Human Induced Pluripotent Stem Cell-Derived Neural Cells",
  "procedures": [
    "All experiments described in this protocol were reviewed and approved by the Uniformed Services University Animal Care and Use Committee. \n1. Craniectomy and controlled cortical impact\nPreparation of the controlled cortical impact device and surgical supplies.\n\t\nLoad a 1 mL slip-tip syringe with 0.5 mL of sterile saline for wound irrigation. Attach a 25 G needle to the syringe to control irrigation.\nPrepare a dilute solution of CsA in DMSO to final concentration of 1 mg/mL. Load a second 1 mL slip-tip syringe with 0.5 mL of cyclosporine A (CsA) solution for immunosuppression. Attach a 25 G needle or larger to the CsA syringe.\nAttach the controlled cortical impact piston to an arm on a stereotaxic frame and set to an angle of 15°. Attach a 3 mm impactor probe to the piston.\nSet the velocity of impact to 1.5 m/s and the impact dwell time to 0.1 s to produce a mild cortical injury.\nPerform a unilateral craniectomy\n\t\nPlace the mouse in an anesthesia induction chamber connected to an isoflurane vaporizer with compressed oxygen source. Induce anesthesia with ~3% isoflurane at ~0.7 L/min oxygen. Check for the depth of anesthesia by the lack of response to the toe-pinch.\nShave the scalp using electric clippers and wipe away any loose fur.\nPlace the mouse in a stereotaxic frame with attached anesthetic delivery nose cone. \n\t\t\nPlace a warming pad set to 37 °C on the stereotaxic frame under the mouse to maintain body temperature under anesthesia. Fix the head in place with ear bars and a bite bar and orient the head such that the skull frontal bone is horizontal. Maintain anesthesia at ~1.5%-2% isoflurane for the duration of the surgery.",
    "To perform preoperative care and aseptic surgical preparation, apply antibiotic ophthalmic ointment to the eyes using a sterile cotton swab. Apply an iodine-based solution to the shaved scalp area. Remove this with 70% ethanol. Cover the animal with a fenestrated surgical drape so that the top of the head is visible but the eyes are covered.\nMake a midline incision (1.5-2 cm) on the scalp using a scalpel or scissors.  Use sterile cotton swabs to clean the wound and to clear the fascia left of the midline at bregma.\nUse the impactor probe to identify the craniectomy site.\n\t\t\nSet the stereotaxic reference point (X = 0, Y = 0) to bregma.  Adjust the probe laterally to 2 mm left of the midline. Outline a 5 mm diameter circle around the probe using a fine-tip surgically safe marker. Raise and rotate the impactor out of position.\nUse the high-speed rotary micromotor kit hand tool to make an open hole in the skull using a round-tip 0.6 mm or 0.8 mm burr drill bit at ~70%-80% maximum speed. Apply light pressure to the skull while drilling along the 5 mm circumferential outline to thin this border.\n\t\t\nDo not apply excess pressure while drilling. This can cause cortical injury due to vibration, compression, or accidental penetration. Allow the speed of the drill bit to do the work.\nDo not drill in any given spot for too long to avoid excess friction heating of the skull. Irrigate the craniectomy occasionally with sterile saline to remove debris and to reduce heating from the rotary tool.\nPay close attention while drilling over the coronal suture line as these points are vulnerable to hemorrhage.",
    "Use a pair of fine tweezers to remove the skull flap when the craniectomy outline is sufficiently thinned. Grasp the flap medially, and gently lift and pull laterally with a radial motion.\n\t\t\nDo not to damage the dura mater when lifting the flap; this can cause severe injury and hemorrhaging.\nPerform a mild controlled cortical impact injury\n\t\nClean the impactor probe with a sterile alcohol prep pad. Move the impactor probe back into position over the exposed cortex. Lower the probe until it touches the dura mater surface. Mark this position as Z = 0.\nWithdraw the piston and move to Z = -1.0 mm. Discharge the piston to impact the cortex.  \nQuickly raise the piston and move the arm out of position. Apply generous amounts of saline to irrigate the cortex after injury. Rinse the surgery site with saline as needed and suture the scalp incision using simple interrupted stiches with 5.0 silk suture.  \nPerform postoperative care on the mouse\n\t\nDiscontinue anesthesia. Deliver CsA by subcutaneous injection into scruff at 10 mg/kg dose. Place the mouse in a clean and pre-warmed postoperative cage.\nProvide acetaminophen analgesic in the drinking water at 1.0 mg/mL.\n\t\tNOTE: Provide analgesia according to the appropriate IACUC standard operating procedure and in consideration of experimental outcome variables (e.g., sedation, neuroinflammation).\nProvide moistened chow food in a warmed recovery cage to aid in rehydration and recovery.\nProceed from section 2 to section 4 above when performing craniectomy-only (sham) controls.\n2. Stereotaxic transplantation of cell suspension\nBegin cell transplantation procedure roughly 24 h after craniectomy.\nPrepare the cell transplantation equipment and surgical supplies\n\t\nFill a 1 mL slip-tip syringe with sterile saline for wound irrigation. Attach a 25 G needle to the syringe to control irrigation.",
    "Fill a 1 mL slip-tip syringe with CsA solution for immunosuppression. Attach a 25 G needle or larger to the CsA syringe. Refill the CsA syringe as needed between surgeries.\nPrepare glass needles from 1.0 mm OD borosilicate glass capillary pipettes using standard methods. \nUse fine tweezers to break the needle tips to approximately a 200 µm diameter. Ensure that the cylindrical shaft of the needle is no longer than 2.5 cm.\nCalibrate the syringe pump for use with a 10 µL syringe.  Enter a flow rate of 0.2 µL/min to deliver a total volume of 2.0 µL.\nPrepare human induced pluripotent stem cell (iPSC) suspension.\n\t\nPerform all cell handling in a cell culture BSL-2 hood using standard sterile handling techniques.\nPrepare cell cultures in advance according to standard conditions defined for the cell type. Refer to Lischka et al.17 as an example.\n\t\tNOTE: Experiments shown in this demonstration used various neural phenotype cells derived from hiPSCs.\nGently dissociate the cells into a single-cell suspension using a cell detachment solution, or other preferred enzymatic or chemical means.  \nCount cells in suspension, then dilute the suspension to 5 x 104 cells/µL in minimal cell culture medium (e.g., DMEM) in a 1.7 mL flip top test tube.  \nObserve the following notes for transplantation:\n\t\t\nMaintain the cells in suspension at 37 °C for the duration of procedures.  \nLoad the syringe only immediately prior to performing intraparenchymal injection (step 4.5 below).\n\t\t\tNOTE: Gravity can cause the cell suspension to settle or to cling to the side of the syringe if laid on its side. This leads to irregularities in the number of cells injected.\nAllot ~5 x 105 cells (10 µL suspension) per mouse if performing multiple cell transplantation procedures in one day.\nPerform stereotaxic transplantation surgery",
    "Place the mouse in an anesthesia induction chamber connected to an isoflurane vaporizer with compressed oxygen source. Induce anesthesia with ~3% isoflurane at ~0.7 L/min oxygen.\nPlace the mouse in a stereotaxic frame with attached anesthetic nose cone.  \n\t\t\nFix the head in place with ear bars and a bite bar and orient the head such that the skull frontal bone is horizontal. Maintain anesthesia at ~1.5%-2% isoflurane for the duration of the surgery.\nPerform preoperative care and aseptic preparation\n\t\t\nApply hydrating ophthalmic ointment containing antibiotic to eyes using a cotton swab.  \nLavage the incision site with sterile saline to clean the site and to loosen sutures. Gently apply 70% ethanol with a cotton swab to sterilize the incision site.\nRemove sutures using fine tweezers and ophthalmic scissors. Irrigate surgery site and craniectomy with abundant sterile saline.\n\t\t\nConsider the animal for exclusion if the cortex displays disqualifying characteristics including excessive herniation, discoloration, disrupted vascularization, or hemorrhage.\nLoad the cell transplant syringe\n\t\t\nMove cell suspension from the 37 °C incubator to a cell culture biosafety hood. Gently swirl or tap the tube to ensure a homogeneous cell suspension.\nUse a micro pipettor to load ~7.5 µL cell suspension into the Hamilton syringe through the plunger end.  \n\t\t\t\nHold the syringe at a ~120° angle with the plunger end facing down. Insert the plunger, taking care not to introduce an air bubble between the suspension and plunger tip.\nAttach the gasket assembly to the pipette needle, then attach the needle to the syringe.\nPush the plunger to move cell suspension into the pipette needle.  If there is resistance against suspension outflow, use fine tweezers to break the needle tip to enlarge the diameter.\nAttach the syringe to the stereotaxic syringe pump.  Advance the plunger to make sure the syringe pump assembly is working properly.",
    "Move the needle into the coordinates for injection.\n\t\t\nAlign the needle tip to bregma. Set the X and Y coordinates to 0. Then move the needle tip over the craniectomy to 2.0 mm lateral and -1.0 mm posterior to bregma.  Touch the needle tip to the dura mater surface and set the stereotaxic coordinate to Z = 0. \nPush the plunger to ensure the cell suspension is flowing adequately before introducing the needle into the brain.\nIntroduce the needle into the brain to a depth of Z = -1.4 mm. These stereotaxic coordinates place the graft at the gray matter-white matter border of the deep cortex20. \nStart the syringe pump to infuse cell suspension. Set the lab bench timer to 15 min and start the timer. Use a long working distance microscope to monitor cell suspension outflow.\n\t\t\nIrrigate the surgery site with sterile saline during injection to maintain tissue hydration.\nAt 15 min, slowly withdraw the transplantation needle.  Irrigate the surgery site with saline and close the incision with sutures.  \nPerform postoperative care\n\t\t\nDiscontinue anesthesia. Deliver CsA by subcutaneous injection into scruff at 10 mg/kg dose. Place the mouse in a clean and pre-warmed postoperative cage.\nProvide acetaminophen analgesic in the drinking water at 1.0 mg/mL.\n\t\t\tNOTE: Provide analgesia according to the appropriate IACUC standard operating protocol (SOP) and in consideration of experimental outcome variables.\nProvide moistened chow food recovery cage to aid in rehydration and recovery.\nContinue daily CsA injections at 10 mg/kg throughout the survival duration of the mouse.\n3. Adhesive tape removal test of sensorimotor integration\nCut the electrical tape into 3 mm x 5 mm strips using a small razor knife prior to performing the behavior test. Use a smooth glass surface for cutting the adhesive strips.",
    "NOTE: Use yellow and red tape, as mice have difficulty distinguishing between these colors21.\n\t\nSelect a small mirror that fits well inside the clear plastic box.  \n\t\t\nFix the mirror in place at a roughly 45° angle with modeling clay or adhesive tape in order to view animal behavior from below.  \nPlace the box and mirror assembly on a bench in a quiet dedicated behavior testing room.  Arrange the cylinder on the plastic box above the mirror.\nArrange the handling cloth, tweezers, and adhesive strips on the bench next to the behavior testing box.\nClean the box and cylinder with 70% ethanol and paper towels.  Allow surfaces to dry thoroughly.\nBring the mice into the behavior testing room. Allow the mice to acclimate to the testing room for at least 30 min prior to behavior testing.  \nRemove water supplies from the cages to minimize urination events during testing, which can interfere with efficient test performance.\nPerform the adhesive removal test\n\tNOTE: This behavior test is best performed by two to three investigators: one to operate the stopwatches, and one or two to handle the mice and observe the behavior.\n\t\nUse each tweezer to peel one adhesive strip of each color.  \n\t\t\nChoose which strip color corresponds to which forepaw and remain consistent throughout the trial.\nUse the handling cloth to restrain a mouse by the scruff of the neck and back such that the mouse holds the forepaws away from its body and head.\nUse tweezers to place an adhesive strip on the plantar surface of each forepaw. Use delicate and consistent finger pressure to secure the strips to the paws.\nQuickly place the mouse into the plastic cylinder. Start the two stopwatches when the mouse has all four paws on the plastic box.",
    "Use the two stopwatches to record the latencies for the following four events: left paw notice, left paw removal, right paw notice, right paw removal.\n\t\t\nRecord a notice event when the animal makes unambiguous recognition of the adhesive strip by shaking or flinching the paw or biting the strip.\nRecord a remove event when the animal effectively removes the strip from the forepaw plantar surface.  \n\t\t\tNOTE: The remove event is not disqualified by strip readherence or if the strip clings to the lateral surface of the forepaw.\nStop the timer at 120 s if the corresponding strip has not been removed. \nRecord the elapsed times for the four events on the data sheet.\nPerform a second trial on each mouse\n\t\t\nAllow a minimum of 5 min to elapse between trials for an individual mouse to reduce stress, which can interfere with efficient performance on the test.\nClean the apparatus with paper towels between testing mice to remove waste when testing multiple mice from a single cage.  \n\t\t\t\nClean the apparatus thoroughly with 70% ethanol and paper towels when testing mice from multiple cages.\nReverse the color-paw placement order for the second trial of the session to randomize any effect of color.\nCalculate the average latency of each event between two trials per daily session for each animal.\nClean the apparatus and handling cloth thoroughly with water, replace the cage water supplies, and return the mice to their holding facility.\nRepeat steps 3.1-3.2 on successive experimental timepoints for a repeated measures trial design.\n\tNOTE: Repeat steps 3.2.1-3.2.5.3 daily for 5 days prior to any data collection to acclimate the animals to the task. Baseline data acquisition prior to surgery is recommended.\n4. Diaminobenzidine (DAB) immunohistochemical analysis of graft survival and injury pathology\nEuthanize the animals and perform a transcardial perfusion.",
    "Prepare solutions of 0.1 M phosphate-buffered saline (PBS) and 4% paraformaldehyde (PFA) in PBS. Balance the pH of both solutions to 7.4.\nPlace the two solutions on ice in a fume hood. Place a peristaltic pump in the fume hood, and run the pump to fill the tubing with PBS. Set the pump flow rate to ~7 ml/min.  Connect a 25 G needle to the outflow tube of the pump.\nPlace a drainage tray with a soft substrate in the hood. Raise one end of the tray at a slight angle so that perfusion fluids drain to the lower end.\nPlace a mouse in an anesthesia induction chamber. Fill the chamber with 4% isoflurane using compressed 100% oxygen vehicle gas.\nMove the anesthetized mouse from the chamber to an anesthesia nose cone. Decrease the isoflurane to 2%.\nPerform a thoracotomy to expose the heart. Discontinue anesthesia, as the thoracotomy causes euthanasia.\nCarefully place the perfusion pump outflow needle in the left ventricle along the long axis of the heart. Do not pierce the heart septum, as this will cause poor perfusion.\nUse small scissors to cut the right atrium, then immediately turn on the peristaltic pump.\nContinue the PBS flow until the fluid leaving the right atrium runs clear of blood.\n\t\t\nTurn off the pump. Move the pump intake tube to the container of PFA. Restart the pump. Continue perfusing PFA until either the animal is sufficiently rigid or until a 20 mL volume has been pumped through.\nTurn off the pump. Remove the outflow needle from the heart. Move the intake tube from the PFA to the PBS, and thoroughly flush out PFA from the tubing.",
    "Remove the brain from the skull by careful dissection. Place the brain in a small container filled with 4% paraformaldehyde, and allow the brain to post-fix overnight at 4 °C.\nOn the day after post-fixation, replace the P with PBS and 0.1% sodium azide. Store the brains in this solution until preparation for histologic sectioning.\nCollect 40-50 µm sections of formaldehyde-fixed brain tissue via a freezing microtome or room temperature vibratome.\nPretreat tissues in 0.3% hydrogen peroxide in water to inactivate endogenous peroxidases, which can produce nonspecific staining.\nPerform antigen retrieval using citric acid buffer (10 mM sodium citrate, 0.05% polysorbate-20, pH 6.0) at 60 °C for 30 min.\nPerform antibody labeling by standard methods.  Refer to Lundell et al.’s report22 from this laboratory for more details.\n\t\nUse a mouse IgG neutralization kit (see Table of Materials) to reduce cross-reactivity with endogenous antibodies. Incubate the tissues in IgG neutralization buffer for at least 1 h at room temperature (RT), following the manufacturer’s directions.\nUse a mouse anti-human nuclear antigen primary antibody (hNA; 1:500 dilution) when transplanting human iPSC-derived cells to locate the transplanted cells. Incubate tissues with the primary antibody at 4 °C for 48-72 h using gentle agitation.\nAfter rinsing away primary antibody solution, incubate tissues with HRP-conjugated anti-mouse secondary antibody at 1:250 dilution for 2 h at RT.\nPerform DAB chromogen reaction by standard methods to reveal immunolabeling. Allow DAB reaction to develop for 5 to 10 min at RT.\nAttach stained tissues to slides and apply cover slips using standard methods.\nQuantify numbers of labeled cells using unbiased stereology as described previously23,24. Perform analysis using 20 µm optical sections and a between section interval of three.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}